{
    "cik": "1000230",
    "company": "OPTICAL CABLE CORP",
    "filing_type": "10-K",
    "filing_date": "2023-12-20",
    "period_of_report": "2023-10-31",
    "sic": "3357",
    "state_of_inc": "VA",
    "state_location": "VA",
    "fiscal_year_end": "1031",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1000230/0001437749-23-034978-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1000230/000143774923034978/occ20231031_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1000230/0001437749-23-034978.txt",
    "filename": "1000230_10K_2023_0001437749-23-034978.htm",
    "content": "Item 1.\nBUSINESS\nOverview\nOptical Cable Corporation was incorporated in the Commonwealth of Virginia in 1983. We are headquartered at 5290 Concourse Drive, Roanoke, Virginia 24019 and our telephone number is (540) 265-0690. Optical Cable Corporation, together with our wholly owned subsidiaries, Applied Optical Systems, Inc. (AOS) and Centric Solutions LLC (Centric Solutions), has offices, manufacturing and warehouse facilities located in Roanoke, Virginia, near Asheville, North Carolina and near Dallas, Texas.\nOptical Cable Corporation and its subsidiaries (collectively, the Company or OCC®) is a leading manufacturer of a broad range of fiber optic and copper data communication cabling and connectivity solutions primarily for the enterprise market and various harsh environment and specialty markets (collectively, the non-carrier markets), and also the wireless carrier market, offering integrated suites of high quality products which operate as a system solution or seamlessly integrate with other components.\nOCCs product offerings include designs for uses ranging from enterprise networks, data centers, residential, campus and Passive Optical LAN (POL) installations to customized products for specialty applications and harsh environments, including military, industrial, mining, petrochemical, renewable energy and broadcast applications, and for the wireless carrier market.\nOCC products include fiber optic and copper cabling, hybrid cabling (which includes fiber optic and copper elements in a single cable), fiber optic and copper connectors, specialty fiber optic, copper and hybrid connectors, fiber optic and copper patch cords, pre-terminated fiber optic and copper cable assemblies, racks, cabinets, datacom enclosures, patch panels, face plates, multimedia boxes, fiber optic reels and accessories and other cable and connectivity management accessories, and are designed to meet the most demanding needs of end-users, delivering a high degree of reliability and outstanding performance characteristics.\nThe OCC team seeks to provide top-tier integrated communication solutions by bundling all of our fiber optic and copper data communication product offerings into systems that are best suited for individual data communication needs and application requirements of our customers and the end-users of our systems.\nOCC® is internationally recognized for pioneering the design and production of fiber optic cables for the most demanding military field applications, as well as of fiber optic cables suitable for both indoor and outdoor use, and creating a broad product offering built on the evolution of these fundamental technologies. OCC® is also internationally recognized for pioneering the development of innovative copper connectivity technology and designs used to meet industry copper connectivity data communications standards.\nOCC primarily manufactures its fiber optic cables at its ISO 9001:2015 registered and MIL-STD-790G certified facility located in Roanoke, Virginia, primarily manufactures its enterprise connectivity products at its ISO 9001:2015 registered facility located near Asheville, North Carolina, and primarily manufactures its harsh environment and specialty connectivity products at its ISO 9001:2015 registered and MIL-STD-790G certified facility located near Dallas, Texas.\nOCC designs, develops and manufactures fiber optic and hybrid cables for a broad range of enterprise, harsh environment, wireless carrier and other specialty markets and applications. We refer to these products as our fiber optic cable offering. OCC designs, develops and manufactures fiber and copper connectivity products for the enterprise market, including a broad range of enterprise and residential applications. We refer to these products as our enterprise connectivity product offering. OCC designs, develops and manufactures a broad range of specialty fiber optic connectors and connectivity solutions principally for use in military, harsh environment and other specialty applications. We refer to these products as our harsh environment and specialty connectivity product offering.\nOCC markets and sells our harsh environment and specialty connectivity product offering through AOS under the names Optical Cable Corporation and OCC® by the efforts of our integrated OCC sales team.\nOCCs wholly owned subsidiary Centric Solutions LLC (Centric Solutions) provides cabling and connectivity solutions for the data center market. Centric Solutions business is located at OCCs facility near Dallas, Texas.\nOptical Cable Corporation, OCC®, Procyon®, Superior Modular Products™, SMP Data Communications™, Applied Optical Systems™, Centric Solutions™, and associated logos are trademarks of Optical Cable Corporation.\nProducts\nOCC® is a leading manufacturer of a broad range of fiber optic and copper data communication cabling and connectivity solutions primarily for the enterprise market and various harsh environment and specialty markets (the non-carrier markets), offering an integrated suite of high quality, warranted products which operate as a system solution or seamlessly integrate with other components. OCC also manufactures and sells products in the wireless carrier market. OCCs product offerings include designs for uses ranging from enterprise networks, data centers, residential, campus and Passive Optical LAN (POL) installations to customized products for harsh environments and specialty applications, including military, industrial, mining, petrochemical, renewable energy, and broadcast applications, as well as the wireless carrier market.\nOCC products include fiber optic and copper cabling, hybrid cabling (which includes fiber optic and copper elements in a single cable), fiber optic and copper connectors, specialty fiber optic, copper and hybrid connectors, fiber optic and copper patch cords, pre-terminated fiber optic and copper cable assemblies, racks, cabinets, datacom enclosures, fiber optic and copper patch panels, face plates, multimedia boxes, fiber optic reels and accessories and other cable and connectivity management accessories. Our products are designed to meet the most demanding needs of end-users, delivering a high degree of reliability and outstanding performance characteristics. During the past five years, OCC has been granted 20 patents for innovative designs of fiber optic and copper connectivity and fiber optic cable.\nOur fiber optic and copper cabling and connectivity products and solutions (predominantly passive, rather than active systems) are used for transmission of data, video, radio frequency and voice communications primarily over short- to moderate-distances.\nFiber Optic Cable Products\nWe design, manufacture, market and sell a broad array of top-tier fiber optic and hybrid cables that provide high bandwidth transmission of data, video and voice communications primarily over short- to moderate-distances.\nOCC is internationally recognized for pioneering the design and production of fiber optic cables for the most demanding military field applications, as well as fiber optic cables suitable for both indoor and outdoor use, and for creating a broad product offering built on the evolution of these fundamental technologies.\nOur product line is diverse and versatile, in keeping with evolving application needs of customers within our markets. Our tight-buffered fiber optic cables address a wide range of needs, primarily for the enterprise market and various harsh environment and specialty markets (the non-carrier markets), ranging from enterprise networks, data centers, residential, campus and Passive Optical LAN (POL) installations, as well as the needs for the harsh environment and specialty markets including military, industrial, mining, petrochemical, renewable energy, and broadcast applications. OCC also manufactures and sells fiber optic cable and hybrid cable (fiber and copper) products in the wireless carrier market. Our patented tight-buffered fiber unit cables have both high fiber-count and rugged performance in a compact and lightweight design. We believe that we offer one of the most comprehensive tight-buffered fiber optic cable product offerings for our markets.\nWe produce fiber optic cables for specialized installations, including various hybrid cables (fiber and copper), and cables with specialty fibers. We offer certain of our tight-buffered fiber optic cables pre-installed in conduit (FIC), for installation time reduction. We can armor fiber optic cables for additional protection in certain installations, providing both steel tape and interlocking armor options. We offer cables suitable for underground or overhead installations. For overhead installations, we offer several self-supporting fiber optic cables including both Figure-8 and round messenger construction. We have fiber optic cables available in various flammability ratings. We offer cables combining different types of optical fiber and/or copper wires, with copper wires being used as power feeds. Our hybrid cables include a line of security cables which combine copper power feeds with optical fiber in the cables making them particularly well suited for surveillance cameras and other specialty applications. We also design and manufacture specialty fiber optic cables, such as for use in Fiber-to-the-Antenna (FTTA) products for cell tower build-outs, military ground tactical, industrial (including tray cables), mining, deployable broadcast, oil and gas, festoon, pierside and high-density data center applications. Our product offering further includes fiber optic cables complying with or certified to various standards for specialty applications, such as: U.S. Department of Defense MIL-PRF-85045/8B; Det Norske Veritas (DNV) type approval certificate for marine shipboard and offshore platform applications; U.S. Mine Safety and Health Administration (MSHA) approval for use in mines; and American Bureau of Shipping (ABS) type approved cables. We also offer our customers a variety of customized constructions to meet their specific communication needs.\nCopper Datacom Cable Products\nWe market and sell a wide range of high quality copper datacom cables, including unshielded twisted pair (UTP) and shielded twisted pair (F/UTP) constructions, in Category 5e, Category 6 and Category 6A performance ratings, in riser and plenum configurations, and in various colors. The addition of copper datacom cables enables OCC to offer our customers an end-to-end solution for copper network installations.\nFiber Optic and Copper Enterprise Connectivity Products\nWe design, manufacture, market and sell innovative top-tier fiber optic and copper connectivity components for use in a broad range of enterprise, residential, military and harsh environment applications. We are internationally recognized for our role in establishing copper connectivity data communication standards, through our innovative technologies, and recognized for our support and contributions to North American fiber optic cable standards through the Insulated Cable Engineers Association.\nThe following summarizes the major types of fiber optic and copper enterprise connectivity products and their attributes; however, we produce many other types of connectivity products as well:\nFiber Optic Connectivity Products. Our fiber optic connectivity products provide customers a comprehensive line of fiber optic system solutions for equipment rooms, telecommunications closets, industrial installations, data centers and workstations, including unique infrastructure and cabling solutions for Passive Optical LAN (POL) installations. Our product offering includes fiber optic wall mount, cabinet mount and rack mount enclosures, NEMA enclosures, pre-terminated fiber optic enclosures, fiber optic connectors, splice trays, fiber optic jumpers, plug and play cassette modules, pre-terminated fiber optic cable assemblies, adapters, and accessories.\nCopper Connectivity Products. OCCs copper enterprise connectivity products offer customers a comprehensive line of copper system solutions and a line of component compliant products necessary for high speed data and voice applications in equipment rooms, telecommunications closets, data centers and workstations. Our product offering includes: category compliant patch panels, jacks (standard keystone or proprietary bezel configuration), plugs, patch cords, faceplates, surface mounted boxes, distribution and multimedia boxes, copper rack mount and wall mount enclosures, cable assemblies, cable organizers, and other wiring products. OCC provides products compliant with Category 5e, Category 6 and Category 6A standards in both shielded and unshielded offerings. OCC also manufactures industry recognized Category 8 test qualification fixtures, and offers Category 8 plugs based on OCCs patented technologies. OCC pioneered the required technology for high performance RJ45 connectivity applications to Ethernet, holding multiple patents for electrical performance and usability features.\nCabinets, Racks and Enclosures. We offer a wide array of high-performance network, data storage and telecommunications management systems for enterprise and residential use. Our product line includes wall mount enclosures, horizontal and vertical cable management systems and open frame relay racks. These products meet the demands of various network segments. Our products serve the equipment, cross-connect and termination needs for copper and fiber optic multimedia applications as well as wall mount and space saving UL listed ceiling mount enclosures for Passive Optical LANs.\nResidential Products. Our product offering includes a comprehensive line of datacom wiring products comprised of various enclosures, modules and modular outlets designed for single dwelling and multiple dwelling residential use. By utilizing our products, customers obtain a convenient method for networking, customizing, distributing and managing services in the home including voice, data, video, audio and security.\nHarsh Environment and Specialty Connectivity Products\nIn addition to our fiber optic and copper enterprise connectivity products described above, we design, manufacture, market and sell specialty fiber optic connectors and connectivity components, certain ruggedized copper datacom connectors, and related deployable systems and solutions for military, other harsh environment and specialty applications. For deployable applications, we manufacture a full range of tactical fiber optic connectors that conform to U.S. Department of Defense standards, such as MIL-PRF-29504, MIL-DTL-83522, MIL-DTL-83526, NAVSEA 7379171, and NAVSEA 7379172. In addition to military specified products, we also manufacture commercial grade versions of cylindrical connector products including EZ-MATE™, MHC®-T2, MHC®-T3 and F-LINK™. Many of our products utilize a hermaphroditic design that allows for concatenation of assemblies without regard to connector gender. This design allows for quick and easy deployment and retrieval. To provide more comprehensive interconnect solutions, we designed and developed a complete family of lightweight reels, lightweight reel stands and accessories. Our patented lightweight reels and lightweight reel stands are approved for use by the United States military. We manufacture cylindrical connector product for fixed fiber optic or applications requiring optical fiber and copper connections in the same connector. We fabricate a wide variety of simplex, duplex and multi-channel fiber optic assemblies for uses as varied as mining, oil & gas, petrochemical, renewable energy, broadcast, industrial and military applications. Our product offering also includes ruggedized RJ45 connectors.\nDistribution Methods of Products and Services\nOur products are sold to major distributors, regional distributors, various specialty and smaller distributors, original equipment manufacturers, value-added resellers, and, in certain cases, end-users. Generally, our products are purchased from our customers by contractors, system integrators and end-users.\nCompetitive Business Conditions, Positions in the Industry and Methods of Competition\nThe fiber optic and copper data communications cables and connectivity enterprise markets and other short- to moderate-distance markets are highly competitive. Our fiber optic cable product lines compete with products of large fiber optic cable manufacturers such as Corning Incorporated, Berk-Tek Cable (part of Leviton Manufacturing Co., Inc.), CommScope Holding Company, Inc., OFS Fitel, LLC (part of the Furukawa Electric Company), AFL (a subsidiary of Fujikura Ltd.), Hitachi Cable America Inc., Belden Inc., Prysmian Group (including General Cable), and others, some of which manufacture optical fiber. Our copper cable product lines compete with products of large copper cable manufacturers such as Prysmian Group (including General Cable), Belden Inc., Berk-Tek Cable (part of Leviton Manufacturing Co., Inc.), CommScope Holding Company, Inc., Hitachi Cable America Inc., Superior Essex (part of LS Cable & System) and others. Our fiber optic and copper connectivity product lines compete with products of large fiber optic and copper connectivity manufacturers such as CommScope Holding Company, Inc., Corning Incorporated, Leviton Manufacturing Co., Inc., Legrand S.A. (including Ortronics), Panduit Corp. and others. Our harsh environment and specialty connectivity product lines compete with products of Amphenol Corporation (including AFSI), Aptiv PLC (formerly Delphi Connection Systems), Stran Technologies and others.\nSome of our competitors are more established, benefit from greater market recognition and have much greater financial, research and development, production and marketing resources than we do. Competition could increase if new companies enter the market or if existing competitors expand their product lines.\nCompliance with Government Laws and Regulations\nWe are not aware of any material violations at our facilities of any local, state or federal government laws and regulations. We have not incurred any material expenditures related to compliance with government laws and regulations during our 2023 fiscal year, other than those in the ordinary course of business. We believe that we have materially complied with all applicable government laws and regulations.\nCustomers and End-Users\nWe have a global customer base, selling in approximately 50 countries in fiscal year 2023.\nOur products are sold to major distributors, regional distributors, various specialty and smaller distributors, original equipment manufacturers, value-added resellers, and, in certain cases, end-users. Generally, our products are purchased from our customers by contractors, system integrators and end-users.\nThe following is a partial list of representative types of end-users of our fiber optic and copper connectivity and cable products:\nCommercial Institutions. Businesses located in offices, retail space, hospitals and other medical facilities, to name a few, are installing or improving networks to distribute increasing volumes of data. These businesses often use high performance local area networks (LANs) or data centers.\nGovernment Agencies. Government agencies tend to have large buildings or complexes, many people, and the need to access and process large quantities of data. Like commercial institutions, these routinely include high performance LANs or data centers. Security also may be desired, making our cabling and connectivity solutions a logical choice.\nIndustrial and Manufacturing Facilities. Industrial and manufacturing facilities typically have a more severe environment (often with heavy electrical equipment) than other types of businesses. Our fiber optic cable and connectivity products in these environments offer ruggedness, immunity to electrical noise, high information carrying capacity and greater distance capability. Such facilities also have need for our copper cabling and connectivity products. Our products are installed in automotive assembly plants, steel plants, chemical and drug facilities, petrochemical facilities and petroleum refineries, mines and other similar environments.\nCable Assembly Houses. Cable assembly houses typically manufacture cable assemblies, which are short lengths of cable pre-terminated with connectors. Supporting virtually all segments of the market, these manufacturers use cables and connectivity products. Products sold to customers in this market sometimes may be privately labeled.\nMilitary. Our core fiber optic cable technologies enable us to develop and efficiently produce fiber optic cables for military tactical applications that survive extreme mechanical and environmental conditions. We are certified by the United States Department of Defense (U.S. DoD) as a qualified supplier of ground tactical fiber optic cable. Both our Roanoke and Dallas manufacturing facilities have also been certified by the U.S. DoD as MIL-STD-790G facilities, one of the most respected certifications in the defense industry. We also supply the U.S. DoD with tactical fiber optic cable assemblies, which we sell as fiber optic cables connectorized with qualified military connectors, which can include assemblies on military reels and reel stands ready for deployment.\nEducational Institutions. Colleges, universities, high schools and grade schools are installing and improving their networks for higher data transmission speeds, as well as using data communications solutions to support interactive learning systems.\nWireless Carriers. We design and manufacture various specialty fiber optic and hybrid (fiber and copper) cables for FTTA applications such as cell phone tower build-outs and upgrades.\nOriginal Equipment Manufacturers. We private label a number of our products for certain customers and other major manufacturers, including competitors.\nOur extensive technology base and versatile manufacturing processes enable us to respond to diverse customer needs.\nEmployees and Human Capital Resources\nAs of October 31, 2023, we employed a total of 327 persons (excluding independent sales representatives and firms). Our employees are all located in the United States and are not represented by unions. We have experienced no work stoppages and we continue to take steps we believe appropriate to ensure our employee relations are good.\nWe continue to monitor our demand for skilled and unskilled labor and provide training and competitive compensation packages in an effort to attract and retain skilled employees. We believe our employees are key to achieving our business goals and growth strategy. Our human capital measures and objectives focus on safety of our employees, employee benefits and employee development and training. All of our employees are at-will employees, which means that each employee can terminate his or her relationship with us and we can terminate our relationship with him or her at any time.\nWe have experienced, and could continue to experience, some difficulty in identifying and hiring skilled labor, particularly in manufacturing, as a result of macroeconomic labor trends, as well as other related factors. These concerns have decreased the pool of available qualified talent for certain functions. As a result, we have made and continue to make strong efforts to recruit qualified talent. While we believe our compensation and benefits offerings position us for success against a limited labor pool, we continue to be mindful of the labor shortages and are committed to being competitive to retain the best talent possible.\nSeasonality\nWe typically expect net sales to be relatively lower in the first half of each fiscal year and relatively higher in the second half of each fiscal year, and excluding other volatility, we would normally expect 48% of total net sales to occur during the first half of a fiscal year and 52% of total net sales to occur during the second half of a fiscal year. We believe this historical seasonality pattern is generally indicative of an overall trend and reflective of the buying patterns and budgetary cycles of our customers. However, this pattern may be altered during any quarter or year by the quarterly and annual volatility of orders received for the wireless carrier market, the timing of larger projects, timing of orders from larger customers, other economic factors impacting our industry or impacting the industries of our customers and end-users, and various macroeconomic conditions. We did not experience our typical seasonality pattern in fiscal year 2023 and believe this is the result of softening in certain markets, combined with the reduction in our backlog during the first two quarters of the fiscal year. Additionally, we experienced a decrease in production and shipping days of approximately seven days during the third quarter of fiscal 2023 resulting from a shutdown related to a cyber incident. While we believe seasonality may be a factor that impacts our quarterly net sales results, particularly when excluding the volatility of sales in the wireless carrier market, we are not able to reliably predict net sales based on seasonality because these other factors can also substantially impact our net sales patterns and volatility during the year. Our trend for the last three fiscal years has been that an average of approximately 53%, 46% and 47% of our total net sales occurred during the first half of fiscal years 2023, 2022 and 2021, respectively, and an average of approximately 47%, 54% and 53% of our total net sales occurred during the second half of fiscal years 2023, 2022 and 2021, respectively. Item 1A.\nRISK FACTORS\nItem 1A. Risk Factors is not a required disclosure for a smaller reporting company as defined in Rule 12b-2 promulgated under the Securities Exchange Act of 1934, as amended.\nCertain risk factors that may adversely affect the Company, the Companys future results of operations and future financial condition, and future market valuation of the Company are mentioned under Forward-Looking Information included in Managements Discussion and Analysis of Financial Condition and Results of Operations in the Companys Annual Report for the fiscal year ended October 31, 2023 (filed as Exhibit 13.1 to this report on Form 10-K), and in our Quarterly Reports on Form 10-Q. Item 1B.\nUNRESOLVED STAFF COMMENTS\nNone. Item 2.\nPROPERTIES\nWe own our facility located in Roanoke County, Virginia, and the land on which our Roanoke facility is located. Our Roanoke facility primarily houses our corporate headquarters, our administrative offices, our fiber optic cable manufacturing operations, our fiber optic cable product development function and our fiber optic cable warehouse. Our Roanoke facility is situated on approximately 23 acres of land (of which 11 acres is currently unused) located near the Roanoke-Blacksburg Regional Airport in Roanoke, Virginia, interstate I-81, and major trucking company facilities. Our Roanoke facility building is approximately 146,000 square feet.\nWe own our facility near Asheville, North Carolina (in Swannanoa, North Carolina) and the land on which our Asheville facility is located. Our Asheville facility primarily houses administrative offices, our enterprise connectivity manufacturing operations, our enterprise connectivity product development function and our enterprise connectivity warehouse. Our Asheville facility is situated on approximately 13 acres of land located east of Asheville, North Carolina. The Asheville facility includes two buildings totaling approximately 64,000 square feet. Our office building at the Asheville facility sustained water damage from a burst water pipe at the end of December 2022, and is not currently being used. The office building is separate from our manufacturing building, which houses our manufacturing operations and certain offices at the same location. There was no significant impact to our operations as a result of this event.\nWe lease our facility near Dallas, Texas (in Plano, Texas). Our Dallas facility primarily houses administrative offices, our harsh environment and specialty connectivity manufacturing operations, our harsh environment and specialty connectivity product development function, our harsh environment and specialty connectivity warehouse, and our Centric Solutions business. Our Dallas facility is located in an industrial complex of suites. The space leased is approximately 34,000 square feet.\nWe lease a warehouse facility in Roanoke, Virginia. The space leased is approximately 36,000 square feet and is used primarily to store raw materials and other items related to our fiber optic cable operations.\nWe believe that we operated at approximately 40% to 50% of our production equipment capacity on average at our collective manufacturing facilities during fiscal year 2023. This determination is based on a capacity calculation that assumes we would be fully staffed to run production at all of our locations twenty-four hours per day, seven days a week, all year. Since various production equipment is specialized and our product mix varies, individual manufacturing equipment may operate at higher or lower production capacity during any given period of time. Additionally, we can experience capacity constraints based on the types of products that are being manufactured at any given time and related inherent limitations in the manufacturing process as well as the time it takes to hire and train new employees.\nAdditional personnel would need to be hired and trained, additional warehousing space may be needed, and, depending on product mix, certain additional production equipment may need to be acquired, to fully utilize our available production equipment capacity at all of our facilities. We can provide no assurance as to the time required to complete the process of hiring and training personnel or to acquire and install certain additional production equipment or our ability to secure additional warehousing space, necessary to fully utilize our available production capacity. Item 3.\nLEGAL PROCEEDINGS\nFrom time to time, we are involved in various claims, legal actions and regulatory reviews arising in the ordinary course of business. In the opinion of management, the ultimate disposition of these matters will not have a material adverse effect on our financial position, results of operations or liquidity. Item 4.\nMINE SAFETY DISCLOSURES\nNot applicable.\nPART II Item 5.\nMARKET FOR REGISTRANTS COMMON EQUITY AND RELATED STOCKHOLDER MATTERS\nThe information pertaining to shareholders beneficially owning more than five percent of the Companys common stock and the security ownership of management, which is set forth under the caption Beneficial Ownership of Securities in the Proxy Statement for the 2024 Annual Meeting of Shareholders of the Company, is incorporated herein by reference.\nThe Company had 7,893,681 shares of common stock issued and outstanding at October 31, 2023. Employees of the Company and members of the Board of Directors owned at least 34.6% of the shares issued and outstanding at October 31, 2023, including shares still subject to potential forfeiture based on vesting requirements.\nThe information contained under the caption Corporate Information of our Annual Report for the fiscal year ended October 31, 2023, filed as Exhibit 13.1 to this report on Form 10-K, is incorporated herein by reference. Item 6.\nRESERVED Item 7.\nMANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe information contained under the caption Managements Discussion and Analysis of Financial Condition and Results of Operations of our Annual Report for the fiscal year ended October 31, 2023, filed as Exhibit 13.1 to this report on Form 10-K, is incorporated herein by reference. Item 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company did not engage in transactions in derivative financial instruments or derivative commodity instruments. As of October 31, 2023, the Companys financial instruments were not exposed to significant market risk due to interest rate risk, foreign currency exchange risk, commodity price risk or equity price risk. Item 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe information contained under the captions Consolidated Financial Statements, Notes to Consolidated Financial Statements, and Report of Independent Registered Public Accounting Firm of our Annual Report for the fiscal year ended October 31, 2023, filed as Exhibit 13.1 to this report on Form 10-K, is incorporated herein by reference. Item 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nThere were no changes in our accountants and the Company did not have any disagreements with its accountants on any accounting matter or financial disclosure made during our fiscal year ended October 31, 2023. Item 9A.\nCONTROLS AND PROCEDURES\nDisclosure Controls and Procedures.\nThe Company maintains disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)) that are designed to be effective in providing reasonable assurance that information required to be disclosed in reports under the Exchange Act are recorded, processed and summarized and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission (the SEC), and that such information is accumulated and communicated to management to allow for timely decisions regarding required disclosure.\nIn designing and evaluating disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, will be detected. These inherent limitations include the realities that judgments in decision making can be faulty and that breakdowns can occur because of simple error or mistake. The design of any system of controls is based, in part, upon certain assumptions about the likelihood of future events and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nAs of October 31, 2023, the Company completed an evaluation, under the supervision and with the participation of management, including the chief executive officer and the chief financial officer (principal accounting officer and principal financial officer), of the effectiveness of the design and operation of our disclosure controls and procedures. Based upon that evaluation, the chief executive officer and chief financial officer concluded that the Companys disclosure controls and procedures were effective as of October 31, 2023.\nManagements Annual Report on Internal Control Over Financial Reporting.\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) or 15d-15(f) under the Exchange Act). Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation and fair presentation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles and includes those policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures are being made only in accordance with authorizations of our management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of the inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Accordingly, even effective internal control over financial reporting can provide only reasonable assurance with respect to financial statement preparation. Further, the evaluation of the effectiveness of internal control over financial reporting was made as of a specific date, and continued effectiveness in future periods is subject to the risks that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies and procedures may decline. Management conducted an evaluation of the design and effectiveness of the Companys system of internal control over financial reporting as of October 31, 2023, based on the framework set forth in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013. Based on its evaluation, management concluded that, as of October 31, 2023, the Companys internal control over financial reporting was effective.\nChanges in Internal Control Over Financial Reporting.\nThere were no changes in the Companys internal controls over financial reporting during the fourth quarter of the fiscal year covered by this report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B.\nOTHER INFORMATION\nNone.\nPART III Item 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nFor information with respect to the Directors of the registrant, see Election of Directors, and Executive Officers in the Proxy Statement for the 2024 Annual Meeting of Shareholders of the Company, which information is incorporated herein by reference.\nFor information with respect to the executive officers of the registrant, see Executive Officers in the Proxy Statement for the 2024 Annual Meeting of Shareholders of the Company, which information is incorporated herein by reference.\nThe information with respect to compliance with Section 16(a) of the Securities Exchange Act of 1934, which is set forth under the caption Delinquent Section 16(a) Reports (if applicable) in the Proxy Statement for the 2024 Annual Meeting of Shareholders of the Company, is incorporated herein by reference.\nThe information concerning the Companys code of ethics that applies to the Companys principal executive officer and the Companys senior financial officers required by this Item is incorporated by reference to the Companys Proxy Statement under the heading Code of Ethics. Item 11.\nEXECUTIVE COMPENSATION\nThe information set forth under the captions Executive Compensation, and Director Compensation in the Proxy Statement for the 2024 Annual Meeting of Shareholders of the Company is incorporated herein by reference. Item 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information concerning stock ownership by directors, executive officers and shareholders beneficially owning more than five percent of the Companys common stock, which is set forth under the caption Beneficial Ownership of Securities in the Proxy Statement for the 2024 Annual Meeting of Shareholders of the Company, is incorporated herein by reference.\nThe information concerning securities authorized for issuance under equity compensation plans required by this Item is incorporated by reference to the Companys Proxy Statement under the heading Equity Compensation Plan Information. Item 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information with respect to certain transactions with management of the Company, which is set forth under the caption Certain Relationships and Related Transactions in the Proxy Statement for the 2024 Annual Meeting of Shareholders of the Company, is incorporated herein by reference. Item 14.\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information with respect to certain principal accountant fees and services, which is set forth under the caption Independent Registered Public Accounting Firm in the Proxy Statement for the 2024 Annual Meeting of Shareholders of the Company, is incorporated herein by reference.\nThe information concerning pre-approval policies for audit and non-audit services required by this Item is incorporated by reference to the Companys Proxy Statement under the heading Audit Committee Pre-Approval of Audit and Permissible Non-Audit Services of Independent Registered Public Accounting Firm.\nPART IV Item 15.\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\n(a) List of documents filed as part of this report:\n1.\nFinancial statements: The Companys consolidated financial statements and related notes thereto are hereby incorporated by reference to pages 20 to 42 of the Companys Annual Report filed as Exhibit 13.1 to this Form 10-K.\n2.\nFinancial statement schedules: All schedules are omitted, as the required information is inapplicable or the information is presented in the consolidated financial statements or related notes thereto.\n3.\nExhibits to this Form 10-K pursuant to Item 601 of Regulation S-K are as follows:\nExhibit No.\nDescription\n3.1\nArticles of Amendment filed November 5, 2001 to the Amended and Restated Articles of Incorporation, as amended through November 5, 2001 (incorporated herein by reference to Exhibit 1 to the Companys Form 8-A12G filed with the Commission on November 5, 2001).\n3.2\nArticles of Amendment filed July 5, 2002 to the Amended and Restated Articles of Incorporation, as amended through July 5, 2002 (incorporated herein by reference to Appendix A to the Companys definitive proxy statement on Form 14A filed July 5, 2002).\n3.3\nAmended and Restated Bylaws of Optical Cable Corporation (incorporated herein by reference to Exhibit 3.2 to the Companys Quarterly Report on Form 10-Q for the third quarter ended July31, 2011).\n3.4\nAmended and Restated Bylaws of Optical Cable Corporation effective March 9, 2023 (incorporated herein by reference to Exhibit 3.4 to the Companys Quarterly Report on Form 10-Q for the first quarter ended January 31, 2023).\n4.1\nForm of certificate representing Common Stock (incorporated herein by reference to Exhibit 4.1 to the Companys Quarterly Report on Form 10-Q for the third quarter ended July 31, 2004 (file number 0-27022)).\n4.2\nForm of certificate representing Common Stock (incorporated herein by reference to Exhibit 4.2 to the Companys Quarterly Report on Form 10-Q for the third quarter ended July 31, 2012).\n4.3\nCorrected Credit Line Deed of Trust dated June 4, 2008 between Optical Cable Corporation as Grantor, LeClairRyan as Trustee and Northeast Bank, successor in interest to Pinnacle Bank (successor by merger with Bank of North Carolina, successor by merger with Valley Bank) as Beneficiary (incorporated herein by reference to Exhibit 4.17 of the Companys Annual Report on Form 10-K for the period ended October 31, 2008 filed January 29, 2009).\n4.4\nCorrected Deed of Trust, Security Agreement and Fixtures Filing dated May 30, 2008 by and between Superior Modular Products Incorporated as Grantor, LeClairRyan as Trustee and Northeast Bank, successor in interest to Pinnacle Bank (successor by merger with Bank of North Carolina, successor by merger with Valley Bank) as Beneficiary (incorporated herein by reference to Exhibit 4.18 of the Companys Annual Report on Form 10-K for the period ended October 31, 2008 filed January 29, 2009).\n4.5\nTerm Loan A Note in the amount of $1,816,609 by Optical Cable Corporation dated April 26, 2016, for the benefit of Northeast Bank as of July 15, 2021, as successor in interest to Pinnacle Bank (successor by merger with Bank of North Carolina) (incorporated herein by reference to Exhibit 4.3 to the Companys Current Report on Form 8-K/A filed May 3, 2016).\n4.6\nTerm Loan B Note in the amount of $5,271,411 by Optical Cable Corporation dated April 26, 2016, for the benefit of Northeast Bank as of July 15, 2021, as successor in interest to Pinnacle Bank (successor by merger with Bank of North Carolina) (incorporated herein by reference to Exhibit 4.4 to the Companys Current Report on Form 8-K/A filed May 3, 2016).\n4.7\nModification of Credit Line Deed of Trust dated April 26, 2016 by and between Optical Cable Corporation (successor by merger to Superior Modular Products Incorporated) as Grantor, Andrew B. Agee (in substitution of LeClairRyan) as Trustee and Northeast Bank, successor in interest to Pinnacle Bank (successor by merger with Bank of North Carolina) as Beneficiary, modifying that certain Corrected Credit Line Deed of Trust dated June 4, 2008 (incorporated herein by reference to Exhibit 4.5 to the Companys Current Report on Form 8-K/A filed May 3, 2016).\n4.8\nModification of Deed of Trust, Security Agreement, and Assignment of Leases and Rents dated April 26, 2016 by and between Optical Cable Corporation (successor by merger to Superior Modular Products Incorporated) as Grantor, Andrew B. Agee (in substitution of LeClairRyan) as Trustee and Northeast Bank, successor in interest to Pinnacle Bank (successor by merger with Bank of North Carolina) as Beneficiary, modifying that certain Corrected Deed of Trust, Security Agreement and Assignment of Leases and Rents dated May 30, 2008 (incorporated herein by reference to Exhibit 4.6 to the Companys Current Report on Form 8-K/A filed May 3, 2016).\n4.9\nSecond Modification of Credit Line Deed of Trust dated May 2, 2018 by and between Optical Cable Corporation (successor by merger to Superior Modular Products Incorporated) as Grantor, W. Todd Ross (in substitution of LeClairRyan) as Trustee and Northeast Bank, successor in interest to Pinnacle Bank (successor by merger with Bank of North Carolina) as Beneficiary, modifying that certain Modification of Credit Line Deed of Trust dated April 26, 2016, which previously modified that certain Corrected Credit Line Deed of Trust dated June 4, 2008 (incorporated herein by reference to Exhibit 4.20 to the Companys Quarterly Report on Form 10-Q for the second quarter ended April 30, 2018).\n4.10\nSecond Modification of Deed of Trust, Security Agreement, and Assignment of Leases and Rents dated May 2, 2018 by and between Optical Cable Corporation (successor by merger to Superior Modular Products Incorporated) as Grantor, W. Todd Ross (in substitution of LeClairRyan) as Trustee and Northeast Bank, successor in interest to Pinnacle Bank (successor by merger with Bank of North Carolina) as Beneficiary, modifying that certain Modification of Deed of Trust, Security Agreement and Assignment of Leases and Rents dated April 26, 2016, which previously modified that certain Corrected Deed of Trust, Security Agreement and Assignment of Leases and Rents dated May 30, 2008 (incorporated herein by reference to Exhibit 4.21 to the Companys Quarterly Report on Form 10-Q for the second quarter ended April 30, 2018).\n4.11\nLoan and Security Agreement dated July 24, 2020 by and among Optical Cable Corporation along with its subsidiaries Applied Optical Systems, Inc. and Centric Solutions LLC, and North Mill Capital LLC (now doing business as SLR Business Credit) (incorporated herein by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed July 30, 2020).\n4.12\nRevolving Credit Master Promissory Note dated July 24, 2020 by Optical Cable Corporation along with its subsidiaries Applied Optical Systems, Inc. and Centric Solutions LLC in favor of North Mill Capital LLC (now doing business as SLR Business Credit) (incorporated herein by reference to Exhibit 4.2 to the Companys Current Report on Form 8-K filed July 30, 2020).\n4.13\nPayoff Letter from Pinnacle Bank to North Mill Capital LLC (now doing business as SLR Business Credit) and Optical Cable Corporation (incorporated herein by reference to Exhibit 4.3 to the Companys Current Report on Form 8-K filed July 30, 2020).\n4.14\nAmended and Restated Stockholder Protection Rights Agreement, dated as of November 2, 2021, between Optical Cable Corporation and American Stock Transfer & Trust Company, LLC, as rights agent (incorporated herein by reference to Exhibit 4.1 to the Companys Form 8-A12G filed with the Commission on November 5, 2021).\n4.15\nModification Agreement dated as of July 5, 2022, by and between North Mill Capital LLC (now doing business as SLR Business Credit) and Optical Cable Corporation along with its subsidiaries Applied Optical Systems, Inc., and Centric Solutions LLC (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed July 7, 2022).\n4.16\nOmnibus Amendment of Loan Documents dated October 31, 2023 by and between Optical Cable Corporation and Northeast Bank (incorporated herein by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed November 3, 2023).\n10.1*\nOptical Cable Corporation 2017 Stock Incentive Plan (incorporated by reference to Appendix A to the Companys definitive proxy statement on Form 14A filed March 13, 2017).\n10.2*\nAmended and Restated Employment Agreement by and between Optical Cable Corporation and Neil D. Wilkin, Jr. effective April 11, 2011 (incorporated herein by reference to Exhibit 10.2 of the Companys Current Report on Form 8-K filed April 15, 2011).\n10.3*\nAmendment, effective December 18, 2012, to Amended and Restated Employment Agreement by and between Optical Cable Corporation and Neil D. Wilkin, Jr. effective April 11, 2011 (incorporated herein by reference to Exhibit 10.16 of the Companys Quarterly Report on Form 10-Q for the period ended January 31, 2013 filed March 15, 2013).\n10.4*\nSecond Amendment, effective March 14, 2014, to Amended and Restated Employment Agreement by and between Optical Cable Corporation and Neil D. Wilkin, Jr. effective April 11, 2011, as amended December 18, 2012 (incorporated herein by reference to Exhibit 10.19 of the Companys Quarterly Report on Form 10-Q for the period ended January 31, 2014 filed March 17, 2014).\n10.5*\nAmended and Restated Employment Agreement by and between Optical Cable Corporation and Tracy G. Smith effective April 11, 2011 (incorporated herein by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed April 15, 2011).\n10.6*\nAmendment, effective December 18, 2012, to Amended and Restated Employment Agreement by and between Optical Cable Corporation and Tracy G. Smith effective April 11, 2011 (incorporated herein by reference to Exhibit 10.18 of the Companys Quarterly Report on Form 10-Q for the period ended January 31, 2013 filed March 15, 2013).\n10.7*\nSecond Amendment, effective March 14, 2014, to Amended and Restated Employment Agreement by and between Optical Cable Corporation and Tracy G. Smith effective April 11, 2011, as amended December 18, 2012 (incorporated herein by reference to Exhibit 10.22 of the Companys Quarterly Report on Form 10-Q for the period ended January 31, 2014 filed March 17, 2014).\n10.8*\nForm of vesting award agreement for non-employee Board members under the Optical Cable Corporation 2017 Stock Incentive Plan (incorporated herein by reference to Exhibit 10.21 of the Companys Quarterly Report on Form 10-Q for the period ended April 30, 2017 filed June 13, 2017).\n10.9*\nForm of operational performance (Company financial performance measure) vesting award agreement under the Optical Cable Corporation 2017 Stock Incentive Plan (incorporated by reference to Exhibit 10.15 of the Companys Annual Report on Form 10-K for the period ended October 31, 2021 filed December 20, 2021).\n10.10*\nFirst Amendment to the Optical Cable Corporation 2017 Stock Incentive Plan effective March 29, 2022 (incorporated herein by reference to Exhibit 10.16 of the Companys Quarterly Report on Form 10-Q for the period ended July 31, 2022 filed September 12, 2022).\n13.1\nAnnual Report. FILED HEREWITH.\n21.1\nList of Subsidiaries. FILED HEREWITH.\n23.1\nConsent of Independent Registered Public Accounting Firm. FILED HEREWITH.\n31.1\nCertification of the Companys Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002. FILED HEREWITH.\n31.2\nCertification of the Companys Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002. FILED HEREWITH.\n32.1\nCertification of the Companys Chief Executive Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. FURNISHED HEREWITH.\n32.2\nCertification of the Companys Chief Financial Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. FURNISHED HEREWITH.\nOptical Cable Corporation Compensation Recovery Policy, effective November 30, 2023. FILED HEREWITH.\nThe following materials from the Companys Annual Report on Form 10-K for the year ended October 31, 2023, formatted in iXBRL (Inline eXtensible Business Reporting Language): (i) Consolidated Balance Sheets as of October 31, 2023 and 2022, (ii) Consolidated Statements of Operations for the years ended October 31, 2023, 2022 and 2021, (iii) Consolidated Statements of Shareholders Equity for the years ended October 31, 2023, 2022 and 2021, (iv) Consolidated Statements of Cash Flows for the years ended October 31, 2023, 2022 and 2021, and (v) Notes to Consolidated Financial Statements. FILED HEREWITH.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n*\nManagement contract or compensatory plan or agreement.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOPTICAL CABLE CORPORATION\nDate:\nDecember 20, 2023\nBy:\n/S/ Neil D. Wilkin, Jr.\nNeil D. Wilkin, Jr.\nChairman of the Board of Directors,\nPresident and Chief Executive Officer\nDate:\nDecember 20, 2023\nBy:\n/S/ Tracy G. Smith\nTracy G. Smith\nSenior Vice President and Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated as of December 20, 2023.\nDate:\nDecember 20, 2023\n/S/ Neil D. Wilkin, Jr.\nNeil D. Wilkin, Jr.\nChairman of the Board of Directors,\nPresident and Chief Executive Officer\nDate:\nDecember 20, 2023\n/S/ Randall H. Frazier\nRandall H. Frazier\nDirector\nDate:\nDecember 20, 2023\n/S/ John M. Holland\nJohn M. Holland\nDirector\nDate:\nDecember 20, 2023\n/S/ John A. Nygren\nJohn A. Nygren\nDirector\nDate:\nDecember 20, 2023\n/S/ Craig H. Weber\nCraig H. Weber\nDirector"
}