{
    "cik": "1001115",
    "company": "GEOSPACE TECHNOLOGIES CORP",
    "filing_type": "10-K",
    "filing_date": "2022-11-18",
    "period_of_report": "2022-09-30",
    "sic": "3829",
    "state_of_inc": "TX",
    "state_location": "TX",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1001115/0000950170-22-025429-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1001115/000095017022025429/geos-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1001115/0000950170-22-025429.txt",
    "filename": "1001115_10K_2022_0000950170-22-025429.htm",
    "content": "Item 1. Business\nBusiness Overview\nUnless otherwise specified, the discussion in this Annual Report on Form 10-K refers to Geospace Technologies Corporation and its subsidiaries. We principally design and manufacture seismic instruments and equipment. These seismic products are marketed to the oil and gas industry and used to locate, characterize and monitor hydrocarbon producing reservoirs. We also market our seismic products to other industries for vibration monitoring, border and perimeter security and various geotechnical applications. We design and manufacture other products of a non-seismic nature, including water meter products, imaging equipment, offshore cables, remote shutoff water valves and Internet of Things (\"IoT\") platform and provide contract manufacturing services. We report and categorize our customers and products into three different segments: Oil and Gas Markets, Adjacent Markets and Emerging Markets. In recent years, the revenue contribution from our Adjacent Markets segment has grown to represent nearly half of our total revenue. This revenue growth is reflective of both our diversification strategy as well as the continued downturn in the Oil and Gas Markets segment.\nDemand for our seismic products targeted at customers in our Oil and Gas Markets segment has been, and will likely continue to be, vulnerable to downturns in the economy and the oil and gas industry in general. For more information, please refer to the risks discussed under the heading Risk Factors.\nSegment and Geographical Information\nWe report and evaluate financial information for our three business segments: Oil and Gas Markets, Adjacent Markets and Emerging Markets. For a discussion of the products sold and markets served by each of our segments, see Products and Product Development below. For a discussion of financial information by segment and geographic area, see Note 20 to the consolidated financial statements contained in this Annual Report on Form 10-K.\nProducts and Product Development\nOil and Gas Markets\nOur Oil and Gas Markets business segment has historically accounted for the majority of our revenue. Geoscientists use seismic data primarily in connection with the exploration, development and production of oil and gas reserves to map potential and known hydrocarbon bearing formations and the geologic structures that surround them. This segments products include wireless seismic data acquisition systems, reservoir characterization products and services, and traditional seismic exploration products such as geophones, hydrophones, leader wire, connectors, cables, marine streamer retrieval and steering devices and various other seismic products. We believe that our Oil and Gas Markets products are among the most technologically advanced instruments and equipment available for seismic data acquisition.\nTraditional Products\nAn energy source and a data recording system are combined to acquire seismic data. We provide many of the components of seismic data recording systems, including geophones, hydrophones, multi-component sensors, leader wire, geophone strings, connectors, seismic telemetry cables and other seismic related products. On land, our customers use geophones, leader wire, cables and connectors to receive and measure seismic reflections resulting from an energy source into data recording units, which store the seismic information for subsequent processing and analysis. In the marine environment, large ocean-going vessels tow long seismic cables known as streamers containing hydrophones that are used to detect pressure changes. Hydrophones transmit electrical impulses back to the vessels data recording unit where the seismic data is stored for subsequent processing and analysis. Our marine seismic products also help steer streamers while being towed and help recover streamers if they become disconnected from the vessel.\nOur seismic sensor, cable and connector products are compatible with most major competitive seismic data acquisition systems currently in use. Revenue from these products results primarily from seismic contractors purchasing our products as components of new seismic data acquisition systems or to repair and replace components of seismic data acquisition systems already in use.\nWireless Products\nWe have developed multiple versions of a land-based wireless (or nodal) seismic data acquisition system. Rather than utilizing interconnecting cables as required by most traditional land data acquisition systems, each of our wireless stations operate as an independent data collection system, allowing for virtually unlimited channel configurations. As a result, our wireless systems require less maintenance, which we believe allows our customers to operate more effectively and efficiently because of its reduced environmental impact, lower weight and ease of operation. Each wireless station is available in a single-channel or three-channel\nconfiguration. Since its introduction in 2008 and through September 30, 2022, we have sold 486,000 land-based wireless channels and we currently have 73,000 land-based wireless channels in our rental fleet.\nWe have also developed a marine-based wireless seismic data acquisition system called the OBX. Similar to our land-based wireless systems, the marine OBX system may be deployed in virtually unlimited channel configurations and does not require interconnecting cables between each station. We have two versions of OBX nodal stations. A shallow water version that can be used in depths up to 750 meters and a deepwater version that can be deployed in depths of up to 3,450 meters. Through September 30, 2022, we have sold 12,000 OBX stations and we currently have 25,000 OBX stations in our rental fleet.\nIn August 2022, we announced the release of a new seismic acquisition product known as Mariner™, a continuous, cable-free, four channel autonomous, shallow water ocean bottom recorder. Mariner is the next generation node designed for extended duration seabed ocean bottom seismic data acquisition. The slim profile nodes, which are part of our shallow water stations, are ideally deployed as deep as 750 meters. The device continuously records for up to 70 days and offers more rapid recharging times. Its slim profile creates space savings on seismic survey vessels, allowing contractors to fit up to 25% more nodes into a download/charge container.\nReservoir Products\nSeismic surveys repeated over selected time intervals show dynamic changes within a producing oil and gas reservoir, and operators can use these surveys to monitor the effects of oil and gas development and production. This type of reservoir monitoring requires special purpose or custom designed systems in which portability becomes less critical and functional reliability assumes greater importance. This reliability factor helps assure successful operations in inaccessible locations over a considerable period of time. Additionally, reservoirs located in deep water or harsh environments require special instrumentation and new techniques to maximize recovery. Reservoir monitoring also requires high-bandwidth, high-resolution seismic data for engineering project planning and reservoir management. Utilizing these reservoir monitoring tools, producers can enhance the recovery of oil and gas deposits over the life of a reservoir.\nWe have developed permanently installed high-definition reservoir monitoring systems for land and ocean-bottom applications in producing oil and gas fields. Our electrical reservoir monitoring systems are currently installed on numerous offshore reservoirs in the North Sea and elsewhere. Through our acquisition of the OptoSeis® fiber optic sensing technology, we now offer both electrical and fiber optic reservoir monitoring systems. These high-definition seismic data acquisition systems have a flexible architecture allowing them to be configured as a subsurface system for both land and marine reservoir-monitoring projects. The scalable architecture of these systems enables custom designed configuration for applications ranging from low-channel engineering and environmental-scale surveys requiring a minimum number of recording channels to high-channel surveys required to efficiently conduct permanent reservoir monitoring (PRM). The modular architecture of these products allows virtually unlimited channel expansion for these systems.\nIn addition, we produce seismic borehole acquisition systems that employ a fiber optic augmented wireline capable of very high data transmission rates. These systems are used for several reservoir monitoring applications, including an application pioneered by us allowing operators and service companies to monitor and measure the results of hydraulic fracturing operations.\nWe believe our reservoir characterization products make seismic acquisition a cost-effective and reliable process for reservoir monitoring. Our multi-component seismic product developments also include an omni-directional geophone for use in reservoir monitoring, a compact marine three-component or four-component gimbaled sensor and special-purpose connectors, connector arrays and cases.\nDuring 2022, we maintained active discussions with potential clients for future PRM systems. In coordination with a potential client, we concluded a successful demonstration of our OptoSeis fiber optic PRM technology in real-world field conditions. This demonstration was a prerequisite step toward future contract consideration. If we are awarded a PRM contract in fiscal year 2023, revenue will most likely not be recognized until fiscal year 2024. We have also held discussions and received requests for information from other major oil and gas producers regarding PRM systems. We have not received any orders for a large-scale seabed PRM system since November 2012.\nAdjacent Markets\nOur Adjacent Markets businesses leverage upon existing manufacturing facilities and engineering capabilities utilized by our Oil and Gas Markets businesses. Many of the seismic products in our Oil and Gas Markets segment, with little or no modification, have direct application to other industries.\nOur business diversification strategy has centered largely on translating expertise in ruggedized engineering and manufacturing into expanded customer markets. To bolster the solid market share weve established in the water utility market for water meter cables, in fiscal year 2021, we acquired the smart water IoT company Aquana, LLC (\"Aquana\").\nIndustrial Products\nOur industrial products include water meter products, remote shut-off water valves and IoT Platform, contract manufacturing services and seismic sensors used for vibration monitoring.\nOur water meter products support the global smart meter connectivity water utility market. Our products provide our customers with highly reliable automated meter-reading and automated meter infrastructure with our robust water-proof connectors. Our field splice kits allow for accelerated repairs once identified.\nOur water IoT platform and remote-shut off valve allows customers that manage multi-family and commercial properties to monitor their properties for leak and burst events, with real-time notifications, complimented with our remote-shut off to stop water damage. These products also allow water utilities to control and monitor water use remotely, discontinue or limit service without placing its employees in potential harm or danger.\nOur robust manufacturing capabilities have allowed us to provide specialized contract manufacturing services for printed circuit board manufacturing, cabling and harnesses, machining, injection molding and electronic system assembly.\nOur seismic sensors provide unique high definition, low frequency sensing that allows for vibration monitoring in industrial machinery, mine safety and earthquake detection.\nImaging Products\nOur imaging products include electronic pre-press products that employ direct thermal imaging, direct-to-screen printing systems, and digital inkjet printing technologies targeted at the commercial graphics, industrial graphics, textile and flexographic printing industries.\nEmerging Markets\nOur Emerging Markets business segment consists entirely of our Quantum business. Quantums product line includes a proprietary detection system called SADAR®, which detects, locates and tracks items of interest in real-time. Using the SADAR technology, Quantum designs and sells products used for border and perimeter security surveillance, cross-border tunneling detection and other products targeted at movement monitoring, intrusion detection and situational awareness. Quantums customers include various agencies of the U.S. government including the Department of Defense, Department of Energy, Department of Homeland Security and other agencies.\nBusiness Strategy\nWe have experienced several years of very low demand for most of the products we sell and rent into our Oil and Gas Markets. Demand for these products has also been adversely affected by COVID-19 and the resulting lower global demand for oil and gas. Many ocean-bottom nodal projects have been delayed and rescheduled due to the pandemic and uncertainty in oil and gas commodity prices, reducing rental demand for our ocean-bottom nodal products used to gather seismic data on the ocean-bottom. Depressed demand also continues for our traditional seismic products and our land nodal seismic products. As a result, we have adopted what we think is a conservative and prudent business strategy which places a focus on sound financial management practices, as outlined below. We have not changed our primary focus on continued investment in product research and development, selective acquisitions and joint ventures.\nContinue Investment in Product Research and Development - Past periods of revenue growth were primarily driven through our internal development of new products for the oil and gas industry. In past years, our oil and gas product innovations included the introduction of borehole seismology tools, land and seabed PRM systems and wireless data acquisition systems for both land and marine applications. These innovative technologies are the result of our unceasing investment in research and development initiatives. A majority of our product research and development cost relates to our product engineers. Our engineering staff have been key to our past success, and we intend to continue our tradition of retaining and attracting quality engineering staff by providing appropriate compensation and benefits. Going forward, we intend to continue significant investments in product research and development of new oil and gas technologies as well as products for our other business segments in order to diversify and grow our revenue base.\nSelectively Pursue Acquisitions of Businesses with Technological and Engineering Overlap - The oil and gas industry periodically experiences volatile business cycles requiring us to rapidly increase and decrease our business activities to meet the industrys demand for our products. This industry generally offers equipment manufacturers like us limited visibility into new orders creating challenges for us to manage our manufacturing capacity, workforce, inventories and other working capital challenges. While our primary growth initiative is to expand our oil and gas seismic product offerings, as seen with our acquisition of the OptoSeis® fiber optic sensing technology in fiscal year 2019, we may also seek out other business opportunities in adjacent markets and emerging markets which complement our existing oil and\ngas seismic products, engineering and manufacturing capabilities, and company-wide culture. In order to diversify our revenue base and expose us to different markets with different business cycles, we have directed these efforts toward businesses outside the oil and gas industry, as seen with our acquisition of Quantum in fiscal year 2018 and Aquana in fiscal year 2021.\nFinancial Management - Industry conditions since fiscal year 2014 have required us to place increased emphasis on cash management and preservation. Due to the cyclicality of the oil and gas industry, we have historically managed our financial risk by limiting or eliminating debt leverage in our balance sheet. While we are not opposed to moderate amounts of short-term debt during favorable business cycles, we choose to minimize our exposure to long-term debt obligations which, in our view, restrict our ability to operate during periodic difficult business cycles in the oil and gas industry similar to the recent business environment. We believe this strategy has allowed us to continue operations through difficult business cycles without disruption for debt and equity restructuring as has been seen among our peers, many of whom have significant long-term debt burdens. In addition, we have limited our investments in capital assets and have liquidated, and made appropriate reserves for, significant amounts of our inventories and rental fleet assets. We also believe that the value of our common shares outstanding will be best served in the long-term by retaining our cash to fund future cash outflows as they become necessary. In this regard, we do not anticipate paying any cash dividends in the foreseeable future, however, during the first quarter of fiscal year 2022 we repurchased 841,992 shares of our common stock in open market transactions completing a $7.5 million stock-buy-back program authorized by our board of directors.\nCompetition\nOil and Gas Products\nWe are one of the worlds largest designers and manufacturers of seismic products used in the oil and gas industry. The principal competitors for many of our traditional seismic products are Sercel (a division of CGG) and INOVA. Furthermore, entities in China affiliated with Sercel, as well as other Chinese manufacturers produce low-cost oil and gas seismic products, which compete with our traditional seismic products.\nThe primary competitors for our land wireless data acquisition systems are SmartSolo, Sercel, INOVA, STRYDE, Geophysical Technologies and numerous smaller entities who have introduced similar versions of wireless data acquisition systems. We believe the primary competitors for our marine nodal data acquisition systems are Magseis Fairfield ASA and Sercel, each of whom utilizes their own proprietary nodal technology.\nMost oil and gas seismic products are price sensitive, so the ability to manufacture these products at a low cost is essential to maintain market share. While price is an important factor in a customers decision to purchase a land or marine wireless data acquisition system, we believe customers also place a high value on a products historical performance and the ongoing engineering and field support provided by the products manufacturer.\nThe principal keys for success in the seismic instruments and equipment market are technological superiority, product durability under harsh field conditions, reliability, size, weight and customer support. Product deliverability is always an important consideration for our customers.\nIn general, most customers prefer to standardize data acquisition systems, geophones and hydrophones, particularly if they are used by seismic companies that have multiple crews which are able to support each other. This standardization makes it difficult for competitive manufacturers to gain market share from other manufacturers with existing customer relationships.\nOur primary competitors for the rental of our traditional and land wireless seismic equipment are STRYDE, SmartSolo, INOVA, Geophysical Technologies and Seismic Equipment Specialists.\nOur primary competitor for our seabed PRM systems is Alcatel-Lucent. Our primary competitors for high-definition borehole seismic data acquisition systems are Avalon Sciences Ltd and Sercel.\nAdjacent Markets Products\nOur industrial and imaging products face competition from numerous domestic and international specialty product manufacturers.\nEmerging Markets Products\nThe border and perimeter security marketplace is dominated by large integrated system providers such as Boeing, General Dynamics, Lockheed Martin, Raytheon, Elbit Systems and others. Systems provided by these competitors are generally multifaceted and may include numerous integrated surveillance technologies, including the geophysical sensor and software systems that we have developed. Our sensing technology does not rely on line-of-sight motion detection, which is required by cameras and other visual and radio frequency technologies, and thus enables motion-sensing such devices would miss. Competitive geophysical technologies utilizing fiber\noptic sensing techniques are provided by OptaSense, Fibersensys, Future Fiber Technologies and other specialty sensor manufacturing firms.\nSuppliers\nWe purchase raw materials from a variety of suppliers located in various countries. We typically have multiple suppliers for our critical materials. In our oil and gas seismic business segment, certain models of our marine wireless products use a timing device manufactured by a single supplier. We currently do not possess the ability to manufacture this component and have no other reliable source for this device. In our Adjacent Markets business segment, we purchase all of our thermal imaging film from a single supplier. Beyond this film supplier, we know of no other source for thermal film that performs as well in our imaging equipment. For a discussion of the risks related to our reliance on these suppliers, see Risk Factors - We Rely on Key Suppliers for Certain Components Used in Our Products.\nCOVID-19 has disrupted the Companys supply chain, resulting in longer lead times in materials available from suppliers and extended the shipping time for these materials to reach the Companys facilities. These disruptions could constrain our ability to provide products to our customers in the time frame they require.\nProduct Manufacturing and Assembly\nOur manufacturing and product assembly operations consist of machining, molding or cabling the necessary component parts, configuring these parts along with components received from various vendors and assembling a final product. We manufacture many of our oil and gas seismic products to the specifications required by our customers. For example, we assemble geophone strings based on a number of customer choices such as length, gauge, tolerance and color of molded parts. Upon completion of our manufacturing and assembly operations, we test our final products to the functional and environmental extremes of product specifications and inspect the products for quality assurance. Consistent with industry practice, we normally manufacture our products based on firm customer orders, anticipated customer orders and historical product demand. As a result of the steep decline in product demand that began in fiscal year 2014, further accentuated by the COVID-19 pandemic creating a global decline in the demand for oil and gas, also aggravated by the decline in crude oil prices, we currently hold more than twelve months supply of inventory.\nMarkets and Customers\nOur principal customers for our traditional and wireless seismic products are seismic contractors and, to a lesser extent, major independent and government-owned oil and gas companies that either operate their own seismic crews or specify seismic instrument and equipment preferences to contractors. For our deepwater PRM products, our customers are generally large international oil and gas companies that operate long-term offshore oil and gas producing properties. Our industrial product customers consist of specialty manufacturers, research institutions and industrial product distributors. Our imaging customers primarily consist of direct users of our equipment as well as specialized resellers that focus on the screen-printing and flexographic printing industries. Our border and perimeter security customers are primarily government agencies.\nOne customer comprised 29.3% of our revenue during fiscal year 2022. Three customers comprised 19.8%, 16.4% and 10.6% of our revenue during fiscal year 2021. The following table describes our revenue by product type (in thousands):\nYEAR ENDED SEPTEMBER 30,\nTraditional seismic exploration product revenue\n$\n6,597\n$\n4,518\nWireless seismic exploration product revenue\n40,667\n45,751\nSeismic reservoir product revenue\n1,877\n1,983\nIndustrial product revenue\n25,640\n21,335\nImaging product revenue\n13,531\n11,084\nBorder & perimeter security product revenue\n10,193\nCorporate revenue\n-\nTotal revenue\n$\n89,253\n$\n94,864\nIntellectual Property\nWe seek to protect our intellectual property by means of patents, trademarks, trade secrets and other measures. We hold patents on geophones, micro-geophones, piezo-electric sensors, seismic data acquisition, in-line retrieval devices and water meter connectors, and we have pending applications on related technology. We do not consider any single patent essential to our success. Our patents are scheduled to expire at various dates through 2039. We are not able to predict the effect of any patent expiration. We protect our\nproprietary rights to our technology through a variety of methods, including confidentiality agreements and proprietary information agreements with suppliers, employees, consultants and others who may have access to proprietary information.\nResearch and Development\nWe expect to incur significant future research and development expenditures aimed at the development of additional products for each of our business segments. We have incurred company-sponsored research and development expenses of $18.1 million and $14.8 million during the fiscal years ended September 30, 2022 and 2021, respectively.\nHuman Capital, Environmental and Social\nIn order to continue to produce the most technologically advanced instruments and equipment available for the industrial, border and perimeter security and seismic data acquisition markets, it is crucial that we continue to attract and retain top talent. To attract and retain talented employees, we strive to make Geospace Technologies Corporation a diverse and safe workplace, with opportunities for our employees to receive educational benefits, cross-function skill-development to grow and develop their career, all supported by competitive compensation and benefits.\nWorkforce Composition - At September 30, 2022, we employed 650 people predominantly on a full-time basis, of which 415 were employed in the United States, 204 in the Russian Federation and the remainder in the United Kingdom, Canada, China and Colombia. Our professional staff includes geoscientists, electrical and mechanical engineers, accountants, computer and data scientists, marketing and human resource professionals. 65% of our global workforce is employed in manufacturing, 16% in Engineering and 19% in Sales and Administration. The majority of our employees in the Russian Federation belong to a regional union for machine manufacturers. Our remaining employees are not unionized. We have never experienced a work stoppage.\nAs a global manufacturer of high-tech offerings, we believe that a diverse workforce benefits everyone, from our skilled workforce, to our valued clients, to our trusted shareholders and our society. The workforce make up includes 37% white, 32% Asian, 23% Hispanic or Latino, 7% Black or African American, and 1% two or more races. Women in managerial roles represent 30% of our domestic workforce. We proudly employ veterans of the US Armed Forces, who make up 6% of our domestic workforce.\nHealth, Safety and Wellness - The success of our business is fundamentally connected to the well-being of our people. Accordingly, we are committed to the health and safety of our employees. We provide our full-time employees and their families with access to healthcare programs. In response to the COVID-19 pandemic, we implemented significant changes that we determined were in the best interest of our employees, as well as the communities in which we operate, and which comply with government regulations. This includes having employees work from home, while implementing additional safety measures for employees continuing critical on-site work.\nCompensation and Benefits - We provide competitive compensation and benefits programs to help meet the needs of our employees. In addition to salaries, these programs (which vary by country/region and employment classification) include an incentive compensation plan, a 401(k) Plan, healthcare and insurance benefits, health savings and flexible spending accounts, paid time off, family leave, tuition assistance and on-site services, among others. We use targeted equity-based grants with vesting conditions to facilitate retention of personnel, particularly those with critical skills and experience.\nTalent Development - We invest resources to develop the talent needed to remain a leading manufacturer and developer of industrial, border and perimeter security and seismic data acquisition products. We provide our employees training opportunities and educational benefits to assist in career and skill development. We focus on continuous learning and provide feedback to assist in the development of talent.\nCompany Culture - Our Board of Directors established a Code of Business Conduct applicable to all our employees, Directors and Officers and a Code of Ethics for Senior Financial Officers in accordance with applicable U.S. federal securities laws and the NASDAQ Listed Company Manual. The Code of Business Conduct provides guidance on corporate policies such as anti-harassment, anti-corruption, substance abuse, anti-trust, conflict minerals compliance, international trade restrictions as well as policies against insider trading, conflict of interest and hedging of our common stock. We offer a Whistle Blower program designed to protect any employee who reports valid suspicions related to our financial accounting, internal controls or like matters to management without fear of termination or similar repercussions.\nHuman Rights - This year, we introduced a Human Rights Policy Statement which demonstrates our commitment to supporting and promoting human rights that benefit all our stakeholders, including our customers, employees, shareholders, investors, and the communities in which we live and operate. Our approach is applied in our business operations, across our supply chain and through ethical business conduct. This policy statement promotes a safe and healthy workplace, diversity and inclusion, non-discrimination and anti-harassment as well as addresses forced labor, human trafficking, and child labor. The Human Rights Policy Statement is posted to our corporate website and is adhered through our Business Code of Conduct and through responsible sourcing practices.\nOur values and ethics serve as the guiding force through which we proactively maintain the highest standards of business conduct. Our Core Values guide our corporate policies and practices and promote ethical business conduct and compliance with the law. Our employees understand the importance of applying our Core Values toward their daily best practices. Annually, we hold an internal Core Values survey to inform leadership on the values in action and opportunities to improve.\nGovernance - We pride ourselves on the highly ethical and transparent standards through the governance under our Board of Directors.\nBoard Composition - Our Board of Directors is chaired by a highly experienced, independent Director whose position is wholly separate and divided from the role of the Chief Executive Officer. Unlike organizations where the two leadership roles are intertwined, this distinction helps ensure varying viewpoints designed to deliver improved returns for the shareholders we serve and the communities in which we operate.\nBoard Charter Reviews - Every twelve-months, we conduct a Board and Board Committee assessment review to review and ensure that the highest quality standards are met.\nExecutive Sessions Without Management - In order to ensure original and independent thought, non-management Board members meet throughout the year.\nAudit Policies - Our Audit Committee is comprised of trusted members who ensure the integrity of our financial statements, internal controls, compliance with legal and regulatory requirements, as well as the performance of our independent auditor.\nEnterprise Risk Management (\"ERM\") - Our Board of Directors takes an enterprise-wide approach to reviewing each of our business segments, which encompass Oil & Gas, Adjacent Markets, and Emerging Markets operations which include our Security & Surveillance sector. Board members meet regularly to oversee and ensure that company objectives are met, shareholder concerns are addressed and ERM policies are maintained.\nEnvironmental - We are committed to zero harm to people, property and the environment. We have an ISO 14001 certified environmental management system, employed over many health, safety and environmental programs. We do not exist in isolation. We strive to pursue a strategy of responsibility that not only encompasses all our activities but addresses the needs of our employees, customers, suppliers and our stakeholders. We operate in communities, which have placed their trust in us. In doing this, we aim to better our impact on the environment and society, not only of our business but all businesses and organizations with whom we interact. We integrate responsible and sustainable practices throughout our organization. Our products are designed to not harm individuals, communities or the environment. We pledge to conduct ourselves in a most responsible manner in each community.\nAs a manufacturer, we have a responsibility to reuse or recycle waste materials from our operations. Waste recycled includes aluminum, brass, copper, stainless steel, steel, and titanium as well as armored cable, film, lithium batteries, PCB boards and solder paste. Over the last three years, we have recycled more than 250 tons of recyclable materials. Year to date 2022, we have recycled over 40 tons of manufacturing waste materials.\nFinancial Information by Segment and Geographic Area\nFor a discussion of financial information by segment and geographic area, see Note 20 to the consolidated financial statements contained in this Annual Report on Form 10-K. For a description of risks attendant to our foreign operations, please see Risk Factors - Our Foreign Subsidiaries and Foreign Marketing Efforts Are Subject to Additional Political, Economic, Legal and Other Uncertainties Not Generally Associated with Domestic Operations and The Ongoing Armed Conflict Between Russia and Ukraine Could Adversely Affect Our Business, Financial Condition, and Results of Operations\".\nAvailable Information\nWe file annual, quarterly and special reports, proxy statements and other information with the Securities and Exchange Commission (SEC). Our SEC filings are available to the public over the internet at the SECs website at www.sec.gov. Our SEC filings are also available to the public free of charge on our website at www.geospace.com. Please note that information contained on our website, whether currently posted or posted in the future, is not a part of this Annual Report on Form 10-K or the documents incorporated by reference in this Annual Report on Form 10-K. Item 1A. Risk Factors\nIn evaluating the Companys business, you should consider the following discussion of risk factors, in addition to other information contained in this report and in the Companys other public filings with the U.S. Securities and Exchange Commission. Any such risks could materially and adversely affect our business, financial condition, results of operations, cash flow and prospects. However, the risks described below are not the only risks facing us. Additional risks and uncertainties not currently known to us or those we currently view to be immaterial may also materially and adversely affect our business, financial condition, results of operations, cash flow and prospects.\nExternal Factors that Could Adversely Affect Us\nThe Ongoing COVID-19 Pandemic Has Significantly Impacted Worldwide Economic Conditions and Could Have a Material Adverse Effect on Our Operations and Business.\nThe ongoing COVID-19 pandemic has spread across the globe and has negatively impacted worldwide economic activity, including the global demand for oil and natural gas, and continues to create challenges in our markets. In addition to measures we have taken voluntarily, the government authorities in our markets have taken actions to mitigate the spread of COVID-19, including travel restrictions, border closings, restrictions on public gatherings, stay-at-home orders and other quarantine and isolation measures. COVID-19 continues to pose the risk that we or our employees, contractors, suppliers and customers may be prevented from conducting business activities for an indefinite period of time. The effort to vaccinate the global population appears to be reducing the effects of COVID-19, but new mutations of the virus and the global unvaccinated population has allowed the continued spread of COVID-19. COVID-19 and the related mitigation measures have disrupted our supply chain, resulting in longer lead times in materials available from suppliers and extended the shipping time for these materials to reach our facilities. If COVID-19 continues to spread or the response to contain the COVID-19 pandemic is unsuccessful, we could experience a material adverse effect on our business, financial condition, results of operations and liquidity.\nOil Commodity Price Levels Could Affect Demand for Our Oil and Gas Products, Which Could Materially and Adversely Affect Our Results of Operations and Liquidity.\nDemand for many of our products and the profitability of our operations depend primarily on the level of worldwide oil and gas exploration activity. Prevailing oil and gas prices, with an emphasis on crude oil prices, and market expectations regarding potential changes in such prices significantly affect the level of worldwide oil and gas exploration activity. During periods of improved energy commodity prices, the capital spending budgets of oil and natural gas operators tend to expand, which results in increased demand for our customers services leading to increased demand in our products. Conversely, in periods when these energy commodity prices deteriorate, capital spending budgets of oil and natural gas operators tend to contract causing demand for our products to weaken. Historically, the markets for oil and gas have been volatile and are subject to wide fluctuations in response to changes in the supply of and demand for oil and gas, market uncertainty and a variety of additional factors that are beyond our control. These factors include the level of consumer demand, regional and international economic conditions, weather conditions, domestic and foreign governmental regulations (including those related to climate change), price and availability of alternative fuels, political conditions, the war between Russia and Ukraine, instability and hostilities in the Middle East and other significant oil-producing regions, increases and decreases in the supply of oil and gas, the effect of worldwide energy conservation measures and the ability of the Organization of Petroleum Exporting Countries (\"OPEC\") to set and maintain production levels and prices of foreign imports.\nSustained low oil prices or the failure of oil prices to rise in the future and the resulting downturns or lack of growth in the energy industry and energy-related business, could have a negative impact on our results of operations and financial condition. In light of the decline in oil prices caused by the COVID-19 pandemic in 2020, oil and gas exploration and production companies experienced a significant reduction in cash flows, which resulted in reductions in their capital spending budgets for oil and gas exploration-focused activities, including seismic data acquisition activities. Demand for the sale of our seismic products targeted at customers in our Oil and Gas Markets segment, which has historically accounted for the majority of our revenue, significantly declined during fiscal year 2020, and both product sales and rental revenue diminished during the first half of fiscal year 2021 as a result of significant uncertainty in the outlook for oil and gas exploration. Recently, crude oil prices have increased, which will likely result in higher cash flows for exploration and production (\"E&P\") companies. We believe E&P companies are allocating their increased levels of cash flows toward debt reduction and shareholder reward initiatives, such as stock buy-back programs and dividend payments. We expect low demand for our Oil and Gas Markets products until E&P companies redirect their cash flows toward investments in exploration activities, especially seismic exploration. Any material changes in oil and gas prices or other market trends, like slowing growth of the global economy, could adversely impact seismic exploration activity and would likely affect the demand for our products and could materially and adversely affect our results of operations and liquidity.\nGenerally, imbalances in the supply and demand for oil and gas will affect oil and gas prices and, in such circumstances, demand for our oil and gas products may be adversely affected when world supplies exceed demand.\nThe Ongoing Armed Conflict Between Russia and Ukraine Could Adversely Affect Our Business, Financial Condition, and Results of Operations, including our ability to repatriate cash from Russia\nA portion of our oil and gas product manufacturing is conducted through our wholly-owned subsidiary, Geospace Technologies Eurasia LLC, which is based in the Russian Federation. In February 2022, the Russian Federation launched a full-scale military invasion of Ukraine, and Russia and Ukraine continue to engage in active and armed conflict as of November 2022. Although the length and impact of the ongoing military conflict is highly unpredictable, the conflict in Ukraine could lead to market disruptions, including significant volatility in commodity prices, credit and capital markets, as well as supply chain interruptions in addition to any direct impact on our operations in Russia. As a result of the invasion, the governments of several western nations, including the U.S., Canada, the United Kingdom and the European Union, implemented new and/or expanded economic sanctions and export restrictions against Russia, Russian-backed separatist regions in Ukraine, certain banks, companies, government officials, and other individuals in Russia and Belarus. The implementation of these sanctions and export restrictions, in combination with the withdrawal of numerous private companies from the Russian market, has had, and is likely to continue to have, a negative impact on the companys business in the region. In fiscal year 2022, we imported $1.9 million of products from Geospace Technologies Eurasia LLC for resale elsewhere in the world. The rapid changes in rules and implementation of new rules on imports and exports of goods involving Russia has also led to serious delays in getting goods to or from Russia as port authorities struggle to keep up with the changing environment. If imports of these products from the Russian Federation are restricted by government regulation, we may be forced to find other sources for the manufacturing of these products at potentially higher costs. Likewise, restrictions on our ability to send products to our subsidiary in Russia may force our subsidiary to have to find other sources for the manufacturing of these products at potentially higher costs; however, our exports to Geospace Technologies Eurasia LLC have historically been limited. Boycotts, protests, unfavorable regulations, additional governmental sanctions and other actions in the region could also adversely affect our ability to operate profitably. Delays in obtaining governmental approvals can affect our ability to timely deliver our products pursuant to contractual obligations, which could result in us being liable to our customers for damages. The risk of doing business in the Russian Federation and other economically or politically volatile areas could adversely affect our operations and earnings. It is possible that increasing sanctions, export controls, restrictions on access to financial institutions, supply and transportation challenges, or other circumstances or considerations could necessitate a reduction, or even discontinuation, of operations by Geospace Technologies Eurasia LLC or other business in Russia.\nWe are actively monitoring the situation in Ukraine and Russia and assessing its impact on our business, including our wholly-owned subsidiary Geospace Technologies Eurasia LLC. The net carrying value of this subsidiary on our consolidated balance sheet at September 30, 2022 was $6.0 million, including cash of $1.8 million. In response to sanctions imposed by the U.S. and others on Russia, the Russian government has imposed restrictions on companies abilities to repatriate or otherwise remit cash from their Russian-based operations to locations outside of Russia. As a result, this cash can be used in our Russian operations, but we may be unable to transfer it out of Russia without incurring substantial costs, if at all. In addition to the $1.9 million of products we imported from Geospace Technologies Eurasia LLC in fiscal year 2022, the subsidiary also generated $1.9 million in revenue from domestic sales in fiscal year 2022. We have no way to predict the duration, progress or outcome of the military conflict in Ukraine. The extent and duration of the military action, sanctions, and resulting market disruptions could be significant and could potentially have substantial impact on the global economy and our business for an unknown period of time.\nOur Foreign Subsidiaries and Foreign Marketing Efforts Are Subject to Additional Political, Economic, Legal and Other Uncertainties Not Generally Associated with Domestic Operations\nBased on customer billing data, revenue to customers outside the United States accounted for approximately 60% of our revenue during fiscal year 2022; however, we believe the percentage of revenue outside the United States is likely higher since many of our products are first delivered to a domestic location and ultimately shipped to a foreign location. We again expect revenue outside of the United States to represent a substantial portion of our revenue for fiscal year 2023 and subsequent years.\nForeign revenue is subject to special risks inherent in doing business outside of the United States, including the risk of war, terrorist activities, civil disturbances, embargo and government activities, shifting foreign attitudes about conducting business activities with the United States, restrictions of the movement and exchange of funds, inhibitions of our ability to collect accounts receivable or repossess our rental equipment, international sanctions, expropriation and nationalization of our assets or those of our customers, currency fluctuations, devaluations and conversion restrictions, confiscatory taxation or other adverse tax policies and governmental actions that may result in the deprivation of our contractual rights, all of which may disrupt markets or our operations.\nForeign revenue is also generally subject to the risk of compliance with additional laws, including tariff regulations and import and export restrictions. International revenue transactions for our products containing hydrophones require prior U.S. government approval in the form of an export license, which may be withheld by the U.S. government based upon factors which we cannot predict.\nWe may experience difficulties in connection with future foreign revenue. Additionally, due to foreign laws and restrictions, should we experience substantial growth in certain foreign markets, for example in the Russian Federation, we may not be able to transfer cash balances to the United States to assist with debt servicing or other obligations.\nIncreases in Tariffs, Trade Restrictions or Taxes on our Products Could Have an Adverse Impact on our Operations.\nIn fiscal year 2022, customers outside the United States accounted for approximately 60% of our revenues. We also purchase a portion of our raw materials from suppliers in China and other foreign countries. The commerce we conduct in the international marketplace makes us subject to tariffs, trade restrictions and other taxes when the raw materials we purchase, and the products we ship, cross international borders. Trade tensions between the United States and China, as well as those between the U.S. and Canada, Mexico and other countries have been escalating in recent years. Trade tensions have led to a series of tariffs imposed by the U.S. on imports from China, as well as retaliatory tariffs imposed by China on imports from the U.S. If the U.S. and China are able to negotiate the issues to restore a mutually advantageous and fair trading regime, the increased tariffs could be eliminated. Certain raw materials we purchase from China are subject to these tariffs which has increased our manufacturing costs. Products we sell into certain foreign markets could also become subject to similar retaliatory tariffs, making the products we sell uncompetitive to similar products not subjected to such import tariffs. Further changes in U.S. trade policies, tariffs, taxes, export restrictions or other trade barriers, or restrictions on raw materials including rare earth minerals, may limit our ability to produce products, increase our manufacturing costs, decrease our profit margins, reduce the competitiveness of our products, or inhibit our ability to sell products or purchase raw materials, which could have a material adverse effect on our business, results of operations or financial conditions.\nClimate Change and Legislation Designed to Reduce Climate Change\nThe physical and regulatory effects of climate change could have a negative impact on our operations, our customers operations and the overall demand for our customers products and, accordingly, our services. There is an increasing focus of local, state, regional, national and international regulatory bodies on Greenhouse Gas (\"GHG\") emissions and climate change issues. Legislation to regulate GHG emissions has periodically been introduced in the U.S. Congress, and there has been a wide-ranging policy debate, both in the United States and internationally, regarding the impact of these gases and possible means for their regulation. These efforts have included consideration of cap-and-trade programs, carbon taxes, GHG reporting and tracking programs and regulations that directly limit GHG emissions from certain sources. Some of the proposals would require industries to meet stringent new standards that would require substantial reductions in carbon emissions. Those reductions could be costly and difficult to implement. In the absence of federal GHG-limiting legislation, the EPA has determined that GHG emissions present a danger to public health and the environment and has adopted regulations that, among other things, establish construction and operating permit reviews for GHG emissions from certain large stationary sources, require the monitoring and annual reporting of GHG emissions from certain oil and natural gas system sources, implement Clean Air Act emission standards directing the reduction of methane emissions from certain new, modified, or reconstructed facilities in the oil and natural gas sector, and together with the DOT, implement GHG emissions limits on vehicles manufactured for operation in the United States.\nIn April 2016, the United States signed the Paris Agreement, which requires countries to review and represent a progression in their nationally determined contributions, which set emissions reduction goals, every five years. Under the Paris Agreement, the Biden Administration has committed the United States to reducing its greenhouse gas emissions by 50-52% from 2005 levels by 2030. In November 2021, the Unites States and other countries entered into the Glasgow Climate Pact, which includes a range of measures designed to address climate change, including, but not limited to the phase-out of fossil fuel subsidies, reducing methane emissions 30% by 2030, and cooperating toward the advancement of the development of clean energy. Several states and geographic regions in the United States have also adopted legislation and regulations to reduce emissions of GHGs, including cap and trade regimes and commitments to contribute to meeting the goals of the Paris Agreement.\nGovernmental, scientific, and public concern over the threat of climate change arising from GHG emissions has resulted in increasing political risks in the United States. President Biden and Congress have identified climate change as a priority, and it is likely that additional executive orders, regulatory action, and/or legislation targeting greenhouse gas emissions, or prohibiting or restricting oil and gas development activities in certain areas, will be proposed and/or promulgated during the Biden Administration. President Biden issued an executive order imposing a moratorium on new oil and gas leasing on federal lands and offshore waters pending completion of a comprehensive review and reconsideration of federal oil and gas permitting and leasing practices. President Bidens order also establishes climate change as a primary foreign policy and national security consideration, affirms that achieving net-zero greenhouse gas emissions by or before midcentury is a critical priority, affirms the Biden Administrations desire to establish the United States as a leader in addressing climate change, generally further integrates climate change and environmental justice considerations into government agencies decision-making, and eliminates fossil fuel subsidies, among other measures. Other actions impacting oil and natural gas production activities that could be pursued by the Biden administration may include more restrictive requirements for the establishment of pipeline infrastructure or the permitting of liquified natural gas export facilities.\nIt is not possible at this time to predict the timing and effects of climate change or whether additional climate-related legislation, regulations or other measures will be adopted at the local, state, regional, national and international levels. However, continued efforts by governments and non-governmental organizations to reduce GHG emissions appear likely, and additional legislation, regulation or other measures that control or limit GHG emissions or otherwise seek to address climate change could adversely affect our customers and our business. Because our business depends on the level of oil exploration, existing or future laws or regulations related to GHGs and climate change, including incentives to conserve energy or use alternative energy sources, could have a negative impact on our business if such laws or regulations reduce demand for our customers products and, accordingly, our services.\nThese political, litigation, and financial risks may result in our customers restricting or cancelling exploration or production activities which also could reduce demand for our products and services. In addition to regulatory impacts, the occurrence of weather events caused or exacerbated by climate change could impact local, national or global commodity demand or availability in ways that could be material to our business and/or the business of our customers.\nWe Operate in Highly Competitive Markets and Our Competitors May Be Able to Provide Newer or Better Products Than We Are Able to Provide\nThe markets for most of our products are highly competitive. Many of our existing and potential competitors have substantially greater marketing, financial and technical resources than we do. Some competitors currently offer a broader range of instruments and equipment for sale than we do and may offer financing arrangements to customers on terms that we may not be able to match. In addition, new competitors may enter the market and competition could intensify.\nRevenue from our products may not continue at current volumes or prices if current competitors or new market entrants introduce new products with better features, performance, price or other characteristics than our products. Competitive pressures or other factors may also result in significant price competition that could have a material adverse effect on our results of operations.\nA Continued General Downturn in the Economy in Future Periods May Adversely Affect Our Business\nEconomic slowdowns, currently or in the future, in the United States, China or India, could adversely affect our business in ways that we cannot predict. During times of economic slowdown, our customers may reduce their capital expenditures and defer or cancel pending projects and product orders. Such developments occur even among customers that are not experiencing financial difficulties. During times of economic slowdowns, some of our customers have (and other customers may have) undergone restructuring or bankruptcy that has or could adversely impact our revenues and profitability. Any economic downturn may adversely affect the demand for oil and gas generally or cause volatility in oil and gas commodity prices and, therefore, adversely affect the demand for delivery of our oil and gas products. It could also adversely affect the demand for consumer and industrial products, which could in turn adversely affect our Adjacent Markets business segment. To the extent these factors adversely affect other companies in the industries we serve, there could be an oversupply of products and services and downward pressure on pricing for our products and services, which could adversely affect us. Additionally, bankruptcies or financial difficulties among our oil and gas customers could reduce our cash flows and adversely impact our liquidity and profitability. For a discussion of the customers of our oil and gas products, see The Limited Market for Our Oil and Gas Products Can Affect Our Revenue, below.\nRisks Associated with Our Business Strategy and Operations\nOur New Products Require a Substantial Investment by Us in Research and Development Expense and May Not Achieve Market Acceptance\nOur outlook and assumptions are based on various macro-economic factors and internal assessments, and actual market conditions could vary materially from those assumed. In recent years, we have incurred significant expenditures to fund our research and development efforts, and we intend to continue those expenditures in the future. However, research and development is by its nature speculative, and we cannot assure that these expenditures will result in the development of new products or services or that any new products and services we have developed recently or may develop in the future will be commercially marketable or profitable to us. In particular, we have incurred substantial expenditures to develop our oil and gas nodal seismic data acquisition systems, as well as other products for PRM applications. In addition, we try to use some of our capabilities to supply products to new adjacent and emerging markets. We cannot assure that we will realize our expectations regarding acceptance of and revenue generated by our new products and services in existing or new markets.\nThe Short-Term Nature of Our Order Backlog for Sales of Our Oil and Gas Products and Delayed or Canceled Customer Orders May Cause Us to Experience Fluctuations in Quarterly Results of Operations\nHistorically, the rate of new orders for the sale of our oil and gas products has varied substantially from quarter to quarter. Moreover, we typically operate, and expect to continue operating, on the basis of orders in-hand for our products before we commence substantial manufacturing runs. The short-term nature of our order backlog for most of our oil and gas products generally does not allow us to predict with any accuracy demand for our products more than approximately three months in advance. Thus, our ability to replenish orders and the completion of orders, particularly large orders for deep water PRM projects, can significantly impact our operating results and cash flow for any quarter, and results of operations for any one quarter may not be indicative of results of operations for future quarters.\nAdditionally, customers can delay or even cancel orders and rental contracts before product delivery occurs. For larger orders which generally require us to make a substantial capital investment in our inventories or rental fleet, we attempt to negotiate for a non-refundable deposit or cancellation penalties depending on our relationship with the customer. However, such deposits or penalties, even when obtained, may not fully compensate us for our inventory investment and forgone profits if the order is ultimately cancelled.\nThese periodic fluctuations in our operating results and the impact of any order delays/cancellations could adversely affect our stock price.\nOur Credit Risk Could Increase and We May Incur Bad Debt Write-Offs If Our Customers Continue to Face Difficult Economic Circumstances\nWhile we believe that our allowance for bad debts is adequate in light of known circumstances, additional amounts attributable to uncollectible accounts and notes receivable and bad debt write-offs may have a material adverse effect on our future results of operations. Many of our oil and gas customers are not well capitalized and as a result cannot always pay our invoices when due. We have in the past incurred write-offs in our accounts and notes receivable due to customer credit problems. We have found it necessary from time to time to extend trade credit, including promissory notes, to long-term customers and others where some risks of non-payment exist. Many of our oil and gas customers continue to experience significant liquidity difficulties, which increase those credit risks, due to prolonged periods of low crude oil prices. An increase in the level of bad debts and any deterioration in our credit risk could adversely affect the price of our stock. In addition, we rent equipment to our oil and gas customers who utilize such equipment in various countries around the world. If these customers experience financial difficulties, it could be difficult or impossible to retrieve our rental equipment from foreign countries.\nThe Industries in Which We Operate are Characterized by Rapid Technological Development and Product Obsolescence, Which May Affect Our Ability to Provide Product Enhancements or New Products on a Timely and Cost-Effective Basis\nOur instruments and equipment are constantly undergoing rapid technological improvement. Our future success depends on our ability to continue to:\nimprove our existing product lines,\naddress the increasingly sophisticated needs of our customers,\nmaintain a reputation for technological leadership,\nmaintain market acceptance of our products,\nanticipate changes in technology and industry standards,\nrespond to technological developments on a timely basis and\ndevelop new markets for our products and capabilities.\nCurrent competitors or new market entrants may develop new technologies, products or standards that could render our products obsolete. We cannot assure you that we will be successful in developing and marketing, on a timely and cost effective basis, product enhancements or new products that respond to technological developments, that are accepted in the marketplace or that comply with new industry standards. Additionally, in anticipation of customer product orders, from time to time we acquire substantial quantities of inventories, which if not sold or integrated into products within a reasonable period of time, could become obsolete. In such case, we would be required to impair the value of such inventories on our balance sheet.\nThe Limited Market for Our Oil and Gas Markets and Emerging Markets Products Can Affect Our Revenue\nIn our Oil and Gas Markets segment, we generally market many of our products to seismic service contractors. We estimate that fewer than 30 oil and gas seismic contracting companies are currently operating in countries other than those operating in the Russian Federation and the former Soviet Union, India, the Peoples Republic of China and certain Eastern European countries, where such information is difficult to verify. We estimate that fewer than 15 seismic contractors are engaged in marine seismic exploration activities. Due to these market factors, a relatively small number of customers, some of whom are experiencing financial difficulties, account for most of our oil and gas product revenue. From time to time, these contractors have sought to vertically integrate and acquire our competitors, which has influenced their supplier decisions before and after such transactions. In addition, consolidation among our customers may further concentrate our business to a limited number of customers and expose us to increased risks related to dependence on a small number of customers. We market our seabed PRM systems products to large oil and gas companies. Since this products introduction in 2002, we have received system orders from three offshore oil and gas operators: BP, Shell and Equinor, which have accounted for a significant portion of our revenue in fiscal year 2014 and prior fiscal years. We have not received any orders for large-scale seabed PRM systems since November 2012. Our emerging markets segment primarily sells its products to a small number of agencies within the U.S. government. The loss of a small number of these customers, and particularly our oil and gas customers, could materially and adversely impact our future revenues.\nWe Cannot Be Certain of the Effectiveness of Patent Protection on Our Products\nWe hold and from time to time apply for certain patents relating to some of our products. We cannot assure you that our patents will prove enforceable or free of challenge, that any patents will be issued for which we have applied or that competitors will not develop functionally similar technology outside the protection of any patents we have or may obtain.\nOur Strategy of Renting Our Oil and Gas Seismic Products Exposes Us to Additional Risks Relating to Equipment Recovery, Rental Renewals, Technological Obsolescence and Impairment of Assets\nOur rental fleet of oil and gas seismic equipment represents a significant portion of our assets and accounts for a significant portion of our revenue. Equipment we rent to our customers is frequently located in foreign countries where retrieval of the equipment after the termination of the rental agreement is difficult or impossible if the customer does not return the equipment. The costs associated with retrieving this equipment or the loss of equipment that is not retrieved could be significant and could adversely affect our operations and earnings.\nThe advancement of seismic technology having a significant competitive advantage over the equipment in our rental fleet could have an adverse effect on our ability to profitably rent and/or sell this equipment. Significant improvements in technology may also require us to record asset impairment charges to write-down the value of our rental fleet investment and to invest significant sums to upgrade or replace our rental fleet with newer equipment demanded by our customers. In addition, rental contracts may not be renewed for equipment in our rental fleet. Significant technology improvements by our competitors could have an adverse effect on our results of operations and earnings.\nOur equipment rental business has high fixed costs, which primarily consist of depreciation expenses. In periods of declining rental revenue, these fixed costs generally do not decline. As a result, any significant decline in rental revenue caused by reduced demand could adversely affect our results of operations.\nOur Expansion into the Border and Perimeter Security Market May Not Be Successful\nWe have not previously operated in the border and perimeter security marketplace prior to our 2018 acquisition of Quantum. Quantum is also a relatively recent entrant into this marketplace, and Quantum was not cash-flow positive when we acquired it. In fiscal year 2021, we completed our first contract with the U.S. Customs and Border Protection (CBP), except for on-going service and maintenance. While we will continue to devote management time and resources, financial and otherwise, to develop our business in this marketplace, our lack of experience in this market makes it difficult to estimate our financial returns from this business. In addition, some of the customers for this business will be governmental entities and contracting with those entities can be difficult, costly, and unpredictable. We do not have extensive experience in government contracting, and so we may not win, retain, or perform under such future contracts in a manner that is profitable. If we are not successful in this emerging market segment, it will negatively impact our financial performance and could negatively impact our reputation and harm our other business segments.\nCybersecurity Breaches and Other Disruptions of Our Information Technology Network and Systems Could Adversely Affect Our Business\nWe rely on information technology networks and systems, some of which are owned and operated by third parties, to process, transmit and store electronic information. In particular, we depend on our information technology infrastructure for a variety of functions, including worldwide financial reporting, inventory management, procurement, invoicing and email communications. Any of these systems may be susceptible to outages due to fire, floods, power loss, telecommunications failures, terrorist attacks and similar events. Despite the implementation of network security measures, our systems and those of third parties on which we rely may also be vulnerable to computer viruses, break-ins, malware and similar disruptions. Malware, if surreptitiously installed on our systems and not timely detected and removed, could collect and disclose sensitive information relating to our customers, employees or others, exposing us to legal liability and causing us to suffer reputational damage. It could also lead to disruptions in critical systems or the corruption or destruction of critical data. If we are unable to prevent such outages and breaches, these events could damage our reputation and lead to financial losses from remedial actions, loss of business or potential liability.\nWe Rely on Key Suppliers for Certain Components Used in Our Products\nCertain models of our oil and gas marine wireless products require a timing device we purchase from a United States manufacturer. We currently do not possess the ability to manufacture this component and have no other reliable source for this device. If this manufacturer were to discontinue its production of this timing device, were to become unwilling to contract with us on competitive terms or were unable to supply the component in sufficient quantities to meet our requirements, our ability to compete in the marine wireless marketplace could be impaired, which could adversely affect our financial performance.\nFor our imaging products, we purchase all of our thermal film from one manufacturer. Except for the film sold to us by this manufacturer, we know of no other source for thermal film that performs as well in our imaging equipment. If the manufacturer were to discontinue producing thermal film, were to become unwilling to contract with us on competitive terms or were unable to supply thermal film in sufficient quantities to meet our requirements, our ability to compete in the direct thermal imaging marketplace could be impaired, which could adversely affect our financial performance.\nOur Success Depends Upon a Limited Number of Key Personnel\nOur success depends on attracting and retaining highly skilled professionals. A number of our employees are highly-skilled engineers and other professionals. In addition, our success depends to a significant extent upon the abilities and efforts of the members of our senior management team. If we fail to continue to attract and retain such professionals, our ability to compete in the industry could be adversely affected.\nWe Have a Minimal Disaster Recovery Program at Our Houston Facilities\nDue to its proximity to the Texas Gulf Coast, our facilities in Houston, Texas are annually subject to the threat of hurricanes, and the aftermath that follows. Hurricanes may cause, among other types of damage, the loss of electrical power for extended periods of time. If we lost electrical power at our Pinemont facility, or if a fire or other natural disaster occurred, we would be unable to continue our manufacturing operations during the power outage because we do not own a generator or any other back-up power source large enough to provide for our manufacturing power consumption needs. Additionally, we do not have an alternative manufacturing or operating location in the United States. Therefore, a significant disruption in our manufacturing operations could materially and adversely affect our business operations during an extended period of a power outage, fire or other natural disaster. We have a back-up generator to provide power for our information technology operations. We store our back-up data offsite and we replicate our mission critical data to an alternative cloud-based data center on a real-time basis. In the event of a major service interruption in our data center, we believe we would be able to activate our mission critical applications within less than 24 hours.\nOur Credit Agreement Imposes Restrictions on Our Business\nWe and several of our subsidiaries domiciled in the United States are parties to a credit agreement. Amounts available for borrowing under the credit agreement are determined by a borrowing base, which is determined based upon certain of our domestic assets. Borrowings under the credit agreement will be principally secured by certain domestic assets. In addition, certain of our domestic subsidiaries have guaranteed our obligations under the credit agreement and such subsidiaries have secured the obligations by pledging certain assets. The credit agreement limits the incurrence of additional indebtedness, contains a covenant that requires us to maintain a certain amount of consolidated tangible net worth and contains other covenants customary in agreements of this type. Our ability to comply with these restrictions may be affected by events beyond our control, including, but not limited to, prevailing economic, financial and industry conditions and continuing declines in our product revenue. The breach of any of these covenants or restrictions, as well as any failure to make a payment of interest or principal when due, could result in a default under the credit agreement. Such a default would permit our lender to declare any amounts borrowed from it to be due and payable, together with accrued and unpaid interest, and our ability to borrow under the credit agreement could be terminated. If we are unable to repay any debts owed to our lender, the lender could proceed against the collateral securing such debt. While we intend to seek alternative sources of cash in such a situation, there is no guarantee that any alternative cash source would be available or would be available on terms favorable to us.\nReliance on Third Party Subcontractors Could Adversely Affect Our Results of Operations and Reputation\nWe may rely on subcontractors to complete certain projects. The quality and timing of production and services by our subcontractors is not totally under our control. Reliance on subcontractors gives us less control over a project and exposes us to significant risks, including late delivery, substandard quality and high costs. The failure of our subcontractors to deliver quality products or services in a timely manner could adversely affect our profitability and reputation.\nThe High Fixed Costs of Our Operations Could Adversely Affect Our Results of Operations\nWe have a high fixed cost structure primarily consisting of (i) depreciation expenses associated with our rental equipment and (ii) fixed manufacturing costs including salaries and benefits, taxes, insurance, maintenance, depreciation and other fixed manufacturing costs. In regards to our rental equipment, large declines in the demand for rental equipment could result in substantial operating losses due to the on-going fixed nature of rental equipment depreciation expense. Concerning our product manufacturing costs, in periods of low product demand our fixed costs generally do not decline or may decline only in modest increments. Therefore, lower demand for our rental equipment and manufactured products could adversely affect our results of operations.\nLegal and Compliance Risks\nOur Global Operations Expose Us to Risks Associated with Conducting Business Internationally, Including Failure to Comply with U.S. Laws Which Apply to International Operations, Such as the Foreign Corrupt Practices Act and U.S. Export Control Laws, as Well as the Laws of Other Countries\nWe have offices in Brazil, Colombia, Canada, China, the Russian Federation and the United Kingdom, in addition to our offices in the United States. In addition to the risks that are inherent in conducting business internationally, we are also liable for compliance with international and U.S. laws and regulations that apply to our international operations. These laws and regulations include data privacy requirements, labor relations laws, tax laws, anti-competition regulations, import and trade restrictions, export control laws, U.S. laws such as the Foreign Corrupt Practices Act and similar laws in other countries which also prohibit certain payments to governmental officials or certain payments or remunerations to customers. Many of our products are subject to U.S. export law restrictions that limit the destinations and types of customers to which our products may be sold, or require an export license in connection with revenue transactions outside the United States. Given the high level of complexity of these laws, there is a risk that some provisions may be inadvertently breached, for example through the negligent or the unauthorized intentional behavior of individual employees, our failure to comply with certain formal documentation requirements or otherwise. Additionally, we may be held liable for actions taken by our local dealers and partners. Violations of these laws and regulations could result in fines, criminal sanctions against us, our officers or our employees, and prohibitions on the conduct of our business. Any such violations could include prohibitions on our ability to offer our products in one or more countries and could materially damage our reputation, our brands, our international expansion efforts, our ability to attract and retain employees, our business and our operating results.\nBecause We Have No Plans to Pay Any Dividends for the Foreseeable Future, Investors Must Look Solely to Stock Appreciation for a Return on Their Investment in Us\nWe have not paid cash dividends on our common stock since our incorporation and do not anticipate paying any cash dividends in the foreseeable future. Any payment of cash dividends in the future will be dependent on the amount of funds legally available, our financial condition, capital requirements, loan covenants and other factors that our Board of Directors may deem relevant. Accordingly, investors must rely on sales of their common stock after price appreciation, which may never occur, as the only way to realize any future gains on their investment.\nWe Have a Relatively Small Public Float, and Our Stock Price May be Volatile\nAt September 30, 2022, we have approximately 12.2 million shares outstanding held by non-affiliates. This limited number of shares outstanding results in a relatively limited market for our common stock. Our daily trading volume for the year ended September 30, 2022 averaged approximately 48,000 shares. Our small float and daily trading volumes have in the past caused, and may in the future result in, significant volatility in our stock price.\nFinancial and Accounting Risks\nUnfavorable Currency Exchange Rate Fluctuations Could Adversely Affect Our Results of Operations\nSubstantially all of our third-party revenue from the United States is invoiced in U.S. dollars, though from time to time we may invoice revenue transactions in foreign currencies including intercompany sales. As a result, we may be subject to foreign currency fluctuations on our revenue. The reporting currency for our financial statements is the U.S. dollar. However, the assets, liabilities, revenue and costs of our Russian, Canadian and United Kingdom subsidiaries and our Brazilian, Chinese and Colombian branch offices are denominated in currencies other than U.S. dollars. To prepare our consolidated financial statements, we must translate those assets, liabilities, revenue and expenses into U.S. dollars at then-applicable exchange rates. Consequently, increases and decreases in the value of the U.S. dollar versus these other currencies will affect the amount of these items in our consolidated financial statements, even if their value has not changed in their original currency. These translations could result in significant changes to our results of operations from period to period. For the fiscal year ended September 30, 2022, approximately 8% of our consolidated revenue was related to the operations of our foreign subsidiaries and branches.\nOur Long-Lived Assets May be Subject to Impairment\nWe periodically assess our long-lived assets for impairment. Significant sustained future decreases in crude oil and natural gas prices may require us to write down the value of our long-lived assets in our Oil and Gas Markets business segment, including our manufacturing facilities, manufacturing equipment and rental equipment if future cash flows anticipated to be generated from these assets fall below the assets net book value. Furthermore, we may be required to write down the value of other intangible assets related to our acquisitions of Quantum, the OptoSeis® fiber optic sensing technology or the goodwill and other intangible assets related to our Aquana acquisition if sufficient cash flows are not generated to recover the carrying value of such assets. If we are forced to write down the value of our long-lived assets, these noncash asset impairments could adversely affect our results of operations.\nShould We Fail to Maintain an Effective System of Internal Control Over Financial Reporting, We May Not Be Able to Accurately Report Our Financial Results and Prevent Material Fraud, Which Could Adversely Affect the Value of Our Common Stock\nEffective internal control over financial reporting is necessary for us to provide reliable financial reports and effectively prevent and detect material fraud. If we cannot provide reliable financial reports or prevent or detect material fraud, our operating results could be misstated. There can be no assurances that we will be able to prevent control deficiencies from occurring which could cause us to incur unforeseen costs, negatively impact our results of operations, cause the market price of our common stock to decline, or have other potential adverse consequences. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nAs of September 30, 2022, our operations included the following locations:\nLocation\nOwned/Leased\nApproximate\nSquare\nFootage/Acreage\nUse\nSegment (see notes below)\nHouston, Texas\nOwned\n387,000\nSee Note 1 below\n6 and 7\nHouston, Texas\nOwned\n30,000\nSee Note 2 below\nHouston, Texas\nOwned\n17.3 acres\nSee Note 3 below\nAustin, Texas\nLeased\n9,000\nSee Note 4 below\nMelbourne, Florida\nLeased\n7,000\nSee Note 5 below\nUfa, Bashkortostan, Russia\nOwned\n120,000\nManufacturing, sales and service\nCalgary, Alberta, Canada\nOwned\n45,000\nManufacturing, sales and service\n6 and 7\nLuton, Bedfordshire, England\nOwned\n8,000\nSales and service\nBeijing, China\nLeased\n1,000\nSales and service\nBogotá, Colombia\nOwned\n19,000\nSales and service\n(1)This property is located at 7007 Pinemont Drive in Houston, Texas (the Pinemont Facility). The Pinemont Facility contains substantially all manufacturing activities and all engineering, selling, marketing and administrative activities for us in the United States. The Pinemont Facility also serves as our international corporate headquarters.\n(2)This property is located at 6410 Langfield Road in Houston, Texas. This facility provides additional warehousing and maintenance and repair capacity for our marine rental equipment operations.\n(3)This property is located adjacent to the Pinemont Facility. It is currently being used as additional parking for the Pinemont Facility and legacy structures are being used to support our manufacturing and warehousing operations.\n(4)This property is located at 8701 Cross Park Drive, Suite 100, in Austin, Texas. This facility supports the majority of our OptoSeis® research and development and engineering operations.\n(5)This property is located at 5700 N. Harbor City Blvd., Suite 100, in Melbourne, Florida. This facility contains all the operations of Quantum.\n(6)Oil and Gas Markets.\n(7)Adjacent Markets\n(8)Emerging Markets Item 3. Legal Proceedings\nWe are involved in various pending legal actions in the ordinary course of our business. Management is unable to predict the ultimate outcome of these actions, because of the inherent uncertainty of litigation. However, management believes that the most probable, ultimate resolution of currently pending matters will not have a material adverse effect on our consolidated financial position, results of operations or cash flows. Item 4. Mine Safety Disclosures\nNone.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nHolders of Record\nOur common stock is traded on The NASDAQ Global Select Market under the symbol GEOS. On October 31, 2022, there were approximately 139 holders of record of our common stock, and the closing price per share on such date was $4.04 as quoted by The NASDAQ Global Select Market.\nMarket Information for Common Stock\nThe following table shows the high and low per share sales prices for our common stock reported on The NASDAQ Global Select Market.\nYear Ended September 30, 2022:\nLow\nHigh\nFourth Quarter\n$\n4.10\n$\n5.45\nThird Quarter\n4.64\n6.72\nSecond Quarter\n4.97\n8.88\nFirst Quarter\n6.41\n10.27\nYear Ended September 30, 2021:\nFourth Quarter\n$\n7.78\n$\n10.94\nThird Quarter\n7.30\n9.36\nSecond Quarter\n8.15\n12.40\nFirst Quarter\n5.02\n10.29\nDividends\nSince our initial public offering in 1997, we have not paid dividends, and we do not intend to pay cash dividends on our common stock in the foreseeable future. We presently intend to retain our earnings for use in our business, with any future decision to pay cash dividends dependent upon our growth, profitability, financial condition and other factors our Board of Directors may deem relevant.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe following equity plan information is provided as of September 30, 2022:\nEquity Compensation Plan Information\nPlan Category\nNumber of Securities\nto be Issued upon\nExercise of\nOutstanding Options,\nWarrants and Rights\n(a)\nWeighted-average\nExercise Price of\nOutstanding Options,\nWarrants and Rights\n(b)\nNumber of Securities\nRemaining Available\nfor Future Issuance\nUnder Equity\nCompensation Plans\n(Excluding Securities\nReflected in Column\n(a)) (c)\n(In shares)\n(In dollars per share)\n(In shares)\nEquity Compensation Plans Approved\nby Security Holders (1)\n367,859\nN/A\n1,402,916\nEquity Compensation Plans Not\nApproved by Security Holders\n-\n-\n-\nTotal\n367,859\nN/A\n1,402,916\n(1)The number of securities shown in column (c) represents number of securities remaining available for issuance under the Companys 2014 Long Term Incentive Plan, as amended (the 2014 Plan). The 2014 Plan allows for the issuance of restricted stock awards, performance stock awards, performance stock unit awards, restricted stock unit awards (the foregoing, Full Value Awards), stock options and stock appreciation rights. For purposes of calculating the number of securities remaining under the 2014 Plan in column (c), Full Value Awards are counted as 1.5 shares for each share awarded. The number of securities shown\nin column (a) of the table above represents restricted stock unit awards outstanding under the 2014 Plan. Column (b) excludes restricted stock unit awards.\nRecent Sales of Unregistered Securities and Use of Proceeds\nNone.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone.  Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following is managements discussion and analysis of the major elements of our consolidated financial statements. You should read this discussion and analysis together with our consolidated financial statements, including the accompanying notes, and other detailed information appearing elsewhere in this Annual Report on Form 10-K, including under the heading Risk Factors. The discussion of our financial condition and results of operations includes various forward-looking statements about our markets, the demand for our products and services and our future plans and results. These statements are based on assumptions that we consider to be reasonable, but that could prove to be incorrect. For more information regarding our assumptions, you should refer to the section entitled Cautionary Note Regarding Forward-Looking Statements and Assumptions below.\nCautionary Note Regarding Forward-Looking Statements and Assumptions\nThis Annual Report on Form 10-K and the documents incorporated by reference herein, if any, contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements can be identified by terminology such as may, will, should, intend, expect, plan, budget, forecast, anticipate, believe, estimate, predict, potential, continue, evaluating or similar words. Statements that contain these words should be read carefully because they discuss our future expectations, contain projections of our future results of operations or of our financial position or state other forward-looking information. Examples of forward-looking statements include, among others, statements that we make regarding our expected operating results, the adoption, results and success of our rollout of our Aquana smart water valves and cloud-based control platform, future demand for our Quantum security solutions, the adoption and sale of our products in various geographic regions, potential tenders for PRM systems, future demand for OBX systems, the completion of new orders for our channels of our GCL system, the fulfillment of customer payment obligations, the impact of and the recovery from the impact of the coronavirus (or COVID-19) pandemic, the impact of the current armed conflict between Russia and Ukraine, our ability to manage changes and the continued health or availability of management personnel, volatility and direction of oil prices, anticipated levels of capital expenditures and the sources of funding therefor, and our strategy for growth, product development, market position, financial results and the provision of accounting reserves. These forward-looking statements reflect our current judgment about future events and trends based on the information currently available to us. However, there will likely be events in the future that we are not able to predict or control. The factors listed under the caption Risk Factors, as well as cautionary language in this Annual Report on Form 10-K, provide examples of risks, uncertainties and events that may cause our actual results to differ materially from the expectations we describe in our forward-looking statements. Such examples include, but are not limited to, the failure of the Quantum or OptoSeis® or Aquana technology transactions to yield positive operating results, decreases in commodity price levels and continued adverse impact of COVID-19 which could reduce demand for our products, the failure of our products to achieve market acceptance (despite substantial investment by us) our sensitivity to short term backlog, delayed or cancelled customer orders, product obsolescence resulting from poor industry conditions or new technologies, bad debt write-offs associated with customer accounts, inability to collect on promissory notes, lack of further orders for our OBX systems, failure of our Quantum products to be adopted by the border and perimeter security market, or a decrease in such market due to governmental changes, and infringement or failure to protect intellectual property. The occurrence of the events described in these risk factors and elsewhere in this Annual Report on Form 10-K could have a material adverse effect on our business, results of operations and financial position, and actual events and results of operations may vary materially from our current expectations. We assume no obligation to revise or update any forward-looking statement, whether written or oral, that we may make from time to time, whether as a result of new information, future developments or otherwise, except as required by applicable securities laws and regulations.\nBackground\nWe design and manufacture seismic instruments and equipment and primarily market these products to the oil and gas industry to locate, characterize and monitor hydrocarbon producing reservoirs. We also market our seismic products to other industries for vibration monitoring, border and perimeter security and various geotechnical applications. We design and manufacture other products of a non-seismic nature, including water meter products, imaging equipment and provide contract manufacturing services. For further informtion on the nature of our operations, see the information under the heading Business in this Annual Report on Form 10-K.\nConsolidated Results of Operations\nAs we have reported in the past, our revenue and operating profits have varied significantly from quarter-to-quarter, and even year-to-year, and are expected to continue that trend in the future, especially when our quarterly or annual financial results are impacted by the presence or absence of relatively large, but somewhat erratic, sales of our oil and gas PRM systems and/or wireless seismic data acquisition systems for land and marine applications.\nWe report and evaluate financial information for three segments: Oil and Gas Markets, Adjacent Markets and Emerging Markets. Summary financial data by business segment follows (in thousands):\nYEAR ENDED SEPTEMBER 30,\nOil and Gas Markets\nTraditional exploration product revenue\n$\n6,597\n$\n4,518\nWireless exploration product revenue\n40,667\n45,751\nReservoir product revenue\n1,877\n1,983\nTotal revenue\n49,141\n52,252\nOperating loss\n(7,539\n)\n(16,229\n)\nAdjacent Markets\nIndustrial product revenue\n25,640\n21,335\nImaging product revenue\n13,531\n11,084\nTotal revenue\n39,171\n32,419\nOperating income\n6,021\n6,423\nEmerging Markets\nRevenue\n10,193\nOperating income (loss)\n(9,128\n)\n5,033\nCorporate\nRevenue\n-\nOperating loss\n(12,490\n)\n(12,098\n)\nConsolidated Totals\nRevenue\n89,253\n94,864\nOperating loss\n(23,136\n)\n(16,871\n)\nOverview\nAlthough in an already depressed oil and gas industry, demand further decreased in February 2020 because of the oversupply of crude oil due to failed OPEC negotiations that led to a dramatic drop in crude oil prices when combined with the impact of the COVID-19 pandemic. These declines in the demand for oil and gas have caused oil and gas exploration and production companies to experience a significant reduction in cash flows, which have resulted in reductions in their capital spending budgets for oil and gas exploration-focused activities, including seismic data acquisition activities. Recently, crude oil prices have rebounded and held above February 2020 levels; however, a lag in time typically occurs between higher oil prices and greater demand for our Oil and Gas Markets segment products. We believe this lag is the result of exploration and production (E&P) companies allocating their cash flow towards shareholder reward initiatives, such as stock buy-back programs and dividend payments, or in debt reduction. We believe this lag is a short-term trend that will continue until E&P companies decide to reinvest capital into exploration activities. As this lag persists, we expect the reduced levels of demand for our Oil and Gas Markets segment products and our rental marine wireless nodal products to continue. We also expect our land-based traditional and wireless products will continue to experience low levels of product demand until our customers consume their excess levels of underutilized equipment. During the third quarter of fiscal year 2022, we experienced increased rental demand for our marine nodal products in the form of additional rental contracts and requests for quotes from existing and new customers.\nIn light of current market conditions, the inventory balances in our Oil and Gas Markets business segment at September 30, 2022 continued to exceed levels we consider appropriate for the current level of product demand. We are continuing to work aggressively to reduce these legacy inventory balances; however, we are also adding new inventories for new wireless product developments and for other product demand in our Adjacent Markets segment. During periods of excessive inventory levels, our policy has been, and will continue to be, to record obsolescence expense as we experience reduced product demand and as our inventories continue to age. As difficult market conditions continue for the products in our Oil and Gas Markets segment, we are recording additional expenses for inventory obsolescence and will continue to do so in the future until product demand and/or resulting inventory turnover return to acceptable levels.\nArmed Conflict Between Russia and Ukraine\nA portion of our oil and gas product manufacturing is conducted through our wholly-owned subsidiary, Geospace Technologies Eurasia LLC, which is based in the Russian Federation. Consequently, our oil and gas business could be directly affected by the current war between Russia and Ukraine. Please see Part I-Item 1A.-Risk Factors for more information.\nCoronavirus (COVID-19)\nThe ongoing COVID-19 pandemic has negatively impacted worldwide economic activity and continues to create challenges in our markets, such as uncertainties regarding the duration and extent to which the COVID-19 pandemic will ultimately have a negative impact on the demand for our products and services or on our supply chain. We continue to closely monitor the situation as information becomes readily available.\nDuring the fiscal year ended September 30, 2022, our operations have, for the most part, remained open globally and the impact of the effects of COVID-19 to our personnel and operations has been limited. Our supply chain has become increasingly strained due to increased pricing for raw material and supplies coupled with longer than expected lead times. We initially experienced a reduction in demand for the rental of our OBX marine nodal products, which we believed was primarily the result of the pandemic; however, demand has increased in fiscal year 2022. We also believe our Adjacent Markets business segment has entered into a period of recovery from the initial effects of the COVID-19 pandemic, but we continue to be cautious about the pandemics effect on our other business segments and our supply chain. As a result, we continually communicate with our suppliers and customers as information is available to best manage this difficult situation.\nFiscal Year 2022 Compared to Fiscal Year 2021\nConsolidated revenue for fiscal year 2022 was $89.3 million, a decrease of $5.6 million, or 5.9%, from fiscal year 2021. The decrease in revenue was primarily due to a reduction in revenue from our Emerging Markets segment related to our contract with the CBP and a decrease in revenue from sales of our wireless seismic products. The decrease in revenue was partially offset by increased rental revenue from our OBX rental fleet and higher sales of our industrial and imaging products.\nConsolidated gross profit for fiscal year 2022 was $18.0 million, an increase of $1.7 million, or 10.7%, from fiscal year 2021. The increase in gross profit primarily resulted from (i) higher gross profit attributable to the increased utilization of our OBX rental fleet and (ii) the higher profit margins generated on wireless exploration product sales. The increase was partially offset by the reduction in revenue and related gross profit from our contract with the CBP discussed above.\nConsolidated operating expenses for fiscal year 2022 were $41.2 million, an increase of $8.0 million, or 24.2%, from fiscal year 2021. The increase was due to (i) a $4.3 million goodwill impairment charge related to our Quantum acquisition, (ii) a $1.8 million increase in research and development project costs, (iii) a $1.4 million increase in personnel costs, (iv) $1.1 million in incremental operating costs associated with our acquisition of Aquana and (v) a $0.9 million increase in sales, marketing and other general business expenses. The increase was partially offset by a $1.5 million increase in a favorable non-cash adjustment to the estimated fair value of contingent consideration related to our Quantum and OptoSeis® acquisitions when compared to the prior fiscal year.\nConsolidated other income for fiscal year 2022 was $0.5 million compared to $3.4 million from fiscal year 2021. The decrease in other income was primarily due to (i) a gain recognized on the sale of our investment in a debt security in fiscal year 2021, (ii) an increase in foreign exchanges losses and (iii) a decrease in interest income.\nConsolidated income tax expense for fiscal year 2022 was $0.2 million compared to $0.6 million from fiscal year 2021. This decrease in income tax expense was primarily the result of a decrease in rental revenue earned in foreign jurisdictions requiring tax withholding. We are currently unable to record any tax benefits from the tax losses we incur in the U.S., Canada and Russian Federation due to the uncertainty surrounding our ability to utilize such losses in the future to offset taxable income.\nSegment Results of Operations\nFiscal Year 2022 Compared to Fiscal Year 2021\nOil and Gas Markets\nRevenue\nRevenue from our Oil and Gas Markets products for fiscal year 2022 decreased $3.1 million, or 6.0%, from fiscal year 2021. Our product and rental revenue in this segment continues to be negatively impacted by a lack of spending by oil and gas exploration companies despite higher crude oil prices. The components of this decrease were as follows:\nTraditional Exploration Product Revenue - Revenue from our traditional products increased $2.1 million, or 46.0% from the prior fiscal year. The increase primarily reflects higher demand for our sensor and marine products.\nWireless Exploration Product Revenue - Revenue from our wireless exploration products decreased $5.1 million, or 11.1%, from the prior fiscal year. The decrease was primarily due to the recognition of $12.5 million of revenue related to a land-based wireless system in the second quarter of fiscal year 2021 and a $9.9 million sale of used OBX rental\nequipment in the first quarter of fiscal year 2021. The decrease was partially offset by a $10.0 million sale of used OBX rental equipment in the second quarter of fiscal year 2022 and increased OBX rental revenue during fiscal year 2022.\nReservoir Product Revenue - Revenue from our reservoir products decreased $0.1 million, or 5.3%, from the prior fiscal year. The decrease in revenue was primarily due to lower reservoir monitoring service revenue. The decrease was largely offset by higher demand for our borehole products.\nOperating Loss\t\nOperating loss from our Oil and Gas Markets products for fiscal year 2022 was $(7.5) million, a decrease of $(8.7) million, or 53.5%, from the prior fiscal year. The decrease in operating loss was primarily due to (i) higher wireless rental revenue and related gross profits due to improved utilization of our OBX rental fleet and (ii) a $3.6 million increase to a favorable non-cash adjustment to the estimated fair value of contingent consideration related to our OptoSeis® acquisition when compared to the same period of the prior fiscal year. The decrease in operating loss was partially offset by an increase in research and development costs.\nAdjacent Markets\nRevenue\nRevenue from our Adjacent Markets products for fiscal year 2022 increased $6.8 million, or 20.8%, from the prior fiscal year. While we experienced an increase in the demand for our Adjacent Markets products and services during fiscal year 2022 despite the global supply chain shortages, we cannot reasonably determine the lasting effects of the supply chain shortage on this operating segment. The components of this increases were as follows:\nIndustrial Product Revenue and Services - Revenue from our industrial products increased $4.3 million, or 20.2%, from the prior fiscal year. The increase was primarily due to higher demand for water meter products and contract manufacturing services.\nImaging Product Revenue - Revenue from our imaging products increased $2.4 million, or 22.1%, from the prior fiscal year. The increase was primarily due to higher demand for our imaging equipment.\nOperating Income\nOperating income from our Adjacent Markets products for fiscal year 2022 was $6.0 million, a decrease of $0.4 million, or 6.3% from the prior fiscal year. The decrease in operating income was primarily due (i) a $1.3 million increase in research and development expense, (ii) $1.0 million in incremental operating costs attributable to our acquisition of Aquana and (iii) a $0.4 million impairment charge on our manufacturing equipment. The decrease was largely offset by an increase in revenue and related gross profits for fiscal year 2022.\nEmerging Markets\nRevenue\nRevenue from our Emerging Markets products for fiscal year 2022 was $0.7 million, compared to $10.2 million from the prior fiscal year. The decrease was due to $10.1 million of revenue recognized on our contract with the CBP during the prior fiscal year. We were awarded this contract during fiscal year 2020 to provide a technology solution to the Department of Homeland Security. The majority of the revenue related to this contract was recognized in fiscal year 2021. The contract was completed in the second quarter of fiscal year 2022.\nOperating Income (Loss)\nOperating income (loss) from our Emerging Markets products for fiscal year 2022 was $(9.1) million, compared to $5.0 million from the prior fiscal year. The decrease for fiscal year 2022 was primarily due to the revenue and related gross profit recognized on our contract with the CBP in the prior fiscal year. The decrease in operating income (loss) was also due (i) a non-cash goodwill impairment charge of $4.3 million and (ii) a $2.0 million decrease to a favorable non-cash adjustment to the estimated fair value of contingent consideration related to our Quantum acquisition when compared to the same period of the prior fiscal year.\nLiquidity and Capital Resources\nFiscal Year 2022\nAt September 30, 2022, we had approximately $17.0 million in cash and cash equivalents and short-term investments. For the fiscal year ended September 30, 2022, we used $10.0 million of cash from operating activities. Our net loss of $22.9 million was offset by\nnet non-cash charges of $24.6 million resulting from deferred income taxes, depreciation, amortization, asset impairments, accretion, inventory obsolescence, stock-based compensation, bad debt expense and changes in the estimated fair value of contingent consideration. Other uses of cash in our operations primarily included (i) the removal of $11.1 million gross profit from the sale of used rental equipment as it is included in investing activities, (ii) a $0.8 million decrease in accounts payable due to the timing of payments to suppliers, (iii) a $2.4 million increase in inventories to meet an increase in demand for our Adjacent Markets products and (iv) a $0.7 million decrease in other liabilities primarily due to a decrease in customer deposits on rental equipment and a decrease in accrued compensation costs. Offsetting these uses of cash primarily included (i) a $1.8 million decrease in trade accounts and notes receivable primarily due to the timing of collections from customers and (ii) a $1.1 million decrease in unbilled receivables resulting from the collection of billings to the CBP.\nFor the fiscal year ended September 30, 2022, we generated cash of $14.1 million in investing activities. Sources of cash included (i) net proceeds of $8.5 million from the sale of short-term investments and (ii) proceeds of $11.6 million from the sale of used rental equipment. Offsetting these sources were (i) $1.1 million for additions to our property, plant and equipment and (ii) $4.8 million for additions to our equipment rental fleet. We expect our cash investments in our rental fleet to be approximately $6 million in fiscal year 2023. We expect fiscal year 2023 cash investments in property, plant and equipment will be approximately $1 million during fiscal year 2023. Our capital expenditures are expected to be funded from our cash on hand, internal cash flows, cash flows from our rental contracts or, if necessary, borrowings under our new credit agreement.\nFor the fiscal year ended September 30, 2022, we used $1.7 million from financing activities. Uses of cash included (i) $0.8 million for contingent consideration payments to the former shareholders of Quantum, (ii) debt issuance costs of $0.2 million incurred in connection with our new credit agreement and (iii) $0.7 million for the purchase of treasury stock pursuant to a stock buy-back program authorized by our board of directors in November 2020. The stock buy-back program authorized us to repurchase up to $7.5 million of our common stock in open market transactions. The program was completed in November 2021.\nOur available cash and cash equivalents and short-term investments totaled $17.0 million at September 30, 2022, which included $2.6 million of cash and cash equivalents held by our foreign subsidiaries and branch offices, of which $1.8 million was held by our subsidiary in the Russian Federation. . In response to sanctions imposed by the U.S. and others on Russia, the Russian government has imposed restrictions on companies abilities to repatriate or otherwise remit cash from their Russian-based operations to locations outside of Russia. As a result, this cash can be used in our Russian operations, but we may be unable to transfer it out of Russia without incurring substantial costs, if at all. In addition, if we were to repatriate the cash held by our Russian subsidiary, we would be required to accrue and pay taxes on any amount repatriated.\nIn May 2022, we entered into a credit agreement (the Agreement) with Amerisource Funding, Inc., as administrative agent and as a lender, and Woodforest National Bank, as a lender. Available borrowings under the Agreement are determined by a borrowing base with a maximum availability of $10 million. The borrowing base is determined based upon certain of our domestic assets which include (i) 70% loan to value of our property located at 6410 Langfield Road in Houston, Texas (the Property), (ii) 50% of forced liquidation value of equipment, (iii) 80% of certain accounts receivable and (iv) 50% of forced liquidation value of certain inventory (inventory borrowing base limited to 100% of borrowing base credit given toward accounts receivable). The Agreement is for a two-year term with all funds borrowed due at the expiration of the term. The interest rate on borrowed funds is the Wall Street prime rate (with a minimum of 3.25%) plus 4.00%. We are required to make monthly interest payments on borrowed funds. Borrowings under the Agreement will be principally secured by the Property and our domestic equipment, inventory and accounts receivables. In addition, certain of our domestic subsidiaries have guaranteed our obligations under the Agreement and such subsidiaries have secured the obligations by pledging certain assets. The Agreement requires us to maintain a minimum consolidated tangible net worth of $100 million. We expect to remain in compliance with this requirement in fiscal year 2023.\nAt September 30, 2022, we had no borrowings outstanding and were compliant with all covenants under the Agreement. Our borrowing availability at September 30, 2022 was $8.5 million. We do not currently anticipate the need to borrow under the Agreement, however, we may decide to do so in the future, if needed.\nOur available cash and cash equivalent and short-term investments decreased $6.6 million during fiscal year 2022. In the absence of future profitable results of operations, we may need to rely on other sources of liquidity to fund our future operations, including executed rental contracts, available borrowings under our Agreement through its expiration in May 2024, leveraging or sales of real estate assets, sales of rental assets and other liquidity sources which may be available to us. We currently believe that our cash, cash equivalents and short-term investments will be sufficient to finance any future operating losses and planned capital expenditures through the next twelve months.\nWe do not have any obligations which meet the definition of an off-balance sheet arrangement and which have or are reasonably likely to have a current or future effect on our financial statements or the items contained therein that are material to investors.\nContractual Obligations\nContingent Consideration\nWe recorded an initial contingent consideration liability of $7.7 million in connection with our July 2018 acquisition of Quantum. Subsequent to the acquisition, we reduced the liability to $0.2 million as of September 30, 2022 as a result of $2.3 million of earn-out payments made through June 2022 and $5.2 million in adjustments to reduce the value of expected future payments. Contingent payments derived from eligible revenue generated during the four-year post-acquisition period ended July 2022 can be paid in the form of cash or Company stock. In November 2022, the Company paid in cash the remaining $0.2 million liability to the former shareholders of Quantum. Subsequent to this payment, there are no further contingent payment obligations related to this acquisition.\nWe recorded an initial contingent consideration liability of $4.3 million in connection with our November 2018 acquisition of all the intellectual property and related assets of the OptoSeis® fiber optic sensing technology. We decreased the estimated liability to zero as of September 30, 2022 as a result of the unlikelihood any eligible revenue will be generated during the earn-out period. Contingent cash payments were to be derived from eligible revenue generated during a five-and-a-half year post-acquisition earn-out period ending in May 2024. In order for revenue to be considered eligible, sales contracts must be entered into during the first four years of the earn-out period, which ended November 13, 2022. No sales contracts were entered into during this period and we have no contingent payment obligations related to this acquisition.\nContingent Compensation Costs\nIn connection with the acquisition of Aquana in July 2021, we are subject to additional contingent cash payments to the former members of Aquana over a six-year earn-out period. The contingent payments, if any, will be derived from certain eligible revenue generated during the earn-out period from products and services sold by Aquana. There is no maximum limit to the contingent cash payments that could be made. The merger agreement with Aquana requires the continued employment of a certain key employee and former member of Aquana for the first four years of the six year earn-out period in order for any of Aquanas former members to be eligible to receive any earn-out payments. In accordance with ASC 805, Business Combinations, due to the continued employment requirement, no liability has been recorded for the estimated fair value of contingent earn-out payments for this transaction. Earn-outs achieved, if any, will be recorded as compensation expense when incurred.\nSee Note 18 to our consolidated financial statements in this Annual Report on Form 10-K for more information on our contractual contingencies.\nCritical Accounting Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires the use of estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. We consider many factors in selecting appropriate operational and financial accounting policies and controls, and in developing the estimates and assumptions that are used in the preparation of these financial statements. We continually evaluate our estimates, including those related to revenue recognition, bad debt reserves, inventory obsolescence reserves, goodwill and long-lived asset impairment. We base our estimates on historical experience and various other factors, including the impact from the current economic conditions that we believe to be reasonable under the circumstances. Actual results may differ from these estimates under different conditions or assumptions.\nOur normal credit terms for trade receivables are 30 days. In certain situations, credit terms for trade receivables may be extended to 60 days or longer and such receivables generally do not require collateral. Additionally, we provide long-term financing in the form of promissory notes and sales-type leases when competitive conditions require such financing and, in such cases, we may require collateral. We perform ongoing credit evaluations of our accounts and financing receivables, and allowances are recognized for potential credit losses.\nOur long-lived assets are reviewed for impairment whenever an event or change in circumstances indicates the carrying amount of an asset or group of assets may not be recoverable. The impairment review, if necessary, includes a comparison of expected future cash flows (undiscounted and without interest charges) to be generated by an asset group with the associated carrying value of the related assets. If the carrying value of the asset group exceeds the expected future cash flows, an impairment loss is recognized to the extent that the carrying value of the asset group exceeds its fair value.\nWe conduct our evaluation of goodwill at the reporting unit level on an annual basis as of September 30 and more frequently if events or circumstances indicate that the carrying value of a reporting unit exceeds its fair value. The guidance on the testing of goodwill for impairment provides the option to first assess qualitative factors to determine if the fair value of a reporting unit exceeds its carrying amount. If, based on the qualitative assessment of events or circumstances, an entity determines it is more likely than not that the fair value of a reporting unit is more than its carrying amount then it is not necessary to perform a quantitative assessment. However, if an entity concludes otherwise, then a quantitative assessment must be performed. If, based on the quantitative assessment, we determine that the fair value of a reporting unit is less that its carrying amount, a goodwill impairment is recognized equal to the difference between the carrying amount of the reporting unit and its fair value, not to exceed the carrying amount of the goodwill.\nWe record a write-down of our inventories when the cost basis of any manufactured product, including any estimated future costs to complete the manufacturing process, exceeds its net realizable value. Inventories are stated at the lower of cost or net realizable value. Cost is determined on a first-in, first-out method, except that our subsidiaries in the Russian Federation and the United Kingdom use an average cost method to value their inventories.\nWe periodically review the composition of our inventories to determine if market demand, product modifications, technology changes, excessive quantities on-hand and other factors hinder our ability to recover our investment in such inventories. Managements assessment is based upon historical product demand, estimated future product demand and various other judgments and estimates. Inventory obsolescence reserves are recorded when such assessments reveal that portions or components of our inventory investment will not be realized in our operating activities.\nThe value of our inventories not expected to be realized in cash, sold or consumed during our next operating cycle are classified as non-current assets in our consolidated balance sheets.\nWe recognize revenue from product sales and services in accordance with ASC Topic 606, Revenue from Contracts with Customers. This standard applies to contracts for the sale of products and services and does not apply to contracts for the rental or lease of products. Under this standard, we recognize revenue when performance of contractual obligations are satisfied, generally when control of the promised goods or services is transferred to our customers, in an amount that reflects the consideration we expect to be entitled in exchange for those goods or services. Revenue from product sales is recognized when obligations under the terms of a contract are satisfied, control is transferred and collectability of the sales price is reasonably assured. Transfer of control generally occurs with shipment or delivery, depending on the terms of the underlying contract. Our products are generally sold without any customer acceptance provisions, and our standard terms of sale do not allow customers to return products for credit. Most of our products do not require installation assistance or sophisticated instruction. We offer a standard product warranty, which obligates us to repair or replace our products having manufacturing defects. We maintain a reserve for future warranty costs based on historical experience or, in the absence of historical experience, management estimates. Revenue from engineering services is recognized as services are rendered over the duration of a project or as billed on a per hour basis. Field service revenue is recognized when services are rendered and is generally priced on a per day rate. We recognize rental revenue as earned over the rental period. Rentals of our equipment generally range from daily rentals to rental periods of up to six months or longer.\nWe recognize rental revenue in accordance with ASC Topic 842, Leases. In the event collectability of lease payments is not probable at the lease commencement date, we recognize revenue when payments are received. We regularly evaluate the collectability of our lease receivables on a lease by lease basis. The evaluation primarily consists of reviewing past due account balances and other factors such as the credit quality of the customer, historical trends of the customer and current economic conditions. We suspend the recognition of rental revenue when the collectability of amounts due are no longer probable and record a direct write-off of the lease receivable to rental revenue.\nRecent Accounting Pronouncements\nPlease refer to Note 1 to our consolidated financial statements contained in this Annual Report for a discussion of recent accounting pronouncements.\nManagements Current Outlook and Assumptions\nAs further discussed above, there remains uncertainties regarding the duration and to what extent the COVID-19 pandemic will ultimately impact the demand for our products and services or with our supply chain.\nRegarding our Oil and Gas Markets business segment, demand for our products are subject to volatile fluctuations in crude oil prices. As a result of substantial declines in crude oil prices in recent years combined with the recent reduced global demand for oil and gas as a result of the COVID-19 pandemic, oil and gas exploration and production companies experienced a significant reduction in cash flows resulting in sharp reductions in their capital spending budgets for oil and gas exploration-focused activities including seismic data acquisition activities. While we have experienced stronger marine nodal rental activity in fiscal year 2022, the need for new seismic equipment, particularly land-based equipment, remains restrained due to our customers (i) limited capital resources, (ii) lack of visibility into future demand for their seismic services and (iii) in some cases, under-utilized legacy equipment. Crude oil prices have recently rebounded; however, lasting higher levels of oil and gas commodity pricing may not stabilize in the long term, thus continuing the challenging industry conditions we have experienced in previous fiscal years.\nMany of our land-based traditional seismic products can be damaged, destroyed or otherwise consumed during our customers field operations. We expect fiscal year 2023 demand for our land-based traditional seismic products may increase slightly over fiscal year 2022 levels.\nIt is uncertain what revenue impact our land-based wireless data recorder will have during fiscal year 2023 in light of the tepid market demand for oil and gas seismic services and equipment, but we are optimistic demand during fiscal year 2023 will exceed fiscal year 2022 levels.\nThe vast majority of our oil and gas rental revenue in fiscal year 2022 was derived from short-term rentals of our OBX ocean-bottom recorder. We believe our OBX rental revenue will increase substantially in fiscal year 2023 as a result of rental contracts executed during fiscal year 2022 and anticipated new rental contracts, but we can make no assurance in this regard.\nWe expect that fiscal year 2023 revenue from our oil and gas reservoir products, and principally our borehole tools and services, will increase slightly over fiscal year 2022 levels. We have not received any orders for a large-scale seabed PRM system since November 2012, although we do believe opportunities for PRM orders do exist in today's market. If a large scale PRM order were received in fiscal year 2023, it could significantly impact our fiscal year 2023 or fiscal year 2024 revenue and profits.\nWe expect fiscal year 2023 revenue from our Adjacent Markets products to increase over fiscal year 2022 levels due to our acquisition of Aquana and intergration of Aquana's products into our business and optimisim that demand for our industrial, imaging products and contract manufacturing services will continue to increase in fiscal year 2023.\nWe expect fiscal year 2023 revenue from our Emerging Markets products to increase over 2022 levels largely due to optimism of obtaining new security-related contracts and opportunities with oil and gas industry customers. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot required. Item 8. Financial Statements and Supplementary Data\nOur consolidated financial statements, including the reports thereon, the notes thereto and supplementary data begin at page of this Annual Report on Form 10-K and are incorporated herein by reference. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur management is responsible for establishing and maintaining a system of disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports filed under the Exchange Act is recorded, processed, summarized and reported within the time periods specified under SECs rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer (CEO) and Chief Financial Officer (CFO). Notwithstanding the foregoing, there can be no assurance that our disclosure controls and procedures will detect or uncover all failures of persons within the Company and its consolidated subsidiaries to report material information otherwise required to be set forth in our reports.\nIn connection with the preparation of this Annual Report on Form 10-K, we carried out an evaluation under the supervision and with the participation of our management, including the CEO and CFO, as of September 30, 2022 of the effectiveness of the Companys disclosure controls and procedures, as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act. Based on that evaluation, the CEO and CFO concluded that our disclosure controls and procedures are effective as of September 30, 2022.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining effective internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act). Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of September 30, 2022. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\") in Internal Control Integrated Framework (2013). Based on this assessment, our management concluded that, as of September 30, 2022, our internal control over financial reporting is effective based on those criteria.\nChanges in Internal Control Over Financial Reporting\nThere have not been any changes in our internal control over financial reporting (as defined in Rule 13a-15(f) and 15d-15(f) of the Exchange Act) during the fiscal quarter ended September 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this Item is contained in our definitive Proxy Statement to be distributed within 120 days of September 30, 2022 in connection with our 2023 Annual Meeting of Stockholders under the captions Election of Directors, Executive Officers and Compensation, Section 16(a) Beneficial Ownership Reporting Compliance and Code of Ethics and is incorporated herein by reference. Item 11. Executive Compensation\nThe information required by this Item is contained in our definitive Proxy Statement to be distributed within 120 days of September 30, 2022 in connection with our 2023 Annual Meeting of Stockholders under the caption Executive Officers and Compensation and is incorporated herein by reference. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item is contained in our definitive Proxy Statement to be distributed within 120 days of September 30, 2022 in connection with our 2023 Annual Meeting of Stockholders under the caption Security Ownership of Certain Beneficial Owners and Management and is incorporated herein by reference, and in Item 5, Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities, contained in Part II hereof. Item 13. Certain Relationships and Related Transactions and Director Independence\nThe information required by this Item is contained in our definitive Proxy Statement to be distributed within 120 days of September 30, 2022 in connection with our 2023 Annual Meeting of Stockholders under the caption Certain Relationships and Related Transactions and is incorporated herein by reference. Item 14. Principal Accountant Fees and Services\nThe information required by this Item is contained in our definitive Proxy Statement to be distributed within 120 days of September 30, 2022 in connection with our 2023 Annual Meeting of Stockholders under the caption Independent Public Accountants and is incorporated herein by reference.\nPART IV Item 15. Exhibits and Financial Statement Schedules\nFinancial Statements and Financial Statement Schedules\nThe financial statements and financial statement schedules listed on the accompanying Index to Financial Statements (see page) are filed as part of this Annual Report on Form 10-K.\nExhibits\nExhibit\nNumber\nDescription of Documents\n3.1\nAmended and Restated Certificate of Formation of Geospace Technologies Corporation (incorporated by reference to Exhibit 3.1 to the Registrants Quarterly Report on Form 10-Q for the quarter ended March 31, 2015, filed May 8, 2015).\n3.2\nAmended and Restated Bylaws of Geospace Technologies Corporation (incorporated by reference to Exhibit 3.2 to the Registrants Current Report on Form 8-K filed August 8, 2019).\n10.1\nEmployment Agreement dated as of August 1, 1997, between the Company and Michael J. Sheen (incorporated by reference to the Registrants Registration Statement on Form S-1 filed September 30, 1997 (Registration No. 333-36727)).*\n10.2\nEmployment Agreement effective as of January 1, 2012, by and between OYO Geospace Corporation and Walter R. Wheeler (incorporated by reference to Exhibit 99.1 to the Registrants Current Report on Form 8-K filed December 9, 2011).*\n10.3\nEmployment Agreement effective as of January 1, 2012, by and between OYO Geospace Corporation and Robbin B. Adams (incorporated by reference to Exhibit 99.2 to the Registrants Current Report on Form 8-K filed December 9, 2011).*\n10.4\nEmployment Agreement effective as of January 1, 2012, by and between OYO Geospace Corporation and Thomas T. McEntire (incorporated by reference to Exhibit 99.3 to the Registrants Current Report on Form 8-K filed December 9, 2011).*\n10.5\nGeospace Technologies Corporation 2014 Long-Term Incentive Plan (incorporated by reference to Appendix A to the Companys Proxy Statement on Schedule 14A filed December 11, 2013).*\n10.6\nFirst Amendment to the Geospace Technologies Corporation 2014 Long-Term Incentive Plan (incorporated by reference to Appendix A to the Companys Proxy Statement on Schedule 14A filed December 30, 2020).*\n10.7\nForm of Employee Restricted Stock Award Agreement (incorporated by reference to Exhibit 10.1 to the Registrants Form S-8 filed May 21, 2014).*\n10.8\nForm of Employee Restricted Stock Unit Award Agreement (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed November 26, 2018).*\n10.9\nForm of Employee Incentive Stock Option Award Agreement (incorporated by reference to Exhibit 10.2 to the Registrants Form S-8 filed May 21, 2014).*\n10.10\nForm of Employee Non-Qualified Stock Option Award Agreement (incorporated by reference to Exhibit 10.3 to the Registrants Form S-8 filed May 21, 2014).*\n10.11\nForm of Performance Option Agreement (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed November 20, 2015).*\n10.12\nForm of Consultant Restricted Stock Award Agreement (incorporated by reference to Exhibit 10.4 to the Registrants Form S-8 filed May 21, 2014).*\n10.13\nForm of Consultant Stock Option Award Agreement (incorporated by reference to Exhibit 10.5 to the Registrants Form S-8 filed May 21, 2014).*\n10.14\nForm of Director Stock Option Award Agreement (incorporated by reference to Exhibit 10.6 to the Registrants Form S-8 filed May 21, 2014).*\n10.15\nForm of Director Restricted Stock Award Agreement (incorporated by reference to Exhibit 10.7 to the Registrants Form S-8 filed May 21, 2014).*\n10.16\nForm of Director Restricted Stock Award Agreement (incorporated by reference to Exhibit 10.1 to the Registrants Form 10-Q filed May 3, 2019).*\n10.17\nForm of Employee Restricted Stock Award Agreement (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed November 26, 2018).*\n10.18\nForm of Amended and Restated Indemnity Agreement (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed May 26, 2015).*\n10.19\nGeospace Technologies Corporation Annual Bonus Program (incorporated by reference to Exhibit 10.23 to the Registrants Annual Report on Form 10-K for the year ended September 30, 2017 filed December 1, 2017).*\n10.20\nFirst Amendment effective October 1, 2008 to Employment Agreement dated as of August 1, 1997, between the Company and Michael J. Sheen (incorporated by reference to the Registrants Quarterly Report on Form 10-Q for the quarter ended December 31, 2009, filed February 5, 2010).*\n10.21\nSecond Amendment effective November 17, 2020 to Employment Agreement dated as of August 1, 1997, between the Company and Michael J. Sheen (incorporated by reference to the Registrants Current Report on Form 8-K filed November 23, 2020, File No.: 001-13601).*\n10.22\nRevolving Loan and Security Agreement dated May 6, 2022 among Geospace Technologies Corporation and GTC, Inc., as borrowers, Amerisource Funding, Inc. and Woodforest National Bank, as lenders, and Amerisource Funding, Inc., as administrative agent for lenders (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed May 10, 2022).\n10.23\nCommercial Contract - Improved Property, dated June 3, 2019 by and between GTC, Inc. and Harmony Public Schools (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed June 3, 2019).\n10.24\nConsulting Agreement dated November 21, 2019 between Geospace Technologies Corporation and Thomas T. McEntire (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed November 22, 2019, File No.: 001-13601).\n14.1\nGeneral Code of Business Conduct and Supplemental Code of Ethics for CEO and Senior Financial Officers (incorporated by reference to Exhibit 14.1 to the Registrants Current Report on Form 8-K filed February 6, 2019).\n21.1\nSubsidiaries of the Registrant.**\n23.1\nConsent of RSM US LLP.**\n31.1\nCertification of the Companys Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.**\n31.2\nCertification of the Companys Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.**\n32.1\nCertification of the Companys Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.**\n32.2\nCertification of the Companys Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.**\nThe following financial information from the Companys Annual Report on Form 10-K for the fiscal year ended September 30, 2022, formatted in Inline Extensible Business Reporting Language (iXBRL): (i) the Consolidated Balance Sheets as of September 30, 2022 and September 30, 2021, (ii) the Consolidated Statements of Operations for the years ended September 30, 2022 and 2021, (iii) the Consolidated Statements of Comprehensive Loss for the years ended September 30, 2022 and 2021, (iv) the Consolidated Statements of Stockholders Equity for the years ended September 30, 2022 and 2021, (v) the Consolidated Statements of Cash Flows for the years ended September 30, 2022 and 2021 and (vi) Notes to Consolidated Financial Statements.**\nThe cover page from the Companys Annual Report on Form 10-K for the fiscal year ended September 30, 2022 formatted in iXBRL. **\n* This exhibit is a management contract or a compensatory plan or arrangement.\n** Filed herewith.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nGEOSPACE TECHNOLOGIES CORPORATION\nBy:\n/s/ WALTER R. WHEELER\nWalter R. Wheeler, Director, President and Chief Executive Officer\nNovember 18, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ WALTER R. WHEELER\nDirector, President and Chief Executive Officer\nNovember 18, 2022\nWalter R. Wheeler\n(Principal Executive Officer)\n/s/ ROBERT L. CURDA\nVice President, Chief Financial Officer and Secretary\nNovember 18, 2022\nRobert L. Curda\n(Principal Financial Officer and Principal Accounting Officer)\n/s/ GARY D. OWENS\nChairman of the Board\nNovember 18, 2022\nGary D. Owens\n/s/ MARGARET S. ASHWORTH\nDirector\nNovember 18, 2022\nMargaret S. Ashworth\n/s/ THOMAS L. DAVIS\nDirector\nNovember 18, 2022\nThomas L. Davis\n/s/ EDGAR R. GIESINGER, JR.\nDirector\nNovember 18, 2022\nEdgar R. Giesinger, Jr.\n/s/ TINA M. LANGTRY\nDirector\nNovember 18, 2022\nTina M. Langtry\n/s/ RICHARD F. MILES\nDirector\nNovember 18, 2022\nRichard F. Miles\nGEOSPACE TECHNOLOGIES CORPORATION AND SUBSIDIARIES\nINDEX TO FINANCIAL STATEMENTS AND FINANCIAL STATEMENT SCHEDULES\nReports of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Operations for the Years Ended September 30, 2022 and 2021\nConsolidated Statements of Comprehensive Loss for the Years Ended September 30, 2022 and 2021\nConsolidated Statements of Stockholders Equity for the Years Ended September 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the Years Ended September 30, 2022 and 2021\nNotes to Consolidated Financial Statements\nSchedule II-Valuation and Qualifying Accounts\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Geospace Technologies Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Geospace Technologies Corporation and its subsidiaries (the Company) as of September 30, 2022 and 2021, the related consolidated statements of operations, comprehensive loss, stockholders equity and cash flows for the years then ended, and the related notes to the consolidated financial statements (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nInventory Valuation\nAs described in Note 1 to the consolidated financial statements, the Companys consolidated inventories balance, which is stated at lower of cost or net realizable value, was $32.5 million as of September 30, 2022. The valuation of inventories is based on the Companys periodic review of the composition of its inventories to determine if market demand, product modifications, technology changes, excessive quantities on-hand and other factors hinder its ability to recover its investment in such inventories. The Companys assessment is based upon historical product demand, estimated future product demand and various other judgments and estimates. Inventory obsolescence reserves are recorded when such assessments reveal that portions or components of the Companys investment will not be realized in its operating activities.\nWe identified the valuation of inventories at the lower of cost or net realizable value as a critical audit matter due to the significant judgment and estimates required by management. Determining whether a decline in value has occurred requires management to make complex judgments related to (i) historical and estimated future product demand in relation to quantities on hand and (ii) obsolescence of certain products based on changes in technology and demand. Auditing these judgments is especially challenging and involved significant auditor judgment due to fluctuations in sales trends and evolving customer demands.\nOur audit procedures related to the Companys valuation of inventory included the following, among others:\nWe evaluated managements calculation of the inventory valuation reserve by testing the mathematical accuracy of the calculation.\nWe tested the completeness, accuracy, and relevance of the reports and inputs used in the Companys analysis\nWe evaluated the appropriateness and consistency of management's methods and assumptions used in developing their estimate of the inventory valuation reserve, which included consideration of recent changes in historical usage information.\nWe evaluated managements process for subsequent adjustments to net realizable value by performing a retrospective review on an individual item basis to test for subsequent changes in the inventory values after the net realizable value had been established.\nWe compared actual purchases and sales data on an individual item basis for all inventory items and aggregated to perform an independent assessment of the net realizable value of inventory.\nValuation of Goodwill-Emerging Markets Reporting Unit\nAs discussed in Note 11 to the consolidated financial statements, the Company assessed $4.3 million of goodwill and $3.5 million of other intangible assets associated with its Emerging Markets reporting unit, which was also determined to be an asset group for purposes of its long-lived asset recoverability assessment, for impairment. The Company performed a quantitative assessment on the goodwill at its Emerging Markets reporting unit. As part of this quantitative assessment, the Company determines the fair value of the reporting unit using a discounted cash flow model. The Company also performed a recoverability assessment on the long-lived assets of the Emerging Markets asset group in which its carrying value was compared to estimated undiscounted cash flows over the remaining useful life of the asset groups primary asset, its developed technology. Key assumptions in the analyses include revenue and cash flow projections. Discount rates, long-term growth rates, and the effective tax rate are also key assumptions for the goodwill impairment assessment. Estimated future cash flows of the Companys Emerging Markets reporting unit include the Companys ability to obtain an additional contract with its significant customer.\nWe identified the valuation of goodwill and long-lived assets for the Emerging Market's reporting unit as a critical audit matter because of the significant assumptions management makes in determining the estimate, including revenue and cash flow projections and the discount rate utilized. Auditing managements assumptions of revenue and cash flow projections and the discount rate involved a high degree of auditor judgment and increased audit effort, including the use of valuation specialists, as managements assumptions are subjective, and changes in these assumptions could have a significant impact on the fair value of the Emerging Market's reporting unit and potential impairment charges.\nOur audit procedures related to the Companys valuation of goodwill and long-lived assets for the Emerging Markets reporting unit included the following, among others:\nWe evaluated the reasonableness of managements revenue and cash flow projections by comparing managements prior forecasts to historical results for the Company.\nWe evaluated managements cash flow projections by comparing to historical results, inquiry of management of the reporting unit regarding additional contracts with its significant customer, review of publicly available industry information, and testing the completeness and accuracy of the data used in the projections.\nWith the assistance of our valuation specialists, we evaluated the reasonableness of the Companys valuation methodology and the discount rates utilized by comparing them to comparable companies and market data.\nWe have served as the Companys auditor since 2018.\nHouston, Texas\nNovember 18, 2022\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Geospace Technologies Corporation\nOur audits of the consolidated financial statements referred to in our report dated November 18, 2022, (included elsewhere in this Annual Report on Form 10-K) also included the financial statement schedule of Geospace Technologies Corporation and its subsidiaries, listed in Item 15(a) of this Form 10-K. This schedule is the responsibility of Geospace Technologies Corporation's management. Our responsibility is to express an opinion based on our audits of the consolidated financial statements.\nIn our opinion, the financial statement schedule, when considered in relation to the basic consolidated financial statements taken as a whole, presents fairly, in all material respects, the information set forth therein.\nHouston, Texas\nNovember 18, 2022\nGeospace Technologies Corporation and Subsidiaries\nConsolidated Balance Sheets\n(In thousands, except share amounts)\nAS OF SEPTEMBER 30,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n16,109\n$\n14,066\nShort-term investments\n9,496\nTrade accounts and financing receivables, net\n20,886\n17,159\nUnbilled receivables\n-\n1,051\nInventories, net\n19,995\n16,196\nPrepaid expenses and other current assets\n2,077\n2,062\nTotal current assets\n59,961\n60,030\nNon-current financing receivables\n-\n2,938\nNon-current inventories, net\n12,526\n18,103\nRental equipment, net\n28,199\n38,905\nProperty, plant and equipment, net\n26,598\n29,983\nOperating right-of-use assets\n1,191\nGoodwill\n5,072\nOther intangible assets, net\n5,573\n7,250\nOther non-current assets\nTotal assets\n$\n135,056\n$\n163,929\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable trade\n$\n5,595\n$\n6,391\nContingent consideration\nOperating lease liabilities\nOther current liabilities\n6,616\n7,799\nTotal current liabilities\n12,627\n15,222\nNon-current contingent consideration\n-\n5,210\nNon-current operating lease liabilities\n1,009\nDeferred tax liabilities, net\nTotal liabilities\n13,409\n21,472\nCommitments and contingencies (Note 18)\nStockholders equity:\nPreferred stock, 1,000,000 shares authorized, no shares issued and outstanding\n-\n-\nCommon stock, $.01 par value, 20,000,000 shares authorized, 13,863,233 and\n13,738,971 shares issued, respectively; and 13,021,241 and 12,969,542 shares outstanding, respectively\nAdditional paid-in capital\n94,667\n92,935\nRetained earnings\n49,654\n72,510\nAccumulated other comprehensive loss\n(15,313\n)\n(16,320\n)\nTreasury stock, at cost, 841,992 and 769,429 shares, respectively\n(7,500\n)\n(6,805\n)\nTotal stockholders equity\n121,647\n142,457\nTotal liabilities and stockholders equity\n$\n135,056\n$\n163,929\nThe accompanying notes are an integral part of the consolidated financial statements.\nGeospace Technologies Corporation and Subsidiaries\nConsolidated Statements of Operations\n(In thousands, except share and per share amounts)\nYEAR ENDED SEPTEMBER 30,\nRevenue:\nProducts\n$\n64,109\n$\n75,864\nRental equipment\n25,144\n19,000\nTotal revenue\n89,253\n94,864\nCost of revenue:\nProducts\n51,649\n58,884\nRental equipment\n19,561\n19,686\nTotal cost of revenue\n71,210\n78,570\nGross profit\n18,043\n16,294\nOperating expenses:\nSelling, general and administrative\n23,482\n21,926\nResearch and development\n18,104\n14,839\nGoodwill impairment\n4,336\n-\nChange in estimated fair value of contingent consideration\n(5,035\n)\n(3,524\n)\nBad debt expense (recovery)\n(76\n)\nTotal operating expenses\n41,179\n33,165\nLoss from operations\n(23,136\n)\n(16,871\n)\nOther income (expense):\nInterest expense\n(65\n)\n-\nInterest income\n1,441\nGain (loss) on investments, net\n(22\n)\n1,993\nForeign exchange losses, net\n(397\n)\n(41\n)\nOther, net\n(39\n)\n-\nTotal other income, net\n3,393\nLoss before income taxes\n(22,683\n)\n(13,478\n)\nIncome tax expense\nNet loss\n$\n(22,856\n)\n$\n(14,056\n)\nLoss per common share:\nBasic\n$\n(1.76\n)\n$\n(1.05\n)\nDiluted\n$\n(1.76\n)\n$\n(1.05\n)\nWeighted average common shares outstanding:\nBasic\n12,987,996\n13,358,930\nDiluted\n12,987,996\n13,358,930\nThe accompanying notes are an integral part of the consolidated financial statements.\nGeospace Technologies Corporation and Subsidiaries\nConsolidated Statements of Comprehensive Loss\n(In thousands)\nYEAR ENDED SEPTEMBER 30,\nNet loss\n$\n(22,856\n)\n$\n(14,056\n)\nOther comprehensive income (loss):\nChange in unrealized losses on available-for-sale securities, net of tax\n-\n(15\n)\nForeign currency translation adjustments\n1,007\nTotal other comprehensive income, net\n1,007\nTotal comprehensive loss\n$\n(21,849\n)\n$\n(13,678\n)\nThe accompanying notes are an integral part of the consolidated financial statements.\nGeospace Technologies Corporation and Subsidiaries\nConsolidated Statements of Stockholders Equity\nFor the years ended September 30, 2022 and 2021\n(In thousands, except share amounts)\nCommon Stock\nAccumulated\nShares\nAmount\nAdditional\nPaid-In\nCapital\nRetained\nEarnings\nOther\nComprehensive\nLoss\nTreasury Stock\nTotal\nBalance at October 1, 2020\n13,670,639\n$\n$\n90,965\n$\n86,566\n$\n(16,698\n)\n$\n-\n$\n160,970\nNet loss\n-\n-\n-\n(14,056\n)\n-\n-\n(14,056\n)\nOther comprehensive income\n-\n-\n-\n-\n-\nIssuance of common stock pursuant to the vesting of restricted stock units\n70,832\n-\n-\n-\n-\n-\n-\nForfeiture of restricted stock\n(2,500\n)\n-\n-\n-\n-\n-\n-\nPurchase of treasury stock\n(769,429\n)\n(6,805\n)\n(6,805\n)\nStock-based compensation\n-\n-\n1,970\n-\n-\n-\n1,970\nBalance at September 30, 2021\n12,969,542\n92,935\n72,510\n(16,320\n)\n(6,805\n)\n142,457\nNet loss\n-\n-\n-\n(22,856\n)\n-\n-\n(22,856\n)\nOther comprehensive income\n-\n-\n-\n-\n1,007\n-\n1,007\nIssuance of common stock pursuant to the vesting of restricted stock units\n124,262\n(2\n)\n-\n-\n-\n-\nPurchase of treasury stock\n(72,563\n)\n-\n-\n-\n-\n(695\n)\n(695\n)\nStock-based compensation\n-\n-\n1,734\n-\n-\n-\n1,734\nBalance at September 30, 2022\n13,021,241\n$\n$\n94,667\n$\n49,654\n$\n(15,313\n)\n$\n(7,500\n)\n$\n121,647\nThe accompanying notes are an integral part of the consolidated financial statements.\nGeospace Technologies Corporation and Subsidiaries\nConsolidated Statements of Cash Flows\n(In thousands)\nYEAR ENDED SEPTEMBER 30,\nCash flows from operating activities:\nNet loss\n$\n(22,856\n)\n$\n(14,056\n)\nAdjustments to reconcile net loss to net cash used in operating activities:\nDeferred income tax expense (benefit)\n(17\n)\nRental equipment depreciation\n13,740\n15,075\nProperty, plant and equipment depreciation\n4,143\n3,956\nAmortization of intangible assets\n1,677\n1,746\nGoodwill impairment expense\n4,336\n-\nProperty, plant and equipment impairment expense\n-\nAccretion of discounts on short-term investments\nStock-based compensation expense\n1,734\n1,970\nBad debt expense (recovery)\n(76\n)\nInventory obsolescence expense\n3,222\n3,001\nChange in estimated fair value of contingent consideration\n(5,035\n)\n(3,524\n)\nGross profit from sale of used rental equipment\n(11,061\n)\n(6,678\n)\nGain on disposal of property, plant and equipment\n(54\n)\n-\nRealized loss (gain) on sale of investments, net\n(1,993\n)\nEffects of changes in operating assets and liabilities:\nTrade accounts and notes receivables\n1,751\n(2,973\n)\nUnbilled receivables\n1,051\n(1,051\n)\nInventories\n(2,357\n)\n(7,674\n)\nOther assets\n5,368\nAccounts payable trade\n(786\n)\n4,712\nOther liabilities\n(683\n)\n(5,074\n)\nNet cash used in operating activities\n(10,035\n)\n(7,172\n)\nCash flows from investing activities:\nPurchase of property, plant and equipment\n(1,130\n)\n(3,188\n)\nInvestment in rental equipment\n(4,832\n)\n(2,121\n)\nProceeds from the sale of property, plant and equipment\nProceeds from the sale of used rental equipment\n11,583\n10,626\nPurchase of short-term investments\n(450\n)\n(12,544\n)\nProceeds from the sale of short-term investments\n8,924\n3,170\nBusiness acquisition, net of acquired cash\n-\n(1,346\n)\nProceeds from sale of investment in debt security\n-\n2,069\nNet cash provided by (used in) investing activities\n14,149\n(3,318\n)\nCash flows from financing activities:\nPayments of contingent consideration\n(807\n)\n(1,421\n)\nDebt issuance costs\n(211\n)\n-\nPurchase of treasury stock\n(695\n)\n(6,805\n)\nNet cash used in financing activities\n(1,713\n)\n(8,226\n)\nEffect of exchange rate changes on cash\n(358\n)\nIncrease (decrease) in cash and cash equivalents\n2,043\n(18,620\n)\nCash and cash equivalents, beginning of fiscal year\n14,066\n32,686\nCash and cash equivalents, end of fiscal year\n$\n16,109\n$\n14,066\nThe accompanying notes are an integral part of the consolidated financial statements.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements\n1. Summary of Significant Accounting Policies:\nThe Company\nGeospace Technologies Corporation (Geospace) designs and manufactures instruments and equipment used by the oil and gas industry to acquire seismic data in order to locate, characterize and monitor hydrocarbon producing reservoirs. Geospace also designs and manufactures Adjacent Markets products including industrial products, imaging equipment, and provides contract manufacturing services, and Emerging Market products consisting of border and perimeter security products. Geospace and its subsidiaries are referred to collectively as the Company.\nBasis of Presentation\nThe accompanying financial statements present the consolidated financial position, results of operations and cash flows of the Company in accordance with U.S. generally accepted accounting principles (\"GAAP'). All significant intercompany balances and transactions have been eliminated.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires the use of estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. The Company considers many factors in selecting appropriate operational and financial accounting policies and controls, and in developing the estimates and assumptions that are used in the preparation of these financial statements. The Company continually evaluates its estimates, including those related to revenue recognition, bad debt reserves, collectability of rental revenue, inventory obsolescence reserves, self-insurance reserves, product warranty reserves, useful lives of long-lived assets, impairment of long-lived assets, impairment of goodwill and other intangible assets, contingent consideration and deferred income tax assets. The Company bases its estimates on historical experience and various other factors that are believed to be reasonable under the circumstances. While management believes current estimates are reasonable and appropriate, actual results may differ from these estimates under different conditions or assumptions.\nCash and Cash Equivalents\nThe Company considers all highly-liquid investments purchased with an original or remaining maturity at the time of purchase of three months or less to be cash equivalents. At September 30, 2022, the Company had restricted cash of $0.2 million on deposit with a bank which serves as collateral on employee issued credit cards. The Company had no restricted cash at September 30, 2021. At September 30, 2022, cash and cash equivalents included $2.6 million held by the Companys foreign subsidiaries and branch offices, including $1.8 million held by its subsidiary in the Russian Federation. In response to sanctions imposed by the U.S. and others on Russia, the Russian government has imposed restrictions on companies abilities to repatriate or otherwise remit cash from their Russian-based operations to locations outside of Russia. As a result, this cash can be used in our Russian operations, but the Company may be unable to transfer it out of Russia without incurring substantial costs, if at all. In addition, if the Company were to repatriate the cash held by its Russian subsidiary, it would be required to accrue and pay taxes on any amount repatriated.\nConcentrations of Risk\nCredit\nThe Company maintains its cash in bank deposit accounts that, at times, exceed federally insured limits. Management of the Company believes that the financial strength of the financial institutions holding such deposits minimizes the credit risk of such deposits.\nThe Company sells products to customers throughout the United States and various foreign countries. The Companys normal credit terms for trade receivables are 30 days. In certain situations, credit terms may be extended to 60 days or longer. The Company performs ongoing credit evaluations of its customers and generally does not require collateral for its trade receivables. Additionally, the Company provides long-term financing in the form of promissory notes and sales-type leases when competitive conditions require such financing. In such cases, the Company may require collateral. Allowances are recognized for potential credit losses. One customer comprised 29.3% of the Companys revenue during fiscal year 2022. At September 30, 2022, the Company had trade accounts and financing receivables from this customer of $5.5 million. Three customers comprised 19.8%, 16.4% and 10.6%, of the Companys revenue during fiscal year 2021. At September 30, 2021, the Company had trade accounts and financing receivables from these customers of $4.9 million, $7.4 million and $1.1 million, respectively.\nSupplier\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nCertain models of the Companys oil and gas marine wireless products require a timing device it purchases from a United States manufacturer. The Company currently does not possess the ability to manufacture this component and has no other reliable source for this device. If this manufacturer were to discontinue its production of this timing device, were to become unwilling to contract with the Company on competitive terms or were unable to supply the component in sufficient quantities to meet its requirements, the Companys ability to compete in the marine wireless marketplace could be impaired, which could adversely affect its financial performance. The device is used in certain models of the Companys rental equipment. Product sales requiring this device represented approximately 11% of the Company's revenue in fiscal year 2022. There were no product sales requiring this device in fiscal year 2021.\nThe Company purchases all of its thermal film from one manufacturer for its imaging products. Except for the film sold to the Company by this manufacturer, the Company knows of no other source for thermal film that performs as well in its imaging equipment. If the manufacturer were to discontinue producing thermal film, were to become unwilling to contract with the Company on competitive terms or were unable to supply thermal film in sufficient quantities to meet its requirements, the Companys ability to compete in the direct thermal imaging marketplace could be impaired, which could adversely affect its financial performance. Thermal film sales represented approximately 8% and 7% of the Companys revenue in fiscal year 2022 and 2021, respectively.\nArmed Conflict Between Russia and Ukraine\nA portion of the Company's oil and gas product manufacturing is conducted through its wholly-owned subsidiary Geospace Technologies Eurasia LLC, which is based in the Russian Federation. In February 2022, the Russian Federation launched a full-scale military invasion of Ukraine. Although the length and impact of the ongoing military conflict is highly unpredictable, the conflict in Ukraine could lead to market disruptions, including significant volatility in commodity prices, credit and capital markets, as well as supply chain interruptions in addition to any direct impact on the Company's operations in Russia. The United States, the United Kingdom, the EU and other countries have each imposed export controls on certain products and financial and economic sanctions on certain industry sectors and parties in and associated with Russia, and additional sanction packages to constrain Russia have been and continue to be proposed and adopted. United States sanctions against Russia have been expanded to preclude the export of oil and gas equipment anywhere in the world that involve persons designated under the sanctions and to include projects in which persons subject to the sanctions have a 33% ownership interest or a majority of voting interests. The rapid changes in rules and implementation of new rules on imports and exports of goods involving Russia has also led to serious delays in getting goods to or from Russia as port authorities struggle to keep up with the changing environment. If imports of these products from the Russian Federation are restricted by government regulation, the Company may be forced to find other sources for the manufacturing of these products at potentially higher costs. Likewise, restrictions on the Company's ability to send products to our subsidiary in Russia, may force our subsidiary to have to find other sources for the manufacturing of these products at potentially higher costs; however, the Company's exports to Geospace Technologies Eurasia LLC have historically been limited. The risk of doing business in the Russian Federation and other economically or politically volatile areas could adversely affect the Company's operations and earnings.\nThe Company is actively monitoring the situation in Ukraine and Russia and assessing its impact on its business, including its wholly-owned subsidiary Geospace Technologies Eurasia LLC. The net carrying value of this subsidiary on the Company's consolidated balance sheet at September 30, 2022 was $6.0 million. The subsidiary generated $1.9 million in revenue from domestic sales and the Company imported $1.9 million of products from the subsidiary in fiscal year 2022. The Company has no way to predict the duration, progress or outcome of the military conflict in Ukraine. The extent and duration of the military action, sanctions, and resulting market disruptions could be significant and could potentially have substantial impact on the global economy and the Company's business for an unknown period of time.\nInventories\nThe Company records a write-down of its inventories when the cost basis of any manufactured product, including any estimated future costs to complete the manufacturing process, exceeds its net realizable value. Inventories are stated at the lower of cost or net realizable value. Cost is determined on the first-in, first-out method, except that certain of the Companys foreign subsidiaries use an average cost method to value their inventories.\nThe Company periodically reviews the composition of its inventories to determine if market demand, product modifications, technology changes, excessive quantities on-hand and other factors hinder our ability to recover its investment in such inventories. The Companys assessment is based upon historical product demand, estimated future product demand and various other judgments and estimates. Inventory obsolescence reserves are recorded when such assessments reveal that portions or components of the Companys inventory investment will not be realized in its operating activities.\nThe Company reviews it inventories for classification purposes. The value of inventories not expected to be realized in cash, sold or consumed during its next operating cycle are classified as noncurrent assets.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nProperty, Plant and Equipment and Rental Equipment\nProperty, plant and equipment and rental equipment are stated at cost. Depreciation expense is calculated using the straight-line method over the following estimated useful lives:\nYears\nRental equipment\n2-5\nProperty, plant and equipment:\nMachinery and equipment\n3-15\nBuildings and building improvements\n10-50\nOther\n5-10\nExpenditures for renewals and betterments are capitalized. Repairs and maintenance expenditures are charged to expense as incurred. The cost and accumulated depreciation of assets sold or otherwise disposed of are removed from the accounts and any gain or loss thereon is reflected in the statements of operations.\nImpairment of Long-lived Assets\nThe Companys long-lived assets are reviewed for impairment whenever an event or change in circumstances indicates the carrying amount of an asset or group of assets may not be recoverable. The impairment review, if necessary, includes a comparison of expected future cash flows (undiscounted and without interest charges) to be generated by an asset group with the associated carrying value of the related assets. If the carrying value of the asset group exceeds the expected future cash flows, an impairment loss is recognized to the extent that the carrying value of the asset group exceeds its fair value.\nAt March 31, 2022, in light of the Companys losses from operations for the six months ended March 31, 2022 and for fiscal year 2021 and the current war between Russia and Ukraine, management reviewed the recoverability of the carrying value of certain asset groups based on future undiscounted cash flows and determined that their expected future cash flows exceeded their carrying value. No additional indicators of impairment related to this asset group were observed at September 30, 2022.\nAt September 30, 2022, in light of the Company's impairment of its goodwill associated with its Emerging Markets reporting unit, the Company reviewed the recoverability of the carrying value of the long-lived assets of this reporting unit and determined that their undiscounted cash flows exceeded their carrying value. As a result, no impairment charges were necessary to the Company's long-lived assets associated with its Emerging Markets reporting unit.\nAt September 30, 2022, in light of the Company's decision to dispose of certain manufacturing cabling equipment, the Company reviewed the recoverability of the carrying value of these assets and determined that their carrying value exceeded their fair value. As a result of the fair value analysis, an impairment charge of $0.4 million was recorded in the fourth quarter of fiscal year 2022 related to the equipment. The impairment charge is included as a component of cost of revenue in the Companys consolidated statements of operations.\nGoodwill\nThe Company conducts its evaluation of goodwill at the reporting unit level on an annual basis as of September 30 and more frequently if events or circumstances indicate that the carrying value of a reporting unit exceeds its fair value. The guidance on the testing of goodwill for impairment provides the option to first assess qualitative factors to determine if the fair value of a reporting unit exceeds its carrying amount. If, based on the qualitative assessment of events or circumstances, an entity determines it is more likely than not that the fair value of a reporting unit is more than its carrying amount then it is not necessary to perform a quantitative assessment. However, if an entity concludes otherwise, then a quantitative assessment must be performed. If, based on the quantitative assessment, the Company determines that the fair value of a reporting unit is less that its carrying amount, a goodwill impairment is recognized equal to the difference between the carrying amount of the reporting unit and its fair value, not to exceed the carrying amount of the goodwill. At September 30, 2022, the Company impaired its goodwill associated with its Emerging Markets reporting unit. See Note 11 for more information.\nOther Intangible Assets\nIntangible assets are carried at cost, net of accumulated amortization. The estimated useful life of the Companys other intangible assets are evaluated each reporting period to determine whether events or circumstances warrant a revision to the remaining amortization\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nperiod. If the estimate of an intangible assets remaining useful life is changed, the amortization period should be changed prospectively. Amortization expense is calculated using the straight-line method over the following estimated useful lives:\nYears\nDeveloped technology\nTrade names\nCustomer relationships\nNon-compete agreements\nRevenue Recognition\nSee Note 2 to these consolidated financial statements.\nContingent Consideration\nThe Company established earn-out liabilities in connection with its business acquisitions in fiscal year 2018 and 2019. The Company engaged the services of a valuation firm to measure the initial fair value of the earn-out liabilities as of the acquisition date for each business. The valuation technique used to measure the fair value of the liability was derived from models utilizing market observable inputs, internal estimates and the use of internal projections of future revenue and/or gross profits. The Company reviews the fair value of its contingent earn-out liabilities on a quarterly basis. Adjustments to the liabilities are included as a component of earnings in the consolidated statements of operations. See Note 18 to these consolidated financial statements for additional information.\nResearch and Development Costs\nThe Company expenses research and development costs as incurred. Research and development costs include salaries, employee benefit costs, department supplies, direct project costs and other related costs.\nProduct Warranties\nMost of the Companys products do not require installation assistance or sophisticated instructions. The Company offers a standard product warranty obligating it to repair or replace equipment with manufacturing defects. The Company maintains a reserve for future warranty costs based on historical experience or, in the absence of historical product experience, managements estimates. Reserves for future warranty costs are included within other current liabilities on the consolidated balance sheets.\nChanges in the product warranty reserve are reflected in the following table (in thousands):\nBalance at October 1, 2020\n$\nAccruals for warranties issued during the year\nSettlements made (in cash or in kind) during the year\n(693\n)\nBalance at September 30, 2021\nAccruals for warranties issued during the year\n1,431\nSettlements made (in cash or in kind) during the year\n(1,286\n)\nBalance at September 30, 2022\n$\nStock-Based Compensation\nThe Company accounts for stock-based compensation, including grants of restricted awards and unqualified stock options in accordance with Accounting Standards Codification Topic 718, which requires that all share-based payments (to the extent that they are compensatory) be recognized as an expense in the Companys consolidated statements of operations based on their fair values on the award date and the estimated number of shares it ultimately expects to vest.\nThe Company recognizes stock-based compensation expense on a straight-line basis over the requisite service period of the award. The Companys stock-based compensation plan and awards are more fully described in Note 15 to these consolidated financial statements.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nForeign Currency Gains and Losses\nThe assets and liabilities of the Companys foreign subsidiaries and branch offices that have a foreign currency as their functional currency have been translated into U.S. dollars using the exchange rates in effect at the balance sheet date. Results of operations have been translated using the average exchange rates during the year. Resulting translation adjustments have been recorded as a component of accumulated other comprehensive loss in stockholders equity. Foreign currency transaction gains and losses are included in the statements of operations as they occur. Transaction gains and losses on intra-entity foreign currency transactions and balances, including advances and demand notes payable on which settlement is not planned or anticipated in the foreseeable future, are recorded in accumulated other comprehensive loss on our consolidated balance sheets.\nFair Value\nFair value is the price that would be received to sell an asset or the amount paid to transfer a liability in an orderly transaction between market participants (an exit price) at the measurement date. GAAP has established a fair value hierarchy which prioritizes the inputs to the valuation techniques used to measure fair value into three levels. These levels are determined based on the lowest level input that is significant to the fair value measurement. Level 1 represents unadjusted quoted prices in active markets for identical assets and liabilities. Level 2 represents quoted prices for similar assets and liabilities in active markets (other than those included in Level 1) which are observable, either directly or indirectly. Level 3 represents valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable. Also see Note 5 to these consolidated financial statements.\nIncome Taxes\nIncome taxes are presented in accordance with the Accounting Standards Codification Topic 740 (Topic 740) guidance for accounting for income taxes. The estimated future tax effects of temporary differences between the tax basis of assets and liabilities and amounts reported in the accompanying consolidated balance sheets, as well as operating loss and tax credit carrybacks and carryforwards are recorded. Deferred tax assets and liabilities are determined based on differences between financial reporting and tax basis of assets and liabilities (temporary differences) and are measured using the enacted tax rates and laws that will be in effect when the differences are expected to reverse. The Company periodically reviews the recoverability of tax assets recorded on the balance sheet and provides valuation allowances if it is more likely than not that such assets will not be realized.\nThe Company follows the guidance of Topic 740 to analyze all tax positions that are less than certain. Topic 740 prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. In accordance with Topic 740, the Company recognizes in its financial statements the impact of a tax position if that position is more likely than not to be sustained on audit, based on the technical merits of the position. The Companys estimate of the potential outcome of any uncertain tax issue is subject to managements assessment of relevant risks, facts, and circumstances existing at that time.\nThe Company classifies interest and penalties associated with the payment of income taxes, if any, in the Other Income (Expense) section of its consolidated statements of operations. The Company incurred no interest or penalties for the fiscal years ended September 30, 2022 and 2021.\nRecently Adopted Accounting Pronouncements\nIn December 2019, the Financial Accounting Standards Board (the FASB) issued guidance on simplifying the accounting for income taxes. The guidance eliminates certain exceptions to the general principles in Topic 740 and clarifies and amends existing guidance to improve consistent application. This guidance is effective for fiscal years and interim periods within those fiscal years, beginning after December 15, 2020. The Company adopted this standard during the first quarter of fiscal year 2022. The adoption of this guidance did not have any impact on the Company's consolidated financial statements.\nRecently Issued Accounting Pronouncements\nIn June 2016, the FASB issued guidance surrounding credit losses for financial instruments that replaces the incurred loss impairment methodology in generally accepted accounting principles. The new impairment model requires immediate recognition of estimated credit losses expected to occur for most financial assets and certain other financial instruments. For available-for-sale debt securities with unrealized losses, credit losses will be recognized as allowances rather than reductions in the amortized cost of the securities. As a smaller reporting company, the Company must adopt this standard no later than the first quarter of its fiscal year ending September 30, 2024, although early adoption is permitted. The standards provisions will be applied as a cumulative-effect adjustment to retained earnings as of the beginning of the first effective reporting period. The Company intends to adopt this standard during the\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nfirst quarter of its fiscal year ending September 30, 2024 and is continuing to evaluate the impact of this new guidance on its consolidated financial statements.\n2. Revenue Recognition\nIn accordance with ASC Topic 606, Revenue from Contracts with Customers (ASC 606), the Company recognizes revenue when performance of contractual obligations are satisfied, generally when control of the promised goods or services is transferred to its customers, in an amount that reflects the consideration it expects to be entitled to in exchange for those goods or services.\nThe Company primarily derives product revenue from the sale of its manufactured products. Revenue from these product sales, including the sale of used rental equipment, is recognized when obligations under the terms of a contract are satisfied, control is transferred and collectability of the sales price is probable. The Company records deferred revenue when customer funds are received prior to shipment or delivery or performance has not yet occurred. The Company assesses collectability during the contract assessment phase. In situations where collectability of the sales price is not probable, the Company recognizes revenue when it determines that collectability is probable or when non-refundable cash is received from its customers and there is not a significant right of return. Transfer of control generally occurs with shipment or delivery, depending on the terms of the underlying contract. The Companys products are generally sold without any customer acceptance provisions, and the Companys standard terms of sale do not allow customers to return products for credit.\nRevenue from engineering services is recognized as services are rendered over the duration of a project, or as billed on a per hour basis. Field service revenue is recognized when services are rendered and is generally priced on a per day rate.\nThe Company also generates revenue from short-term rentals under operating leases of its manufactured products. Rental revenue is recognized as earned over the rental period if collectability of the rent is reasonably assured. Rentals of the Companys equipment generally range from daily rentals to minimum rental periods of up to one year. The Company has determined that ASC 606 does not apply to rental contracts, which are within the scope of ASC Topic 842, Leases.\nAs permissible under ASC 606, sales taxes and transaction-based taxes are excluded from revenue. The Company does not disclose the value of unsatisfied performance obligations for contracts with an original expected duration of one year or less. Additionally, the Company expenses costs incurred to obtain contracts when incurred because the amortization period would have been one year or less. These costs are recorded in selling, general and administrative expenses.\nThe Company has elected to treat shipping and handling activities in a sales transaction after the customer obtains control of the goods as a fulfillment cost and not as a promised service. Accordingly, fulfillment costs related to the shipping and handling of goods are accrued at the time of shipment. Amounts billed to a customer in a sales transaction related to reimbursable shipping and handling costs are included in revenue and the associated costs incurred by the Company for reimbursable shipping and handling expenses are reported in cost of revenue. The Company incurred shipping and handling expenses of $0.6 million and $0.4 million, respectively, for the fiscal years ended September 30, 2022 and 2021, respectively.\nDuring the third quarter of fiscal year 2020, the Company was awarded an approximate $10.5 million contract (inclusive of a subsequent contract amendment of $0.3 million) with the U.S. Customs and Border Protection (the CBP) to provide a technology solution to the Department of Homeland Security. Revenue recognized under the contract for the fiscal years ended September 30, 2022 and 2021 was $0.3 million and $9.9 million, respectively. The Company has recognized revenue on the entire amount of the contract and no performance obligations remain under the contract except for on-going service and maintenance. Unsatisfied performance obligations on all other contracts held by the Company at September 30, 2022 had an original duration of one year or less.\nAt September 30, 2022 and September 30, 2021, the Company had no deferred contract costs or deferred contract liabilities. During the fiscal years ended September 30, 2022 and 2021, no revenue was recognized from deferred contract liabilities and no cost of revenue was recognized from deferred contract costs.\nDuring the second quarter of fiscal year 2020, the Company partially financed a $12.5 million product sale by entering into a $10.0 million promissory note with the customer. The note has a three-year term with monthly principal and interest payments of $0.3 million. Due to the financial condition of the customer, the Company had concerns over the probable collectability of the promissory note. As a result, the Company did not recognize any revenue or cost of revenue on the product sale through its first quarter of fiscal year 2021. During the second quarter of fiscal year 2021, as a result of new information received from the customer, management determined that it was probable that the customer would satisfy its remaining payment obligations on the promissory note with the Company and recognized revenue of $12.5 million on the product sale. During the fourth quarter of fiscal year 2021, the Company granted the customer a six-month principal payment forbearance. The customer recommenced its monthly payments to the Company in the second quarter of fiscal year 2022. In October 2022, the Company granted the customer an additional six-month payment forbearance. The customer has made payments totaling $9.5 million (exclusive of interest) as of September 30, 2022 related to the product sale, and the\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nbalance outstanding on the promissory note at September 30, 2022 was $3.0 million. Deferred contract costs associated with this sale were recognized in the second quarter of fiscal year 2021.\nFor each of the Companys operating segments, the following table presents revenue only from the sale of products and the performance of services under contracts with customers (in thousands). Therefore, the table excludes all revenue earned from rental contracts.\nYEAR ENDED SEPTEMBER 30,\nOil and Gas Markets\nTraditional exploration product revenue\n$\n6,558\n$\n4,518\nWireless exploration product revenue\n15,822\n27,016\nReservoir product revenue\n1,968\n1,877\nTotal revenue\n24,348\n33,411\nAdjacent Markets\nIndustrial product revenue\n25,640\n21,335\nImaging product revenue\n13,360\n10,925\nTotal revenue\n39,000\n32,260\nEmerging Markets\nRevenue\n10,193\nCorporate\nRevenue\n-\nTotal\n$\n64,109\n$\n75,864\nSee Note 20 for more information on the Companys operating segments.\nFor each of the geographic areas where the Company operates, the following table presents revenue from the sale of products and performance of services under contracts with customers (in thousands). Therefore, the table excludes all revenue earned from rental contracts.\nYEAR ENDED SEPTEMBER 30,\nAsia\n$\n10,978\n$\n17,268\nCanada\n1,550\nEurope\n15,705\n7,693\nSouth America\nUnited States\n33,778\n47,101\nOther\n2,039\n1,965\n$\n64,109\n$\n75,864\nRevenue is attributable to countries based on the ultimate destination of the product sold, if known. If the ultimate destination is not known, revenue is attributable to countries based on the geographic location of the initial shipment.\n3. Business Acquisition\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nOn July 2, 2021, we acquired 100 percent of the outstanding membership interest in Aquana, LLC (\"Aquana\") a comprehensive wireless water monitoring and control system provider. Aquana operates as a wholly-owned subsidiary of the Company and resides in the Companys Adjacent Markets business segment. The acquisition purchase price consisted of an initial cash down payment at closing of approximately $1.4 million and additional contingent cash payments over a six year earn-out period. The contingent earn-out payments, if any, will be derived from certain eligible revenue generated during the earn-out period from products and services sold by Aquana. There is no maximum limit to the contingent cash payments that could be made. The merger agreement with Aquana requires the continued employment of a certain key employee and former member of Aquana for the first four years of the six year earn-out period in order for any of Aquanas former members to be eligible to any earn-out payments. In accordance with ASC 805, Business Combinations, due to the continued employment requirement, no liability has been recorded for the estimated fair value of contingent earn-out payments for this transaction. Earn-outs achieved, if any, will be recorded as compensation expense when incurred.\nIn connection with the Aquana acquisition, the Company recorded goodwill of $0.7 million, and other intangible assets of $0.7 million. Current assets and current liabilities acquired in the transaction were nominal.\nLegal and professional costs of $0.2 million related to the Aquana acquisition are included in selling, general and administrative expenses for the fiscal year ended September 30, 2021.\nThe Aquana acquisition represents the Companys strategy to expand its product revenues, as well as its engineering and manufacturing competencies, to markets outside the oil and gas industry.\n4. Investments\nShort-term Investments\nThe Company classifies its short-term investments as available-for-sale securities. Available-for-sale securities are carried at fair market value with net unrealized gains and losses reported as a component of accumulated other comprehensive loss in stockholders equity. For the fiscal years ended September 30, 2022 and 2021, the Company realized losses of $22,000 and $4,000, respectively, from the sale of short-term investments.\nThe Companys short-term investments were composed of the following (in thousands):\nAS OF SEPTEMBER 30, 2022\nAmortized\nCost\nUnrealized\nGains\nUnrealized\nLosses\nEstimated\nFair Value\nShort-term investments:\nCorporate bonds\n$\n$\n-\n$\n(15\n)\n$\nTotal\n$\n$\n-\n$\n(15\n)\n$\nAS OF SEPTEMBER 30, 2021\nAmortized\nCost\nUnrealized\nGains\nUnrealized\nLosses\nEstimated\nFair Value\nShort-term investments:\nCorporate bonds\n$\n9,511\n$\n-\n$\n(15\n)\n$\n9,496\nTotal\n$\n9,511\n$\n-\n$\n(15\n)\n$\n9,496\nThe Companys short-term investments have contractual maturities ranging from February 2023 to March 2023.\nInvestment in Debt Security\nDuring the fiscal year ended September 30, 2021, the Company recognized a gain of $2.0 million in connection with the sale of its interest in a senior secured bond originally issued from an international seismic marine customer.\n5. Fair Value of Financial Instruments\nThe Companys financial instruments generally include cash and cash equivalents, short-term investments, trade accounts, financing receivables and accounts payable. Due to the short-term maturities of cash and cash equivalents, trade accounts receivable, financing receivables and accounts payable, the carrying amounts approximate fair value on the respective balance sheet dates. The valuation technique used to measure the fair value of the contingent consideration was derived from models utilizing market observable inputs.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nThe Company measures its short-term investments and contingent consideration at fair value on a recurring basis.\nThe following tables present the fair value of the Companys short-term investments and contingent consideration by valuation hierarchy and input (in thousands):\nAS OF SEPTEMBER 30, 2022\nQuoted Prices\nin Active\nMarkets for\nIdentical Assets\n(Level 1)\nSignificant\nOther Unobservable\n(Level 2)\nSignificant\nUnobservable\n(Level 3)\nTotals\nShort-term investments:\nCorporate bonds\n$\n-\n$\n$\n-\n$\nTotal assets\n$\n-\n$\n$\n-\n$\nContingent consideration liabilities\n$\n-\n$\n-\n$\n$\nTotal liabilities\n$\n-\n$\n-\n$\n$\nAS OF SEPTEMBER 30, 2021\nQuoted Prices\nin Active\nMarkets for\nIdentical Assets\n(Level 1)\nSignificant Other\nObservable\n(Level 2)\nSignificant\nUnobservable\n(Level 3)\nTotals\nShort-term investments:\nCorporate bonds\n$\n-\n$\n9,496\n$\n-\n$\n9,496\nTotal assets\n$\n-\n$\n9,496\n$\n-\n$\n9,496\nContingent consideration liabilities:\nCurrent portion\n$\n-\n$\n-\n$\n$\nNon-current portion\n-\n-\n5,210\n5,210\nTotal liabilities\n$\n-\n$\n-\n$\n6,017\n$\n6,017\nAssets and Liabilities Measured on a Nonrecurring Basis\nThe measurements utilized to determine the implied fair value of the Company's Emerging Markets reporting unit as of September 30, 2022 represented significant unobservable inputs (Level 3). See Note 11 for discussion of these inputs.\nThe following table summarizes changes in the fair value of the Companys Level 3 financial instruments for the fiscal years ended September 30, 2022 and 2021:\nContingent Consideration balance at October 1, 2020\n$\n10,962\nFair value adjustments\n(3,524\n)\nPayment of contingent consideration\n(1,421\n)\nBalance at September 30, 2021\n6,017\nFair value adjustments\n(5,035\n)\nPayment of contingent consideration\n(807\n)\nBalance at September 30, 2022\n$\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nAdjustments to the fair value of the contingent consideration are based on internal estimates and management assessments regarding potential future scenarios. The Company believes its estimates and assumptions are reasonable; however, there is significant judgment involved. Also see Note 18.\n6. Accumulated Other Comprehensive Loss\nAccumulated other comprehensive loss consisted of the following (in thousands):\nUnrealized\nLosses on\nAvailable-for-Sale\nSecurities\nForeign\nCurrency\nTranslation\nAdjustments\nTotal\nBalance at October 1, 2020\n$\n-\n$\n(16,698\n)\n$\n(16,698\n)\nOther comprehensive income (loss)\n(15\n)\nBalance at September 30, 2021\n$\n(15\n)\n(16,305\n)\n(16,320\n)\nOther comprehensive income\n-\n1,007\n1,007\nBalance at September 30, 2022\n$\n(15\n)\n$\n(15,298\n)\n$\n(15,313\n)\n7. Trade Accounts and Financing Receivables\nTrade accounts receivable, net (excluding financing receivables) are reflected in the following table (in thousands):\nAS OF SEPTEMBER 30,\nTrade accounts receivable\n$\n13,252\n$\n12,635\nAllowance for doubtful accounts\n(591\n)\n(428\n)\n$\n12,661\n$\n12,207\nThe allowance for doubtful accounts represents the Companys best estimate of probable credit losses. The Company determines the allowance based upon historical experience and a current review of its accounts receivable balances. Accounts receivable balances are charged off against the allowance whenever it is probable that the receivable balance will not be recoverable.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nFinancing receivables are reflected in the following table (in thousands):\nAS OF SEPTEMBER 30,\nPromissory notes\n$\n8,225\n$\n5,432\nSales-type lease\n-\n2,464\nTotal financing receivables\n8,225\n7,896\nUnearned income:\nSales-type lease\n-\n(6\n)\nTotal unearned income\n-\n(6\n)\nTotal financing receivables, net of unearned income\n8,225\n7,890\nLess current portion\n(8,225\n)\n(4,952\n)\nNon-current notes receivable\n$\n-\n$\n2,938\nPromissory notes receivable are generally collateralized by the products sold, and bear interest at rates ranging from 7.0% to 9.5% per year. After consideration of the forbearance discussed in Note 2, the promissory notes receivable mature at various times through January 2024. The Company has, on occasion, extended or renewed notes receivable as they mature, but there is no obligation to do so.\nDuring the first quarter of fiscal year 2022, the Company financed a sale of rental equipment by entering into a $3.7 million promissory note with a customer. The note has a term of nine months, with principal and interest payments due monthly until maturity.\nDuring the second quarter of fiscal year 2022, the Company partially financed a $10.0 million sale of rental equipment by entering into an $8.0 million promissory note with a customer. The note has a one-year term, with principal and interest payments due quarterly until maturity.\nDuring the third quarter of fiscal year 2021, the Company entered into a sales-type lease with a customer for rental equipment. The lease, which had a term of six months, was paid during the second quarter of fiscal year 2022.\nDuring the second quarter of fiscal year 2020, the Company partially financed a $12.5 million product sale by entering into a $10.0 million promissory note with the customer. The note has a three-year term with monthly principal and interest payments of $0.3 million. Due to the financial condition of the customer, the Company had concerns over the probable collectability of the promissory note. As a result, the promissory note was not reflected on the Companys consolidated balance sheet through its first quarter of fiscal year 2021. During the second quarter of fiscal year 2021, as a result of new information received from the customer, management determined that it was probable that the customer would satisfy its remaining payment obligations to the Company and, therefore, the Company recognized the promissory note on its consolidated balance sheet as of March 31, 2021. See Note 2 for more information on this matter.\n8. Inventories\nInventories consisted of the following (in thousands):\nAS OF SEPTEMBER 30,\nFinished goods\n$\n14,653\n$\n14,968\nWork in process\n6,230\n8,247\nRaw materials\n25,609\n24,720\nObsolescence reserve (net realizable value adjustment)\n(13,971\n)\n(13,636\n)\n32,521\n34,299\nLess current portion\n19,995\n16,196\nNon-current portion\n$\n12,526\n$\n18,103\nInventory obsolescence expense totaled approximately $3.2 million and $3.0 million during fiscal years 2022 and 2021, respectively. Raw materials include semi-finished goods and component parts that totaled approximately $20.7 million and $22.7 million at September 30, 2022 and 2021, respectively.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\n9. Leases\nAs Lessee\nThe Company has elected not to record operating right-of-use assets or operating lease liabilities on its consolidated balance sheet for leases having a minimum term of 12 months or less. Such leases are expensed on a straight-line basis over the lease term. Variable lease payments are excluded from the measurement of operating right-of-use assets and operating liabilities and recognized in the period in which the obligation for those payments is incurred. As of September 30, 2022, the Company has two operating right-of use assets related to leased facilities in Austin, Texas and Melbourne, Florida.\nMaturities of the operating lease liabilities as of September 30, 2022 were as follows (in thousands):\nFor fiscal years ending September 30,\n$\nFuture minimum lease payments\n$\n1,089\nLess interest\n(79\n)\nPresent value of minimum lease payments\n$\n1,010\nLess current portion\n(241\n)\nLong-term portion\n$\nLease costs recognized in the consolidated statements of operations for the fiscal years ended September 30, 2022 and 2021 is as follows (in thousands):\nYEAR ENDED SEPTEMBER 30,\nRight-of-use operating lease costs\n$\n$\nShort-term lease costs\nTotal\n$\n$\nRight-of-use operating lease costs and short-term lease costs are included as a component of total operating expenses.\nOther information related to operating leases is as follows (in thousands):\nYEAR ENDED SEPTEMBER 30,\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n$\nOperating lease assets obtained in exchange for new lease liabilities\n-\n1,336\nWeighted average remaining lease term\n4.7 years\n5.6 years\nWeighted average discount rate\n3.25\n%\n3.25\n%\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nThe discount rate used on the operating right-of-use assets represented the Companys incremental borrowing rate at lease inception.\nAs Lessor\nEquipment\nThe Company leases equipment to customers which generally range from daily rentals to minimum rental periods of up to one year. All of the Company's current leasing arrangements, with the Company acting as lessor, are classified as operating leases. The majority of the Companys rental revenue is generated from its marine-based wireless seismic data acquisition system.\nThe Company regularly evaluates the collectability of its lease receivables on a lease-by-lease basis. The evaluation primarily consists of reviewing past due account balances and other factors such as the credit quality of the customer, historical trends of the customer and current economic conditions. The Company suspends revenue recognition when the collectability of amounts due are no longer probable and concurrently records a direct write-off of the lease receivable to rental revenue to limit rental revenue recognized to the cash collections received. As of September 30, 2022, the Companys trade accounts receivables included lease receivables of $3.2 million.\nRental revenue related to leased equipment for fiscal years 2022 and 2021 was $24.9 million and $19.0 million, respectively.\nFuture minimum lease obligations due from the Company's leasing customers as of September 30, 2022 were $24.6 million, all of which is expected to be due within the next 12 months.\nRental equipment consisted of the following (in thousands):\nAS OF SEPTEMBER 30,\nRental equipment, primarily wireless recording equipment\n$\n83,887\n$\n95,827\nAccumulated depreciation and impairment\n(55,688\n)\n(56,922\n)\n$\n28,199\n$\n38,905\nRental equipment depreciation expense was $13.7 million and $15.1 million in fiscal years 2022 and 2021, respectively.\nProperty\nDuring the first quarter of fiscal year 2022, the Company leased a portion of its property located in Calgary, Alberta, Canada and fully leased its warehouse in Bogotá, Colombia. The lease in Canada commenced in November 2021 and is for a five-year term. The lease on the warehouse in Bogotá commenced in December 2021 and is for a one-year term.\nRental revenue related to these two properties for fiscal year 2022 was $0.2 million.\nFuture minimum lease payments due to the Company as of September 30, 2022 were as follows (in thousands):\nFor fiscal years ending September 30,\n$\n$\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\n10. Property, Plant and Equipment\nProperty, plant and equipment consisted of the following (in thousands):\nAS OF SEPTEMBER 30,\nLand and land improvements\n$\n7,855\n$\n7,932\nBuilding and building improvements\n24,588\n24,646\nMachinery and equipment\n59,393\n56,828\nFurniture and fixtures\n1,434\n1,417\nTools and molds\n3,243\n3,036\nConstruction in progress\n2,288\nTransportation equipment\n96,928\n96,222\nAccumulated depreciation and impairment\n(70,330\n)\n(66,239\n)\n$\n26,598\n$\n29,983\nProperty, plant and equipment depreciation expense was $4.1 and $4.0 million for the fiscal years ended September 30, 2022 and 2021. Impairment expense of $0.4 million was incurred on certain manufacturing equipment in fiscal year 2022. The impairment expense is included as a component of cost of revenue in the consolidated statement of operations.\n11. Goodwill and Other Intangible Assets\nAt September 30, 2022, the Company had goodwill of $0.7 million and other intangible assets, net of $0.6 million attributable to its Adjacent Markets reporting unit; other intangible assets, net of $3.5 million attributable to its Emerging Markets reporting unit; and other intangible assets, net of $1.5 million attributable to its Oil and Gas Markets reporting unit. Goodwill represents the excess cost of a business acquired over the fair market value of identifiable net assets at the date of acquisition.\nAt September 30, 2022, the Company assessed the goodwill associated with both its Adjacent Markets and Emerging Markets reporting units for impairment. The fair value of the reporting units were estimated using the expected present value of future cash flows, market data and using estimates, judgments and other assumptions that management believes were appropriate under the circumstances. The estimates and judgments used in the assessment included consideration of market participant rates of return and the terminal value of the reporting units. The Company determined future cash flows provided the best estimate of the fair value of its reporting units. Key assumptions in determining the fair value in the impairment analysis include revenue and cash flow projections, discount rates, long-term growth rates, and the effective tax rate the Company determined to be appropriate. In determining fair value for the Company's Emerging Markets reporting unit, cash flow projections included obtaining additional contracts from the CBP and considered competition in the marketplace. These estimates and projections can be unpredictable, particularly for Quantum Technology Sciences, Inc. (\"Quantum\") as an emerging business. The total Companys estimate of reporting unit fair values was reconciled to its then market capitalization (based upon the stock market price) plus an implied control premium.\nAs a result of the assessment, the Company determined that the fair value its Emerging Markets reporting unit was less than its carrying amount and recorded an impairment charge of $4.3 million for the entire goodwill associated with this reporting unit for the fiscal year ended September 30, 2022. The primary factors impacting the decrease in the fair value of the Emerging Markets reporting unit was historical operating losses and the current outlook for sales and operating performance. The carrying value of the reporting unit exceeded the fair value by approximately $8 million as a result of the assessment. In measuring sensitivity, changes to key assumptions, each of which would cause an approximate $1.0 million change in the fair value of the reporting unit include (i) a 3% change in the discount rate, (ii) a 4% change in revenue, (iii) a 10% change in cost of revenue or (iv) a 13% change in research and development expense. No impairment charge to the Emerging Markets asset group was necessary as its future undiscounted cash flows exceeded the carrying value. The Emerging Markets asset group could incur future impairment charges to its other intangible assets if it is unable to obtain additional contracts from the CBP or other customers. No impairment charge was necessary on the Company's Adjacent Markets reporting unit as a result of the assessment. Also see Note 1 to these consolidated financial statements.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nThe Companys consolidated goodwill and other intangible assets consisted of the following (in thousands):\nWeighted-Average Remaining Useful Lives (in years)\nAS OF SEPTEMBER 30,\nGoodwill:\nEmerging Markets reporting unit\n$\n4,336\n$\n4,336\nAdjacent Markets reporting unit\nTotal goodwill\n5,072\n5,072\nAccumulated impairment losses\n(4,336\n)\n-\n$\n$\n5,072\nOther intangible assets:\nDeveloped technology\n14.2\n$\n6,475\n$\n6,475\nCustomer relationships\n0.5\n3,900\n3,900\nTrade names\n1.0\n2,022\n2,022\nNon-compete agreements\n0.3\nTotal other intangible assets\n7.5\n12,583\n12,583\nAccumulated amortization\n(7,010\n)\n(5,333\n)\n$\n5,573\n$\n7,250\nOther intangible assets amortization expense was $1.7 million for each of the fiscal years ended September 30, 2022 and 2021.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nAs of September 30, 2022, future estimated amortization expense of other intangible assets is as follows (in thousands):\nFor fiscal years ending September 30,\n$\nThereafter\n3,295\n$\n5,573\n12. Long-Term Debt\nThe Company had no long-term debt outstanding at September 30, 2022 or 2021.\nIn May 2022, the Company entered into a credit agreement (the Agreement) with Amerisource Funding, Inc, as administrative agent and as a lender, and Woodforest National Bank, as a lender. Available borrowings under the Agreement are determined by a borrowing base with a maximum availability of $10 million. The borrowing base is determined based upon certain of the Company's domestic assets which include (i) 70% loan to value of the Company's property located at 6410 Langfield Road in Houston, Texas (the Property), (ii) 50% of forced liquidation value of equipment, (iii) 80% of certain accounts receivable and (iv) 50% of forced liquidation value of certain inventory (inventory borrowing base limited to 100% of borrowing base credit given toward accounts receivable). The Agreement is for a two-year term with all funds borrowed due at the expiration of the term. The interest rate on borrowed funds is the Wall Street prime rate (with a minimum of 3.25%) plus 4.00%. The Company is required to make monthly interest payments on borrowed funds. Borrowings under the Agreement will be principally secured by the Property and the Company's domestic equipment, inventory and accounts receivables. In addition, certain domestic subsidiaries of the Company have guaranteed the obligations of the Company under the Agreement and such subsidiaries have secured the obligations by pledging certain assets. The Agreement requires the Company to maintain a minimum consolidated tangible net worth of $100 million. At September 30, 2022, the Company was compliant with all covenants under the Agreement and its borrowing availability was $8.5 million.\nDebt issuance costs of $0.2 million were incurred in connection with the Agreement. These costs were capitalized in other non-current assets on the consolidated balance sheet and are being amortized to interest expense over the term of the Agreement.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\n13. Other Current Liabilities\nOther current liabilities consisted of the following (in thousands):\nAS OF SEPTEMBER 30,\nDeferred revenue\n$\n$\n1,346\nCompensated absences\n1,849\n1,728\nPayroll\n1,579\nProperty and sales taxes\n1,038\nLegal and professional fees\nMedical claims\nProduct warranty\nIncome taxes\nOther\n$\n6,616\n$\n7,799\nThe Company is self-insured for certain losses related to employee medical claims. The Company has purchased stop-loss coverage for individual claims in excess of $175,000 per claimant per year in order to limit its exposure to any significant levels of employee medical claims. Self-insured losses are accrued based on the Companys historical experience and on estimates of aggregate liability for uninsured claims incurred using certain actuarial assumptions followed in the insurance industry.\n14. Employee Benefits\nThe Companys U.S. employees are participants in the Geospace Technologies Corporations Employees 401(k) Retirement Plan (the Plan), which covers substantially all eligible employees in the United States. The Plan is a qualified salary reduction plan in which all eligible participants may elect to have a percentage of their compensation contributed to the Plan, subject to certain guidelines issued by the Internal Revenue Service. The Companys share of discretionary matching contributions was approximately $1.0 million and $0.9 million in fiscal years 2022 and 2021, respectively.\nThe Companys stock incentive plans in which key employees may participate are discussed in Note 15 to these consolidated financial statements.\n15. Stockholders Equity\nIn February 2014, the board of directors and stockholders approved the 2014 Long Term Incentive Plan, as amended (the 2014 Plan). Under the 2014 Plan, an aggregate of 3,000,000 shares of common stock may be issued. The Company is authorized to issue nonqualified and incentive stock options to purchase common stock, restricted stock awards (RSAs) and restricted stock units (RSUs) to key employees, directors and consultants under the 2014 Plan. Options have a term not to exceed ten years, with the exception of incentive stock options granted to employees owning ten percent or more of the outstanding shares of common stock, which have a term not to exceed five years. The exercise price of any option may not be less than the fair market value of the common stock on the date of grant. In the case of incentive stock options granted to an employee owning ten percent or more of the outstanding shares of common stock, the exercise price of such option may not be less than 110% of the fair market value of the common stock on the date of grant. An RSU represents a contingent right to receive one share of the common stock upon vesting. Under the 2014 Plan, the Company may issue RSAs and RSUs to employees for no payment by the employee or for a payment below the fair market value on the date of grant. The RSAs and RSUs are subject to certain restrictions described in the 2014 Plan.\nAt September 30, 2022, an aggregate of 1,468,916 shares of common stock were available for issuance under the 2014 Plan.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nThe following table summarizes the combined activity under the equity incentive plans for the indicated periods:\nNumber of\nNonqualified\nOptions\nOutstanding\nWeighted\nAverage\nExercise\nPrice per\nShare\nNumber of\nRSAs\nWeighted\nAverage\nGrant-date\nFair Value\nper Share\nNumber of\nRSUs\nWeighted\nAverage\nGrant-date\nFair Value\nper Unit\nOutstanding at October 1, 2020\n91,100\n$\n17.66\n110,374\n$\n16.66\n218,257\n$\n14.82\nGranted\n-\n-\n-\n-\n195,950\n7.00\nExercised\n-\n-\n-\n-\n-\n-\nForfeited\n(52,300\n)\n16.47\n(2,500\n)\n14.78\n(44,001\n)\n7.14\nVested\n-\n-\n(65,777\n)\n17.28\n(70,832\n)\n14.63\nOutstanding at September 30, 2021\n38,800\n21.42\n42,097\n15.95\n299,374\n10.87\nGranted\n-\n-\n-\n-\n200,350\n8.49\nExercised\n-\n-\n-\n-\n-\n-\nForfeited\n(38,800\n)\n21.42\n-\n-\n(51,603\n)\n9.17\nVested\n-\n-\n(41,097\n)\n14.67\n(124,262\n)\n11.20\nOutstanding at September 30, 2022\n$\n-\n$\n-\n1,000\n$\n14.59\n323,859\n$\n9.54\nDuring fiscal years 2022 and 2021, the Company issued 200,350 and 195,950 RSUs to certain of its employees, executive officers and directors under the 2014 Plan. The RSUs issued include both time-based and performance-based vesting provisions. The weighted average grant date fair value of each RSU issued for fiscal years 2022 and 2021 was $8.49 and $7.00 per unit, respectively. The total grant date fair value of all RSUs issued for fiscal years 2022 and 2021 was $1.7 million and $1.4 million, respectively, which will be charged to expense over the next one to four years as the restrictions lapse. Compensation expense for RSUs was determined based on the closing market price of the Companys stock on the date of grant applied to the total number of units that are anticipated to fully vest. No RSAs have been issued since fiscal year 2019.\nAll RSAs and RSUs outstanding at September 30, 2022 and 2021 were issued from the 2014 Plan.\nStock-based compensation expense recognized for the fiscal years ended September 30, 2022 and 2021 was $1.7 million and $2.0 million, respectively. The Company accounts for forfeitures as they occur and records compensation costs under the assumption that the holder will complete the requisite service period. As of September 30, 2022, the Company had unrecognized compensation expense of $2,000 relating to RSAs which is expected to be recognized in the first quarter of fiscal year 2023. As of September 30, 2022, the Company had unrecognized compensation expense of $1.9 million relating to RSUs which is expected to be recognized over a weighted average period of 2.3 years.\n16. Income Taxes:\nComponents of loss before income taxes were as follows (in thousands):\nYEAR ENDED SEPTEMBER 30,\nUnited States\n$\n(19,425\n)\n$\n(10,628\n)\nForeign\n(3,258\n)\n(2,850\n)\n$\n(22,683\n)\n$\n(13,478\n)\nThe provision for income taxes consisted of the following (in thousands):\nYEAR ENDED SEPTEMBER 30,\nCurrent\nFederal\n$\n(12\n)\n$\nForeign\nState\n-\n-\nDeferred:\nFederal\n-\n-\nForeign\n(17\n)\n(17\n)\n$\n$\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nActual income tax expense differs from income tax expense computed by applying the U.S. statutory federal tax rate of 21% for each of the fiscal years ended September 30, 2022 and 2021 as follows (in thousands):\nYEAR ENDED SEPTEMBER 30,\nExpense (benefit) for U.S federal income tax at statutory rate\n$\n(4,763\n)\n$\n(2,834\n)\nEffect of foreign income taxes\nResearch and experimentation tax credit\n(223\n)\nState income taxes, net of federal income tax benefit\n(265\n)\nNondeductible expenses\nChange in valuation allowance\n3,768\n2,893\nImpact on deferred taxes due to change in tax rate\n-\nChange in fair value of contingent consideration\n(278\n)\n(569\n)\nForeign income tax withholding\nDisallowance of stock compensation adjustments in excess of book\nOther items\n(203\n)\n$\n$\nEffective tax rate\n(0.8\n)%\n(4.3\n)%\nThe income tax expense for fiscal years 2022 and 2021 primarily reflects withholding tax on rental income earned in foreign jurisdictions. The Company is currently unable to record any tax benefits for its tax losses in the U.S., Canada and the Russian Federation due to the uncertainty surrounding its ability to utilize such losses in the future to offset taxable income.\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Significant components of the Companys net deferred income tax assets (liabilities) were as follows (in thousands):\nAS OF SEPTEMBER 30, 2022\nAS OF SEPTEMBER 30, 2021\nU.S.\nNon U.S.\nTotal\nU.S.\nNon U.S.\nTotal\nDeferred income tax assets:\nAllowance for doubtful accounts\n$\n$\n$\n$\n$\n$\nInventories\n8,295\n8,513\n8,042\n-\n8,042\nLoss and tax credit carry-forwards\n29,606\n5,037\n34,643\n27,578\n4,945\n32,523\nStock-based compensation\n-\n-\nAccrued product warranty\nContingent earn-out consideration\n-\n-\n-\n-\nAccrued compensated absences\n-\n-\nProperty and equipment\n-\n-\nPrepaid income taxes\n-\n-\nOther reserves\nSubtotal deferred income tax assets\n38,748\n5,954\n44,702\n37,526\n5,715\n43,241\nValuation allowance\n(35,462\n)\n(5,914\n)\n(41,376\n)\n(31,668\n)\n(5,704\n)\n(37,372\n)\nNet deferred income tax assets\n3,286\n3,326\n5,858\n5,869\nDeferred income tax liabilities:\nAllowance for doubtful accounts\n-\n-\n-\n-\n-\n-\nInventories\n-\n-\n-\n-\n(6\n)\n(6\n)\nRight-of-use assets\n(109\n)\n-\n(109\n)\n(131\n)\n-\n(131\n)\nIntangible assets\n(356\n)\n-\n(356\n)\n(642\n)\n-\n(642\n)\nProperty, plant and equipment and other\n(2,821\n)\n(53\n)\n(2,874\n)\n(5,085\n)\n(36\n)\n(5,121\n)\nTotal deferred income tax liabilities\n(3,286\n)\n(53\n)\n(3,339\n)\n(5,858\n)\n(42\n)\n(5,900\n)\nNet deferred income tax liabilities\n$\n-\n$\n(13\n)\n$\n(13\n)\n$\n-\n$\n(31\n)\n$\n(31\n)\nThe financial reporting basis of investments in foreign subsidiaries exceed their tax basis. A deferred tax liability is not recorded for this temporary difference because the investment is deemed to be permanent. A reversal of the Companys plans to permanently invest\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nin these foreign operations would cause the excess to become taxable. At September 30, 2022, the Company had $2.6 million of cash and cash equivalents held by its foreign subsidiaries. At September 30, 2022 and 2021, the temporary difference related to undistributed earnings for which no deferred taxes have been provided was approximately $6.9 million and $6.5 million, respectively.\nTax return filings which are subject to review by local tax authorities by major jurisdiction are as follows:\nUnited States-fiscal years ended September 30, 2019 through 2022\nState of Texas-fiscal years ended September 30, 2019 through 2022\nState of New York-fiscal year ended September 30, 2020\nState of California - fiscal years ended September 30, 2019 through 2022\nState of Pennsylvania - fiscal year ended September 30, 2019\nRussian Federation-calendar years 2020 through 2022\nCanada-fiscal years ended September 30, 2019 through 2022\nUnited Kingdom-fiscal years ended September 30, 2021 through 2022\nColombia-calendar years 2020 through 2022\nThe Company had no unrecognized tax liabilities as of September 30, 2022 and 2021.\nAs of September 30, 2022, the Company had net operating loss (NOL) carry-forwards of approximately $106.2 million in the United States, $19.8 million in Canada and $2.3 million in Russia which are available to offset future taxable income in those jurisdictions. The NOL carry-forwards for Canada and Russia begin to expire in 2033 and 2026, respectively. The NOL carry-forward for the United States which originated prior to the 2017 Tax Act of $28.0 million begins to expire in 2028. The Companys NOLs originating after the 2017 Tax Act of $77.9 million do not expire. The Company has not completed a Section 382 limitation study which may prevent it from using its NOLs in the future.\nManagement of the Company has concluded that it is more-likely-than-not that its U.S., Canadian and Russian net deferred tax assets will not be realized in accordance with GAAP. At September 30, 2022 and 2021, the Company had a valuation allowance against its U.S. net deferred tax assets of $35.5 million and $31.7 million, respectively. At September 30, 2022 and 2021, the Company had a valuation allowance against Canadian net deferred tax assets of $5.2 million, and $5.4 million, respectively. At September 30, 2022 and 2021, the Company had a valuation allowance against its Russian net deferred tax assets of $0.7 million and $0.3 million, respectively.\n17. Loss Per Common Share\nBasic loss per share is computed by dividing net loss available to common stockholders by the weighted average number of common shares used in basic loss per share during the period. Diluted loss per share is determined on the assumption that outstanding RSUs have been exchanged for common stock and outstanding dilutive stock options have been exercised and the aggregate proceeds as defined were used to reacquire common stock using the average price of such common stock for the period.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nThe following table summarizes the calculation of net loss and weighted average common shares and common equivalent shares outstanding for purposes of the computation of loss per share (in thousands, except share and per share amounts):\nYEAR ENDED SEPTEMBER 30,\nNet loss\n$\n(22,856\n)\n$\n(14,056\n)\nLess: Loss allocable to unvested restricted stock\n-\n-\nLoss attributable to common shareholders\nfor diluted earnings per share\n$\n(22,856\n)\n$\n(14,056\n)\nWeighted average number of common share equivalents:\nCommon shares used in basic loss per share\n12,987,996\n13,358,930\nCommon share equivalents outstanding related to\nstock options and RSUs\n-\n-\nTotal weighted average common shares and common share\nequivalents used in diluted loss per share\n12,987,996\n13,358,930\nLoss per shares:\nBasic\n$\n(1.76\n)\n$\n(1.05\n)\nDiluted\n$\n(1.76\n)\n$\n(1.05\n)\nFor the calculation of diluted loss per share for fiscal years 2022 and 2021, stock options of zero and 38,800, respectively, and RSUs of 323,859 and 299,374, respectively, were excluded in the calculation of weighted average shares outstanding as a result of their impact being antidilutive.\n18. Commitments and Contingencies\nContingent Consideration\nIn connection with its acquisitions of Quantum and the OptoSeis® fiber optic sensing technology business, the Company recorded contingent purchase price payments, or contingent consideration, that may be owed in the future. For both acquisitions, the contingent payments are based on future receipt of contract awards and the resulting revenue derived from such contracts. The Company reviews and assesses the fair value of its contingent consideration on a quarterly basis. The determination of fair value is inherently unpredictable since it requires estimates and projections of future revenue, including the size, length, timing and, in the case of Quantum, the extent of gross profits earned under its future contracts. As a result, the Company anticipates fair value adjustments to these liabilities over the respective earn-out periods, and these adjustments will result in either charges or credits to the Companys operating expenses when the fair value of the contingent consideration increases or decreases, respectively.\nThe Company recorded an initial contingent consideration liability of $7.7 million in connection with its July 2018 acquisition of Quantum. Contingent payments, if any, may be paid in the form of cash or Company stock and will be derived from eligible revenue generated during a four-year earn-out period, which ended in July 2022. The maximum amount of contingent payments was $23.5 million over the four-year earn-out period. In fiscal year 2020, the Company made cash contingent consideration payments of $0.1 million to the former shareholders of Quantum. In September 2021 and October 2021, the Company made additional cash earn-out payments of $1.4 million and $0.8 million, respectively, to the former shareholders of Quantum. The payments were primarily attributable to revenue earned on Quantums $10.5 million contract with the CBP to provide a technology solution to the Department of Homeland Security. At September 30, 2021, the contingent consideration liability was valued at $0.8 million related to projected future eligible revenue. During the fiscal year ended September 30, 2022, the Company recorded an adjustment of $0.6 million to decrease the liability to $0.2 million. The decrease for the fiscal year ended September 30, 2022 was primarily the result of timing in securing a potential second contract with the CBP caused by federal budget delays. In November 2022, the Company made a final payment of $0.2 million to the former shareholders of Quantum and has no further earn-out obligations related to this acquisition.\nThe Company recorded an initial contingent consideration liability of $4.3 million in connection with its November 2018 acquisition of all the intellectual property and related assets of the OptoSeis®fiber optic sensing technology. Contingent cash payments, if any, will be derived from eligible revenue generated during a five-and-a-half year earn-out period ending in May 2024. In order for revenue to be considered eligible, sales contracts must be entered into during the first four years of the earn-out period ending November 13, 2022. The maximum amount of contingent payments is $23.2 million over the five-and-a-half year earn-out period. At September 30, 2021, the contingent consideration liability was valued at $4.4 million. During the fiscal year ended September 30, 2022, the Company recorded an adjustment of $4.4 million to decrease the liability to zero. The decrease for the fiscal year ended September 30, 2022 was\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nthe result of the unlikelihood of entering into a sales contract prior to the eligibility date. No sales contracts were entered into by the November 13, 2022 eligibility date. The Company had no further earn-out obligations related to this acquisition.\nContingent Compensation Costs\nIn connection with the acquisition of Aquana in July 2021, the Company is subject to additional contingent cash payments to the former members of Aquana over a six-year earn-out period. The contingent payments, if any, will be derived from certain eligible revenue generated during the earn-out period from products and services sold by Aquana. There is no maximum limit to the contingent cash payments that could be made. The merger agreement with Aquana requires the continued employment of a certain key employee and former member of Aquana for the first four years of the six year earn-out period in order for any of Aquanas former members to be eligible to any earn-out payments. As discussed in Note 3, due to the continued employment requirement, no liability has been recorded for the estimated fair value of contingent earn-out payments for this transaction. Earn-outs achieved, if any, will be recorded as compensation expense when incurred.\nLegal Proceedings\nThe Company is involved in various pending legal actions in the ordinary course of its business. Management is unable to predict the ultimate outcome of these actions, because of the inherent uncertainty of such actions. However, management believes that the most probable, ultimate resolution of current pending matters will not have a material adverse effect on the Companys consolidated financial position, results of operations or cash flows.\n19. Supplemental Cash Flow Information\nSupplemental cash flow information is as follows (in thousands):\nYEAR ENDED SEPTEMBER 30,\nCash paid for income taxes\n$\n$\nNon-cash investing and financing activities:\nInventory transferred to rental equipment\n1,148\n4,038\nInventory transferred to property, plant and equipment\nIssuance of notes receivables in connection with sale of used rental equipment\n11,745\n2,665\n20. Segment and Geographic Information\nThe Company reports and evaluates financial information for three operating business segments: Oil and Gas Markets, Adjacent Markets and Emerging Markets. The Oil and Gas Markets segments products include wireless seismic data acquisition systems, reservoir characterization products and services, and traditional seismic exploration products such as geophones, hydrophones, leader wire, connectors, cables, marine streamer retrieval and steering devices and various other seismic products. The Adjacent Markets segments products include imaging equipment, water meter products, remote shut-off valves and IoT platform, as well as seismic sensors used for vibration monitoring and geotechnical applications such as mine safety applications and earthquake detection. The Emerging Markets segment designs and markets seismic products targeted at the border and perimeter security markets.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nThe following tables summarize the Companys segment information:\nYEAR ENDED SEPTEMBER 30,\nRevenue:\nOil and Gas Markets\n$\n49,141\n$\n52,252\nAdjacent Markets\n39,171\n32,419\nEmerging Markets\n10,193\nCorporate\n-\nTotal\n89,253\n94,864\nIncome (loss) from operations:\nOil and Gas Markets\n(7,539\n)\n(16,229\n)\nAdjacent Markets\n6,021\n6,423\nEmerging Markets\n(9,128\n)\n5,033\nCorporate\n(12,490\n)\n(12,098\n)\nTotal\n(23,136\n)\n(16,871\n)\nDepreciation and amortization expenses:\nOil and Gas Markets\n16,947\n18,199\nAdjacent Markets\nEmerging Markets\n1,068\n1,209\nCorporate\nTotal\n19,560\n20,777\nImpairment, inventory obsolescence and stock-based compensation expenses:\nOil and Gas Markets\n3,612\n3,850\nAdjacent Markets\nEmerging Markets\n4,423\nCorporate\nTotal\n9,694\n4,971\nInterest income:\nOil and Gas Markets\n1,409\nAdjacent Markets\n-\nEmerging Markets\n-\n-\nCorporate\nTotal\n1,441\nInterest expense:\nOil and Gas Markets\n-\nAdjacent Markets\n-\n-\nEmerging Markets\n-\n-\nCorporate\n-\n-\nTotal\n-\nThe Companys manufacturing operations for its business segments are combined. Therefore, the Company does not segregate and report separate balance sheet accounts for each of its segments and, therefore, no such segment balance sheet information is presented in the table above.\nCorporate loss from operations primarily consists of the Companys Houston headquarters general and administrative expenses.\nGeospace Technologies Corporation and Subsidiaries\nNotes to Consolidated Financial Statements-(Continued)\nThe Company generates revenue from product sales, product rentals and services from its subsidiaries located in the United States, Canada, Colombia, the Russian Federation and the United Kingdom. Revenue generated by the Companys subsidiaries is as follows (in thousands):\nYEAR ENDED SEPTEMBER 30,\nUnited States\n$\n82,332\n$\n88,776\nCanada\n1,615\n1,132\nRussian Federation\n1,922\n1,746\nUnited Kingdom\n3,384\n3,210\n$\n89,253\n$\n94,864\nA summary of revenue by geographic area is as follows (in thousands):\nYEAR ENDED SEPTEMBER 30,\nAfrica\n$\n$\n2,507\nAsia\n13,823\n23,299\nCanada\n1,225\nEurope\n28,381\n13,801\nSouth America\n7,547\n2,514\nUnited States\n35,171\n49,541\nOther\n2,635\n2,205\n$\n89,253\n$\n94,864\nRevenue is attributed to countries based on the ultimate destination of the product sold, if known. If the ultimate destination is not known, revenue is attributed to countries based on the geographic location of the initial shipment.\nLong-lived assets were as follows (in thousands):\nAS OF SEPTEMBER 30,\nUnited States\n$\n71,742\n$\n98,395\nCanada\n1,459\n3,653\nColombia\nRussian Federation\n1,010\nUnited Kingdom\nChina\n$\n75,095\n$\n103,899\nSchedule II\nGeospace Technologies Corporation and Subsidiaries\nValuation and Qualifying Accounts\n(In thousands)\nBalance at\nBeginning\nof Period\nCharged to\nCosts and\nExpenses, net of Recoveries\nCharged\nto Other\nAssets\n(Deductions)\nand\nAdditions\nBalance at\nEnd of\nPeriod\nYear ended September 30, 2022\nAllowance for doubtful accounts on accounts and financing\nreceivables\n$\n$\n$\n-\n$\n(129\n)\n$\nYear ended September 30, 2021\nAllowance for doubtful accounts on accounts and financing\nreceivables\n$\n$\n(76\n)\n$\n-\n$\n$\nBalance at\nBeginning\nof Period\nCharged to\nCosts and\nExpenses\nCharged\nto Other\nAssets\n(Deductions)\nand\nAdditions\nBalance at\nEnd of\nPeriod\nYear ended September 30, 2022\nInventory obsolescence reserve\n$\n36,936\n$\n3,222\n$\n-\n$\n(787\n)\n$\n39,371\nYear ended September 30, 2021\nInventory obsolescence reserve\n$\n34,960\n$\n3,001\n$\n-\n$\n(1,025\n)\n$\n36,936"
}