{
    "cik": "1003078",
    "company": "MSC INDUSTRIAL DIRECT CO INC",
    "filing_type": "10-K",
    "filing_date": "2023-10-25",
    "period_of_report": "2023-09-02",
    "sic": "5084",
    "state_of_inc": "NY",
    "state_location": "NY",
    "fiscal_year_end": "0902",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1003078/0001003078-23-000102-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1003078/000100307823000102/msm-20230902.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1003078/0001003078-23-000102.txt",
    "filename": "1003078_10K_2023_0001003078-23-000102.htm",
    "content": "ITEM 1. BUSINESS.\nGeneral\nMSC Industrial Direct Co., Inc. (together with its wholly owned subsidiaries and entities in which it maintains a controlling financial interest, MSC, MSC Industrial, the Company, we, us or our) is a leading North American distributor of a broad range of metalworking and maintenance, repair and operations (MRO) products and services. With a history of driving innovation in industrial product distribution for more than 80 years, we help solve our manufacturing customers metalworking, MRO and operational challenges. Through our technical metalworking expertise and inventory management and other supply chain solutions, our team of more than 7,000 associates helps to keep our customers manufacturing operations up and running and to improve their efficiency, productivity and profitability.\nWe serve a broad range of customers throughout the United States, Canada, Mexico and the United Kingdom, from individual machine shops to Fortune 1000 manufacturing companies to government agencies such as the United States General Services Administration and the United States Department of Defense. We operate a sophisticated network of six customer fulfillment centers, 10 regional inventory centers 38 warehouses (36 in North America and two in Europe) and four manufacturing locations, including two locations acquired in the January 2023 acquisition of Buckeye and Tru-Edge (each, as defined below). Our customer fulfillment centers are located in or near Harrisburg, Pennsylvania; Atlanta, Georgia; Elkhart, Indiana; Columbus, Ohio; Reno, Nevada; and Hanover Park, Illinois.\nWe offer approximately 2.4 million active, saleable stock-keeping units (SKUs) through our catalogs; our brochures; our E-commerce channels, including our website, https://www.mscdirect.com (the MSC website); our inventory management solutions; and our customer care centers, customer fulfillment centers, regional inventory centers and warehouses. We carry many of the products we sell in our inventory, so that orders for these in-stock products are processed and fulfilled the day the order is received. We offer next-day delivery nationwide for qualifying orders placed by 8 p.m. Eastern Time (excluding Class C Consumables category products). Our customers can choose among many convenient ways to place orders: the MSC website, eProcurement platforms, inventory management solutions (including in-plant and vending solutions), customer care centers and direct communication with our telesales and outside sales associates. Additionally, MSCs robust sourcing capabilities and vast supplier base allow us to further satisfy our customers needs outside of our current product offerings.\nWe believe our value-added solutions approach to driving our customers success serves to differentiate MSC from traditional transaction-focused distributors. We endeavor to save our customers money when they partner with us for their metalworking, MRO, Class C Consumables and Original Equipment Manufacturer (OEM) product needs. We focus on building strong partnerships with our customers to help them improve their productivity, profitability and growth. We do this in a variety of ways:\nour experienced team includes customer care representatives, metalworking specialists, safety specialists, fluid connector specialists, inventory management specialists, in-plant and technical support teams and experienced sales associates focused on driving our customers success by reducing their operational costs;\nour robust systems and transactional data enable us to provide insights to our customers to help them take costs out of their supply chains and operations;\nour extensive product inventory enables our customers to deal with fewer suppliers, streamlining their purchasing work and reducing their administrative costs;\nour timely shipping enables our customers to reduce their inventory investment and carrying costs;\nour purchasing process consolidates multiple purchases into a single order, providing a single invoice for multiple purchases over time and offering direct shipments to specific departments and personnel at one or more facilities, which reduces our customers administrative costs;\nour extensive E-commerce capabilities provide sophisticated search and transaction capabilities, access to real-time inventory, customer-specific pricing, workflow management tools, customized reporting and other features. We can also interface directly with many metalworking applications, marketplaces and purchasing portals;\nour Better MRO digital platform delivers knowledge and insights to our customers that assist their associates and their business operations;\nour collaboration efforts with key supplier partners and their research and development teams deliver value and productivity on the plant floor;\nour inventory management solutions enable our customers to carry less inventory and still significantly limit situations when critical items are out of stock;\nour proprietary software solution, called Ap Op® (Application Optimization), enables our metalworking specialists to document productivity savings for customers for a range of applications, including grinding, milling, turning, threading, sawing, hole-making, metalworking fluids and other manufacturing process improvements;\nour exclusive service, MSC MillMax®, focuses on maximizing milling productivity and lowering cost while reducing the milling optimization process to a fraction of the time, which helps customers increase material removal rates, reduce cycle times, improve surface finishes and extend tool life, leading to improved productivity, quality and profits; and\nour strategic partnership with MachiningCloud, an industry leader in manufacturing tool data, provides a one-stop solution for manufacturing customers machining application needs, and MachiningClouds platform and manufacturer-provided data combined with MSCs vast product offerings and inventory availability, streamline the purchasing process and deliver greater efficiency in customers production processes.\nIndustry Overview\nMSC operates in a large, fragmented industry comprised of national, regional and local distributors, retail outlets, small distributorships, online distributors, direct mail suppliers, large warehouse stores and manufacturers own sales forces serving MRO customers.\nMSC differentiates itself in the industry by being a leading distributor of metalworking products. We have continued to expand technical support and enhance supplier relationships, especially with our metalworking products. Our associates share their deep expertise and knowledge of metalworking and MRO products to help our customers achieve their goals.\nNearly every industrial and service business has an ongoing need for MRO supplies. These businesses, with the exception of the largest industrial plants, often do not have the resources to manage and monitor their MRO inventories effectively. They spend more than necessary to purchase and track their supplies, providing an opportunity for MSC to serve as their one-stop MRO product supplier. Even the larger facilities often store their supplies in multiple locations, so they often carry excess inventories and duplicate purchase orders. In many organizations, multiple people often acquire the same item in small quantities via expensive, one-off purchases, resulting in higher purchasing costs and administrative efforts to keep track of supplies.\nWith limited capital availability and limited E-commerce capabilities and operating leverage, smaller industrial distributors are under increasing pressure to consolidate and/or curtail services and product lines to remain competitive. Their challenge represents MSCs opportunity. We improve purchasing efficiency and reduce costs for our customers because our offerings enable our customers to consolidate suppliers, purchase orders and invoices, and reduce inventory tracking, stocking decisions, purchases and out-of-stock situations. In addition, through Vendor Managed Inventory (VMI), Customer Managed Inventory (CMI) and vending solutions, we empower our customers to utilize sophisticated inventory management solutions.\nBusiness Strategy\nMSCs business strategy is based on helping our customers become more productive and profitable by reducing their total costs for purchasing and using metalworking, MRO, Class C Consumables and OEM products. Leveraging our expertise, knowledge and experience with metalworking products will continue to be a key tenet of our business strategy. Our customer-focused culture and high-touch engagement model drive value for our customers and result in deep customer relationships. Our business strategy includes the following key elements:\nTechnical Expertise and Support. We provide technical support and one-on-one service through our field sales specialists and our centralized tech team representatives. We have a dedicated team of more than 150 metalworking and specialty sales experts who work with customers to improve their manufacturing processes and efficiency, as well as a technical support team that provides assistance to our sales teams and customers via phone and email. These metalworking and specialty sales experts are customer-facing and work side-by-side with our customers to perform onsite need analysis and to identify productivity improvement opportunities. We utilize our Ap Op® proprietary software to capture the application data and to deliver documented cost savings to our customers. Our exclusive service, MSC MillMax®, focuses on maximizing milling productivity and lowering costs while reducing the milling optimization process to a fraction of the\ntime. Our customers recognize the value of a distributor that can provide technical support to improve their operations and productivity.\nInventory Management Solutions. Our approach starts with a thorough customer assessment. Our expert associates develop and recommend solutions that provide exceptional value to the customer. Depending on the customers size and needs, we customize options to address complexity and processes, as well as specific products, technical issues and cost targets. The options include eProcurement, VMI, CMI, vending, tool crib control or in-plant solutions. Our world-class sourcing, logistics and business systems provide predictable, reliable and scalable service.\nBroad Selection of Products. Customers want a full range of product options, even as they look to reduce the number of suppliers they partner with. We provide good-better-best alternatives, comprising a spectrum of brand name, MSC exclusive brand and generic MRO products. MSCs broad selection of products enables customers to choose the right combination of price and quality on every purchase to meet their needs.\nSame-Day Shipping and Next-Day Delivery. We guarantee same-day shipping of our core metalworking and MRO products, enabling customers to reduce supply inventories. We fulfill our same-day shipment guarantee for in-stock products about 99% of the time. We offer next-day delivery nationwide for qualifying orders placed by 8 p.m. Eastern Time (excluding Class C Consumables sales channel products). We know that our customers value this service, and areas accessible by next-day delivery generate significantly greater sales for MSC than areas where next-day delivery is not available.\nSuperior Customer Service. Our commitment to customer service starts with our many associates who share their deep expertise and knowledge of metalworking, MRO, Class C Consumables and OEM products to help our customers achieve greater success. We invest in sophisticated information systems and provide extensive training to empower our associates to better support our customers. Using our proprietary customer support software, our customer care representatives can: inform customers on a real-time basis of product availability; recommend substitute products; verify credit information; receive special, custom or manufacturer direct orders; cross-check inventory items using previously entered customer product codes; and arrange or provide technical assistance. We offer: customized billing; customer savings reports; electronic data interchange ordering; E-commerce capabilities; bulk discounts; and stocking of specialty items requested by customers.\nCommitment to Technological Innovation. We embrace technological innovations to support our customers, which in turn propels our growth, improves our customer service and reduces our operating costs. The innovations make our buying practices more effective, improve our automated inventory replenishment and streamline order fulfillment. MSCs proprietary software helps our customers and sales representatives determine the availability of products in real time and evaluate alternative products and pricing. Our warehouses are automated through the use of advanced systems and robotics platforms that allow us to rapidly process orders for next-day delivery, with greater efficiency.\nWe also continually upgrade our distribution methods and systems and provide comprehensive electronic ordering capabilities to support our customers purchase order processing. We continue to invest in our VMI, CMI and vending solutions that streamline customer replenishment and trim our customers inventories. Our vending solutions include different kinds of machines, such as storage lockers or carousels, which can stand alone or be combined with other machines. MSC vending machines use network or web-based software to enable customers to gain inventory visibility, save time and drive profitability.\nDigital Technologies and the MSC Website. The MSC website contains a searchable online catalog with electronic ordering capabilities and provides personalized real-time inventory availability, online bill payment, delivery tracking status and other enhancements, including work-flow management tools. The user-friendly search engine on the MSC website allows customers to find SKUs by keyword, part description, competitive part number, vendor number or brand. Information can also be found detailing MSCs in-plant and other inventory management solutions. The MSC website is a key component of our strategy to reduce our customers transaction costs and delivery time.\nCompetitive Pricing. Customers increasingly evaluate their total procurement costs, of which our industrial supplies are an important component. As a result, we strategically adjust our customer pricing to maintain competitiveness, while capturing the value of our comprehensive services.\nGrowth Strategy\nOur growth strategy includes a number of initiatives to gain market share and reposition MSC from being a spot-buy supplier to a mission-critical partner to our customers. These initiatives include the following:\nExpanding and enhancing our metalworking capabilities to aggressively penetrate customers in heavy and light manufacturing. MSC is a leading distributor of metalworking products in North America. We have continued to expand technical support and enhance supplier relationships. We are continuing to develop high-performance metalworking products marketed under MSC exclusive brands, providing high-value product alternatives for our customers. Our metalworking field specialists and centralized technical support team members have diverse backgrounds in machining, programming, management and engineering. They help our customers select the right tool for the job from our deep supplier base and exclusive brands.\nExpanding programs for our public sector and national account customers. Our public sector program is focused on becoming an industry leader and trusted advisor to key public sector end customers. Although MSC has been providing metalworking and MRO supplies to the commercial sector for more than 80 years, we recognize the importance of diversifying into the public sector. Over the last few years, MSC has invested in our public sector programs and expanded into several large contracts with federal, state and local agencies, and we expect to continue to expand the scope of our public sector programs to leverage our recent success and position MSC for future growth.\nWe provide customized national account programs for larger customers, often on an enterprise-wide basis. These national account customers value our ability to support their procurement needs electronically to reduce their transactional costs. Our dedicated national account managers and operations experts provide supply chain solutions that reduce these customers total costs of procurement and ownership through increased visibility into their MRO purchases and improved management. We demonstrate these savings by providing these customers with detailed reporting at both the enterprise and site level.\nIncreasing sales from existing customers and generating new customers with various value-added programs. Our value-added programs include business needs analysis, inventory management solutions and workflow management tools. Our customers particularly value our industrial vending solutions that can accommodate a range of products from precision cutting tools to MRO supplies. We are increasing investments in vending, VMI and our growing in-plant solutions program.\nEnhancing E-commerce capabilities. The MSC website is a business-to-business oriented, horizontal marketplace serving the metalworking and MRO market. The MSC website allows customers to enjoy added convenience without sacrificing customized service. The MSC website is a key component of our strategy to reduce customers transaction costs and internal requisition time. MSC continues to evaluate the MSC website and solicit customer feedback, making on-going improvements to ensure that it remains a premier website in our marketplace. The MSC website provides advanced features, such as order approval (workflow) and purchase order control, that our customers interact with in order to derive business value beyond merely placing an order. Many large customer accounts transact business with MSC using eProcurement solution providers that sell a suite of E-commerce products. We have associations with many of these providers and continue to evaluate and expand our eProcurement capabilities.\nSelectively pursuing strategic acquisitions and investments. MSC is a leader in the highly fragmented industrial distribution market with significant opportunities for organic and acquisitive growth. We selectively pursue strategic acquisitions that deepen our metalworking expertise, extend our capabilities into strategic adjacencies, such as OEM fasteners, hardware and components, and expand our markets in North America. We also seek to target investments in businesses and other ventures that we believe offer opportunities for growth and improved operational performance for our business.\nIn January 2023, the Company acquired certain assets and assumed certain liabilities of Buckeye Industrial Supply Co. (Buckeye), an Ohio-based metalworking distributor, and Tru-Edge Grinding, Inc. (Tru-Edge), an Ohio-based custom tool manufacturer. Buckeye primarily serves the metalworking needs of large manufacturers. MSC Industrial plans to build on Buckeyes technical, high-touch relationships and value-added services by offering customers access to its extensive product portfolio to support customers full metalworking and MRO needs. Tru-Edge brings new capabilities to MSC Industrial, including the design and manufacture of parts from scratch with a strong focus in the automotive and medical markets. The Company expects to drive revenue growth in its existing Midwest manufacturing customer base by\nleveraging the services provided by Tru-Edge. The Company believes the technical expertise and value-added services provided by Tru-Edge will support its effort to drive cost savings for its customers.\nIncreasing the size and improving the productivity of our direct sales force. We have invested resources to give our sales representatives more time with our customers and have provided increased support to drive customer productivity improvements and deliver a personalized experience for our customers. At September 2, 2023, our field sales and service associate headcount was 2,572. We believe that our sales force investment has played a critical role in the overall success of the Companys revenue performance. Our sales force, focusing on a more complex and high-touch role, drives value for our customers by enabling them to achieve higher levels of growth, profitability and productivity.\nIncreasing the number of product lines and productive SKUs. We offer approximately 2.4 million active, saleable SKUs through our distribution and E-commerce channels, including the MSC website, inventory management solutions, catalogs, brochures, customer care centers, customer fulfillment centers, regional inventory centers and warehouses. The majority of products sold are third-party manufactured products; however, SKUs sold under MSC private label brands approximate 13% of net sales. We are increasing the breadth and depth of our product offerings and pruning non-value-added SKUs. In fiscal year 2023, we added approximately 240,000 SKUs, net of SKU removals, to our active, saleable SKU count. We also leverage the depth and breadth of MSCs product portfolio within our Class C Consumables sales channel. We plan to continue adding SKUs in fiscal year 2024.\nImproving our marketing programs. MSC has built an extensive buyer database, which we harness via both human and artificial intelligence to target our marketing to the best prospects. We supplement the efforts of our sales force through the use of digital and traditional marketing tactics. Our industry-specific expertise allows us to focus our outreach on the most promising growth areas.\nImproving our excellent customer service. MSC consistently receives top quartile customer satisfaction ratings, according to customer surveys. By working to anticipate our customers needs, we strive to exceed our customers expectations. This focus on our customers needs enables us to achieve our goal to stand apart in the market. We use customer comment cards, surveys and other customer outreach tools, using their feedback to improve the overall customer experience.\nIntellectual Property\nWe conduct business under various trademarks and service marks. We protect these trademarks by maintaining registrations in the United States, Canada and elsewhere. We also file for and obtain patents and use confidentiality and other agreements with customers, associates, consultants and others in order to protect our proprietary information. Although we do not believe our operations are substantially dependent upon any of our intellectual property, we consider our intellectual property to be valuable to our business.\nProducts and Supplier Services\nOur broad range of metalworking and MRO products includes cutting tools, measuring instruments, tooling components, metalworking products, fasteners, flat stock, raw materials, abrasives, machinery hand and power tools, safety and janitorial supplies, plumbing supplies, materials handling products, power transmission components and electrical supplies. Our large and growing number of SKUs makes us an increasingly valuable partner to our customers as they look to rationalize their supplier base. Our assortment from multiple product suppliers and MSC exclusive brands, prices and quality levels enables our customers to select from good-better-best options on nearly all of their purchases. Our extensive network of suppliers provides us access to technical application, safety, training certifications and many other value-added services for our customers. We stand apart from our competitors by offering brand name, MSC exclusive brand and generic products, depth in our core product lines and competitive pricing.\nWe purchase substantially all of our products directly from more than 3,000 suppliers. No single supplier accounted for more than 5% of our total purchases in fiscal year 2023, 2022 or 2021.\nCustomer Fulfillment Centers and Distribution Network\nWe continue to invest in the enhancement of our distribution efficiency and capabilities. When our customers order an in-stock product online or via phone, we ship it the day the order is placed about 99% of the time. We do that through our six customer fulfillment centers, 10 regional inventory centers and 38 warehouses. Some specialty or custom\nitems and very large orders are shipped directly from the manufacturer. We manage our primary customer fulfillment centers via computer-based SKU tracking systems and radio frequency devices that locate specific stock items to make the selection process more efficient. Our warehouses are predominantly from our acquired subsidiaries. Similar to our customer fulfillment centers, these warehouses primarily handle the stocking and fulfillment of inventory. However, in some cases, these locations also operate as subsidiary headquarters and provide office space for sales associates.\nSales and Marketing\nWe serve individual machine shops, Fortune 1000 companies, government agencies and manufacturers of all sizes. With some of our recent acquisitions, such as All Integrated Solutions, Inc. and Tower Fasteners, LLC (Tower Fasteners), we have increased our presence in the OEM fasteners, hardware and components business. We have also significantly increased our presence in the VMI space within the Class C Consumables sales channel. VMI involves not only selling the Class C Consumables, but also managing appropriate stock levels for the customer, fulfilling replenishment orders, putting away the stock, and maintaining a clean and organized inventory area.\nMSCs public sector customers include governments and their instrumentalities such as federal agencies, state governments, and public sector healthcare providers. Federal government customers include the United States Marine Corps, the United States Coast Guard, the United States Postal Service, the United States General Services Administration, the United States Department of Defense, the United States Department of Energy, large and small military bases, Veterans Affairs hospitals, and correctional facilities. We have individual state and local contracts, as well as contracts through partnerships with several state co-operatives.\nOur national account program includes Fortune 1000 companies, large privately held companies, and international companies primarily doing business in North America. We have identified hundreds of additional national account prospects and have given our sales team tools to ensure we are targeting prospective customers that best fit the MSC model.\nWe have implemented advanced analytics and significantly increased the return on our marketing investments designed to acquire new customers and increase our share of business with current customers. The majority of our efforts are focused on search engine marketing, email marketing and online advertising to align with our customers buying behavior. We utilize traditional marketing methods, such as catalogs and direct mail, on a selective basis. We use our own contact database together with external information to target buyers with the highest likelihood to buy.\nOur sales representatives are highly trained and experienced individuals who build relationships with customers, assist customers in reducing costs, provide and coordinate technical support, coordinate special orders and shipments with vendors, and update customer account profiles in our information systems databases. Our marketing approach centers on the ability of our sales representatives, armed with our comprehensive databases as a resource, to respond effectively to the customers needs. When a customer interacts with MSC, the sales representative has immediate access to that customers company and specific buyer profile, which includes billing and purchasing track records, and plant and industry information. Meanwhile, the sales representative has access to inventory levels on every SKU we carry.\nOur associates at our customer care centers undergo an intensive seven-week training course, followed up by regular training seminars and workshops. We monitor and evaluate our sales associates at regular intervals through quality monitoring, customer satisfaction surveys and net promoter score feedback. We also provide our sales associates with technical training by our in-house specialists and product vendors. We maintain a separate technical support group dedicated to answering customer inquiries and assisting our customers with product operation information and finding the most efficient solutions to manufacturing problems.\nVirtual Customer Care Hubs\nAs part of our enhanced customer support model implemented in fiscal year 2021, we transitioned from our branch office network to virtual customer care hubs. Our virtual customer care hubs continue to play an integral role in obtaining new accounts and penetrating existing ones.\nDigital and Traditional Marketing\nOur primary method of presenting products and solutions is the MSC website and our digital marketing programs, which include tactics such as search engine marketing, email marketing, social media and online advertising. These programs align with the ever-evolving buying behavior of our customers and are designed to maximize marketing\nproductivity and return on marketing dollars spent. While digital is our primary means of marketing, we leverage catalogs, sales collateral and promotional brochures where appropriate. We use these methods to target customers in specific areas, such as metal fabrication, facilities management, and safety and janitorial, with a more focused selection of products or solutions.\nCustomer Service\nOne of our goals is to make purchasing our products as convenient and effortless as possible. During the fiscal year ended September 2, 2023, customers submitted approximately 61.1% of their orders digitally through our E-commerce platforms (the MSC website, vending machines and eProcurement). The remaining orders are primarily placed via telephone, email and fax. The efficient handling of orders is a critical aspect of our business. Order entry and fulfillment occurs at our main customer care centers, mostly located at our customer fulfillment centers. Customer care phone representatives enter non-digital orders into computerized order processing systems. In the event of a local or regional situation, our communications system will reroute customer exchanges to an alternative location. When an order enters the system, a credit check is performed; if the credit is approved, the order is usually transmitted to the customer fulfillment center closest to the customer. Customers are invoiced for merchandise and shipping and handling promptly after shipment.\nInformation Systems\nMSCs information systems are an integral part of driving growth and delivering our full value proposition to our customers. In todays digital world, our systems allow our customers to conduct business with us securely across multiple channels and in the way they want. In addition, our systems enable data visibility for faster decision making, which drives operational efficiency and supports a flexible remote workforce across the globe.\nOur E-commerce environment is continually being upgraded and enhanced with a focus on delivering an exceptional online customer experience. We plan to achieve this by utilizing state-of-the-art cloud technologies, developing an industry leading search engine, deploying an integrated digital marketing platform and further enriching our product data.\nIn response to shifts in the labor market, we also look to accelerate automation in our customer fulfillment centers. In fiscal year 2019, we introduced a patented robotic packing solution, and we are in the process of deploying advanced robotic picking technology to several customer fulfillment centers.\nMost of our information systems operate in real time over a secure wide area network, letting each customer fulfillment center and virtual customer care hub share information and monitor daily progress on sales activity, credit approvals, inventory levels, stock balancing, vendor returns, order fulfillment and other key performance measures. We maintain a sophisticated buying and inventory management system that monitors all of our SKUs and automatically purchases inventory from vendors for replenishment, based on proprietary forecasting models. We also maintain an Electronic Data Interchange (EDI) and XML purchasing program with our vendors to boost order placement efficiency, reduce order cycle processing time, and increase order accuracy.\nAs part of our commitment to creating services that fuel the potential of our customers, we develop and maintain a suite of proprietary VMI digital solutions. These VMI digital solutions allow our customers to focus on their core business, while MSC manages their inventory ordering, fulfillment and replenishment. Our various VMI digital solutions are customizable to meet both simple and complex customer needs. Our scanning solutions integrate scanner accumulated orders directly into our Sales Order Entry system and the MSC website. Our CMI enables customers to simply and effectively replenish inventory by submitting orders directly to the MSC website. Our customized vending solutions are used by customers in manufacturing plants to help them achieve supply chain and shop floor optimization, through inventory optimization and reduced tooling and labor costs. All of our digital solutions function directly as front-end ordering systems for our e-Portal-based customers. These solutions take advantage of advanced technologies built upon the latest innovations in E-commerce and wireless and cloud-based computing.\nOur core business systems run in a highly distributed computing environment and utilize world-class software and hardware platforms from key partners. We utilize disaster recovery techniques and procedures, which are consistent with best practices in enterprise information technology (IT). With many of our associates shifting to a remote work model beginning in fiscal year 2020, we deployed secure home computing assets and implemented collaboration software to\nenable interconnected teams and scalable video conferencing for large virtual gatherings. Our focus in fiscal year 2024 onwards will be to optimize the hybrid associate work experience.\nWe believe that our current systems and practice of implementing regular updates are adequate to support our current needs. Over the next few years, we will also be upgrading and migrating many of our systems to take advantage of the flexibility and controls offered by cloud computing platforms while downsizing our on-premise data center footprint. Recent cloud migrations include commercial off-the-shelf enterprise systems as well as our E-commerce infrastructure.\nOur sales representatives are equipped with proprietary mobile technology that allows them to tap into MSCs supply chain directly from our customers manufacturing plants and make sure that critical inventory is always on site and available. In addition, we are enhancing our customer websites and portals to reflect this new mobile reality at a pace in line with customer adoption of mobile technology.\nOur customer care centers are powered via state-of-the-art telephony, case management and workforce optimization platforms. The features within the platforms create a seamless environment equipped with advanced applications that assist our associates in optimizing our customers experience. The architecture has established a dynamic infrastructure that is scalable both in terms of operations and future capabilities. We are continuing to implement additional functionality aimed at enhancing the engagement and personalization of the customer experience regardless of the contact method chosen.\nMSC is actively leveraging artificial intelligence (AI) in various areas to improve customer experiences and drive efficiencies in areas such as time-series forecasting models for financial planning, AI-driven recommendations for our customer-care team, order error processing, natural language processing to automate product taxonomy classification and AI-driven chatbots for our associates to quickly find relevant information. We continue to take steps to understand, secure and pilot this technology in additional areas within the Company. We believe our strategic alignment with leading vendors in this space will position MSC well for a future where AI technology will be integrated into many aspects of MSCs business.\nCompetition\nThe MRO supply industry is a large, fragmented industry that is highly competitive. We face competition from traditional channels of distribution, such as retail outlets, dealers and wholesalers, regional and national distributors utilizing direct sales forces, manufacturers of MRO supplies, large warehouse stores and large direct mail distributors. We also face substantial competition in the online distribution space that competes with price transparency and includes both traditional distributors and non-traditional, web-based E-commerce competitors. In addition, new entrants in the MRO supply industry could increase competition. We believe that sales of MRO supplies will become more concentrated over the next several years, which may make MRO supply distribution more competitive. Some of our competitors challenge us with a greater variety of product offerings, greater financial resources, additional services, or a combination of these factors. In the industrial products market, customer purchasing decisions are based primarily on one or more of the following criteria: price, product selection, product availability, technical support relationship, level of service and convenience. We believe we compete effectively on all such criteria. Our industry has seen consolidation in recent years. The trend of our industry toward consolidation could cause the industry to become more competitive as greater economies of scale are achieved by competitors, or as competitors with new lower-cost business models are able to operate with lower prices and gross profit on products.\nSeasonality\nDuring any given time, we may be impacted by our industrial customers plant shutdowns, particularly during the summer months (our fiscal fourth quarter), as well as the winter months for the Christmas and New Year holiday period (our fiscal second quarter). In addition, we may be impacted by weather-related disruptions.\nCompliance with Health and Safety and Environmental Laws and Regulations\nOur operations are subject to and affected by a variety of federal, state, local and non-U.S. health and safety and environmental laws and regulations relating to the discharge, treatment, storage, disposal, investigation and remediation of certain materials, substances and wastes. We continually assess our compliance status and management of environmental matters to ensure that our operations are compliant with all applicable environmental laws and regulations.\nOperating and maintenance costs associated with environmental compliance and management of sites are a normal and recurring part of our operations. With respect to all other matters that may currently be pending, in the opinion of management, based on our analysis of relevant facts and circumstances, compliance with applicable environmental laws and regulations is not likely to have a material adverse effect upon our capital expenditures, earnings or competitive position.\nHuman Capital Resources\nAs of September 2, 2023, we employed 7,377 associates worldwide, of which approximately 7,131 were full-time and 246 were part-time. No associate is represented by a labor union. Approximately 90% of our workforce is based in the United States. MSC has not experienced any major work stoppages and considers associate relations to be good.\nOur goal is to attract, develop and retain a talented team of associates inspired by our greater purpose of fueling the potential of our stakeholders. We believe a career at MSC includes:\nPurpose - MSC helps to fuel the industrial economy, propel our stakeholders success, and contribute to our customers growth.\nPeople and Respect - MSC cares about people. We strive to offer a positive work environment, with people you like and leaders you can respect.\nHealth and Well-being - MSC offers many available options for our associates and their families to be healthy and plan for the future.\nRewards and Recognition - Appreciation for our associates contributions and the opportunity to share financially and intrinsically in MSCs success.\nGrowth - The opportunity to learn, take risks and develop a career.\nAt MSC, we refer to our workforce as our team of associates, rather than employees, because we believe that our associates have a stake in our success. We rely on each other to be as dedicated to MSC as MSC is dedicated to each associate. This is a critical part of our expectations of our associates and a unique part of our culture.\nHealth and Safety\nMSCs safety vision is to build a culture in which safety is a top value across all levels of the organization, and that every associate has the right and responsibility to continually seek to prevent injuries and build a safe environment for everyone. Our leadership team is highly engaged through our Safety Leadership System in identifying trends in our incidents throughout the network and working collaboratively with our safety professionals to effectively reduce incidents involving our associates and to make MSC one of the safest places to work.\nIn calendar year 2022, the Companys Occupational Safety and Health Administration (OSHA) Total Recordable Incident Rate was 1.72 and the Companys OSHA Lost Time Incident Rate was 0.62 based upon the number of incidents per 100 associates (or per 200,000 work hours). The Companys rates fall well below the Total Recordable Incident Rate and the Lost Time Incident Rate of the North American Industry Classification System, which were 2.10 and 0.70, respectively. The success of our Safety Leadership System was additionally validated through the completion and re-certification to the ISO 45001 Standard in our Columbus, Ohio customer fulfillment center in November 2022. We are expanding our efforts to achieve ISO 45001 certification throughout the supply chain network in the coming years.\nDiversity, Equity and Inclusion\nMSC is committed to promoting a respectful, diverse workplace, constructive collaboration, innovative creativity, and genuine leadership. We believe that our culture and our business benefit greatly from the rich combination of experience, creativity and perspective that our diverse workforce provides. Our associates differences - the individual characteristics, work styles, beliefs and backgrounds - make us strong and equip us to better serve our customers. Because we are dedicated to an environment of equal opportunity, we partner with several outreach organizations that help us in our recruitment efforts such as: Hiring our Heroes, minority-owned organizations, women-owned organizations, local and state workforce services, and vocational rehab centers. Additionally, MSC continues to grow its business resource groups, known as Inclusion Circles, with membership growing to more than 1,000 associates combined. Each Inclusion Circle is sponsored by a member of the MSC leadership team. These include WIN (Womens Inclusion Network), Veterans, BIG (Black Inclusion Group), Pride, ABLE, GEN (Generational Empowerment Network) and HOLA (Hispanic Organization for Leadership and Advancement).\nAs of September 2, 2023, our U.S. associate population by gender, ethnic and racial attributes was as follows:\nU.S. Associate Population\nMale Female White Hispanic/Latino Black/African American Asian American Indian/Alaskan Native Native Hawaiian/Other Pacific Islander Two or More Races\nNot Available\nIndividual Contributor 59.9 % 40.1 % 71.5 % 10.0 % 12.8 % 2.2 % 0.7 % 0.3 % 2.4 % 0.1 %\nMiddle Management 63.9 % 36.1 % 82.6 % 4.9 % 8.7 % 1.9 % 0.3 % 0.3 % 1.2 % 0.1 %\nDirector and Above 71.1 % 28.9 % 85.2 % 0.8 % 6.6 % 7.4 % - % - % - % - %\nTotal U.S. Associate Population\n60.5 % 39.5 % 73.0 % 9.3 % 12.2 % 2.3 % 0.6 % 0.3 % 2.2 % 0.1 %\nTalent Acquisition and Development\nMSC focuses on creating opportunities for associate growth, development and training education, offering a comprehensive talent program that continues throughout an associates career. MSC believes that its future success is highly dependent upon the Companys continued ability to attract, retain and motivate associates. As part of its efforts in these areas, the Company offers competitive compensation and benefits to meet the diverse needs of team members and support their health and well-being, financial future and work-life balance. Associates are given access to health plan resources, disease management, tobacco cessation, parental support, stress management and weight loss programs. In addition, MSC provides to its associates retirement savings, paid holidays and time off, educational assistance and income protection benefits, as well as a variety of other programs.\nMSC also offers through MSC University various learning and development opportunities in support of associate career growth and success through a variety of offerings, including virtual classrooms and webinars, instructor-led courses, informal work groups, e-learning, books and articles, and more. These opportunities can drive improvement, facilitate career development, provide coaching and mentoring opportunities, and enhance communication skills. The average training hours completed by MSC associates in fiscal year 2023 increased nearly 18% year over year to over 20 hours per individual. Additionally, MSCs tuition assistance program covers educational costs and provides eligible associates the financial assistance to obtain a graduate or undergraduate degree while working.\nAvailable Information\nThe Companys website is https://www.mscdirect.com. We make available, free of charge, on or through the investor relations portion of our website, https://investor.mscdirect.com, our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to these reports, as well as proxy statements and other information, as soon as reasonably practicable after such documents are electronically filed with, or furnished to, the SEC. We also make available, on our website, the charters of the committees of our Board of Directors, the Code of Ethics, the Code of Business Conduct and the Corporate Governance Guidelines pursuant to SEC requirements and New York Stock Exchange (NYSE) listing standards. The information on our website, or linked to or from our website, is not incorporated by reference into, and does not constitute a part of, this Report or any other documents we file with, or furnish to, the SEC.\nWe use the investor relations portion of our website, https://investor.mscdirect.com, to distribute information, including as a means of disclosing material, non-public information, and for complying with our disclosure obligations under Regulation FD. We routinely post and make accessible financial and other information regarding the Company on our website. Accordingly, investors should monitor the investor relations portion of our website, https://investor.mscdirect.com, in addition to our press releases, SEC filings and other public communications. ITEM 1A. RISK FACTORS.\nIn addition to the other information in this Report, the following factors should be considered in evaluating the Company and its business. Our future operating results depend upon many factors and are subject to various risks and\nuncertainties. The known material risks and uncertainties which may cause our operating results to vary from anticipated results or which may negatively affect our operating results and profitability are as follows:\nRisks Related to Our Business\nOur business depends heavily on the operating levels of our customers and the economic factors that affect them, including general economic conditions.\nMany of the primary markets for the products and services we sell are subject to cyclical fluctuations that affect demand for goods and materials that our customers produce. Consequently, demand for our products and services has been, and will continue to be, influenced by most of the same economic factors that affect demand for and production of our customers products.\nWhen, as occurs in economic downturns, current or prospective customers reduce production levels because of lower demand or tight credit conditions, their need for our products and services diminishes. Selling prices and terms of sale with our customers come under pressure, which may adversely affect the profitability and the durability of customer relationships. Credit losses increase as well. Volatile economic and credit conditions also make it more difficult for distributors, as well as customers and suppliers, to forecast and plan future business activities and may prevent them from ordering our products as frequently or in the quantities they otherwise would. We may experience adverse impacts to our business as a result of any economic recession or slowing in the rate of growth.\nAdditionally, macroeconomic conditions may impact the proper functioning of financial and capital markets, foreign currency exchange rates, commodity and energy prices, labor and supply costs, and interest rates. We have also been affected by macroeconomic conditions specific to the principal end markets that we serve, including as the result of work stoppages and organized labor activity. Any or all of these factors may impact us, our customers, and their demand for our products.\nIn addition, as various sectors of our industrial customer base face increased foreign competition, and in fact lose business to foreign competitors or shift their operations overseas in an effort to reduce expenses, we may face increased difficulty in growing and maintaining our market share and growth prospects.\nChanges in our customer and product mix, or adverse changes to the cost of goods we sell, could cause our gross margin percentage to fluctuate or decrease.\nFrom time to time, we experience changes in our customer mix and in our product mix. Changes in our customer mix have resulted from various factors, such as geographic expansion, daily selling activities within current geographic markets, and targeted selling activities to new customers. Changes in our product mix have also resulted from various factors, such as marketing activities to existing customers, needs communicated to us from existing and prospective customers and business acquisitions. As our national account and government customer program sales grow, we will face continued pressures on maintaining gross margin because these customers receive lower pricing due to their higher level of purchases from us. In addition, our continued expansion of our vending program and other E-commerce platforms places pressure on our gross margin. We may also be subject to price increases from our suppliers and independent freight carriers that we may not be able to pass along to our customers, particularly in periods of high or rapid inflation.\nVolatility in commodity, energy and labor prices may adversely affect operating margins.\nIn times of commodity, energy and labor price increases, we may be subject to price increases from our suppliers and independent freight carriers that we are unable to pass along to our customers. Raw material costs used in our suppliers products (steel, tungsten, etc.) and energy and labor costs may increase, which may result in increased production costs for our suppliers that they pass along to us. The fuel costs of our independent freight carriers have been volatile. Our suppliers and independent freight carriers typically look to pass increased costs along to us through price increases. When we are forced to accept these price increases, we may not be able to pass them along to our customers, resulting in lower margins.\nIn addition to increases in commodity, energy and labor prices, decreases in those costs, particularly if severe, could also adversely impact us by creating deflation in selling prices, which could cause our gross profit margin to deteriorate, or by negatively impacting customers in certain industries, which could cause our sales to those customers to decline.\nInflation impacts the costs at which we can procure products and our ability to increase prices at which we sell to customers over time. Prolonged periods of low inflation or deflation could adversely affect our ability to increase the prices at which we sell to customers. Periods of high or rapid inflation, such as the historically high levels of inflation the United States has experienced recently, may also cause the prices that our suppliers and independent freight carriers charge to increase rapidly or unpredictably. We may not be able to pass along increased costs due to inflation in full or synchronously to customers, which may result in lower margins or changes in our relationships with customers.\nWe operate in a highly competitive industry, which is evolving and consolidating, which could adversely affect our business and financial results.\nThe MRO supply industry, although consolidating, still remains a large, fragmented industry that is highly competitive. We face competition from traditional channels of distribution, such as retail outlets, small dealerships, regional and national distributors utilizing direct sales forces, manufacturers of MRO supplies, large warehouse stores and larger direct mail distributors. We believe that sales of MRO supplies will continue to concentrate over the next several years, which may make MRO supply distribution more competitive. Some of our competitors challenge us with a greater variety of product offerings, greater financial resources, additional services, or a combination of these factors. In addition, we also face the risk of companies which operate primarily outside of our industry entering our marketplace.\nOur industry is evolving at an accelerated pace. If we do not have the agility and flexibility to effectively respond to this accelerated pace of industry changes, our strategy could be put at risk resulting in a loss of market share. We also face substantial competition in the online distribution space that competes with price transparency. Increased competition from online retailers (particularly those major internet providers who can offer a wide range of products and rapid delivery), and the adoption by competitors of aggressive pricing strategies or sales methods, could cause us to lose market share or reduce our prices, adversely affecting our sales, margins and profitability.\nTraditional MRO suppliers are attempting to consolidate the market through internal expansion or acquisitions or mergers with other industrial suppliers, or a combination of both. This consolidation allows suppliers to improve efficiency and spread fixed costs over a greater number of sales, and to achieve other benefits derived from economies of scale. The trend of our industry toward consolidation could cause the industry to become more competitive as greater economies of scale are achieved by competitors, or as competitors with new lower-cost business models are able to operate with lower prices and gross profit on products. These trends may adversely affect our sales, margins and profitability.\nIn order to operate more efficiently, control costs and improve profitability, we incurred approximately $7.9 million in restructuring and other costs in fiscal year 2023, primarily consisting of consulting-related costs and associate severance and separation costs associated with the optimization of the Companys operations and profitability improvement. There can be no assurance that these actions will achieve their intended benefits.\nAs a supplier to the U.S. government and public sector, we are subject to certain laws and regulations which may increase our costs of doing business and which subject us to certain compliance requirements and potential liabilities.\nAs a supplier to the U.S. government and public sector, which currently represents approximately 10% of total Company revenue, we must comply with certain laws and regulations, including the Trade Agreements Act, the Buy American Act and the Federal Acquisition Regulation, relating to the formation, administration and performance of U.S. government contracts. These laws and regulations affect how we do business with government customers and, in some instances, impose added compliance and other costs on our business. From time to time, we are subject to governmental or regulatory inquiries or audits relating to our compliance with these laws and regulations. A violation of these specific laws and regulations, as well as others, could result in the imposition of fines and penalties or the termination of our U.S. government contracts and could harm our reputation and cause our business to suffer.\nOur business is exposed to the credit risk of our customers, which could adversely affect our operating results.\nWe perform periodic credit evaluations of our customers financial condition, and collateral is generally not required. We evaluate the collectability of accounts receivable based on numerous factors, including past transaction history with customers and their creditworthiness, and we provide a reserve for accounts that we believe to be uncollectible. A significant deterioration in the economy or the financial condition of our customers, including as a result of higher inflation and fluctuations in interest rates, geopolitical events or macroeconomic events, could have an adverse effect on our ability to collect our accounts receivable, including longer payment cycles and increased collection costs and defaults.\nFailure to accurately forecast customer demand and timely purchase inventory could lead to excess inventories or inventory shortages, which could result in decreased operating margins, reduced cash flows and harm to our business.\nTo meet anticipated demand for our products, we may purchase products from manufacturers outside of our typical programs, including payment terms, and in advance of customer orders, which we hold in inventory and resell to customers. We are subject to the risk that we may be unable to sell excess products ordered from manufacturers. Inventory levels in excess of customer demand due to the difficulty of calibrating demand for such products, the concentration of demand for a limited number of SKUs, difficulties in product sourcing, including due to supply chain disruptions affecting us and our suppliers, or rapid changes in demand may result in inventory impairment or write-downs, and the sale of excess inventory at discounted prices could have an adverse effect on our operating results, financial condition and cash flows. Conversely, if we underestimate customer demand for our products or if our manufacturers fail to supply products we require at the time we need them, including due to supply chain disruptions affecting us and our suppliers, we may experience inventory shortages. Inventory shortages might delay shipments to customers and negatively impact customer relationships.\nThe risk of cancellation or rescheduling of orders may cause our operating results to fluctuate.\nThe cancellation or rescheduling of orders may cause our operating results to fluctuate. Although we strive to maintain relationships with our customers, there is an ongoing risk that orders may be cancelled or rescheduled due to fluctuations in our customers business needs or purchasing budgets, including changes in national and local government budgets. Additionally, although our customer base is diverse, ranging from individual machine shops to Fortune 1000 companies and large governmental agencies, the cancellation or rescheduling of significant orders by larger customers may still have a material adverse effect on our operating results from time to time.\nWork stoppages, labor shortages or other disruptions, including those due to extreme weather conditions, at transportation centers, shipping ports, our headquarters or our customer fulfillment centers may adversely affect our ability to obtain inventory and make deliveries to our customers.\nOur ability to provide same-day shipping and next-day delivery of our core metalworking and MRO products is an integral component of our overall business strategy. Disruptions at transportation centers or shipping ports, including global and domestic locations, due to third-party work stoppages or labor shortages or severe weather conditions affect both our ability to maintain core products in inventory and to deliver products to our customers on a timely basis, which may in turn adversely affect our customer relationships and results of operations. In addition, severe weather conditions and work stoppages affecting the end markets we serve could adversely affect demand for our products in particularly hard-hit regions and impact our sales and/or our ability to deliver our products.\nOur business depends on our ability to attract, train and retain qualified sales and customer service personnel and metalworking and specialty sales specialists.\nOur business depends on our ability to attract, train and retain qualified sales and customer service personnel and metalworking specialists. We greatly benefit from having associates who are familiar with the products we sell and their applications, as well as associates, and in particular metalworking specialists, who can provide technical support to our customers. Qualified individuals of the requisite caliber and number needed to fill these positions may be difficult to hire and retain in sufficient numbers. Additionally, hiring and retaining such qualified individuals may be adversely impacted by global and domestic economic uncertainty, and increased competition for such qualified individuals. If we are unable to hire and retain associates capable of providing a high level of customer service and technical support, our operational capabilities and ability to provide differentiated services may be adversely affected.\nThe loss of key suppliers or contractors or key brands could adversely affect our operating results.\nWe believe that our ability to offer a combination of well-known brand name products and competitively priced exclusive brand products is an important factor in attracting and retaining customers. Our ability to offer a wide range of products and services is dependent on obtaining adequate product supply and services from our key suppliers and contractors. The loss of, or a substantial decrease in, the availability of products or services from key suppliers or contractors at competitive prices, or the loss of a key brand, could cause our revenues and profitability to decrease.\nSupply chain disruptions could adversely impact our business, operating results and financial position.\nDisruptions in our supply chain due to events outside of our control, including natural and human-induced disasters, earthquakes, storms, hurricanes, floods, fires, droughts, tornados and other extreme weather, widespread contagious diseases or viruses, geopolitical events, such as war, economic sanctions, civil unrest, rioting or terrorist attacks in the United States or countries in which we operate, in which our key suppliers are located or through which products we sell are transported or distributed, transportation disruptions, labor disputes or shortages, raw material shortages, inadequate manufacturing capacity or utilization to meet demand, actions by governments and central banks that impact the flow of international goods, and the imposition of other trade limitations, prohibitions or sanctions that increase the costs of domestic and international trade and transportation, could restrict our ability to obtain products that our customers demand or to meet delivery expectations, which could adversely impact our business, operating results and financial position. Any such disruption or other catastrophic event could cause our distribution channels and networks to become limited or non-operational, adversely impact our ability to obtain or deliver products to our customers in a timely manner, limit our ability to meet customer demand, result in lost sales, increased costs, penalties, order cancellations or contract terminations, or adversely impact our customer relationships. Our ability to fulfill customer orders using same-day shipping and next-day delivery is an integral component of our business strategy upon which our customers rely, and any such disruption could adversely impact our business, operating results and financial position.\nChanges to trade policies or trade relationships could make sourcing products from overseas more difficult and/or costlier as well as negatively affect the markets we sell into.\nChanges to trade policies or trade relationships, including the imposition of significant restrictions, quotas, duties, tariffs or moratoriums on economic activity with certain countries or regions, whether because of amendments to or the elimination of existing trade agreements or the imposition of new or modified trade tariffs or other governmental orders or sanctions, could have an adverse effect on our business. These changes and other changes to trade policies or trade relationships could adversely affect our ability to secure sufficient products to service our customers and/or result in increased product costs that we may not be able to pass on to our customers, resulting in lower margins. Additionally, these changes could adversely affect our foreign sales.\nOpening or expanding our customer fulfillment centers exposes us to risks of delays and may affect our operating results.\nIn the future, as part of our long-term strategic planning, we may open new customer fulfillment centers to improve our efficiency, geographic distribution and market penetration. In addition, we intend to make, as we have in the past, capital improvements and operational enhancements to certain of our existing customer fulfillment centers. Moving or opening customer fulfillment centers and effecting such improvements requires a substantial capital investment, including expenditures for real estate and construction, and opening new customer fulfillment centers requires a substantial investment in inventory. Additionally, the opening of new customer fulfillment centers or the expansion of existing customer fulfillment centers would have an adverse impact on operating expenses as a percentage of sales, inventory turnover and return on investment in the periods prior to and for some time following the commencement of operations of each new customer fulfillment center or the completion of such expansions.\nWe establish insurance-related healthcare reserves based on historical claims experience and actuarial estimates, which could lead to adjustments in the future based on actual claims incurred.\nWe retain a significant portion of the risk under our healthcare insurance program. In fiscal year 2021, we began self-insuring for costs associated with associates health needs, which is limited by stop-loss coverage. Our healthcare insurance program accruals are determined on an actuarial basis, based on historical claims experience and an estimate of claims incurred but not yet reported and other relevant factors. While we believe our estimation process is well designed, every estimation process is inherently subject to limitations. Fluctuations in the frequency, magnitude or number of claims make it difficult to predict the ultimate cost of claims and may lead to future adjustments of reported results of operations which, depending on the magnitude of such adjustments, may significantly affect our reported results or negatively affect the reliability of our reported results.\nAn interruption of operations at our headquarters or customer fulfillment centers could adversely impact our business.\nOur business depends on maintaining operations at our co-located headquarters and customer fulfillment centers. A serious, prolonged interruption due to power outage, telecommunications outage, cyber-attack, terrorist attack,\nearthquake, storm, hurricane, flood, fire, drought, tornado and other extreme weather, widespread contagious disease or virus or other interruption could have a material adverse effect on our business and financial results.\nGoodwill and other indefinite-lived intangible assets recorded as a result of our acquisitions could become impaired.\nAs of September 2, 2023, our combined goodwill and other indefinite-lived intangible assets amounted to $729.3 million. To the extent we do not generate sufficient cash flows to recover the net amount of any investment in goodwill and other indefinite-lived intangible assets recorded, the investment could be considered impaired and subject to write-off. We expect to record further goodwill and other indefinite-lived intangible assets as a result of future acquisitions we may complete. Future amortization of such assets or impairments, if any, of goodwill or other indefinite-lived intangible assets would adversely affect our results of operations in any given period. If the financial performance of our business was to decline significantly, we could incur a material non-cash charge to our income statement for the impairment of goodwill and other indefinite-lived intangible assets.\nClimate change and societal and governmental responses to climate change could adversely affect our business and performance, including indirectly through impacts on our customers.\nConcerns over the long-term impacts of climate change have led, and will continue to lead, to governmental efforts around the world to mitigate those impacts. Consumers and businesses also may change their behavior on their own as a result of concerns regarding the impact of climate change, governmental regulations and public perceptions. We and our customers will need to respond to new laws and regulations as well as consumer and business preferences resulting from climate change concerns. The impact on our customers will likely vary depending on their specific attributes, including reliance on or role in carbon intensive activities. Among the impacts to us could be a drop in demand for our products and services, particularly in certain sectors. Our efforts to take these risks into account, including by increasing our business with climate-friendly companies, may not be effective in protecting us from the negative impact of new laws and regulations or changes in consumer or business behavior.\nFurthermore, climate change may present additional physical risks to our operations and lead to an increased frequency of unusual or extreme weather conditions, which could disrupt our supply chain or harm or disrupt our operations or those of our customers or suppliers.\nRisks Related to Our Indebtedness\nThe terms of our credit facilities and senior notes impose operating and financial restrictions on us, which may limit our ability to respond to changing business and economic conditions.\nWe currently have credit facilities and outstanding senior notes. For a description of these facilities and senior notes, please see Note 10, Debt in the Notes to Consolidated Financial Statements. We are subject to various operating and financial covenants under the credit facilities and senior notes which restrict our ability to, among other things, incur additional indebtedness, make particular types of investments, incur certain types of liens, engage in fundamental corporate changes, enter into transactions with affiliates or make substantial asset sales. Any failure to comply with these covenants may constitute a breach under the credit facilities and senior notes, which could result in the acceleration of all or a substantial portion of any outstanding indebtedness and the termination of revolving credit commitments. Additionally, as interest rates rise, there may be fewer alternatives to our existing credit facilities for raising additional capital or such alternatives may be more expensive.\nOur inability to maintain our committed and uncommitted credit facilities could materially adversely affect our liquidity and our business.\nOur ability to manage our business and execute our business strategy is dependent, in part, on the continued availability of financing. With respect to committed facilities, lenders may decline to renew or extend credit facilities, or they may require stricter terms and conditions with respect to future facilities, and we may not find these terms and conditions acceptable. With respect to uncommitted facilities, lenders may cease making loans or demand payment of outstanding loans, which may overly restrict our ability to conduct our business successfully and adversely impact our liquidity and financial position.\nRisks Related to the Reclassification\nThe Reclassification may not achieve the desired benefits for us or our shareholders.\nThe long-term impacts of the Reclassification are still unknown, and the Reclassification may not result in an increase in shareholder value or improve the liquidity and marketability of our equity. If the Reclassification is not viewed favorably by members of the investment community, it may impair the value of our Class A Common Stock and limit its liquidity and marketability. Furthermore, securities markets worldwide have experienced significant price and volume fluctuations in recent years. This market volatility, as well as general economic, market or political conditions, could cause a reduction in the market price and liquidity of shares of our Class A Common Stock.\nOur principal shareholders own a significant amount of our voting stock and have rights to nominate directors to our Board of Directors, and their interests may differ from those of our other shareholders.\nSo long as the Jacobson / Gershwind Family Shareholders (as defined below), collectively, have beneficial or record ownership of at least 10% of the issued and outstanding shares of Class A Common Stock, our Board of Directors will, subject to the procedures and limitations set forth in the Reclassification Agreement (as defined below), nominate two individuals designated by the Jacobson / Gershwind Family Shareholders for election to the Board of Directors at any annual meeting of our shareholders at which directors are to be elected. So long as the Jacobson / Gershwind Family Shareholders, collectively, have beneficial or record ownership of less than 10% but 5% or more of the issued and outstanding shares of Class A Common Stock, our Board of Directors will, subject to the procedures and limitations set forth in the Reclassification Agreement, nominate one individual designated by the Jacobson / Gershwind Family Shareholders for election to the Board of Directors at any annual meeting of our shareholders at which directors are to be elected.\nThe amount of Class A Common Stock currently held by the Jacobson / Gershwind Family Shareholders, together with the foregoing director nomination rights, provide the Jacobson / Gershwind Family Shareholders with significant continued influence over our decisions. The interests of the Jacobson / Gershwind Family Shareholders with respect to matters potentially or actually involving or affecting us and our other shareholders, such as future acquisitions, financings and other corporate opportunities and attempts to acquire us, may differ from, or conflict with, the interests of our other shareholders.\nRisks Related to Information Technology\nMaintaining our IT systems and complying with data privacy laws may incur significant, recurring costs.\nWe believe that our IT systems are an integral part of our business and growth strategies. In particular, the COVID-19 pandemic caused us to modify our business practices, including requiring many of our office-based associates to work from home. As a result, we are dependent upon our IT systems to operate our business and our ability to effectively manage our business depends on the security, reliability and adequacy of our IT systems. We also depend upon our IT systems to help process orders, to manage inventory and accounts receivable collections, to manage financial reporting, to purchase, sell and ship products efficiently and on a timely basis, to maintain cost-effective operations, to operate our websites and to help provide superior service to our customers. We have made and continue to make investments in technology to protect our systems, computers, software, data and networks from attacks, damage or unauthorized access. We also have implemented numerous security protocols in order to strengthen security, and we maintain a customary cyber insurance policy, but there can be no assurance that breaches will not occur in the future or be covered by our insurance policy. The costs of maintaining adequate cybersecurity safeguards for our IT systems may be significant and recurring as technology progresses.\nIn addition to incurring continual costs to maintain cybersecurity, we also incur significant, recurring costs to comply with data privacy laws. Regulatory authorities have increased their focus on how companies collect, process, use, store, share and transmit personal data. New privacy security laws and regulations, including the United Kingdoms Data Protection Act 2018 (DPA), the European Union General Data Protection Regulation 2016 (GDPR) that became effective May 2018, the California Consumer Protection Act that became effective on January 1, 2020, and other similar state privacy laws, pose increasingly complex compliance challenges, which may increase compliance costs, and any failure to comply with data privacy laws and regulations could result in significant penalties.\nDisruptions or breaches of our IT systems, or violations of data privacy laws, could adversely affect us.\nOur IT systems may be vulnerable to damage or disruption caused by circumstances beyond our control or anticipation, such as catastrophic events, power outages, natural disasters, computer system or network failures, computer viruses, and physical or electronic break-ins. In addition, our IT systems may be vulnerable to cyber-attacks, including the use of malicious codes, worms, phishing, spyware, denial of service attacks and ransomware, all of which are rapidly evolving and becoming increasingly sophisticated. Despite our efforts to ensure the integrity of our IT systems, as cyber-attacks evolve and become more difficult to detect and successfully defend against, one or more cyber-attacks might defeat the measures that we take to anticipate, detect, avoid or mitigate these threats. These cyber-attacks and any unauthorized access or disclosure of our customers information could compromise and expose sensitive information and damage our reputation. Cyber-attacks could also cause us to incur significant remediation costs, including the possibility of government fines, disrupt our operations and divert management attention and key IT resources.\nAny material cyber-attack or failure of our IT systems to perform as we anticipate could disrupt our business and operations, result in transaction errors, the loss of data, processing inefficiencies, downtime, litigation, government investigation or fines, substantial remediation costs (including potential liability for stolen assets or information and the costs of repairing system damage), and the loss of sales and customers, and damage our reputation. In addition, changes to our IT systems could disrupt our business operations. Any one or more of these consequences could have a material adverse effect on our business, financial condition and results of operations. Additionally, our suppliers and customers also rely upon IT systems to operate their respective businesses. If any of them experience a cyber-attack or other cyber incident, this could adversely impact their operations, which may in turn impact or adversely affect our operations.\nGeneral Risk Factors\nOur success is dependent on certain key management personnel.\nOur success depends largely on the efforts and abilities of certain key members of our senior management. The loss or disruption of the services of one or more of such key personnel could have a material adverse effect on our business and financial results. We do not maintain any key-man insurance policies with respect to any of our executive officers.\nWe are subject to litigation risk due to the nature of our business, which may have a material adverse effect on our business.\nFrom time to time, we are involved in lawsuits or other legal proceedings that arise from business transactions or the operation of our business. Due to the nature of our business, these proceedings may, for example, relate to product liability claims, commercial disputes or employment matters. In addition, we could face claims over other matters, such as claims arising from our status as a government contractor, intellectual property matters, or corporate or securities law matters. The defense and ultimate outcome of lawsuits or other legal proceedings may result in higher operating expenses, which could have a material adverse effect on our business, financial condition or results of operations.\nWe may encounter difficulties with acquisitions and other strategic transactions which could harm our business.\nWe have completed several acquisitions and we expect to continue to pursue acquisitions and other strategic transactions, such as joint ventures, that we believe will either expand or complement our business in new or existing markets or further enhance the value and offerings we are able to provide to our existing or future potential customers.\nAcquisitions and other strategic transactions present numerous risks and challenges, which could harm our business, including:\nthe diversion of managements attention from the normal operation of our business;\nthe potential loss of key associates and customers of the acquired companies;\ndifficulties managing and integrating operations in geographically dispersed locations;\nthe potential for deficiencies in internal controls at the acquired companies;\nincreases in our expenses and working capital requirements, which reduce our return on invested capital;\nthe lack of experience operating in the geographic market or industry sector of the acquired companies; and\nthe exposure to unanticipated liabilities of the acquired companies.\nTo integrate acquired businesses, we must implement our management information systems, operating systems and internal controls, and assimilate and manage the personnel of the acquired operations. The difficulties of this\nintegration may be further complicated by geographic distances. The integration of acquired businesses may not be successful and could result in disruption to other parts of our business.\nWe are subject to environmental, health and safety laws and regulations.\nWe are subject to federal, state, local, foreign and provincial environmental, health and safety laws and regulations. Fines and penalties may be imposed for non-compliance with applicable environmental, health and safety requirements and the failure to have or to comply with the terms and conditions of required permits. The failure by us to comply with applicable environmental, health and safety requirements could result in fines, penalties, enforcement actions, third-party claims for property damage and personal injury, requirements to clean up property or to pay for the costs of cleanup, or regulatory or judicial orders requiring corrective measures, which could have a material adverse effect on our business, financial condition or results of operations. Additionally, such actions could negatively impact our reputation in the impacted geographic market and more broadly.\nSocial and environmental responsibility policies and provisions may be difficult to comply with and may impose costs on us.\nThere is an increasing focus on corporate social and environmental responsibility in our industry. An increasing number of our customers have adopted, or may adopt, procurement policies that include social and environmental responsibility provisions that their suppliers should comply with, or they may seek to include such provisions in their procurement terms and conditions. This corporate social and environmental responsibility influence is expanding to other stakeholders such as investors, suppliers, associates and communities. We currently voluntarily comply with the sustainability standards set forth by various sustainability initiatives and organizations. These social and environmental responsibility practices, policies, provisions and initiatives are subject to change, can be unpredictable, and may be difficult and expensive for us to comply with. In addition, the failure by us to take action or otherwise comply with the policies of our customers may negatively impact our customer relationships or reputation, which may adversely impact our business and results of operations.\nOur Third Amended and Restated By-Laws contain choice-of-forum provisions for certain claims against us, which could increase the costs of bringing a claim or limit the ability of a shareholder to bring a claim in a judicial forum viewed by a shareholder as favorable.\nOur Third Amended and Restated By-Laws provide that, unless we consent in writing to the selection of an alternative forum, the New York Supreme Court in the State of New York (or, if such court does not have subject matter jurisdiction thereof, the United States District Court for the Southern District of New York or, if such court also does not have subject matter jurisdiction thereof, such other federal district court or state courts located within the State of New York) will, to the fullest extent permitted by law, be the sole and exclusive forum for certain claims. The foregoing provisions will not apply to claims or causes of action brought to enforce a duty or liability created by the Securities Act of 1933, as amended (the Securities Act), or the Securities Exchange Act of 1934, as amended (the Exchange Act), or any other claim under federal securities laws (other than derivative actions brought to enforce any duty or liability created by the Exchange Act) for which the federal courts have exclusive federal or concurrent state and federal jurisdiction. In addition, the Third Amended and Restated By-Laws provide that, unless we consent in writing to the selection of an alternative forum, the federal district courts of the United States will, to the fullest extent permitted by law, be the sole and exclusive forum for the resolution of any complaint asserting a cause of action arising under the Securities Act.\nThese choice-of-forum provisions may increase costs for a shareholder pursuing any such claim or limit a shareholders ability to bring a claim in a judicial forum that such shareholder finds favorable for disputes with us or any of our directors, officers or other employees, which may discourage such lawsuits even though an action, if successful, might benefit our shareholders. In addition, the courts designated under these choice-of-forum provisions may reach different judgments or results than would other courts, including courts where a shareholder would otherwise choose to bring the action, and such judgments or results may be more favorable to us than to our shareholders. If a court were to find these choice-of-forum provisions inapplicable or unenforceable in an action, we may incur additional costs associated with resolving such action in other jurisdictions, which could adversely affect our business, liquidity, financial condition and/or results of operations.\nOur common stock price may be volatile.\nWe believe factors such as fluctuations in our operating results or the operating results of our competitors, changes in economic conditions in the market sectors in which our customers operate, notably the durable and non-durable goods manufacturing industry, which accounts for a substantial portion of our revenues, and changes in general market conditions, including as a result of inflation, rising interest rates and geopolitical events, could cause the market price of our Class A Common Stock to fluctuate substantially. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone. ITEM 2. PROPERTIES.\nWe have customer fulfillment centers in or near the following locations:\nLocation Approx.\nSq. Ft. Operational\nDate Leased/\nOwned\nHarrisburg, Pennsylvania 821,000 1997 Owned\nAtlanta, Georgia 721,000 1990 Owned\nElkhart, Indiana 545,000 1996 Owned\nColumbus, Ohio 468,000 2014 Owned\nReno, Nevada 419,000 1999 Owned\nHanover Park, Illinois 288,000 2003 Leased\nWe maintain 38 warehouses, of which 36 are located in North America and two are located in Europe. This count includes locations which were previously referred to as either branches or customer fulfillment centers. Of these locations, two are new to MSC as a result of the acquisition of Buckeye and Tru-Edge during fiscal year 2023. Our warehouses range in size from approximately 1,000 to 110,000 square feet. We also maintain four manufacturing locations, two of which were acquired as part of the Buckeye and Tru-Edge acquisition during fiscal year 2023. These manufacturing locations range in size from approximately 2,000 to 23,000 square feet. We also maintain 10 regional inventory centers, all of which are located in the United States, which vary in size from approximately 7,000 to 58,000 square feet. Most of these warehouses, regional inventory centers and manufacturing locations are leased. These leases are for varying periods, with the longest extending to fiscal year 2031. The aggregate annual lease payments on the leased customer fulfillment centers, warehouses, regional inventory centers and manufacturing locations in fiscal year 2023 were approximately $12.3 million. ITEM 3. LEGAL PROCEEDINGS.\nFor information related to legal proceedings, see the discussion under the caption Legal Proceedings in Note 16, Commitments and Contingencies in the Notes to Consolidated Financial Statements. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II. ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMSCs Class A Common Stock is traded on the NYSE under the symbol MSM.\nIn 2003, our Board of Directors instituted a policy of paying regular quarterly cash dividends to our shareholders. The Company paid aggregate annual regular cash dividends of $3.16 per share in fiscal year 2023 and $3.00 per share in fiscal year 2022. The Company expects its practice of paying quarterly cash dividends on its common stock will continue, although the payment of future dividends is at the discretion of the Companys Board of Directors and will depend upon the Companys earnings, capital requirements, financial condition and other factors.\nOn October 11, 2023, the Companys Board of Directors declared a regular cash dividend of $0.83 per share, payable on November 28, 2023 to shareholders of record at the close of business on November 14, 2023. The dividend is expected to result in aggregate payments of $47.5 million, based on the number of shares outstanding at October 6, 2023.\nThe approximate number of holders of record of MSCs Class A Common Stock as of October 6, 2023 was 546.\nPurchases of Equity Securities\nThe following table sets forth repurchases by the Company of its outstanding shares of Class A Common Stock, which are listed on the NYSE, during the quarter ended September 2, 2023:\nPeriod Total Number of Shares Purchased (1)\nAverage Price Paid Per Share (2)\nTotal Number of Shares Purchased as Part of Publicly Announced\nPlans or Programs Maximum Number of Shares that May Yet Be Purchased Under the\nPlans or Programs (3)\n6/4/2023-7/4/2023 2,214 $ 95.51 - 4,369,279\n7/5/2023-8/3/2023 129,596 $ 96.00 129,500 4,239,779\n8/4/2023-9/2/2023 516,236 $ 100.81 515,756 3,724,023\nTotal 648,046 645,256\n____________________\n(1)During the quarter ended September 2, 2023, 2,790 shares of our Class A Common Stock were withheld by the Company as payment to satisfy our associates tax withholding liability associated with our share-based compensation program and are included in the total number of shares purchased.\n(2)Activity is reported on a trade date basis.\n(3)On June 29, 2021, the Companys Board of Directors terminated the MSC Stock Repurchase Plan, which was established during fiscal year 1999, and authorized a new share repurchase program (the Share Repurchase Program) to purchase up to 5,000,000 shares of the Companys Class A Common Stock. There is no expiration date for the Share Repurchase Program. As of September 2, 2023, the maximum number of shares of the Companys Class A Common Stock that may yet be repurchased under the Share Repurchase Program was 3,724,023 shares.\nPerformance Graph\nThe following stock price performance graph and accompanying information is not deemed to be soliciting material or to be filed with the SEC, nor shall such information be incorporated by reference into any filings under the Securities Act or the Exchange Act or be subject to the liabilities of Section 18 of the Exchange Act, regardless of any general incorporation language in any such filing.\nThe following graph compares the cumulative total return on an investment in our Class A Common Stock with the cumulative total return on an investment in each of the S&P Midcap 400 Index and the Dow Jones US Industrial Supplier Index.\nThe graph assumes that $100 was invested at the closing price of our Class A Common Stock on the NYSE and each index on September 1, 2018 and assumes that all dividends paid on such securities during the applicable fiscal years\nwere reinvested. Indices are calculated on a month-end basis. The comparisons in this table are based on historical data and are not intended to forecast or to be indicative of the possible future performance of our Class A Common Stock.\nCumulative Total Shareholder Return\nfor the Period from September 1, 2018 through September 2, 2023\n*$100 invested on 9/1/2018 in stock or index, including reinvestment of dividends\n9/1/2018 8/31/2019 8/29/2020 8/28/2021 9/3/2022 9/2/2023\nMSC Industrial Direct Co., Inc. 100.00 81.78 90.16 124.63 119.03 159.78\nS&P Midcap 400 Index 100.00 93.57 98.52 141.86 124.58 141.38\nDow Jones US Industrial Supplier Index 100.00 86.23 120.05 147.62 145.84 185.72 ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nOverview\nMSC is a leading North American distributor of a broad range of metalworking and MRO products and services. We help our customers drive greater productivity, profitability and growth with approximately 2.4 million products, inventory management and other supply chain solutions, and deep expertise from more than 80 years of working with customers across industries. We continue to implement our strategies to gain market share, generate new customers, increase sales to existing customers, and diversify our customer base.\nOur experienced team of more than 7,000 associates works with our customers to help drive results for their businesses, from keeping operations running efficiently today to continuously rethinking, retooling and optimizing for a more productive tomorrow. We offer approximately 2.4 million active, saleable SKUs through our catalogs; our brochures; our E-commerce channels, including the MSC website; our inventory management solutions; and our customer care centers, customer fulfillment centers, regional inventory centers and warehouses. We service our customers from six customer fulfillment centers, 10 regional inventory centers, 38 warehouses and four manufacturing locations. Many of our products are carried in stock, and orders for these in-stock products are typically fulfilled the day on which the order is received.\nOur business model focuses on providing overall procurement cost reduction and just-in-time delivery to meet our customers needs. We focus on offering inventory, process and procurement solutions that reduce MRO supply chain costs and improve plant floor productivity for our customers. We will seek to continue to achieve cost reductions throughout our business through cost-savings strategies and increased leverage from our existing infrastructure, and continue to provide additional procurement cost-savings solutions to our customers through technology such as our VMI, CMI and vending programs. Our field sales and service associate headcount was 2,572 at September 2, 2023 compared to 2,536 at September 3, 2022 and 2,398 at August 28, 2021.\nThe chart below displays a two-year comparison of our net sales from fiscal year 2022 through fiscal year 2023:\n(1)Pricing and other is comprised of changes in customer and product mix, discounting and other items.\n(2)Fiscal years 2023 and 2022 had 252 and 258 sales days, respectively.\nHighlights\nHighlights during fiscal year 2023 include the following:\nWe generated $699.6 million of cash from operations compared to $246.2 million in fiscal year 2022. The increase was primarily from the $300.0 million Receivables Purchase Agreement (the RPA) entered into during fiscal year 2023.\nWe had net payments of $340.0 million on our credit facilities, private placement debt and shelf facility agreements compared to net borrowings of $9.5 million in fiscal year 2022. Proceeds from the RPA were primarily utilized to pay down debt on our credit facilities.\nWe repurchased $95.8 million of MSCs Class A Common Stock, par value $0.001 per share (Class A Common Stock), compared to $27.4 million in fiscal year 2022.\nWe paid out an aggregate $176.7 million in regular cash dividends, compared to an aggregate $167.4 million in regular cash dividends in fiscal year 2022.\nIn January 2023, we acquired Buckeye and Tru-Edge for aggregate consideration of $22.4 million, which includes cash paid of $20.5 million and the fair value of contingent consideration to be paid out of $2.3 million, net of a post-closing working capital adjustment in the amount of $0.4 million received from the sellers.\nWe incurred $7.9 million in restructuring and other costs compared to $15.8 million in fiscal year 2022. Restructuring and other costs primarily consist of consulting-related costs and associate severance and separation costs associated with the optimization of the Companys operations and profitability improvement.\nRecent Developments\nProgress on Mission Critical\nAs previously disclosed, we initiated a Company-wide project, which we refer to as Mission Critical, to accelerate market share capture and improve profitability over the period through fiscal year 2023. To realize growth, one of our Mission Critical initiatives, we began and expect to continue investing in our market-leading metalworking business by adding to our metalworking specialist team, introducing value-added services to our customers, expanding our vending, VMI and in-plant solutions programs, building out our sales force, and diversifying our customers and end-markets. We also are focused on improving profitability through the implementation of various pricing strategies and critical structural cost reductions in order to improve return on invested capital. We anticipate that the cost reductions will be comprised of savings in the areas of sales and service, supply chain and general and administrative expenses, and include initiatives to optimize our distribution center network and real estate footprint, renegotiate supplier contracts, and redesign our talent acquisition and retention approach. While Mission Critical was tied to three-year financial targets ending in fiscal year 2023, the key focus areas of Mission Critical, including profitable growth, an improved operating model, and technological improvement, remain critical and ever-evolving initiatives at the Company. Maintaining a continuous improvement mindset remains a key tenet of our strategy going forward.\nImpact of Economic Trends\nThe United States economy has experienced and continues to experience disruptions in the supply of certain products and services and tight conditions in the labor market. These disruptions and conditions have contributed to an inflationary environment which, while falling, remains elevated and has affected the price and, at times, the availability of certain products and services necessary for the Companys operations, including fuel, labor and certain products the Company sells or the inputs for such products. Such disruptions and conditions have impacted, and may continue to impact in the future, the Companys business, financial condition and results of operations.\nAs a result of recent high inflation and periodic supply chain disruptions, the Company continues to implement price realization strategies in response to increased costs the Company faces and has invested in improved warehouse automation to mitigate the effects of labor inflation. The category line review process initiated in the second quarter of fiscal year 2023 continues to progress and shows early signs of improvements in supply chain efficiency, customer experience and supplier engagement. Furthermore, in light of disruptions to availability and increased or uncertain shipping times, the Company is maintaining higher purchasing levels than it did prior to its fiscal year 2020 in order to ensure sufficient inventory supply to meet customer demand.\nReclassification\nOn January 31, 2023, the Board of Directors of the Company (the Board) received a proposal (the Proposal) from the Companys controlling shareholders, the Jacobson / Gershwind family, to exchange each of their shares of Class B Common Stock, par value $0.001 per share (Class B Common Stock and, together with Class A Common Stock, Common Stock), for shares of Class A Common Stock, reclassify the Class B Common Stock and the Class A Common Stock into a single class of common stock and eliminate the current dual-class share structure (the Reclassification). The Board formed a Special Committee composed entirely of independent and disinterested directors to evaluate the Proposal, which was advised by independent financial and legal advisors.\nOn June 21, 2023, the Company announced that it had reached an agreement with the Jacobson / Gershwind family with respect to the Reclassification, in support of which, the Company entered into a Reclassification Agreement, dated as of June 20, 2023 (the Reclassification Agreement), with Mitchell Jacobson, Erik Gershwind, other members of the Jacobson / Gershwind family and certain entities affiliated with the Jacobson / Gershwind family (collectively, the Jacobson / Gershwind Family Shareholders).\nIn October 2023, we completed the Reclassification as contemplated by the Reclassification Agreement. Pursuant to the Reclassification, each share of Class B Common Stock issued and outstanding immediately prior to the time that the Companys Amended and Restated Certificate of Incorporation was duly filed with the Secretary of State of the State of New York was reclassified, exchanged and converted into 1.225 shares of Class A Common Stock. The issuance of Class A Common Stock in connection with the Reclassification was registered under the Securities Act pursuant to the Registration Statement on Form S-4.\nAs contemplated by the Reclassification Agreement, a number of corporate governance changes were implemented, including the following:\nthe Jacobson / Gershwind Family Shareholders have the right to designate two individuals for nomination for election to the Board so long as the Jacobson / Gershwind Family Shareholders own 10% or more of the issued and outstanding shares of Class A Common Stock and to designate one individual for nomination for election to the Board so long as the Jacobson / Gershwind Family Shareholders own less than 10% but more than 5% of the issued and outstanding shares of Class A Common Stock;\nthe Jacobson / Gershwind Family Shareholders have each granted an irrevocable proxy authorizing the Company to vote such pro rata portion of shares of Class A Common Stock beneficially owned by the Jacobson / Gershwind Family Shareholders or their permitted transferees in excess of 15% of the issued and outstanding shares of Class A Common Stock in proportion to the votes of other holders (i.e., excluding any Jacobson / Gershwind Family Shareholders and their permitted transferees) entitled to vote and that do in fact vote;\ncertain standstill and lock-up provisions for the Jacobson / Gershwind Family Shareholders;\nthe transition of the approval standard for certain significant transactions (including mergers, asset sales, share exchanges and dissolution) from a two-thirds supermajority to a majority of the issued and outstanding shares of Class A Common Stock entitled to vote thereon; and\nthe transition to a majority of the votes cast standard for any election of directors that is not a contested election.\nAcquisition of Buckeye and Tru-Edge\nIn January 2023, the Company acquired certain assets and assumed certain liabilities of Buckeye, an Ohio-based metalworking distributor, and Tru-Edge, an Ohio-based custom tool manufacturer. Buckeye primarily serves the metalworking needs of large manufacturers. MSC Industrial plans to build on Buckeyes technical, high-touch relationships and value-added services by offering customers access to its extensive product portfolio to support customers full metalworking and MRO needs. Tru-Edge brings new capabilities to MSC Industrial, including the design and manufacture of parts from scratch with a strong focus in the automotive and medical markets. The Company expects to drive revenue growth in its existing Midwest manufacturing customer base by leveraging the services provided by Tru-Edge. The Company believes the technical expertise and value-added services provided by Tru-Edge will support its effort to drive cost savings for its customers.\nOur Strategy\nOur primary objective is to grow sales profitably while offering our customers highly technical and high-touch solutions to solve their most complex challenges on the plant floor. Our strategy is to complete the transition from being a spot-buy supplier to a mission-critical partner to our customers. We will selectively pursue strategic acquisitions that expand or complement our business in new and existing markets or further enhance the value and offerings we provide.\nBusiness Environment\nWe utilize various indices when evaluating the level of our business activity, including the Industrial Production (IP) Index. Approximately 66% and 68% of our revenues came from sales in the manufacturing sector during the quarter and year ended September 2, 2023, respectively. Through statistical analysis, we have found that trends in our customers activity have correlated to changes in the IP Index. The IP Index measures short-term changes in industrial production. Growth in the IP Index from month to month indicates growth in the manufacturing, mining and utilities industries. The IP Index over the three months ended September 2, 2023 and the average for the three- and 12-month periods ended September 2, 2023 were as follows:\nPeriod IP Index\nJune 102.3\nJuly 103.3\nAugust 103.3\nFiscal Year 2023 Q4 Average 103.0\n12-month average 102.8\nThe average IP Index for the 12 months ended September 2, 2023 of 102.8 increased from the adjusted average from the prior fiscal year of 101.8, which indicated growth in manufacturing during fiscal year 2023. Favorable conditions exist in certain end markets and volume remains stable. Despite improvements in certain areas, economic uncertainty remains driven by higher interest rates and continued elevated levels of inflation. Recently, the United States economy has experienced supply chain disruptions and significant levels of inflation. The Company has implemented price realization strategies in response to increased costs the Company faces. As we see the IP Index continue to fluctuate, we will monitor the current economic conditions for the impact on our customers and markets and assess both risks and opportunities that may affect our business and operations. See Impact of Economic Trends above.\nResults of Operations\nFiscal Year Ended September 2, 2023 Compared to the Fiscal Year Ended September 3, 2022\nThe table below summarizes the Companys results of operations both in dollars (in thousands) and as a percentage of net sales for the periods indicated:\nFiscal Years Ended\nSeptember 2, 2023\n(52 weeks) September 3, 2022\n(53 weeks) Change\n$ % $ % $ %\nNet sales $ 4,009,282 100.0 % $ 3,691,893 100.0 % $ 317,389 8.6 %\nCost of goods sold 2,366,317 59.0 % 2,133,645 57.8 % 232,672 10.9 %\nGross profit 1,642,965 41.0 % 1,558,248 42.2 % 84,717 5.4 %\nOperating expenses 1,151,295 28.7 % 1,083,862 29.4 % 67,433 6.2 %\nRestructuring and other costs 7,937 0.2 % 15,805 0.4 % (7,868) (49.8) %\nGain on sale of property - - % (10,132) (0.3) % 10,132 N/A(1)\nIncome from operations 483,733 12.1 % 468,713 12.7 % 15,020 3.2 %\nTotal other expense (27,577) (0.7) % (17,581) (0.5) % (9,996) 56.9 %\nIncome before provision for income taxes 456,156 11.4 % 451,132 12.2 % 5,024 1.1 %\nProvision for income taxes 113,049 2.8 % 110,650 3.0 % 2,399 2.2 %\nNet income 343,107 8.6 % 340,482 9.2 % 2,625 0.8 %\nLess: Net (loss) income attributable to noncontrolling interest (126) 0.0 % 696 0.0 % (822) (118.1) %\nNet income attributable to MSC Industrial $ 343,233 8.6 % $ 339,786 9.2 % $ 3,447 1.0 %\n(1)N/A is Not Applicable.\nNet Sales\nNet sales increased 8.6%, or $317.4 million, from the prior fiscal year. The $317.4 million increase in net sales was comprised of $160.5 million from improved pricing, inclusive of changes in customer and product mix, discounting and other items, $136.0 million of higher sales volume and $113.5 million of net sales from recent acquisitions, partially offset by $92.6 million in sales attributable to six fewer selling days during fiscal year 2023. Of the $317.4 million increase in net sales during the fiscal year ended September 2, 2023, national account customer sales increased by $123.0 million, sales to our public sector customers increased by $122.1 million and sales to our core and other customers increased by $72.3 million.\nThe table below shows, among other things, the annual 2023 average daily sales (ADS) by total company and by customer type compared to the same periods in the prior fiscal year:\nADS Percentage Change\n(Unaudited)\n2023 Fiscal Period Thirteen-Week Period Ended Fiscal Q1 Thirteen-Week Period Ended Fiscal Q2 Thirteen-Week Period Ended Fiscal Q3 Thirteen-Week Period Ended Fiscal Q4 Fiscal Year Ended\nNet Sales (in thousands) $ 957,745 $ 961,632 $ 1,054,464 $ 1,035,441 $ 4,009,282\nSales Days 62 63 64 63 252\nADS (1) (in millions)\n$ 15.4 $ 15.3 $ 16.5 $ 16.4 $ 15.9\nTotal Company ADS Percent Change (2)\n12.9 % 11.5 % 11.7 % 9.3 % 11.2 %\nManufacturing Customers ADS Percent Change (2)\n7.5 %\nManufacturing Customers Percent of Total Net Sales 68 %\nNon-Manufacturing Customers ADS Percent Change (2)\n19.7 %\nNon-Manufacturing Customers Percent of Total Net Sales\n32 %\n(1)ADS is calculated using the number of business days in the United States for the periods indicated. The Company believes ADS is a key performance indicator because it shows the effectiveness of the Companys selling performance on a consistent basis between periods.\n(2)Percent reflects the change from the 2022 fiscal period to the 2023 fiscal period.\nWe believe that our ability to transact business with our customers through various electronic portals and directly through the MSC website gives us a competitive advantage over smaller suppliers. Sales made through our E-commerce platforms, including sales made through EDI systems, VMI systems, Extensible Markup Language ordering-based systems, vending, hosted systems and other electronic portals, represented 61.1% of consolidated net sales for fiscal year 2023, compared to 61.7% of consolidated net sales for fiscal year 2022. The decline was primarily attributable to large sales to a public sector customer that did not transact through our E-commerce platforms.\nGross Profit\nGross profit increased 5.4% to $1,643.0 million in fiscal year 2023, as compared to $1,558.2 million in fiscal year 2022. Gross profit margin was 41.0% in fiscal year 2023, as compared to 42.2% in fiscal year 2022. The increase in gross profit was primarily a result of a higher sales level as described above and gross profits from our recent acquisitions. The decrease in gross profit margin was primarily attributable to large sales to a public sector customer during the third and fourth quarters of fiscal year 2023 which were transacted below our typical public sector customer margins, as well as unfavorable customer mix as sales to our national account and public sector customers are growing at higher rates and are typically at lower gross margins than the business as a whole.\nOperating Expenses\nOperating expenses increased 6.2% to $1,151.3 million in fiscal year 2023, as compared to $1,083.9 million in fiscal year 2022. Operating expenses were 28.7% of fiscal year 2023 net sales, as compared to 29.4% for fiscal year 2022. The increase in operating expenses was primarily attributable to an increase in payroll and payroll-related costs and increased professional fees associated with the Reclassification. The decline in operating expenses as a percentage of net sales was related to our cost savings programs and productivity improvements resulting from our Mission Critical initiatives.\nPayroll and payroll-related costs were approximately 56.1% of total operating expenses for fiscal year 2023, as compared to approximately 57.5% for fiscal year 2022. Payroll and payroll-related costs, which include salary, incentive compensation, sales commission, and fringe benefit costs, increased by $22.9 million for fiscal year 2023. The majority of this increase compared to the prior fiscal year was due to increased salary expenses and fringe benefit costs, including higher insurance-related healthcare reserves due to recent higher healthcare claims, partially offset by a lower incentive compensation accrual.\nFreight expense was $156.8 million for fiscal year 2023, as compared to $155.5 million for fiscal year 2022. The primary drivers of the increase in freight expense were increased sales volume and higher fuel-related charges. Fuel-related surcharges began to taper off during the second half of fiscal year 2023.\nDepreciation and amortization was $74.7 million for fiscal year 2023, as compared to $69.9 million for fiscal year 2022. The primary drivers of the increase in depreciation and amortization were increased capital expenditures related to vending programs and Mission Critical projects.\nProfessional fee expense was $47.9 million for fiscal year 2023, as compared to $30.3 million for fiscal year 2022. The primary driver of the increase in professional fee expense was fees and other expenses associated with the Reclassification, which included legal and advisory fees, printing and mailing expenses for the associated proxy statement / prospectus, Reimbursable Expenses (as defined in the Reclassification Agreement), and filing and other fees paid to the SEC. See Reclassification above for additional information.\nRestructuring and Other Costs\nWe incurred $7.9 million in restructuring and other costs for fiscal year 2023, as compared to $15.8 million for the prior fiscal year. Restructuring and other costs primarily consist of consulting-related costs and associate severance and separation costs associated with the optimization of the Companys operations and profitability improvement. See Note 14, Restructuring and Other Costs in the Notes to Consolidated Financial Statements for additional information.\nGain on Sale of Property\nDuring fiscal year 2021, the Company entered into a Purchase and Sale Agreement to sell its 170,000-square foot Long Island Customer Service Center in Melville, New York. During fiscal year 2022, the Company disposed of the building with a sale price of $25.5 million, which resulted in a gain on sale of property of $10.1 million after the settlement of certain closing costs and fees, which is included in the Consolidated Statement of Income for the fiscal year ended September 3, 2022.\nIncome from Operations\nIncome from operations increased 3.2% to $483.7 million in fiscal year 2023, as compared to $468.7 million in fiscal year 2022. Income from operations as a percentage of net sales decreased to 12.1% in fiscal year 2023, as compared to 12.7% in fiscal year 2022. The decrease in income from operations as a percentage of net sales was primarily attributable to a lower gross profit margin and the impact of six fewer selling days during fiscal year 2023, both as described above, partially offset by an improvement in operating expenses as a percentage of net sales from the prior fiscal year and the prior fiscal year gain on sale of property which did not recur during fiscal year 2023.\nTotal Other Expense\nTotal other expense increased 56.9%, or $10.0 million, to $27.6 million for fiscal year 2023, as compared to $17.6 million for the prior fiscal year. The increase was primarily due to higher interest rates on our credit facilities and fees incurred associated with the RPA, partially offset by the recognition of $6.6 million of Employee Retention Credit funds. See Note 8, Income Taxes in the Notes to Consolidated Financial Statements for further information.\nProvision for Income Taxes\nOur effective tax rate for fiscal year 2023 was 24.8%, as compared to 24.5% for fiscal year 2022. See Note 8, Income Taxes in the Notes to Consolidated Financial Statements for further information.\nNet Income\nThe factors which affected net income for fiscal year 2023, as compared to the prior fiscal year, have been discussed above.\nLiquidity and Capital Resources\nSeptember 2,\n2023 September 3,\n2022 $ Change\n(In thousands)\nTotal debt $ 454,326 $ 794,592 $ (340,266)\nLess: Cash and cash equivalents 50,052 43,537 6,515\nNet debt $ 404,274 $ 751,055 $ (346,781)\nEquity $ 1,492,582 $ 1,362,283 $ 130,299\nAs of September 2, 2023, we had $50.1 million in cash and cash equivalents, substantially all with well-known financial institutions. Historically, our primary financing needs have been to fund our working capital requirements necessitated by our sales growth and the costs of acquisitions, new products, new facilities, facility expansions, investments in vending solutions, technology investments, and productivity investments. Cash generated from operations, together with borrowings under our credit facilities and net proceeds from the private placement notes, have been used to fund these needs, to repurchase shares of Class A Common Stock from time to time, and to pay dividends to our shareholders.\nAs of September 2, 2023, total borrowings outstanding, representing amounts due under our credit facilities and notes, as well as all finance leases and financing arrangements, were $454.3 million, net of unamortized debt issuance costs of $1.0 million, as compared to total borrowings outstanding of $794.6 million, net of unamortized debt issuance costs of $1.4 million, as of September 3, 2022. The decrease in total borrowings outstanding was driven by higher net payments under our credit facilities, private placement notes and shelf facility agreements. Debt payments were primarily funded through the RPA entered into during fiscal year 2023. See Note 10, Debt in the Notes to Consolidated Financial Statements for more information about these balances.\nWe believe, based on our current business plan, that our existing cash, financial resources and cash flow from operations will be sufficient to fund anticipated capital expenditures and operating cash requirements for at least the next 12 months. We will continue to evaluate our financial position in light of future developments, particularly those relating to changes in macroeconomic conditions, including variations in foreign currency exchange rates, commodity and energy prices, labor and supply costs, inflation, and interest rates, and to take appropriate action as it is warranted.\nThe Reclassification required significant cash outlays during fiscal year 2023. We incurred $12.4 million of non-recurring costs and expenses for fiscal year 2023 in connection with the Reclassification. Furthermore, we repurchased and immediately retired 645,256 shares of Class A Common Stock for $64.4 million during the fourth quarter of fiscal year 2023. We expect to continue repurchasing shares throughout fiscal year 2024, while considering market volatility and our liquidity and financial position.\nThe table below summarizes information regarding the Companys cash flows for the periods indicated:\nFiscal Years Ended\nSeptember 2,\n2023 September 3,\n(In thousands)\nNet cash provided by operating activities $ 699,582 $ 246,183\nNet cash used in investing activities (112,675) (94,493)\nNet cash used in financing activities (580,400) (148,140)\nEffect of foreign exchange rate changes on cash and cash equivalents 8 (549)\nNet increase in cash and cash equivalents $ 6,515 $ 3,001\nOperating Activities\nNet cash provided by operating activities for fiscal years 2023 and 2022 was $699.6 million and $246.2 million, respectively. The increase was primarily due to the following:\na decrease in the change in accounts receivable primarily attributable to the RPA entered into during fiscal year 2023, which resulted in a decline in accounts receivable of $300.0 million; and\na smaller increase in the change in inventories as compared to the prior fiscal year.\nThe table below summarizes certain information regarding the Companys operations:\nFiscal Years Ended\nSeptember 2,\n2023 September 3,\n(Dollars in thousands)\nWorking Capital (1)\n$ 668,077 $ 817,679\nCurrent Ratio (2)\n2.0 2.1\nDays Sales Outstanding (3)\n36.5 65.3\nInventory Turnover (4)\n3.2 3.2\n(1)Working Capital is calculated as current assets less current liabilities.\n(2)Current Ratio is calculated by dividing total current assets by total current liabilities.\n(3)Days Sales Outstanding is calculated by dividing accounts receivable by net sales, using trailing two months sales data.\n(4)Inventory Turnover is calculated by dividing total cost of goods sold by inventory, using a 13-month trailing average inventory.\nWorking capital and the current ratio both decreased compared to September 3, 2022. The decreases were primarily due to a decrease in accounts receivable resulting from the RPA entered into during fiscal year 2023. The RPA reduced the accounts receivable balance by $300.0 million.\nThe decrease in days sales outstanding as of September 2, 2023, as compared to September 3, 2022, was primarily due to the RPA entered into during fiscal year 2023.\nInventory turnover as of September 2, 2023 remained consistent with September 3, 2022.\nInvesting Activities\nNet cash used in investing activities for fiscal years 2023 and 2022 was $112.7 million and $94.5 million, respectively. The use of cash for both fiscal years was primarily due to expenditures for property, plant and equipment mainly related to vending programs and Mission Critical projects. The use of cash for fiscal years 2023 and 2022 also included cash outflows due to acquisitions, Buckeye and Tru-Edge in fiscal year 2023 and Engman-Taylor Company, Inc. and Tower Fasteners in fiscal year 2022. In fiscal year 2022, investing outflows were partially offset by the net proceeds received from the sale of the Companys Long Island Customer Service Center.\nFinancing Activities\nNet cash used in financing activities for fiscal years 2023 and 2022 was $580.4 million and $148.1 million, respectively.\nThe components contributing to the use of cash for fiscal year 2023 were primarily the following:\n$176.7 million of regular cash dividends paid during fiscal year 2023 compared to $167.4 million of regular cash dividends paid during fiscal year 2022;\nnet payments under our credit facilities, private placement debt and shelf facility agreements of $340.0 million during fiscal year 2023 compared to net borrowings of $9.5 million during fiscal year 2022;\n$95.8 million in aggregate repurchases of Class A Common Stock during fiscal year 2023 compared to $27.4 million in aggregate repurchases of Class A Common Stock during fiscal year 2022; and\nproceeds from the exercise of Class A Common Stock options of $28.7 million during fiscal year 2023 compared to $34.7 million during fiscal year 2022.\nDebt\nCredit Facilities\nIn April 2017, the Company entered into a $600.0 million revolving credit facility, which was subsequently amended and extended in August 2021. As of September 2, 2023, the Company also had three uncommitted credit facilities, totaling $203.0 million of aggregate maximum uncommitted availability. See Note 10, Debt in the Notes to Consolidated Financial Statements for more information about our credit facilities. As of September 2, 2023, we were in compliance with the operating and financial covenants of our credit facilities.\nSubsequent to fiscal year 2023, the Company made additional payments of $15.0 million through October 6, 2023 on its revolving credit facility. The current unused balance of $559.7 million from the revolving credit facility, which is reduced by outstanding letters of credit, is available for working capital purposes if necessary. See Note 10, Debt in the Notes to Consolidated Financial Statements for more information about these balances.\nPrivate Placement Debt and Shelf Facility Agreements\nIn July 2016, we completed the issuance and sale of unsecured senior notes. In January 2018, we entered into two note purchase and private shelf facility agreements. In June 2018 and March 2020, we entered into additional note purchase agreements. See Note 10, Debt in the Notes to Consolidated Financial Statements for more information about these transactions. During fiscal year 2023, the Company paid $50.0 million to satisfy its obligation on the 3.04% Senior Notes, due January 12, 2023 and $75.0 million to satisfy its obligation on the 2.65% Senior Notes, Series A, due July 28, 2023.\nLeases and Financing Arrangements\nAs of September 2, 2023, certain of our operations were conducted on leased premises. These leases are for varying periods, with the longest extending to fiscal year 2031. In addition, we are obligated under certain equipment and automobile operating and finance leases, which expire on varying dates through fiscal year 2029.\nFrom time to time, we enter into financing arrangements with vendors to purchase certain information technology equipment or software.\nCapital Expenditures\nWe continue to invest in sales productivity initiatives, E-commerce and vending platforms, customer fulfillment centers and distribution network, and other infrastructure and technology.\nFuture Liquidity Outlook\nAs of September 2, 2023, our future contractual obligations were as follows (in thousands):\nContractual Obligations Fiscal Year 2024 Thereafter\nUndiscounted operating lease obligations (1)\n$ 23,422 $ 49,529\nUndiscounted finance lease obligations, net of interest (2)\n275 237\nMaturities of long-term debt obligations, net of interest (3)\n50,000 224,750\nEstimated interest on long-term debt (4)\n9,638 18,659\nTotal contractual obligations $ 83,335 $ 293,175\n(1)Certain of our operations are conducted on leased premises. These leases (most of which require us to provide for the payment of real estate taxes, insurance and other operating costs) are for varying periods, with the longest extending to fiscal year 2031. In addition, we are obligated under certain equipment and automobile operating leases, which expire on varying dates through fiscal year 2029. See Note 11, Leases in the Notes to Consolidated Financial Statements for additional information on our operating lease arrangements.\n(2)As of September 2, 2023, the Company had entered into various finance leases for certain IT equipment, which expire on varying dates through fiscal year 2026. See Note 11, Leases in the Notes to Consolidated Financial Statements for additional information on our finance lease arrangements.\n(3)Excludes debt issuance costs.\n(4)Interest payments for long-term debt are based on principal amounts and coupons or contractual rates at fiscal year-end.\nAs of September 2, 2023, the Company had recorded a non-current liability of $5.3 million for tax uncertainties and interest. This amount is excluded from the table above, as the Company cannot make reliable estimates of these cash flows by period. See Note 8, Income Taxes in the Notes to Consolidated Financial Statements.\nWe have not entered into any off-balance sheet arrangements and there are no commitments or obligations (including, but not limited to, guarantees; retained or contingent interests in assets transferred; contractual arrangements that support the credit, liquidity or market risk for transferred assets; or risk related to derivatives or other financial products related to our equity securities), including contingent obligations, with unconsolidated entities or persons that had during the periods presented herein or are reasonably likely to have a material impact on the Consolidated Financial Statements.\nCritical Accounting Estimates\nWe make estimates, judgments and assumptions in determining the amounts reported in the Consolidated Financial Statements and accompanying Notes. Estimates are based on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. The estimates are used to form the basis for making judgments about the carrying values of assets and liabilities and the amount of revenues and expenses reported that are not readily apparent from other sources. Actual results may differ from these estimates. Our significant accounting policies are described in the Notes to Consolidated Financial Statements. The accounting policies described below are impacted by our critical accounting estimates. More information on the critical accounting estimates can be found in Note 1, Business and Summary of Significant Accounting Policies in the Notes to Consolidated Financial Statements.\nAllowance for Credit Losses\nWe perform periodic credit evaluations of our customers financial condition, and collateral is generally not required. The Company considers several factors to estimate the allowance for credit losses in accounts receivable, including the age of the receivables and the historical ratio of actual write-offs to the age of the receivables, and also reflects the adopted accounting standard related to current expected credit losses. See Note 1, Business and Summary of Significant Accounting Policies in the Notes to Consolidated Financial Statements for more information.\nInventories\nInventory is reflected at the lower of weighted-average cost or net realizable value considering future demand, market conditions and the physical condition of the inventory. We write-down inventories for shrinkage and slow-moving or obsolete inventory. The analysis includes inventory levels, sales information, historical write-down information, and the on-hand quantities relative to the sales history for the product.\nGoodwill and Other Indefinite-Lived Intangible Assets\nThe purchase price of an acquired company is allocated between the intangible assets and the net tangible assets of the acquired business with the residual of the purchase price recorded as goodwill. The determination of the value of the intangible assets acquired involves certain judgments and estimates. These judgments can include, but are not limited to, the cash flows that an asset is expected to generate in the future and the appropriate weighted-average cost of capital. The Company annually reviews goodwill at the reporting unit level and intangible assets that have indefinite lives for impairment in its fiscal fourth quarter and when events or changes in circumstances indicate the carrying values of these assets might exceed their current fair values.\nIncome Taxes\nThe Company recognizes deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns. Under this method, deferred tax assets and liabilities are determined based on the differences between the financial reporting and tax basis of assets and liabilities, using enacted tax rates in effect for the year in which the differences are expected to reverse. The tax balances and income tax expense recognized by the Company are based on managements interpretations of the tax laws of multiple jurisdictions. Income tax expense reflects the Companys best estimates and assumptions regarding, among other items, the level of future taxable income, interpretations of tax laws and uncertain tax positions.\nOther\nOther significant accounting policies, not involving the same level of measurement uncertainties as those discussed above, are nevertheless important to an understanding of the financial statements. Policies such as revenue recognition, depreciation, intangibles, long-lived assets and warranties require judgments on complex matters that are often\nsubject to multiple external sources of authoritative guidance such as the Financial Accounting Standards Board and the SEC. Possible changes in estimates or assumptions associated with these policies are not expected to have a material effect on the financial condition or results of operations of the Company. More information on these additional accounting policies can be found in Note 1, Business and Summary of Significant Accounting Policies in the Notes to Consolidated Financial Statements.\nRecently Adopted Accounting Pronouncements\nRefer to Note 1, Business and Summary of Significant Accounting Policies in the Notes to Consolidated Financial Statements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nInterest Rate Risks\nWe are exposed to interest rate risk on our variable rate debt. During fiscal year 2023, the Company extended its three uncommitted credit facilities. Additionally, the Company amended its committed credit facility during fiscal year 2023. See Note 10, Debt in the Notes to Consolidated Financial Statements for more information about the credit facilities.\nDuring fiscal years 2022 and 2023, we amended our committed and uncommitted credit facilities by replacing the London InterBank Offered Rate (LIBOR) with the Secured Overnight Financing Rate (SOFR) as the primary reference rate. As SOFR is a relatively new reference rate with a limited history, there may or may not be more volatility than other reference rates such as LIBOR, which may result in increased borrowing costs for the Company. We will continue to actively assess the related opportunities and risks involved in this transition.\nBorrowings under our committed and uncommitted credit facilities are subject to fluctuations in the interest rate, which have a corresponding effect on our interest expense. We are also exposed to interest rate risk arising from market rate adjustments as they pertain to the RPA. Future sales of our finance receivables may be affected by changes in market rates. A 100-basis point increase or decrease in interest rates would impact our interest costs and fees incurred associated with the RPA by approximately $5.1 million under our current capital structure. We have monitored and will continue to monitor our exposure to interest rate fluctuations.\nIn addition, our interest income is most sensitive to changes in the general level of interest rates. In this regard, changes in interest rates affect the interest earned on our cash.\nWe do not currently use interest rate derivative instruments to manage exposure to interest rate changes.\nForeign Currency Risks\nApproximately 95% of our sales are denominated in U.S. dollars and are primarily from customers in the United States. As a result, currency fluctuations are currently not material to our operating results. To the extent that we engage in more significant international sales in the future, an increase in the value of the U.S. dollar relative to foreign currencies could make our products less competitive in international markets. We have monitored and will continue to monitor our exposure to currency fluctuations. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPAGE\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM (PCAOB ID:42)\nCONSOLIDATED BALANCE SHEETS AS OF SEPTEMBER 2, 2023 AND SEPTEMBER 3, 2022\nCONSOLIDATED STATEMENTS OF INCOME FOR THE FISCAL YEARS ENDED SEPTEMBER 2, 2023, SEPTEMBER 3, 2022 AND AUGUST 28, 2021\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME FOR THE FISCAL YEARS ENDED SEPTEMBER 2, 2023, SEPTEMBER 3, 2022 AND AUGUST 28, 2021\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY FOR THE FISCAL YEARS ENDED SEPTEMBER 2, 2023, SEPTEMBER 3, 2022 AND AUGUST 28, 2021\nCONSOLIDATED STATEMENTS OF CASH FLOWS FOR THE FISCAL YEARS ENDED SEPTEMBER 2, 2023, SEPTEMBER 3, 2022 AND AUGUST 28, 2021\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of MSC Industrial Direct Co., Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of MSC Industrial Direct Co., Inc. (the Company) as of September 2, 2023 and September 3, 2022, the related consolidated statements of income, comprehensive income, shareholders equity and cash flows for each of the three years in the period ended September 2, 2023, and the related notes and financial statement schedule listed in the Index at Item 15(a) (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 2, 2023 and September 3, 2022 and the results of its operations and its cash flows for each of the three years in the period ended September 2, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of September 2, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated October 25, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nMeasurement of Inventory Valuation Reserves\nDescription of the Matter As of September 2, 2023, the Companys net inventory balance was $726,521 thousand. As more fully described in Note 1 to the consolidated financial statements, the valuation of inventory requires management to make assumptions and judgments about the recoverability of the inventory and its net realizable value. The Company establishes the inventory valuation reserves for shrinkage and slow-moving or obsolete inventory. The analyses of the required inventory valuation reserves include consideration of inventory levels, sales information, historical write-off information, and the on-hand quantities relative to the sales history for the product. The Company also considers factors such as the inventory age, historic and current demand trends, and assumptions regarding future demand.\nAuditing managements analyses to determine its inventory valuation reserves were complex as auditor judgment was necessary in evaluating the amounts that should be reserved based on the assumptions detailed in the preceding paragraph.\nHow We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design, and tested the operating effectiveness of controls over the inventory valuation reserve process, including controls over the inputs and assumptions described above, that are used in managements calculation.\nOur audit procedures to test the adequacy of the inventory valuation reserves included, among others, evaluating the appropriateness of managements inputs to the inventory valuation reserves calculation, including testing the completeness and accuracy of the data used in managements calculation such as historical write-off activity, inventory levels, and sales history for each class of inventory. We compared actual write-off activity in recent years to the inventory valuation reserve estimated by the Company in prior years to evaluate managements ability to accurately estimate the reserve. We also audited managements calculation of the inventory valuation reserves by testing the mathematical accuracy of the Companys reserve calculations. In addition, we performed inquiries of the Companys management and obtained documentation to evaluate the Companys estimate.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2002.\nJericho, New York\nOctober 25, 2023\nMSC INDUSTRIAL DIRECT CO., INC.\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except share data)\nSeptember 2,\n2023 September 3,\nASSETS\nCurrent Assets:\nCash and cash equivalents $ 50,052 $ 43,537\nAccounts receivable, net of allowance for credit losses of $22,747 and $20,771, respectively\n435,421 687,608\nInventories 726,521 715,625\nPrepaid expenses and other current assets 105,519 96,853\nTotal current assets 1,317,513 1,543,623\nProperty, plant and equipment, net 319,660 286,666\nGoodwill 718,174 710,130\nIdentifiable intangibles, net 110,641 114,328\nOperating lease assets 65,909 64,780\nOther assets 12,237 9,887\nTotal assets $ 2,544,134 $ 2,729,414\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent Liabilities:\nCurrent portion of debt including obligations under finance leases $ 229,935 $ 325,680\nCurrent portion of operating lease liabilities 21,168 18,560\nAccounts payable 226,299 217,378\nAccrued expenses and other current liabilities 172,034 164,326\nTotal current liabilities 649,436 725,944\nLong-term debt including obligations under finance leases 224,391 468,912\nNoncurrent operating lease liabilities 45,924 47,616\nDeferred income taxes and tax uncertainties 131,801 124,659\nTotal liabilities 1,051,552 1,367,131\nCommitments and Contingencies\nShareholders Equity:\nMSC Industrial Shareholders Equity:\nPreferred Stock; $0.001 par value; 5,000,000 shares authorized; none issued and outstanding\n- -\nClass A Common Stock (one vote per share); $0.001 par value; 100,000,000 shares authorized; 48,075,100 and 48,447,384 shares issued, respectively\n48 48\nClass B Common Stock (10 votes per share); $0.001 par value; 50,000,000 shares authorized; 8,654,010 and 8,654,010 shares issued and outstanding, respectively\n9 9\nAdditional paid-in capital 849,502 798,408\nRetained earnings 755,007 681,292\nAccumulated other comprehensive loss (17,725) (23,121)\nClass A treasury stock, at cost, 1,230,960 and 1,228,472 shares, respectively\n(107,677) (106,202)\nTotal MSC Industrial shareholders equity 1,479,164 1,350,434\nNoncontrolling interest 13,418 11,849\nTotal shareholders equity 1,492,582 1,362,283\nTotal liabilities and shareholders equity $ 2,544,134 $ 2,729,414\nSee accompanying Notes to Consolidated Financial Statements.\nMSC INDUSTRIAL DIRECT CO., INC.\nCONSOLIDATED STATEMENTS OF INCOME\n(In thousands, except per share data)\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\n2022 August 28,\n(52 weeks) (53 weeks) (52 weeks)\nNet sales $ 4,009,282 $ 3,691,893 $ 3,243,224\nCost of goods sold 2,366,317 2,133,645 1,909,709\nGross profit 1,642,965 1,558,248 1,333,515\nOperating expenses 1,151,295 1,083,862 994,468\nImpairment loss, net - - 5,886\nRestructuring and other costs 7,937 15,805 31,392\nGain on sale of property - (10,132) -\nIncome from operations 483,733 468,713 301,769\nOther income (expense):\nInterest expense (22,543) (17,599) (14,510)\nInterest income 1,034 150 66\nOther (expense) income, net (6,068) (132) 1,054\nTotal other expense (27,577) (17,581) (13,390)\nIncome before provision for income taxes 456,156 451,132 288,379\nProvision for income taxes 113,049 110,650 70,442\nNet income 343,107 340,482 217,937\nLess: Net (loss) income attributable to noncontrolling interest (126) 696 1,030\nNet income attributable to MSC Industrial $ 343,233 $ 339,786 $ 216,907\nPer share data attributable to MSC Industrial:\nNet income per common share:\nBasic $ 6.14 $ 6.09 $ 3.89\nDiluted $ 6.11 $ 6.06 $ 3.87\nWeighted-average shares used in computing net income per common share:\nBasic 55,918 55,777 55,737\nDiluted 56,210 56,045 56,093\nSee accompanying Notes to Consolidated Financial Statements.\nMSC INDUSTRIAL DIRECT CO., INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\n2022 August 28,\n(52 weeks) (53 weeks) (52 weeks)\nNet income, as reported $ 343,107 $ 340,482 $ 217,937\nOther comprehensive income, net of tax:\nForeign currency translation adjustments 7,091 (4,985) 3,852\nComprehensive income (1)\n350,198 335,497 221,789\nComprehensive income attributable to noncontrolling interest:\nNet loss (income) 126 (696) (1,030)\nForeign currency translation adjustments (1,695) (152) (418)\nComprehensive income attributable to MSC Industrial $ 348,629 $ 334,649 $ 220,341\n(1)There were no material taxes associated with other comprehensive income during fiscal years 2023, 2022 and 2021.\nSee accompanying Notes to Consolidated Financial Statements.\nMSC INDUSTRIAL DIRECT CO., INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\n(In thousands, except per share data)\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\n2022 August 28,\n(52 weeks) (53 weeks) (52 weeks)\nClass A Common Stock\nBeginning Balance $ 48 $ 48 $ 47\nExchange of Class B Common Stock for Class A Common Stock - - 1\nAssociate Incentive Plans 1 - -\nRepurchase and retirement of Class A Common Stock (1) - -\nEnding Balance 48 48 48\nClass B Common Stock\nBeginning Balance 9 9 10\nExchange of Class B Common Stock for Class A Common Stock - - (1)\nEnding Balance 9 9 9\nAdditional Paid-in Capital\nBeginning Balance 798,408 740,867 690,739\nAssociate Incentive Plans 51,257 57,591 50,251\nRepurchase and retirement of Class A Common Stock (163) (50) (123)\nEnding Balance 849,502 798,408 740,867\nRetained Earnings\nBeginning Balance 681,292 532,315 749,515\nNet Income 343,233 339,786 216,907\nRepurchase and retirement of Class A Common Stock (90,849) (22,076) (67,343)\nRegular cash dividends declared on Class A Common Stock (149,368) (141,414) (140,296)\nRegular cash dividends declared on Class B Common Stock (27,347) (25,962) (27,003)\nSpecial cash dividends declared on Class A Common Stock - - (163,511)\nSpecial cash dividends declared on Class B Common Stock - - (31,840)\nDividend equivalents declared, net of cancellations (1,954) (1,357) (4,114)\nEnding Balance 755,007 681,292 532,315\nAccumulated Other Comprehensive Loss\nBeginning Balance (23,121) (17,984) (21,418)\nForeign Currency Translation Adjustment 5,396 (5,137) 3,434\nEnding Balance (17,725) (23,121) (17,984)\nTreasury Stock\nBeginning Balance (106,202) (104,384) (103,948)\nAssociate Incentive Plans 3,291 3,415 3,359\nRepurchase of Class A Common Stock (4,766) (5,233) (3,795)\nEnding Balance (107,677) (106,202) (104,384)\nTotal Shareholders Equity Attributable to MSC Industrial 1,479,164 1,350,434 1,150,871\nNoncontrolling Interest\nBeginning Balance 11,849 11,001 5,628\nIssuance of Noncontrolling Interest - - 3,825\nCapital Contributions - - 100\nForeign Currency Translation Adjustment 1,695 152 418\nNet (Loss) Income (126) 696 1,030\nEnding Balance 13,418 11,849 11,001\nTotal Shareholders Equity $ 1,492,582 $ 1,362,283 $ 1,161,872\nDividends declared per Class A Common Share $ 3.16 $ 3.00 $ 6.50\nDividends declared per Class B Common Share $ 3.16 $ 3.00 $ 6.50\nSee accompanying Notes to Consolidated Financial Statements.\nMSC INDUSTRIAL DIRECT CO., INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\n2022 August 28,\n(52 weeks) (53 weeks) (52 weeks)\nCash Flows from Operating Activities:\nNet income $ 343,107 $ 340,482 $ 217,937\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 75,129 70,376 68,846\nNon-cash operating lease cost 20,966 17,190 18,578\nStock-based compensation 18,639 19,264 17,721\nLoss on disposal of property, plant and equipment 557 921 563\nGain on sale of property - (10,132) -\nInventory write-down - - 30,091\nOperating lease and fixed asset impairment due to restructuring - - 16,335\nNon-cash changes in fair value of estimated contingent consideration 104 (879) -\nProvision for credit losses 10,275 9,806 8,181\nDeferred income taxes and tax uncertainties 6,697 10,761 (13,611)\nChanges in operating assets and liabilities, net of amounts associated with business acquired:\nAccounts receivable 247,653 (123,571) (73,041)\nInventories (4,860) (81,494) (107,037)\nPrepaid expenses and other current assets (6,918) (7,429) (10,141)\nOperating lease liabilities (21,173) (17,147) (33,312)\nOther assets (615) (2,258) (1,055)\nAccounts payable and accrued liabilities 10,021 20,293 84,407\nTotal adjustments 356,475 (94,299) 6,525\nNet cash provided by operating activities 699,582 246,183 224,462\nCash Flows from Investing Activities:\nExpenditures for property, plant and equipment (92,493) (61,373) (53,746)\nCash used in business acquisitions, net of cash acquired (20,182) (57,865) (22,000)\nNet proceeds from sale of property - 24,745 -\nNet cash used in investing activities (112,675) (94,493) (75,746)\nCash Flows from Financing Activities:\nRepurchases of Class A Common Stock (95,779) (27,359) (71,261)\nPayments of regular cash dividends (176,715) (167,376) (167,299)\nPayments of special cash dividends - - (195,351)\nProceeds from sale of Class A Common Stock in connection with Associate Stock Purchase Plan 4,415 4,296 4,136\nProceeds from exercise of Class A Common Stock options 28,677 34,659 29,667\nBorrowings under credit facilities 333,000 374,000 583,500\nPayments under credit facilities (548,000) (364,500) (399,200)\nContributions from noncontrolling interest - - 100\nProceeds from other long-term debt - - 4,750\nPayments under Shelf Facility Agreements and Private Placement Debt (125,000) - (20,000)\nPayments on finance lease and financing obligations (2,193) (2,466) (2,584)\nOther, net 1,195 606 (205)\nNet cash used in financing activities (580,400) (148,140) (233,747)\nEffect of foreign exchange rate changes on cash and cash equivalents 8 (549) 356\nNet increase (decrease) in cash and cash equivalents 6,515 3,001 (84,675)\nCash and cash equivalents-beginning of period 43,537 40,536 125,211\nCash and cash equivalents-end of period $ 50,052 $ 43,537 $ 40,536\nSupplemental Disclosure of Cash Flow Information:\nCash paid for income taxes $ 106,962 $ 117,038 $ 73,116\nCash paid for interest $ 22,432 $ 16,903 $ 13,995\nSee accompanying Notes to Consolidated Financial Statements.\nMSC INDUSTRIAL DIRECT CO., INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Dollar amounts and shares in thousands, except per share data)\n1. BUSINESS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBusiness\nMSC Industrial Direct Co., Inc. (together with its wholly owned subsidiaries and entities in which it maintains a controlling financial interest, MSC, MSC Industrial or the Company) is a leading North American distributor of a broad range of metalworking and maintenance, repair and operations (MRO) products and services, with co-located headquarters in Melville, New York and Davidson, North Carolina. The Company has an additional office support center in Southfield, Michigan and serves primarily domestic markets through its distribution network of six customer fulfillment centers, 10 regional inventory centers, 38 warehouses and four manufacturing locations.\nPrinciples of Consolidation\nThe Consolidated Financial Statements include the accounts of MSC Industrial Direct Co., Inc., its wholly owned subsidiaries and entities in which it maintains a controlling financial interest. All significant intercompany balances and transactions have been eliminated in consolidation.\nImpact of Economic Trends\nThe United States economy has experienced and continues to experience disruptions in the supply of certain products and services and tight conditions in the labor market. These disruptions and conditions have contributed to an inflationary environment which, while falling, remains elevated and has affected the price and, at times, the availability of certain products and services necessary for the Companys operations, including fuel, labor and certain products the Company sells or the inputs for such products. Such disruptions and conditions have impacted, and may continue to impact in the future, the Companys business, financial condition and results of operations.\nAs a result of recent high inflation and periodic supply chain disruptions, the Company continues to implement price realization strategies in response to increased costs the Company faces and has invested in improved warehouse automation to mitigate the effects of labor inflation. The category line review process initiated in the second quarter of fiscal year 2023 continues to progress and shows early signs of improvements in supply chain efficiency, customer experience and supplier engagement. Furthermore, in light of disruptions to availability and increased or uncertain shipping times, the Company is maintaining higher purchasing levels than it did prior to its fiscal year 2020 in order to ensure sufficient inventory supply to meet customer demand.\nFiscal Year\nThe Company operates on a 52/53-week fiscal year ending on the Saturday closest to August 31st of each year. References to fiscal year 2023 refer to the period from September 4, 2022 to September 2, 2023, which is a 52-week fiscal year. References to fiscal year 2022 refer to the period from August 29, 2021 to September 3, 2022, which is a 53-week fiscal year.\nUse of Estimates\nThe preparation of financial statements, in conformity with accounting principles generally accepted in the United States of America, requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates and assumptions used in preparing the accompanying Consolidated Financial Statements.\nCash and Cash Equivalents\nThe Company considers all short-term, highly liquid investments with maturities of three months or less at the date of purchase to be cash equivalents. Cash and cash equivalents are carried at cost, which approximates fair value.\nConcentrations of Credit Risk\nThe Companys mix of receivables is diverse, selling its products primarily to end-users. The Companys customer base represents many diverse industries primarily concentrated in the United States. The Company performs periodic credit evaluations of its customers financial condition, and collateral is generally not required. The Company evaluates the collectability of accounts receivable based on numerous factors, including past transaction history with customers and their creditworthiness, and the Company provides a reserve for accounts that it believes to be uncollectible.\nThe Companys cash includes deposits with commercial banks. The terms of these deposits and investments provide that all monies are available to the Company upon demand. The Company maintains the majority of its cash with high-quality financial institutions. Deposits held with banks may exceed insurance limits. While MSC monitors the creditworthiness of these commercial banks and financial institutions, a crisis in the U.S. financial systems could limit access to funds and/or result in a loss of principal.\nAllowance for Credit Losses\nThe Company establishes reserves for customer accounts that are deemed uncollectible. The allowance for credit losses is based on several factors, including the age of the receivables and the historical ratio of actual write-offs to the age of the receivables. These analyses also take into consideration economic conditions that may have an impact on a specific industry, a group of customers or a specific customer. While the Company has a broad customer base, representing many diverse industries primarily in all regions of the United States, a general economic downturn could result in higher than expected defaults and, therefore, the need to revise estimates for bad debts.\nInventories\nInventories consist of merchandise held for resale and are stated at the lower of weighted-average cost or net realizable value. The Company evaluates the recoverability of its slow-moving or obsolete inventories quarterly. The Company estimates the recoverable cost of such inventory by product type and considering such factors as its age, historic and current demand trends, the physical condition of the inventory, historical write-down information as well as assumptions regarding future demand. The Companys ability to recover its cost for slow-moving or obsolete inventory can be affected by such factors as general market conditions, future customer demand, and relationships with suppliers. Substantially all of the Companys inventories have demonstrated long shelf lives and are not highly susceptible to obsolescence. In addition, many of the Companys inventory items are eligible for return under various supplier agreements.\nProperty, Plant and Equipment\nProperty, plant and equipment and capitalized computer software are stated at cost less accumulated depreciation and amortization. Expenditures for maintenance and repairs are charged to expense as incurred; costs of major renewals and improvements are capitalized. At the time property and equipment are retired or otherwise disposed of, the cost and accumulated depreciation are eliminated from the asset and accumulated depreciation accounts and the profit or loss on such disposition is reflected in income.\nDepreciation and amortization of property, plant and equipment are computed for financial reporting purposes on the straight-line method based on the estimated useful lives of the assets. Leasehold improvements are amortized over either their respective lease terms or their estimated useful lives, whichever is shorter. Estimated useful lives range from three years to 40 years for leasehold improvements and buildings, three years to 10 years for computer systems, equipment and software, and three years to 20 years for furniture, fixtures and equipment.\nCapitalized computer software costs are amortized using the straight-line method over the estimated useful life. These costs include purchased software packages, payments to vendors and consultants for the development, implementation or modification of purchased software packages for Company use, and payroll and related costs for associates connected with internal-use software projects. Capitalized computer software costs are included in property, plant and equipment in the Consolidated Balance Sheets.\nLeases\nThe Companys lease portfolio includes certain real estate (customer fulfillment centers, regional inventory centers, warehouses and manufacturing locations), automobiles and other equipment. The determination of whether an arrangement is, or contains, a lease is performed at the inception of the arrangement. Operating leases are recorded on the balance sheet with operating lease assets representing the right to use the underlying asset for the lease term and operating lease liabilities representing the obligation to make lease payments arising from the lease.\nFor real estate leases, lease components and non-lease components, such as common area maintenance, are grouped as a single lease component. All leases with an initial term of 12 months or less are not included on the balance sheet. Real estate leases typically include one or more options to extend the lease. The Company regularly evaluates the renewal options, and when it is reasonably certain of exercise, the Company includes the renewal period in its lease term. The automobile leases contain variable lease payments based on inception and subsequent interest rate fluctuations.\nWhen readily determinable, the Company uses the interest rate implicit in its leases to discount lease payments. When the implicit rate is not readily determinable, as is the case with substantially all of the real estate leases, the Company utilizes the incremental borrowing rate. The Companys operating lease expense is recognized on a straight-line basis over the lease term and is recorded in Operating expenses in the Consolidated Statements of Income.\nGoodwill and Other Indefinite-Lived Intangible Assets\nThe Companys business acquisitions typically result in the recording of goodwill and other intangible assets, which affects the amount of amortization expense and possibly impairment write-downs that the Company may incur in future periods. Goodwill represents the excess of the purchase price paid over the fair value of the net assets acquired in business acquisitions. The Company annually reviews goodwill at the reporting unit level and intangible assets that have indefinite lives for impairment in its fiscal fourth quarter and when events or changes in circumstances indicate the carrying values of these assets might exceed their current fair values.\nThe Company currently operates at a single reporting unit level. Events or circumstances that may result in an impairment review include changes in macroeconomic conditions, industry and market considerations, cost fact events affecting the reporting unit or a sustained decrease in share price. Each year, the Company may elect to perform a qualitative assessment to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. If impairment is indicated in the qualitative assessment or if management elects to initially perform a quantitative assessment of goodwill or intangible assets, the impairment test uses a single step approach. This single step approach compares the carrying value of a reporting unit to its fair value. If the fair value of the reporting unit exceeds its carrying amount, goodwill and intangible assets of the reporting unit are not impaired. If the carrying amount of a reporting unit exceeds its fair value, an impairment loss is recognized in an amount equal to that excess, limited to the amount of goodwill allocated to that reporting unit. Based on the qualitative assessments of goodwill and intangible assets that have indefinite lives performed by the Company in its respective fiscal fourth quarters, there was no indicator of impairment for fiscal years 2023, 2022 and 2021.\nThe balances and changes in the carrying amount of goodwill are as follows:\nBalance as of August 28, 2021 $ 692,704\nEngman-Taylor acquisition (1)\n6,173\nTower Fasteners acquisition (2)\n12,247\nForeign currency translation adjustments (994)\nBalance as of September 3, 2022 $ 710,130\nBuckeye/Tru-Edge acquisition (3)\n7,826\nTower Fasteners post-closing working capital adjustment (2)\nForeign currency translation adjustments 95\nBalance as of September 2, 2023 $ 718,174\n(1)In June 2022, the Company acquired certain assets and assumed certain liabilities of Engman-Taylor (as defined in Note 6, Business Combinations).\n(2)In August 2022, the Company acquired 100% of the outstanding equity of Tower Fasteners (as defined in Note 6, Business Combinations).\n(3)In January 2023, the Company acquired certain assets and assumed certain liabilities of Buckeye and Tru-Edge (each, as defined in Note 6, Business Combinations).\nThe components of the Companys intangible assets for fiscal years 2023 and 2022 are as follows:\nFor the Fiscal Years Ended\nSeptember 2, 2023 September 3, 2022\nWeighted-Average Useful Life (in years) Gross Carrying Amount Accumulated Amortization Gross Carrying Amount Accumulated Amortization\nCustomer Relationships 13.1 $ 252,769 $ (157,306) $ 243,269 $ (144,300)\nNon-Compete Agreements 3.4 966 (575) 966 (280)\nTrademarks 7.9 7,546 (3,842) 4,746 (2,876)\nTrademarks Indefinite 11,083 - 12,803 -\nTotal 12.9 $ 272,364 $ (161,723) $ 261,784 $ (147,456)\nFor the fiscal year ended September 2, 2023, the Company recorded approximately $10,600 of intangible assets, primarily consisting of the acquired customer relationships and trade names from the Buckeye and Tru-Edge acquisition. See Note 6, Business Combinations. During the fiscal year ended September 2, 2023, approximately $20 in indefinite lived intangible assets were written off related to trademarks that are no longer being utilized. Furthermore, $1,700 of indefinite lived intangible assets were reclassified to definite lived intangible assets during fiscal year 2023. For the fiscal year ended September 3, 2022, the Company recorded approximately $24,300 of intangible assets, primarily consisting of the acquired customer relationships, non-compete and trademarks from the Engman-Taylor and Tower Fasteners acquisitions. During the fiscal year ended September 3, 2022, approximately $4,329 in gross intangible assets, and any related accumulated amortization, were written off related to trademarks that are no longer being utilized. These trademarks were fully amortized prior to being written off.\nThe Companys amortizable intangible assets are amortized on a straight-line basis, including customer relationships, based on an approximation of customer attrition patterns and best estimates of the use pattern of the asset. Amortization expense of the Companys intangible assets was $14,917, $11,663 and $10,934 during fiscal years 2023, 2022 and 2021, respectively. Estimated amortization expense for each of the five succeeding fiscal years is as follows:\nFiscal Year Estimated Amortization Expense\n2024 $ 14,773\n2025 14,486\n2026 14,466\n2027 14,247\n2028 11,541\nImpairment of Long-Lived Assets\nThe Company periodically evaluates the net realizable value of long-lived assets, including definite-lived intangible assets, operating lease right-of-use assets, and property and equipment, relying on a number of factors, including operating results, business plans, economic projections, and anticipated future cash flows. Impairment is assessed by evaluating the estimated undiscounted cash flows over the assets remaining life. If estimated cash flows are insufficient to recover the investment, an impairment loss is recognized.\nRevenue Recognition\nNet sales include product revenue and shipping and handling charges, net of estimated sales returns and any related sales incentives. Revenue is measured as the amount of consideration the Company expects to receive in exchange for transferring products. All revenue is recognized when the Company satisfies its performance obligations under the contract, which is determined to occur when the customer obtains control of the products, and invoicing occurs at approximately the same point in time. The Companys product sales have standard payment terms that do not exceed one year. The Company considers shipping and handling as activities to fulfill its performance obligation. Substantially all of the Companys contracts have a single performance obligation, to deliver products, and are short-term in nature. The Company estimates product returns based on historical return rates.\nThe Company offers customers sales incentives, which primarily consist of volume rebates, and upfront sign-on payments. These volume rebates and sign-on payments are not in exchange for a distinct good or service and result in a reduction of net sales from the goods transferred to the customer at the later of when the related revenue is recognized or when the Company promises to pay the consideration.\nGross Profit\nGross profit primarily represents the difference between the sale price to the Companys customers and the product cost from its suppliers (net of earned rebates and discounts), including the cost of inbound freight. The cost of outbound freight (including internal transfers), purchasing, receiving and warehousing are included in operating expenses.\nVendor Consideration\nThe Company receives volume rebates from certain vendors based on contractual arrangements with such vendors. Rebates received from these vendors are recognized as a reduction to Cost of goods sold in the Consolidated Statements of Income when the inventory is sold. In addition, the Company records cash consideration received for advertising costs incurred to sell the vendors products as a reduction of the Companys advertising costs and such consideration is reflected in Operating expenses in the Consolidated Statements of Income. The total amount of advertising costs, net of co-operative advertising income from vendor-sponsored programs, included in Operating expenses in the Consolidated Statements of Income was approximately $9,124, $14,377 and $17,749 during fiscal years 2023, 2022 and 2021, respectively.\nProduct Warranties\nThe Company generally offers a maximum one year warranty, including parts and labor, for certain of its products sold. The specific terms and conditions of those warranties vary depending upon the product sold. The Company may be able to recoup some of these costs through product warranties it holds with its original equipment manufacturers, which typically range from 30 to 90 days. In general, many of the Companys general merchandise products are covered by third-party original equipment manufacturers warranties. The Companys warranty expense has been minimal.\nShipping and Handling Costs\nThe Company includes shipping and handling fees billed to customers in Net sales and shipping and handling costs associated with outbound freight in Operating expenses in the Consolidated Statements of Income. The shipping and handling costs in Operating expenses were approximately $156,844, $155,472 and $133,737 during fiscal years 2023, 2022 and 2021, respectively.\nStock-Based Compensation\nIn accordance with Accounting Standards Codification (ASC) Topic 718, Compensation - Stock Compensation, the Company estimates the fair value of share-based payment awards on the date of grant. The value of awards that are ultimately expected to vest is recognized as an expense over the requisite service periods. The fair value of the Companys restricted stock units and performance share units is based on the closing market price of the Companys Class A Common Stock on the date of grant. The Company estimates the fair value of stock options granted using a Black-Scholes option-pricing model. This model requires the Company to make estimates and assumptions with respect to the expected term of the option, the expected volatility of the price of the Companys Class A Common Stock and the expected forfeiture rate. The fair value is then amortized on a straight-line basis over the requisite service periods of the awards, which is generally the vesting period.\nThe expected term is based on the historical exercise behavior of grantees, as well as the contractual life of the option grants. The expected volatility factor is based on the volatility of the Companys Class A Common Stock for a period equal to the expected term of the stock option. In addition, forfeitures of share-based awards are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. The Company uses historical data to estimate forfeitures and records stock-based compensation expense only for those awards that are expected to vest.\nShare Repurchases and Treasury Stock\nRepurchased shares may be retired immediately and resume the status of authorized but unissued shares or may be held by the Company as treasury stock. The Company accounts for treasury stock under the cost method, using the first-in, first-out flow assumption, and it is included in Class A treasury stock, at cost in the Consolidated Balance Sheets. When the Company reissues treasury stock, the gains are recorded in additional paid-in capital (APIC), while the losses are recorded to APIC to the extent that the previous net gains on the reissuance of treasury stock are available to offset the losses. If the losses are larger than the previous net gains available, then the losses are recorded to retained earnings. The Company accounts for repurchased shares immediately retired under the constructive retirement method. When shares are retired, the par value of the repurchased shares is deducted from common stock and the excess repurchase price over par is deducted by allocation to both APIC and retained earnings. The amount allocated to APIC is calculated as the original cost of APIC per share outstanding using the first-in, first-out flow assumption and is applied to the number of shares repurchased. Any remaining amount is allocated to retained earnings.\nFair Value of Financial Instruments\nThe carrying values of the Companys financial instruments, including cash and cash equivalents, receivables, accounts payable and accrued liabilities, approximate fair value because of the short maturity of these instruments. In addition, based on borrowing rates currently available to the Company for borrowings with similar terms, the carrying values of the Companys lease obligations also approximate fair value. The fair values of the Companys long-term debt, including current maturities, are estimated based on quoted market prices for the same or similar issues or on current rates offered to the Company for debt of the same remaining maturities. Under this method, the Companys fair values of any long-term obligations were not significantly different than the carrying values at September 2, 2023 and September 3, 2022.\nForeign Currency\nThe local currency is the functional currency for all of MSCs operations outside the United States. Assets and liabilities of these operations are translated to U.S. dollars at the exchange rate in effect at the end of each period. Income statement accounts are translated at the average exchange rate prevailing during the period. Translation adjustments arising from the use of differing exchange rates from period to period are included as a component of other comprehensive income within shareholders equity. Gains and losses from foreign currency transactions are included in net income for the period.\nIncome Taxes\nThe Company has established deferred income tax assets and liabilities for temporary differences between the financial reporting bases and the income tax bases of its assets and liabilities at enacted tax rates expected to be in effect when such assets or liabilities are realized or settled pursuant to the provisions of ASC Topic 740, Income Taxes, which prescribes a comprehensive model for the financial statement recognition, measurement, classification and disclosure of uncertain tax positions. For those benefits to be recognized, a tax position must be more-likely-than-not to be sustained upon examination by taxing authorities. The amounts of unrecognized tax benefits, exclusive of interest and penalties that would affect the effective tax rate, were $5,053 and $7,719 as of September 2, 2023 and September 3, 2022, respectively.\nComprehensive Income\nComprehensive income consists of consolidated net income and foreign currency translation adjustments. Foreign currency translation adjustments included in comprehensive income were not tax-affected as investments in international affiliates are deemed to be permanent.\nGeographic Regions\nThe Companys sales and assets are predominantly generated from North American locations. For fiscal year 2023, the Companys operations in North America represented approximately 99% of consolidated net sales, with 95% of the total being from the Companys operations in the United States. The remaining 1% of consolidated net sales is from the Companys operations in Europe.\nSegment Reporting\nThe Company utilizes the management approach for segment disclosure, which designates the internal organization that is used by management for making operating decisions and assessing performance as the source of its reportable segments. The Company operates in one operating and reportable segment as a distributor of metalworking, MRO, Class C Consumables and Original Equipment Manufacturer (OEM) products and services. The Companys chief operating decision maker, its Chief Executive Officer, manages the Companys operations on a consolidated basis for purposes of allocating resources. Substantially all of the Companys revenues and long-lived assets are in the United States. The Company does not disclose net sales information by product category as it is impracticable to do so as a result of its numerous product offerings and the manner in which its business is managed.\nBusiness Combinations\nThe Company accounts for business combinations in accordance with ASC Topic 805, Business Combinations (ASC Topic 805). ASC Topic 805 established principles and requirements for recognizing the total consideration transferred to, and the assets acquired, liabilities assumed and any non-controlling interest in, the acquired target in a business combination. ASC Topic 805 also provides guidance for recognizing and measuring goodwill acquired in a business combination and requires the acquirer to disclose information that users may need to evaluate and understand the financial impact of the business combination. See Note 6, Business Combinations for further discussion.\nRecently Adopted Accounting Pronouncements\nIn November 2021, the Financial Accounting Standards Board (the FASB) issued Accounting Standards Update 2021-10, Government Assistance (Topic 832): Disclosures by Business Entities about Government Assistance, which provides for additional disclosures and added transparency for entities which receive government assistance. This includes disclosure of the type of government assistance received, the entitys method of accounting, and the impact on the entitys financial statements. This guidance is effective for annual periods beginning after December 15, 2021. The guidance was adopted by the Company for fiscal year 2023 and will be applied prospectively. See Note 8, Income Taxes for further information related to the Employee Retention Credit (the ERC) provision provided under the Coronavirus Aid, Relief and Economic Security Act (the CARES Act).\nOther pronouncements issued by the FASB or other authoritative accounting standards groups with future effective dates are either not applicable or are not expected to have a material impact on the Consolidated Financial Statements.\n2. REVENUE\nRevenue Recognition\nNet sales include product revenue and shipping and handling charges, net of estimated sales returns and any related sales incentives. Revenue is measured as the amount of consideration the Company expects to receive in exchange for transferring products. All revenue is recognized when the Company satisfies its performance obligations under the contract, which is determined to occur when the customer obtains control of the products, and invoicing occurs at approximately the same point in time. The Companys product sales have standard payment terms that do not exceed one year. The Company considers shipping and handling as activities to fulfill its performance obligation. Substantially all of the Companys contracts have a single performance obligation, to deliver products, and are short-term in nature. The Company estimates product returns based on historical return rates. Total accrued sales returns were $8,632 and $7,198 as of September 2, 2023 and September 3, 2022, respectively, and are reported as Accrued expenses and other current liabilities in the Consolidated Balance Sheets. Sales taxes and value-added taxes in foreign jurisdictions that are collected from customers and remitted to governmental authorities are accounted for on a net basis and therefore are excluded from net sales.\nConsideration Payable to Customers\nThe Company offers customers sales incentives, which primarily consist of volume rebates, and upfront sign-on payments. These volume rebates and sign-on payments are not in exchange for a distinct good or service and result in a reduction of net sales from the goods transferred to the customer at the later of when the related revenue is recognized or when the Company promises to pay the consideration. The Company estimates its volume rebate accruals and records its\nsign-on payments based on various factors, including contract terms, historical experience and performance levels. Total accrued sales incentives, primarily related to volume rebates, were $31,954 and $25,274 as of September 2, 2023 and September 3, 2022, respectively, and are included in Accrued expenses and other current liabilities in the Consolidated Balance Sheets. Sign-on payments, not yet recognized as a reduction of net sales, are recorded in Prepaid expenses and other current assets in the Consolidated Balance Sheets and were $3,733 and $2,210 as of September 2, 2023 and September 3, 2022, respectively.\nContract Assets and Liabilities\nThe Company records a contract asset when it has a right to payment from a customer that is conditioned on events other than the passage of time. The Company records a contract liability when customers prepay but the Company has not yet satisfied its performance obligations. The Company did not have material contract assets or liabilities as of September 2, 2023 and September 3, 2022.\nDisaggregation of Revenue\nThe Company operates in one operating and reportable segment as a distributor of metalworking and MRO products and services. The Company serves a large number of customers of various types and in diverse industries, which are subject to different economic and industry factors. The Companys presentation of net sales by customer end-market, customer type and geography most reasonably depicts how the nature, amount, timing and uncertainty of Company revenue and cash flows are affected by economic and industry factors. The Company does not disclose net sales information by product category as it is impracticable to do so as a result of its numerous product offerings and the manner in which its business is managed.\nThe following table presents the Companys percentage of revenue by customer end-market for fiscal years 2023 and 2022:\nFor the Fiscal Years Ended\nSeptember 2, 2023 September 3, 2022\n(52 weeks) (53 weeks)\nManufacturing Heavy 48 % 49 %\nManufacturing Light 20 % 21 %\nPublic Sector 10 % 8 %\nRetail/Wholesale 7 % 7 %\nCommercial Services 4 % 4 %\nOther (1)\n11 % 11 %\nTotal 100 % 100 %\n(1)The Other category primarily includes individual customer and small business net sales not assigned to a specific industry classification.\nThe Company groups customers into three categories by type of customer: national account, public sector and core and other. National account customers are Fortune 1000 companies, large privately held companies, and international companies primarily doing business in North America. Public sector customers are governments and their instrumentalities such as federal agencies, state governments, and public sector healthcare providers. Federal government customers include the United States Marine Corps, the United States Coast Guard, the United States Postal Service, the United States General Services Administration, the United States Department of Defense, the United States Department of Energy, large and small military bases, Veterans Affairs hospitals, and correctional facilities. The Company has individual state and local contracts, as well as contracts through partnerships with several state co-operatives. Core and other customers are those customers that are not national account customers or public sector customers.\nThe following table presents the Companys percentage of revenue by customer type for fiscal years 2023 and 2022:\nFor the Fiscal Years Ended\nSeptember 2, 2023 September 3, 2022\n(52 weeks) (53 weeks)\nNational Account Customers 38 % 38 %\nPublic Sector Customers 10 % 8 %\nCore and Other Customers 52 % 54 %\nTotal 100 % 100 %\nThe Companys revenue originating from the following geographic areas was as follows for fiscal years 2023 and 2022:\nFor the Fiscal Years Ended\nSeptember 2, 2023 September 3, 2022\n(52 weeks) (53 weeks)\nUnited States 95 % 95 %\nMexico 2 % 2 %\nCanada 2 % 2 %\nNorth America 99 % 99 %\nOther foreign countries 1 % 1 %\nTotal 100 % 100 %\n3. FAIR VALUE\nFair value accounting standards define fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The below fair value hierarchy prioritizes the inputs used to measure fair value into three levels, with Level 1 being of the highest priority. The three levels of inputs used to measure fair value are as follows:\nLevel 1-Observable inputs that reflect quoted prices (unadjusted) for identical assets or liabilities in active markets.\nLevel 2-Include other inputs that are directly or indirectly observable in the marketplace.\nLevel 3-Unobservable inputs which are supported by little or no market activity.\nThe Companys financial instruments include cash and cash equivalents, accounts receivable, accounts payable and outstanding indebtedness. Cash and cash equivalents include investments in a money market fund which are reported at fair value. The fair value of money market funds is determined using quoted prices for identical investments in active markets, which are considered to be Level 1 inputs within the fair value hierarchy. The Company uses a market approach to determine the fair value of its debt instruments, utilizing quoted prices in active markets, interest rates and other relevant information generated by market transactions involving similar instruments. Therefore, the inputs used to measure the fair value of the Companys debt instruments are classified as Level 2 within the fair value hierarchy. The reported carrying amounts of the Companys financial instruments approximated their fair values as of September 2, 2023 and September 3, 2022.\nDuring fiscal years 2023 and 2022, the Company had no material remeasurements of non-financial assets or liabilities at fair value on a non-recurring basis subsequent to their initial recognition.\nGain on Sale of Property\nDuring fiscal year 2021, the Company entered into a Purchase and Sale Agreement to sell its 170,000-square foot Long Island Customer Service Center in Melville, New York. During fiscal year 2022, the Company disposed of the building with a sale price of $25,500, which resulted in a gain on sale of property of $10,132 after the settlement of certain\nclosing costs and fees, which is included in the Consolidated Statement of Income for the fiscal year ended September 3, 2022.\n4. NET INCOME PER SHARE\nBasic net income per share is computed by dividing net income by the weighted-average number of shares of the Companys Class A Common Stock, par value $0.001 per share (Class A Common Stock), and the Companys Class B Common Stock, par value $0.001 per share (Class B Common Stock and, together with Class A Common Stock, Common Stock), outstanding during the period. Diluted net income per share is computed by dividing net income by the weighted-average number of shares of Common Stock outstanding during the period, including potentially dilutive shares of Common Stock equivalents outstanding during the period. The dilutive effect of potential shares of Common Stock is determined using the treasury stock method. The following table sets forth the computation of basic and diluted net income per common share under the treasury stock method for fiscal years 2023, 2022 and 2021:\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\n2022 August 28,\n(52 weeks) (53 weeks) (52 weeks)\nNumerator:\nNet income attributable to MSC Industrial as reported $ 343,233 $ 339,786 $ 216,907\nDenominator:\nWeighted-average shares outstanding for basic net income per share 55,918 55,777 55,737\nEffect of dilutive securities 292 268 356\nWeighted-average shares outstanding for diluted net income per share 56,210 56,045 56,093\nNet income per share:\nBasic $ 6.14 $ 6.09 $ 3.89\nDiluted $ 6.11 $ 6.06 $ 3.87\nPotentially dilutive securities - 400 314\nPotentially dilutive securities attributable to outstanding share-based awards are excluded from the calculation of diluted net income per share when the combined exercise price and average unamortized fair value are greater than the average market price of Class A Common Stock, and, therefore, their inclusion would be anti-dilutive.\n5. ACCOUNTS RECEIVABLE\nAccounts receivables at September 2, 2023 and September 3, 2022 consisted of the following:\nSeptember 2,\n2023 September 3,\nAccounts receivable $ 458,168 $ 708,379\nLess: Allowance for credit losses 22,747 20,771\nAccounts receivable, net $ 435,421 $ 687,608\nOn December 19, 2022, the Company entered into a Receivables Purchase Agreement (the RPA), by and among MSC A/R Holding Co., LLC, a wholly owned subsidiary of the Company (the Receivables Subsidiary), as seller, the Company, as master servicer, certain purchasers from time to time party thereto (collectively, the Purchasers), and Wells Fargo Bank, National Association, as administrative agent (the Agent). The RPA matures on December 19, 2025 and is subject to customary termination events related to transactions of this type. Additionally, the Receivables Subsidiary also\nentered into a Receivables Sale Agreement, dated as of December 19, 2022, by and between the Receivables Subsidiary, as buyer, and Sid Tool Co., Inc., a wholly owned subsidiary of the Company, as originator.\nUnder the RPA, the Receivables Subsidiary may sell receivables to the Purchasers in amounts up to $300,000. The receivables will be sold to the Purchasers in consideration for the Purchasers making payments of cash, which is referred to as capital for purposes of the RPA, to the Receivables Subsidiary in accordance with the terms of the RPA. The Receivables Subsidiary may sell receivables to the Purchasers so long as certain conditions are satisfied, including that, at any date of determination, the aggregate capital paid to the Receivables Subsidiary does not exceed a capital coverage amount, equal to an adjusted net receivables pool balance minus a required reserve. Each Purchasers share of capital accrues yield at one-month Term SOFR (as defined in the RPA) plus a margin.\nThe parties intend that the conveyance of receivables to the Agent, for the ratable benefit of the Purchasers, will constitute a purchase and sale of receivables and not a pledge for security. The Receivables Subsidiary has guaranteed to each Purchaser and the Agent the prompt payment of sold receivables, and, to secure the prompt payment and performance of such guaranteed obligations, the Receivables Subsidiary has granted a security interest to the Agent, for the benefit of the Purchasers, in all assets of the Receivables Subsidiary. The assets of the Receivables Subsidiary are not available to pay the Companys creditors or any affiliate thereof. In the capacity as master servicer under the RPA, the Company is responsible for administering and collecting receivables and has made customary representations, warranties, covenants and indemnities.\nThe proceeds of the RPA are classified as operating activities in the Consolidated Statement of Cash Flows for the fiscal year ended September 2, 2023 and were used to pay down balances on the Amended Revolving Credit Facility (as defined below). Cash received from collections of sold receivables is used by the Receivables Subsidiary to fund additional purchases of receivables on a revolving basis or to return all or any portion of outstanding capital of the Purchasers. Subsequent collections on the pledged receivables, which have not been sold, will be classified as operating cash flows at the time of collection.\nAs of September 2, 2023, the amount sold to the Purchasers was $300,000, which was derecognized from the Consolidated Balance Sheet as of that date. As collateral against sold receivables, the Receivables Subsidiary maintains a certain level of unsold receivables, which was $352,385 as of September 2, 2023.\nTotal cumulative receivables sold under the RPA were $1,157,276 as of September 2, 2023. Total cumulative cash collections under the RPA were $857,276 as of September 2, 2023. The fair value of the sold receivables approximated book value due to their credit quality and short-term nature, and, as a result, no gain or loss on sale of receivables was recorded.\nThe receivables sold incurred fees due to the Purchasers of $12,175 for the fiscal year ended September 2, 2023, which were recorded within Other (expense) income, net in the Consolidated Statement of Income for the fiscal year ended September 2, 2023. The financial covenants under the RPA are substantially the same as those under the Credit Facilities, the Private Placement Debt and the Shelf Facility Agreements (each, as defined below). See Note 10, Debt for more information about these financial covenants.\n6. BUSINESS COMBINATIONS\nFiscal Year 2023 Acquisitions\nIn January 2023, the Company acquired certain assets and assumed certain liabilities of Buckeye Industrial Supply Co. (Buckeye), an Ohio-based metalworking distributor, and Tru-Edge Grinding, Inc. (Tru-Edge), an Ohio-based custom tool manufacturer, for aggregate consideration of $22,389, which includes cash paid of $20,500 and the fair value of contingent consideration to be paid out of $2,294, net of a post-closing working capital adjustment in the amount of $405 received from the sellers that was finalized during the third quarter of fiscal year 2023. Total cash consideration funded by the Company came from available cash resources.\nBuckeye primarily serves the metalworking needs of large manufacturers. MSC plans to build on Buckeyes technical, high-touch relationships and value-added services by offering customers access to its extensive product portfolio to support customers full metalworking and MRO needs. Tru-Edge brings new capabilities to MSC, including the design and manufacture of parts from scratch with a strong focus in the automotive and medical markets. The Company expects to drive revenue growth in its existing Midwest manufacturing customer base by leveraging the services provided by Tru-Edge. The Company believes the technical expertise and value-added services provided by Tru-Edge will support its effort to drive cost savings for its customers.\nThis acquisition was accounted for as a single business acquisition pursuant to ASC Topic 805. As required by ASC Topic 805, the Company allocated the consideration to assets and liabilities based on their fair value at the acquisition date. The following table summarizes the amounts of identified assets acquired and liabilities assumed based on the fair value at the acquisition date:\nInventories $ 1,019\nAccounts receivable 2,745\nPrepaid expenses and other current assets 27\nIdentifiable intangibles 10,600\nGoodwill 7,826\nProperty, plant and equipment 1,291\nTotal assets acquired $ 23,508\nAccounts payable 1,090\nAccrued liabilities 29\nTotal liabilities assumed $ 1,119\nTotal purchase price consideration $ 22,389\nAcquired identifiable intangible assets with a fair value of $10,600 consisted of customer relationships of $9,500 with useful lives of 10 years and trade names of $1,100 with useful lives of five years and 20 years for Buckeye and Tru-Edge, respectively. The goodwill amount of $7,826 represents the excess of the purchase price over the fair value of the net tangible and intangible assets acquired. The primary items that generated the goodwill were the premiums paid by the Company for the right to control the business acquired and the benefit from adding a highly complementary provider of metalworking tools and supplies, as well as design and manufacturing of parts. This goodwill will not be amortized and will be included in the Companys periodic test for impairment at least annually. The goodwill is deductible for income tax purposes.\nThe amount of combined net sales and income before provision for income taxes from Buckeye and Tru-Edge included in the Consolidated Statement of Income for the fiscal year ended September 2, 2023 was $20,916 and $1,655, respectively. In addition, the Company incurred non-recurring transaction and integration costs relating to the acquisition totaling $341, which are included in Operating expenses in the Consolidated Statement of Income for the fiscal year ended September 2, 2023.\nFiscal Year 2022 Acquisitions\nAcquisition of Certain Assets of Engman-Taylor\nIn June 2022, the Company acquired certain assets and assumed certain liabilities of Engman-Taylor Company, Inc. (Engman-Taylor), a Menomonee Falls, Wisconsin-based distributor of metalworking tools and supplies, for aggregate consideration of $24,838, which includes a post-closing working capital adjustment in the amount of $661 that was paid to the Company in August 2022. Total cash consideration funded by the Company came from available cash resources and borrowings under the Amended Revolving Credit Facility (see Note 10, Debt).\nAcquisition of Tower Fasteners\nIn August 2022, the Company, through its subsidiary, All Integrated Solutions, Inc., acquired 100% of the outstanding shares of privately held Tower Fasteners, LLC (Tower Fasteners), a Holtsville, New York-based distributor of OEM fasteners and components, for aggregate consideration of $33,990, which includes a post-closing working capital adjustment in the amount of $1,152 paid by the Company, of which $1,029 was paid in August 2022 and $123 was paid in November 2022. Total cash consideration funded by the Company came from available cash resources and borrowings under the Amended Revolving Credit Facility (see Note 10, Debt).\n7. PROPERTY, PLANT AND EQUIPMENT\nThe following is a summary of property, plant and equipment and the estimated useful lives used in the computation of depreciation and amortization:\nNumber of Years September 2,\n2023 September 3,\nLand - $ 24,028 $ 24,418\nBuilding and improvements 3 - 40\n166,711 167,012\nLeasehold improvements The lesser of lease term or 10\n6,265 4,787\nFurniture, fixtures and equipment 3 - 20\n193,121 176,723\nComputer systems, equipment and software 3 - 10\n563,724 498,267\n953,849 871,207\nLess: Accumulated depreciation and amortization 634,189 584,541\nTotal $ 319,660 $ 286,666\nDuring fiscal year 2021, the Company entered into a Purchase and Sale Agreement to sell its Long Island Customer Service Center. Prior to disposal, the related assets had a carrying value of approximately $15,300, which was comprised of approximately $11,600 of building and improvements and $3,700 of land. During fiscal year 2022, the Company disposed of the building with a sale price of $25,500.\nThe amount of capitalized interest, net of accumulated amortization, included in property, plant and equipment was $428 and $460 at September 2, 2023 and September 3, 2022, respectively. Depreciation expense was $59,814, $58,285 and $57,199 for fiscal years 2023, 2022 and 2021, respectively.\n8. INCOME TAXES\nThe components of income before provision for income taxes were as follows:\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\n2022 August 28,\nDomestic $ 453,563 $ 449,389 $ 282,478\nForeign 2,593 1,743 5,901\nTotal $ 456,156 $ 451,132 $ 288,379\nThe provision for income taxes is comprised of the following:\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\n2022 August 28,\nCurrent:\nFederal $ 81,187 $ 77,761 $ 60,988\nState and local 21,121 19,524 15,237\nForeign 1,635 1,309 1,327\n103,943 98,594 77,552\nDeferred:\nFederal 8,164 11,591 (5,513)\nState and local 1,683 1,281 (842)\nForeign (741) (816) (755)\n9,106 12,056 (7,110)\nTotal $ 113,049 $ 110,650 $ 70,442\nSignificant components of deferred tax assets and liabilities are as follows:\nSeptember 2,\n2023 September 3,\nDeferred tax liabilities:\nDepreciation $ (40,137) $ (41,990)\nRight-of-use assets (14,290) (14,898)\nGoodwill (118,015) (111,471)\nIntangible amortization (2,388) (2,568)\n(174,830) (170,927)\nDeferred tax assets:\nAccounts receivable 5,047 4,605\nLease liability 14,595 14,766\nInventory 10,356 13,476\nSelf-insurance liability 2,988 1,605\nDeferred compensation 256 586\nStock-based compensation 5,431 5,881\nOther accrued expenses/reserves 11,958 14,915\n50,631 55,834\nNet Deferred Tax Liabilities $ (124,199) $ (115,093)\nReconciliation of the U.S. federal income tax rate to the Companys effective income tax rate is as follows:\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\n2022 August 28,\nU.S. federal income tax rate 21.0 % 21.0 % 21.0 %\nState income taxes, net of federal benefit 4.3 3.9 4.1\nOther, net (0.5) (0.4) (0.7)\nEffective income tax rate 24.8 % 24.5 % 24.4 %\nThe aggregate changes in the balance of gross unrecognized tax benefits during fiscal years 2023 and 2022 were as follows:\nSeptember 2,\n2023 September 3,\nBeginning Balance $ 11,223 $ 6,119\nAdditions for tax positions relating to current year 403 1,130\nAdditions for tax positions relating to prior years - 6,810\nReductions for tax positions relating to prior years (816) (626)\nSettlements (178) -\nLapse of statute of limitations (2,864) (2,210)\nEnding Balance $ 7,768 $ 11,223\nIncluded in the balance of gross unrecognized tax benefits at September 2, 2023 is $1,415 related to tax positions for which it is reasonably possible that the total amounts could significantly change during the next 12 months. This amount represents a potential decrease in gross unrecognized tax benefits comprised primarily of items related to expiring statutes of limitations in state and foreign jurisdictions.\nThe Company recognizes interest expense and penalties in the provision for income taxes. The provision for income taxes for fiscal years 2023, 2022 and 2021 included interest and penalties of $153, $7 and $689, respectively. The\nCompany had accrued $1,973 and $2,490 for interest and penalties as of September 2, 2023 and September 3, 2022, respectively.\nThe United States government enacted the CARES Act to provide certain relief as a result of the COVID-19 pandemic. The CARES Act provides tax relief, along with other stimulus measures, including the ERC, which allows for employers to claim a refundable tax credit against the employer share of social security taxes equal to 50% of qualified wages paid to qualified employees between March 13, 2020 and December 31, 2020 and 70% of qualified wages paid to qualified employees after December 31, 2020 through September 30, 2021. The ERC was designed to encourage businesses to keep employees on the payroll during the COVID-19 pandemic. During the fiscal year ended September 2, 2023, the Company received funds related to ERC claims previously submitted. As there is no authoritative guidance under accounting principles generally accepted in the United States of America on accounting for government assistance to for-profit business entities, the Company accounts for the ERC by analogy to International Accounting Standard 20, Accounting for Government Grants and Disclosure of Government Assistance. As such, the Company recorded $6,566 to Other (expense) income, net in the Consolidated Statement of Income for the fiscal year ended September 2, 2023, as the probability threshold had been met for these funds. Conversely, management determined the probability threshold had not been met for $5,129 of the funds received, and, as such, that portion of the funds was recorded to Accrued expenses and other current liabilities in the Consolidated Balance Sheet as of September 2, 2023. This amount will be recognized in the Consolidated Statement of Income when the probability threshold has been met, which is the earlier of a completed audit or the lapse of the relevant statute of limitations.\nThe CARES Act provides for the deferral of the employer-paid portion of social security payroll taxes. The Company elected to defer the employer-paid portion of social security payroll taxes through December 31, 2020 of $18,887. Of this amount, half was remitted in December 2021 and the remaining half was remitted in December 2022.\nThe Company is routinely examined by federal and state tax authorities. The Internal Revenue Service completed an examination of the Companys U.S. income tax returns for fiscal years 2017, 2018 and 2019, which resulted in a settlement. The Company is subject to examination by the Internal Revenue Service from fiscal year 2020 to present. With limited exceptions, the Company is no longer subject to state income tax examinations prior to fiscal year 2020. The Company is also subject to examinations in various foreign jurisdictions. The statute of limitations may vary by jurisdiction.\nThe Company has reinvested an immaterial amount of undistributed earnings of its foreign subsidiaries and may be subject to additional foreign withholding taxes and U.S. state income taxes if it reverses its indefinite reinvestment assertion on these foreign earnings in the future. All other outside basis differences not related to earnings were immaterial to account for at this period of time and are currently considered as being permanent in duration.\n9. ACCRUED LIABILITIES\nAccrued liabilities consist of the following:\nSeptember 2,\n2023 September 3,\nAccrued payroll and fringe $ 39,717 $ 48,078\nAccrued bonus 17,243 31,961\nAccrued sales, property and income taxes 13,116 12,377\nAccrued sales and rebates 40,586 32,472\nAccrued restructuring and other costs 1,137 2,714\nAccrued dividend equivalents 4,975 5,843\nAccrued freight 4,905 5,144\nAccrued repurchases of common stock 8,494 -\nAccrued fees related to the Reclassification 5,575 -\nAccrued ERC claims 5,129 -\nAccrued other 31,157 25,737\nTotal accrued liabilities $ 172,034 $ 164,326\n10. DEBT\nDebt at September 2, 2023 and September 3, 2022 consisted of the following:\nSeptember 2,\n2023 September 3,\nAmended Revolving Credit Facility $ 50,000 $ 245,000\nUncommitted Credit Facilities 180,000 200,000\nLong-Term Note Payable 4,750 4,750\nPrivate Placement Debt:\n2.65% Senior Notes, Series A, due July 28, 2023\n- 75,000\n2.90% Senior Notes, Series B, due July 28, 2026\n100,000 100,000\n3.79% Senior Notes, due June 11, 2025\n20,000 20,000\n2.60% Senior Notes, due March 5, 2027\n50,000 50,000\n3.04% Senior Notes, due January 12, 2023 (1)\n- 50,000\n2.40% Series 2019A Notes, due March 5, 2024 (1)\n50,000 50,000\nFinancing arrangements 127 88\nLess: Unamortized debt issuance costs (1,026) (1,426)\nTotal debt, excluding obligations under finance leases 453,851 793,412\nLess: Current portion (229,686) (2)\n(324,684) (3)\nTotal long-term debt, excluding obligations under finance leases $ 224,165 $ 468,728\n(1)Represents private placement debt issued under the Shelf Facility Agreements.\n(2)Consists of $180,000 from the Uncommitted Credit Facilities (as defined below), $50,000 from the 2.40% Series 2019A Notes, due March 5, 2024, $37 from financing arrangements and net of unamortized debt issuance costs of $351 expected to be amortized in the next 12 months.\n(3)Consists of $200,000 from the Uncommitted Credit Facilities, $50,000 from the 3.04% Senior Notes, due January 12, 2023, $75,000 from the 2.65% Senior Notes, Series A, due July 28, 2023, $88 from financing arrangements and net of unamortized debt issuance costs of $404 expected to be amortized in the next 12 months.\nAmended Revolving Credit Facility\nIn April 2017, the Company entered into a $600,000 revolving credit facility, which was subsequently amended and extended in August 2021 (as amended, the Amended Revolving Credit Facility). The Amended Revolving Credit Facility, which matures on August 24, 2026, provides for a five-year unsecured revolving loan facility on a committed basis. The interest rate for borrowings under the Amended Revolving Credit Facility is based on either the Adjusted Term SOFR Rate (as defined in the Amended Revolving Credit Facility) or a base rate, plus a spread based on the Companys consolidated leverage ratio at the end of each fiscal reporting quarter. Depending on the interest period the Company selects, interest may be payable every one, two or three months. Interest is reset at the end of each interest period. The Company currently elects to have loans under the Amended Revolving Credit Facility bear interest based on the Adjusted Term SOFR Rate with one-month interest periods.\nThe Amended Revolving Credit Facility permits up to $50,000 to be used to fund letters of credit. The Amended Revolving Credit Facility also permits the Company to request one or more incremental term loan facilities and/or to increase the revolving loan commitments in an aggregate amount not to exceed $300,000. Subject to certain limitations, each such incremental term loan facility or revolving loan commitment increase will be on terms as agreed to by the Company, the administrative agent and the lenders providing such financing. Outstanding letters of credit were $5,269 at both September 2, 2023 and September 3, 2022.\nUncommitted Credit Facilities\nDuring fiscal year 2023, the Company extended all three of its uncommitted credit facilities. These facilities (collectively, the Uncommitted Credit Facilities and, together with the Amended Revolving Credit Facility, the Credit Facilities) total $203,000 in aggregate maximum uncommitted availability, under which $180,000 and $200,000 were outstanding at September 2, 2023 and September 3, 2022, respectively, and are included in Current portion of debt including obligations under finance leases in the Consolidated Balance Sheets. The interest rate on the Uncommitted Credit Facilities is based on the Secured Overnight Financing Rate. Borrowings under the Uncommitted Credit Facilities are due at the end of the applicable interest period, which is typically one month but may be up to six months and may be rolled\nover to a new interest period at the option of the applicable lender. The Companys lenders have, in the past, been willing to roll over the principal amount outstanding under the Uncommitted Credit Facilities at the end of each interest period but may not do so in the future. Each Uncommitted Credit Facility matures within one year of entering into such Uncommitted Credit Facility and contains certain limited covenants which are substantially the same as the limited covenants contained in the Amended Revolving Credit Facility. All of the Uncommitted Credit Facilities are unsecured and rank equally in right of payment with the Companys other unsecured indebtedness.\nBecause the interest rates on the Uncommitted Credit Facilities have recently been lower than the interest rates which are available on the Companys other sources of financing, the Company has used, and intends to use in the future, the Uncommitted Credit Facilities for opportunistic refinancing of the Companys existing indebtedness. The Company does not presently view the Uncommitted Credit Facilities as sources of incremental debt financing of the Company due to the uncommitted nature of the Uncommitted Credit Facilities, but reserves the right to use the Uncommitted Credit Facilities to incur additional debt where it considers it appropriate under the then-existing credit market conditions.\nDuring fiscal year 2023, the Company borrowed an aggregate $333,000 and repaid an aggregate $548,000 under the Credit Facilities. As of September 2, 2023 and September 3, 2022, the weighted-average interest rates on borrowings under the Credit Facilities were 6.17% and 3.42%, respectively.\nPrivate Placement Debt\nIn July 2016, the Company completed the issuance and sale of $100,000 aggregate principal amount of 2.90% Senior Notes, Series B, due July 28, 2026; in June 2018, the Company completed the issuance and sale of $20,000 aggregate principal amount of 3.79% Senior Notes, due June 11, 2025; and, in March 2020, the Company completed the issuance and sale of $50,000 aggregate principal amount of 2.60% Senior Notes, due March 5, 2027 (collectively, the Private Placement Debt). Interest is payable semiannually at the fixed stated interest rates. All of the Private Placement Debt is unsecured.\nIn July 2023, the Company paid $75,000 to satisfy its obligation on the 2.65% Senior Notes, Series A, due July 28, 2023, associated with the Private Placement Debt.\nShelf Facility Agreements\nIn January 2018, the Company entered into Note Purchase and Private Shelf Agreements with MetLife Investment Advisors, LLC (the MetLife Note Purchase Agreement) and PGIM, Inc. (the Prudential Note Purchase Agreement and, together with the MetLife Note Purchase Agreement, the Shelf Facility Agreements). Each of the MetLife Note Purchase Agreement and the Prudential Note Purchase Agreement provides for an uncommitted facility for the issuance and sale of up to an aggregate total of $250,000 of unsecured senior notes, at a fixed rate. As of September 2, 2023, $50,000 aggregate principal amount of 2.40% Series 2019A Notes, due March 5, 2024 was outstanding under notes issued in private placements pursuant to the Shelf Facility Agreements.\nIn January 2023, the Company paid $50,000 to satisfy its obligation on the 3.04% Senior Notes, due January 12, 2023, associated with the Prudential Note Purchase Agreement.\nCovenants\nEach of the Credit Facilities, the Private Placement Debt and the Shelf Facility Agreements imposes several restrictive covenants, including the requirement that the Company maintain (i) a maximum consolidated leverage ratio of total indebtedness to EBITDA (earnings before interest expense, taxes, depreciation, amortization and stock-based compensation) of no more than 3.00 to 1.00 (or, at the election of the Company after it consummates a material acquisition, a four-quarter temporary increase to 3.50 to 1.00) and (ii) a minimum consolidated interest coverage ratio of EBITDA to total interest expense of at least 3.00 to 1.00, during the terms of the Credit Facilities, the Private Placement Debt and the Shelf Facility Agreements. As of September 2, 2023, the Company was in compliance with the operating and financial covenants of the Credit Facilities, the Private Placement Debt and the Shelf Facility Agreements.\nMaturities of Long-Term Debt\nFiscal Year Maturities of\nLong-Term Debt\n2024 $ 50,000\n2025 20,000\n2026 150,000\n2027 50,000\n2028 -\nThereafter 4,750\nTotal $ 274,750\n11. LEASES\nThe Companys lease portfolio includes certain real estate (customer fulfillment centers, regional inventory centers, warehouses and manufacturing locations), automobiles and other equipment. The determination of whether an arrangement is, or contains, a lease is performed at the inception of the arrangement. Operating leases are recorded on the balance sheet with operating lease assets representing the right to use the underlying asset for the lease term and operating lease liabilities representing the obligation to make lease payments arising from the lease. For real estate leases, the Company has elected the practical expedient which allows lease components and non-lease components, such as common area maintenance, to be grouped as a single lease component. The Company has also elected the practical expedient which allows leases with an initial term of 12 months or less to be excluded from the balance sheet.\nThe Company does not guarantee any residual value in its lease agreements, there are no material restrictions or covenants imposed by lease arrangements, and there are no lease transactions with related parties. Real estate leases typically include one or more options to extend the lease. The Company regularly evaluates the renewal options, and when it is reasonably certain of exercise, the Company includes the renewal period in its lease term. The automobile leases contain variable lease payments based on inception and subsequent interest rate fluctuations. When readily determinable, the Company uses the interest rate implicit in its leases to discount lease payments. When the implicit rate is not readily determinable, as is the case with substantially all of the real estate leases, the Company utilizes the incremental borrowing rate. The incremental borrowing rate for a lease is the rate of interest the Company would have to pay on a collateralized basis to borrow an amount equal to the lease payments under similar terms. The rate for each lease was determined using primarily the Companys credit spread, the lease term and currency.\nThe components of lease cost for fiscal years 2023 and 2022 were as follows:\nFor the Fiscal Years Ended\nSeptember 2, 2023 September 3, 2022\nOperating lease cost $ 22,935 $ 19,995\nVariable lease cost (benefit) 339 (355)\nShort-term lease cost 3,236 4,496\nFinance lease cost:\nAmortization of leased assets 957 1,265\nInterest on leased liabilities 18 48\nTotal Lease Cost $ 27,485 $ 25,449\nSupplemental balance sheet information relating to operating and finance leases is as follows:\nClassification September 2,\n2023 September 3,\nAssets\nOperating lease assets Operating lease assets $ 65,909 $ 64,780\nFinance lease assets (1)\nProperty, plant and equipment, net 473 1,118\nTotal leased assets $ 66,382 $ 65,898\nLiabilities\nCurrent\nOperating Current portion of operating lease liabilities $ 21,168 $ 18,560\nFinance Current portion of debt including obligations under finance leases 249 996\nNoncurrent\nOperating Noncurrent operating lease liabilities 45,924 47,616\nFinance Long-term debt including obligations under finance leases 226 184\nTotal lease liabilities $ 67,567 $ 67,356\n(1)Finance lease assets are net of accumulated amortization of $2,952 and $3,447 as of September 2, 2023 and September 3, 2022, respectively.\nSeptember 2, 2023 September 3, 2022\nWeighted-average remaining lease term (in years)\nOperating Leases 4.0 4.7\nFinance Leases 2.1 1.2\nWeighted-average discount rate\nOperating Leases 3.8 % 3.1 %\nFinance Leases 4.5 % 2.7 %\nThe following table sets forth supplemental cash flow information related to operating and finance leases:\nFor the Fiscal Years Ended\nSeptember 2, 2023 September 3, 2022\nOperating Cash Outflows from Operating Leases $ 22,779 $ 19,535\nOperating Cash Outflows from Finance Leases 18 48\nFinancing Cash Outflows from Finance Leases 1,019 1,305\nLeased assets obtained in exchange for new lease liabilities:\nOperating Leases $ 21,060 $ 33,608\nFinance Leases 317 17\nAs of September 2, 2023, future lease payments were as follows:\nFiscal Year (1)\nOperating Leases Finance Leases Total\n2024 $ 23,422 $ 275 $ 23,697\n2025 19,093 126 19,219\n2026 12,555 111 12,666\n2027 8,226 - 8,226\n2028 4,133 - 4,133\nThereafter 5,522 - 5,522\nTotal Lease Payments 72,951 512 73,463\nLess: Imputed Interest 5,859 37 5,896\nPresent Value of Lease Liabilities (2)\n$ 67,092 $ 475 $ 67,567\n(1)Future lease payments by fiscal year are based on contractual lease obligations.\n(2)Includes the current portion of $21,168 for operating leases and $249 for finance leases.\nAs of September 2, 2023, the Companys future lease obligations which had not yet commenced were immaterial. The Company has various arrangements for certain property it owns under which it is the lessor. These leases meet the criteria for operating lease classification. Lease income associated with these leases is immaterial.\n12. SHAREHOLDERS EQUITY\nCommon Stock Repurchases and Treasury Stock\nOn June 29, 2021, the Board of Directors of the Company (the Board) terminated the MSC Stock Repurchase Plan, which was established during fiscal year 1999, and authorized a new share repurchase program (the Share Repurchase Program) to purchase up to 5,000 shares of Class A Common Stock. There is no expiration date for the Share Repurchase Program. As of September 2, 2023, the maximum number of shares of Class A Common Stock that may yet be repurchased under the Share Repurchase Program was 3,724 shares. The Share Repurchase Program allows the Company to repurchase shares at any time and in any increments it deems appropriate in accordance with Rule 10b-18 under the Securities Exchange Act of 1934, as amended.\nDuring fiscal years 2023 and 2022, the Company repurchased 1,034 shares and 363 shares, respectively, of Class A Common Stock for $95,779 and $27,359, respectively. In fiscal years 2023 and 2022, from these totals, 976 shares and 300 shares, respectively, were immediately retired and 58 shares and 63 shares, respectively, were repurchased by the Company to satisfy the Companys associates tax withholding liability associated with its share-based compensation program and are reflected at cost as treasury stock in the Consolidated Financial Statements for fiscal years 2023 and 2022.\nShares of Class A Common Stock purchased to satisfy the Companys associates tax withholding liability associated with its share-based compensation program did not reduce the number of shares that may be repurchased under the Share Repurchase Program. The Company reissued 56 shares and 58 shares of Class A treasury stock during fiscal years 2023 and 2022, respectively, to fund the Associate Stock Purchase Plan (as defined below) (see Note 13, Associate Benefit Plans).\nCommon Stock\nEach holder of Class A Common Stock is entitled to one vote for each share held of record on the applicable record date on all matters presented to a vote of shareholders, including the election of directors. Holders of Class A Common Stock have no cumulative voting rights or preemptive rights to purchase or subscribe for any stock or other securities and there are no redemption or sinking fund provisions with respect to such stock.\nPrior to the Reclassification (as defined below), we had an additional class of common stock outstanding: Class B Common Stock. Class B Common Stock shares were convertible into shares of Class A Common Stock on a one-to-one basis at any time at the option of the holder, and all shares of Class B Common Stock would convert into shares of Class A Common Stock on a one-to-one basis upon the sale of transfer of such shares of Class B Common Stock to any person who is not a member of the Jacobson or Gershwind families or any trust not established principally for members of the Jacobson or Gershwind families or to any person who is not an executor, administrator or personal representative of an estate of a\nmember of the Jacobson or Gershwind families. Each holder of Class B Common Stock was entitled to 10 votes per share. See Note 17, Subsequent Events for additional information related to the Reclassification.\nPreferred Stock\nThe Company has authorized 5,000 shares of preferred stock. The Board has the authority to issue the shares of preferred stock. Shares of preferred stock may have priority over Class A Common Stock with respect to dividend or liquidation rights, or both. As of September 2, 2023, there were no shares of preferred stock issued or outstanding.\nCash Dividend\nIn 2003, the Board instituted a policy of paying regular quarterly cash dividends to the Companys shareholders. This policy is reviewed regularly by the Board. The Company expects its practice of paying quarterly cash dividends on its common stock will continue, although the payment of future dividends is at the discretion of the Board and will depend upon the Companys earnings, capital requirements, financial condition and other factors.\nOn October 11, 2023, the Board declared a regular cash dividend of $0.83 per share, payable on November 28, 2023, to shareholders of record at the close of business on November 14, 2023. The dividend is expected to result in aggregate payments of $47,510, based on the number of shares outstanding at October 6, 2023.\n13. ASSOCIATE BENEFIT PLANS\nThe Company accounts for all stock-based payments in accordance with ASC Topic 718, Compensation-Stock Compensation, as amended. Stock-based compensation expense included in Operating expenses for fiscal years 2023, 2022 and 2021 was as follows:\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\n2022 August 28,\nStock options $ 101 $ 1,261 $ 2,285\nRestricted stock units (1)\n14,933 14,810 13,976\nPerformance share units (1)\n3,311 2,883 1,233\nAssociate Stock Purchase Plan 294 310 227\nTotal 18,639 19,264 17,721\nDeferred income tax benefit (4,619) (4,720) (4,324)\nStock-based compensation expense, net $ 14,020 $ 14,544 $ 13,397\n(1)Includes equity award acceleration costs associated with associate severance and separation.\n2023 Omnibus Incentive Plan\nAt the Companys annual meeting of shareholders held on January 25, 2023, the shareholders approved the MSC Industrial Direct Co., Inc. 2023 Omnibus Incentive Plan (the 2023 Omnibus Incentive Plan). The 2023 Omnibus Incentive Plan replaced the MSC Industrial Direct Co., Inc. 2015 Omnibus Incentive Plan (the Prior Plan) and, beginning January 25, 2023, all awards are granted under the 2023 Omnibus Incentive Plan. Awards under the 2023 Omnibus Incentive Plan may be made in the form of stock options, stock appreciation rights, restricted stock, restricted stock units, other share-based awards, and performance cash, performance shares or performance units. All outstanding awards under the Prior Plan will continue to be governed by the terms of the Prior Plan. Upon approval of the 2023 Omnibus Incentive Plan, the maximum aggregate number of shares of Class A Common Stock authorized to be issued under the 2023 Omnibus Incentive Plan was 2,186 shares.\nStock Options\nA summary of the Companys stock option activity for fiscal year 2023 is as follows:\nShares Weighted-Average Exercise Price\nOutstanding - beginning of year 614 $ 78.96\nGranted - -\nExercised (371) 77.31\nCanceled/Forfeited (25) 80.40\nOutstanding - end of year 218 $ 81.60\nExercisable - end of year 218 $ 81.60\nThe aggregate intrinsic value of options exercised, which represents the difference between the exercise price and the market value of Class A Common Stock measured at each individual exercise date, during fiscal years 2023, 2022 and 2021 was $4,393, $5,855 and $5,826, respectively. There were no unrecognized stock-based compensation costs related to stock options at September 2, 2023.\nStock option awards outstanding under the Companys incentive plans have been granted at exercise prices that are equal to the market value of Class A Common Stock on the date of grant. Such options generally vest over a period of four years and expire at seven years after the grant date. The Company recognizes compensation expense ratably over the vesting period, net of estimated forfeitures. The Company uses the Black-Scholes option-pricing model to estimate the fair value of stock options granted. The Company discontinued its grants of stock options in fiscal year 2020.\nStock option awards outstanding as of September 2, 2023 had exercise prices ranging from $79.60 to $83.21. As of September 2, 2023, there were 218 stock option awards outstanding and exercisable, with a weighted-average remaining contractual life of 1.7 years, a weighted-average exercise price of $81.60 and an intrinsic value of $4,380.\nPerformance Share Units\nIn fiscal year 2020, the Company began granting performance share units (PSUs) as part of its long-term share-based compensation program. PSUs cliff vest after a three-year performance period based on the achievement of specific performance goals as set forth in the applicable award agreement. Based on the extent to which the performance goals are achieved, vested shares may range from 0% to 200% of the target award amount.\nThe following table summarizes all transactions related to PSUs under the 2023 Omnibus Incentive Plan and the Prior Plan (based on target award amounts) at September 2, 2023:\nShares Weighted-Average Grant Date Fair Value\nNon-vested PSUs at the beginning of the year 88 $ 80.04\nGranted 51 82.16\nPSU adjustment (1)\n4 76.32\nVested (26) 76.32\nCanceled/Forfeited (5) 82.85\nNon-vested PSUs at the end of the year (2)\n112 $ 81.81\n(1)PSU adjustment represents the net PSUs awarded above or below their target grants resulting from the achievement of performance goals above or below the performance targets established at grant. One grant goal was achieved at 116% of its target based on fiscal year 2020 through fiscal year 2022 financial results.\n(2)Excludes approximately 12 shares of accrued incremental dividend equivalent rights on outstanding PSUs granted under the 2023 Omnibus Incentive Plan and the Prior Plan.\nThe fair value of each PSU is the closing stock price on the New York Stock Exchange (the NYSE) of Class A Common Stock on the date of grant. PSUs are expensed over the three-year performance period of each respective grant. Forfeitures of share-based awards are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. The Company uses historical data to estimate PSU forfeitures and records\nstock-based compensation expense only for PSU awards that are expected to vest. Upon vesting, subject to the achievement of specific performance goals, a portion of the PSU award may be withheld to satisfy the statutory income tax withholding obligation, and the remaining PSUs will be settled in shares of Class A Common Stock. These awards accrue dividend equivalents on the underlying PSUs (in the form of additional stock units) based on dividends declared on Class A Common Stock and these dividend equivalents are paid to the award recipient in the form of unrestricted shares of Class A Common Stock on the vesting dates of the underlying PSUs, subject to the same performance vesting requirements. The unrecognized share-based compensation cost related to the PSUs at September 2, 2023 was $3,711 and is expected to be recognized over a weighted-average period of 1.4 years.\nRestricted Stock Units\nA summary of the Companys non-vested restricted stock unit (RSU) award activity under the 2023 Omnibus Incentive Plan and the Prior Plan for fiscal year 2023 is as follows:\nShares Weighted-Average Grant Date Fair Value\nNon-vested RSUs at the beginning of the year 448 $ 79.71\nGranted 215 82.23\nVested (171) 79.23\nCanceled/Forfeited (25) 80.90\nNon-vested RSUs at the end of the year (1)\n467 $ 80.98\n(1)Excludes approximately 48 shares of accrued incremental dividend equivalent rights on outstanding RSUs granted under the 2023 Omnibus Incentive Plan and the Prior Plan.\nThe fair value of each RSU is the closing stock price on the NYSE of Class A Common Stock on the date of grant. RSUs are expensed over the vesting period of each respective grant. Forfeitures of share-based awards are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. The Company uses historical data to estimate pre-vesting RSU forfeitures and records stock-based compensation expense only for RSU awards that are expected to vest. Upon vesting, a portion of the RSU award may be withheld to satisfy the statutory income tax withholding obligation, and the remaining RSUs will be settled in shares of Class A Common Stock. These awards accrue dividend equivalents on the underlying RSUs (in the form of additional stock units) based on dividends declared on Class A Common Stock and these dividend equivalents are paid to the award recipient in the form of unrestricted shares of Class A Common Stock on the vesting dates of the underlying RSUs. The unrecognized share-based compensation cost related to the RSUs at September 2, 2023 was $24,641 and is expected to be recognized over a weighted-average period of 2.4 years.\nAssociate Stock Purchase Plan\nThe Company has established the MSC Industrial Direct Co., Inc. Amended and Restated Associate Stock Purchase Plan (the Associate Stock Purchase Plan), the terms of which qualified plan allow for eligible associates (as defined in the Associate Stock Purchase Plan) to participate in the purchase of up to a maximum of five shares of Class A Common Stock at a price equal to 90% of the closing price at the end of each stock purchase period. On January 15, 2015, the shareholders of the Company approved an increase in the authorized but unissued shares of Class A Common Stock reserved for sale under the Associate Stock Purchase Plan from 1,150 shares to 1,500 shares. As of September 2, 2023, approximately 234 shares remained reserved for issuance under the Associate Stock Purchase Plan. During fiscal years 2023 and 2022, associates purchased approximately 56 shares and 58 shares, respectively, of Class A Common Stock at an average per share price of $79.41 and $74.47, respectively.\nSavings Plan\nThe Company maintains a defined contribution plan with both a profit sharing feature and a 401(k) feature, which covers all associates who have completed at least one month of service with the Company. For fiscal years 2023, 2022 and 2021, the Company contributed $9,481, $9,019 and $7,952, respectively, to the plan. The Company contributions are discretionary.\n14. RESTRUCTURING AND OTHER COSTS\nOptimization of Company Operations and Profitability Improvement\nDuring fiscal years 2022 and 2023, the Company identified opportunities for improvements in its workforce realignment, strategy and staffing, and increased its focus on performance management, to ensure it has the right skillsets and number of associates to execute its long-term vision. As such, the Company extended voluntary and involuntary severance and separation benefits to certain associates in order to facilitate its workforce realignment. In addition, the Company engaged consultants to assist in reviewing the optimization of the Companys operations and improving profitability with executing on its Company-wide initiative, referred to as Mission Critical, through fiscal year 2023.\nThe following table summarizes restructuring and other costs:\nFor the Fiscal Years Ended\nSeptember 2,\n2023 September 3,\nConsulting-related costs $ 4,939 $ 8,188\nAssociate severance and separation costs 2,594 5,753\nEquity award acceleration costs associated with severance 404 1,728\nOther exit-related costs - 136\nTotal restructuring and other costs $ 7,937 $ 15,805\nLiabilities associated with restructuring and other costs are included in Accrued expenses and other current liabilities in the Consolidated Balance Sheets. The following table summarizes activity related to liabilities associated with restructuring and other costs:\nConsulting-related costs Associate severance and separation costs Other exit-related costs Total\nBalance as of August 28, 2021 $ 3,328 $ 367 $ 441 $ 4,136\nAdditions 8,188 5,753 136 14,077\nPayments and other adjustments (10,676) (4,246) (577) (15,499)\nBalance as of September 3, 2022 840 1,874 - 2,714\nAdditions 4,939 2,594 - 7,533\nPayments and other adjustments (5,679) (3,431) - (9,110)\nBalance as of September 2, 2023 $ 100 $ 1,037 $ - $ 1,137\n15. ASSET IMPAIRMENTS\nFiscal Year 2021 Personal Protective Equipment (PPE)-Related Inventory Write-Downs\nIn fiscal year 2021, the Company realized lower product margins as well as inventory write-downs, each as a result of the COVID-19 pandemic, primarily due to the increased supply of competing products from manufacturers and an expected inability to sell excess inventory of safety-related products ordered from manufacturers earlier in the COVID-19 pandemic. During fiscal year 2021, the Company incurred PPE-related inventory write-downs of $30,091 to reduce the carrying value of certain PPE-related inventory to its net realizable value. These inventory write-downs were reflected in the Consolidated Statement of Income for the fiscal year ended August 28, 2021. There were no such inventory write-downs during fiscal years 2022 or 2023.\nFiscal Year 2021 Impairment Loss, Net\nTo meet anticipated demand for PPE products during the COVID-19 pandemic, the Company purchased products from manufacturers outside its typical programs and under non-standard payment terms. Given the high demand for PPE products and related challenges in sourcing PPE products as well as the imperative to quickly obtain such products based on customer demand, the Company used a number of distributors and brokers to source PPE products. In September 2020,\nthe Company prepaid approximately $26,726 for the purchase of nitrile gloves to be sourced from manufacturers in Asia and experienced significant delays in obtaining possession of this PPE. The Company evaluated the potential recoverability of these assets and, as a result, recorded an impairment charge of $26,726 in the first quarter of fiscal year 2021 to reflect the fact that the Company would not ultimately obtain this PPE or recover its related prepayment. This impairment charge was reflected in the unaudited Condensed Consolidated Statement of Income during the first quarter of fiscal year 2021. During the third quarter of fiscal year 2021, the Company entered into a legal settlement agreement with a vendor and, as a result, received $20,840 of loss recovery related to this prepayment, which resulted in a net impairment charge of $5,886 for fiscal year 2021. The Company continues to pursue its legal avenues for recovery of the remaining loss.\n16. COMMITMENTS AND CONTINGENCIES\nLease Commitments\nThe Companys lease portfolio includes certain real estate (customer fulfillment centers, regional inventory centers, warehouses and manufacturing locations), automobiles and other equipment. Refer to Note 11, Leases for more information.\nLegal Proceedings\nIn the ordinary course of business, there are various claims, lawsuits and pending actions against the Company incidental to the operation of its business. Although the outcome of these matters, both individually and in aggregate, is currently not determinable, management does not expect that the ultimate costs to resolve these matters will have a material adverse effect on the Companys consolidated financial position, results of operations or liquidity.\n17. SUBSEQUENT EVENTS\nSubsequent to the fiscal year ended September 2, 2023, the Company repurchased and immediately retired 205 shares of Class A Common Stock for $19,823 under the Share Repurchase Program.\nReclassification\nIn October 2023, we completed our previously announced reclassification (the Reclassification) of the Common Stock to eliminate the Class B Common Stock, effective at the time that the Companys Amended and Restated Certificate of Incorporation was duly filed with the Secretary of State of the State of New York (the Effective Time), as contemplated by that certain Reclassification Agreement, dated as of June 20, 2023 (the Reclassification Agreement), with Mitchell Jacobson, Erik Gershwind, other members of the Jacobson / Gershwind family and certain entities affiliated with the Jacobson / Gershwind family (collectively, the Jacobson / Gershwind Family Shareholders). Pursuant to the Reclassification, each share of Class B Common Stock issued and outstanding immediately prior to the Effective Time was reclassified, exchanged and converted into 1.225 shares of Class A Common Stock. The issuance of Class A Common Stock in connection with the Reclassification was registered under the Securities Act of 1933, as amended, pursuant to the Company's Registration Statement on Form S-4 (File No. 333-273418).\nAs contemplated by the Reclassification Agreement, a number of corporate governance changes were implemented, including the following:\nthe Jacobson / Gershwind Family Shareholders have the right to designate two individuals for nomination for election to the Board so long as the Jacobson / Gershwind Family Shareholders own 10% or more of the issued and outstanding shares of Class A Common Stock and to designate one individual for nomination for election to the Board so long as the Jacobson / Gershwind Family Shareholders own less than 10% but more than 5% of the issued and outstanding shares of Class A Common Stock;\nthe Jacobson / Gershwind Family Shareholders have each granted an irrevocable proxy authorizing the Company to vote such pro rata portion of shares of Class A Common Stock beneficially owned by the Jacobson / Gershwind Family Shareholders or their permitted transferees in excess of 15% of the issued and outstanding shares of Class A Common Stock in proportion to the votes of other holders (i.e., excluding any Jacobson / Gershwind Family Shareholders and their permitted transferees) entitled to vote and that do in fact vote;\ncertain standstill and lock-up provisions for the Jacobson / Gershwind Family Shareholders;\nthe transition of the approval standard for certain significant transactions (including mergers, asset sales, share exchanges and dissolution) from a two-thirds supermajority to a majority of the issued and outstanding shares of Class A Common Stock entitled to vote thereon; and\nthe transition to a majority of the votes cast standard for any election of directors that is not a contested election. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of the Companys management, including the Companys Chief Executive Officer and Chief Financial Officer, the Company evaluated the effectiveness of the Companys disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act) as of September 2, 2023. Based on that evaluation, the Companys Chief Executive Officer and Chief Financial Officer concluded that, as of September 2, 2023, such disclosure controls and procedures were effective in ensuring that information required to be disclosed by the Company in reports that it files or submits under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and (ii) accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Annual Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. The Companys internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. The Companys internal control over financial reporting includes those policies and procedures that:\n(i)pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Companys assets;\n(ii)provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of the Companys management and directors; and\n(iii)provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect all misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of September 2, 2023. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013 Framework).\nBased on this assessment, management determined that the Company maintained effective internal control over financial reporting as of September 2, 2023.\nAttestation Report of the Independent Registered Public Accounting Firm\nThe effectiveness of the Companys internal control over financial reporting as of September 2, 2023 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their report which appears in this Item under the heading Report of Independent Registered Public Accounting Firm.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting identified in connection with the evaluation required by Rules 13a-15(d) and 15d-15(d) under the Exchange Act that occurred during the quarter ended September 2, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of MSC Industrial Direct Co., Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited MSC Industrial Direct Co., Inc.s internal control over financial reporting as of September 2, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, MSC Industrial Direct Co., Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of September 2, 2023, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 2, 2023 and September 3, 2022, the related consolidated statements of income, comprehensive income, shareholders equity and cash flows for each of the three years in the period ended September 2, 2023, and the related notes and schedule and our report dated October 25, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nJericho, New York\nOctober 25, 2023 ITEM 9B. OTHER INFORMATION.\nInsider Trading Arrangements\nOn August 22, 2023, Kristen Actis-Grande, the Companys Executive Vice President and Chief Financial Officer, adopted a trading plan intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act. Ms. Actis-Grandes trading plan allows for the sale of the shares of Class A Common Stock received upon the vesting of 1,838 performance share units and 3,470 restricted stock units. Ms. Actis-Grandes trading plan will expire on August 22, 2024.\nNone of our other directors or officers (as defined in Rule 16a-1(f) under the Exchange Act) adopted, modified or terminated a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement (as each term is defined in Item 408 of Regulation S-K) during the quarter ended September 2, 2023.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III. ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nInformation called for by Item 10 is set forth under the headings Election of Directors, Corporate Governance and Information About Our Executive Officers in the definitive proxy statement for the Companys 2024 Annual Meeting of Shareholders (the Proxy Statement), which is incorporated herein by this reference.\nThe Company has adopted a Code of Ethics (the Code of Ethics), which is intended to qualify as a code of ethics within the meaning of Item 406 of Regulation S-K of the Exchange Act. The Code of Ethics applies to the Companys principal executive officer, principal financial officer, principal accounting officer and persons performing similar functions. The Code of Ethics is available on the investor relations portion of the Companys website, https://investor.mscdirect.com.\nThe Company will disclose information pertaining to any amendment to, or waiver from, the provisions of the Code of Ethics that apply to the Companys principal executive officer, principal financial officer, principal accounting officer or persons performing similar functions and that relate to any element of the Code of Ethics enumerated in the SEC rules and regulations by posting this information on the investor relations portion of the Companys website, https://investor.mscdirect.com. The information on the Companys website, or linked to or from the Companys website, is not incorporated by reference into, and does not constitute a part of, this Report or any other documents the Company files with, or furnishes to, the SEC. ITEM 11. EXECUTIVE COMPENSATION.\nInformation called for by Item 11 is set forth under the headings Compensation Discussion and Analysis, Executive Compensation, Corporate Governance and Compensation Committee Report in the Proxy Statement, which is incorporated herein by this reference. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nInformation called for by Item 12 is set forth under the headings Security Ownership of Certain Beneficial Owners and Management and Equity Compensation Plan Information in the Proxy Statement, which is incorporated herein by this reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nInformation called for by Item 13 is set forth under the heading Corporate Governance in the Proxy Statement, which is incorporated herein by this reference. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nInformation called for by Item 14 is set forth under the heading Ratification of the Appointment of Independent Registered Public Accounting Firm in the Proxy Statement, which is incorporated herein by this reference.\nPART IV. ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\n(a)(1) Index to Financial Statements\nFinancial statements filed as a part of this Report are listed on the Index to Consolidated Financial Statements at page 36 herein.\n(a)(2) Financial Statement Schedules\nFor the three fiscal years ended September 2, 2023.\nPage\nSchedule II-Valuation and Qualifying Accounts S-1\nAll other schedules have been omitted because the information is not applicable or is presented in the Consolidated Financial Statements or Notes thereto.\n(a)(3) Exhibits\nReference is made to Item 15(b) below.\n(b) Exhibits\nThe Exhibit Index, which immediately precedes the signature page, is incorporated by reference into this Report.\n(c) Financial Statement Schedules\nReference is made to Item 15(a)(2) above.\nITEM 16. FORM 10-K SUMMARY.\nNone.\nEXHIBIT INDEX\nExhibit\nNo. Description\n3.1 Restated Certificate of Incorporation of the Registrant (incorporated by reference to Exhibit 3.1 to the Registrants Current Report on Form 8-K filed on October 5, 2023 (File No. 001-14130)).\n3.2 Third Amended and Restated By-Laws of the Registrant (incorporated by reference to Exhibit 3.2 to the Registrants Current Report on Form 8-K filed on October 5, 2023 (File No. 001-14130)).\n4.1 Description of the Registrants Securities (incorporated by reference to Exhibit 99.2 to the Registrants Current Report on Form 8-K filed on October 5, 2023 (File No. 001-14130)).\n4.2 Specimen Class A Common Stock Certificate.(P)\n4.3 Amended and Restated Note Purchase Agreement, dated April 14, 2017, by and among the Registrant and the noteholders named therein (incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed on April 18, 2017 (File No. 001-14130)).\n4.4 Form of 2.90% Senior Note, Series B, due July 28, 2026 (included in Exhibit 4.3).\n10.1 Credit Agreement, dated as of April 14, 2017, by and among the Registrant, the several banks and other financial institutions or entities from time to time parties thereto, and JPMorgan Chase Bank, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on April 18, 2017 (File No. 001-14130)).\n10.2 Amendment No. 1 to Credit Agreement, dated as of August 24, 2021, by and among the Registrant, the subsidiary guarantors party thereto, the lenders and issuing lenders party thereto, and JPMorgan Chase Bank, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on August 30, 2021 (File No. 001-14130)).\n10.3 Amendment No. 2 to Credit Agreement, dated as of May 31, 2023, by and between the Registrant and JPMorgan Chase Bank, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 to the Registrants Quarterly Report on Form 10-Q for the quarter ended June 3, 2023 (File No. 001-14130)).\n10.4 Note Purchase and Private Shelf Agreement, dated January 12, 2018, by and between the Registrant and MetLife Investment Advisors, LLC and/or one or more of its affiliates or related funds, as purchasers thereunder (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on January 17, 2018 (File No. 001-14130)).\n10.5 Note Purchase and Private Shelf Agreement, dated January 12, 2018, by and between the Registrant and PGIM, Inc. and/or one or more of its affiliates or related funds, as purchasers thereunder (incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed on January 17, 2018 (File No. 001-14130)).\n10.6 Receivables Purchase Agreement, dated as of December 19, 2022, by and among the Registrant, as initial master servicer, MSC A/R Holding Co., LLC, as seller, Wells Fargo Bank, National Association, as administrative agent, and the purchasers from time to time party thereto (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on December 20, 2022 (File No. 001-14130)).\n10.7 Receivables Sale Agreement, dated as of December 19, 2022, by and between MSC A/R Holding Co., LLC, as SPE, and Sid Tool Co., Inc., as originator (incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed on December 20, 2022 (File No. 001-14130)).\n10.8 MSC Industrial Direct Co., Inc. Amended and Restated Associate Stock Purchase Plan (incorporated by reference to Exhibit 10.1 to the Registrants Quarterly Report on Form 10-Q for the quarter ended February 27, 2021 (File No. 001-14130)).\n10.9 MSC Industrial Direct Co., Inc. 2005 Omnibus Incentive Plan, as amended through November 13, 2014 (incorporated by reference to Exhibit 10.2 to the Registrants Quarterly Report on Form 10-Q for the quarter ended November 29, 2014 (File No. 001-14130)).\n10.10 Form of Non-Qualified Stock Option Agreement under the MSC Industrial Direct Co., Inc. 2005 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.3 to the Registrants Quarterly Report on Form 10-Q for the quarter ended February 26, 2011 (File No. 001-14130)).\n10.11 Form of First Amendment to Non-Qualified Stock Option Agreement under the MSC Industrial Direct Co., Inc. 2005 Omnibus Incentive Plan (2013 grant) (incorporated by reference to Exhibit 10.1 to the Registrants Quarterly Report on Form 10-Q for the quarter ended May 30, 2020 (File No. 001-14130)).\nExhibit\nNo. Description\n10.12 Form of First Amendment to Non-Qualified Stock Option Agreement under the MSC Industrial Direct Co., Inc. 2005 Omnibus Incentive Plan (2014 grant) (incorporated by reference to Exhibit 10.2 to the Registrants Quarterly Report on Form 10-Q for the quarter ended May 30, 2020 (File No. 001-14130)).\n10.13 MSC Industrial Direct Co., Inc. 2015 Omnibus Incentive Plan (incorporated by reference to Exhibit 99.01 to the Registrants Registration Statement on Form S-8 filed on January 15, 2015 (File No. 333-201522)).\n10.14 Form of Non-Qualified Stock Option Agreement under the MSC Industrial Direct Co., Inc. 2015 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.3 to the Registrants Quarterly Report on Form 10-Q for the quarter ended November 28, 2015 (File No. 001-14130)).\n10.15 Form of Restricted Stock Unit Agreement under the MSC Industrial Direct Co., Inc. 2015 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.4 to the Registrants Quarterly Report on Form 10-Q for the quarter ended November 28, 2015 (File No. 001-14130)).\n10.16 Form of Performance Share Unit Award Agreement under the MSC Industrial Direct Co., Inc. 2015 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.1 to the Registrants Quarterly Report on Form 10-Q for the quarter ended November 30, 2019 (File No. 001-14130)).\n10.17 MSC Industrial Direct Co., Inc. 2023 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on January 26, 2023 (File No. 001-14130)).\n10.18 Form of Restricted Stock Unit Agreement for Non-Executive Directors under the MSC Industrial Direct Co., Inc. 2023 Omnibus Incentive Plan.*\n10.19 MSC Executive Severance Plan (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on October 27, 2016 (File No. 001-14130)).\n10.20 MSC Industrial Direct Co., Inc. Executive Change in Control Severance Plan (incorporated by reference to Exhibit 10.29 to the Registrants Annual Report on Form 10-K for the fiscal year ended September 1, 2018 (File No. 001-14130)).\n10.21 Relocation Policy (incorporated by reference to Exhibit 10.02 to the Registrants Current Report on Form 8-K filed on March 30, 2011 (File No. 001-14130)).\n10.22 Relocation Reimbursement Agreement & Policy Acknowledgment Form (incorporated by reference to Exhibit 10.03 to the Registrants Current Report on Form 8-K filed on March 30, 2011 (File No. 001-14130)).\n10.23 Form of Director and Executive Officer Indemnification Agreement (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on January 25, 2016 (File No. 001-14130)).\n10.24 Summary of Non-Executive Directors Compensation (incorporated by reference to Exhibit 10.12 to the Registrants Annual Report on Form 10-K for the fiscal year ended September 1, 2018 (File No. 001-14130)).\n10.25 Board Adviser Agreement, effective as of January 29, 2020, between the Registrant and Roger Fradin (incorporated by reference to Exhibit 10.1 to the Registrants Quarterly Report on Form 10-Q for the quarter ended February 29, 2020 (File No. 001-14130)).\n10.26 Kristen Actis-Grande Offer Letter, dated July 17, 2020 (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on August 31, 2020 (File No. 001-14130)).\n10.27 Transition Agreement and General Release, dated September 7, 2022, by and between the Registrant and Douglas E. Jones (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K/A filed on September 7, 2022 (File No. 001-14130)).\n10.28 Martina McIsaac Offer Letter, dated July 1, 2022 (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on September 16, 2022 (File No. 001-14130)).\n10.29 Reclassification Agreement, dated as of June 20, 2023, by and among the Registrant and the shareholders listed therein (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on June 21, 2023 (File No. 001-14130)).\n10.30 Registration Rights Agreement, dated as of October 4, 2023, by and among the Registrant and the shareholders party thereto (incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on October 5, 2023 (File No. 001-14130)).\n19.1 MSC Industrial Direct Co., Inc. Insider Trading Policy.*\nExhibit\nNo. Description\n21.1 Subsidiaries of the Registrant.*\n23.1 Consent of Ernst & Young LLP.*\n31.1 Certification of Principal Executive Officer pursuant to Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n31.2 Certification of Principal Financial Officer pursuant to Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n32.1 Certification of Principal Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.**\n32.2 Certification of Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.**\n97.1 MSC Industrial Direct Co., Inc. Executive Incentive Compensation Recoupment Policy.*\n101.INS Inline XBRL Instance Document.*\n101.SCH Inline XBRL Taxonomy Extension Schema Document.*\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document.*\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document.*\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document.*\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document.*\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).*\n(P) Filed as an exhibit to the registrants Registration Statement on Form S-1, as amended (File No. 33-98832). This exhibit was originally filed in paper format. Accordingly, a hyperlink has not been provided.\n* Filed herewith.\n** Furnished herewith.\nIndicates a management contract or compensatory plan or arrangement.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMSC INDUSTRIAL DIRECT CO., INC.\nBy: /s/ ERIK GERSHWIND\nErik Gershwind\nPresident and Chief Executive Officer\n(Principal Executive Officer)\nDated: October 25, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ MITCHELL JACOBSON\nNon-Executive Chairman of the Board of Directors October 25, 2023\nMitchell Jacobson\n/s/ ERIK GERSHWIND\nPresident and Chief Executive Officer\nOctober 25, 2023\nErik Gershwind and Director (Principal Executive Officer)\n/s/ KRISTEN ACTIS-GRANDE\nExecutive Vice President and Chief\nOctober 25, 2023\nKristen Actis-Grande Financial Officer\n(Principal Financial Officer and Principal Accounting Officer)\n/s/ LOUISE GOESER\nDirector October 25, 2023\nLouise Goeser\n/s/ MICHAEL KAUFMANN\nDirector October 25, 2023\nMichael Kaufmann\n/s/ STEVEN PALADINO\nDirector October 25, 2023\nSteven Paladino\n/s/ PHILIP PELLER\nDirector October 25, 2023\nPhilip Peller\n/s/ RAHQUEL PURCELL\nDirector October 25, 2023\nRahquel Purcell\n/s/ RUDINA SESERI\nDirector October 25, 2023\nRudina Seseri\nMSC INDUSTRIAL DIRECT CO., INC.\nSCHEDULE II VALUATION AND QUALIFYING ACCOUNTS\n(In thousands)\nDescription Balance at Beginning of Year Charged to Costs and Expenses Charged to Other Accounts Deductions (1)\nBalance at End of Year\nDeducted from asset accounts:\nFor the fiscal year ended August 28, 2021 Allowance for credit losses (2)\n$ 18,249 $ 8,181 $ - $ 8,014 $ 18,416\nDeducted from asset accounts:\nFor the fiscal year ended September 3, 2022 Allowance for credit losses (2)\n$ 18,416 $ 9,806 $ - $ 7,451 $ 20,771\nDeducted from asset accounts:\nFor the fiscal year ended September 2, 2023 Allowance for credit losses (2)\n$ 20,771 $ 10,275 $ - $ 8,299 $ 22,747\n(1)Comprised of uncollected accounts charged against the allowance.\n(2)Included in accounts receivable.\nS-1"
}