{
    "cik": "1005276",
    "company": "MOHEGAN TRIBAL GAMING AUTHORITY",
    "filing_type": "10-K",
    "filing_date": "2022-12-21",
    "period_of_report": "2022-09-30",
    "sic": "7011",
    "state_of_inc": null,
    "state_location": "CT",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1005276/0001005276-22-000072-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1005276/000100527622000072/mtga-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1005276/0001005276-22-000072.txt",
    "filename": "1005276_10K_2022_0001005276-22-000072.htm",
    "content": "Item 1.Business.\nOur Company\nThe Mohegan Tribal Gaming Authority (the Company, we, us or our) was established in July 1995 by the Mohegan Tribe (the Mohegan Tribe), a federally-recognized Indian tribe with an approximately 595-acre reservation situated in southeastern Connecticut, adjacent to Uncasville, Connecticut. We have the exclusive authority to conduct and regulate gaming activities for the Mohegan Tribe on tribal lands and the non-exclusive authority to conduct such activities elsewhere. The Indian Gaming Regulatory Act of 1988 (IGRA) permits federally-recognized Indian tribes to conduct full-scale casino gaming operations on tribal lands, subject to certain conditions, and the Mohegan Compact, as amended, permits the Mohegan Tribe to conduct casino and sportsbook operations on its tribal lands in Uncasville, Connecticut, along with online casino gaming and sports wagering (iGaming) in the state of Connecticut and on its tribal lands. We are governed and overseen by a nine-member Management Board, whose members also comprise the Mohegan Tribal Council, the governing body of the Mohegan Tribe.\nWe have three major business functions. First, we are primarily engaged in the ownership, operation and development of integrated entertainment facilities. In conjunction with the Mohegan Tribe, we also evaluate and pursue various business opportunities in an effort to diversify our revenue base and cash flow streams. These opportunities primarily consist of development, consulting and/or management of, investment in or ownership of, additional gaming and entertainment operations through direct investments, acquisitions, joint venture arrangements and loan or financial/credit support transactions. We currently own two facilities in the United States and operate or manage five other facilities in the United States and Canada. We are also currently developing a facility in South Korea, the Inspire Entertainment Resort located adjacent to the Incheon International Airport (Inspire Korea). Second, we have the exclusive authority to direct the operation, management and promotion of gaming enterprises and all related activities for the Mohegan Tribe on tribal lands. Third, we regulate gaming activities for the Mohegan Tribe on tribal lands. Our Management Board has appointed an independent Director of Regulation who is responsible for the regulation of gaming activities at Mohegan Sun and on its tribal lands.\nRefer to Mohegan Tribe of Indians of Connecticut below and Part III. Item 10. Directors, Executive Officers and Corporate Governance to this Annual Report on Form 10-K for additional information.\nOur principal executive office and mailing address is One Mohegan Sun Boulevard, Uncasville, CT 06382. Our telephone number is (860) 862-8000. Our corporate website address is www.mohegangaming.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to those reports, as well as any other information filed or furnished pursuant to Section 13(a) or 15(d) under the Exchange Act, are made available free of charge on our corporate website as soon as reasonably practicable after they are electronically filed with, or furnished to, the Securities and Exchange Commission. We intend to use our corporate website as a regular means of disclosing material non-public information and for complying with disclosure obligations under Regulation FD promulgated by the Securities and Exchange Commission. Such disclosures will be included on our corporate website under the headings News or Financial Information. Any updates to the list of social media channels we use to announce material information will be posted on the News or Financial Information pages of our corporate website. Accordingly, investors should monitor such portions of our corporate website and social media channels, in addition to following our press releases, Securities and Exchange Commission filings, public conference calls and webcasts.\nImpact of the COVID-19 Pandemic\nIn March 2020, the World Health Organization declared the outbreak of COVID-19 a global pandemic and the United States federal government declared it a national emergency. The spread of COVID-19 has affected most segments of the global economy, including our operations. In March 2020, we temporarily suspended operations at our properties in the United States and Canada to ensure the health and safety of our employees, customers and the surrounding communities in which we operate, consistent with directives from various governmental bodies. All of our properties in the United States were reopened by July 2020. Our properties in Canada reopened in July 2021, but were temporarily closed again from January 5, 2022 through January 30, 2022, due to a resurgence of COVID-19 at that time.\nWhile we are operating at full capacity as of the filing of this Annual Report on Form 10-K, COVID-19 has had a significant impact on our operations, the full extent of which depends on future developments which are highly uncertain and cannot be predicted with confidence. Such developments include the following:\nthe duration of COVID-19 or the extent of any resurgence or variants of COVID-19 in areas where we operate or where our customers are located;\nthe manner in which our customers, suppliers and other third parties respond to COVID-19, including the perception of safety and health measures we implemented;\nnew information that may emerge concerning the severity of COVID-19 and the actions to contain or treat it;\ngeneral, local or national economic conditions; and\nconsumer confidence.\nStrategy\nOur overall strategy is to: (i) drive incremental profit through gaming and non-gaming initiatives, most notably the enhancement of entertainment amenities at our existing integrated resorts and in our core markets; (ii) diversify our business interests within the integrated resort and entertainment industry, both domestically and internationally; and (iii) enhance our credit profile by reducing leverage through improved operational efficiency, increased financial discipline and high return investments, as well as revenue diversification efforts.\nDomestically, we developed Mohegan Sun into a full-scale entertainment and destination resort, and we further strengthened our presence in the Northeastern United States gaming market with the acquisition of Mohegan Pennsylvania. Our domestic gaming portfolio also includes the development and management of ilani Casino Resort, the management of Resorts Casino Hotel and the operation of Mohegan Casino Las Vegas. In addition, we have taken significant steps in our diversification efforts internationally with the acquisition of the Niagara Resorts and the current development of Inspire Korea. We also recently launched our new Mohegan Digital division (Mohegan Digital) to provide iGaming solutions to our customers and to capitalize on the growth and expansion of the iGaming industry, both domestically and internationally.\nOur Properties\nProperty Location Opening Year Casino Square Footage Slot Machines Table Games Hotel Rooms Food & Beverage and Retail Outlets Primary Entertainment Venue (Seats)\nOwned\nMohegan Sun Uncasville, CT 1996 310,000 3,650 250 1,562 83 10,000\nMohegan Pennsylvania Wilkes-Barre, PA 2006 95,000 1,700 65 237 18 1,500\nInspire Korea (1)\nIncheon, South Korea 2023 260,000 700 150 1,275 70 15,000\nOperated/Managed\nFallsview Casino Resort Niagara Falls, ON 2004 160,000 3,500 120 372 41 5,000\nCasino Niagara Niagara Falls, ON 1996 70,000 1,400 30 N.A. 2 N.A.\nMohegan Casino Las Vegas Las Vegas, NV 2021 60,000 600 45 1,504 22 4,500\nilani Casino Resort La Center, WA 2017 110,000 2,750 75 N.A. 15 2,550\nResorts Casino Hotel (2)\nAtlantic City, NJ 1978 80,000 1,350 75 942 22 1,250\n1,145,000 15,650 810 5,892 273 39,800\n_________\n(1) Estimated.\n(2)10% ownership.\nN.A. Not Applicable.\nMohegan Sun\nMohegan Sun is located on an approximately 196-acre site on the Mohegan Tribe's reservation overlooking the Thames River with direct access from Interstate 395 and Connecticut Route 2A. Mohegan Sun is approximately 125 miles from New York City, New York, and approximately 100 miles from Boston, Massachusetts. The facility is one of two authorized gaming and entertainment facilities in the state of Connecticut and competes primarily with gaming operations in Massachusetts, Rhode Island and New York.\nMohegan Pennsylvania\nMohegan Pennsylvania is located on an approximately 400-acre site in Wilkes-Barre, Pennsylvania, and features live harness racing. The facility is located off of Interstate 81 and is approximately eight miles from the Wilkes-Barre/Scranton International Airport. Mohegan Pennsylvania is one of 16 gaming and entertainment facilities in the state of Pennsylvania and competes primarily with facilities in Bethlehem and Mount Pocono.\nInspire Korea\nIn February 2016, we were awarded pre-approval for a gaming license to be issued upon completion of the construction of Inspire Korea in South Korea. This license would permit gaming only by holders of non-Korean passports. In August 2016, we\nentered into an agreement with the Incheon International Airport Authority for the long-term lease and development of approximately 4.4 million square meters of land located directly adjacent to Terminal 2 of the Incheon International Airport. The integrated entertainment resort phase of Inspire Korea is planned to open in late 2023, with the casino anticipated to open in January 2024. Inspire Korea will compete primarily with another casino resort located in Incheon and several other smaller casino-only operations located in downtown Seoul.\nNiagara Resorts\nWe operate the Niagara Resorts under a Casino Operating and Services Agreement. The Niagara Resorts include Fallsview Casino Resort, Casino Niagara and the OLG Stage at Fallsview Casino, all in Niagara Falls, Canada. Fallsview Casino Resort, which overlooks the iconic Horseshoe Falls, and Casino Niagara are the only two gaming and entertainment facilities in Niagara Falls, Canada. The Niagara Resorts compete primarily with facilities in Toronto, Ontario and Niagara Falls, New York.\nMohegan Casino Las Vegas\nWe operate Mohegan Casino Las Vegas, a more than 60,000-square-foot gaming facility at Virgin Hotels Las Vegas, in Las Vegas, Nevada. The integrated resort, including Mohegan Casino Las Vegas, competes primarily with resorts and casinos in Las Vegas.\nilani Casino Resort\nWe developed and currently operate ilani Casino Resort in Clark County, Washington, a gaming and entertainment facility owned by the federally-recognized Cowlitz Indian Tribe and the Cowlitz Tribal Gaming Authority. ilani Casino Resort is located approximately 16 miles north of Portland with direct access to Interstate 5.\nResorts Casino Hotel\nWe manage Resorts Casino Hotel and own 10% of the casino's holding company and its subsidiaries, including those conducting or licensing iGaming and retail sports wagering in the state of New Jersey. Resorts Casino Hotel, the first casino hotel in Atlantic City, New Jersey, opened in 1978, becoming the first legal casino outside of the state of Nevada. Resorts Casino Hotel is one of nine casinos operating in Atlantic City and competes primarily with resorts and casinos in Atlantic City, New Jersey, Pennsylvania and New York.\nSeasonality\nThe gaming markets in the Northeastern United States and Niagara Falls, Canada, are seasonal in nature, with peak gaming activities often occurring during the months of May through August.\nMohegan Tribe of Indians of Connecticut\nGeneral\nThe Mohegan Tribe has lived in a cohesive community for hundreds of years in what is today southeastern Connecticut. The Mohegan Tribe became a federally-recognized Indian tribe in 1994 and currently has approximately 2,300 members, of which approximately 1,500 are of voting age.\nGovernance of the Mohegan Tribe\nThe Mohegan Tribe's Constitution provides for the governance of the Mohegan Tribe by the Mohegan Tribal Council, consisting of nine members, and a Council of Elders, consisting of seven members. Legislative and executive powers of the Mohegan Tribe are vested in the Mohegan Tribal Council, with the exception of enrollment of tribal members and cultural duties, which are vested in the Council of Elders. The members of the Mohegan Tribal Council also serve as members and officers on our Management Board. The registered voters of the Mohegan Tribe elect all members of the Mohegan Tribal Council. Pursuant to the Mohegan Tribe's Constitution, the members of the Mohegan Tribal Council are elected on a four-year staggered term basis. The terms for four members of the Mohegan Tribal Council expire in October 2023, while the terms for the remaining five members expire in October 2025. Members of the Mohegan Tribal Council must be at least 21 years of age when elected.\nThe Mohegan Tribe may amend provisions of its Constitution that established us and the Gaming Disputes Court, which is described below. Such an amendment requires the approval of two-thirds of the members of the Mohegan Tribal Council and must be ratified by registered voters of the Mohegan Tribe by a two-thirds majority of all votes cast, with at least a 40% participation of registered voters of the Mohegan Tribe. In addition, the Mohegan Tribe's Constitution currently prohibits the Mohegan Tribe from enacting any law that would impair the obligations of contracts entered into in furtherance of the development, construction, operation and promotion of gaming on tribal lands. An amendment to this provision requires the affirmative vote of 75% of registered voters of the Mohegan Tribe. Prior to the enactment of any such amendment by the Mohegan Tribal Council, any non-tribal party would have the opportunity to seek a ruling from the Appellate Branch of the Gaming Disputes Court that the proposed amendment would constitute an impermissible impairment of contract.\nGaming Disputes Court\nUnder the Constitution and laws of the Mohegan Tribe, the Mohegan Tribe has established a Gaming Disputes Court, which is vested with exclusive jurisdiction over all disputes related to gaming and associated facilities on tribal lands, including appeals from certain final administrative agency decisions.\nThe Gaming Disputes Court has jurisdiction over all disputes or controversies related to gaming between any person or entity and us or the Mohegan Tribe. The Gaming Disputes Court also has jurisdiction over certain appeals arising out of tribal agency regulatory powers, including licensing actions. The Mohegan Tribe has adopted the substantive law of the State of Connecticut as the applicable law of the Gaming Disputes Court to the extent that such law is not in conflict with Mohegan Tribal Law. Also, the Mohegan Tribe has adopted all of Connecticut's rules of civil and appellate procedure and professional and judicial conduct to govern the Gaming Disputes Court.\nJudges of the Gaming Disputes Court are chosen by the Mohegan Tribal Council from a publicly available list of eligible retired federal judges and Connecticut Attorney Trial Referees, who are appointed by the Chief Justice of the Connecticut Supreme Court, each of whom must remain licensed to practice law in Connecticut.\nGovernment Regulation\nGeneral\nOperations at our properties and iGaming opportunities are subject to varying federal, state, provincial, local and tribal laws and regulations. The following description of the regulatory environment in which gaming takes place at our properties is only a summary and not a complete recitation of all applicable regulations and does not encompass gaming jurisdictions where we manage facilities for third parties. Moreover, since these regulatory environments are susceptible to changes in public policy considerations, it is impossible to predict how particular provisions will be interpreted, from time to time, or whether they will remain intact. Changes in such regulations could have a material adverse impact on our operations. Refer to Part I. Item 1A. Risk Factors.\nIn connection with the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, set forth below are cautionary statements identifying important factors that could cause actual events or results to differ materially from any forward-looking statements made by or on behalf of us, whether oral or written. We wish to ensure that any forward-looking statements are accompanied by meaningful cautionary statements in order to maximize to the fullest extent possible the protections of the safe harbor established in the Private Securities Litigation Reform Act of 1995. Accordingly, any such statements are qualified in their entirety by reference to, and are accompanied by, the following important factors that could cause actual events or results to differ materially from our forward-looking statements. Refer also to Cautionary Note Regarding Forward-Looking Statements on page 1 to this Annual Report on Form 10-K.\nRisks Related to Our Debt\nWe have a substantial amount of outstanding debt which could adversely affect our financial condition\nWe currently have and will continue to have a substantial amount of outstanding debt. As of September 30, 2022, our debt totaled $2.5 billion.\nThis indebtedness could have significant adverse effects on our business. Such adverse effects could include, without limitation, the following:\nmaking it more difficult for us to satisfy our debt service obligations;\nincreasing our vulnerability to adverse economic, industry and competitive conditions;\nrequiring us to dedicate a substantial portion of our cash flows from operations towards debt repayment, thereby reducing the availability of our cash flows to fund working capital requirements, capital expenditures and other general operating requirements;\nlimiting our flexibility in planning for, or reacting to, changes in our business and the gaming industry, which may place us at a disadvantage compared to our competitors with stronger liquidity positions, thereby negatively affecting our results of operations and ability to meet our financial obligations;\nrestricting us from exploring or taking advantage of new business opportunities;\nplacing us at a competitive disadvantage compared to our competitors with less debt; and\nlimiting, along with the financial and other restrictive covenants related to our debt, our ability to borrow additional funds for working capital requirements, capital expenditures, acquisitions, investments, debt service obligations, execution of our business strategy or other general operating requirements on satisfactory terms or at all.\nIn addition, our senior secured credit facility and the indentures governing our existing notes contain, and the agreements evidencing or governing other future indebtedness may contain, restrictive covenants that limit our ability to engage in activities that may be in our best interests. Our failure to comply with such covenants could result in an event of default which, if not cured or waived, could result in the acceleration of the required repayment of some or all of our outstanding debt.\nEconomic volatility affects our operations and our debt\nEconomic downturns or contractions may adversely affect visitation and spending at our properties which would negatively impact our results of operations and cash flows. The credit environment could also impact our ability to borrow in the future. Additional financing or refinancing of our existing debt may not be available and, if available, may not be available on economically favorable terms. Furthermore, increases in our leverage could lead to deterioration in our credit ratings. A reduction in our credit ratings, regardless of the cause, could also limit our ability to obtain additional financing and/or increase our cost of obtaining such financing. We can provide no assurance that we will be able to access the capital markets at financially economical interest rates, which could negatively affect our business. While we believe that we will continue to have adequate credit available to meet our business needs, we can provide no assurance in this regard.\nA substantial portion of our debt accrues interest at variable rates\nWe are exposed to risks from tightening credit markets and increasing interest rates through interest payable on our variable rate debt, such as our credit facilities. As of September 30, 2022, approximately 7% of our total debt was variable rate debt. While we may choose to mitigate the effect of fluctuations in interest rates through interest rate hedging transactions, we can provide no assurance that we will enter any such transactions or that any such transactions would adequately mitigate the risks of fluctuations in interest rates.\nA substantial portion of our debt is denominated in currencies other than U.S. dollars\nWe are exposed to risks from fluctuations in foreign currency exchange rates since a substantial portion of our debt is denominated in currencies other than U.S. dollars, including borrowings under our credit facilities in Canada and South Korea. Fluctuations in foreign currency exchange rates would affect the U.S. dollar value of principal, interest and other amounts related to such debt. As of September 30, 2022, we had $90.1 million and $362.5 million in debt that were denominated in Canadian dollars and Korean won, respectively. While we may choose to mitigate the effect of fluctuations in foreign currency exchange rates through foreign currency hedging transactions, we can provide no assurance that we will enter any such transactions or that any such transactions would adequately mitigate the risks of fluctuations in foreign currency exchange rates.\nWe, the Mohegan Tribe and certain of our subsidiaries may not be subject to federal bankruptcy laws, which could impair the ability of creditors to participate in the realization of our assets or the restructuring of related liabilities if we are unwilling or unable to meet our debt service obligations\nWe, the Mohegan Tribe and our wholly-owned subsidiaries that are tribal entities may or may not be subject to, or permitted to seek protection under, federal bankruptcy laws since an Indian tribe and we, as an instrumentality of the Mohegan Tribe, may or may not be eligible to be a debtor under the United States Bankruptcy Code. Therefore, our creditors may not be able to seek liquidation of our or any of the other tribal entities' assets or other action under federal bankruptcy laws. Also, the Mohegan Tribes Constitution and laws have established a special court which is vested with exclusive jurisdiction, in the absence of a contractual agreement otherwise, over all disputes related to gaming and associated facilities on tribal lands, including appeals from certain final administrative agency decisions, known as the Gaming Disputes Court. The Gaming Disputes Court may lack powers typically associated with a federal bankruptcy court, such as the power to non-consensually alter liabilities, direct the priority of creditors' claims and liquidate certain assets. The Gaming Disputes Court is a court of limited jurisdiction and may not have jurisdiction over all creditors of ours or our subsidiaries or over all of the territories in which we and our subsidiaries carry on business.\nRisks Related to Our Business\nThe COVID-19 pandemic has had a material adverse impact on our businesses, results of operations, liquidity and financial condition\nIn March 2020, the World Health Organization declared the outbreak of COVID-19 a global pandemic and the United States federal government declared it a national emergency. The spread of COVID-19 has affected most segments of the global economy, including our operations. In March 2020, we temporarily suspended operations at our properties in the United States and Canada to ensure the health and safety of our employees, customers and the surrounding communities in which we operate, consistent with directives from various governmental bodies. All of our properties in the United States were reopened by July 2020. Our properties in Canada reopened in July 2021, but were temporarily closed again from January 5, 2022 through January 30, 2022, due to a resurgence of COVID-19 at that time.\nWhile we are operating at full capacity as of the filing of this Annual Report on Form 10-K, COVID-19 has had a significant impact on our operations and on our projects under development, including Inspire Korea, the full extent of which depends on future developments which are highly uncertain and cannot be predicted with confidence. Such developments include the following:\nthe duration of COVID-19 or the extent of any resurgence or variants of COVID-19 or any other infectious diseases in areas where we operate or where our customers are located;\nthe manner in which our customers, suppliers and other third parties respond to COVID-19, including the perception of safety and health measures we implemented;\nnew information that may emerge concerning the severity of COVID-19 and the actions to contain or treat it;\ngeneral, local or national economic conditions;\nlocal, state or national rules, regulations or policies which may restrict travel and operating hours or impose other operating restrictions;\nlimitations or restrictions on domestic or international travel or reluctance to travel to our properties; and\nconsumer confidence.\nAccordingly, we cannot reasonably estimate the extent to which COVID-19 will further impact our business and financial condition, results of operations and cash flows.\nOur business is subject to extensive governmental gaming regulation by multiple governmental and tribal authorities and changes to the regulatory regime governing our business, our inability to renew or obtain new contracts governing our existing gaming operations or our inability to obtain new casino licenses could adversely affect us\nOur gaming operations are highly regulated. Changes in applicable laws and regulations could limit or materially affect the types of gaming that may be conducted, or services provided, by us and the revenues realized therefrom.\nWith respect to our operations on the Mohegan Tribe's reservation, we are subject to extensive regulations by federal, state and tribal regulatory agencies, including the NIGC and agencies of the State of Connecticut, such as the Department of Consumer Protection's Gaming Division and Division of Liquor Control and the State Police. Currently, gaming on Indian tribal lands is subject to IGRA. Legislation has been introduced in Congress from time to time with the intent of modifying a variety of perceived deficiencies with IGRA or the Indian Reorganization Act of 1934 under which land can be acquired for tribes for various purposes, including gaming. Certain proposals that have been considered would be prospective in effect and contain clauses that would grandfather existing Indian tribal gaming operations such as Mohegan Sun. However, legislation has also been proposed from time to time which would have the effect of repealing many of the key provisions of IGRA and prohibiting the continued operation of particular classes of gaming on Indian tribal reservations in states where such gaming is not otherwise allowed on a commercial basis. While none of the substantive proposed amendments to IGRA have been enacted, we cannot predict the effects of future legislative acts. In the event that Congress passes prohibitory legislation that does not include any grandfathering exemption for existing Indian tribal gaming operations, and if such legislation is sustained in the courts against tribal challenge, our ability to meet our financial obligations would be materially and adversely affected.\nIn addition, under federal law, gaming on Indian tribal lands is dependent on the permissibility under state law of specific forms of gaming or similar activities and gaming at Mohegan Sun is dependent on the tribal-state compact between the Mohegan Tribe and the State of Connecticut, as amended. iGaming by Mohegan Digital outside of tribal lands in the state of Connecticut is dependent on recent state gaming legislation and other regulations in the state. Adverse decisions or legal actions with respect to gaming legislation, regulations or the Mohegan Compact may have an adverse effect on our ability to conduct our gaming operations.\nOur operations at Mohegan Pennsylvania are subject to extensive state regulation by the PGCB, the PSHRC and other state regulatory agencies, such as the Pennsylvania Liquor Control Board. Applicable rules and regulations may require that we obtain and periodically renew a variety of licenses, registrations, permits and approvals to conduct our operations. Regulatory agencies may, for any reason set forth in the applicable legislation, rules and regulations, limit, condition, suspend, deny or revoke our license to conduct our operations in Pennsylvania as intended. The sale of alcoholic beverages at our properties is subject to licensing, control and regulation by state and local agencies in Pennsylvania, including the Pennsylvania Liquor Control Board. The liquor agencies have broad powers to limit, condition, suspend or revoke any liquor license. We can provide no assurance that we will be able to continually renew all registrations, permits, approvals or licenses necessary to conduct our operations in Pennsylvania as intended. Any of these events, including any disciplinary action with respect to our liquor license or any changes in applicable laws or regulations or the enforcement thereof could, and any failure to renew or revocation of our liquor license would, have a material adverse effect on our business, financial condition and results of operations.\nChanges in applicable laws or regulations, including statutory changes, tax rates and the implementation or enforcement of applicable laws and regulations could limit or materially affect the types of gaming we may conduct, the services we may provide or the profitability of our operations at Mohegan Pennsylvania. Our ability to continue to operate and our ability to meet our financial obligations could be adversely affected by such legal or regulatory changes and their implementation.\nWith respect to our operations at the Niagara Resorts, we are regulated by both federal and provincial authorities. The Criminal Code of Canada mandates that dice games and games operated on or through a computer, video device or slot machine may only be conducted through and managed by provincial governments and as a licensed service provider we must provide gaming-related services in accordance with applicable provincial laws and regulations. Gaming in the Province of Ontario, where the Niagara Resorts are located, is highly regulated. The OLG is empowered to conduct and manage gaming in the Province of Ontario and has the power and authority to oversee and/or regulate the gaming industry directly or through AGCO.\nIn other jurisdictions where we operate, own or manage gaming facilities, or have facilities under development, we are similarly subject to applicable laws and regulations whose implementation or enforcement could limit or materially affect the types of gaming we may conduct, the services we may provide or the profitability of our operations.\nIf we are not able to compete successfully with existing and future competitors, we may not be able to generate sufficient cash flows from our operations to fulfill our financial obligations\nThe gaming industry is highly competitive for both customers and employees, including management level employees. We compete directly with numerous gaming operations and hotels in the immediate and surrounding market areas where our properties are located. We also compete with non-gaming resorts and vacation destinations, as well as other forms of\nentertainment, including iGaming operations. The gaming industry is characterized by competitors that vary considerably in their size, quality of facilities, number of operations, brand identities, marketing and growth strategies, financial strength and capabilities, level of amenities, management talent and geographic diversity. In the future, our business may be adversely impacted by new forms of legalized gaming, as well as additional gaming and hotel room capacity in the market areas where we operate or intend to operate.\nWith the general lack of new gaming markets, competition in existing markets has intensified in recent years. We and our competitors have invested in expanding existing facilities, developing new facilities and acquiring established facilities in existing markets. Competition may continue to intensify if our competitors commit additional resources to aggressive pricing and promotional activities in order to attract customers.\nWe also compete to some extent with other forms of gaming both locally and nationally, including state-sponsored lotteries, charitable gaming, video gaming terminals at bars, restaurants, taverns and truck stops, on-track and off-track wagering and other forms of entertainment, including motion pictures, sporting events and other recreational activities. It is possible that these secondary competitors could adversely impact visitation or amounts wagered at our facilities, which could have a material adverse effect on our ability to generate revenues or maintain our profitability and cash flows.\nIf our competitors operate more successfully than we do, if they attract customers away from us, if they are more successful than us in attracting and retaining employees, if their properties are enhanced or expanded, if they operate in jurisdictions that provide them with operating advantages due to differences or changes in gaming regulations or taxes or if additional gaming operations and hotels are established or expanded in size or scope in and around market areas in which we conduct business, we may lose market share or the ability to attract and retain employees. In particular, the expansion of gaming in or near any geographical area from which we attract or expect to attract a significant number of our customers could have a significant adverse effect on our business, financial condition and results of operations.\nIn addition, increased competition may require us to make substantial capital expenditures to maintain and enhance the competitive position of our properties, including updating slot machines to reflect changing technology, refurbishing public service areas, replacing obsolete equipment on an ongoing basis and making other expenditures to enhance the attractiveness and appeal of our facilities. Since we are highly leveraged, after satisfying obligations under our outstanding debt, there can be no assurance that we will have sufficient funds or that we will be able to obtain sufficient financing to fund such expenditures. If we are unable to make such expenditures, our competitive position could be materially adversely affected.\nThe gaming markets in the Northeastern United States and Niagara Falls, Canada, have experienced seasonal fluctuations in the past and, as such, we may also experience seasonal variations in our revenues and operating results that could adversely affect our cash flows\nThe gaming markets in the Northeastern United States and Niagara Falls, Canada, are seasonal in nature, with peak gaming activities at Mohegan Sun, Mohegan Pennsylvania and the Niagara Resorts often occurring during the months of May through August. As a result of these seasonal fluctuations, we will likely continue to experience seasonal variations in our revenues and operating results that could result in lower cash flows during periods in which gaming activities are not at peak levels. These variations in revenues and operating results could adversely affect our financial condition.\nNegative conditions affecting the lodging industry may have an adverse effect on our revenues and cash flows\nWe depend on revenues generated from our hotels and other portions of our properties to meet our financial obligations and fund our operations. Revenues generated from our hotels are primarily subject to conditions affecting our gaming operations, but are also subject to the lodging industry in general and, as a result, our financial performance and cash flows may be affected not only by the conditions in the gaming industry, but also by those in the lodging industry. Some of these conditions are as follows:\nchanges in the local, regional or national economic climate, including economic recessions;\nchanges in local conditions such as an oversupply of hotel properties;\ndecreases in the level of demand for hotel rooms and related services;\nthe attractiveness of our hotels to customers and competition from comparable hotels;\ncyclical over-building in the hotel industry;\nchanges in travel patterns;\npublic health, environmental or climate concerns affecting public accommodations or travel;\nchanges in room rates and increases in operating costs due to inflation and other factors;\nthe inability to fully staff our properties due to difficulties in hiring sufficient employees at all positions;\nincreases in fuel or travel costs resulting in reduced visitation to our properties; and\nthe periodic need to repair and renovate our hotels.\nThere are significant risks associated with our construction projects, which could have a material adverse effect on our financial condition, results of operations and cash flows\nInspire Korea, which is under construction adjacent to the Incheon International Airport in South Korea, the hotel under construction at ilani and any of our other construction projects, including renovations to existing facilities, entail significant risks. While currently on schedule, Inspire Korea has been adversely affected by inflationary pressures, COVID-19 related construction delays and product sourcing restrictions and uncertainties. We have been attempting to mitigate the effects of these matters, however, we can provide no assurance that we will be successful in this regard.\nConstruction activity requires us to obtain qualified contractors and subcontractors, the availability of which may be uncertain. Construction projects are subject to cost overruns and delays caused by events outside of our control or, in certain cases, our contractors control, such as shortages of materials or skilled labor, unforeseen engineering, environmental and/or geological problems, work stoppages, weather interference, unanticipated cost increases and unavailability of construction materials or equipment, fire, flood and other natural disasters. Construction, equipment or staffing problems or difficulties in obtaining any of the requisite materials, licenses, permits, allocations and authorizations from governmental or regulatory authorities could increase the total cost, delay, jeopardize, prevent the construction or opening of our projects or otherwise affect the design and features.\nConstruction contractors or counterparties for our projects may be required to bear certain cost overruns for which they are contractually liable and, if such counterparties are unable to meet their obligations, or if the liability of such persons for such overruns is limited or not covered by their contracts, we may incur increased costs for such projects. In addition, the location of Inspire Korea and other projects which we may pursue throughout the world present unique challenges and risks to manage and execute. If our management is unable to successfully manage such international construction projects, it could have a material adverse effect on our financial condition, results of operations and cash flows.\nThe anticipated costs and completion dates for our current construction projects are based on budgets, designs, development and construction documents and schedule estimates that are prepared with the assistance of architects and other construction consultants and are subject to change as the design, development and construction documents are finalized and as actual construction work is performed. A failure to complete our projects on budget or on schedule may have a material adverse effect on our financial condition, results of operations and cash flows.\nFurthermore, while construction activities may be planned to minimize disruptions, construction noise, debris and temporary closures may disrupt our current operations. Unexpected construction delays could exacerbate or magnify these disruptions. We can provide no assurance that our construction projects will not have a material adverse effect on our results of operations.\nWe may suspend or elect not to proceed with construction projects once they have been undertaken, resulting in charges that could adversely affect our financial condition. We may also make additional capital expenditures and/or increase the allocation of our capital resources to construction projects.\nWe may suspend, elect not to proceed with or fail to complete construction projects once they have been undertaken. In such cases, we may be required to carry assets on our balance sheet related to suspended projects or incur significant costs relating to design and construction work performed and materials purchased that may no longer be useful. In addition, our agreements or arrangements with third parties relating to the suspension or termination of such construction projects could cause us to incur additional fees and costs. The suspension of, election not to proceed with, or failure to complete any of our construction projects may result in adverse effects to our financial condition.\nWe may also elect to make additional capital expenditures to cover increased costs or to expand the scope of construction projects following initial planning. In such cases, we may be required to raise additional capital resources or commit more of our existing capital resources, which could have an adverse effect on our liquidity. In connection with Inspire Korea, we have proposed to the lenders and construction contractor that we make additional investments of at least 155 billion Korean won ($108 million as of September 30, 2022) over the next 12 to 15 months to fund expansions in the scope of the project relating to convention, meeting room and restaurant capacity, to increase funding for pre-opening expenses, to pay for certain increased costs and to provide for working capital and additional project contingency. These investments are currently under review with the lenders and construction contractor. These matters are not expected to impact the timing of construction or opening of Inspire Korea.\nThe risks associated with operating expanded facilities and managing growth could have a material adverse effect on our future performance\nWe may expand our facilities from time to time. We can provide no assurance that we will be successful in integrating the new amenities from such expansions into our current operations or in managing our expanded facilities. Failure to successfully\nintegrate and manage new services and amenities could have a material adverse effect on our results of operations and our ability to meet our financial obligations.\nA person's or entity's ability to enforce its rights against us is limited by our sovereign immunity and that of our wholly-owned subsidiaries that are tribal entities\nWhile we, the Mohegan Tribe and certain of our wholly-owned subsidiaries that are tribal entities each have sovereign immunity and generally may not be sued without our and their respective consents, a limited waiver of sovereign immunity and consent to suit has been granted by our restricted subsidiaries in connection with substantially all of our outstanding debt. Each such waiver permits lawsuits against us to enforce our obligation to repay certain outstanding debt. Generally, duly authorized express waivers of sovereign immunity have been held to be enforceable against Indian tribes. In the event that any waiver of sovereign immunity is held to be ineffective, a claimant could be precluded from judicially enforcing its rights and remedies. With limited exceptions, our restricted subsidiaries have not waived sovereign immunity for claims under federal or state securities laws and therefore a claimant may not have any remedy based on such claims.\nWhere an entity that enjoys tribal sovereign immunity has waived its immunity and consented to suit in federal and/or state court, disputes may be brought in a federal or state court that has jurisdiction over the matter. However, federal courts may not exercise jurisdiction over disputes not arising under federal law or between litigants that are not citizens of different states, and some courts have ruled that an Indian tribe is not a citizen of any state. The extent to which state courts will assume jurisdiction over disputes involving Indian tribes varies from state to state. In addition, the Mohegan Tribe's Constitution has established a special court, the Gaming Disputes Court, to rule on disputes with respect to Mohegan Sun. The federal and state courts, under the doctrines of comity and exhaustion of tribal remedies, may: (i) defer to the jurisdiction of the Gaming Disputes Court or (ii) require that any plaintiff exhaust its remedies in the Gaming Disputes Court before bringing any action in federal or state court. Thus, there may be no available federal or state court forum for adjudication of a dispute with an entity that enjoys tribal sovereign immunity.\nThe limited waiver of sovereign immunity that has been granted in connection with our outstanding debt additionally provides that in the event that none of the specified federal or state courts accept or exercise jurisdiction over a dispute, claims may be brought in arbitration proceedings with enforcement of arbitration awards in courts of competent jurisdiction. Such a dispute would not be decided by a judge, but by an arbitrator appointed in accordance with the commercial arbitration rules of the American Arbitration Association. The scope of a partys ability to conduct discovery with respect to such a dispute and the time in which the party is permitted to do so are more limited than in a judicial proceeding. If any party does not prevail in a dispute before an arbitrator, that partys ability to appeal the arbitrators decision will be limited. Federal and state courts typically are required to enforce a proper arbitration award without a re-examination of the merits of the decision. Enforcement of arbitration awards in the Gaming Disputes Court may not be subject to the same limitations on such re-examination.\nIf an event of default occurs in connection with our debt, no assurance can be given that a forum will be available to creditors other than arbitration with enforcement of arbitration awards in the Gaming Disputes Court. In such court, there are presently limited precedents for the interpretation of tribal law with respect to insolvency. Any execution of a judgment of the Gaming Disputes Court or any other court on tribal lands will require the cooperation of the Mohegan Tribe's officials in the exercise of their police powers. Thus, to the extent that a judgment of the Gaming Disputes Court must be executed on tribal lands, the practical realization of any benefit of such a judgment will be dependent upon the willingness and ability of tribal officials to carry out such judgment. In addition, the land on which Mohegan Sun is located is owned by the United States in trust for the Mohegan Tribe and our creditors and the creditors of the Mohegan Tribe may not foreclose upon or obtain title to the land. Additionally, while we do not presently hold any material fee interest in real property, if we do in the future, federal law may not allow for real property interest to be mortgaged or, if mortgaged, transferred as a result of foreclosure.\nAny rights as a creditor are limited to our assets and those of our guarantor subsidiaries\nAny rights as a creditor in a bankruptcy, if applicable, liquidation, reorganization or similar proceeding would be limited to our assets and the assets of our guarantor subsidiaries and would not encompass the assets of any other subsidiary that is not a guarantor or the Mohegan Tribe or its other affiliates.\nOur failure to generate sufficient cash flows and current and future economic and credit market conditions could adversely affect our ability to fulfill our debt service obligations or refinance our outstanding debt\nOur ability to generate cash flows is subject to financial, economic, political, competitive, regulatory and other factors beyond our control. If we are unable to generate sufficient cash flows from operations or borrow additional funds, we may be unable to fulfill our debt service obligations. In addition, we can provide no assurance that we will be able to obtain additional debt for refinancing or to fund our growth, or that financing options available, if any, will be on favorable or acceptable terms.\nRestrictions contained in our senior secured credit facility and the indentures to which we are a party may impose limits on our ability to pursue our business interests\nOur senior secured credit facility and the indentures to which we are a party contain customary operating and financial restrictions that limit our discretion on various business matters. These restrictions include, among other things, covenants limiting our ability to:\nincur additional debt;\npay dividends or make other distributions;\nmake certain investments;\nuse assets as security in other transactions;\nsell certain assets or merge with or into another person;\ngrant liens;\nmake capital expenditures; and\nenter into transactions with affiliates.\nThese restrictions may, among other things, reduce our flexibility in planning for, or reacting to, changes in our business and the gaming industry in general and thereby may negatively impact our financial condition, results of operations and ability to meet our financial obligations.\nOur senior secured credit facility requires us to maintain a fixed charge coverage ratio and not to exceed certain ratios of total leverage and secured leverage. If these ratios are not maintained or are exceeded, as applicable, it may not be possible for us to borrow additional funds to meet our financial obligations. Additionally, our failure to comply with covenants in our senior secured credit facility, including the fixed charge coverage and leverage ratios, could result in an event of default under the senior secured credit facility, which, if not cured or waived, could have a material adverse effect on us and could result in the acceleration of required repayments of some or all of then-outstanding debt thereunder and an inability to make debt service payments. However, we can provide no assurance that we would be able to obtain such waivers.\nIn addition, our indentures place certain limitations on our ability to incur debt. Under our indentures, we are generally able to incur debt that otherwise may be restricted, provided that we meet a minimum fixed charge coverage ratio, as defined. If we were to fall below the minimum fixed charge coverage ratio, our ability to incur additional debt could be limited and subject to other applicable exceptions contained in the indentures and the options available to us to refinance our existing debt could be restricted.\nAdditionally, our failure to comply with covenants in our debt instruments could result in an event of default, which, if not cured or waived, could have a material adverse effect on us and could result in the acceleration of required repayments of some or all of then-outstanding debt and an inability to make debt service payments.\nA change in our current tax-exempt status, or that of certain of our subsidiaries, could reduce our cash flows and have a material adverse effect on our operations and our ability to meet our financial obligations\nBased on current interpretation of the Internal Revenue Code of 1986, as amended, we, the Mohegan Tribe and certain of our subsidiaries are not subject to United States federal income taxes. However, we can provide no assurance that Congress or the Internal Revenue Service will not reverse or modify the exemption for Indian tribes from United States federal income taxation. A change in the tax law could have a material adverse effect on our financial performance.\nWeakness or downturn in the United States, Canadian or South Korean economies and fluctuations in exchange rates could negatively impact our financial performance\nDuring periods of economic contraction, our revenues may decline while some of our costs remain fixed, resulting in lower earnings since gaming and other leisure activities that we offer are discretionary in nature and participation in such activities may decline during economic downturns since consumers have less disposable income. Even an uncertain economic outlook may adversely affect spending at our properties since consumers may spend less in anticipation of a potential economic downturn.\nEconomic recessions negatively impact consumer confidence and the amount of consumer spending. Economic conditions such as a prolonged regional, national or global economic downturn or slow growth, including periods of increased inflation, rising unemployment, tax rates, interest rates, energy and gasoline prices or declining consumer confidence could also reduce consumer spending. Reduced consumer spending has resulted and may continue to result in an adverse impact on our business, financial condition and operating results. Furthermore, uncertainty and adverse changes in the economy could also increase the cost and reduce the availability of sources of financing, which could have a material adverse impact on our financial condition\nand operating results. If adverse economic conditions continue or worsen, our business, assets, financial condition and results of operations could continue to be affected adversely.\nIn addition, our operations in Canada and South Korea are conducted in the respective local currency. Accordingly, fluctuations in exchange rates may adversely affect our financial results.\nOur diversification efforts may not be successful\nWe receive and evaluate various opportunities to diversify our business interests. These opportunities primarily include the development and/or management of, investment in or ownership of other gaming and entertainment enterprises through direct investments, acquisitions, joint venture arrangements and loan transactions. In addition to the opportunities we are currently pursuing, we are evaluating other opportunities in various jurisdictions. These efforts may require various levels of regulatory or legislative approval and may require the commitment of financial and capital resources. Failure to receive such approvals or to obtain or generate sufficient funds to meet such financial or capital requirements may result in the termination of the respective project. In addition, our diversification initiatives may not generate the expected (or any) returns on our investments. Furthermore, there can be no assurance that we will continue to pursue any of the diversification initiatives we are pursuing or evaluating or that any of them will be consummated.\nThe non-impairment provision of the Mohegan Tribe's Constitution is subject to change\nUnlike states, the Mohegan Tribe is not subject to the United States Constitution's provision restricting governmental impairment of contracts. The Mohegan Tribe's Constitution currently has a provision that prohibits the Mohegan Tribe from enacting any law that would impair the obligations of contracts entered into in furtherance of the development, construction, operation and promotion of gaming on tribal lands. However, this provision could be amended by a vote of 75% of the Mohegan Tribe's registered voters to rescind the restriction on impairment of the obligation of such contracts.\nWe and our guarantor subsidiaries are controlled by a tribal government and may not necessarily be operated in the same way as if we and they were privately owned for-profit businesses\nWe and our guarantor subsidiaries are subject to control by the Mohegan Tribe. Our Management Board is comprised of the same nine members as the Mohegan Tribal Council, the governing body of the Mohegan Tribe with legislative and executive authority. As a sovereign government, the Mohegan Tribe is governed by officials elected by tribal members who have a responsibility for the general welfare of all members of the Mohegan Tribe. In making decisions relative to us and our guarantors, these officials may consider the interests of their electorate, instead of pure economic or other business factors.\nControl deficiencies could prevent us from accurately and timely reporting our financial results\nWe may identify deficiencies in our internal control over financial reporting in the future, including significant deficiencies and material weaknesses. A significant deficiency is a deficiency, or a combination of deficiencies, in internal control over financial reporting that is less severe than a material weakness, yet important enough to merit attention by those responsible for oversight of a companys financial reporting. A \"material weakness\" is a deficiency, or a combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of a companys annual or interim financial statements will not be prevented or detected on a timely basis. A deficiency in internal control exists when the design or operation of a control does not allow management or employees, in the normal course of performing their assigned functions, to prevent or detect misstatements on a timely basis. Our failure to identify deficiencies in our internal control over financial reporting in a timely manner or remediate any deficiencies, or identify material weaknesses or significant deficiencies in the future, could prevent us from accurately and timely reporting our financial results.\nWe may be subject to material environmental liability resulting from possible incomplete remediation of known environmental hazards or the existence of unknown environmental hazards\nOur properties and operations are subject to a wide range of federal, state, local and tribal environmental laws and regulations governing, among other things, air emissions, wastewater discharges, the use, management and disposal of, or exposure to, hazardous and non-hazardous materials and wastes and the clean-up of contamination. Noncompliance with such laws and regulations, as well as past or future activities resulting in environmental releases, could affect our operations or could cause us to incur substantial costs, including clean-up costs, fines and penalties or investments to retrofit or upgrade our properties.\nIn addition, should unknown contamination be discovered on our properties or should a release of hazardous material occur on our properties, we could be required to investigate and clean up such contamination and could also be held responsible to a governmental entity or third parties for personal injury, property damage or investigation and cleanup costs, which may be substantial. Moreover, such contamination may also impair the use or value of the affected property. Liability for contamination can be joint and several in nature and in many instances can be imposed on the owner or operator of property regardless of whether such owner or operator is responsible for creating the contamination or is otherwise at fault.\nAt both Mohegan Sun and Mohegan Pennsylvania, investigations and remedial actions have been successfully undertaken to address significant site contamination resulting from historical operations. The site on which Mohegan Sun is located was formerly occupied by United Nuclear Corporation, a naval products manufacturer of, among other things, nuclear reactor fuel components. Prior to the decommissioning of the United Nuclear Corporation facilities on the site, extensive investigations were completed and contaminated soils were remediated to applicable standards. Prior to us taking possession of the site, it was determined to be safe for general public use. In addition, prior to acquiring Mohegan Pennsylvania, we conducted an extensive environmental investigation. During the course of the investigation, we identified several environmental conditions that required corrective actions to bring the property into compliance with applicable laws and regulations. These remedial actions, including an ongoing monitoring program for the portion of the property that was formerly used as a solid waste landfill, were addressed as part of a comprehensive plan that was fully implemented by July 2008.\nNotwithstanding the foregoing, we can provide no assurance that:\nany environmental reports or studies prepared with respect to these sites or, any other properties owned or operated by us, revealed all environmental liabilities;\nprior owners or tenants did not create any material environmental condition not presently known to us that may be discovered in the future;\nfuture laws, ordinances or regulations will not impose any material environmental liability with regard to existing conditions or operations; or\na material environmental condition does not otherwise exist on any site.\nAny of the above could have a material adverse effect on our operating results and ability to meet our financial obligations.\nOur business could be affected by a variety of uncontrollable events that could impact our operations\nOur operations could be adversely affected by a variety of factors beyond our control, including health concerns (as has been the case with COVID-19 and could occur in the event of future health outbreaks and pandemics), adverse weather conditions arising from short-term weather patterns or long-term climate change, catastrophic events or natural disasters (such as excessive heat or rain, hurricanes, typhoons, floods, droughts, tsunamis and earthquakes), international, political or military developments (including social unrest) and terrorist attacks. These events and others may also inhibit our ability to provide our amenities and services or to obtain insurance coverage with respect to certain of these events. In addition, the costs of protecting against such incidents could reduce the profitability of our operations.\nOur table games business is subject to volatility\nTable gaming, especially high-end table gaming, is more volatile than other forms of gaming and variances in table games hold percentage may have a positive or negative impact on our quarterly revenues and operating results. Negative variations in quarterly revenues and operating results could adversely affect our financial condition.\nEnergy and fuel price increases may adversely affect our business and results of operations\nOur properties use significant amounts of electricity, natural gas and other forms of energy. Increases in the cost of any of our sources of energy may negatively affect our results of operations. In addition, energy and fuel price increases could negatively impact our business and results of operations by making it difficult for potential customers to travel to our properties or by causing customers who do visit our properties to reduce their spending due to a reduction in disposable income.\nOur information technology and other systems are subject to cyber security risks, including misappropriation of customer information or other breaches of information security\nWe rely upon sophisticated information technology networks, systems and infrastructure, some of which are managed by third parties, to process, transmit and store electronic information and to manage or support a variety of business processes and activities. Additionally, we collect and store sensitive data, including proprietary business information. Despite security measures, our information technology networks, systems and infrastructure may be vulnerable to damage, disruptions or shutdowns due to attack by hackers or breaches, employee error or malfeasance, power outages, computer viruses, telecommunication or utility failures, systems failures, natural disasters or other catastrophic events. Likewise, data privacy or security breaches by employees and others with permitted access to our systems, including in some cases third parties to which we may outsource certain business functions, may pose a risk that sensitive data, including intellectual property or personal information, may be exposed to unauthorized persons or to the public. Security breaches and other disruptions to our information technology infrastructure could interfere with our operations, compromise information belonging to us and our customers and suppliers and expose us to liability which could adversely impact our business and/or result in the loss of critical or sensitive information, which could result in financial, legal, business or reputational harm.\nImpairment of our intangible assets could adversely affect our financial condition\nIn accordance with authoritative guidance issued by the Financial Accounting Standards Board pertaining to intangible assets, we assess our intangible assets at least annually for impairment by comparing their fair value to their carrying value. Fair value is estimated utilizing a discounted cash flow method. As of September 30, 2022, we assessed our intangible assets for impairment and determined that no impairment existed. The evaluation of intangible assets for impairment requires the use of estimates about future cash flows to determine the estimated fair value of the reporting unit. Such estimates are, by their nature, subjective. Actual results may differ materially from our estimates and could result in impairment charges in the future. In the event that the carrying value of our intangible assets exceeds their fair value in a future period, the intangible assets would be impaired and subject to a non-cash write-down, which could have a material adverse impact on our financial condition.\nWe are subject to risks associated with doing business outside of the United States\nWith the Niagara Resorts, Inspire Korea and other potential projects outside of the United States, we have operations outside of the United States that are subject to risks that are inherent in conducting business under non-United States laws, regulations and customs. In particular, the risks associated with the Niagara Resorts, Inspire Korea or other operations that we may engage in other foreign jurisdictions, include:\nchanges in laws and policies that govern operations of companies in Canada, South Korea or other foreign jurisdictions;\nchanges in non-United States government programs;\npossible failure by our employees or agents to comply with anti-bribery laws such as the United States Foreign Corrupt Practices Act and similar anti-bribery laws in other jurisdictions;\ngeneral economic conditions and policies in such jurisdictions, including restrictions on travel and currency movements;\ndifficulty in establishing, staffing and managing non-United States operations;\ndifferent labor regulations;\nchanges in environmental, health and safety laws;\noutbreaks of diseases or epidemics;\npotentially negative consequences from changes in or interpretations of tax laws;\npolitical instability and actual or anticipated military and political conflicts;\neconomic instability and inflation, recession or interest rate or exchange rate fluctuations; and\nuncertainties regarding judicial systems and procedures.\nAny of the above risks could have an adverse effect on our results of operations and financial condition. We are also exposed to a variety of market risks, including the effects of changes in foreign currency exchange rates. If the United States dollar strengthens in relation to the currencies of other countries, our United States dollar reported income from sources where revenues are denominated in the currencies of other such countries will decrease.\nAny violation of the United States Foreign Corrupt Practices Act or any other similar anti-corruption laws could have a negative impact on us\nA portion of our revenues are derived from operations outside of the United States, which exposes us to complex United States and foreign regulations inherent in doing cross-border business and in each of the countries in which we transact business. We are subject to compliance with the United States Foreign Corrupt Practices Act and other similar anti-corruption laws, which generally prohibit companies and their intermediaries from making improper payments to foreign government officials for the purpose of obtaining or retaining business. While our employees and agents are required to comply with these laws, we can provide no assurance that our internal policies and procedures will always protect us from violations of these laws, despite our commitment to legal compliance and corporate ethics. Violations of these laws by us or any of our ventures may result in severe criminal and civil sanctions and other penalties against us, as the Securities and Exchange Commission and United States Department of Justice continue to vigorously pursue enforcement of the United States Foreign Corrupt Practices Act. The occurrence or allegation of any such violation may adversely affect our business, performance, prospects, value, financial condition and results of operations. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nProperty Location Opening Year Casino Square Footage Slot Machines Table Games Hotel Rooms Food & Beverage and Retail Outlets Primary Entertainment Venue (Seats)\nOwned\nMohegan Sun Uncasville, CT 1996 310,000 3,650 250 1,562 83 10,000\nMohegan Pennsylvania Wilkes-Barre, PA 2006 95,000 1,700 65 237 18 1,500\nInspire Korea (1)\nIncheon, South Korea 2023 260,000 700 150 1,275 70 15,000\nOperated/Managed\nFallsview Casino Resort Niagara Falls, ON 2004 160,000 3,500 120 372 41 5,000\nCasino Niagara Niagara Falls, ON 1996 70,000 1,400 30 N.A. 2 N.A.\nMohegan Casino Las Vegas Las Vegas, NV 2021 60,000 600 45 1,504 22 4,500\nilani Casino Resort La Center, WA 2017 110,000 2,750 75 N.A. 15 2,550\nResorts Casino Hotel (2)\nAtlantic City, NJ 1978 80,000 1,350 75 942 22 1,250\n1,145,000 15,650 810 5,892 273 39,800\n_________\n(1) Estimated.\n(2)10% ownership.\nN.A. Not Applicable. Item 3. Legal Proceedings.\nWe are a defendant in various claims and legal actions resulting from our normal course of business. We believe the aggregate liability, if any, arising from such legal actions will not have a material impact on our financial position, results of operations or cash flows. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nWe have not issued or sold any equity securities. Item 6. Reserved. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis of our financial position and operating results for the fiscal year ended September 30, 2022 should be read in conjunction with our Financial Statements and the notes thereto and other financial information included elsewhere in this Annual Report on Form 10-K.\nThe statements in this discussion regarding our expectations related to our future performance, liquidity and capital resources, and other non-historical statements are forward-looking statements. These forward-looking statements are subject to numerous risks and uncertainties. Our actual results may differ materially from those contained in or implied by any forward-looking statements. See Cautionary Note Regarding Forward-Looking Statements within this Annual Report on Form 10-K.\nFor a discussion of the comparison of our financial position and operating results for the fiscal years ended September 30, 2021 and 2020, refer to our Annual Report on Form 10-K for the fiscal year ended September 30, 2021, filed with the Securities and Exchange Commission on December 16, 2021.\nImpact of the COVID-19 Pandemic\nIn March 2020, the World Health Organization declared the outbreak of COVID-19 a global pandemic and the United States federal government declared it a national emergency. The spread of COVID-19 has affected most segments of the global economy, including our operations. In March 2020, we temporarily suspended operations at our properties in the United States and Canada to ensure the health and safety of our employees, customers and the surrounding communities in which we operate, consistent with directives from various governmental bodies. All of our properties in the United States were reopened by July 2020. Our properties in Canada reopened in July 2021, but were temporarily closed again from January 5, 2022 through January 30, 2022, due to a resurgence of COVID-19 at that time.\nWhile we are operating at full capacity as of the filing of this Annual Report on Form 10-K, COVID-19 has had a significant impact on our operations, the full extent of which depends on future developments which are highly uncertain and cannot be predicted with confidence. Such developments include the following:\nthe duration of COVID-19 or the extent of any resurgence or variants of COVID-19 in areas where we operate or where our customers are located;\nthe manner in which our customers, suppliers and other third parties respond to COVID-19, including the perception of safety and health measures we implemented;\nnew information that may emerge concerning the severity of COVID-19 and the actions to contain or treat it;\ngeneral, local or national economic conditions; and\nconsumer confidence.\nAccordingly, we cannot reasonably estimate the extent to which COVID-19 will further impact our future financial condition, results of operations and cash flows.\nWe could experience other potential adverse impacts as a result of COVID-19, including, but not limited to, charges from further adjustments to the carrying value of our intangible assets, as well as other long-lived asset impairment charges. Actual results may differ materially from our current estimates as the scope of COVID-19 evolves, depending largely, but not exclusively, on the duration and extent of any business disruptions.\nDiscussion of Consolidated Operating Results\nThe most significant factors and trends that impacted our operating and financial performance during fiscal 2022 were as follows:\nrelatively full periods of operations at our properties;\na return to relatively normal operating conditions at our properties; and\nimpairment charges related to Inspire Korea.\nConsolidated Operating Results\nFor the Fiscal Years Ended September 30, Variance\n2022 vs. 2021\n(in thousands) 2022 2021 2020 $ %\nNet revenues:\nGaming $ 1,122,864 $ 910,378 $ 799,647 $ 212,486 23.3 %\nFood and beverage 134,724 73,631 103,678 61,093 83.0 %\nHotel 115,828 84,307 69,113 31,521 37.4 %\nRetail, entertainment and other 217,095 160,517 142,524 56,578 35.2 %\nNet revenues $ 1,590,511 $ 1,228,833 $ 1,114,962 361,678 29.4 %\nOperating costs and expenses:\nGaming $ 573,561 $ 470,723 $ 444,875 $ 102,838 21.8 %\nFood and beverage 111,379 63,414 91,662 47,965 75.6 %\nHotel 47,689 36,097 35,578 11,592 32.1 %\nRetail, entertainment and other revenue 79,289 38,390 54,020 40,899 106.5 %\nAdvertising, general and administrative 309,160 231,084 226,588 78,076 33.8 %\nCorporate 65,034 61,301 44,177 3,733 6.1 %\nDepreciation and amortization 102,625 105,335 109,067 (2,710) (2.6) %\nImpairment of tangible assets 23,565 - - 23,565 N.M.\nImpairment of intangible assets 12,869 - 126,596 12,869 N.M.\nOther, net 19,106 38,032 15,616 (18,926) (49.8) %\nTotal operating costs and expenses $ 1,344,277 $ 1,044,376 $ 1,148,179 299,901 28.7 %\n_________\n(N.M.) Not Meaningful.\nSegment Operating Results\nFor the Fiscal Years Ended September 30, Variance\n2022 vs. 2021\n(in thousands) 2022 2021 2020 $ %\nNet revenues:\nMohegan Sun $ 940,282 $ 816,376 $ 715,674 $ 123,906 15.2 %\nMohegan Pennsylvania 257,840 221,479 181,160 36,361 16.4 %\nNiagara Resorts 279,263 99,202 180,025 180,061 181.5 %\nManagement, development and other 62,221 70,009 37,189 (7,788) (11.1) %\nAll other 54,619 18,780 - 35,839 190.8 %\nCorporate 575 3,247 741 (2,672) (82.3) %\nInter-segment (4,289) (260) 173 (4,029) N.M.\nNet revenues $ 1,590,511 $ 1,228,833 $ 1,114,962 361,678 29.4 %\nOperating costs and expenses:\nMohegan Sun $ 726,628 $ 614,065 $ 587,225 $ 112,563 18.3 %\nMohegan Pennsylvania 213,884 188,945 296,233 24,939 13.2 %\nNiagara Resorts 240,371 121,840 204,701 118,531 97.3 %\nManagement, development and other 78,169 52,847 35,604 25,322 47.9 %\nAll other 47,461 20,314 - 27,147 133.6 %\nCorporate 42,113 46,605 24,180 (4,492) (9.6) %\nInter-segment (4,349) (240) 236 (4,109) N.M.\nTotal operating costs and expenses $ 1,344,277 $ 1,044,376 $ 1,148,179 299,901 28.7 %\n_________\n(N.M.) Not Meaningful.\nMohegan Sun\nRevenues\nNet revenues increased $123.9 million, or 15.2%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This increase was primarily driven by higher non-gaming revenues which benefited from strong overall business volumes reflecting a return to relatively normal operating conditions compared with the prior fiscal year, which was negatively impacted by various COVID-19 restrictions. Overall non-gaming revenues also benefited from a full entertainment calendar compared with the prior fiscal year in which the Mohegan Sun Arena was partially closed due to COVID-19. In addition, the growth in net revenues reflected higher gaming revenues. Slot revenues increased principally due to higher slot handle, while the growth in table game revenues reflected higher hold percentage.\nOperating Costs and Expenses\nOperating costs and expenses increased $112.6 million, or 18.3%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This increase primarily reflected higher overall operating costs and expenses commensurate with the increase in net revenues and return to relatively normal operating conditions, including increased payroll costs, cost of goods sold and direct entertainment expenses, as well as higher costs related to advertising, utilities and certain other administrative services. The increase in operating costs and expenses was also driven by higher slot win contribution.\nMohegan Pennsylvania\nRevenues\nNet revenues increased $36.4 million, or 16.4%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This increase was primarily due to higher slot revenues driven by increased slot handle, as well as higher non-gaming revenues. In general, these results were driven by strong overall business volumes reflecting a return to relatively normal operating conditions compared with the prior fiscal year, which was negatively impacted by various COVID-19 restrictions and the temporary closure of Mohegan Pennsylvania from December 12, 2020, through January 3, 2021.\nOperating Costs and Expenses\nOperating costs and expenses increased $24.9 million, or 13.2%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This increase primarily reflected higher Pennsylvania slot machine tax expenses driven by the increase in slot revenues, combined with higher overall operating costs and expenses commensurate with the return to relatively normal operating conditions.\nNiagara Resorts\nRevenues\nNet revenues increased $180.1 million, or 181.5%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This increase reflected a relatively full year of operations and a return to fairly normal operating conditions compared with the prior fiscal year. The Niagara Resorts were temporarily closed effective March 18, 2020, following the outbreak of COVID-19, and reopened on July 23, 2021 under various COVID-19 related restrictions. The Niagara Resorts were temporarily closed again from January 5, 2022, through January 30, 2022, due to a resurgence of COVID-19 at that time.\nOperating Costs and Expenses\nOperating costs and expenses increased $118.5 million, or 97.3%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This increase primarily reflected higher operating costs and expenses commensurate with the growth in net revenues, combined with higher overall costs and expenses associated with a relatively full year of operations.\nManagement, Development and Other\nRevenues\nNet revenues decreased $7.8 million, or 11.1%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This decline was primarily driven by lower management fees from ilani Casino Resort, combined with the impact of non-recurring management fees associated with our prior management agreement with Paragon Casino Resort.\nOperating Costs and Expenses\nOperating costs and expenses increased $25.3 million, or 47.9%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. As described in Note 4 and Note 5, this increase was primarily driven by $36.4 million in impairment charges related to Inspire Korea, partially offset by lower pre-opening costs and expenses related to Inspire Korea.\nAll Other\nRevenues\nNet revenues increased $35.8 million, or 190.8%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This increase was driven by incremental revenues generated by our online casino gaming and sports wagering operations in Connecticut, which commenced in October 2021, and Mohegan Casino Las Vegas, which opened in March 2021.\nOperating Costs and Expenses\nOperating costs and expenses increased $27.1 million, or 133.6%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This increase reflected incremental operating costs and expenses associated with our online casino gaming and sports wagering operations in Connecticut and Mohegan Casino Las Vegas.\nCorporate\nRevenues\nNet revenues decreased $2.7 million, or 82.3%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This decline principally reflected the impact of non-recurring revenues generated by our construction group in the prior fiscal year.\nOperating Costs and Expenses\nOperating costs and expenses decreased $4.5 million, or 9.6%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This decline primarily reflected the impact of a non-recurring contract termination charge in the prior fiscal year, as well as non-recurring construction related expenses, partially offset by increased payroll costs and higher costs related to certain other professional and administrative services.\nOther Income (Expense)\nFor the Fiscal Years Ended September 30, Variance\n2022 vs. 2021\n(in thousands) 2022 2021 2020 $ %\nInterest income $ 168 $ 123 $ 1,754 $ 45 36.6 %\nInterest expense, net (206,314) (171,844) (134,925) (34,470) (20.1) %\nGain (loss) on modification and early extinguishment of debt 630 (21,793) (2,888) 22,423 N.M.\nGain on fair value adjustment\n43,020 - - 43,020 N.M.\nOther, net 268 10,057 566 (9,789) (97.3) %\nIncome tax benefit (provision)\n(8,810) 6,353 6,694 (15,163) N.M.\n_________\n(N.M.) Not Meaningful.\nInterest Expense\nInterest expense increased $34.5 million, or 20.1%, for the fiscal year ended September 30, 2022 compared with the prior fiscal year. This increase was partially offset by $22.3 million in capitalized interest related to Inspire Korea. The increase in interest expense was due to higher weighted average interest rate and weighted average outstanding debt. Refer to Note 6 for additional information.\nModification and Early Extinguishment of Debt\nLoss on modification and early extinguishment of debt in fiscal 2021 primarily represented transaction costs expensed in connection with our January 2021 refinancing transactions.\nFair Value Adjustment\nGain on fair value adjustment was driven by changes in the estimated fair value of the warrants and put option related to Inspire Korea. Refer to Note 6 for additional information.\nOther\nThe reduction in other, net primarily reflected lower COVID-19 related governmental subsidies associated with the Niagara Resorts.\nIncome Tax\nIncome tax benefit or provision was primarily driven by taxable losses incurred or taxable income generated by the Niagara Resorts.\nLiquidity and Capital Resources\nLiquidity\nAs of September 30, 2022 and 2021, we held cash and cash equivalents of $164.7 million and $149.8 million, respectively, of which the Niagara Resorts held $37.5 million and $25.1 million, respectively. As a result of the cash-based nature of our business, operating cash flow levels tend to follow trends in our operating income, excluding the effects of non-cash charges, such as depreciation and amortization and impairment charges. Inclusive of letters of credit, which reduce borrowing availability, we had $243.0 million of borrowing capacity under our senior secured credit facility and line of credit as of September 30, 2022. In addition, inclusive of letters of credit, which reduce borrowing availability, the Niagara Resorts had $120.1 million of borrowing capacity under the Niagara revolving facility and Niagara swingline facility as of September 30, 2022.\nMaterial contractual obligations arising in the normal course of business consist primarily of long-term debt and related interest payments, finance and operating lease obligations, distributions to the Mohegan Tribe, slot machine operation fee that must be paid to the Pennsylvania Department of Revenue and purchase and other contractual obligations. In connection with Inspire Korea, we have proposed to the lenders and construction contractor that we make additional investments of at least 155 billion Korean won ($108 million as of September 30, 2022) over the next 12 to 15 months to fund expansions in the scope of the project relating to convention, meeting room and restaurant capacity, to increase funding for pre-opening expenses, to pay for certain increased costs and to provide for working capital and additional project contingency. These investments are currently under review with the lenders and construction contractor. Refer to our Financial Statements and notes for additional information.\nCash provided by operating activities increased $60.5 million, or 26.6%, to $288.3 million for the fiscal year ended September 30, 2022 compared with $227.8 million in the prior fiscal year. The increase in cash provided by operating activities was driven by higher net income, after factoring in non-cash items, partially offset by higher working capital requirements, reflecting a return to relatively normal operating conditions at our properties. Refer to Discussion of Consolidated Operating Results for additional information.\nCash used in investing activities increased $245.6 million, or 497.7%, to $294.9 million for the fiscal year ended September 30, 2022 compared with $49.3 million in the prior fiscal year. The increase in cash used in investing activities was primarily driven by higher capital expenditures related to Inspire Korea.\nCash provided by financing activities totaled $438.2 million for the fiscal year ended September 30, 2022 compared with cash used in financing activities of $156.4 million in the prior fiscal year. The increase in cash provided by financing activities was primarily driven by additional borrowings to fund the development of Inspire Korea.\nSufficiency of Resources\nWe believe that existing cash balances, financing arrangements and operating cash flows will provide us with sufficient resources to meet our existing debt obligations, finance and operating lease obligations, distributions to the Mohegan Tribe, capital expenditures and working capital requirements for the next twelve months; however, we can provide no assurance in this regard. Refer to Part I. Item 1A. Risk Factors to this Annual Report on Form 10-K for further details regarding risks relating to our sufficiency of resources.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, expenses and related disclosures of contingent assets and liabilities. Actual amounts could differ from those estimates.\nWe believe the following accounting policies impact significant judgments and estimates utilized in the preparation of our financial statements.\nProperty and Equipment\nProperty and equipment are stated at cost. Depreciation is recognized over the estimated useful lives of the assets, other than land, on a straight-line basis. Leasehold improvements are amortized over the shorter of the lease terms or the estimated useful lives of the improvements. Estimated useful lives by asset categories are as follows:\nBuildings and land improvements 40 years\nFurniture and equipment 3 - 7 years\nThe costs of significant improvements are capitalized. Costs of normal repairs and maintenance are expensed as incurred.\nProperty and equipment are assessed for impairment whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable. If it is determined that the carrying amounts may not be recoverable based on current and future levels of income and cash flows, as well as other factors, an impairment charge will be recognized at such time.\nIntangible Assets\nIntangible assets consist primarily of Mohegan Sun's trademark and Mohegan Pennsylvania's various gaming licenses. These intangible assets all have indefinite lives. Intangible assets with indefinite lives are assessed at least annually for impairment by comparing their fair value to their carrying value. However, these intangible assets may be assessed more frequently for impairment if events or changes in circumstances, such as declines in revenues, earnings and cash flows or material adverse changes in business climate, indicate that their carrying value may be impaired.\nAs of September 30, 2022, a 1% reduction in the estimated revenue growth rate would decrease the fair value of Mohegan Pennsylvanias intangible assets by approximately $11 million and a 1% increase in the discount rate would decrease the fair value of Mohegan Pennsylvanias intangible assets by approximately $42 million.\nIntangible assets with finite lives are assessed for impairment whenever events or circumstances indicate that their carrying value may not be recoverable. If necessary, an impairment charge is recognized when the carrying value of the asset (asset group) exceeds the estimated undiscounted cash flows expected from the use and eventual disposition of the asset (asset group). The amount of the impairment charge, if any, is calculated as the excess of the assets (asset groups) carrying value over its fair value.\nThe evaluation of intangible assets for impairment requires the use of estimates about future cash flows. Such estimates are, by their nature, subjective. Actual results may differ materially from our estimates and could result in impairment charges in the future.\nWarrants and Put Option\nWe account for our warrants and put option liabilities in accordance with guidance provided by Accounting Standards Codification (ASC) Topic 815, Derivatives and Hedging (ASC 815). Under ASC 815, the warrants and put option do not meet the criteria for equity treatment. Accordingly, these instruments are classified as long-term liabilities and are re-measured at their estimated fair values at each reporting date. The estimated fair value of the warrants and put option was determined by utilizing the income approach (discounted cash flow method) and a binomial lattice model.\nRevenues from Casino Operating and Services Agreement\nWe operate the Niagara Resorts under the terms of a 21-year Casino Operating and Services Agreement with the Ontario Lottery and Gaming Corporation. Pursuant to the laws of Canada and the Province of Ontario, the Ontario Lottery and Gaming Corporation retains legal authority to conduct and manage lottery schemes on behalf of the Province of Ontario. We are acting as a service provider to the Ontario Lottery and Gaming Corporation under the Casino Operating and Services Agreement and, therefore, recognize gaming revenues net of amounts due to the Ontario Lottery and Gaming Corporation. We retain all non-gaming revenues and recognize these amounts on a gross basis. The Casino Operating and Services Agreement represents a series of distinct goods and services and, therefore, is deemed to be a single performance obligation. The transaction price under the Casino Operating and Services Agreement includes both fixed and variable consideration. The fixed consideration is comprised of an annual service provider fee and additional consideration for permitted capital expenditures up to an annual cap. The fixed consideration is recognized as revenue on a straight-line basis over the term of the Casino Operating and Services Agreement. The variable consideration consists of 70% of Gaming Revenues (as defined under the Casino Operating and Services Agreement), in excess of a guaranteed annual minimum amount payable to the Ontario Lottery and Gaming Corporation (the Threshold). Annual Threshold amounts are contractually established and vary from year to year. If gaming revenues are less than the Threshold for any given year, we are obligated to make a payment to cover the related shortfall. The variable consideration is recognized as revenue as services are rendered under the terms of the Casino Operating and Services Agreement. We measure our progress in satisfying this performance obligation based on the output method, which aligns with the benefits provided to the Ontario Lottery and Gaming Corporation. Projected revenues are estimated based on the most likely amount within a range of possible outcomes to the extent that a significant reversal in the amount of cumulative revenues recognized is not probable of occurring. The difference between revenues recognized and cash received is recorded as an asset or a liability and classified as short-term or long-term based upon the anticipated timing of reversal. In the event an asset is recorded, such asset is assessed at least annually for impairment. In June 2021, the Casino Operating and Services Agreement was amended to provide for, among other things, a three-year replacement of the annual Threshold, subject to certain\nconditions, with a fixed revenue share percentage. The annual Threshold may be reinstated at any time during this three-year period under certain conditions specified in the amended Casino Operating and Services Agreement. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nMarket risk is the risk of loss arising from adverse changes in market rates and prices, such as interest rates, foreign currency exchange rates and commodity prices. As of September 30, 2022, our primary exposure to market risk was interest rate risk associated with our credit facilities which accrued interest on the basis of base rate, secured overnight financing rate and bankers acceptance rate formulas, plus applicable rates, as defined under the credit facilities.\nWe attempt to manage our interest rate risk through a controlled combination of long-term fixed rate borrowings and variable rate borrowings in accordance with established policies and procedures. We do not hold or issue financial instruments for speculative or trading purposes.\nThe following table presents information about our debt obligations as of September 30, 2022 that were sensitive to changes in interest rates. The table presents principal payments and related weighted average interest rates by expected maturity dates. Weighted average variable interest rates were based on implied forward rates in respective yield curves, which should not be considered to be precise indicators of actual future interest rates. Fair values for our debt obligations were primarily based on quoted market prices or prices of similar instruments as of September 30, 2022.\nExpected Maturity Date by Fiscal Year\n(in thousands) 2023 2024 2025 2026 2027 Thereafter Total Fair Value\nLong-term debt obligations, including current portions (1):\nFixed rate $23,139 $15,970 $500,025 $1,485,203 $312,022 $358 $2,336,717 $1,993,613\nAverage interest rate - - 7.9% 7.6% 17.0% - 8.8%\nVariable rate $24,263 $79,837 $- $52,277 $- $29,109 $185,486 $185,239\nAverage interest rate (2) 8.3% 7.9% - 7.0% - 8.0% 7.7%\n_________\n(1)Excludes unamortized debt issuance costs and discounts.\n(2)A 100-basis point change in average interest rate would impact annual interest expense by approximately $1.9 million. Item 8. Financial Statements and Supplementary Data.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm (PCAOB ID 34)\nConsolidated Balance Sheets of the Mohegan Tribal Gaming Authority as of\nSeptember 30, 2022 and 2021\nConsolidated Statements of Operations and Comprehensive Income (Loss) of the Mohegan Tribal Gaming Authority for the\nFiscal Years Ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Changes in Capital of the Mohegan Tribal Gaming Authority for the\nFiscal Years Ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Cash Flows of the Mohegan Tribal Gaming Authority for the\nFiscal Years Ended September 30, 2022, 2021 and 2020\nNotes to Consolidated Financial Statements of the Mohegan Tribal Gaming Authority\nSchedule II-Valuation and Qualifying Accounts and Reserves\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Management Board of Mohegan Tribal Gaming Authority:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Mohegan Tribal Gaming Authority and subsidiaries (the \"Company\") as of September 30, 2022 and 2021, the related consolidated statements of operations and comprehensive income (loss), changes in capital, and cash flows for each of the three years in the period ended September 30, 2022, and the related notes and the schedule as listed in the Index at Item 15(a)(2) (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021 and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB and in accordance with auditing standards generally accepted in the United States of America. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nWarrants and Put Option Liabilities - Refer to Note 6 to the financial statements\nCritical Audit Matter Description\nAs described in Note 6 to the consolidated financial statements, on November 4, 2021, the Company entered into a warrant agreement to issue detachable warrants (the Warrants) that can be converted into up to a total of 4,400 shares of capital in MGE Korea Holding III Limited. Holders of unexercised Warrants have the right to require the parent of MGE Korea Holding III Limited to purchase all of the unexercised Warrants that they hold at certain relevant times (the Put Option). The Warrants and the Put Option are classified as long-term liabilities and are re-measured at their estimated fair values at each reporting date. The estimated fair value of the Warrants and the Put Option was determined by utilizing the income approach (discounted cash flow method) and a binomial lattice model. This valuation approach utilized Level 3 inputs. Management applied significant judgment in determining the appropriate accounting treatment and inputs utilized in its quarterly fair value model.\nAuditing the fair value of the Companys Warrants and Put Option liabilities involved a high degree of subjectivity in evaluating whether managements estimates and assumptions of projected cash flows and the selection of the discount rates and volatility inputs used to derive the fair value were reasonable, including the need to involve our fair value specialists.\nHow the Critical Audit Matter was Addressed in the Audit\nWe evaluated managements projected cash flows by benchmarking projected cash flows against comparable companies, evaluating inputs used in the fair value model and gathering audit evidence to support those inputs.\nWe evaluated the reasonableness of managements cash flow estimates by:\n◦ Comparing to historical results from other similar properties.\n◦ Comparing to internal communications to management, external parties and the Management Board.\n◦ Evaluating inputs used in the fair value model such as projected capital expenditures and pre-opening costs and expenses, and verifying that those projections are reasonable and supportable based on audit evidence.\nWith the assistance of our fair value specialists, we evaluated the reasonableness of the discount rates and volatility inputs by:\n◦ Testing the source information underlying the determination of the discount rates, volatility inputs and the mathematical accuracy of the calculations.\n◦ Developing a range of independent estimates and comparing those estimates to the discount rates and volatility inputs selected by management.\n/s/ Deloitte & Touche LLP\nHartford, Connecticut\nDecember 20, 2022\nWe have served as the Companys auditor since 2018.\nMOHEGAN TRIBAL GAMING AUTHORITY\nCONSOLIDATED BALANCE SHEETS\n(in thousands)\nSeptember 30, 2022 September 30, 2021\nASSETS\nCurrent assets:\nCash and cash equivalents $ 164,671 $ 149,822\nRestricted cash and cash equivalents 8,838 5,259\nAccounts receivable, net 45,995 40,772\nInventories 19,662 18,455\nDue from Ontario Lottery and Gaming Corporation 8,906 16,711\nContract asset 35,478 32,665\nOther current assets 35,551 56,466\nTotal current assets 319,101 320,150\nRestricted cash and cash equivalents\n347,005 9,616\nProperty and equipment, net\n1,643,790 1,531,619\nRight-of-use assets 305,480 362,008\nIntangible assets, net 311,526 327,255\nContract asset, net of current portion 51,979 87,262\nNotes receivable\n2,514 2,514\nOther assets, net\n67,522 89,453\nTotal assets $ 3,048,917 $ 2,729,877\nLIABILITIES AND CAPITAL\nCurrent liabilities:\nCurrent portion of long-term debt $ 47,402 $ 80,276\nCurrent portion of finance lease obligations 4,491 5,836\nCurrent portion of operating lease obligations 5,473 9,616\nTrade payables 16,465 23,675\nAccrued payroll 64,332 53,352\nConstruction payables 61,166 53,120\nAccrued interest payable 38,947 37,546\nDue to Ontario Lottery and Gaming Corporation 3,582 22,253\nOther current liabilities 165,048 159,802\nTotal current liabilities 406,906 445,476\nLong-term debt, net of current portion\n2,304,551 1,858,478\nFinance lease obligations, net of current portion\n107,977 109,189\nOperating lease obligations, net of current portion 357,139 410,090\nWarrants and put option liabilities 47,300 -\nAccrued payroll\n- 3,529\nOther long-term liabilities\n38,943 36,357\nTotal liabilities 3,262,816 2,863,119\nCommitments and Contingencies\nCapital:\nRetained deficit (130,551) (133,087)\nAccumulated other comprehensive loss (88,146) (2,065)\nTotal capital attributable to Mohegan Tribal Gaming Authority (218,697) (135,152)\nNon-controlling interests 4,798 1,910\nTotal capital (213,899) (133,242)\nTotal liabilities and capital $ 3,048,917 $ 2,729,877\nThe accompanying notes are an integral part of these consolidated financial statements.\nMOHEGAN TRIBAL GAMING AUTHORITY\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME (LOSS)\n(in thousands)\nFor the For the For the\nFiscal Year Ended Fiscal Year Ended Fiscal Year Ended\nSeptember 30, 2022 September 30, 2021 September 30, 2020\nRevenues:\nGaming $ 1,122,864 $ 910,378 $ 799,647\nFood and beverage 134,724 73,631 103,678\nHotel 115,828 84,307 69,113\nRetail, entertainment and other 217,095 160,517 142,524\nNet revenues 1,590,511 1,228,833 1,114,962\nOperating costs and expenses:\nGaming, including related party transactions of\n$3,235, $1,513 and $2,265, respectively\n573,561 470,723 444,875\nFood and beverage 111,379 63,414 91,662\nHotel, including related party transactions of\n$8,644, $8,644 and $8,644, respectively\n47,689 36,097 35,578\nRetail, entertainment and other 79,289 38,390 54,020\nAdvertising, general and administrative, including related party\ntransactions of\n$48,723, $35,155 and $28,873, respectively\n309,160 231,084 226,588\nCorporate, including related party transactions of\n$7,551, $6,761 and $7,221, respectively\n65,034 61,301 44,177\nDepreciation and amortization 102,625 105,335 109,067\nImpairment of tangible assets 23,565 - -\nImpairment of intangible assets 12,869 - 126,596\nOther, net 19,106 38,032 15,616\nTotal operating costs and expenses 1,344,277 1,044,376 1,148,179\nIncome (loss) from operations 246,234 184,457 (33,217)\nOther income (expense):\nInterest income 168 123 1,754\nInterest expense, net (206,314) (171,844) (134,925)\nGain (loss) on modification and early extinguishment of debt 630 (21,793) (2,888)\nGain on fair value adjustment 43,020 - -\nOther, net 268 10,057 566\nTotal other expense (162,228) (183,457) (135,493)\nIncome (loss) before income tax 84,006 1,000 (168,710)\nIncome tax benefit (provision) (8,810) 6,353 6,694\nNet income (loss) 75,196 7,353 (162,016)\nIncome attributable to non-controlling interests (545) (622) (139)\nNet income (loss) attributable to Mohegan Tribal Gaming Authority 74,651 6,731 (162,155)\nComprehensive income (loss):\nForeign currency translation adjustment (86,081) (929) 7,303\nOther - 17 (48)\nOther comprehensive income (loss) (86,081) (912) 7,255\nOther comprehensive income attributable to non-controlling interests - (1,376) (399)\nOther comprehensive income (loss) attributable to\nMohegan Tribal Gaming Authority (86,081) (2,288) 6,856\nComprehensive income (loss) attributable to Mohegan Tribal Gaming Authority\n$ (11,430) $ 4,443 $ (155,299)\nThe accompanying notes are an integral part of these consolidated financial statements.\nMOHEGAN TRIBAL GAMING AUTHORITY\nCONSOLIDATED STATEMENTS OF CHANGES IN CAPITAL\n(in thousands)\nRetained Earnings (Deficit) Additional Paid-in Capital Accumulated Other Comprehensive Income (Loss) Total Capital Attributable to Mohegan Tribal Gaming Authority Non-controlling Interests Total\nCapital\nBalance, September 30, 2019 $ 137,124 $ - $ (6,633) $ 130,491 $ 6,942 $ 137,433\nNet income (loss) (162,155) - - (162,155) 139 (162,016)\nForeign currency translation adjustment - - 6,904 6,904 399 7,303\nContribution from Mohegan Tribe 10,000 - - 10,000 - 10,000\nDistributions to Mohegan Tribe (60,000) - - (60,000) - (60,000)\nDistributions to Salishan Company, LLC (661) - - (661) - (661)\nOther - - (48) (48) - (48)\nBalance, September 30, 2020 (75,692) - 223 (75,469) 7,480 (67,989)\nNet income 6,731 - - 6,731 622 7,353\nForeign currency translation adjustment - - (2,305) (2,305) 1,376 (929)\nContribution from Mohegan Tribe - 2,814 - 2,814 - 2,814\nDistributions to Mohegan Tribe (63,186) (2,814) - (66,000) - (66,000)\nDistributions to Salishan Company, LLC (940) - - (940) - (940)\nOther - - 17 17 (7,568) (7,551)\nBalance, September 30, 2021 (133,087) - (2,065) (135,152) 1,910 (133,242)\nNet income 74,651 - - 74,651 545 75,196\nForeign currency translation adjustment - - (86,081) (86,081) - (86,081)\nContribution from Mohegan Tribe - 325 - 325 - 325\nDistributions to Mohegan Tribe (71,075) (325) - (71,400) - (71,400)\nDistributions to Salishan Company, LLC (1,040) - - (1,040) - (1,040)\nOther - - - - 2,343 2,343\nBalance, September 30, 2022 $ (130,551) $ - $ (88,146) $ (218,697) $ 4,798 $ (213,899)\nThe accompanying notes are an integral part of these consolidated financial statements.\nMOHEGAN TRIBAL GAMING AUTHORITY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nFor the For the For the\nFiscal Year Ended Fiscal Year Ended Fiscal Year Ended\nSeptember 30, 2022 September 30, 2021 September 30, 2020\nCash flows provided by operating activities:\nNet income (loss) $ 75,196 $ 7,353 $ (162,016)\nAdjustments to reconcile net income (loss) to net cash flows provided by operating activities:\nDepreciation and amortization\n102,625 105,335 109,067\nNon-cash operating lease expense 8,335 10,911 12,465\nAccretion of discounts\n1,984 1,670 1,109\nAmortization of discounts and debt issuance costs\n15,739 19,415 19,205\nPaid-in-kind interest 35,059 - -\nGain on fair value adjustment (43,020) - -\n(Gain) loss on modification and early extinguishment of debt (704) 21,418 -\nProvision for losses on receivables\n6,095 4,709 4,592\nDeferred income taxes 9,102 (6,716) (7,049)\nImpairment charges 36,434 - 126,596\nOther, net\n4,746 (6,676) 1,585\nChanges in operating assets and liabilities, net of effect of the Niagara Resorts acquisition:\nAccounts receivable, net (12,618) (1,617) 4,423\nInventories (1,419) (1,518) 1,435\nDue from Ontario Lottery and Gaming Corporation 7,463 (13,768) 7,571\nContract asset 24,817 16,244 (77,026)\nOther assets 21,789 (772) 7,797\nTrade payables (7,115) 126 5,125\nAccrued interest payable 1,899 11,176 6,550\nDue to Ontario Lottery and Gaming Corporation (18,397) 5,835 (1,983)\nOperating lease obligations (4,345) 13,800 3,105\nOther liabilities 24,650 40,842 (14,339)\nNet cash flows provided by operating activities 288,315 227,767 48,212\nCash flows used in investing activities:\nPurchases of property and equipment\n(287,211) (48,263) (149,031)\nInvestments related to the Inspire Korea project (5,611) - (7,980)\nInvestment in Mohegan Hotel Holding, LLC - - (10,750)\nAcquisition of the Niagara Resorts, net of cash acquired - - (1,666)\nOther, net (2,077) (1,078) (3,929)\nNet cash flows used in investing activities (294,899) (49,341) (173,356)\nCash flows provided by (used in) financing activities:\nProceeds from revolving credit facilities 1,064,176 1,056,296 730,772\nRepayments on revolving credit facilities (1,125,253) (1,201,511) (609,345)\nProceeds from issuance of long-term debt 698,358 1,223,802 7,845\nRepayments of long-term debt (55,884) (1,143,507) (76,458)\nPayments on finance lease obligations (5,553) (1,145) (1,298)\nContributions from affiliates 325 2,814 10,000\nDistributions to affiliates (72,440) (66,940) (60,661)\nPayments of financing fees (66,301) (24,586) (13,752)\nOther, net 736 (1,607) (1,527)\nNet cash flows provided by (used in) financing activities 438,164 (156,384) (14,424)\nNet increase (decrease) in cash, cash equivalents, restricted cash and restricted cash equivalents 431,580 22,042 (139,568)\nEffect of exchange rate on cash, cash equivalents, restricted cash and restricted cash equivalents (75,763) 586 908\nCash, cash equivalents, restricted cash and restricted cash equivalents at beginning of year 164,697 142,069 280,729\nCash, cash equivalents, restricted cash and restricted cash equivalents at end of year $ 520,514 $ 164,697 $ 142,069\nReconciliation of cash, cash equivalents, restricted cash and restricted cash equivalents to the consolidated balance sheets:\nCash and cash equivalents $ 164,671 $ 149,822 $ 112,665\nRestricted cash and cash equivalents, current 8,838 5,259 934\nRestricted cash and cash equivalents, non-current 347,005 9,616 28,470\nCash, cash equivalents, restricted cash and restricted cash equivalents\n$ 520,514 $ 164,697 $ 142,069\nSupplemental disclosures:\nCash paid for interest $ 165,192 $ 139,267 $ 114,873\nNon-cash transactions:\nRight-of-use assets additions (reductions) $ (26,009) $ (53,392) $ 426,403\nOperating lease obligations additions (reductions) $ (26,009) $ (43,146) $ 426,548\nPaid-in-kind interest capitalized $ 7,390 $ - $ -\nPaid-in-kind interest converted to debt $ 36,998 $ - $ -\nIncrease in construction payables $ 8,046 $ 22,052 $ 38,172\nFinance lease assets and obligations\n$ - $ 79,187 $ 2,879\nPrior senior secured credit facility reduction $ - $ - $ 10,514\nDerecognition of build-to-suit asset and liability $ - $ - $ 90,675\nThe accompanying notes are an integral part of these consolidated financial statements.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 - Organization\nOrganization\nWe were established by the Mohegan Tribe of Indians of Connecticut (the Mohegan Tribe) in July 1995. We have the exclusive authority to conduct and regulate gaming activities for the Mohegan Tribe on tribal lands and the non-exclusive authority to conduct such activities elsewhere.\nWe are primarily engaged in the ownership, operation and development of integrated entertainment facilities. We currently own two facilities in the United States and operate or manage five other facilities in the United States and Canada. We are also currently developing a facility in South Korea, the Inspire Entertainment Resort located adjacent to the Incheon International Airport (Inspire Korea).\nOur Properties\nMohegan Sun\nWe own Mohegan Sun which is located on an approximately 196-acre site on the Mohegan Tribe's reservation overlooking the Thames River. The facility is one of two authorized gaming and entertainment facilities in the state of Connecticut and competes primarily with gaming operations in Massachusetts, Rhode Island and New York.\nMohegan Pennsylvania\nWe own Mohegan Pennsylvania which is located on an approximately 400-acre site in Wilkes-Barre, Pennsylvania, and features live harness racing. The facility is one of 16 gaming and entertainment facilities in the state of Pennsylvania and competes primarily with facilities in Bethlehem and Mount Pocono.\nInspire Korea\nIn February 2016, Inspire Integrated Resort Co., Ltd. (Inspire Integrated Resort), a wholly-owned subsidiary, was awarded pre-approval for a gaming license to be issued upon completion of the construction of Inspire Korea in South Korea. This license would permit gaming only by holders of non-Korean passports. In August 2016, we entered into an agreement with the Incheon International Airport Authority for the long-term lease and development of approximately 4.4 million square meters of land located directly adjacent to Terminal 2 of the Incheon International Airport. The integrated entertainment resort phase of Inspire Korea is planned to open in late 2023, with the casino anticipated to open in January 2024. Inspire Korea will compete primarily with another casino resort located in Incheon and several other smaller casino-only operations located in downtown Seoul.\nNiagara Resorts\nWe operate the Niagara Resorts under a Casino Operating and Services Agreement. The Niagara Resorts include Fallsview Casino Resort, Casino Niagara and the OLG Stage at Fallsview Casino, all in Niagara Falls, Canada. Fallsview Casino Resort, which overlooks the iconic Horseshoe Falls, and Casino Niagara are the only two gaming and entertainment facilities in Niagara Falls, Canada. The Niagara Resorts compete primarily with facilities in Toronto, Ontario and Niagara Falls, New York.\nMohegan Casino Las Vegas\nWe operate Mohegan Casino Las Vegas, a more than 60,000-square-foot gaming facility at Virgin Hotels Las Vegas, in Las Vegas, Nevada. The integrated resort, including Mohegan Casino Las Vegas, competes primarily with resorts and casinos in Las Vegas.\nilani Casino Resort\nWe developed and currently operate ilani Casino Resort in Clark County, Washington, a gaming and entertainment facility owned by the federally-recognized Cowlitz Indian Tribe and the Cowlitz Tribal Gaming Authority. ilani Casino Resort is located approximately 16 miles north of Portland with direct access to Interstate 5.\nResorts Casino Hotel\nWe manage Resorts Casino Hotel and own 10% of the casino's holding company and its subsidiaries, including those conducting or licensing iGaming and retail sports wagering in the state of New Jersey. Resorts Casino Hotel, the first casino hotel in Atlantic City, New Jersey, opened in 1978, becoming the first legal casino outside of the state of Nevada. Resorts\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nCasino Hotel is one of nine casinos operating in Atlantic City and competes primarily with resorts and casinos in Atlantic City, New Jersey, Pennsylvania and New York.\nImpact of the COVID-19 Pandemic\nIn March 2020, the World Health Organization declared the outbreak of COVID-19 a global pandemic and the United States federal government declared it a national emergency. The spread of COVID-19 has affected most segments of the global economy, including our operations. In March 2020, we temporarily suspended operations at our properties in the United States and Canada to ensure the health and safety of our employees, customers and the surrounding communities in which we operate, consistent with directives from various governmental bodies. All of our properties in the United States were reopened by July 2020. Our properties in Canada reopened in July 2021, but were temporarily closed again from January 5, 2022 through January 30, 2022, due to a resurgence of COVID-19 at that time.\nWhile we are operating at full capacity as of the filing of this Annual Report on Form 10-K, COVID-19 has had a significant impact on our operations, the full extent of which depends on future developments which are highly uncertain and cannot be predicted with confidence. Such developments include the following:\nthe duration of COVID-19 or the extent of any resurgence or variants of COVID-19 in areas where we operate or where our customers are located;\nthe manner in which our customers, suppliers and other third parties respond to COVID-19, including the perception of safety and health measures we implemented;\nnew information that may emerge concerning the severity of COVID-19 and the actions to contain or treat it;\ngeneral, local or national economic conditions; and\nconsumer confidence.\nAccordingly, we cannot reasonably estimate the extent to which COVID-19 will further impact our future financial condition, results of operations and cash flows.\nWe could experience other potential adverse impacts as a result of COVID-19, including, but not limited to, charges from further adjustments to the carrying value of our intangible assets, as well as other long-lived asset impairment charges. Actual results may differ materially from our current estimates as the scope of COVID-19 evolves, depending largely, but not exclusively, on the duration and extent of any business disruptions.\nNote 2 - Basis of Presentation and Summary of Significant Accounting Policies\nPrinciples of Consolidation\nThe accompanying Financial Statements include the accounts of the Company and its majority and wholly-owned subsidiaries and entities. The accounts of MGE Niagara Entertainment Inc. (MGE Niagara) are consolidated into the accounts of the Company as MGE Niagara is a variable interest entity and the Company is deemed to be the primary beneficiary of MGE Niagara. In consolidation, all intercompany balances and transactions are eliminated.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (US GAAP) requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, expenses and related disclosures of contingent assets and liabilities. Actual amounts could differ from those estimates.\nCash and Cash Equivalents\nCash and cash equivalents consist of deposits that can be redeemed on demand and highly liquid investments with original maturities of three months or less from the date of purchase. Cash and cash equivalents include all operating cash and in-house funds.\nRestricted Cash and Cash Equivalents\nRestricted cash and cash equivalents consist of deposits that are restricted as to their withdrawal or use. Restricted cash and cash equivalents primarily include cash intended to be used for Inspire Korea.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nAccounts Receivable\nAccounts receivable consists of casino receivables, which represent credit extended to approved casino customers, and hotel and other non-gaming receivables. We maintain a reserve for doubtful collection of these receivables, which primarily relates to casino receivables.\nInventories\nInventories are stated at the lower of cost or net realizable value and consist primarily of food and beverage, retail, hotel and operating supplies. Cost is determined using the average cost method.\nDue from/to Ontario Lottery and Gaming Corporation\nOn a bi-weekly basis, the Ontario Lottery and Gaming Corporation remits estimated amounts due to us pursuant to the terms of the Casino Operating and Services Agreement. Any such remittance that is due, but not yet received, is recorded within due from Ontario Lottery and Gaming Corporation. Differences between actual and estimated amounts due are separately settled with the Ontario Lottery and Gaming Corporation on an annual basis, however, a quarterly interim reconciliation process is available. Any settlement amount owed to the Ontario Lottery and Gaming Corporation is recorded within due to Ontario Lottery and Gaming Corporation.\nProperty and Equipment\nProperty and equipment are stated at cost. Depreciation is recognized over the estimated useful lives of the assets, other than land, on a straight-line basis. Leasehold improvements are amortized over the shorter of the lease terms or the estimated useful lives of the improvements. Estimated useful lives by asset categories are as follows:\nBuildings and land improvements 40 years\nFurniture and equipment 3 - 7 years\nThe costs of significant improvements are capitalized. Costs of normal repairs and maintenance are expensed as incurred.\nProperty and equipment are assessed for impairment whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable. If it is determined that the carrying amounts may not be recoverable based on current and future levels of income and cash flows, as well as other factors, an impairment charge will be recognized at such time.\nIntangible Assets\nIntangible assets consist primarily of Mohegan Sun's trademark and Mohegan Pennsylvania's various gaming licenses. These intangible assets all have indefinite lives. Intangible assets with indefinite lives are assessed at least annually for impairment by comparing their fair value to their carrying value. However, these intangible assets may be assessed more frequently for impairment if events or changes in circumstances, such as declines in revenues, earnings and cash flows or material adverse changes in business climate, indicate that their carrying value may be impaired.\nIntangible assets with finite lives are assessed for impairment whenever events or circumstances indicate that their carrying value may not be recoverable. If necessary, an impairment charge is recognized when the carrying value of the asset (asset group) exceeds the estimated undiscounted cash flows expected from the use and eventual disposition of the asset (asset group). The amount of the impairment charge, if any, is calculated as the excess of the assets (asset groups) carrying value over its fair value.\nThe evaluation of intangible assets for impairment requires the use of estimates about future cash flows. Such estimates are, by their nature, subjective. Actual results may differ materially from our estimates and could result in impairment charges in the future.\nDebt Issuance Costs\nDebt issuance costs are amortized to interest expense based on the effective interest method.\nSelf-insurance Reserves\nWe are self-insured up to certain limits for costs associated with workers compensation, general liability and employee medical coverage. Insurance claims and reserves include estimated settlements of known claims, as well as estimates of incurred but not reported claims. These reserves are recorded within other current liabilities. In estimating self-insurance reserves, we consider historical loss experiences and expected levels of costs per claim. Claims are accounted for based on estimates of undiscounted claims, including claims incurred but not reported.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nLeases\nWe account for leases in accordance with guidance provided by Accounting Standards Updates (ASU) No. 2016-02, Leases (Topic 842) (ASU 2016-02), which requires, among other things, lessees to recognize a right-of-use asset and liability for leases with terms in excess of 12 months.\nWe determine if a contract is, or contains, a lease at its inception or at the time of any modification. A contract is, or contains, a lease if the contract conveys the right to control the use of an identified asset for a period of time in exchange for consideration. Control over the use of the identified asset requires that the lessee has both: (i) the right to obtain substantially all of the economic benefits from the use of the asset and (ii) the right to direct the use of the asset.\nRight-of-use operating and finance lease assets and liabilities are recognized on the respective lease commencement date based on the present value of future lease payments over the expected lease term. An expected lease term includes any option to extend or terminate the lease if it is reasonably certain that we will exercise such option. We utilize the incremental borrowing rate (IBR) applicable to the lease as determined at the lease commencement date to calculate the present value of future lease payments. The applicable IBR is determined based on the treasury group to which the leasing entity belongs and that groups estimated interest rate for collateralized borrowings over a similar term as the future lease payments. Operating lease expense for fixed lease payments is recognized on a straight-line basis over the expected lease term. Finance lease assets are recorded within property and equipment, net and are amortized on a straight-line basis over the related lease term.\nWarrants and Put Option\nWe account for our warrants and put option liabilities in accordance with guidance provided by Accounting Standards Codification (ASC) Topic 815, Derivatives and Hedging (ASC 815). Under ASC 815 the warrants and put option do not meet the criteria for equity treatment. Accordingly, these instruments are classified as long-term liabilities and are re-measured at their estimated fair values at each reporting date. The estimated fair value of the warrants and put option was determined by utilizing the income approach (discounted cash flow method) and a binomial lattice model.\nRevenue Recognition\nOur revenues from contracts with customers consist of gaming, including racing and online casino gaming and sports wagering, food and beverage, hotel, retail, entertainment and convention related transactions, as well as management and development services related to management and development contracts with third-party facilities.\nThe transaction price in a gaming contract is the difference between gaming wins and losses, not the total amount wagered. The transaction price in a racing contract, inclusive of live racing at our facilities, as well as import and export arrangements, is the commission received from the pari-mutuel pool less contractual fees and obligations, which primarily consist of purse funding requirements, simulcasting fees, tote fees and certain pari-mutuel taxes that are directly related to racing operations. The transaction price in online casino gaming and sports wagering is the share of the revenues that we expect to collect as the agent. The transaction prices in food and beverage, hotel, retail, entertainment and convention contracts are the net amounts collected for such goods and services. Sales and other taxes collected on behalf of governmental authorities are accounted for on a net basis and are not recorded within revenues or expenses. The transaction prices in management and development service contracts are the amounts collected for services rendered in accordance with contractual terms, inclusive of reimbursable costs and expenses.\nWe recognize gaming revenues as amounts wagered less prizes paid out. Gaming transactions involve two performance obligations for customers participating in our loyalty reward programs and a single performance obligation for customers that do not participate. We apply a practical expedient by accounting for gaming contracts on a portfolio basis, as such contracts share similar characteristics. The effects on our Financial Statements under this approach do not differ materially versus under an individual contract basis. We utilize a deferred revenue model to reduce gaming revenues by the estimated fair value of loyalty points earned by customers. Revenues allocated to gaming performance obligations are recognized when gaming occurs as such activities are settled immediately. Revenues allocated to the loyalty points deferred revenue liability are recognized when loyalty points are redeemed. The deferred revenue liability is based on the estimated stand-alone selling price of loyalty points earned after factoring in the likelihood of redemption.\nFood and beverage, hotel, retail, entertainment and convention transactions have been determined to be separate, stand-alone performance obligations and revenues for such contracts are recognized when the related goods and services are transferred to customers. Revenues from contracts which include a combination of these transactions are allocated on a pro rata basis based on the stand-alone selling price of the goods and services. Revenues from food and beverage, hotel, retail, entertainment and other services, including revenues associated with loyalty point redemptions, are recognized at the time such service is performed. Minimum rental revenues are recognized on a straight-line basis over the terms of the related leases. Percentage rental revenues are recognized in the periods in which the tenants exceed their respective percentage rent thresholds.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nManagement and development services have been determined to be separate, stand-alone performance obligations, and revenues for such contracts are recognized when the related services are performed. We recognize management fees pursuant to the respective management agreement, usually as a percentage of the managed entitys earnings during the period. Development fees are recognized pursuant to the respective development agreement, typically as a percentage of construction costs incurred during the period. Management and development fees are recorded within retail, entertainment and other revenues.\nWe operate the Niagara Resorts under the terms of a 21-year Casino Operating and Services Agreement with the Ontario Lottery and Gaming Corporation. Pursuant to the laws of Canada and the Province of Ontario, the Ontario Lottery and Gaming Corporation retains legal authority to conduct and manage lottery schemes on behalf of the Province of Ontario. We are acting as a service provider to the Ontario Lottery and Gaming Corporation under the Casino Operating and Services Agreement and, therefore, recognize gaming revenues net of amounts due to the Ontario Lottery and Gaming Corporation. We retain all non-gaming revenues and recognize these amounts on a gross basis. The Casino Operating and Services Agreement represents a series of distinct goods and services and, therefore, is deemed to be a single performance obligation. The transaction price under the Casino Operating and Services Agreement includes both fixed and variable consideration. The fixed consideration is comprised of an annual service provider fee and additional consideration for permitted capital expenditures up to an annual cap. The fixed consideration is recognized as revenue on a straight-line basis over the term of the Casino Operating and Services Agreement. The variable consideration consists of 70% of Gaming Revenues (as defined under the Casino Operating and Services Agreement), in excess of a guaranteed annual minimum amount payable to the Ontario Lottery and Gaming Corporation (the Threshold). Annual Threshold amounts are contractually established and vary from year to year. If gaming revenues are less than the Threshold for any given year, we are obligated to make a payment to cover the related shortfall. The variable consideration is recognized as revenue as services are rendered under the terms of the Casino Operating and Services Agreement. We measure our progress in satisfying this performance obligation based on the output method, which aligns with the benefits provided to the Ontario Lottery and Gaming Corporation. Projected revenues are estimated based on the most likely amount within a range of possible outcomes to the extent that a significant reversal in the amount of cumulative revenues recognized is not probable of occurring. The difference between revenues recognized and cash received is recorded as an asset or a liability and classified as short-term or long-term based upon the anticipated timing of reversal. In the event an asset is recorded, such asset is assessed at least annually for impairment.\nIn June 2021, the Casino Operating and Services Agreement was amended to provide for, among other things, a three-year replacement of the annual Threshold, subject to certain conditions, with a fixed revenue share percentage. The annual Threshold may be reinstated at any time during this three-year period under certain conditions specified in the amended Casino Operating and Services Agreement.\nGaming Costs and Expenses\nGaming costs and expenses primarily represent portions of gaming revenues that must be paid to the State of Connecticut and the Pennsylvania Gaming Control Board (the PGCB). Gaming costs and expenses also include, among other things, payroll costs, expenses associated with the operation of slot machines, table games, poker, online casino gaming, live harness racing, racebook and sportsbook, certain marketing expenditures and promotional expenses related to loyalty point and coupon redemptions.\nAdvertising Costs and Expenses\nProduction costs are expensed the first time the advertisement takes place. Prepaid rental fees associated with billboard advertisements are capitalized and amortized over the terms of the related agreements. Advertising costs and expenses totaled $36.1 million, $19.3 million and $22.5 million for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nPre-opening Costs and Expenses\nCosts of start-up activities are expensed as incurred. Pre-opening costs and expenses totaled $15.8 million, $37.1 million and $15.6 million for the fiscal years ended September 30, 2022, 2021 and 2020, respectively, and were recorded within other, net.\nIncome Taxes\nSimilar to other sovereign governments, the Mohegan Tribe and its entities, including the Company, are not subject to United States federal income taxes. However, certain of our non-tribal entities are subject to income taxes in various domestic and foreign jurisdictions.\nWe account for income taxes in accordance with guidance provided by ASC Topic 740, Income Taxes (ASC 740). Under ASC 740, deferred tax assets and liabilities are determined based on the differences between the financial statement carrying amounts and the tax basis of existing assets and liabilities, and are measured at the prevailing enacted tax rates that will be in\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\neffect when these differences are settled or realized. ASC 740 requires that deferred tax assets be reduced by a valuation allowance if it is more-likely-than-not that some portion, or all, of the deferred tax assets will not be realized.\nASC 740 also creates a single model to address uncertainty in tax positions and clarifies the accounting for uncertainty in income taxes recognized in an entitys financial statements by prescribing the minimum recognition threshold a tax position is required to meet before being recognized in the entity's financial statements. In addition, ASC 740 provides guidance with respect to de-recognition, measurement, classification, interest and penalties, accounting in interim periods and disclosure requirements. Our uncertain tax positions are insignificant.\nForeign Currency\nThe financial position and operating results of foreign operations are consolidated using the local currency as the functional currency. Local currency assets and liabilities are translated at the end-of-period rates, while local currency revenues and expenses are translated at the average rates in effect during the period. Local currency equity is translated at historical rates and the resulting cumulative translation adjustments are recorded as a component of accumulated other comprehensive income or loss.\nFair Value of Financial Instruments\nWe apply the following fair value hierarchy, which prioritizes the inputs utilized to measure fair value into three levels:\nLevel 1 - Quoted prices for identical assets or liabilities in active markets;\nLevel 2 - Quoted prices for similar assets or liabilities in active markets, quoted prices for identical or similar assets or liabilities in inactive markets or valuations based on models where the significant inputs are observable or can be corroborated by observable market data; and\nLevel 3 - Valuations based on models where the significant inputs are unobservable. The unobservable inputs reflect our estimates or assumptions that market participants would utilize in pricing such assets or liabilities.\nOur assessment of the significance of a particular input requires judgment and may affect the valuation of financial assets and liabilities and their placement within the fair value hierarchy.\nThe carrying amount of cash and cash equivalents, restricted cash and cash equivalents, receivables and trade payables approximates fair value. The estimated fair value of our long-term debt is primarily based on Level 2 inputs (refer to Note 6).\nRecently Issued Accounting Pronouncements\nASU 2019-12\nIn December 2019, the Financial Accounting Standards Board (the FASB) issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (ASU 2019-12), which simplifies various aspects related to the accounting for income taxes. This new standard removes certain exceptions to the general principles in ASU 2019-12 and clarifies and amends existing guidance to improve consistent application. ASU 2019-12 was effective for annual reporting periods beginning after December 15, 2020. There was no effect on our financial statements from adopting this new standard.\nASU 2021-10\nIn November 2021, the FASB issued ASU 2021-10, Government Assistance (Topic 832): Disclosures by Business Entities about Government Assistance (ASU 2021-10), which requires business entities to provide certain disclosures about government transactions that are accounted for by applying a grant or contribution accounting model by analogy to other accounting guidance. ASU 2021-10 is effective for annual reporting periods beginning after December 15, 2021. We are currently evaluating the effect ASU 2021-10 will have on our disclosures, but do not expect its adoption to have a material impact.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNote 3 - Revenue Recognition\nRevenue Disaggregation\nWe are primarily engaged in the ownership, operation, management and development of integrated entertainment facilities both domestically and internationally. Our current wholly-owned operations are primarily focused within Connecticut and Pennsylvania. We also currently operate and manage other gaming facilities elsewhere within the United States and Canada. We generate revenues by providing the following types of goods and services: gaming, food and beverage, hotel and retail, entertainment and other, which includes management and development fees earned.\nRevenue Disaggregation by Geographic Location\nFor the Fiscal Year Ended September 30, 2022\n(in thousands) Connecticut Pennsylvania Canada Other\nGaming $ 631,456 $ 229,163 $ 213,165 $ 49,080\nFood and beverage 90,722 16,005 23,782 4,215\nHotel 94,240 6,258 15,339 (9)\nRetail, entertainment and other 123,864 6,414 26,977 59,840\nNet revenues $ 940,282 $ 257,840 $ 279,263 $ 113,126\nFor the Fiscal Year Ended September 30, 2021\n(in thousands) Connecticut Pennsylvania Canada Other\nGaming $ 604,482 $ 202,932 $ 87,406 $ 15,558\nFood and beverage 59,611 8,718 2,837 2,465\nHotel 77,282 4,946 2,091 (12)\nRetail, entertainment and other 75,001 4,883 6,868 74,025\nNet revenues $ 816,376 $ 221,479 $ 99,202 $ 92,036\nFor the Fiscal Year Ended September 30, 2020\n(in thousands) Connecticut Pennsylvania Canada Other\nGaming $ 518,599 $ 159,661 $ 121,387 $ -\nFood and beverage 64,012 12,208 27,544 (86)\nHotel 58,219 4,578 6,319 (3)\nRetail, entertainment and other 74,844 4,713 24,775 38,019\nNet revenues $ 715,674 $ 181,160 $ 180,025 $ 37,930\nContract and Contract-related Assets\nAccounts Receivable\n(in thousands) September 30, 2022 September 30, 2021\nGaming $ 40,385 $ 37,921\nFood and beverage 18 13\nHotel 5,601 3,106\nRetail, entertainment and other 24,009 19,099\nAccounts receivable 70,013 60,139\nAllowance for doubtful accounts (24,018) (19,367)\nAccounts receivable, net $ 45,995 $ 40,772\nAs of September 30, 2022 and 2021, contract assets related to the Niagara Resorts Casino Operating and Services Agreement with the Ontario Lottery and Gaming Corporation totaled $87.5 million and $119.9 million, respectively.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nContract and Contract-related Liabilities\nA difference may exist between the timing of cash receipts from customers and the recognition of revenues, resulting in a contract or contract-related liability. In general, we have three types of such liabilities: (1) outstanding gaming chips and slot tickets liability, which represents amounts owed in exchange for outstanding gaming chips and slot tickets held by customers, (2) loyalty points deferred revenue liability and (3) customer advances and other liability, which primarily represents funds deposited in advance by customers for gaming and advance payments by customers for goods and services such as advance ticket sales, deposits on rooms and convention space and gift card purchases. These liabilities are generally expected to be recognized as revenues within one year and are recorded within other current liabilities.\n(in thousands) September 30, 2022 September 30, 2021\nOutstanding gaming chips and slot tickets liability $ 9,743 $ 9,632\nLoyalty points deferred revenue liability 40,873 42,663\nCustomer advances and other liability 30,528 30,166\nTotal\n$ 81,144 $ 82,461\nAs of September 30, 2022 and 2021, customer contract liabilities related to Mohegan Pennsylvania's revenue sharing agreement with Unibet Interactive Inc. totaled $14.4 million and $15.8 million, respectively, and were primarily recorded within other long-term liabilities.\nNote 4 - Property and Equipment\nProperty and equipment\n(in thousands) September 30, 2022 September 30, 2021\nLand $ 44,848 $ 44,848\nLand improvements 103,134 102,820\nBuildings and improvements 1,869,455 1,860,005\nFurniture and equipment 764,356 752,087\nConstruction in process (1)\n424,867 255,909\nProperty and equipment 3,206,660 3,015,669\nAccumulated depreciation (1,562,870) (1,484,050)\nProperty and equipment, net $ 1,643,790 $ 1,531,619\n_________\n(1)As of September 30, 2022 and 2021, Inspire Korea related construction in process totaled $385.7 million and $233.5 million, respectively.\nAs of September 30, 2022 and 2021, finance lease assets totaled $97.8 million and $105.2 million, respectively.\nDepreciation expense totaled $101.1 million, $103.8 million and $107.6 million for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nCapitalized interest related to Inspire Korea totaled $22.3 million and $7.6 million for the fiscal years ended September 30, 2022 and 2020, respectively. We did not record any capitalized interest during the fiscal year ended September 30, 2021.\nDesign and construction work related to Inspire Korea was temporarily paused in September 2020 while we were in the process of securing the necessary financing for the project, which was completed in November 2021 (refer to Note 6). During this temporary pause in construction, we obtained approval to modify our development plan and adjust the timing of a future sub-phase of the initial phase of the project and, in December 2021, we elected to terminate a licensing arrangement for a previously-planned sub-phase and discontinue related design work. As a result, during fiscal 2022, we recognized a tangible asset impairment of $23.6 million on the related construction in progress.\nAs of September 30, 2022, we assessed our property and equipment for any further impairment and determined that no impairment existed.\nNote 5 - Intangible Assets\nIntangible assets\n(in thousands) September 30, 2022 September 30, 2021\nMohegan Sun trademark (1)\n$ 119,692 $ 119,692\nMohegan Pennsylvania gaming licenses (1)\n171,904 171,904\nNiagara Resorts Casino Operating and Services Agreement rights (2)\n16,291 17,612\nOther 10,748 25,717\nIntangible assets 318,635 334,925\nAccumulated amortization (7,109) (7,670)\nIntangible assets, net $ 311,526 $ 327,255\n_________\n(1)Indefinite lives.\n(2)21-year useful life.\nAmortization expense totaled $1.4 million, $1.5 million and $1.4 million for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nIn connection with the termination of the licensing arrangement related to Inspire Korea (refer to Note 4), during fiscal 2022, we recognized an intangible asset impairment of $12.9 million.\nAs of September 30, 2022, we assessed our intangible assets for any further impairment and determined that no impairment existed.\nNote 6 - Long-Term Debt\nLong-term debt\nSeptember 30, 2022 September 30, 2021\n(in thousands) Final Maturity Face Value Book Value Book Value\nSenior Secured Credit Facility 2024 $ - $ - $ 27,000\nLine of Credit 2024 18,000 18,000 20,227\n2021 8% Senior Secured Notes\n2026 1,175,000 1,161,164 1,157,731\n2016 7 7/8% Senior Unsecured Notes 2024 500,000 495,531 493,599\nNiagara Credit Facility\nRevolving\n2024 - - 27,534\nSwingline 2024 - - 4,333\nTerm Loan 2024 60,945 60,453 68,965\nNiagara Convertible Debenture 2040 29,108 29,108 31,468\nKorea Credit Facility 2025 362,455 315,475 -\nKorea Term Loan 2027 311,998 211,425 -\nExpo Credit Facility (1)\n2022 - - 25,697\nGuaranteed Credit Facility 2023 25,156 24,875 27,208\nRedemption Note Payable 2024 38,880 35,261 53,130\nOther Varies 661 661 1,862\nLong-term debt 2,522,203 2,351,953 1,938,754\nCurrent portion of long-term debt (47,402) (47,402) (80,276)\nLong-term debt, net of current portion $ 2,474,801 $ 2,304,551 $ 1,858,478\nFair value $ 2,178,852\nUnamortized discounts and debt issuance costs $ 170,250 $ 34,022\n_________\n(1) Repaid at maturity on April 1, 2022.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nMaturities of long-term debt, excluding unamortized debt issuance costs and discounts, are as follows:\n(in thousands)\nFiscal years:\n2023 $ 47,402\n2024 95,807\n2025 500,025\n2026 1,537,480\n2027 312,022\nThereafter 29,467\nTotal $ 2,522,203\nSenior Secured Credit Facility\nIn January 2021, we entered into a credit agreement (the Credit Agreement) providing for a $262.875 million senior secured revolving credit facility (the Senior Secured Credit Facility).\nOn May 31, 2022, we entered into an amendment to the Senior Secured Credit Facility. Among other things, the amendment extended the maturity date of the Senior Secured Credit Facility from April 14, 2023 to April 12, 2024 and replaced the interest rate based on the London Interbank Offered Rate with an interest rate based on a secured overnight financing rate (SOFR).\nBorrowings under the Senior Secured Credit Facility accrue interest as follows: (i) for base rate loans, a base rate equal to the highest of (x) the prime rate, (y) the federal funds rate, plus 50 basis points, and (z) the daily SOFR rate, plus a 0.10% credit spread adjustment (subject to a 0.75% floor), plus 100 basis points and a leverage-based margin of 100 to 275 basis points and (ii) for SOFR loans, the applicable SOFR rate, plus a 0.10% credit spread adjustment (subject to a 0.75% floor), plus a leverage-based margin of 200 to 375 basis points. We are also required to pay a leverage-based undrawn commitment fee under the Senior Secured Credit Facility of between 37.5 and 50 basis points.\nThe leverage-based undrawn commitment fee was 50 basis points as of September 30, 2022.\nAs of September 30, 2022, letters of credit issued under the Senior Secured Credit Facility totaled $1.9 million. We had $243.0 million of borrowing capacity under the Senior Secured Credit Facility as of September 30, 2022, after factoring in outstanding letters of credit.\nThe Senior Secured Credit Facility is fully and unconditionally guaranteed, jointly and severally, by certain of our restricted subsidiaries. The Senior Secured Credit Facility is secured on a first priority senior secured basis by collateral constituting substantially all of our and our restricted subsidiaries' assets. In the future, certain other subsidiaries may be required to become guarantors under the terms of the Credit Agreement.\nThe Credit Agreement contains certain customary covenants applicable to us and our restricted subsidiaries, including covenants governing: incurrence of indebtedness, incurrence of liens, payment of dividends and other distributions, investments, asset sales, affiliate transactions and mergers or consolidations. Additionally, the Credit Agreement includes financial maintenance covenants pertaining to total leverage, secured leverage and fixed charge coverage, as well as a minimum liquidity covenant under certain conditions. The Credit Agreement also contains customary events of default relating to, among other things, failure to make payments, breach of covenants and breach of representations.\nLine of Credit\nIn January 2021, in connection with the Senior Secured Credit Facility, we entered into a $25.0 million revolving credit facility (the Line of Credit).\nOn May 31, 2022, in connection with the amendment to the Senior Secured Credit Facility, we entered into an amendment to the Line of Credit. This amendment extended the maturity date of the Line of Credit from April 14, 2023 to April 12, 2024 and replaced the interest rate based on the London Interbank Offered Rate with a rate based on SOFR.\nUnder the terms of the Senior Secured Credit Facility, the Line of Credit may be converted into loans under the Senior Secured Credit Facility. Borrowings under the Line of Credit accrue interest at a base rate plus a spread. As of September 30, 2022, outstanding borrowings under the Line of Credit accrue interest at 6.27%. The Line of Credit contains negative covenants and financial maintenance covenants that are substantially the same as those contained in the Senior Secured Credit Facility.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\n2021 8% Senior Secured Notes\nIn January 2021, we issued $1.175 billion second priority senior secured notes with interest at 8% per annum (the 2021 Senior Secured Notes). The 2021 Senior Secured Notes mature on the earlier of February 1, 2026 and the Springing Maturity Date (as defined in the 2021 Senior Secured Notes indenture). Interest on the 2021 Senior Secured Notes is payable semi-annually in arrears on February 1 and August 1.\nPrior to February 1, 2023, we may redeem the 2021 Senior Secured Notes, in whole or in part, at a price equal to 100% of the principal amount of the 2021 Senior Secured Notes redeemed and a Make-whole Premium (as defined in the 2021 Senior Secured Notes indenture), plus accrued interest. In addition, we may, during the twelve-month period commencing on the issue date of the 2021 Senior Secured Notes and during the twelve-month period subsequent to such initial twelve-month period and prior to February 1, 2023, redeem in each such twelve-month period up to 10% of the initial aggregate principal amount of the 2021 Senior Secured Notes at a price equal to 103% of the principal amount of the 2021 Senior Secured Notes redeemed, plus accrued interest, provided that if we do not redeem 10% of the initial aggregate principal amount of the 2021 Senior Secured Notes during the initial twelve-month period commencing on the issue date of the 2021 Senior Secured Notes, we may, in the subsequent twelve-month period prior to February 1, 2023, redeem the 2021 Senior Secured Notes in an amount that does not exceed 10% of the initial aggregate principal amount of the 2021 Senior Secured Notes plus the difference between: (i) 10% of the initial aggregate principal amount of the 2021 Senior Secured Notes and (ii) the aggregate principal amount of any 2021 Senior Secured Notes redeemed during such initial twelve-month period. On or after February 1, 2023, we may redeem some or all of the 2021 Senior Secured Notes at prices set forth in the 2021 Senior Secured Notes indenture, plus accrued interest.\nThe 2021 Senior Secured Notes are fully and unconditionally guaranteed, jointly and severally, by each of our restricted subsidiaries and will be guaranteed by any restricted subsidiary that becomes a guarantor under the terms of the 2021 Senior Secured Notes indenture. The 2021 Senior Secured Notes are secured on a second priority senior secured basis by collateral constituting substantially all of our and our restricted subsidiaries assets.\nThe 2021 Senior Secured Notes indenture contains certain customary covenants, including our and our restricted subsidiaries ability to incur additional debt, pay dividends or distributions, make certain investments, create liens on assets, enter into transactions with affiliates, merge or consolidate with another company or sell assets. The 2021 Senior Secured Notes indenture includes customary events of default, including, but not limited to, failure to make required payments and failure to comply with certain covenants.\n2016 7 7/8% Senior Unsecured Notes\nIn 2016, we issued $500.0 million senior unsecured notes with interest at 7.875% per annum (the 2016 Senior Unsecured Notes). The 2016 Senior Unsecured Notes mature on October 15, 2024. Interest on the 2016 Senior Unsecured Notes is payable semi-annually in arrears on April 15 and October 15.\nThe 2016 Senior Unsecured Notes are redeemable at our option, in whole or in part, at specified redemption prices, plus accrued interest. If we experience specific kinds of change-of-control triggering events, we are required to make an offer to repurchase the 2016 Senior Unsecured Notes at a price equal to 101% of the principal amount, plus accrued interest. Additionally, if we undertake specific kinds of asset sales and do not use the related sale proceeds for specified purposes, we may be required to offer to repurchase the 2016 Senior Unsecured Notes at a price equal to 100% of the principal amount, plus accrued interest. In certain circumstances, if any gaming regulatory authority requires a holder or beneficial owner of the 2016 Senior Unsecured Notes to be licensed, qualified or found suitable under applicable gaming laws, and such holder or beneficial owner does not obtain such license, qualification or finding of suitability within a specified time, we can require such holder or beneficial owner to dispose our 2016 Senior Unsecured Notes or call for redemption of the 2016 Senior Unsecured Notes held by such holder or beneficial owner at a price equal to the lesser of 100% of the principal amount or the price paid by such holder or beneficial owner, plus accrued interest.\nThe 2016 Senior Unsecured Notes are unsecured, unsubordinated obligations and are guaranteed by certain of our restricted subsidiaries.\nThe 2016 Senior Unsecured Notes indenture contains certain covenants that, subject to certain significant exceptions, limit, among other things, us and certain of our restricted subsidiaries ability to incur additional debt, pay dividends or distributions, make certain investments, create liens on assets, enter into transactions with affiliates, merge or consolidate with another company or transfer and sell assets. The 2016 Senior Unsecured Notes indenture also includes events of default, including, but not limited to, failure to make required payments, failure to comply with certain agreements or covenants, failure to pay certain other indebtedness the occurrence of which is caused by a failure to pay principal, premium or interest or results in the acceleration of such indebtedness, certain events of bankruptcy and insolvency and certain judgment defaults.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nRefer to Note 13 for further details regarding an exchange agreement we entered into in connection with the 2016 Senior Unsecured Notes.\nNiagara Credit Facilities\nIn July 2021, MGE Niagara entered into an amended and restated credit agreement (the Niagara Credit Agreement) providing for certain credit facilities (the Niagara Credit Facilities). The Niagara Credit Agreement, as amended from time to time, provides for a revolving credit facility in the amount of up to 180.0 million Canadian dollars (the Niagara Revolving Facility), a swingline facility in the amount of up to 25.0 million Canadian dollars (the Niagara Swingline Facility) and a term loan facility in the amount of 90.0 million Canadian dollars (the Niagara Term Loan Facility). Availability under the Niagara Revolving Facility and the Niagara Swingline Facility is determined based on Province of Ontario-approved gaming capacity levels.\nThe Niagara Credit Facilities mature on June 10, 2024. The Niagara Term Loan Facility is repayable, in quarterly installments, at a rate of 5.0 million Canadian dollars per annum, commencing September 30, 2019.\nBorrowings under the Niagara Credit Facilities accrue interest at a base rate plus a spread. We are also required to pay a leverage-based undrawn fee under the Niagara Revolving Facility of between 75 and 125 basis points.\nAs of September 30, 2022, outstanding borrowings under the Niagara Term Loan Facility accrue interest at 8.69%. As of September 30, 2022, the undrawn fee under the Niagara Revolving Facility was 125 basis points.\nAs of September 30, 2022, letters of credit issued under the Niagara Revolving Facility totaled $25.5 million. We had $120.1 million of borrowing capacity under the Niagara Revolving Facility and Niagara Swingline Facility as of September 30, 2022, after factoring in outstanding letters of credit.\nMGE Niagara is an unrestricted subsidiary under our existing credit facilities and indentures and the Niagara Credit Facilities are non-recourse to us and our restricted subsidiaries.\nThe Niagara Credit Facilities are secured by, among other things, substantially all of the properties and assets of MGE Niagara, subject to certain customary exceptions, as well as by a pledge of: (i) all of the issued and outstanding shares of MGE Niagara and (ii) a convertible debenture held by a third-party investor.\nThe Niagara Credit Agreement contains customary covenants applicable to MGE Niagara, including covenants governing: incurrence of indebtedness, incurrence of liens, payment of dividends and other distributions, asset sales, acquisitions and investments, affiliate transactions and fundamental changes. The Niagara Credit Agreement also includes financial maintenance covenants pertaining to total leverage and fixed charge coverage. In addition, the Niagara Credit Agreement contains customary events of default relating to, among other things, failure to make payments, breach of covenants and breach of representations.\nNiagara Convertible Debenture\nIn 2019, MGE Niagara issued a convertible debenture (the Niagara Convertible Debenture) to a third-party investor (the \"Convertible Debenture Holder\") in an aggregate principal amount of 40.0 million Canadian dollars. The Niagara Convertible Debenture is convertible, at the option of the Convertible Debenture Holder, between the fourth and sixth anniversaries of the acquisition of the Niagara Resorts (the Closing Date), into Class B Special shares representing 40% of the capital of MGE Niagara. The Class B Special shares will be similar in nature to the existing Common shares. The Niagara Convertible Debenture accrues interest at an annual rate of 3.50% prior to the sixth anniversary of the Closing Date and 8.00% thereafter, compounded annually. The first interest payment was payable on June 11, 2022, with annual payments due thereafter. Repayment of the outstanding principal, plus accrued interest, is due thirty days following the expiration or the termination of the Casino Operating and Services Agreement. If the Niagara Convertible Debenture is not converted as of the sixth anniversary of the Closing Date, either MGE Niagara or the Convertible Debenture Holder may elect early repayment of half of the principal outstanding as of such date.\nKorea Credit Facility\nIn September 2021, Inspire Integrated Resort entered into a loan agreement providing for a loan commitment of up to 1.04 trillion Korean won (KRW) in two tranches (the Korea Credit Facility), comprised of a 740.0 billion KRW credit facility (the Tranche A Facility) and a 300.0 billion KRW credit facility (the Tranche B Facility). The Korea Credit Facility is being used to pay for the construction, operation, financial and other project costs in connection with Inspire Korea (refer to Note 1). The Korea Credit Facility matures 48 months after the date of the first draw, which was November 29, 2021.\nMandatory prepayments are required under the Korea Credit Facility in connection with certain specified asset dispositions or receipt of insurance proceeds, without a prepayment fee. The Korea Credit Facility may not be voluntarily prepaid in whole or\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nin part until one year after the date of the first draw. After such date, any voluntary prepayment requires a Prepayment Fee (as defined in the Korea Credit Facility agreement).\nBorrowings outstanding under the Tranche A Facility accrue interest at a fixed rate of 5.4% per annum or a floating rate equal to the sum of a base rate and an applicable margin (as defined in the Korea Credit Facility agreement). Loans outstanding under the Tranche B Facility accrue interest at a fixed rate of 7.0% per annum or a floating rate equal to the sum of a base rate and an applicable margin (as defined in the Korea Credit Facility agreement). The Korea Credit Facility includes an interest reserve whereby a portion of loan proceeds is reserved for payment of interest. Interest on Tranche A Facility loans is fully reserved and interest on Tranche B Facility loans is reserved for 36 months. If any portion of the Korea Credit Facility is undrawn, Inspire Integrated Resort is required to pay a 0.3% commitment fee on the undrawn amount.\nAs of September 30, 2022, outstanding borrowings under the Korea Credit Facility accrue interest at between 5.40% and 8.10%.\nInspire Integrated Resort is an unrestricted subsidiary under our existing credit facilities and indentures and the Korea Credit Facility is non-recourse to us and our restricted subsidiaries.\nThe Korea Credit Facility is secured by liens on substantially all assets of, and equity interests in, Inspire Integrated Resort (subject to certain exceptions and limitations).\nThe Korea Credit Facility contains certain customary covenants applicable to Inspire Integrated Resort, including covenants governing: incurrence of indebtedness, incurrence of liens, investments, mergers or consolidations, asset sales, acquisitions of assets, the payment of dividends and other distributions and affiliate transactions. In addition, the Korea Credit Facility includes other covenants, representations and warranties and events of default that are customary for financing transactions of this type.\nIn connection with the Korea Credit Facility, we entered into a credit enhancement support agreement to provide up to $100.0 million credit enhancement support for Inspire Integrated Resort's payment of principal, interest and other sums due under the Korea Credit Facility.\nWe incurred $59.1 million in costs in connection with this transaction during fiscal 2022. These debt issuance costs were reflected as a debt discount and are being amortized over the term of the Korea Credit Facility using the effective interest method.\nKorea Term Loan\nOn November 4, 2021, MGE Korea Limited (Korea Limited), a wholly-owned subsidiary and parent company of Inspire Integrated Resort, entered into a $275.0 million secured term loan facility agreement (the Korea Term Loan). Korea Limited received funding from the Korea Term Loan on November 24, 2021 (the Utilisation Date). The Korea Term Loan was primarily used to make a capital contribution to Inspire Integrated Resort to partially fund construction-related costs for Inspire Korea. The Korea Term Loan matures 66 months after the Utilisation Date.\nIf the Korea Term Loan is voluntarily prepaid, if certain mandatory prepayment events are triggered or if it is repaid following a notice of acceleration, we are required to pay a Prepayment Fee (as defined in the Korea Term Loan agreement).\nThe Korea Term Loan accrues payment-in-kind interest at a rate of 17.0% per annum, to be compounded and capitalized at the end of each quarter, or paid in cash if so elected by Korea Limited.\nKorea Limited is an unrestricted subsidiary under our existing credit facilities and indentures and the Korea Term Loan is non-recourse to us and our restricted subsidiaries.\nThe Korea Term Loan is secured by a fixed charge over 100% of Korea Limiteds share capital and a debenture over the assets of Korea Limited (subject to certain exceptions and limitations).\nThe Korea Term Loan contains certain customary covenants, including covenants governing: incurrence of indebtedness, incurrence of liens, payment of dividends and other distributions, disposals, acquisitions and investments, arms length transactions, mergers and the development and management of Inspire Korea. In addition, the Korea Term Loan includes financial maintenance covenants pertaining to net leverage and debt service coverage of Korea Limited and Inspire Integrated Resort, and contains a requirement that Inspire Integrated Resort maintain a minimum cash balance in the amounts set forth in the Korea Term Loan agreement. The Korea Term Loan also contains customary events of default relating to, among other things, failure to make payments, breach of covenants and breach of representations.\nWe incurred $9.3 million in costs in connection with the Korea Term Loan during fiscal 2022. These debt issuance costs were reflected as a debt discount and are being amortized over the term of the Korea Term Loan using the effective interest method. In addition, the allocation of proceeds to the issuance of warrants and associated put option (see below) resulted in an original\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nissue discount on the Korea Term Loan of $90.3 million, which will also be amortized over the term of the Korea Term Loan using the effective interest method.\nKorea Warrant Agreement\nIn connection with the Korea Term Loan, on November 4, 2021, MGE Korea Holding III Limited (Korea Holding III), the parent company of Korea Limited, entered into a warrant agreement (the Warrant Agreement) to issue detachable warrants (the Warrants). The Warrants can be converted into up to a total of 4,400 shares of capital in Korea Holding III at an initial exercise price of $0.01 per share. At the time of issuance, the Warrants represented 22.0% of the fully-diluted share capital of Korea Holding III.\nThe Warrants are generally exercisable at any time after the third anniversary of the Utilisation Date (November 2024) until the tenth anniversary of the Utilisation Date (November 2031), but may be exercised earlier upon certain triggering events defined in the Warrant Agreement. Upon the earlier of: (i) the tenth anniversary of the Utilisation Date (November 2031) and (ii) the consummation of an Exit Event (as defined in the Warrant Agreement), all unexercised Warrants will expire.\nWarrant holders do not have any rights held by holders of shares in the capital of Korea Holding III to vote or to receive dividends and other distributions (other than as set forth in the Warrant Agreement). Warrant holders and shareholders of Korea Holding III have certain preemptive rights in relation to any proposed issuance of equity securities by Korea Holding III or certain affiliates (as defined in the Warrant Agreement), subject to customary exceptions.\nHolders of unexercised Warrants have the right to require the parent of Korea Holding III (the Parent) to purchase all of the unexercised Warrants that they hold at certain relevant times (the Put Option). In turn, the Parent has the right to require the holders of unexercised Warrants to sell all of the unexercised Warrants they hold at certain relevant times (the Call Option). Both the Put Option and the Call Option are exercisable at any time in the period from (and including) the date six years and six months after the Utilisation Date (May 2028) until the tenth anniversary of the Utilisation Date (November 2031). The aggregate cash purchase price for both the Put Option and the Call Option equals the higher of: (i) the fair market value of the relevant unexercised Warrants and (ii) $110.0 million, multiplied by a fraction, the numerator of which is the number of the relevant unexercised Warrants and the denominator of which is the total number of Warrants.\nThe Warrants and the Put Option are classified as long-term liabilities and are re-measured at their estimated fair values at each reporting date. The estimated fair value of the Warrants and the Put Option was determined by utilizing the income approach (discounted cash flow method) and a binomial lattice model. This valuation approach utilized Level 3 inputs. The primary unobservable inputs utilized were the discount rate, which was 12.0%, and the expected volatility of the underlying stock price, which was 55.0%. In addition, projected cash flows are utilized in this valuation approach.\nDebt issuance costs incurred during fiscal 2022 and allocated to the Warrants and the Put Option totaling $4.2 million were expensed on the Utilisation Date and recorded within Corporate costs and expenses.\nWarrants and Put Option\n(in thousands)\nBalance, September 30, 2021 $ -\nAdditions 90,320\nUnrealized gain (43,020)\nBalance, September 30, 2022 $ 47,300\nGuaranteed Credit Facility\nIn 2018, we entered into loan agreements providing for $35.0 million in term loans under the Indian Loan Guaranty, Insurance and Interest Subsidy Program (the Guaranteed Credit Facility). The Guaranteed Credit Facility matures on October 1, 2023 and is repayable, in quarterly installments, at a rate of $2.6 million per annum, commencing January 1, 2019. As of September 30, 2022, outstanding borrowings under the Guaranteed Credit Facility accrue interest at 5.31%. The Guaranteed Credit Facility subjects us to certain covenant requirements.\nRedemption Note Payable\nIn 2017, Salishan-Mohegan redeemed the membership interest in Salishan-Mohegan that was previously held by Salishan Company, LLC for a redemption price of $114.8 million, payable through a promissory note (the Redemption Note Payable). The Redemption Note Payable is payable in monthly installments of $1.9 million over a five-year period, commencing in May 2019. We recognize interest expense relating to the amortization of discount to the Redemption Price, utilizing the effective yield method.\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNote 7 - Leases\nLessee\nWe lease real estate and equipment under various operating and finance lease agreements. The leases have remaining terms ranging from approximately one month to 49 years and do not contain any material residual value guarantees or restrictive covenants. Rental payments under these lease agreements are fixed and/or variable based on periodic adjustments for inflation, performance, usage or appraised land values. Variable components of lease payments are not included in the calculation of right-of-use assets and liabilities.\nOur lease arrangements contain both lease and non-lease components. For instances in which we are a lessee, we account for both lease and non-lease components as a single lease component for substantially all classes of underlying assets (primarily real estate and equipment). Leases with an expected or initial term of 12 months or less are not recorded on our Balance Sheets.\nInformation related to weighted average lease terms and discount rates is as follows:\nSeptember 30, 2022\nWeighted average remaining lease terms (years):\nOperating leases\nFinance leases\nWeighted average discount rates:\nOperating leases 7.84 %\nFinance leases\n6.88 %\nThe components of lease expense are as follows:\nFor the Fiscal Years Ended\n(in thousands) September 30, 2022 September 30, 2021 September 30, 2020\nOperating lease expense $ 44,065 $ 45,458 $ 38,414\nShort-term lease expense 43,642 33,438 27,121\nVariable lease expense 18,133 17,427 12,922\nFinance lease expense:\nAmortization of right-of-use assets 6,494 4,459 2,401\nInterest on lease liabilities 8,740 5,059 1,547\nSublease income (1)\n(38,298) (23,147) (20,791)\nTotal $ 82,776 $ 82,694 $ 61,614\n_________\n(1)Represents income earned from the rental of hotel, convention or retail space at the Niagara Resorts and the Earth Hotel Tower at Mohegan Sun, both of which are leased properties.\nSupplemental cash flow information related to lease liabilities is as follows:\nFor the Fiscal Years Ended\n(in thousands) September 30, 2022 September 30, 2021 September 30, 2020\nCash paid for amounts included in the measurement of lease liabilities:\nPayments on operating lease obligations\n$ 38,842 $ 20,747 $ 22,844\nPayments for interest on finance lease obligations\n4,714 345 889\nPayments on finance lease obligations\n5,553 1,145 1,298\nTotal\n$ 49,109 $ 22,237 $ 25,031\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nMaturities of lease obligations are as follows:\n(in thousands) Operating Leases\nFinance Leases\nFiscal years:\n2023 $ 36,788 $ 12,790\n2024 38,133 12,354\n2025 37,555 11,849\n2026 37,827 11,658\n2027 38,087 11,240\nThereafter 707,304 148,971\nTotal future lease payments 895,694 208,862\nAmounts representing interest (533,082) (96,744)\nResidual values - 350\nPresent value of future lease payments 362,612 112,468\nCurrent portion of lease obligations (5,473) (4,491)\nLease obligations, net of current portion $ 357,139 $ 107,977\nLessor\nWe lease space at our facilities to third parties. Remaining lease terms for these non-cancelable operating leases range from approximately one month to 10 years. Rental income under these lease agreements is fixed and/or variable based on percentage of tenant sales or periodic adjustments for inflation. Rental income is recorded within hotel and retail, entertainment and other revenues. For instances in which we are the lessor, and the class of underlying asset represents retail space, we account for both the lease and non-lease components, such as common area maintenance and tenant services, as a single lease component. In all other instances, non-lease components are accounted for separately in accordance with applicable guidance, most commonly ASU 2014-09, Revenue from Contracts with Customers (Topic 606).\nRental income consists of the following:\nFor the Fiscal Years Ended\nSeptember 30, 2022 September 30, 2021 September 30, 2020\n(in thousands) Hotel Retail,\nEntertainment and Other Hotel Retail,\nEntertainment and Other Hotel Retail,\nEntertainment and Other\nFixed rent $ 66,375 $ 6,799 $ 53,904 $ 5,226 $ 42,473 $ 7,160\nVariable rent - 10,885 - 5,314 - 4,176\nTotal $ 66,375 $ 17,684 $ 53,904 $ 10,540 $ 42,473 $ 11,336\nFixed rental income that we expect to earn under non-cancelable operating leases, exclusive of amounts under contingent rent escalation clauses, is as follows:\n(in thousands) Fixed Rental Income\nFiscal years:\n2023 $ 6,781\n2024 5,978\n2025 4,990\n2026 4,612\n2027 3,220\nThereafter 8,984\nTotal $ 34,565\nThe portions of Mohegan Sun, including the Sky Hotel Tower and the Earth Expo & Convention Center, and Mohegan Pennsylvania that are leased to third parties under operating leases are recorded within property and equipment, net as follows:\n(in thousands) September 30, 2022 September 30, 2021\nProperty and equipment, at cost $ 487,180 $ 491,673\nAccumulated depreciation (233,344) (218,873)\nProperty and equipment, net $ 253,836 $ 272,800\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNote 8 - Related Party Transactions\nServices\nThe Mohegan Tribe provides us certain governmental and administrative services. We incurred expenses for such services totaling $37.5 million, $26.5 million and $22.9 million for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nWe purchase most of our utilities, including electricity, gas, water and waste water services, from an instrumentality of the Mohegan Tribe. We incurred costs for such utilities totaling $22.0 million, $16.9 million and $15.5 million for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nLeases\nWe lease the land on which Mohegan Sun is located from the Mohegan Tribe under a long-term lease agreement. The current term of 25 years, which commenced in October 2016, is renewable by us for an additional 25 years upon expiration. The lease agreement requires us to make a nominal annual rental payment.\nWe also lease the Earth Hotel Tower at Mohegan Sun from a subsidiary of the Mohegan Tribe. We incurred rental expense relating to this lease totaling $8.6 million for each of the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nNote 9 - Employee Benefit Plans\nWe offer a retirement savings plan for our employees under Section 401(k) and Section 401(a) of the Internal Revenue Code (the Mohegan Retirement and 401(k) Plan). We currently make discretionary matching contributions of 50%, up to the first 6% of participants eligible compensation contributed to the 401(k) portion of the plan. We contributed $4.3 million, $2.1 million and $1.5 million, net of forfeitures, to the Mohegan Retirement and 401(k) Plan for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nWe, together with the Mohegan Tribe, offer a non-qualified deferred compensation plan for certain key employees (the Mohegan Deferred Compensation Plan). As of September 30, 2022 and 2021, balances under the Mohegan Deferred Compensation Plan totaled $9.1 million and $11.4 million, respectively. The related asset and liability are recorded within other current assets and accrued payroll, respectively.\nWe, together with the Mohegan Tribe, offer a benefit plan for certain eligible employees (the Mohegan Benefit Plan). The Mohegan Benefit Plan is sponsored by the Mohegan Tribe for the benefit of participants who authorize the purchase of life insurance policies as a means of providing certain life insurance benefits to the participants and their spouses as joint insured. As of September 30, 2022 and 2021, balances under the Mohegan Benefit Plan totaled $8.1 million and $7.0 million, respectively, and are recorded within other assets, net.\nNote 10 - Income Taxes\nSimilar to other sovereign governments, the Mohegan Tribe and its entities, including the Company, are not subject to United States federal income taxes. However, certain of our non-tribal entities are subject to income taxes in various domestic and foreign jurisdictions.\nThe components of income (loss) before income tax are as follows:\nFor the Fiscal Years Ended\n(in thousands) September 30, 2022 September 30, 2021 September 30, 2020\nDomestic $ 104,432 $ 57,138 $ (124,227)\nForeign (20,426) (56,138) (44,483)\nIncome (loss) before income tax $ 84,006 $ 1,000 $ (168,710)\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe components of income tax are as follows:\nFor the Fiscal Years Ended\n(in thousands) September 30, 2022 September 30, 2021 September 30, 2020\nCurrent:\nFederal $ - $ - $ -\nState 292 (325) (355)\nForeign - - -\nTotal 292 (325) (355)\nNon-current:\nFederal - - -\nState - - -\nForeign (9,102) 6,678 7,049\nTotal (9,102) 6,678 7,049\nIncome tax benefit (provision) $ (8,810) $ 6,353 $ 6,694\nThe components of deferred income tax benefit or provision result from various temporary differences and relate to items included within the Statements of Operations. The tax effect of these temporary differences are recorded within deferred income tax assets or liabilities as follows:\nSeptember 30, 2022 September 30, 2021\nDeferred income tax assets:\nForeign net operating loss carryforward $ 18,058 $ 26,188\nLease obligations 91,447 92,243\nLimitation on interest expense deduction 9,749 -\nAccumulated book depreciation in excess of tax depreciation 6,909 8,336\nOther 1,493 29\nValuation allowance (19,919) -\nTotal 107,737 126,796\nDeferred income tax liabilities:\nCasino Operating and Services Agreement contract asset (23,137) (31,685)\nRight-of-use lease assets (80,728) (81,656)\nOther (46) (127)\nTotal (103,911) (113,468)\nDeferred income tax asset, net (1)\n$ 3,826 $ 13,328\n_________\n(1)Recorded within other assets, net.\nMGE Niagara generated taxable income of $66.7 million for Canadian tax purposes for the fiscal year ended September 30, 2022. This taxable income will be offset by past net operating losses.\nAs of September 30, 2022, we have gross income tax net operating loss carryforwards related to our foreign operations of $117.8 million. Such deferred tax assets expire as follows:\n(in thousands)\nFiscal years:\n2025 through 2029 $ 10,707\n2030 through 2034 3,522\n2035 through 2039 66,636\n2040 through 2042 33,386\nIndefinite 3,546\nTotal $ 117,797\nWe assess the available positive and negative evidence to estimate whether sufficient future taxable income will be generated to permit the use of existing deferred tax assets. A significant objective negative evidence assessed was the cumulative loss\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nincurred in connection with Inspire Korea. Such objective evidence limits the ability to consider other subjective evidence, such as our projections of future taxable income.\nBased on this assessment, we recorded a valuation allowance of $19.9 million to recognize the portion of deferred tax assets that is more likely than not to be realized. However, the amount of deferred tax assets currently considered to be realizable may be adjusted in future periods if objective evidence in the form of taxable income is realized and additional weight is given to subjective evidence, such as our projections of taxable income.\nNote 11 - Segment Reporting\nWe, either directly or through subsidiaries, operate Mohegan Sun, along with our other Connecticut operations (the Connecticut Facilities), Mohegan Pennsylvania, along with our other Pennsylvania operations (the Pennsylvania Facilities) and the Niagara Resorts. Certain other properties that are managed or under development are identified as the management, development and other reportable segment.\nOur chief operating decision makers currently review and assess the performance and operating results and determine the proper allocation of resources to the Connecticut Facilities, the Pennsylvania Facilities, the Niagara Resorts and the properties managed or under development on a separate basis. Accordingly, we have four separate reportable segments: (i) Mohegan Sun, which includes the operations of the Connecticut Facilities, (ii) Mohegan Pennsylvania, which includes the operations of the Pennsylvania Facilities, (iii) the Niagara Resorts and (iv) management, development and other. Certain other gaming and entertainment operations (all other), which are not individually reportable segments, our corporate functions and inter-segment activities are each disclosed separately in the following segment disclosures to reconcile to consolidated results.\nNet Revenues\nFor the Fiscal Years Ended\n(in thousands) September 30, 2022 September 30, 2021 September 30, 2020\nMohegan Sun $ 940,282 $ 816,376 $ 715,674\nMohegan Pennsylvania 257,840 221,479 181,160\nNiagara Resorts 279,263 99,202 180,025\nManagement, development and other 62,221 70,009 37,189\nAll other 54,619 18,780 -\nCorporate 575 3,247 741\nInter-segment (4,289) (260) 173\nNet revenues $ 1,590,511 $ 1,228,833 $ 1,114,962\nIncome (Loss) from Operations\nFor the Fiscal Years Ended\n(in thousands) September 30, 2022 September 30, 2021 September 30, 2020\nMohegan Sun $ 213,654 $ 202,311 $ 128,449\nMohegan Pennsylvania 43,956 32,534 (115,073)\nNiagara Resorts 38,892 (22,638) (24,676)\nManagement, development and other (15,948) 17,162 1,585\nAll other 7,158 (1,534) -\nCorporate (41,538) (43,358) (23,439)\nInter-segment 60 (20) (63)\nIncome (loss) from operations $ 246,234 $ 184,457 $ (33,217)\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nCapital Expenditures Incurred\nFor the Fiscal Years Ended\n(in thousands) September 30, 2022 September 30, 2021 September 30, 2020\nMohegan Sun $ 29,353 $ 23,250 $ 17,600\nMohegan Pennsylvania 11,316 6,063 3,559\nNiagara Resorts 17,232 14,079 17,799\nManagement, development and other 249,569 7,773 137,171\nAll other 49 88,725 -\nCorporate 1,415 307 545\nCapital expenditures incurred $ 308,934 $ 140,197 $ 176,674\nTotal Assets\n(in thousands) September 30, 2022 September 30, 2021\nMohegan Sun $ 1,226,689 $ 1,267,538\nMohegan Pennsylvania 405,455 408,187\nNiagara Resorts 474,281 561,812\nManagement, development and other 869,117 407,831\nAll other 98,947 98,945\nCorporate 1,010,984 996,040\nInter-segment (1,036,556) (1,010,476)\nTotal assets $ 3,048,917 $ 2,729,877\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNote 12 - Commitments and Contingencies\nSlot Win Contribution\nThe Mohegan Tribe and the State of Connecticut entered into a Memorandum of Understanding (MOU), which sets forth certain matters regarding implementation of the Mohegan Compact. The MOU stipulates that a portion of revenues from slot machines must be paid to the State of Connecticut (Slot Win Contribution). Slot Win Contribution payments are not required if the State of Connecticut legalizes any other gaming operation with slot machines, video facsimiles of games of chance or other commercial casino games within the state of Connecticut, except those consented to by the Mohegan Tribe and the Mashantucket Pequot Tribe. Annual Slot Win Contribution payments are the lesser of: (i) 30% of gross revenues from slot machines and (ii) the greater of 25% of gross revenues from slot machines or $80.0 million.\nPennsylvania Slot Machine Tax\nThe Pennsylvania Race Horse Development and Gaming Act stipulates that holders of Category One slot machine licenses, including Mohegan Pennsylvania, must pay a portion of revenues from slot machines and other assessments to the PGCB (collectively, the Pennsylvania Slot Machine Tax). The Pennsylvania Slot Machine Tax approximates 52% of gross revenues from slot machines, plus an annual $10.0 million slot machine operation fee.\nNiagara Resorts Casino Operating and Services Agreement Thresholds\nWe operate the Niagara Resorts under the terms of a 21-year Casino Operating and Services Agreement with the Ontario Lottery and Gaming Corporation. Annual Threshold amounts under the Casino Operating and Services Agreement are contractually established and vary from year to year. If gaming revenues are less than the Threshold for any given year, we are obligated to make a payment to cover the related shortfall (refer to Note 2).\nMohegan Casino Las Vegas Lease\nIn July 2019, MGNV, LLC entered into a casino lease agreement with JC Hospitality, LLC, which developed the former Hard Rock Hotel and Casino in Las Vegas, Nevada, into an integrated resort under the Virgin Hotels brand. We operate Mohegan Casino Las Vegas, the gaming portion of the integrated resort. During the initial term of the 20-year lease agreement, we are required to make annual minimum rent payments of $9.0 million, subject to escalators which could result in annual minimum rent payments of up to $15.0 million, plus consumer price index inflators and additional common area maintenance fees. Annual minimum rent payments commenced upon the first anniversary of the Lease Commencement Date, as defined under the lease agreement, and continue until the end of the lease term, which concludes in 2041, subject to additional extensions at our option.\nPriority Distribution\nWe and the Mohegan Tribe are parties to a perpetual agreement, which requires us to make payments to the Mohegan Tribe to the extent of our Net Cash Flow, as defined, subject to a minimum payment of $40.0 million per calendar year.\nPurchase and Other Contractual Obligations\nAs of September 30, 2022, we were contractually committed to purchase goods and services totaling $10.2 million, of which $3.0 million is expected to be incurred in fiscal 2023.\nLitigation\nWe are a defendant in various claims and legal actions resulting from our normal course of business, primarily relating to personal injuries to customers and damages to customers' personal assets. We estimate litigation claims expense and accrue for such liabilities based upon historical experience. In management's opinion, the aggregate liability, if any, arising from such legal actions will not have a material impact on our financial position, results of operations or cash flows.\nNote 13 - Subsequent Events\n2016 7 7/8% Senior Unsecured Notes Exchange\nNotes Exchange Agreement\nWe entered into an exchange agreement and a related amendment on November 29, 2022 and December 9, 2022, respectively, (the Exchange Agreement) with holders of approximately $475 million of our 2016 Senior Unsecured Notes (refer to Note 6). The Exchange Agreement provided for the exchange (the Notes Exchange) of the holders approximately $475 million 2016 Senior Unsecured Notes for newly issued senior unsecured notes with interest at 13.25% per annum (the 2022 Senior Unsecured Notes). The 2022 Senior Unsecured Notes were issued at a ratio of $1,052.63 in principal amount for each $1,000\nMOHEGAN TRIBAL GAMING AUTHORITY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\naggregate principal amount of 2016 Senior Unsecured Notes, plus accrued interest, under an indenture dated as of December 9, 2022.\nThe 2022 Senior Unsecured Notes are redeemable by us at a price equal to 100% of the principal amount through June 15, 2024, and at specified, fixed premiums thereafter, in each case plus accrued interest. The 2022 Senior Unsecured Notes are unsecured, unsubordinated obligations and are guaranteed by certain of our restricted subsidiaries, as well as certain future restricted subsidiaries or subsidiaries that incur more than $25.0 million in debt.\nThe 2022 Senior Unsecured Notes mature on December 15, 2027. Interest on the 2022 Senior Unsecured Notes is payable semi-annually in arrears on June 15 and December 15, commencing on June 15, 2023.\nExchange Settlements\nWe completed the initial settlement (the Initial Settlement), a second settlement and a final settlement under the Exchange Agreement on December 9, 2022, December 14, 2022 and December 19, 2022, respectively, whereby we issued $502.5 million in aggregate principal amount of 2022 Senior Unsecured Notes, and consequently cancelled $477.3 million in aggregate principal amount of 2016 Senior Unsecured Notes. Following the final settlement, $22.7 million in aggregate principal amount of 2016 Senior Unsecured Notes remain outstanding.\nSupplemental Indenture\nConcurrently with the Initial Settlement, we entered into a supplemental indenture to the existing indenture governing the 2016 Senior Unsecured Notes. As of the Initial Settlement, the supplemental indenture provided for, among other things, certain amendments to the existing indenture governing the 2016 Senior Unsecured Notes, including modifying our and our restricted subsidiaries ability to incur certain additional debt, pay certain dividends or distributions and make certain investments.\nAs of the final settlement on December 19, 2022, the supplemental indenture provided for certain additional amendments to the existing indenture governing the 2016 Senior Unsecured Notes. These amendments removed substantially all of the restrictive covenants contained in the existing indenture governing the 2016 Senior Unsecured Notes, including, but not limited to, covenants limiting our and our restricted subsidiaries ability to incur additional debt, pay dividends or distributions, make certain investments, create liens on assets, enter into transactions with affiliates or sell assets.\nMOHEGAN TRIBAL GAMING AUTHORITY\nSCHEDULE II-VALUATION AND QUALIFYING ACCOUNTS AND RESERVES\nFOR THE FISCAL YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nColumn A Column B Column C Column D\n(in thousands) Balances at\nBeginning\nof Year Charges to\nCosts and\nExpenses (Additions) Deductions\nfrom\nReserves Balances\nat End\nof Year\nFiscal Year ended September 30, 2022\nReserves and allowances deducted from asset accounts:\nReserves for uncollectible accounts: $ 19,367 $ 6,095 $ 1,444 $ 24,018\nFiscal Year ended September 30, 2021\nReserves and allowances deducted from asset accounts:\nReserves for uncollectible accounts: $ 16,313 $ 4,709 $ 1,655 $ 19,367\nFiscal Year ended September 30, 2020\nReserves and allowances deducted from asset accounts:\nReserves for uncollectible accounts: $ 11,715 $ 4,592 $ (6) $ 16,313 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nDisclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures as of September 30, 2022. The term disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act), means controls and other procedures of a company that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the rules and forms of the Securities and Exchange Commission. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the company's management, including its principal executive and principal financial officers, as appropriate, to allow timely decisions regarding required disclosures. Management recognizes that controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives, and management necessarily applies its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nBased on an evaluation of our disclosure controls and procedures as of September 30, 2022, and in light of a material weakness identified in our internal control over financial reporting, our Chief Executive Officer and Chief Financial Officer concluded that, as of such date, our disclosure controls and procedures were not effective. Notwithstanding this material weakness, our management, including our Chief Executive Officer and Chief Financial Officer, has concluded that our financial statements included in this Annual Report on Form 10-K present fairly, in all material respects, our financial position, results of operations and cash flows for the periods presented in accordance with accounting principles generally accepted in the United States of America.\nManagement Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that:\npertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\nprovide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles and that receipts and expenditures are being made only in accordance with authorizations of our management; and\nprovide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of September 30, 2022. In connection with this assessment, we identified a material weakness in our internal control over financial reporting relating to our warrants and put option valuation control, which was not designed or operating effectively. We did not have a precise enough control to review the accuracy and completeness of the cash flow projections utilized in the valuation of the warrants and put option liabilities. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis. In making this assessment, our management used the framework set forth by the Committee of Sponsoring Organizations of the Treadway Commission in 2013 Internal Control-Integrated Framework.\nBecause of this material weakness, our management concluded that, as of September 30, 2022, our internal control over financial reporting was not effective.\nThis Annual Report on Form 10-K does not include an attestation report from our registered public accounting firm regarding internal control over financial reporting. Our internal control over financial reporting was not subject to such attestation as we are a non-accelerated filer.\nChanges in Internal Control Over Financial Reporting\nOther than the material weakness noted above, there have been no other changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) that occurred during the quarterly period September 30, 2022, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nRemediation Efforts with Respect to Material Weakness\nOur management, under the oversight of our Audit Committee, is in the process of developing a plan to remediate the material weakness, which is expected to include the following measures:\nStrengthening of our finance and accounting functions and, if deemed necessary, engaging additional resources with the appropriate depth of experience;\nEnhancing our senior management and accounting review process to specifically address all disclosures and related financial information;\nStrengthening existing internal controls related to review of key reports and assumptions utilized in estimating the fair value of the warrants and put option liabilities;\nImplementing specific review procedures designed to enhance our valuation monitoring control; and\nStrengthening our current valuation control activities with improved documentation standards, technical oversight and training.\nThe material weakness will not be considered remediated until management completes the remediation plan above, the enhanced controls operate for a sufficient period of time and management concludes, through testing, that the related controls are effective. We will monitor the effectiveness of our remediation plan and will refine the remediation plan as appropriate. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nWe are governed by a nine-member Management Board, whose members also comprise the Mohegan Tribal Council, the governing body of the Mohegan Tribe. Any change in the composition of the Mohegan Tribal Council results in a corresponding change in our Management Board. The members of the Management Board and their terms are as follows: Patricia A. LaPierre, Joseph M. Soper, Thayne D. Hutchins, Jr. and John G. Harris are each serving terms expiring in October 2023, while Ralph James Gessner, Jr., Sarah E. Harris, William Quidgeon, Jr., Kenneth Davison and Mark F. Brown are each serving terms expiring in October 2025. Members of the Mohegan Tribal Council are elected by the registered voters of the Mohegan Tribe through competitive general elections. Vacancies on the Mohegan Tribal Council, to the extent they arise, are likewise filled by similar special elections. Upon expiration of Mohegan Tribal Council members' terms, registered voters of the Mohegan Tribe may re-elect current Mohegan Tribal Council members who choose to run for re-election or elect new Mohegan Tribal Council members. Incumbent members of the Mohegan Tribal Council do not nominate or otherwise identify candidates for election. Accordingly, the Mohegan Tribal Council and Management Board do not screen candidates for election nor do they maintain a nominating committee. The terms of office of our named executive officers, and the periods during which they have served as such, are described in Part III. Item 11. Executive Compensation.\nCompensation Discussion and Analysis\nExecutive Compensation Objectives\nWe operate in an extremely competitive environment and believe that our current and future success is closely correlated with our ability to attract and retain highly talented employees and a strong management team. Accordingly, our executive compensation program is intended to meet three principal objectives: (1) attract, reward and retain senior management employees, (2) motivate these individuals to achieve our short-term and long-term business goals and (3) promote internal compensation equity and external competitiveness.\nOur philosophy relating to executive compensation is to attract and retain highly qualified individuals by offering competitive base salaries, cash-based incentive opportunities and other employee benefits. We face unique challenges in designing our executive compensation program because, as an instrumentality of the Mohegan Tribe, we cannot offer equity-based compensation to our executives, unlike many of our industry peers. As a result, we strive to offer a cash-based compensation program that rewards our executives with competitive compensation while providing proper incentives to achieve our financial and operational goals at both the operating unit and company-wide levels. We also strive to ensure that our executive compensation program is straightforward, transparent and understandable.\nRole of the Compensation Committee and Senior Management\nOur nine-member Management Board, whose members also comprise the Mohegan Tribal Council, serves as our Compensation Committee and has final authority over the design, negotiation and implementation of our executive compensation program. As discussed below, our principal executive officer, along with other senior and executive level employees, have taken the leading roles in the design of our executive compensation program. In addition, acting within the boundaries of our annual budget, as approved by the Management Board, our principal executive officer and other senior and executive level employees determine the base salaries and cash-based incentive opportunities offered to our executives.\nElements of Compensation\nCompensation offered to our named executive officers, or NEOs, primarily consists of annual compensation in the form of base salaries and employee benefits/perquisites. We also offer our NEOs cash-based incentive opportunities. In addition, we offer our NEOs the opportunity to defer all or a portion of their annual compensation under a deferred compensation plan, or DCP, and to participate in the Mohegan Retirement and 401(k) Plan, both of which are sponsored by the Mohegan Tribe. The following presents additional information relating to the elements of compensation offered to our NEOs:\nAnnual Compensation\nAnnual compensation consists of base salaries and employee benefits. These elements are intended to provide some degree of compensation certainty to our NEOs by providing compensation that, unlike incentive compensation, is not at-risk based upon company performance.\nBase Salary\nWe believe that a competitive base salary is an important component of compensation as it provides a degree of financial stability and is a critical factor in recruiting and retaining our NEOs. Base salary is also designed to recognize the scope of responsibilities placed under each NEO and to reward each NEO for their unique leadership skills, management experience and contributions to the Company.\nIn determining base salary levels, we take into consideration economic and industry conditions and company performance. We do not assign relative weights to individual and company performance, but instead make a subjective determination after considering such measures collectively. Base salary is also evaluated relative to other components of our executive compensation program to ensure that each NEO's total compensation and mix of components are consistent with our overall compensation objectives and philosophies.\nWith these factors in mind, we have entered into employment agreements with our NEOs that, among other things, provide for minimum base salary levels and employee benefits that, when combined, provide total compensation reflecting our need to\ncompete for and retain management talent in a competitive environment. Our NEOs base salaries are also subject to annual increases.\nEmployee Benefits\nOur NEOs receive certain employee benefits, including health insurance, dental and vision coverage, prescription drug plans, long-term disability insurance, life and accidental death and dismemberment insurance and flexible spending accounts. Our NEOs are also provided the opportunity to receive discretionary employer-matching 401(k) contributions of 50%, up to the first 6% of their eligible compensation contributed under the Mohegan Retirement and 401(k) Plan.\nIncentive Compensation\nWe also have a discretionary incentive compensation plan covering certain of our employees. As it pertains to our NEOs, the plan generally sets aside approximately 25% of our Adjusted EBITDA in excess of a target established prior to the beginning of the fiscal year as part of our budgeting process. Adjusted EBITDA eliminates certain items from net income, such as interest, taxes, depreciation, amortization and certain non-cash and other items. Adjusted EBITDA is not a measure of performance calculated in accordance with accounting principles generally accepted in the United States of America, or US GAAP. However, we have historically evaluated our operating performance with the non-US GAAP measure Adjusted EBITDA. Under the plan, the base incentive compensation target for our NEOs is generally set at 35% of base salary, with a maximum payout of 52.5% of base salary. For the fiscal years ended September 30, 2022 and 2021, the payout rates to our eligible NEOs were approximately 35% and 33%, respectively. For the fiscal year ended September 30, 2020, Adjusted EBITDA did not exceed our established targets and, as such, no incentive compensation was paid to our NEOs.\nCompensation Committee Report\nOur nine-member Management Board serves as our Compensation Committee. The Management Board met with us to review and discuss the preceding Compensation Discussion and Analysis. Based on such review and discussion, the Management Board approved this Compensation Discussion and Analysis and authorized its inclusion in this Annual Report on Form 10-K.\nManagement Board\nThe members of the Management Board are as follows: Ralph James Gessner, Jr., Sarah E. Harris, Patricia A. LaPierre, Joseph M. Soper, Thayne D. Hutchins, Jr., William Quidgeon, Jr., John G. Harris, Kenneth Davison and Mark F. Brown.\nSummary Compensation Table\nName and Principal Position Fiscal Year Base Salary Cash Bonus Non-Equity\nIncentive\nCompensation All\nOther\nCompensation (5)\nTotal\nRaymond Pineault (1)\n2022 $ 1,027,693 360,500 - 9,834 $ 1,398,027\nChief Executive Officer 2021 $ 883,667 325,493 - 4,959 $ 1,214,119\n2020 $ 679,650 - - 4,965 $ 684,615\nCarol K. Anderson (2)\n2022 $ 617,308 396,300 - 9,834 $ 1,023,442\nChief Financial Officer\n2021 $ 311,767 270,296 - 158 $ 582,221\nJody Madigan (3)\n2022 $ 600,000 310,000 - 9,702 $ 919,702\nChief Operating Officer 2021 $ 34,615 50,000 - - $ 84,615\nMario C. Kontomerkos (4)\n2022 $ - - - 579,986 $ 579,986\nFormer Chief Executive Officer 2021 $ 691,764 - - 528,083 $ 1,219,847\n2020 $ 948,598 - - 690 $ 949,288\n_________\n(1)Appointed Chief Executive Officer on May 27, 2021. Served as interim Chief Executive Officer from March 31, 2021 to May 26, 2021. Served as Chief Operating Officer from July 17, 2020 to March 30, 2021.\n(2)Commenced employment on March 15, 2021.\n(3)Commenced employment on August 30, 2021.\n(4)Ceased employment on March 31, 2021.\n(5)Amounts reported in this column are comprised of the following:\nAll Other Compensation Details\nName Fiscal\nYear 401(k) (1)\nLong-Term\nDisability (2)\nPost-Employment\nPayout (3)\nTotal\nRaymond Pineault 2022 $ 9,150 684 - $ 9,834\n2021 $ 4,275 684 - $ 4,959\n2020 $ 4,275 690 - $ 4,965\nCarol K. Anderson 2022 $ 9,150 684 - $ 9,834\n2021 $ - 158 - $ 158\nJody Madigan 2022 $ 9,150 552 - $ 9,702\n2021 $ - - - $ -\nMario C. Kontomerkos 2022 $ - - 579,986 $ 579,986\n2021 $ - 342 527,741 $ 528,083\n2020 $ - 690 - $ 690\n_________\n(1)Employer-matching 401(k) contributions.\n(2)Premium payments on long-term disability policies.\n(3)Payments pertaining to post-employment benefits.\nNon-Qualified Deferred Compensation\nWe offer our NEOs the opportunity to participate in the DCP. The DCP is a non-qualified plan that allows our executives the opportunity to defer all or a portion of their annual compensation. We do not make contributions to the DCP on behalf of our NEOs. None of our NEOs participate in the DCP.\nMohegan Benefit Plan\nWe offer our NEOs the opportunity to participate in the Mohegan Benefit Plan. The Mohegan Benefit Plan is sponsored by the Mohegan Tribe for the benefit of participants who authorize the purchase of life insurance policies as a means of providing certain life insurance benefits to the participants and their spouses as joint insured. For the fiscal years ended September 30, 2022, 2021 and 2020, contributions to the Mohegan Benefit Plan on behalf of Mr. Pineault totaled $231,485, $200,507 and $67,831, respectively. Ms. Anderson and Mr. Madigan do not participate in the Mohegan Benefit Plan.\nPotential Payments and Benefits upon Termination or Change in Control\nThe following table presents potential payments to our NEOs in the event of a termination of employment, based on the terms of their employment agreements, as described below. Due to our sovereignty, potential payments upon change in control are not included within the table below, as these are not applicable. The amounts presented represent our estimate of potential payments to our NEOs upon their termination, assuming, in each case, that termination occurred on September 30, 2022, the last day of fiscal 2022. Actual payments can only be determined at the time of each NEO's separation from the Company.\nBase Salary Medical\nBenefits Other\nPayment Total\nRaymond Pineault\nTermination without cause (1)\n$ 1,060,900 27,755 25,000 $ 1,113,655\nTermination due to medical disability (3)\n$ 530,450 13,878 - $ 544,328\nChange of Control\n$ - - - $ -\nCarol K. Anderson\nTermination without cause (2)\n$ 636,540 19,105 - $ 655,645\nTermination due to medical disability (3)\n$ 318,270 9,552 - $ 327,822\nChange of Control\n$ - - - $ -\nJody Madigan\nTermination without cause (2)\n$ 618,000 27,755 - $ 645,755\nTermination due to medical disability (3)\n$ 309,000 13,878 - $ 322,878\nChange of Control\n$ - - - $ -\n_________\n(1)Under Mr. Pineault's employment agreement, upon termination without cause, we are required to continue to pay his base salary for 12 months and a $25,000 relocation benefit and provide medical benefits for a period of one year following such termination.\n(2)Under each of Ms. Andersons and Mr. Madigans employment agreements, upon termination without cause, we are required to pay their base salary for 12 months and provide medical benefits for a period of one year following such termination.\n(3)Under each NEO's employment agreement, upon termination due to medical disability, we are required to continue to pay their base salary and provide medical benefits for a period of 180 days; thereafter, if we choose to suspend their employment or they are deemed permanently disabled, we are required to provide disability insurance coverage per our disability insurance program.\nExecutive Employment Agreements\nMr. Pineault. Mr. Pineaults employment agreement commenced effective May 27, 2021. The agreement provides for a base annual salary of $1,000,000, subject to annual increases. Mr. Pineault is also entitled to participate in our discretionary incentive compensation plan. In accordance with Mr. Pineaults prior employment agreement, his new employment agreement has no specified term. The agreement provides that if Mr. Pineault is terminated for cause, as defined under his agreement, or if Mr. Pineault voluntarily terminates his employment, he will not be entitled to any further compensation from and after the termination date. If Mr. Pineault is terminated other than for cause, he will be entitled, among other things, to receive his base annual salary from the termination date through 12 months from the termination date.\nMs. Anderson. Ms. Andersons employment agreement commenced as of March 15, 2021. The agreement provides for a base annual salary of $600,000, subject to annual increases, and a sign-on payment in the amount of $175,000 allocated over the first two years of employment. Ms. Anderson is also entitled to participate in our discretionary incentive compensation plan. The agreement is subject to automatic renewals for additional one-year terms unless either party provides notice, at least six months prior to the end of the initial three-year term or any renewal terms, of an intention not to renew or otherwise terminate the agreement. The agreement provides that if Ms. Anderson is terminated for cause, as defined under her agreement, or if Ms. Anderson voluntarily terminates her employment, she will not be entitled to any further compensation from and after the termination date. If Ms. Anderson is terminated other than for cause, she will be entitled, among other things, to receive her base annual salary from the termination date through 12 months from the termination date.\nMr. Madigan. Mr. Madigans employment agreement commenced as of August 30, 2021. The agreement provides for a base annual salary of $600,000, subject to annual increases, and a sign-on payment in the amount of $50,000. Mr. Madigan is also entitled to participate in our discretionary incentive compensation plan. In addition, Mr. Madigan was eligible for an additional bonus for fiscal 2022 in an amount of between $50,000 and $100,000 based on a sliding-scale EBITDA achievement target. The agreement is subject to automatic renewals for additional one-year terms unless either party provides notice, at least six months prior to the end of the initial term of March 31, 2025 or any renewal terms, of an intention not to renew or otherwise terminate the agreement. The agreement provides that if Mr. Madigan is terminated for cause, as defined under his agreement, or if Mr. Madigan voluntarily terminates his employment, he will not be entitled to any further compensation from and after the termination date. If Mr. Madigan is terminated other than for cause, he will be entitled, among other things, to receive his base annual salary from the termination date through 12 months from the termination date.\nCEO Pay Ratio\nWe calculated our CEO Pay Ratio, or the ratio of the pay of our Chief Executive Officer to that of our median employee, as permitted under Securities and Exchange Commission rules. To determine the compensation for our median employee, we included the base salary of employees employed by us during the fiscal year ended September 30, 2022, excluding our Chief Executive Officer. For full-time and part-time employees, we annualized their hourly pay rates, and, for seasonal and on-call employees, we utilized payroll compensation consistent with what would have been reported on each employee's W-2, Box 1 as of September 30, 2022. Based on the above, for fiscal 2022, our Chief Executive Officer's base salary was $1,027,693 and our median employee's compensation was $29,120, resulting in a CEO Pay Ratio of approximately 35:1.\nCompensation of Management Board\nThe following table presents data related to compensation of members of the Management Board for the fiscal year ended September 30, 2022.\nName Compensation Other (1)\nTotal\nRalph James Gessner, Jr. $ 219,531 300 $ 219,831\nSarah E. Harris $ 197,178 237 $ 197,415\nPatricia A. LaPierre $ 162,050 111 $ 162,161\nJoseph M. Soper $ 162,050 222 $ 162,272\nThayne D. Hutchins, Jr. $ 161,427 222 $ 161,649\nWilliam Quidgeon, Jr. $ 162,050 222 $ 162,272\nJohn G. Harris $ 162,002 145 $ 162,147\nKenneth Davison $ 157,478 216 $ 157,694\nMark F. Brown (2)\n$ 158,973 145 $ 159,118\n_________\n(1)Premium payments on life insurance policies owned by each member.\n(2)Term commenced on October 4, 2021.\nMembers of the Management Board are paid annual salaries by the Mohegan Tribe for their services as members of the Mohegan Tribal Council. Due to the dual roles of these individuals in our governance and the Mohegan Tribe's, we are obligated to fund a portion of their compensation pursuant to an arrangement established at the time of Mohegan Sun's inception. For the fiscal year ended September 30, 2022, we were obligated to fund 60% of each member's annual compensation. This allocation was determined based on the amount of time members acted in their capacity as the Management Board as opposed to their capacity as the Mohegan Tribal Council. We believe that members' activities in fiscal 2023 will be consistent with their fiscal 2022 activities and, as such, we expect to fund 60% of their fiscal 2023 compensation.\nCompensation Committee Interlocks and Insider Participation\nAs noted above, the Management Board serves as our Compensation Committee. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nWe have no outstanding equity securities. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nProcedure for Review of Related Party Transactions\nPotential conflicts of interest, including related party transactions reportable under Securities and Exchange Commission rules, must be approved in advance. We have a code of ethics which applies to our principal executive officer, principal financial officer and all other executive officers, whom we collectively refer to as our principal officers. Our code of ethics addresses, among other things, conflicts of interest and is available on our website at www.mohegangaming.com. Under our code of ethics, actual, potential or perceived conflicts of interest must be disclosed to our Management Board, and only the Management Board may waive provisions of our code of ethics.\nOur Management Board reviews all transactions between us and principal officers. In addition, our corporate governance practices include procedures for discussing and assessing relationships among us and principal officers, including business, financial and family member, as applicable. Our Management Board also reviews transactions with principal officers, on a case-by-case basis, to determine whether any conflict of interest exists. Additionally, our Management Board ensures that directors voting on such matters have no interest in the matter and discusses transactions with counsel as deemed necessary.\nTransactions between the Company and the Companys Subsidiaries and the Mohegan Tribe\nRefer to Part II. Item 8. Financial Statements and Supplementary Data. Note 8-Related Party Transactions to this Annual Report on Form 10-K.\nCorporate Governance and Management Board Independence\nWe are governed by a nine-member Management Board, whose members also comprise the Mohegan Tribal Council, the governing body of the Mohegan Tribe. Any change in the composition of the Mohegan Tribal Council results in a corresponding change in our Management Board. Upon election, each Mohegan Tribal Council and Management Board member serves a four-year term on a staggered basis. Incumbent members of the Mohegan Tribal Council do not nominate or otherwise identify candidates for election. Accordingly, the Mohegan Tribal Council and Management Board do not screen candidates for election nor do they maintain a nominating committee. Instead, the registered voters of the Mohegan Tribe elect all members of the Mohegan Tribal Council. In order to qualify for, and seek election to a position on the Mohegan Tribal Council, an individual: (1) must be at least 21 years of age prior to the date of the election, (2) must be a registered voting member of the Mohegan Tribe in good standing and (3) must not have been convicted of either a felony or a misdemeanor involving moral integrity, such as forgery or bribery. In addition, an individual must comply with the tribal election ordinance, including requirements for declaring the intention to run and submission to a comprehensive background check, to qualify for and seek election.\nAs described above, members of the Management Board are also members of the Mohegan Tribe and the Mohegan Tribal Council. Due to the relationships between us and the Mohegan Tribe, as described above, none of the Management Board members would qualify as independent directors within the rules of the New York Stock Exchange or the NASDAQ Stock Market. Item 14. Principal Accounting Fees and Services.\nThe following table presents the aggregate fees paid or accrued for professional services rendered by Deloitte & Touche LLP:\nFiscal 2022 Fiscal 2021\nAudit fees (1)\n$ 1,759,800 $ 1,495,950\nTax fees 245,953 217,250\nTotal $ 2,005,753 $ 1,713,200\n_________\n(1)Audit fees include fees for our annual audit, quarterly reviews and services rendered in connection with regulatory filings with the Securities and Exchange Commission.\nThe Audit Committees independent registered public accounting firm independence policy provides for pre-approval of all services performed by our independent registered public accounting firm. All above services were pre-approved by the Audit Committee. The Audit Committee considered whether the provision of these services was compatible with maintaining independent registered public accounting firm independence.\nPART IV Item 15. Exhibit and Financial Statement Schedules.\n(a) Documents filed as part of this Annual Report on Form 10-K.\n(1) List of Financial Statements\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Operations and Comprehensive Income (Loss)\nConsolidated Statements of Changes in Capital\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\n(2) List of Financial Statement Schedule\nSchedule II-Valuation and Qualifying Accounts and Reserves\n(3) List of Exhibits\nExhibit No. Description\n2.1* Amended and Restated Transition and Asset Purchase Agreement, dated May 1, 2019, among MGE Niagara Entertainment Inc., Ontario Lottery and Gaming Corporation and Ontario Gaming Assets Corporation (filed as Exhibit 2.1 to the Mohegan Tribal Gaming Authoritys Form 8-K, filed with the SEC on June 14, 2019 (the June 2019 Form 8-K) and incorporated by reference herein).**\n2.2* First Amendment to Amended and Restated Transition and Asset Purchase Agreement, dated June 6, 2019, among MGE Niagara Entertainment Inc., Ontario Lottery and Gaming Corporation and Ontario Gaming Assets Corporation (filed as Exhibit 2.2 to the June 2019 Form 8-K and incorporated by reference herein).\n2.3* Second Amendment to Amended and Restated Transition and Asset Purchase Agreement, dated June 7, 2019, among MGE Niagara Entertainment Inc., Ontario Lottery and Gaming Corporation and Ontario Gaming Assets Corporation (filed as Exhibit 2.3 to the June 2019 Form 8-K and incorporated by reference herein).**\n3.1* Constitution of the Mohegan Tribe of Indians of Connecticut, as amended (filed as Exhibit 3.1 to the Mohegan Tribal Gaming Authoritys Registration Statement on Form S-4, filed with the SEC on January 27, 2014 (the 2014 Form S-4) and incorporated by reference herein).\n3.2 Ordinance No. 95-2 of the Tribe for Gaming on Tribal Lands, enacted on July 15, 1995 (filed as Exhibit 3.2 to the Mohegan Tribal Gaming Authoritys Amendment No. 1 to its Registration Statement on Form S-1, filed with the SEC on February 29, 1996 (the \"1996 Form S-1\") and incorporated by reference herein).\n4.1* Indenture, dated as of October 14, 2016, among the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut, the Guarantors party thereto and U.S. Bank National Association, as Trustee, relating to the 7.875% Senior Notes due 2024 of the Mohegan Tribal Gaming Authority (filed as Exhibit 4.1 to the Mohegan Tribal Gaming Authoritys Form 8-K, filed with the SEC on October 20, 2016 (the October 2016 Form 8-K) and incorporated by reference herein).\n4.2* Promissory Note, dated as of December 15, 2017, by and between Salishan-Mohegan, LLC and Salishan Company, LLC (filed as Exhibit 4.2 to the Mohegan Tribal Gaming Authoritys Annual Report on Form 10-K for the fiscal year ended September 30, 2017, filed with the SEC on December 22, 2017 (the 2017 Form 10-K) and incorporated by reference herein).\n4.3* Waiver, dated as of June 11, 2020, by and among the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut and U.S. Bank National Association, as Trustee (filed as Exhibit 4.1 to the Mohegan Tribal Gaming Authoritys Form 8-K, filed with the SEC on June 18, 2020 and incorporated by reference herein).\n4.4* Indenture, dated as of January 26, 2021, among the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut, the guarantors party thereto and U.S. Bank National Association, as trustee, relating to the 8.000% Second Priority Senior Secured Notes due 2026 (filed as Exhibit 4.1 to the Mohegan Tribal Gaming Authority's Form 8-K, filed with the SEC on January 27, 2021 (the January 2021 Form 8-K) and incorporated by reference herein).\n4.5* First Supplemental Indenture, dated as of July 23, 2021, among Mohegan Digital, LLC and Mohegan Digital Services, LLC, the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut and U.S. Bank National Association, as trustee, relating to the 8.000% Second Priority Senior Secured Notes due 2026 (filed as Exhibit 4.1 to the Mohegan Tribal Gaming Authoritys Quarterly Report on Form 10-Q for the period ended June 30, 2021, filed with the SEC on August 12, 2021 (the June 30, 2021 Form 10-Q) and incorporated by reference herein).\n4.6* First Supplemental Indenture, dated as of July 23, 2021, among Mohegan Digital, LLC and Mohegan Digital Services, LLC, the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut and U.S. Bank National Association, as trustee, relating to the 7.875% Senior Notes due 2024 (filed as Exhibit 4.2 to the June 30, 2021 Form 10-Q and incorporated by reference herein).\n4.7* Second Supplemental Indenture, dated as of November 1, 2021, among MGNV Holding, LLC and MGNV, LLC, the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut and U.S. Bank National Association, as trustee, relating to the 8.000% Second Priority Senior Secured Notes due 2026 (filed as Exhibit 4.7 to the Mohegan Tribal Gaming Authoritys Annual Report on Form 10-K for the fiscal year ended September 30, 2021, filed with the SEC on December 16, 2021 (the 2021 Form 10-K) and incorporated by reference herein).\n4.8* Second Supplemental Indenture, dated as of November 1, 2021, among MGNV Holding, LLC and MGNV, LLC, the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut and U.S. Bank National Association, as trustee, relating to the 7.875% Senior Notes due 2024 (filed as Exhibit 4.8 to the 2021 Form 10-K and incorporated by reference herein).\n4.9* Third Supplemental Indenture, dated as of April 1, 2022, among Mohegan Expo Center, LLC, the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut and U.S. Bank Trust Company, National Association, as trustee, relating to the 8.000% Second Priority Senior Secured Notes due 2026 (filed as Exhibit 4.1 to the Mohegan Tribal Gaming Authoritys Quarterly Report on Form 10-Q for the period ended March 31, 2022, filed with the SEC on May 12, 2022 (the March 31, 2022 Form 10-Q) and incorporated by reference herein).\n4.10* Third Supplemental Indenture, dated as of April 1, 2022, among Mohegan Expo Center, LLC, the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut and U.S. Bank National Association, as trustee, relating to the 7.875% Senior Notes due 2024 (filed as Exhibit 4.2 to the March 31, 2022 Form 10-Q and incorporated by reference herein).\n10.1 The Mohegan Tribe-State of Connecticut Gaming Compact between the Mohegan Tribe of Indians of Connecticut and the State of Connecticut (filed as Exhibit 10.1 to the 1996 Form S-1 and incorporated by reference herein).\n10.2 Agreement, dated as of April 25, 1994, between the Mohegan Tribe of Indians of Connecticut and the State of Connecticut resolving certain land claims (filed as Exhibit 10.2 to the 1996 Form S-1 and incorporated by reference herein).\n10.3 Memorandum of Understanding, dated as of April 25, 1994, between the Mohegan Tribe of Indians of Connecticut and the State of Connecticut regarding implementation of the Compact and the Resolution Agreement (filed as Exhibit 10.3 to the 1996 Form S-1 and incorporated by reference herein).\n10.4 Agreement, dated as of June 16, 1994, between the Mohegan Tribe of Indians of Connecticut and the Town of Montville, Connecticut (filed as Exhibit 10.4 to the 1996 Form S-1 and incorporated by reference herein).\n10.5* Amended and Restated Land Lease, dated as of October 14, 2016, between the Mohegan Tribe of Indians of Connecticut and the Mohegan Tribal Gaming Authority (filed as Exhibit 10.2 to the October 2016 Form 8-K and incorporated by reference herein).\n10.6* The Merrill Lynch Non-Qualified Deferred Compensation Plan Trust Agreement, dated as of September 1, 1998, between the Mohegan Tribal Gaming Authority and Merrill Lynch Trust (filed as Exhibit 10.16 to the Mohegan Tribal Gaming Authoritys Form 10-K405 for the fiscal year ended September 30, 1998, filed with the SEC on December 29, 1998 and incorporated by reference herein).***\n10.7* Priority Distribution Agreement, dated as of August 1, 2001, between the Mohegan Tribal Gaming Authority and the Mohegan Tribe of Indians of Connecticut (filed as Exhibit 10.1 to the Mohegan Tribal Gaming Authoritys Quarterly Report on Form 10-Q for the period ended June 30, 2001, filed with the SEC on August 10, 2001 and incorporated by reference herein).\n10.8* First Amendment to the Priority Distribution Agreement, dated as of December 31, 2014, by and between the Mohegan Tribal Gaming Authority and the Mohegan Tribe of Indians of Connecticut (filed as Exhibit 10.1 to the Mohegan Tribal Gaming Authoritys Quarterly Report on Form 10-Q for the period ended December 31, 2014, filed with the SEC on February 17, 2015 and incorporated by reference herein).\n10.9* Management Agreement, dated as of September 21, 2004, between The Cowlitz Indian Tribe and Salishan-Mohegan, LLC (filed as Exhibit 10.30 to the Mohegan Tribal Gaming Authoritys Registration Statement on Form S-4, filed with the SEC on November 1, 2004 (the \"2004 Form S-4\") and incorporated by reference herein).\n10.10* Development Agreement, dated as of September 21, 2004, between The Cowlitz Indian Tribe and Salishan-Mohegan, LLC (filed as Exhibit 10.31 to the 2004 Form S-4 and incorporated by reference herein).\n10.11* Membership Interest Redemption and Withdrawal Agreement, dated as of April 14, 2017, by and between Salishan-Mohegan, LLC and Salishan Company, LLC (filed as Exhibit 10.23 to the 2017 Form 10-K and incorporated by reference herein).\n10.12* Agreement between The Mohegan Tribe of Indians of Connecticut and the State of Connecticut dated July 26, 2021 (filed as Exhibit 10.1 to the Mohegan Tribal Gaming Authority's Form 8-K, filed with the SEC on September 28, 2021 (the September 2021 Form 8-K) and incorporated by reference herein).\n10.13* Memorandum of Understanding between The Mohegan Tribe of Indians of Connecticut and the State of Connecticut dated July 26, 2021 (filed as Exhibit 10.2 to the September 2021 Form 8-K and incorporated by reference herein).\n10.14* Credit Agreement, dated as of January 26, 2021, among the Mohegan Tribal Gaming Authority, the Mohegan Tribe of Indians of Connecticut, Citizens Bank, N.A. as administrative agent, and the other lenders and financial institutions party thereto (filed as Exhibit 10.1 to the January 2021 Form 8-K and incorporated by reference herein).**\n10.15* First Amendment to Credit Agreement, dated as of May 31, 2022, by and among the Mohegan Tribe of Indians of Connecticut, the Mohegan Tribal Gaming Authority, the other loan parties party thereto, each of the lenders party thereto and Citizens Bank, N.A., as administrative agent (filed as Exhibit 10.1 to the Mohegan Tribal Gaming Authority's Form 8-K, filed with the SEC on June 3, 2022 and incorporated by reference herein).\n10.16* Amended and Restated Credit Agreement, dated as of July 14, 2021, among MGE Niagara Entertainment Inc., the lenders named therein, Bank of Montreal, as administrative agent, and the other parties thereto (filed as Exhibit 10.1 to the Mohegan Tribal Gaming Authority's Form 8-K, filed with the SEC on July 20, 2021 and incorporated by reference herein).**\n10.17* Amending Agreement, dated as of September 29, 2022, by and among MGE Niagara Entertainment Inc., among others, Bank of Montreal, as administrative agent, and the lenders party thereto (filed as Exhibit 10.1 to the Mohegan Tribal Gaming Authority's Form 8-K, filed with the SEC on October 3, 2022 and incorporated by reference herein).\n10.18* Loan Agreement, dated September 24, 2021, among Inspire Integrated Resort Co., Ltd., the lenders named therein, Kookmin Bank Co., Ltd. as Facility Agent, and the other parties thereto (filed as Exhibit 10.19 to the 2021 Form 10-K and incorporated by reference herein).**\n10.19* Secured Term Loan Facility, dated November 4, 2021, among MGE Korea Limited, the financial institutions named therein, Serica Agency Limited as Facility Agent and Security Agent, and the other parties thereto (filed as Exhibit 10.20 to the 2021 Form 10-K and incorporated by reference herein).**\n10.20* Warrant Agreement, dated November 4, 2021, by and among MGE Korea Holding III Limited, BCC Inspire Aggregator, L.P., Royale SS II Ltd., and the other parties thereto (filed as Exhibit 10.21 to the 2021 Form 10-K and incorporated by reference herein).**\n10.21* Employment agreement, effective March 15, 2021, by and between the Mohegan Tribal Gaming Authority and Carol K. Anderson (filed as Exhibit 10.1 to the Mohegan Tribal Gaming Authority's Form 8-K, filed with the SEC on March 18, 2021 and incorporated by reference herein).***\n10.22* Employment agreement, effective August 30, 2021, by and between the Mohegan Tribal Gaming Authority and Jody Madigan (filed as Exhibit 10.1 to the Mohegan Tribal Gaming Authoritys Form 8-K, filed with the SEC on September 9, 2021 and incorporated by reference herein).***\n10.23* Employment Agreement, dated as of October 20, 2021, and effective as of May 27, 2021, by and between the Mohegan Tribal Gaming Authority and Raymond Pineault (filed as Exhibit 10.1 to the Mohegan Tribal Gaming Authority's Form 8-K/A, filed with the SEC on October 26, 2021 and incorporated by reference herein).***\n21.1* Subsidiaries of the Registrant (filed as Exhibit 21.1 to the Mohegan Tribal Gaming Authoritys Annual Report on Form 10-K for the fiscal year ended September 30, 2020, filed with the SEC on December 29, 2020 and incorporated by reference herein).\n31.1* Rule 13a-14(a)/15d-14(a) Certification of Chief Executive Officer (filed herewith).\n31.2* Rule 13a-14(a)/15d-14(a) Certification of Chief Financial Officer (filed herewith).\n32.1* Section 1350 Certification of Chief Executive Officer (filed herewith).\n32.2* Section 1350 Certification of Chief Financial Officer (filed herewith).\n101.INS* XBRL Instance Document (filed herewith).\n101.SCH* XBRL Taxonomy Extension Schema (filed herewith).\n101.CAL* XBRL Taxonomy Calculation Linkbase (filed herewith).\n101.DEF* XBRL Taxonomy Extension Definition Linkbase (filed herewith).\n101.LAB* XBRL Taxonomy Extension Label Linkbase (filed herewith).\n101.PRE* XBRL Taxonomy Extension Presentation Linkbase (filed herewith).\n104 Cover Page Interactive Data File (formatted as Inline XBRL).\n_________\n* Exhibits transmitted via EDGAR.\n** Certain portions of this exhibit have been omitted pursuant to Item 601 of Regulation S-K. Upon request by the Securities and Exchange Commission, we hereby undertake to furnish supplementary to the Securities and Exchange Commission a copy of any omitted information.\n*** Management contract or compensatory plan or arrangement.\nItem 16. Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the Mohegan Tribal Gaming Authority has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned thereunto duly authorized on December 20, 2022.\nMOHEGAN TRIBAL GAMING AUTHORITY\nBy: /S/ RALPH JAMES GESSNER JR.\nRalph James Gessner Jr.\nChairman, Management Board\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this Annual Report on Form 10-K has been signed by the following persons on behalf of the Mohegan Tribal Gaming Authority and in the capacities indicated on December 20, 2022.\nSIGNATURE TITLE\n/S/ RALPH JAMES GESSNER JR. Chairman and Member, Management Board\nRalph James Gessner Jr.\n/S/ SARAH E. HARRIS Vice Chairwoman and Member, Management Board\nSarah E. Harris\n/S/ RAYMOND PINEAULT Chief Executive Officer, Mohegan Tribal Gaming Authority\nRaymond Pineault (Principal Executive Officer)\n/S/ CAROL K. ANDERSON Chief Financial Officer, Mohegan Tribal Gaming Authority\nCarol K. Anderson (Principal Financial Officer)\n/S/ HAVEN S. POPE Chief Accounting Officer, Mohegan Tribal Gaming Authority\nHaven S. Pope (Principal Accounting Officer)\n/S/ PATRICIA A. LAPIERRE Recording Secretary and Member, Management Board\nPatricia A. LaPierre\n/S/ JOSEPH M. SOPER Corresponding Secretary and Member, Management Board\nJoseph M. Soper\n/S/ THAYNE D. HUTCHINS JR. Treasurer and Member, Management Board\nThayne D. Hutchins Jr.\n/S/ WILLIAM QUIDGEON JR. Member, Management Board\nWilliam Quidgeon Jr.\n/S/ JOHN G. HARRIS Member, Management Board\nJohn G. Harris\n/S/ KENNETH DAVISON Member, Management Board\nKenneth Davison\n/S/ MARK F. BROWN Member, Management Board\nMark F. Brown\nSupplemental information to be furnished with reports filed pursuant to Section 15(d) of the Securities Exchange Act of 1934, as amended, by registrants which have not registered securities pursuant to Section 12 of the Securities Exchange Act of 1934, as amended.\nWe have not sent an annual report or proxy statement to security holders. We will not be sending an annual report or proxy statement to security holders subsequent to the filing of this Annual Report on Form 10-K."
}