{
    "cik": "1006028",
    "company": "PURE BIOSCIENCE, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-10-30",
    "period_of_report": "2023-07-31",
    "sic": "2890",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1006028/0001493152-23-038673-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1006028/000149315223038673/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1006028/0001493152-23-038673.txt",
    "filename": "1006028_10K_2023_0001493152-23-038673.htm",
    "content": "Item 1. Business\nOverview\nWe are focused on developing and commercializing proprietary antimicrobial products that provide safe and cost-effective solutions to the health and environmental challenges of pathogen and hygienic control. Our technology platform is based on patented stabilized ionic silver, and our initial products contain SDC. SDC is a broad-spectrum, non-toxic antimicrobial agent, which offers residual protection and formulates well with other compounds. As a platform technology, we believe SDC is distinguished from existing products in the marketplace because of its superior efficacy, reduced toxicity, non-causticity and the inability of bacteria to form a resistance to it.\nWe believe there is a significant market opportunity for our safe, non-toxic, non-caustic and effective SDC-based solutions. We currently offer PURE® Hard Surface as a food contact surface sanitizer and disinfectant to restaurant chains, food processors and food transportation companies. We also offer PURE Control® as a direct food contact processing aid. In addition to our direct sales efforts with PURE Hard Surface and PURE Control, we market and sell our SDC-based products indirectly through third-party distributors supporting various industries.\nTechnology Platform\nThe foundation of our technology platform is a proprietary electrochemical process that allows us to generate ionized silver in the presence of organic acid. This process creates a solution containing stabilized ionic silver that can function as an antimicrobial. Our current products all contain SDC, which we produce by ionizing silver in citric acid. SDC is a natural, non-toxic, non-caustic, colorless, odorless antimicrobial agent, which offers residual protection, and that formulates well with other compounds. We have also produced ionic silver-based molecular entities using other organic acids, and we believe these compounds may provide a platform for future product development.\nSilver as an Antimicrobial\nThe use of silver as an antimicrobial dates back to ancient times when water, wine and other beverages were kept in silver vessels to maintain freshness. Ancient Egyptians applied thin strips of beaten silver around wounds to avoid infection, and early royalty ate from silver plates and with silver utensils to stay healthy. In the past half-century, silver in colloidal and ionic forms has been used successfully in a wide array of antimicrobial applications, including water purification and topical treatments for burn victims. Silver must be in an ionic form to be effective at killing microorganisms. The short shelf-life of previous ionic silver solutions has limited the development of ionic-silver based antimicrobials. SDC, as a stabilized silver ion complex, has a shelf life of more than a decade because the weak bond of the silver ion to the citric acid allows the ion to remain stable in solution while at the same time making it bioavailable for antimicrobial action.\nMechanisms of Action\nThe rapid and broad-spectrum efficacy of SDC is attributed to its dual mechanisms of action, both with respect to killing bacteria and other microorganisms and acting against viruses. SDC can kill microorganisms at both the extracellular and intracellular levels. SDC attracts bacteria because the citric acid is recognized by the organism as a food source. SDC easily enters the microorganism through membrane transport proteins. Once inside the organism, SDC binds to DNA and intracellular proteins causing irreversible damage to the DNA and protein structure. Metabolic and reproductive functions halt, and the organism dies. SDC can also act on an organisms outer membrane. Silver ions are highly attracted to sulfur-containing thiol groups found in metabolic and structural proteins bound to the membrane surface. SDC targets these critical proteins and destroys their structure. This disruption of the organisms membrane function and integrity leads to its death.\nViruses are much smaller than bacteria and present fewer target sites on which a biocide can act. The efficacy of SDC against enveloped and non-enveloped viruses comes from its ability to destroy not only the viral envelope, preventing the virus from attaching to a host cell, but also the infectious component of the virus, the nucleic acid.\nSafety Profile\nResearch has shown that silver is an effective antimicrobial and not toxic to humans at the residual levels following the use of our SDC-based products. In addition, our data shows the components of SDC, ionic silver and citric acid, to be non-toxic, particularly at the low concentrations required to eliminate microorganisms. At higher concentrations, citric acid can be an eye irritant. We have tested a concentrated SDC formulation using standard protocols to measure acute toxicity. Acute oral and dermal toxicity was not observed at doses up to and including 5000 mg/kg. Data from eye and skin studies showed only slight irritation and no dermal sensitization.\nGenerally Recognized as Safe Status as Contact Biocide\nA committee of independent experts critically reviewed efficacy and toxicity data for SDC and the SDC-based PURE Hard Surface disinfectant and food contact surface sanitizer. The committee found no evidence that SDC demonstrates a hazard to the public when used as a contact biocide on food contact surfaces and food-use utensils. The committee, therefore, concluded such use to be generally recognized as safe, or GRAS, consistent with the U.S. Environmental Protection Agency, or EPA, registration (discussed below), allowing for use on food manufacturing and processing equipment and food preparation surfaces.\nEfficacy\nFormulations containing SDC provide complete, quick and broad-spectrum antimicrobial efficacy against gram positive and gram negative bacteria, enveloped and non-enveloped viruses, and fungi. In addition to quick kill times, SDC provides residual antimicrobial activity. SDC also provides rapid kill times against multiple drug resistant bacteria, including Methicillin-resistant Staphylococcus aureus, or MRSA, Vancomycin resistant Enterococcus faecium, or VRE, Carbapenem resistant Escherichia coli, Carbapenem resistant Klebsiella pneumoniae and Carbapenem resistant Klebsiella pneumoniae, NDM-1+. See EPA Registrations below for more detailed efficacy data.\nNatural and Environmentally Responsible\nSDC is made of simple and all-natural ingredients: water, citric acid and minute amounts of ionic silver. SDC does not present a threat to the environment. If introduced to water systems, the low concentrations of ionic silver in SDC would react with naturally present substances such as chlorides, sulfides and organic matter. These reactions would create insoluble silver complexes and render the silver inert. In addition, we manufacture SDC through a zero waste process in which no byproducts or environmental effluent are created.\nMarket Opportunity\nU.S. Incidence and Cost of Foodborne Illness\nAccording to an Ohio State University study published in the Journal of Food Protection, completed by Dr. Scharff, a consumer science professor, foodborne illness poses a $77.7 billion economic burden in the United States annually. This cost estimate includes health related costs, associated medical costs, productivity losses, mortality, and pain and suffering. The study noted that excluding the estimated costs for pain and suffering, health related costs exceeded $51 billion. The study does not include costs to the food industry, including reduced consumer confidence, reduced brand value, product recall costs, and litigation, nor does it include the cost to public health agencies (local, state and federal) that are required to respond to illnesses and outbreaks. In addition, the study cited Salmonella as the most costly pathogen with an economic burden estimated to be in excess of $11 billion. This is primarily due to its high incidence and mortality rate.\nLimitations of Existing Food Safety Solutions\nThe U.S. food industry continues to rely on the use of toxic chemicals as processing aids or interventions during food processing operations for which pathogens are becoming increasingly resistant and rendering current interventions less efficacious. Most of these chemicals carry various warning labels for their toxic and/or caustic characteristics, which can negatively affect the safety of processing plant personnel, plant operating equipment and the plant environment and its surroundings.\nAmong the chemicals in current use are: peracetic acid, acidified sodium chlorite, or ASC, ozone, trisodium phosphate, cetylpyridinium chloride, or CPC, organic acid rinses, lactic acid, hypobromous acid and chlorine dioxide. Some of these chemicals can be difficult to work with as a processing aid as they require heating to become effective or are difficult to mix and stabilize prior to use. Additionally, some of these chemicals damage the food being processed, resulting in decreased yields. Further, the use of certain of these chemicals is limited to treating only specific pathogens and/or only certain foods. In addition, some of these chemicals can produce noxious fumes that over time have been linked to upper respiratory illness and typically require in-plant decontamination of their effluence.\nSeveral large and established corporations currently supply these chemicals. They may also provide other related food safety services such as environmental sanitation programs and food safety consultation and audit services.\nOur SDC-Based Products as a Food Safety Solution\nBased on the limitations of the existing food safety solutions, we believe that our SDC-based products, including PURE Hard Surface and PURE Control, are well positioned as new and disruptive solutions for the food safety industry. Given their broad spectrum antimicrobial efficacy and non-toxic properties, our SDC-based products provide significant improvements over current chemical interventions that can both strengthen our customers food safety practices and help them control and eliminate pathogens present during their food processing operations.\nOur SDC-based products can provide users with the following benefits compared to the current processing chemicals they are using:\n● Easier to handle and dilute;\n● Non-corrosive to processing equipment;\n● Non-toxic to manufacturing personnel by not creating noxious fumes or other detrimental environmental effluence; and\n● Neutral to positive yield impact on the processed food\nBased on their performance and characteristics, we believe our SDC-based products can provide our customers with significant advantages to the chemical interventions they are currently using and help them achieve their goal of improving the safety of processed foods they offer to consumers.\nBusiness Strategy\nOur goal is to become a sustainable company by commercializing the SDC-based products we have developed with our proprietary technology platform. We are focused on delivering leading antimicrobial products that address food safety risks across the food industry supply chain. Key aspects of our business strategy include:\n● Expanding sales and distribution for our products into the food industry with a focus on a dual track of food safety market opportunities:\n● Hard Surface Disinfectant - commercializing our current EPA-registered PURE Hard Surface disinfectant and sanitizer for use in foodservice operations, food manufacturing and food transportation.\n● Direct Food Contact - commercializing FDA-approved PURE Control as a direct food contact processing aid for fresh produce; commercializing FDA approved PURE Control as a food processing and intervention aid for food processors treating raw poultry in pre and post on-line reprocessing.\n● Continuing to grow and establish new strategic alliances to maximize the commercial potential of our technology platform;\n● Continuing to partner with third parties who are seeking, or intend to seek, approvals to market SDC-based products in markets outside the U.S.;\n● Developing additional proprietary products and applications; and\n● Protecting and enhancing our intellectual property.\nIn addition to our current products addressing food safety, we intend to leverage our technology platform through licensing and distribution collaborations in order to develop new products and enter into new markets that could potentially generate multiple sources of revenue.\nOur Products\nIn addition to PURE Hard Surface and PURE Control, we manufacture and sell (i) SDC-based products for end use, (ii) products preserved with SDC and (iii) SDC as a raw material ingredient for manufacturing use. Our current products are as follows:\nPURE® Hard Surface Disinfectant and Sanitizer (Ready to Use)\nPURE Hard Surface is our SDC-based, patented and EPA-registered, ready-to-use hard surface disinfectant and food contact surface sanitizer. PURE Hard Surface combines high efficacy and low toxicity with bacterial and viral kill times in as few as 30-seconds. The product kills resistant pathogens such as MRSA and NDM-1, and effectively eliminates dangerous fungi and viruses including HIV, Hepatitis B, Hepatitis C, Norovirus, Influenza A, Avian Influenza and H1N1. It also eradicates hazardous food pathogens such as E. coli, Salmonella, Campylobacter and Listeria. PURE Hard Surface delivers broad-spectrum efficacy yet remains classified as least-toxic by the EPA. The active ingredient, SDC, has been designated as GRAS, for use on food processing equipment, machinery and utensils.\nPURE Control®\nWe have the necessary regulatory approvals from the FDA to offer PURE Control as a direct food contact processing aid for fresh produce and raw poultry. We also have regulatory approvals from the USDA for certain methods of application of PURE Control on poultry. Additionally, subject to the results of our focused in-plant validation efforts for our approved produce and poultry solutions, we intend to seek approval to utilize PURE Control as a direct food contact processing aid for raw meats, including beef and pork.\nPoultry Processing Aid. In May 2017, we received the required approvals from the FDA stating that our food contact notification for SDC as a raw poultry processing aid is complete. We received a No Objection Letter from the USDAs Food Safety and Inspection Service, or FSIS granting approval for the higher concentrations of SDC-based PURE Control to be used as a spray or dip applied to poultry carcasses, parts and organs in pre-OLR (on-line reprocessing) and post chill processing of fresh poultry.\nProduce Processing Aid. In January 2016, we received the required approvals from the FDA stating that our FCN for SDC as a spray or dip on processed fruits and vegetables is complete. We were not required to obtain any approvals from the USDA to market PURE Control as a produce processing aid.\nOther Processing Aids under Development. Subject to the results of our focused in-plant validation efforts for our approved produce and poultry solutions, we intend to seek approval to utilize PURE Control as a direct food contact processing aid for raw meats, including beef and pork. In addition, we may identify other food processing opportunities for SDC.\nAdditional SDC-Based Products\nIn addition to PURE Hard Surface and PURE Control, we manufacture and sell (i) SDC-based products for end use, (ii) products preserved with SDC and (iii) SDC as a raw material ingredient for manufacturing use. These products include:\nProduct Name\nProduct Use\nEPA Registration\nPURE Complete Solution:\nPURE® Multi-Purpose and Floor Cleaner Concentrate\nCleaner\nNot applicable\nPURE® Multi-Purpose Hi-Foam Cleaner Concentrate\nCleaner\nNot applicable\nAxen®30\nDisinfectant\nAxen30\nAxenohl®\nRaw material ingredient\nAxenohl\nSILVÉRION®\nRaw material ingredient\nNot applicable\nPURE Complete Solution\nOur PURE Complete Solution is comprised of PURE Hard Surface and concentrated cleaning products that were launched as companion products to PURE Hard Surface. The PURE Complete Solution offers a comprehensive, cost-effective and user-friendly cleaning, disinfecting and sanitizing product line to end-users including our targeted foodservice, food manufacturing and food processing customers. We can also target this product line to hospital and medical care facilities, janitorial service providers and the distributors that supply them.\nPURE® Multi-Purpose and Floor Cleaner Concentrate (End-User Dilutable)\nPURE Multi-Purpose Cleaner is an environmentally responsible cleaning product that is protected by SDC. SDC ensures the quality and safety of PURE Multi-Purpose and Floor Cleaner without human or environmental exposure to toxic chemical preservatives. PURE Multi-Purpose and Floor Cleaner is non-toxic and non-flammable and contains no EDTA, phosphates, ammonia or bleach as well as no VOCs or NPEs. This efficient cleaner provides professional strength cleaning in a concentrate formula that yields a 1:96 - 1:256 use dilution that is safe for use on all resilient surfaces, including floors, glass and food contact surfaces.\nPURE® Multi-Purpose Hi-Foam Cleaner Concentrate (End-User Dilutable)\nPURE Multi-Purpose Hi-Foam Cleaner is an environmentally responsible, professional strength high foam forming cleaning product that is protected by SDC. SDC ensures the quality and safety of PURE Multi-Purpose Hi-Foam Cleaner without human or environmental exposure to toxic chemical preservatives. PURE Multi-Purpose Hi-Foam Cleaner is non-toxic and non-flammable and contains no EDTA, phosphates, ammonia or bleach as well as no VOCs or NPEs. PURE Multi-Purpose Hi-Foam Cleaner provides high foam cleaning in a concentrate formula that yields a 1:50 use dilution that is safe for use on stainless steel equipment, resilient floors, walls and painted surfaces.\nAxen® 30 (Ready-to-Use)\nAxen30 is our patented and EPA-registered hard surface disinfectant and is a predecessor ready-to-use product to PURE Hard Surface. Axen30 is currently sold on a limited basis by distributors under their respective private labels.\nAxenohl® (Raw Material Ingredient)\nAxenohl is our patented and EPA-registered SDC-based antimicrobial formulation for use as a raw material ingredient in the manufacturing of EPA-registered products. Axenohl is a colorless, odorless and stable solution that provides fast acting efficacy against bacteria, viruses and fungi when manufactured into consumer and commercial disinfecting and sanitizing products. Axenohl is currently sold on a limited basis to distributors who manufacture their own respective end-use products.\nSILVÉRION® (Raw Material Ingredient)\nSILVÉRION is our patented SDC-based antimicrobial formulation for use as a raw material ingredient in the manufacturing of personal care products. It can be used as either an active ingredient or a preservative. SILVÉRION is a colorless, odorless and stable solution that provides ionic silver in a water-soluble form. It provides fast acting efficacy at low concentrations against a broad-spectrum of bacteria, viruses, yeast and molds. SILVÉRION is currently sold domestically and outside of the United States in various personal care products.\nEPA Registrations\nWe sell our EPA-regulated products under the following three EPA registrations: (i) SDC3A, our hard surface disinfectant and food contact surface sanitizer, (ii) Axen30, our hard surface disinfectant, and (iii) Axenohl, our antimicrobial formulation for use as a raw material in the manufacturing of EPA-registered products.\nPURE Hard Surface SDC3A Registration\nThe EPA registration for SDC3A, marketed as PURE Hard Surface, our disinfectant and food contact surface sanitizer, includes the following efficacy claims:\nOrganism\nKill Time\nPseudomonas aeruginosa\nseconds\nSalmonella enterica\nseconds\nStaphylococcus aureus\nminutes\nListeria monocytogenes\nminutes\nVancomycin resistant Enterococcus faecium (VRE)\nminutes\nMethicillin resistant Staphylococcus aureus (MRSA)\nminutes\nCommunity Associated Methicillin resistant Staphylococcus aureus (CA-MRSA)\nminutes\nCommunity Associated Methicillin resistant Staphylococcus aureus (CA-MRSA-PVL)\nminutes\nEscherichia coli O157:H7\nminutes\nAcinetobacter baumannii\nminutes\nCampylobacter jejuni\nminutes\nCarbapenem resistant Escherichia coli\nminutes\nCarbapenem resistant Klebsiella pneumoniae\nminutes\nCarbapenem resistant Klebsiella pneumonia, NDM-1 +\nminutes\nTrichophyton mentagrophytes (Athletes Foot Fungus)\nminutes\nHIV type 1\nseconds\nRotavirus\nseconds\nHuman Coronavirus\nseconds\nInfluenza A (H1N1)\nseconds\nSwine Influenza A (H1N1)\nseconds\nRespiratory Syncytial Virus\nseconds\nAdenovirus Type 2\nseconds\nAvian Influenza A\nseconds\nInfluenza A\nseconds\nSARS -CoV-2 (COVID-19 virus)\nseconds\nHepatitis B Virus (HBV)\nseconds\nHepatitis C Virus (HCV)\nseconds\nMurine Norovirus\nseconds\nNorovirus\nseconds\nHerpes Simplex Type 1\nseconds\nRhinovirus\nseconds\nPolio Type 2\nseconds\nToxicity Categories\nThe EPA categorizes the toxicity of antimicrobial products from Category I to Category IV. The following table shows the EPA toxicity categories and required signal words.\nToxicity Category\nSignal Word\nI\nDANGER, POISON\nII\nWARNING\nIII\nCAUTION\nIV\nNone required\nSDC3A is a Category IV product for which no signal words are required.\nAxen30 Registration\nAxen30 is a hard surface disinfectant and is a predecessor product to SDC3A. It offers similar broad-spectrum efficacy but longer kill times. Axen30 is not approved for use on food contact surfaces. Axen30 is currently sold on a limited basis by distributors under their respective private labels.\nAxenohl Registration\nAxenohl is registered as a raw material ingredient for the manufacturing of EPA-registered products and as such does not carry specific efficacy claims. Axenohl is sold to distributors who manufacture their own respective end-use products.\nIntellectual Property\nOur policy is to pursue patents and trademarks, maintain trade secrets and use other means to protect our technology, inventions and improvements that are commercially important to the development of our business.\nWe have applied for U.S. and foreign patent protection for our SDC technology. Currently, we own twelve U.S. issued patents. Approximately thirty patents have been issued outside of the U.S., and we own approximately four patents pending around the world. The expiration dates for our twelve U.S. issued patents begin in 2018 and end in 2030. In September 2013, we decided to abandon pending and issued patents in non-strategic international territories. We intend to focus our future patent prosecution and defense efforts primarily to North America, Europe, Asia and Mexico.\nAdditional patent applications may not be granted, or, if granted, may not provide adequate protection to us. We also intend to rely on whatever protection the law affords to trade secrets, including unpatented know-how. Other companies, however, may independently develop equivalent or superior technologies or processes and may obtain patents or similar rights with respect thereto.\nAlthough we believe that we have developed our technology independently and have not infringed, and do not infringe, on the patents of others, third parties may make claims that our technology does infringe on their patents or other intellectual property. In the event of infringement, we may, under certain circumstances, be required to modify our infringing product or process or obtain a license. We may not be able to do either of those things in a timely manner if at all, and failure to do so could have a material adverse effect on our business. In addition, we may not have the financial or other resources necessary to enforce a patent infringement or proprietary rights violation action or to defend ourselves against such actions brought by others. If any of the products we develop infringe upon the patent or proprietary rights of others, we could, under certain circumstances, be enjoined or become liable for damages, which would have a material adverse effect on our business.\nWe also rely on confidentiality and nondisclosure agreements with our employees, customers, consultants, advisors, licensees and potential partners to protect our technology, intellectual property and other proprietary property. Pursuant to the foregoing and for other reasons, we face the risk that our competitors may acquire information which we consider to be proprietary, that such parties may breach such agreements or that such agreements will be inadequate or unenforceable.\nFurther, we own the registered trademarks or pending trademark applications for PURE Bioscience®, Powered by SDC Ag+®, PURE®, Axenohl®, Axen®, SILVÉRION®, and PURE Control®. In addition, we have applications for other trademarks pending around the world, which may or may not be granted. We previously allowed the marks Kinderguard®, Cruise Control®, Staphacide® , Nutripure®, Elderguard®, and Critterguard® to go abandoned, as they were no longer in line with our food safety business strategy.\nResearch and Development\nWe recognize the importance of innovation to our business strategy and long-term success. A key aspect of our business strategy is to leverage our technology platform to develop additional proprietary products and applications, including end use products and raw material formulations derived from our technology platform. We conduct our primary research and development activities in-house and use third-party laboratories to conduct independent testing. We also engage development partners to perform research and development activities at their own expense for specific products and processes using SDC.\nSales and Marketing\nA critical aspect of our business strategy is to leverage the industry experience of our internal sales force, the members of our Board of Directors, or the Board, and our management team in order to maximize the commercial potential of our technology platform in the food industry.\nAccording to the CDC, FDA and other food industry sources, food contamination and food borne illnesses have been increasing. We believe our focus on food safety is addressing a significant need to provide safe, non-toxic and effective solutions to mitigate the increase of food contamination and food borne illnesses. We believe our products can be used effectively to prevent or mitigate the risk of food contaminants in various stages of the food supply chain. Our current sales and marketing efforts include demonstrating our SDC products effectiveness as a hard surface disinfectant and sanitizer for:\n1. Foodservice operators and food transportation companies - such as food preparation and cooking surfaces; consumer eating and other common areas; drink and ice dispensers; and trucks used to transport food.\n2. Food manufacturers and processors - such as food production and transportation equipment.\nOur sales team is actively developing customer relationships with certain segments of foodservice operators, food processors, food manufacturers and food transportation companies. Due to the recent introduction of our food safety products and the importance of food safety to our customers, the sales cycle to secure a new customer is long and unpredictable. We have recently completed and are currently conducting numerous product evaluation trials and comparative testing of our SDC-based products with prospective customers, which we believe will result in future revenue. We believe our products provide superior pathogen and hygiene control performance characteristics as compared with legacy chemical products, which also have higher toxicity profiles than our SDC-based products.\nIn addition to our direct sales and marketing efforts, we intend to selectively form partnerships with industry leaders for a variety of uses and applications of our products and technology. These partnerships may be for both U.S. and international markets where we believe we may leverage the product development, sales and marketing resources of business partners to commercialize our SDC technology in their respective markets.\nSales Concentration\nNet product sales were $1,871,000 and $1,813,000 for the fiscal year ended July 31, 2023 and 2022, respectively. The increase of $58,000 was attributable to increased sales across our end-user network servicing the food processing industry. Our top three customers accounted for $727,000 of net product sales for the fiscal year ended July 31, 2023. For the year ended July 31, 2023, one customer accounted for 24% of our net product sales. No other individual customer accounted for 10% or more of our net product sales. There were no foreign sales during the fiscal year ended July 31, 2023.\nFrom time to time, one or a small number of our customers may represent a significant percentage of our revenue. Our largest customer accounted for 24% of our revenue for the fiscal year ended July 31, 2023. Although we have agreements with many of our customers, these agreements typically do not prohibit customers from purchasing products and services from competitors. A decision by any of our major customers to significantly reduce the amount of product ordered or license fees paid, or their failure or inability to pay amounts owed to us in a timely manner, or at all, could have a significant adverse effect on our business.\nCompetition\nThe markets for our SDC-based products and each of their potential applications are highly competitive. We have a number of competitors that vary in size, scope and breadth of products offered. These competitors include some of the largest global corporations, and most of our competitors have significantly greater financial resources than we do and offer multiple service and product offerings as well as consulting services to their customers. We expect to face additional competition from other competitors and technologies in the future.\nBecause SDC is a new antimicrobial technology to the food industry, our success will depend, in part, upon our ability to achieve a share of our target markets at the expense of established and future products. Even where SDC may have technological competitive advantages over competing products, we, our partners, or our distributors, will need to invest significant resources in order to attempt to displace traditional technologies sold by, what are in many cases, well-known industry leaders.\nOur SDC-based products (especially at higher silver ion concentration levels) are typically more expensive to produce than existing treatment chemicals, and as a result, customers may not purchase our products for cost reasons, even if we are successful in demonstrating the superior efficacy of our products. Further, customers may determine that the other benefits offered by our products (e.g., non-toxic, non-caustic, and neutral to positive yield impact) are not sufficient to overcome the lower cost products offered by our competitors.\nManufacturing\nEffective June 9, 2019, we entered into a five-year manufacturing supply agreement with Intercon Chemical Company, or ICC, with a three-year renewal term option, or the Manufacturing Supply Agreement, pursuant to which we granted ICC the right to be the non-exclusive manufacturer for all our SDC-based products. The agreement consists of manufacturing, packaging, and distribution of PUREs SDC-based products. The Manufacturing Supply Agreement provides:\n● ICC licenses PUREs patents and technology know-how for the non-exclusive manufacture of PUREs SDC-based products.\n● ICC will invest in plant improvements to allow for expanded SDC production.\n● ICCs R&D team will collaborate on SDC product line development.\nThe Manufacturing Supply Agreement may be terminated by mutual written consent, or by either party upon the material breach of the terms of the agreement by the other party.\nSilver is the primary active ingredient in SDC and is a readily available commodity. The other active and inactive ingredients in our products are readily available from multiple sources.\nGovernment Regulation\nOur business is subject to various government regulations relating to the protection of public health and the environment. Among these are laws that regulate the manufacture, storage, distribution and labeling of our products, as well as the use, handling, storage and disposal of certain materials in the manufacturing of our products.\nRegulation in the United States\nCertain environmental and regulatory matters significant to us are discussed below.\nRequirements Imposed by the EPA and Similar State Agencies\nWe manufacture and sell in the U.S. certain disinfecting products that kill or reduce microorganisms (bacteria, viruses, fungi). The manufacture, labeling, handling and use of these products are regulated by the EPA under the Federal Insecticide, Fungicide, and Rodenticide Act, or FIFRA. We currently sell three products registered by the EPA under FIFRA, certain of which are approved for use on food contact surfaces and others of which are approved for use on non-food contact hard surfaces. EPA product registration requires meeting certain efficacy, toxicity and labeling requirements and paying ongoing registration fees.\nAlthough states do not generally impose substantive requirements different from those of the EPA, each state in which our products are sold requires registration and payment of a fee. California and certain other states have adopted additional regulatory programs applicable to these types of products that, in some cases, impose a fee on total product sales in the state.\nBased on our experience and our knowledge of current trends, we expect the costs and delays in receiving necessary federal and state approvals for these types of products may increase in the coming years.\nRequirements Imposed by Ingredient Legislation\nNumerous federal, state and local laws regulate the sale of products containing certain identified ingredients that may impact human health and the environment. For instance, California has enacted Proposition 65, which requires the disclosure of specified listed ingredient chemicals on the labels of products. Although none of the ingredients in our current products is reportable under Proposition 65, this and other similar legislation may become more comprehensive in the future and/or new products we may develop could be subject to these regulations.\nRequirements Imposed by Other Environmental Laws\nA number of federal, state and local environmental, health and safety laws govern the use, handling, storage and disposal of certain materials. Our current manufacturing process for SDC-based products is a zero waste process, meaning that no byproducts are created, and we do not use hazardous materials, as defined by applicable environmental laws, in the manufacturing of these products. As such, some of these U.S. environmental laws are not generally applicable to us in their current form. However, these laws may in the future identify as hazardous materials certain materials that we use in our manufacturing processes, or we may opt to or be forced to change our manufacturing procedures in a way that subjects our products or operations to these laws.\nRequirements Imposed by the FDA and USDA\nVarious laws and regulations have been enacted by federal, state, local and foreign jurisdictions regulating certain products we anticipate manufacturing and selling for controlling microbial growth in or on foods. In the United States, these requirements generally are administered by the FDA. However, the USDA and EPA also may share in regulatory jurisdiction of antimicrobials applied directly to food as it pertains to poultry and meats.\nRegulation Outside the United States\nThe commercialization of SDC-based products in countries other than the U.S. may require that we, or companies with whom we partner for such foreign commercialization, obtain necessary approvals from foreign regulatory authorities comparable to the EPA and USDA, among others. Applicable approval processes and ongoing requirements vary from country to country and may involve more time and expense than that required to obtain approvals in the U.S. In international markets, we currently sell our products under active registrations held by us, or by our distributors. We intend to continue to process registrations ourselves or through distributors as required.\nWe currently hold a registration from Health Canada for our disinfectant product. Other third-party distributors hold registrations in China and are actively pursuing registrations for our disinfectant products in various Asian markets. Additionally, an opinion has been granted under the Scientific Committee on Consumer Products to sell SDC in the European Union for use in cosmetics, which includes personal care products.\nHuman Capital\nAs of October 30, 2023, we employed 11 full-time employees and 1 part-time employee. We believe that we have been successful in attracting skilled and experienced personnel, but competition for personnel is intense and there can be no assurance that we will be able to attract and retain qualified personnel in the future. None of our employees are covered by collective bargaining agreements and we consider relations with our employees to be good. We strive to maintain and promote a culture that fosters the values, behaviors and attributes necessary to advance our business and execute our strategy.\nCompany Information\nWe were incorporated in the state of California in August 1992 as Innovative Medical Services. In September 2003, we changed our name to PURE Bioscience. In March 2011, we reincorporated in the state of Delaware under the name PURE Bioscience, Inc.\nOur corporate offices are located at 771 Jamacha Rd., El Cajon, California 92019. Our telephone number is (619) 596-8600. Our website address is www.purebio.com. We make available free of charge on our website our periodic and current reports, proxy statements and other information as soon as reasonably practicable after such reports are filed with the SEC. Information contained on, or accessible through, our website is not part of this report or our other filings with the SEC. Our SEC filings are also available to the public from the SECs website at www.sec.gov. Item 1A. Risk Factors\nYou should carefully consider the following information about risks and uncertainties that may affect us or our business, together with the other information appearing elsewhere in this Annual Report, including our consolidated financial statements and the related notes thereto. If any of the following events, described as risks, actually occur, either alone or taken together, our business, financial condition, results of operations and future growth prospects would likely be materially and adversely affected. In these circumstances, the market price of our common stock could decline, and you may lose all or part of your investment in our securities. An investment in our securities is speculative and involves a high degree of risk. You should not invest in our securities if you cannot bear the economic risk of your investment for an indefinite period of time and cannot afford to lose your entire investment. There may be additional risks that we do not presently know of or that we currently believe are immaterial which could also impair our business and financial position.\nRisks Related to Our Business and Industry\nAs a result of our historical lack of financial liquidity, we do not currently have sufficient working capital to fund our planned operations and may not be able to continue as a going concern.\nWe have a history of recurring losses, and as of July 31, 2023 we have incurred a cumulative net loss of $133.0 million. During the fiscal year ended July 31, 2023, we recorded a net loss of $4.0 million on recorded net revenue of $1.9 million. In addition, during the year ended July 31, 2023 we used $3.3 million in operating and investing activities resulting in a cash balance of $1.1 million as of July 31, 2023. As a result, our existing cash resources are not sufficient to meet our anticipated needs over the next twelve months from the date hereof, and we will need to raise additional capital to continue our operations and to implement our business plan, which capital may not be available on acceptable terms or at all.\nOur capital requirements will depend on many factors, including, among others:\n● the market acceptance of, and demand for, our products;\n● the timing and costs of executing our sales and marketing strategies;\n● our ability to successfully complete the in-plant validation trials requested by potential customers and our ability to convert these trials into customer orders for our products;\n● the costs and time required to obtain the necessary regulatory approvals for our products, including the required USDA approvals:\n● the extent to which we invest in new testing and product development, including in-plant optimization trials;\n● the extent to which our customers continue to place product orders as expected and expand their existing use of our products;\n● the cost and time to satisfy unique customer requirements regarding validation trials or to support the value proposition and benefits of our products;\n● the timing of vendor payments and the collection of receivables, among other factors affecting our working capital;\n● our ability to control the timing and amount of our operating expenses, including the costs to attract and retain personnel with the skills required to implement our business plan; and\n● the costs to file, prosecute and defend our intellectual property rights.\nThe above factors, along with our history and near term forecast of incurring net losses and negative operating cash flows, raise substantial doubt about our ability to continue as a going concern. If we do not obtain additional capital from external sources, we will not have sufficient working capital to fund our planned operations or be able to continue as a going concern. We cannot assure you that additional financing will be available when needed or that, if available, we can obtain financing on terms favorable to us or to our stockholders. If we continue to raise additional funds from the issuance of equity securities, substantial dilution to our existing stockholders would likely continue to result. If we raise additional funds by incurring debt financing, the terms of the debt may involve significant cash payment obligations as well as covenants and specific financial ratios that may restrict our ability to operate our business. Further, any contracts or license arrangements we enter into to raise funds may require us to relinquish our rights to our products or technology, and we cannot assure you that we will be able to enter into any such contracts or license arrangements on acceptable terms, or at all. Having insufficient funds may require us to delay or scale back our marketing, distribution and other commercialization activities or cease our operations altogether.\nWe have a history of losses, and we may not achieve or maintain profitability.\nWe had a loss of $4.0 million for the fiscal year ended July 31, 2023, and a loss of $3.5 million for the fiscal year ended July 31, 2022. As of July 31, 2023, we have incurred a cumulative net loss of approximately $133.0 million. Although we believe we are making progress on implementing our business plan focused on the food safety market, we expect to continue to have losses in future periods. None of our existing agreements, including those with Packers Sanitation Services, Inc, Subway and Chipotle, contain provisions that provide for fixed or minimum revenues. If the penetration into the marketplace of PURE Hard Surface, PURE Control and our other SDC-based products is unsuccessful, our revenue growth is slower than anticipated or our operating expenses exceed expectations, we may not achieve profitability, and we may never achieve profitability again. Slower than anticipated revenue growth could force us to reduce our sales and marketing efforts, our product testing and optimization, and our product development and regulatory initiatives, and/or force us to reduce the size and scope of our operations, to sell or license our technologies to third parties, or to cease operations altogether. Given our recent introduction of our SDC-based products in the food safety market, we are unable to predict the extent of any future income or our future losses and we may not be able to sustain or increase profitability on an ongoing basis.\nRaising additional funds by issuing securities or through collaboration and licensing arrangements may cause dilution to existing stockholders, restrict our operations or require us to relinquish proprietary rights.\nWe may need to increase our liquidity and capital resources in future periods. We have a history of raising funds through offerings of our common stock and warrants to purchase shares of our common stock, and we may in the future raise additional funds through public or private equity offerings, debt financings or corporate collaborations and licensing arrangements. For example, during July and October of 2023, we completed a private placement convertible debt financing to accredited investors, in which we raised net proceeds of $1.8. To the extent that we continue to raise additional capital by issuing debt or equity securities, our stockholders ownership will be diluted. Additionally, any debt financing we obtain may involve covenants that restrict our operations. These restrictive covenants may include, among other things, limitations on borrowing, specific restrictions on the use of our assets, as well as prohibitions on our ability to create liens on our assets, pay dividends on or redeem our capital stock or make investments. In addition, if we raise funds through collaboration and licensing arrangements, it may be necessary to grant licenses on terms that are not favorable to us or relinquish potentially valuable rights to our products or proprietary technologies. We may be required in future collaborations to relinquish all or a portion of our sales and marketing rights with respect to our products or license intellectual property that enable licensees to develop competing products in order to complete any such transaction.\nAs of October 30, 2023, we had 119,269,598 shares of common stock issued and outstanding or reserved for issuance under equity compensation plans, vested and unvested options, and unvested restricted stock units. Our current authorized capital stock is limited to 150,000,000 shares of common stock and 5,000,000 shares of preferred stock. Any increase in our authorized capital stock would require the approval of a majority of our shareholders as well as the approval of our Board. If we were unable to increase our authorized capital stock for any reason, our ability to raise additional capital through the issuance of equity or convertible debt would be severely compromised and we may be unable to obtain equity or convertible debt capital at all.\nWe need to continue to increase customer awareness and adoption of our food safety product offerings, PURE Hard Surface and PURE Control.\nOur success will depend on our ability to continue to increase customer awareness and adoption of our food safety product offerings, PURE Hard Surface and PURE Control. We have encountered and likely will continue to encounter risks and difficulties associated with introducing or establishing new commercial products in this highly competitive and rapidly evolving market. These risks include the following, among others:\n● we may not be successful in demonstrating the effectiveness of PURE Control in actual in-plant use situations or satisfy the requirements of our potential customers;\n● we may not be successful in converting in-plant trials into customer product orders;\n● our SDC-based product offerings (especially at higher silver-ion concentrations) are typically more expensive to produce than existing treatment chemicals, and as a result, customers may not purchase our products for cost reasons, even if we are successful in demonstrating the superior efficacy or other benefits of our products;\n● our customers may not continue to place product orders as expected or may not expand their use of our products;\n● we may not be successful in demonstrating the value proposition of our products, including their non-corrosive and non-toxic characteristics and their neutral to positive processing yield impact;\n● we may not succeed in materially penetrating the food safety markets with our SDC products and technology;\n● we may not be successful in developing an effective sales and marketing infrastructure to commercialize our products;\n● we may not generate sufficient revenues or raise sufficient funds to support our operations or the implementation of our business plan;\n● we may not be successful in controlling our operating expenses;\n● we may not be successful in obtaining any required regulatory approvals on a timely basis, or at all;\n● we may not attract and retain key sales and marketing, technical and management personnel;\n● we may not successfully comply with or maintain the regulatory approvals we obtain for our technology and products;\n● we may not succeed in locating strategic partners and licensees of our technology;\n● we may not effectively manage our anticipated growth, if any; and\n● we may not be able to adequately protect our intellectual property.\nAny failure to successfully address these risks and uncertainties could seriously harm our business and prospects.\nWe may not be able to correctly estimate our future revenues and operating expenses, which could lead to cash shortfalls, and require us to secure additional financing sooner than planned.\nWe may not correctly predict the amount or timing of future revenues and our operating expenses may fluctuate significantly in the future as a result of a variety of factors, many of which are outside of our control. These factors include:\n● our expectations regarding revenues from sales of our products;\n● the time and resources required to complete in-plant validation and optimization trials;\n● the cost and time to develop and obtain regulatory approvals for additional products as part of our long-term business plan;\n● the cost and time required to create effective sales and marketing capabilities and commercialization strategies;\n● the expenses we incur to maintain and improve our platform technology;\n● the cost and time to satisfy unique customer requirements regarding validation and optimization trials;\n● the costs to attract and retain personnel with the skills required for effective operations; and\n● the costs of preparing, filing, prosecuting, defending and enforcing patent claims and other patent related costs, including litigation costs and the results of such litigation.\nIn addition, our budgeted expense levels are based in part on our expectations concerning current and future revenues from sales of our products and services, and from collaborations with third parties. However, we may not correctly predict the amount or timing of future revenues. In addition, we may not be able to adjust our operations in a timely manner to compensate for any unexpected shortfall in our revenues or we may increase our expenses as part of implementing our long-term business plan. As a result, a significant shortfall in our planned revenues or a significant increase in our planned expenses could have an immediate and material adverse effect on our business and financial condition. In such case, we may be required to issue additional equity or debt securities or enter into other commercial arrangements, including relationships with corporate and other partners, sooner than anticipated to secure the additional financial resources to support our development efforts and future operations.\nOur quarterly operating results may vary, which could negatively affect the market price of our common stock.\nBecause of our limited operating history and the early commercial stage of our SDC-based products in the food safety market, we have limited insight into trends that may emerge and affect our business. Forecasting future revenues is difficult, especially because we have only recent begun to generate meaningful revenues from the sale of our SDC-based products, our products are novel, and market acceptance of our products is reliant on our customers confidence, based on scientific data and actual in-plant trials, that our product can improve their food safety efforts. We often experience long sales cycles and our customers often require extensive evaluation and in-plant trial periods before agreeing to use our products throughout their systems. In addition, fluctuations in the buying patterns of our current or potential customers could significantly affect the level of our sales on a period to period basis. Additional factors that could cause our financial results to fluctuate unexpectedly, including: the mix of product sales, the cost of product sales, our ability to meet customer demand, delays in achieving our regulatory milestones, changes in our operating expenses, including non-cash expenses such as the fair value of stock options granted to our employees, and manufacturing or supply issues. As a result, our quarterly operating results may vary, which could negatively affect the market price of our common stock.\nA loss of one or more of our key customers could adversely affect our business.\nFrom time to time, one or a small number of our customers may represent a significant percentage of our revenue. For the year ended July 31, 2023, one individual customer accounted for 24% of our net product sales. Although we have agreements with many of our customers, these agreements typically do not prohibit customers from purchasing products and services from competitors or contain minimum purchase obligations. A decision by any of our major customers to significantly reduce the amount of product ordered or license fees paid, or their failure or inability to pay amounts owed to us in a timely manner, or at all, could have a significant adverse effect on our business.\nWe are dependent on our core SDC technology and if our efforts to achieve or maintain market acceptance of our core SDC technology are not successful, we are unlikely to continue to maintain profitability.\nWe have and are currently focusing substantially all of our time and financial resources in the development and commercialization of our core SDC technology to address food safety risks across the food industry supply chain. Although our SDC technology has applications in multiple industries, we expect that sales of SDC and SDC-based products as a food safety solution will constitute a substantial portion, or all, of our revenues in future periods. We are marketing our SDC-based products to restaurant chains, food manufacturers, food processors and food transportation companies. Our SDC-based products have not yet been broadly accepted into the food safety market, and may never be broadly accepted. Any material decrease or significant delay in the overall level of sales or expected sales of, or the prices for, our SDC-based products, whether as a result of competition, delays in obtaining regulatory approvals, long sales cycles, change in customer demands or requirements, or any other factor, would have a materially adverse effect on our business, financial condition and results of operations. In addition, even if our products achieve market acceptance, we may not be able to maintain product sales or other forms of revenue over time if new products or technologies are introduced by competitors that are more favorably received than our products, are more cost-effective or otherwise render our products less attractive or obsolete.\nWe are subject to intense competition in the food safety market.\nOur SDC-based products compete in the highly competitive food safety market. Our SDC-based product offerings (especially at higher silver ion concentration levels) are typically more expensive to produce than existing treatment chemicals, and as a result, customers may not purchase our products for cost reasons, even if we are successful in demonstrating the superior efficacy of our products. In addition, customers may determine that the other benefits offered by our products (e.g., non-toxic, non-caustic, and neutral to positive yield impact) are not sufficient to overcome the lower cost products offered by our competitors. Further, most of our competitors have been in business for a longer period of time than we have, and offer a greater number of products and services than we do and have greater financial, technical, sales and other resources than we do. Many of our competitors already have well established brands and distribution capabilities, and in some cases are able to leverage the sale of other products with more favorable terms for products competing with our own. We also have significantly fewer sales personnel than virtually all of our competitors. Furthermore, recent trends in this industry are for large food safety companies to consolidate into a smaller number of very large entities, which further concentrates financial, technical and market strength and increases competitive pressure in the industry. If we directly compete with these very large entities for the same markets and/or products, their financial strength could prevent or delay us from capturing a meaningful share of the food safety market. It is also possible that developments by our competitors will make our technologies or products noncompetitive or obsolete. Our ability to compete will depend upon our ability, and the ability of our distributors and other partners, to develop brand recognition, develop the scientific and plant trial data to demonstrate the efficacy of our products, and to displace existing, established and future products in our relevant target markets. We, or our distributors and partners, may not be successful in doing so, which would have a materially adverse effect on our business, financial condition and results of operations.\nWe have limited sales, marketing and product distribution experience.\nWe have limited experience in the sales, marketing and distribution of our products in the food safety market. We began to focus on the food safety market in August 2013. After acquiring necessary regulatory approvals we began to commercialize our products in 2016. As a result, our sales and marketing experience with these products are limited, and our current sales, distribution and marketing strategies and programs may not be successful. Further, the sales cycle to secure a new customer is long and unpredictable. Potential customers typically require that we complete extensive in-plant validation studies with our products. We may not be successful in demonstrating the effectiveness of PURE Control in actual in-plant use situations or satisfy the requirements of our potential customers. Moreover, we may not be successful in converting in-plant trials into customer product orders. We also have a relatively small sales and marketing organization and a limited number of distributors. Therefore, we may not be able to establish the sales, marketing, and distribution capabilities necessary to generate sales and build our business to generate sufficient revenues to support our operations and the implementation of our business plan.\nWe are dependent on a third-party, over whom we have limited control, to manufacture our SDC-based products.\nOn June 9, 2019, we entered into a five-year strategic collaboration agreement with St. Louis-based Intercon Chemical Company, or ICC, where we granted ICC the right to be the non-exclusive manufacturer for all our SDC-based products. We do not have any manufacturing facilities and we currently rely on ICC to manufacture our SDC-based products and may in the future rely on one or more third-party manufacturers to properly manufacture our products. We may not be able to quickly replace our manufacturing capacity if ICC is unable to manufacturer our products as a result of a fire, natural disaster (including an earthquake), equipment failure or other difficulty, or if such ICC facilities are deemed not in compliance with current good manufacturing practices, and the noncompliance could not be rapidly rectified. ICC is our single manufacture for our concentrated SDC-based products and may not be replaced without significant effort and delay in production. A supply interruption or an increase in demand beyond our current manufacturers capabilities could harm our ability to manufacturer such products until new manufacturers are identified and qualified, which would have a significant adverse effect on our business and results. Any third-party manufacturer that we find may not match our quality standards or be able to meet customer requirements.\nAdditionally, our inability or reduced capacity to have our products manufactured would prevent us from successfully evaluating or commercializing our proposed products. Our dependence upon third parties for the manufacture of our products may adversely affect our profit margins and our ability to develop and deliver proposed products on a timely and competitive basis.\nWe rely on third parties to develop SDC-based products, and they may not do so successfully or diligently.\nWe have granted ICC and other third parties to whom we license rights to our technology certain distribution and development rights to products containing SDC for applications and markets outside the U.S. food safety market. Our reliance on ICC and other third parties for development and distribution activities reduces our control over these activities. In such arrangements, we have relied, and expect in the future to rely, on the third party to fund and direct product development activities and appropriate regulatory filings. Any of these third parties may not be able to successfully develop such SDC-based products due to, among other factors, a lack of capital, a lack of appropriate diligence, insufficient devotion to sales efforts, a change in the evaluation by the third party of the market potential for SDC-based products, technical failures, and poorer than expected results from testing or trial use of any products that may be developed. If the third parties on which we rely are not successful in such development activities, our business and operating results would be adversely affected.\nPricing and supply issues may have a material impact on our margins and our ability to supply our customers.\nAll of the supply ingredients used to manufacture our SDC-based products are available from multiple suppliers. However, commodity prices for some ingredients can vary significantly and the margins that we are able to generate could decline if prices rise. For example, both silver and citric acid prices have been volatile in recent periods.\nIn addition to such commodities, we also rely on producers of specialized packaging inputs such as bottles and labels for finished products. Due to their specialized nature, the supply of such inputs can be periodically constrained and result in additional costs to obtain these items, which may in turn inhibit our ability to supply products to our customers.\nWe are generally unable to increase our product prices to our customers, partners and distributors quickly in order to maintain our margins, and significant price increases for key inputs could therefore have an adverse effect on our results of operations. Price increases can also result in lost sales, and any inability to supply our customers orders can lead to lost future sales to such customers.\nWe expect ICC to be the sole source supplier of our SDC concentrate and we may use other third parties to blend, package and provide fulfillment activities for our finished products in future periods. We expect that our margins may be reduced by using ICC and other such third parties, and our ability to maintain product quality may not be as extensive or effective as when we produce these products in our own facility(ies). Any quality control issues could lead to product recalls and/or the loss of future sales, which would reduce our revenues and/or profits.\nIf we are not able to manage any growth we achieve effectively, our business and operating results will be harmed.\nIn order to implement our business plan and achieve and maintain market acceptance of our SDC-based products, we expect to expand our business operations and hire additional sales and support personnel. We may not have sufficient resources to do so. If we hire additional personnel and invest in additional infrastructure, we may not be effective in expanding our operations and our systems, procedures or controls may not be adequate to support any such expansion. Failure to properly manage our growth could have a material adverse effect on our business and our operating results.\nIf we suffer negative publicity concerning the safety or efficacy of our products, our sales may be harmed.\nIf concerns should arise about the safety or efficacy of any of our products that are marketed, regardless of whether or not such concerns have a basis in generally accepted science or peer-reviewed scientific research, such concerns could adversely affect the market for those products. Similarly, negative publicity could result in an increased number of product liability claims, whether or not those claims are supported by applicable law.\nWe may become subject to product liability claims.\nAs a business that manufactures and markets products for use by consumers and institutions, we may become liable for any damage caused by our products, whether used in the manner intended or not, including potentially damage to our customers businesses. Regardless of merit or potential outcome, product liability claims against us may result in, among other effects, the inability to commercialize our products, impairment of our business reputation, and distraction of managements attention from our primary business. If we cannot successfully defend ourselves against product liability claims we could incur substantial liabilities. Although we maintain general and product liability insurance, our insurance may not cover potential claims and may not be adequate to indemnify for liabilities that may be imposed. Any imposition of liability that is not covered by insurance or is in excess of insurance coverage could harm our business and operating results.\nWe depend on key personnel for our continued operations and future success, and a loss of certain key personnel could significantly hinder our ability to move forward with our business plan.\nOur success depends largely on the execution of our business strategy by our management team and the members of our Board. Our Board and management will be evaluating how to best execute our near-term strategy to drive customer adoption in the food industry by addressing food safety solutions across the supply chain in order to prevent or mitigate food contamination or the potential for food-borne illness with specific customer focus in foodservice providers, food processors and food manufacturers. Our directors, executive officers and key personnel could terminate their services with us at any time without notice and without penalty. Additionally, we do not maintain key person life insurance policies on our directors, executive officers or other employees. The loss of one or more of our directors, executive officers or key employees could seriously harm our ability to execute on our business strategy, which could harm our business, results of operations, financial condition, and/or the market price of our common stock. We cannot assure you that in such an event we would be able to recruit qualified personnel able to replace these individuals in a timely manner, or at all, on terms acceptable to either us or to any qualified candidate. Even if we were able to replace any such individuals in a timely manner, if we are unable to effectively integrate new executive officers or key employees, our operations and prospects could be harmed.\nBecause competition for highly qualified sales and marketing and management personnel is intense, we may not be able to attract and retain the employees we need to support our potential growth.\nTo successfully meet our objectives, we must attract and retain highly qualified sales and marketing and management personnel with specialized skill sets focused on the industries in which we compete, or intend to compete. Competition for qualified business development and bioengineering personnel can be intense. Our ability to meet our business development objectives will depend in part on our ability to recruit, train and retain top quality people with advanced skills who understand our technology and business. In addition, it takes time for our new personnel to become productive and to learn our business. If we are unable to hire or retain qualified personnel, it will be difficult for us to sell our products or to license our technology or to achieve or maintain regulatory approvals, and we may experience a shortfall in revenue and not achieve our anticipated, or any, growth.\nWe may engage in strategic transactions that could impact our liquidity, increase our expenses and present significant distractions to our management.\nFrom time to time we may consider engaging in strategic transactions, such as acquisitions of companies, asset purchases and out-licensing or in-licensing of products, product candidates or technologies. Any such transaction may require us to incur non-recurring or other charges, may increase our near-and long-term expenditures and may pose significant integration challenges or disrupt our management or business, which could adversely affect our operations and financial results. For example, these transactions may entail numerous operational and financial risks, including, among others, exposure to unknown liabilities, disruption of our business and diversion of our managements time and attention in order to develop acquired products, product candidates or technologies, difficulty and cost in combining the operations and personnel of any acquired businesses with our operations and personnel, and inability to retain key employees of any acquired businesses. Accordingly, although we may not choose to undertake or may not be able to successfully complete any transactions of the nature described above, any transactions that we do undertake or complete could have a material adverse effect on our business, results of operations, financial condition and prospects.\nWe may invest or spend our cash in ways with which you may not agree or in ways which may not yield a significant return.\nOur management has considerable discretion in the use of our cash. Our cash may be used for purposes that do not increase our operating results or market value. Until the cash is used, it may be placed in investments that do not produce significant income or that may lose value. The failure of our management to invest or spend our cash effectively could result in unfavorable returns and uncertainty about our prospects, each of which could cause the price of our common stock to decline.\nWe may not be able to utilize all, or any, of our tax net operating loss carry-forwards and our future after-tax earnings, if any, could be reduced.\nAt July 31, 2023, we had federal and state tax net operating loss carry-forwards of approximately $110.5 million and $64.5 million, respectively. Utilization of these net operating loss carry-forwards may be subject to a substantial annual limitation due to ownership change limitations that may have occurred, including with respect to our recent private placements, or that could occur in the future, as required by Section 382 of the Internal Revenue Code as well as similar state provisions. These ownership changes may limit the amount of net operating loss carry-forwards that can be utilized annually to offset future taxable income and tax, respectively. In general, an ownership change, as defined by Section 382 of the Internal Revenue Code, results from a transaction or series of transactions over a three-year period resulting in an ownership change of more than 50 percentage points of the outstanding stock of a company by certain stockholders or public groups. Since our formation, we have raised capital through the issuance of capital stock on several occasions (both before and after our initial public offering in 1996) which, combined with the purchasing stockholders subsequent disposition of those shares, may have resulted in such an ownership change, or could result in an ownership change in the future based upon subsequent disposition. While we believe that we have not experienced an ownership change, the pertinent tax rules related thereto are complex and subject to varying interpretations, and thus the applicable taxing authorities may take an alternative position.\nOur current federal tax loss carry-forwards began expiring in the year ended July 31, 2020 and, unless previously utilized, all but $9.1 million will completely expire in the year ending July 31, 2038. The $9.1 million can be carried forward indefinitely. Our state tax loss carry-forwards began to expire in the year ending July 31, 2029, and will completely expire in the year ending July 31, 2040.\nRisks Related to the Regulation of our Products\nIf we are unable to obtain the required regulatory approvals from the FDA and USDA, or if such efforts are delayed, our ability to commercialize PURE Control as a direct food contact processing aid will be harmed and our business and operating results will suffer.\nWe have received the required FDA approvals to market PURE Control as a direct food contact processing aid for raw poultry and fresh produce and we have received a No Objection Letter from the USDAs Food Safety and Inspection Service, or FSIS, granting approval for SDC-based PURE Control to be used as a spray or dip applied to poultry carcasses, parts and organs in pre-OLR (on-line reprocessing) and post chill processing of fresh poultry. We have not, however, received the required approval from the USDA to utilize PURE Control in OLR poultry processing. Further, even if we elect to seek regulatory approval, there is no assurance we will be successful in obtaining the required approvals from the FDA and USDA to utilize PURE Control as a direct food contact processing aid for raw meats, including beef and pork. If we are unable to obtain the required regulatory approvals from the FDA and USDA, or if such efforts are delayed, our ability to commercialize PURE Control as a direct food contact processing aid for poultry and as a direct food contact processing aid for raw meets will be restricted and our business and operating results will suffer.\nThe industries in which we operate are heavily regulated.\nWe are focused on the marketing and continued development of our SDC antimicrobial technology for use in the food safety market. Our existing products, PURE Control and PURE Hard Surface, and any additional products we develop based on our SDC technology in future periods, require or will require approval by government agencies prior to marketing or sale in the U.S. or in foreign markets. Complying with applicable government regulations and obtaining necessary regulatory approvals can be, and has historically been, time consuming and expensive, due in part, we believe, to the novel nature of our technology. Regulatory review could involve delays or other actions adversely affecting the development, manufacture, marketing and sale of our products. While we cannot accurately predict the outcome of any pending or future regulatory review processes or the extent or impact of any future changes to legislation or regulations affecting review processes, we expect such processes to remain time consuming and expensive as we, or our partners, apply for approval to make new or additional efficacy claims for current products or to market new product formulations. Obtaining approvals for new SDC-based products in the U.S., or in markets outside the U.S., could take several years, or may never be accomplished.\nSDC is a platform technology rather than a single use applied technology. As such, products developed from the platform may fall under the jurisdiction of multiple U.S. and international regulatory agencies. Our disinfectant and sanitizer products are regulated in the U.S. by the EPA. In addition to the EPA, each of the 50 states in the U.S. has its own government agencies that regulate the sale or shipment of our products into their state. We have obtained registration for these products from the EPA and all states into which such products are currently marketed and sold. We are required to meet certain efficacy, toxicity and labeling requirements and pay ongoing fees in order to maintain such registrations. We may not be able to maintain these registrations in the future, which may eliminate our continued ability to market and sell our products in some or all parts of the U.S. We also may not be able to obtain necessary registrations with the EPA and applicable states for other SDC disinfectant and sanitizer products that we or our partners may develop, which would limit our ability to sell any such products in the future.\nSome potential applications of SDC, such as those aimed at healthcare, veterinary and certain food preparation markets, may require approval of other government agencies prior to marketing or sale in the U.S. or in foreign markets, such as the U.S. Food and Drug Administration, or FDA, or the United States Department of Agriculture, or USDA. Obtaining FDA and/or USDA approval is a complicated and expensive process and such approvals may never be obtained for any SDC products. If FDA and/or USDA approvals are obtained, the approvals may limit the uses for which SDC products may be marketed such that they may not be profitable to us, and the applicable products would be subject to pervasive and continuing regulation by the FDA and/or USDA that could lead to withdrawal or limitation of any product approvals.\nWe have managed and funded certain of our EPA-regulated product development internally, in conjunction with engaging regulatory consultants and partnering with other third parties. We have partnered, or intend to partner, with third parties who are seeking, or intend to seek, approvals to market SDC-based products in markets outside the U.S., and with other third parties who are developing FDA-regulated SDC-based products who, upon such development, would seek FDA approvals of such products. Our ability to market and sell our products is dependent on our and our partners ability to obtain and maintain required registrations and approvals of applicable regulatory agencies. Failure by our partners or us to comply with applicable regulations could result in fines or the withdrawal of approval for us or our partners and distributors to market our products in some or all jurisdictions or for certain indications, which could cause us to be unable to successfully commercialize SDC or otherwise achieve revenues from sales of such products.\nWe are subject to substantial regulation related to quality standards applicable to our manufacturing and quality processes, and our or our partners, including our third-party manufacturers, failure to comply with applicable quality standards could affect our ability to commercialize SDC products.\nThe EPA and other applicable U.S. and foreign government agencies regulate our and our partners systems and processes, including those of ICC, for manufacturing SDC-based products. These regulations require that we and our partners observe good manufacturing practices in order to ensure product quality, safety and effectiveness. Failure by us or our partners to comply with current or future government regulations and quality assurance guidelines could lead to temporary manufacturing shutdowns, product recalls or related field actions, product shortages, and/or delays in product manufacturing, any or all of which could cause significant cost to us. Further, efficacy or safety concerns and/or manufacturing quality issues with respect to our products or those of our partners could lead to product recalls, fines, withdrawal of approvals, and/or declining sales, any or all of which could result in our failure to successfully commercialize SDC or otherwise achieve revenue growth.\nLitigation or the actions of regulatory authorities may harm our business or otherwise distract our management.\nSubstantial, complex or extended litigation could cause us to incur major expenditures and would distract our management. For example, lawsuits against us or our officers or directors by employees, former employees, stockholders, partners, customers, or others, or actions taken by regulatory authorities, could be very costly and substantially disrupt our business. Such lawsuits and actions are not uncommon, and we may not be able to resolve such disputes or actions on terms favorable to us, and there may not be sufficient capital resources available to defend such actions effectively, or at all.\nRisks Related to Our Intellectual Property\nIf we are unable to obtain, maintain or defend the patent and other intellectual property rights relating to our technology, we or our collaborators and distributors may not be able to develop and market proprietary products based on our technology, which would have a material adverse impact on our results of operations.\nWe rely and expect in the future to continue to rely on a combination of patent, trademark, trade secret and copyright protections, as well as contractual restrictions, to protect the proprietary aspects of our technology and business.\nLegal protections of our intellectual property and proprietary rights afford only limited protection. For instance, we currently own twelve U.S. patents related to our SDC technology. The lives of these patents, and any patents that we may obtain in the future, are not indefinite, and the value to us of some or all of our patents may be limited by their terms. Further, although we have a number of U.S. and international patent applications pending, some or all of those applications may not result in issued patents, and the intellectual property claims therein would be unprotected. Additionally, obtaining and maintaining patent protection depends on our compliance with various procedural, document submission, fee payment and other requirements imposed by government patent agencies, and our patent protection could be reduced or eliminated for non-compliance with these requirements. Furthermore, the patent positions of bioscience companies can be highly uncertain and often involve complex legal, scientific and factual questions, and, therefore, we cannot predict with certainty whether we will be able to ultimately enforce our patents or other intellectual property rights. Third parties may challenge, invalidate or circumvent our patents and patent applications relating to our products, product candidates and technologies. In addition, our patent positions might not protect us against competitors with similar products or technologies because competing products or technologies may not infringe our patents.\nIn addition, to the extent that we operate internationally, the laws of foreign countries may not protect our proprietary rights to the same extent as the laws of the U.S. Many countries have a first-to-file trademark registration system, which may prevent us from registering or using our trademarks in certain countries if third parties have previously filed applications to register or have registered the same or similar trademarks. Additionally, changes in the patent and/or trademark laws or interpretations of such laws in the U.S. or other countries could diminish the value of our intellectual property rights. Moreover, our competitors may develop competing technologies that are not covered by the claims of, and therefore do not infringe upon, our issued patents, which could render our patents less valuable to us. If our proprietary rights cannot be, or are not sufficiently, protected by patent and trademark registrations, it could have a material adverse impact on our business and our ability to commercialize or license our technology and products.\nOur own efforts to protect our intellectual property and other proprietary rights may also be insufficient. Despite efforts to protect our proprietary rights, including without limitation through confidentiality and other similar contractual restrictions, our means of protecting such rights may not be adequate and unauthorized parties may attempt to copy aspects of our proprietary technology, obtain and use information that we regard as proprietary, or otherwise misappropriate our intellectual property. In addition, unpatented proprietary rights, including trade secrets and know-how, can be difficult to protect and may lose their value if they are independently developed by a third party or if their secrecy is lost. It is possible that, despite our efforts, competitors or others will create and use products, adopt service names similar to our service names or otherwise violate or misappropriate our proprietary rights. The infringement of such rights could have a material negative impact on our business and on our results of operations.\nLitigation may be necessary to enforce our intellectual property and other proprietary rights, which would be expensive and could consume time and other resources. The result of any such litigation may be the courts ruling that our patents or other intellectual property rights are invalid and/or should not be enforced. Additionally, even if the validity of such rights is upheld, the court could refuse to stop a third partys infringing activity on the ground that such activities do not infringe our rights. The U.S. Supreme Court has recently revised certain tests regarding granting patents and assessing the validity of patents to make it more difficult to obtain patents. As a consequence, issued patents may be found to contain invalid claims according to the newly revised standards. Some of our patents may be subject to challenge and subsequent invalidation or significant narrowing of claim scope in a reexamination proceeding, or during litigation, under the revised criteria.\nWe may incur substantial costs as a result of litigation or other proceedings relating to patent and other intellectual property rights and we may be unable to protect our rights to, or use, our technology.\nIf we choose to go to court to attempt to stop someone else from using the inventions claimed in our patents, that individual or company has the right to ask the court to rule that our patents are invalid and/or should not be enforced against that third party. These lawsuits are expensive and would consume time and other resources even if we were successful in stopping the infringement of these patents. In addition, there is a risk that the court will decide that these patents are not valid and that we do not have the right to stop the other party from using the inventions. There is also the risk that, even if the validity of these patents is upheld, the court will refuse to stop the other party on the ground that such other partys activities do not infringe our rights to these patents.\nFurthermore, a third party may claim that we are using inventions covered by the third partys patent rights and may file an injunction to stop us from engaging in our normal operations and activities, including making or selling our products. These lawsuits are costly and could affect our results of operations and divert the attention of managerial and technical personnel. There is a risk that a court would decide that we are infringing the third partys patents and would order us to stop the activities covered by the patents. In addition, there is a risk that a court will order us to pay the other party damages for having violated the other partys patents. The biotechnology industry has produced a proliferation of patents, and it is not always clear to industry participants, including us, which patents cover various types of products or methods of use. The coverage of patents is subject to interpretation by the courts, and the interpretation is not always uniform. If we are sued for patent infringement, we would need to demonstrate that our products or methods of use either do not infringe the patent claims of the relevant patent and/or that the patent claims are invalid, and we may not be able to do this. Proving invalidity, in particular, is difficult since it requires a showing of clear and convincing evidence to overcome the presumption of validity enjoyed by issued patents.\nBecause some patent applications in the United States may be maintained in secrecy until the patents are issued, patent applications in the United States and many foreign jurisdictions are typically not published until eighteen months after filing, and publications in the scientific literature often lag behind actual discoveries, we cannot be certain that others have not filed patent applications for technology covered by our issued patents or our pending applications or that we were the first to invent the technology. Our competitors may have filed, and may in the future file, patent applications covering technology similar to ours. Any such patent application may have priority over our patent applications and could further require us to obtain rights to issued patents covering such technologies. If another party has filed a United States patent application on inventions similar to ours, we may have to participate in an interference proceeding declared by the PTO, to determine priority of invention in the United States. The costs of these proceedings could be substantial, and it is possible that such efforts would be unsuccessful, resulting in a loss of our United States patent position with respect to such inventions.\nSome of our competitors may be able to sustain the costs of complex patent litigation more effectively than we can because they have substantially greater resources. In addition, any uncertainties resulting from the initiation and continuation of any litigation could have a material adverse effect on our ability to raise the funds necessary to continue our operations.\nThird parties may claim that we infringe their proprietary rights and may prevent us from manufacturing and selling some of our products.\nOur manufacture, use and sale of SDC-based products may subject us to lawsuits relating to the validity and infringement of patents or other proprietary rights of third parties. Litigation may be costly and time-consuming, and could divert the attention of our management and technical personnel. If we are found to have violated the trademark, trade secret, copyright, patent or other intellectual property or proprietary rights of others, such a finding could result in the need to cease use of a trademark, trade secret, copyrighted work or patented invention in our business and our obligation to pay a substantial amount for past infringement. If the rights holders are willing to permit us to continue to use their intellectual property rights, it may be necessary for us to enter into license arrangements with unfavorable terms and pay substantial amounts in royalty and other license fees. Either having to cease use or pay such fees could prevent us, or our third-party manufacturer, from manufacturing and selling our products, which could make us much less competitive in our industry and have a material adverse impact on our business, operating results and financial condition.\nConfidentiality agreements with employees and others may not adequately prevent disclosure of our trade secrets and other proprietary information and may not adequately protect our intellectual property, which could limit our ability to compete.\nWe may rely in part on trade secret protection in order to protect our proprietary trade secrets and unpatented know-how. However, trade secrets are difficult to protect, and we cannot be certain that others will not develop the same or similar technologies on their own. We have taken steps, including entering into confidentiality agreements with our employees, consultants, outside scientific collaborators, sponsored researchers and other advisors, to protect our trade secrets and unpatented know-how. These agreements generally require that the other party keep confidential and not disclose to third parties all confidential information developed by the party or made known to the party by us during the course of the partys relationship with us. We also typically obtain agreements from these parties which provide that inventions conceived by the party in the course of rendering services to us will be our exclusive property. However, these agreements may not be honored and may not effectively assign intellectual property rights to us. Enforcing a claim that a party illegally obtained and is using our trade secrets or know-how is difficult, expensive and time consuming, and the outcome is unpredictable. In addition, courts outside the United States may be less willing to protect trade secrets or know-how. The failure to obtain or maintain trade secret protection could adversely affect our competitive position.\nWe may be subject to claims that our employees have wrongfully used or disclosed alleged trade secrets of their former employers.\nAs is common in the biotechnology, food, chemical and pharmaceutical industries, we employ individuals who were previously employed at other biotechnology, food, chemical or pharmaceutical companies, including our competitors or potential competitors. Although no claims against us are currently pending, we may be subject to claims that these employees or we have inadvertently or otherwise used or disclosed trade secrets or other proprietary information of their former employers. Litigation may be necessary to defend against these claims. Even if we are successful in defending against these claims, litigation could result in substantial costs and be a distraction to management.\nRisks Related to our Common Stock\nThe price of our common stock has been and may continue to be volatile.\nOur common stock is approved for quotation on the OTC Markets OTCQB marketplace under the symbol PURE. The OTCQB is a regulated quotation service that displays real-time quotes, last-sale prices and volume information in over-the-counter equity securities and provides significantly less liquidity than a listing on the Nasdaq Stock Markets or other national securities exchange. The OTCQB securities are traded by a community of market makers that enter quotes and trade reports. This market is limited in comparison to the national stock exchanges and any prices quoted may not be a reliable indication of the value of our common stock. Quotes for stocks included on the OTCQB are not listed in the financial sections of newspapers as are those for the Nasdaq Stock Market or the NYSE. Therefore, prices for securities traded solely on the OTCQB may be difficult to obtain.\nTrading on the OTCQB Marketplace as opposed to a national securities exchange has resulted and may continue to result in a reduction in some or all of the following, each of which could have a material adverse effect on the price of our common stock and our company:\n● the liquidity of our common stock;\n● the market price of shares of our common stock;\n● our ability to obtain financing to support our operations and the implementation of our business plan;\n● the number of institutional and other investors that will consider investing in shares of our common stock;\n● the number of market markers in shares of our common stock;\n● the availability of information concerning the trading prices and volume of shares of our common stock; and\n● the number of broker-dealers willing to execute trades in shares of our common stock.\nThe price and trading volume of our common stock have historically been volatile.\nIn addition, the market price and trading volume of our common stock may be subject to wide fluctuations in the future in response to:\n● actual or anticipated fluctuations in our results of operations;\n● announcements regarding the status of our regulatory efforts;\n● the determination that our shares of common stock are penny stock which will require brokers trading in our shares of common stock to adhere to more stringent rules, likely resulting in a reduced level of trading activity in the secondary trading market for our shares of common stock;\n● the sale by us of our common or preferred stock or other securities, or the anticipation of sales of such securities;\n● the trading volume of our common stock, particularly if such volume is light;\n● the introduction of new products or services, or product or service enhancements by us or our competitors;\n● developments with respect to our or our competitors intellectual property rights or regulatory approvals or denials;\n● announcements of significant acquisitions or other agreements by us or our competitors;\n● sales or anticipated sales of our common stock by our insiders (management and directors);\n● conditions and trends in our industry;\n● changes in our pricing policies or the pricing policies of our competitors;\n● changes in the estimation of the future size and growth of our markets; and\n● general economic conditions.\nIn addition, the stock market in general, the OTCQB, and the market for shares of novel technology companies in particular, have experienced extreme price and volume fluctuations that in some cases may be unrelated or disproportionate to the operating performance of those companies. These broad market and industry factors may materially harm the market price of our common stock, regardless of our operating performance. In addition, this volatility could adversely affect an investors ability to sell shares of our common stock, and/or the available price for such shares, at any given time.\nPotential sales or issuances of our common stock to raise capital, or the perception that such sales could occur, could cause dilution to our current stockholders and the price of our common stock to fall.\nWe have historically supported our operations through the issuance of equity and debt securities and may continue to do so in the future. For example, during July and October of 2023, we completed a private placement convertible debt financing to accredited investors, in which we raised net proceeds of $1.8 million. Pursuant to the terms of the Purchase Agreement, the conversion price for the convertible debt financing will be at least $0.15 per share and less than or equal to $0.23 per share. Although we may not be successful in obtaining financing through equity or debt sales on terms that are favorable to us in the future, if at all, any such sales that do occur could result in substantial dilution to the interests of existing holders of our common stock. Additionally, the sale of a substantial number of shares of our common stock or other equity securities to any new investors, or the anticipation of such sales, could cause the trading price of our common stock to fall.\nOur common stock is deemed to be penny stock, which may make it more difficult for investors to sell their shares due to suitability requirements.\nShares of our common stock are subject to the so-called penny stock rules as that term is defined in Rule 3a51-1 promulgated under the Securities Exchange Act of 1934. These requirements may reduce the potential market for our common stock by reducing the number of potential investors. This may make it more difficult for investors in our common stock to sell shares to third parties or to otherwise dispose of them. This could cause our stock price to decline.\nBroker-dealers dealing in penny stocks are required to provide potential investors with a document disclosing the risks of penny stock. Moreover, broker-dealers are required to determine whether an investment in a penny stock is a suitable investment for a prospective investor. Such requirements may discourage broker-dealers from effecting transactions in our common stock, which could limit the market price and liquidity of our common stock.\nWe have never paid dividends on our capital stock, and we do not anticipate paying any cash dividends in the foreseeable future.\nThe continued operation and expansion of our business will require substantial funding. Investors seeking cash dividends in the foreseeable future should not purchase our common stock. We have paid no cash dividends on any of our capital stock to date and we currently intend to retain our available cash to fund the development and growth of our business. Any determination to pay dividends in the future will be at the discretion of our Board and will depend upon results of operations, financial condition, contractual restrictions, restrictions imposed by applicable law and other factors our Board deems relevant. We do not anticipate paying any cash dividends on our common stock in the foreseeable future. Any return to stockholders will therefore be limited to the appreciation of their stock, which may never occur.\nAnti-takeover provisions under our charter documents and Delaware law could delay or prevent a change of control and could also limit the market price of our stock.\nCertain provisions of our charter and bylaws, as amended, or Bylaws, may delay or frustrate the removal of incumbent directors and may prevent or delay a merger, tender offer, or proxy contest involving us that is not approved by our Board, even if such events may be beneficial to the interests of stockholders. For example, our Board, without stockholder approval, has the authority and power to authorize the issuance of up to 5,000,000 shares of preferred stock and such preferred stock could have voting or conversion rights that could adversely affect the voting power of the holders of our common stock. Further, the one-for-eight reverse stock split of our outstanding common stock that we effected on August 14, 2012 has increased the proportion of unissued and authorized common shares to issued and outstanding common shares, which could allow our Board to issue large numbers of additional shares of our common stock that could significantly reduce the voting power of our current stockholders. In addition, we are governed by the provisions of Section 203 of the Delaware General Corporation Law, which may discourage, delay or prevent certain business combinations with stockholders owning 15% or more of our outstanding voting stock. These and other provisions in our charter documents may make it more difficult for stockholders or potential acquirers to initiate actions that are opposed by our then-current Board, including delaying or impeding a merger, tender offer, or proxy contest or other change of control transaction involving the Company. Any delay or prevention of a change of control transaction could cause stockholders to lose a substantial premium over the then-current market price of their shares.\nGeneral Risk Factors\nCompliance with the reporting requirements of federal securities laws can be expensive.\nWe are a public reporting company in the United States, and accordingly, subject to the information and reporting requirements of the Exchange Act and other federal securities laws, including the compliance obligations of the Sarbanes-Oxley Act of 2002. The costs of complying with the reporting requirements of the federal securities laws, including preparing and filing annual and quarterly reports and other information with the SEC and furnishing audited reports to stockholders, can be substantial.\nIf we fail to maintain an effective system of internal controls, we may not be able to accurately determine our financial results or prevent fraud. As a result, the Companys stockholders could lose confidence in our financial results, which could harm our business and the value of the Companys common shares.\nEffective internal controls are necessary for us to provide reliable financial reports and effectively prevent fraud. Section 404 of the Sarbanes-Oxley Act of 2002 requires us to evaluate and report on our internal controls over financial reporting. Our internal controls and financial reporting are not subject to attestation by our independent registered public accounting firm pursuant to the exemption provided to issuers that are not large accelerated filers or accelerated filers under the Dodd-Frank Act of 2010. We cannot be certain that we will be successful in maintaining adequate internal controls over our financial reporting and financial processes in the future. We may in the future discover areas of our internal controls that need improvement. Furthermore, to the extent our business grows, our internal controls may become more complex, and we would require significantly more resources to ensure our internal controls remain effective. If we or our independent auditors discover a material weakness, the disclosure of that fact, even if quickly remedied, could reduce the market value of the Companys common stock. Additionally, the existence of any material weakness or significant deficiency would require management to devote significant time and incur significant expense to remediate any such material weaknesses or significant deficiencies and management may not be able to remediate any such material weaknesses or significant deficiencies in a timely manner.\nWe are subject to tax audits by various tax authorities in multiple jurisdictions.\nFrom time to time we may be audited by tax authorities to whom we are subject. Any assessment resulting from such audits, if any, could result in material changes to our past or future taxable income, tax payable or deferred tax assets, and could require us to pay penalties and interest that could materially adversely affect our financial results. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nOur mailing address is 771 Jamacha Road., #512, El Cajon, California 92019. Our executive officers and employees work remotely in a virtual office setting without lease obligations. In July 2019 we entered into a Sublease Agreement, or the Sublease, with SwabPlus L.P., or SwabPlus, pursuant to which we subleased certain office and industrial space for our corporate headquarters in Rancho Cucamonga, California, or the Previous Headquarters. In December 2020, the Sublease expired but we continued to rent on a month-to-month basis. In September 2023, the Sublease was terminated. We believe that our existing remote environment is adequate for our current needs. Item 3. Legal Proceedings\nFrom time to time, we may become involved in various lawsuits and legal proceedings which arise in the ordinary course of business. The impact and outcome of litigation, if any, is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. We are not currently aware of any such legal proceedings or claims to which we or our wholly owned subsidiary is a party or of which any of our property is subject that we believe will have, individually or in the aggregate, a material adverse effect on our business, financial condition or results of operations. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for the Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nInformation About Our Common Stock\nOur common stock is approved for quotation on the OTC Markets OTCQB marketplace under the symbol PURE. The OTCQB is a regulated quotation service that displays real-time quotes, last-sale prices and volume information in over-the-counter equity securities. The OTCQB securities are traded by a community of market makers that enter quotes and trade reports. This market is limited in comparison to the national stock exchanges and any prices quoted may not be a reliable indication of the value of our common stock. Any over-the-counter market quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nHolders\nAs of October 30, 2023, we had approximately 219 holders of record of our common stock. This does not include beneficial owners holding common stock in street name.\nDividend Policy\nWe have never paid dividends and have no current plans to do so. We currently anticipate that we will retain all of our future earnings, if any, for use in the development and expansion of our business and for general corporate purposes. Any determination to pay dividends in the future will be at the discretion of our Board and will depend upon our results of operations, financial condition and other factors that the Board, in its discretion, may deem relevant.\nRecent Sales of Unregistered Securities\nJuly 2023 Private Placement\nOn July 3, 2023 we entered into a Note Purchase Agreement, or the Note Purchase Agreement, with certain accredited investors, or Lenders, pursuant to which we issued the Lenders convertible promissory notes, or the Notes, and collectively with the Note Purchase Agreement, the Notes Documents, with an aggregate principal balance of $1,015,000, or the Private Placement Note Financing. Pursuant to the Notes Documents, the interest to the Lenders shall compound annually at the rate of 7.55%. The Maturity Date (as defined in the Notes) of the Notes is the third-year anniversary of the date of issuance, or such earlier date as the Notes provide. The Notes Documents provided for subsequent closings for an aggregate offering size of $1.8 million. On October 20, 2023 we issued an additional Note pursuant to the Note Purchase Agreement in a subsequent closing with an aggregate principal of $785,000.\nJuly 2022 Private Placement\nOn July 15, 2022, we completed a closing, or the Closing, of a private placement financing, or the Private Placement Financing, to accredited investors, or the Investors. We raised $3.5 million in the Closing and issued an aggregate of 23,333,332 shares, or the Private Placement Shares, of our common stock at a purchase price of $0.15 per share. The Private Placement Shares issued in the Private Placement Financing were issued pursuant to a Securities Purchase Agreement, or the Securities Purchase Agreement, entered into with the Investors.\nThe securities in the transactions described above, including the Notes, were issued and sold in reliance upon an exemption from registration afforded by Section 4(a)(2) of the Securities Act or Rule 506 of Regulation D promulgated under the Securities Act. Each of the persons acquiring the foregoing securities was an accredited investor (as defined in Rule 501(a) of Regulation D) and confirmed the foregoing and acknowledged, in writing, that the securities must be acquired and held for investment. No underwriter participated in the offer and sale of these securities, and no commission or other remuneration was paid or given directly or indirectly in connection therewith. The proceeds from these sales were used for general corporate purposes.\nRepurchase of Equity Securities\nNone.\nInformation About Our Equity Compensation Plans\nThe information required under this heading is incorporated herein by reference to the applicable information set forth in Item 12 of this Annual Report. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nAll references to PURE, we, our, us and the Company in this Item 7 refer to PURE Bioscience, Inc. and our wholly owned subsidiary.\nThe discussion in this section contains forward-looking statements. These statements relate to future events, our future operations or our future financial performance. We have attempted to identify forward-looking statements by terminology such as anticipate, believe, can, continue, could, estimate, expect, intend, may, plan, potential, predict, should, would or will or the negative of these terms or other comparable terminology, but their absence does not mean that a statement is not forward-looking. These statements are only predictions and involve known and unknown risks, uncertainties and other factors, which could cause our actual results to differ from those projected in any forward-looking statements we make. Several risks and uncertainties we face are discussed in more detail under Risk Factors in Part I, Item 1A of this Annual Report or in the discussion and analysis below. You should, however, understand that it is not possible to predict or identify all risks and uncertainties and you should not consider the risks and uncertainties identified by us to be a complete set of all potential risks or uncertainties that could materially affect us. You should not place undue reliance on the forward-looking statements we make herein because some or all of them may turn out to be wrong. We undertake no obligation to update any of the forward-looking statements contained herein to reflect future events and developments, except as required by law. The following discussion should be read in conjunction with the consolidated financial statements and the notes to those statements included elsewhere in this Annual Report on Form 10-K.\nOverview\nWe are focused on developing and commercializing proprietary antimicrobial products that provide safe and cost-effective solutions to the health and environmental challenges of pathogen and hygienic control. Our technology platform is based on patented stabilized ionic silver, and our initial products contain silver dihydrogen citrate, or SDC. SDC is a broad-spectrum, non-toxic antimicrobial agent, which offers residual protection and formulates well with other compounds. As a platform technology, we believe SDC is distinguished from existing products in the marketplace because of its superior efficacy, reduced toxicity, non-causticity and the inability of bacteria to form a resistance to it.\nWe believe there is a significant market opportunity for our safe, non-toxic, non-caustic and effective SDC-based solutions. We currently offer PURE® Hard Surface as a food contact surface sanitizer and disinfectant to restaurant chains, food processors and food transportation companies. We also offer PURE Control® as a direct food contact processing aid. In addition to our direct sales efforts with PURE Hard Surface and PURE Control, we market and sell our SDC-based products indirectly through third-party distributors supporting various industries.\nFinancial Overview\nThis financial overview provides a general description of our revenue and expenses.\nNet Product Sales\nWe contract manufacture and sell SDC-based products for end use, and as a raw material for manufacturing use. We recognize revenue when we satisfy a performance obligation by transferring control of the promised goods or services to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services. Any amounts received prior to satisfying revenue recognition criteria are recorded as deferred revenue. See Critical Accounting Policies and Estimates - Revenue Recognition.\nCost of Goods Sold\nCost of goods sold for product sales includes direct and indirect costs to manufacture products, including materials consumed, manufacturing overhead, shipping costs, salaries, benefits, reserved inventory, and related expenses of operations. Depreciation related to manufacturing is systematically allocated to inventory produced, and expensed through cost of goods sold at the time inventory is sold.\nSelling, General and Administrative\nSelling, general and administrative expense consists primarily of salaries and other related costs for personnel in business development, sales, finance, accounting, information technology, and executive functions. Other selling, general and administrative costs include product marketing, advertising, and trade show costs, as well as public relations and investor relations, facility costs, and legal, accounting and other professional fees.\nResearch and Development\nOur research and development activities are focused on leveraging our technology platform to develop additional proprietary products and applications. Research and development expense consists primarily of personnel and related costs, product registration expenses, and third-party testing. We expense research and development costs as incurred.\nOther Income (Expense)\nWe record interest income, interest expense, as well as other non-operating transactions, as other income (expense) in our consolidated statements of operations.\nResults of Operations - Comparison of the Years Ended July 31, 2023 and 2022\nFluctuations in Operating Results\nOur results of operations have fluctuated significantly from period to period in the past and are likely to continue to do so in the future. We anticipate that our results of operations will be affected for the foreseeable future by several factors that may contribute to these periodic fluctuations, including fluctuations in the buying patterns of our current or potential customers for which we have no visibility, the mix of product sales including a change in the percentage of higher or lower margin formulations and packaging configurations of our products, the cost of product sales including component costs, our inability for any reason to be able to meet demand, the achievement and timing of research and development and regulatory milestones, unforeseen changes in expenses, including non-cash expenses such as the fair value of equity awards granted, the calculation of which includes several variable assumptions, and unforeseen manufacturing or supply issues, among other issues. Due to these fluctuations, we believe that the period-to-period comparisons of our operating results are not a reliable indication of our future performance. As of the date of this filing, we are not aware of any trends in these factors or events or conditions that we believe are reasonably likely to impact our results of operations in the future.\nNet Product Sales\nNet product sales were $1,871,000 and $1,813,000 for the fiscal years ended July 31, 2023 and 2022, respectively. The increase of $58,000 was attributable to increased sales across our end-user network servicing the food processing industry. Our top three customers accounted for $727,000 of net product sales for the fiscal year ended July 31, 2023.\nFor the year ended July 31, 2023, one customer accounted for 24% of our net product sales. No other individual customer accounted for 10% or more of our net product sales. There were no foreign sales during the fiscal year ended July 31, 2023.\nFor the year ended July 31, 2022, three individual customers accounted for 14%, 13% and 10% of our net product sales. No other individual customer accounted for 10% or more of our net product sales. There were no foreign sales during the fiscal year ended July 31, 2022.\nDuring the fiscal years ended July 31, 2023 and 2022, we recognized $6,000 and $40,000 in royalties from a non-exclusive third-party distributor, respectively.\nCost of Goods Sold\nCost of goods sold was $906,000 and $853,000 for the years ended July 31, 2023 and 2022, respectively. The increase of $53,000 was primarily attributable to increased product sales.\nGross margin, as a percentage of net product sales, was 52% and 53% for the years ended July 31, 2023 and 2022, respectively. The decrease in gross margin percentage was primarily attributable to the sale of higher margin formulations and packaging configurations of our products during the fiscal year ended July 31, 2022 as compared with the current year.\nSelling, General and Administrative Expense\nSelling, general and administrative expense was $4,302,000 and $4,051,000 for the years ended July 31, 2023 and 2022, respectively. The increase of $251,000 was primarily attributable to increased personnel costs and travel expense. These increases were offset by decreased professional service and board of director fees.\nShare-based compensation expense included in selling, general and administrative expense, was $324,000 and $567,000 for the fiscal years ended July 31, 2023 and 2022, respectively. The decrease of $243,000 is primarily due to the prior year vesting of stock options and restricted stock units granted to employees, directors and consultants supporting our selling, general and administrative functions.\nResearch and Development Expense\nResearch and development expense was $297,000 and $319,000 for the years ended July 31, 2023 and 2022, respectively. The decrease of $22,000 was primarily attributable to decreased third-party testing and research supporting our EPA and FDA efforts.\nImpairment of fixed assets\nAs of July 31, 2023, management performed its annual impairment test and determined that its forecasted operations could no longer support $237,000 of manufacturing equipment previously capitalized as fixed assets, and as such an impairment was recognized. In addition, we wrote down $78,000 of construction in progress due to the termination of the Companys lease at its primary facility in Rancho Cucamonga, California. During the year ended July 31, 2022, we wrote down $55,000 of fixed assets destroyed by fire at a third-party location.\nImpairment of intangibles\nAs of July 31, 2022, management performed its annual impairment test and determined that its forecasted operations could no longer support the $299,000 carrying value of the patents, and as such all amounts were impaired. There were no intangible impairments during the fiscal year ended July 31, 2023.\nOther Income (Expense)\nIn April 2021, we were funded $239,000 under the Paycheck Protection Program or the PPP through California Bank and Trust. The PPP was established pursuant to the Coronavirus Aid, Relief and Economic Security Act or the CARES Act, and is administered by the U.S. Small Business Administration. During the fiscal year ended July 31, 2022, we received loan forgiveness under the provisions of the CARES Act for the entire $239,000 loan provided to us under the PPP. This amount was recorded as a gain on extinguishment of indebtedness on the Condensed Consolidated Statement of Operations during the fiscal year ended July 31, 2022.\nLiquidity and Capital Resources\nAs of July 31, 2023, we had $1,170,000 in cash and cash equivalents compared with $3,466,000 in cash and cash equivalents as of July 31, 2022. The net decrease in cash and cash equivalents was primarily attributable to the use of cash to fund our operations and investments in property, plant and equipment. Additionally, as of July 31, 2023, we had $1,553,000 of total liabilities, including $422,000 in accounts payable, compared with $575,000 of total liabilities, including $488,000 in accounts payable as of July 31, 2022. The net increase in total liabilities was due to the note payable financing that occurred in July 2023.\nWe have a history of recurring losses, and as of July 31, 2023 we have incurred a cumulative net loss of $133,245,000. During the fiscal year ended July 31, 2023, we recorded a net loss of $3,961,000 on recorded net revenue of $1,877,000. In addition, during the year ended July 31, 2023 we used $3,311,000 in operating and investing activities resulting in a cash balance of $1,095,000 as of July 31, 2023. Our history of recurring operating losses, and negative cash flows from operating activities give rise to substantial doubt regarding our ability to continue as a going concern. The financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classifications of liabilities that may result from our possible inability to continue as a going concern.\nJuly 2023 Private Placement\nOn July 3, 2023 we entered into a Note Purchase Agreement, or the Note Purchase Agreement, with certain accredited investors, or Lenders, pursuant to which we issued the Lenders convertible promissory notes, or the Notes, and collectively with the Note Purchase Agreement, the Notes Documents, with an aggregate principal balance of $1,015,000, or the Private Placement Note Financing. Pursuant to the Notes Documents, the interest to the Lenders shall compound annually at the rate of 7.55%. The Maturity Date (as defined in the Notes) of the Notes is the third-year anniversary of the date of issuance, or such earlier date as the Notes provide. The Notes Documents provided for subsequent closings for an aggregate offering size of $1.8 million. On October 20, 2023 we issued an additional Note pursuant to the Note Purchase Agreement in a subsequent closing with an aggregate principal of $785,000.\nAll or any portion of the principal amount of the Note, plus accrued and unpaid interest, is convertible at any time, in whole or in part, at a Lenders or our option, into shares of our common stock at a conversion price equal to the 30-day volume-weighted average price of our common stock as reported on the market or exchange on which our common stock is listed or quoted for trading, or VWAP, on the date of conversion on the last trading day prior to the date of conversion, provided that such conversion price is at least $0.15 per share and less than or equal to $0.23 per share, subject to certain customary adjustments. Additionally, at any time the holders of a majority of the outstanding principal balance under the Notes may elect specified in writing to convert all of the Notes at a conversion price equal to the VWAP, provided that the conversion price is equal to at least $0.15 per share, subject to certain customary adjustments.\nFurther, in the event of certain corporate transactions, all outstanding principal and unpaid accrued interest due on such Notes shall be automatically converted into conversion shares on the trading day immediately prior to the closing date of such corporate transaction. The number of shares to be issued upon such conversion shall be based on the VWAP on the last trading day prior to the public announcement of the execution of the definitive documents with respect to such transaction.\nThe Notes Documents provide for certain events of default that are typical for a transaction of this type, including, among other things, default in the payment of principal or interest for more than 30 days, our making an assignment for the benefit of creditors, within 15 days after the commencement of bankruptcy proceedings against us, or breach of certain covenants.\nJuly 2022 Private Placement\nOn July 15, 2022, we completed a closing, or the Closing, of a private placement financing, or the Private Placement Financing, to accredited investors, or the Investors. We raised approximately $3.5 million in the Closing and issued an aggregate of 23,333,332 shares, or the Private Placement Shares, of our common stock at a purchase price of $0.15 per share. The Private Placement Shares issued in the Private Placement Financing were issued pursuant to a Securities Purchase Agreement, or the Securities Purchase Agreement, entered into with the Investors. Our net proceeds from the Closing, after deducting fees and other offering expenses, were approximately $3.5 million.\nOur future capital requirements depend on numerous forward-looking factors. These factors may include, but are not limited to, the following: the acceptance of, and demand for, our products; our success and the success of our partners in selling our products; our success and the success of our partners in obtaining regulatory approvals to sell our products; the costs of further developing our existing products and technologies; the extent to which we invest in new product and technology development; and the costs associated with the continued operation, and any future growth, of our business. The outcome of these and other forward-looking factors will substantially affect our liquidity and capital resources.\nUntil we can continually generate positive cash flow from operations, we will need to continue to fund our operations with the proceeds of offerings of our equity and debt securities. However, we cannot assure you that additional financing will be available when needed or that, if available, financing will be obtained on terms favorable to us or to our stockholders. If we raise additional funds from the issuance of equity securities, substantial dilution to our existing stockholders would likely result. If we raise additional funds by incurring debt financing, the terms of the debt may involve significant cash payment obligations as well as covenants and specific financial ratios that may restrict our ability to operate our business.\nCritical Accounting Policies and Estimates\nThe discussion and analysis of our financial condition and results of operations are based on our audited consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States, or GAAP. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, expenses, and related disclosures. We evaluate our estimates on an ongoing basis. We base our estimates on historical experience and on other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe the following accounting policies and estimates are critical to aid you in understanding and evaluating our reported financial results.\nRevenue Recognition\nEffective August 1, 2018, we adopted the Financial Accounting Standards Board or the FASB Accounting Standards Codification or ASC, Topic 606, Revenue from Contracts with Customers or Topic 606. Under Topic 606, revenue is recognized at an amount that reflects the consideration to which we expect to be entitled in exchange for transferring goods or services to a customer. This principle is applied using the following 5-step process:\n1. Identify the contract with the customer\n2. Identify the performance obligations in the contract\n3. Determine the transaction price\n4. Allocate the transaction price to the performance obligations in the contract\n5. Recognize revenue when (or as) each performance obligation is satisfied\nUnder Topic 606, we recognize revenue when we satisfy a performance obligation by transferring control of the promised goods or services to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services.\nOur technology platform is based on patented stabilized ionic silver, and our initial products contain silver dihydrogen citrate, or SDC. SDC is a broad-spectrum, non-toxic antimicrobial agent, which offers residual protection and formulates well with other compounds. We sell various configurations and dilutions of SDC direct to customers and through distributors. We currently offer PURE® Hard Surface as a food contact surface sanitizer and disinfectant to restaurant chains, food processors and food transportation companies. We also offer PURE Control® as a direct food contact processing aid.\nContract terms for unit price, quantity, shipping and payment are governed by sales agreements and purchase orders which we consider to be a customers contract in all cases. The unit price is considered the observable stand-alone selling price for the arrangements. Any promotional or sales discounts are applied evenly to the units sold for purposes of calculating standalone selling price.\nProduct sales generally consist of a single performance obligation that we satisfy at a point in time. We recognize product revenue when the following events have occurred: (a) we have transferred physical possession of the products, (b) we have a present right to payment, (c) the customer has legal title to the products, and (d) the customer bears significant risks and rewards of ownership of the products.\nOur direct customer and distributer sales are invoiced based on received purchase orders. Our payment terms on invoiced direct customer and distributor sales range between 30 and 90 days after we satisfy our performance obligation. The majority of our customers are on 30 day payment terms. We currently offer no right of return on invoiced sales and maintain no allowance for sales returns.\nShipping and handling are treated as activities to fulfill promises to customers and any amounts billed to a customer, if applicable, represent revenues earned for the goods provided. Costs related to such shipping and handling billings are classified as cost of sales.\nWe do not have significant categories of revenue that may impact how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors.\nVariable Consideration\nWe record revenue from customers in an amount that reflects the transaction price we expect to be entitled to after transferring control of those goods or services. From time to time, we offer sales promotions on our products such as discounts. Variable consideration is estimated at contract inception only to the extent that it is probable that a significant reversal of revenue will not occur.\nShare-Based Compensation\nWe grant equity-based awards under share-based compensation plans. We estimate the fair value of share-based payment awards using the Black-Scholes option valuation model. This fair value is then amortized over the requisite service periods of the awards. The Black-Scholes option valuation model requires the input of subjective assumptions, including price volatility of the underlying stock, risk-free interest rate, dividend yield, and expected life of the option. Share-based compensation expense is based on awards ultimately expected to vest, and therefore is reduced by expected forfeitures. Changes in assumptions used under the Black-Scholes option valuation model could materially affect our net loss and net loss per share.\nImpairment of Long-Lived Assets\nIn accordance with GAAP, if indicators of impairment exist, we assess the recoverability of the affected long-lived assets by determining whether the carrying value of such assets can be recovered through undiscounted future operating cash flows. If impairment is indicated, we measure the amount of such impairment by comparing the carrying value of the asset to the fair value of the asset and we record the impairment as a reduction in the carrying value of the related asset and a charge to operating results. Estimating the undiscounted future cash flows associated with long-lived assets requires judgment, and assumptions could differ materially from actual results. As of July 31, 2023, management performed its annual impairment test and determined that its forecasted operations could no longer support $237,000 of manufacturing equipment previously capitalized as fixed assets, and as such an impairment was recognized. In addition, we wrote down $78,000 of construction in progress due to the termination of the Companys lease at its primary facility in Rancho Cucamonga, California. As of July 31, 2022, management performed its annual impairment test and determined that its forecasted operations could no longer support the $299,000 carrying value of the patents, and as such all amounts were impaired. There were no patent impairments during the fiscal year ended July 31, 2023.\nFor purposes of testing impairment, we group our long-lived assets at the lowest level for which there are identifiable cash flows independent of other asset groups. Currently, there is only one level of aggregation for our intangible assets. We assess the impairment of long-lived assets, consisting of property, plant, equipment and finite-lived intangible assets primarily consisting of the worldwide patent portfolio of our silver ion technologies, annually, or whenever events or circumstances indicate that the carrying value may not be recoverable. Examples of such events or circumstances include:\n● an asset groups inability to continue to generate income from operations and positive cash flow in future periods;\n● loss of legal ownership or title to an asset;\n● significant changes in our strategic business objectives and utilization of the asset(s); and\n● the impact of significant negative industry or economic trends.\nAdditionally, on a quarterly basis we review the significant assumptions underlying our impairment assessment to determine that our previous conclusions remain valid. As part of our review, we consider changes in revenue growth rates, operating margins, working capital needs and other expenditures. With the exception of the impairment discussed above we have not identified any asset groups where undiscounted cash flows were not substantially in excess of carrying value.\nRecoverability of assets to be held and used in operations is measured by a comparison of the carrying amount of an asset to the future net cash flows expected to be generated by the assets. The factors used to evaluate the future net cash flows, while reasonable, require a high degree of judgment and the results could vary if the actual results are materially different than the forecasts. In addition, we base useful lives and amortization or depreciation expense on our subjective estimate of the period that the assets will generate revenue or otherwise be used by us. If such assets are considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the assets exceeds the fair value of the assets. Assets to be disposed of are reported at the lower of the carrying amount or fair value less selling costs.\nWe also periodically review the lives assigned to our intangible assets to ensure that our initial estimates do not exceed any revised estimated periods from which we expect to realize cash flows from the technologies. If a change were to occur in any of the above-mentioned factors or estimates, the likelihood of a material change in our reported results would increase.\nRecent Accounting Pronouncements\nInformation regarding recent accounting pronouncements is contained in Note 2 to the Consolidated Financial Statements, included elsewhere in this report.\nOff Balance Sheet Arrangements\nWe do not have any off balance sheet arrangements. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nAs a Smaller Reporting Company as defined by Rule 12b-2 of the Exchange Act and in Item 10(f)(1) of Regulation S-K, we are electing scaled disclosure reporting obligations and therefore are not required to provide the information requested by this Item. Item 8. Financial Statements and Supplementary Data\nThe consolidated financial statements and supplementary data required by this Item 8 are set forth at the end of this Annual Report. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our Exchange Act reports is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to our management, including our Principal Executive Officer and Principal Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives.\nAs required by Rule 13a-15(e) under the Exchange Act, our management conducted an evaluation, under the supervision and with the participation of our Principal Executive Officer and our Principal Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this Annual Report. Based on the foregoing evaluation, our principal executive officer and principal financial officer concluded that as of the end of the period covered by this report our disclosure controls and procedures were effective.\nChanges in Our Internal Controls over Financial Reporting\nThere were no changes in our internal controls over financial reporting during our most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect our internal controls over financial reporting.\nManagements Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Exchange Act Rules 13a-15(f) and 15d-15(f). With the participation of our Principal Executive Officer and Principal Financial Officer, management conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on its evaluation under this framework, our management concluded that our internal control over financial reporting was effective as of July 31, 2023.\nInherent Limitations on Effectiveness of Controls\nOur management, including our Principal Executive Officer and Principal Financial Officer, do not expect that our disclosure controls or our internal control over financial reporting will prevent or detect all error and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. The design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Further, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Controls can also be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the controls. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of controls effectiveness to future periods are subject to risks. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdiction that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nInformation Regarding Our Board of Directors\nPursuant to our Bylaws, the number of directors is fixed and may be increased or decreased from time to time by resolution of our Board. The Board has fixed the number of directors at six members.\nInformation with respect to our directors as of October 30, 2023 is shown below.\nName Age Director Since Position(s) Held\nRobert Bartlett President, Director, Chief Executive Officer\nTom Y. Lee, CPA Director\nIvan Chen Director\nTom Myers Director\nBernard Blotner Director\nDavid M. Rendall Director\nRobert Bartlett joined our Board in February 2023 and, in March of 2023 was appointed as our President and Chief Executive Officer. Mr. Bartlett retired in 2006 as Chairman of the Board of Advanced Marketing Services, a major distributor of books and media to warehouse clubs worldwide. Since 1995, he has been the founder and was managing director of Combined Resources International, a manufacturer and distributor of picture frames, cork erase boards, and childrens furniture to warehouse clubs in the United States and Canada. From October of 1993 to June 1995, he served as Vice President, Divisional Manager at Anderson Chamberlain, Inc., an in-house general merchandise and food broker for Costcos warehouse clubs worldwide. From September 1990 to December 1993, he served as Senior Vice President, Operations, Merchandising, Traffic and Distribution with Source Club, Inc., a division of Meijer Stores. From December 1989 to December 1990, he served as Executive Vice President Merchandising, Operations, Traffic and Distribution with The Wholesale Club, Inc. until it was sold to Walmart in 1990. Prior to that, from November 1981 to September 1989, he was promoted to the position of Executive Vice President, Merchandising, Traffic and Distribution at The Price Company, Inc., the first membership warehouse club, which started in San Diego, CA, and later merged with Costco. He served in the United States Army after being drafted in December of 1965, schooled as artillery surveyor/training NCO for an Artillery Battalion, were he was attached to the 7th Army in Europe where he was honorably discharged at the rank of Sergeant E-5 in 1967. After discharge he attended Junior College under the GI Bill.\nWe believe Mr. Bartletts qualifications to serve as a director on our Board include his vast executive experience and expertise in merchandising and distribution to large retail stores and club warehouses and the insight he has into large retail sales and marketing.\nTom Y. Lee, CPA was appointed to our Board in October 2014 and, in 2019 was appointed as our President and Chief Executive Officer until his resignation in March of 2023. Mr. Lee has served as the President of MicroTube, Inc. as well. Mr. Lee was formerly audit committee chairman at First Continental Bank (which merged with United Commercial Bank in 2003). Mr. Lee has been an active CPA since 1983 and earned a Masters Degree in Accounting from California State University, Long Beach and a Bachelors Degree in Business Administration from TamKang University in Taipei, Taiwan.\nWe believe Mr. Lees qualifications to serve as a director on our Board include his accounting background and expertise as a CPA. The Board also considered Mr. Lees commitment to the Company and its technology platform based on his investments in the Companys stock.\nIvan Chen joined our Board in June 2018 and has served as Chairman of the Board since August 2021. Mr. Chen brings extensive experience in the healthcare, life sciences and technology industries, with expertise in areas including licensing, joint ventures, mergers & acquisitions, securities and corporate governance. He currently serves as Vice President, General Counsel and Corporate Secretary at Imagen Dental Partners, LLC, or Imagen, a dental partnership organization that provides non-clinical support services to dental practices across the United States. In this role, he oversees all legal, compliance, government relations, insurance/risk and patient relations matters at Imagen. Before joining Imagen, he was Director, Senior Corporate Counsel at Pacific Dental Services, LLC, or PDS, one of the largest dental support organizations in the United States, where he focused on acquisitions, dispositions, commercial contracts and healthcare compliance. Mr. Chen also served as the principal legal counsel to the Pacific Dental Services Foundation, a nonprofit organization providing oral healthcare to underserved communities worldwide. At PDS, he received numerous organization-wide awards for outstanding performance. Prior to joining PDS, he was Director, Global M&A Counsel at eBay Inc., a publicly-traded e-commerce platform. In this position, he led the negotiation and execution of numerous U.S. and cross-border acquisitions. Earlier in his career, he was an associate at Morrison & Foerster LLP and at Skadden, Arps, Slate, Meagher & Flom LLP, both large international law firms. In these roles, he focused on transactional, securities and corporate governance matters.\nIn addition to serving on the Board of our company, Mr. Chen is also on the Board of AiTmed Incorporated, a privately-held, early-stage telehealth platform.\nMr. Chen earned a J.D. from Harvard Law School, a masters degree from the University of Cambridge, and a bachelors degree from Northwestern University. He is admitted to the bar in California and New York and is a registered in-house counsel in Arizona.\nWe believe Mr. Chens qualifications to serve as a director on our Board include his executive leadership experience as an attorney and entrepreneur, as well as his educational background.\nTom Myers joined our Board in January 2021. He also serves as our Executive Vice President of Technology & Development. Prior to serving as our Executive Vice President of Technology & Development, he was our Chief Operating Officer and our Executive Vice President, Technical Support Services. In his various roles, he led the implementation and application of our SDC technology in customer facilities through problem identification and solution development, custom protocol development and training. Mr. Myers has over 40 years of food industry experience focusing on operations management, quality control and assurance, research and development, product and process development, plant design and construction, food safety and regulatory compliance. Prior to joining our company, Mr. Myers served as the President and Principal of Idaho Milk Products, where he built a $105 million green field dairy proteins plant and launched a worldwide business with revenues in excess of $200 million annually. Mr. Myers also has held executive management roles at Weider Nutrition International, Puritan Quartz Pharmaceuticals, FruitSource Associates and FruitSource Confections, Nancys Specialty Foods, Izaki Glico and Berkshire Hathaway Corporation (Sees Candies and Sees Candy Shops). Mr. Myers holds a Bachelor of Science degree from California State University, Long Beach.\nWe believe Mr. Myerss qualifications to serve as a director on our Board include his executive leadership experience as the Companys Chief Operating Officer and his experience in building and growing the Companys technology.\nBernard Blotner joined our Board in February 2023. Mr. Blotner retired in April 2020 as Senior Vice President and Corporate Client Group Director with Morgan Stanley Wealth Management. He was associated with Morgan Stanley since 1983, having joined the firm originally with E.F. Hutton & Company. Beginning in 1988, Mr. Blotner and his team focused on serving the investment needs of high net worth individuals and corporations, specifically in relation to stock option plans, stock purchase plans, restricted stock plans, control and restricted securities, and Rule 144 transactions. The teams assets under management was over $750 million, and plans ranged from small, local companies to multinational Fortune 500 companies. He was a member of the National Association of Stock Plan Professionals, or NASPP, and his licenses included FINRA Series 7, Series 65, Series 63 and Series 3. Mr. Blotner was named to the list of Forbes Best-In-State Wealth Advisors (2020). He graduated cum laude from Boston College with a Bachelor of Arts degree and received his Master of Arts degree from San Diego State University. Mr. Blotner has served on the Boards of Directors of several not for profit organizations. Prior to joining Morgan Stanley, he was the Program Director of the Jewish Community Center in San Diego.\nWe believe Mr. Blotners qualifications to serve as a director on our Board include his considerable experience in wealth management and asset management and valuable knowledge of the financial markets.\nDavid M. Rendall joined our Board in January 2021. Mr. Rendall is an attorney and licensed real estate broker in the state of California. Mr. Rendall has been the broker and owner of RE/MAX of Santa Clarita, RE/MAX of Valencia, and RE/MAX Gateway since February 2014. Mr. Rendall manages approximately 175 agents and has annual gross sales volume of over $1 billion. He is the owner of Group One Investments, Inc., a licensed real estate property management and real estate investment firm specializing in commercial management, Value Add commercial real estate investments, real estate syndication and development. He currently sits on the Santa Clarita Valley Economic Development Corporation board and is the Chief Executive Officer of Escrow Advantage, Inc., an independent escrow company. Mr. Rendall also is the general partner, owner, president, managing member, and/or member of multiple businesses and real estate partnerships. In addition to his real estate companies, he is the Principal and Partner of Group One Legal, PC. Mr. Rendall has been practicing real estate since 2001 and law since 2003, when he was admitted to the state bar of California. Mr. Rendall earned a J.D. from Loyola Law School and a bachelors degree in Political Science and Sociology from University of California, Los Angeles. He was also an adjunct professor at College of the Canyons, where he taught Real Estate Principles, Real Estate Practices, and Legal Aspects of Real Estate.\nWe believe Mr. Rendalls qualifications to serve as a director on our Board include his substantial managerial and that his business expertise and insight into specific areas of sales and marketing can provide leadership to the Company through various stages of potential development and growth. In addition, the Board values his legal expertise.\nInformation Regarding Our Executive Officers\nInformation with respect to our executive officers as of October 30, 2023 is shown below. Since Robert Bartlett and Tom Myers also serve on the Board, their biographies are set forth under Information Regarding the Board of Directors above.\nName Age Position(s) Held Position(s) Held Since\nRobert Bartlett Chief Executive Officer\nMark Elliott Vice President, Finance\nTom Myers Executive Vice President of Technology & Development\nMark Elliott was appointed as our Vice President Finance and Principal Financial and Accounting Officer in July 2015. Mr. Elliott joined the Company in 2004 as accounting manager and has been responsible for managing all accounting and regulatory reporting activities since he was promoted to Controller in May 2006. He has also been responsible for establishing all current financial and reporting systems. Prior to joining the Company, Mr. Elliott worked in government accounting. He earned a Bachelor of Science, Business Administration-Accountancy at California State University-San Marcos.\nFamily Relationships\nMr. Ivan Chen is the nephew of Mr. Tom Y. Lee. There are no other family relationships between any current director executive officer, or any director or executive officer during the fiscal year ended July 31, 2023.\nCorporate Governance\nOverview\nWe are committed to maintaining high standards of business conduct and corporate governance, which we believe are fundamental to the overall success of our business, serving our stockholders well and maintaining our integrity in the marketplace. Our Corporate Governance Guidelines and Code of Business Conduct and Ethics, together with our Certificate of Incorporation, Bylaws and the charters of our Board Committees, form the basis for our corporate governance framework. As discussed below, our Board has established two standing committees to assist it in fulfilling its responsibilities to the Company and its stockholders: the Audit Committee and the Compensation Committee. The Board performs the functions typically assigned to a Nominating and Corporate Governance Committee.\nCorporate Governance Guidelines\nOur Corporate Governance Guidelines are designed to ensure effective corporate governance of our Company. Our Corporate Governance Guidelines cover topics including, but not limited to, director qualification criteria, director responsibilities, director compensation, director orientation and continuing education, communications from stockholders to the Board, succession planning and the annual evaluations of the Board and its Committees. Our Corporate Governance Guidelines are reviewed regularly by the Board and revised when appropriate. The full text of our Corporate Governance Guidelines can be found in the Corporate Governance section of our website accessible at www.purebio.com. A printed copy may also be obtained by any stockholder upon request to our Corporate Secretary.\nCode of Business Conduct and Ethics\nWe have adopted a Code of Business Conduct and Ethics that applies to all of our employees, officers and directors. This Code constitutes a code of ethics as defined by the rules of the SEC. This Code also contains whistle blower procedures adopted by our Audit Committee regarding the receipt, retention and treatment of complaints related to accounting, internal accounting controls or auditing matters and procedures for confidential anonymous employee complaints related to questionable accounting or auditing matters. Copies of the code may be obtained free of charge from our website, www.purebio.com. Any amendments to, or waivers from, a provision of our code of ethics that applies to any of our executive officers will be posted on our website in accordance with the rules of the SEC. Other than as specifically referenced herein, the information contained on, or that can be accessed through, our website is not a part of this Report.\nDirector Independence\nWe are not currently listed on any national securities exchange or in an inter-dealer quotation system that has established a standard for independence. However, in evaluating the independence of our members and the composition of the committees of our Board, our Board utilizes the definition of independence as that term is defined by applicable listing standards of the NYSE MKT. As of the date hereof, our Board consists of six members, three of whom are considered independent as that term is defined by applicable listing standards of the NYSE MKT. Our independent directors include: Messrs. Chen, Blotner and Rendall.\nBoard and Committee Attendance\nDuring the fiscal year ended July 31, 2023, the Board met six times and it took action by unanimous written consent three times. During the fiscal year ended July 31, 2023, our Audit Committee met four times. Four of the directors attended 100% of the meetings of the Board, one director attended 90% and one director attended 70%.\nDirector Attendance at Annual Meeting\nWe believe the annual meeting of stockholders provides a good opportunity for our directors to hear any feedback the stockholders may share with the Company at the meeting. As a result, we encourage our directors to attend our annual meeting. We reimburse our directors for the reasonable expenses incurred by them in attending the annual meeting.\nExecutive Sessions\nExecutive sessions of our independent directors are held at each regularly scheduled meeting of our Board and at other times as necessary and are chaired by the Chairman of the Board. The Boards policy is to hold executive sessions without the presence of management, including our President and Chief Executive Officer, who is the only non-independent director on the Board. Our Board Committees also generally meet in executive session at the end of each committee meeting.\nBoard Committees\nCompensation Committee. The Compensation Committee of the Board currently consists of Messrs. Chen (Chair), Blotner and Rendall. The functions of the Compensation Committee include the approval of the compensation offered to our executive officers and recommending to the full Board the compensation to be offered to our directors, including our Chairman. The Board has determined that Messrs. Chen, Blotner and Rendall are each an independent director under the listing standards of the NYSE MKT. In addition, the members of the Compensation Committee qualify as a non-employee directors for purposes of Rule 16b-3 under the Exchange Act and as an outside director for purposes of Section 162(m) of the Internal Revenue Code of 1986, as amended. The Compensation Committee is governed by a written charter approved by the Board, a copy of which is available on our website at www.purebio.com.\nAudit Committee. The Audit Committee of the Board, currently consists of Messrs. Chen (Chair), Blotner and Rendall. The functions of the Audit Committee include the retention of our independent registered public accounting firm, reviewing and approving the planned scope, proposed fee arrangements and results of the Companys annual audit, reviewing the adequacy of the Companys accounting and financial controls and reviewing the independence of the Companys independent registered public accounting firm. The Board has determined that Messrs. Chen, Blotner and Rendall are each an independent director under the listing standards of the NYSE MKT. The Board has also determined that Messrs. Chen, Blotner and Rendall are each an audit committee financial expert within the applicable definition of the SEC. The Audit Committee is governed by a written charter approved by the Board, a copy of which is available on our website at www.purebio.com.\nNominating Committee. The Board has not established a Nominating Committee, and as a result performs the functions typically assigned to a Nominating Committee, including the identification, recruitment and nomination of candidates for the Board and its committees, determining the structure, composition and functioning of the Board and its committees including the reporting channels through which the Board receives information and the quality and timeliness of the information, developing and recommending to the Board corporate governance guidelines applicable to the Company and annually reviewing and recommending changes, as necessary or appropriate, overseeing the annual evaluation of the Boards effectiveness and performance.\nBoard and Committee Effectiveness\nThe Board and each of its Committees performs an annual self-assessment to evaluate their effectiveness in fulfilling their obligations. The Board and Committee evaluations cover a wide range of topics, including, among others, the fulfillment of the Board and Committee responsibilities identified in the Corporate Governance Guidelines and charters for each Committee.\nBoard Leadership Structure\nOur Bylaws provide our Board with flexibility to combine or separate the positions of Chairman of the Board and Chief Executive Officer in accordance with its determination that utilizing one or the other structure would be in the best interests of our company. At the current time, Mr. Chen serves as our Chairman of the Board, and Mr. Bartlett serves as our Chief Executive Officer. Our Board believes our leadership structure enhances the accountability of our Chief Executive Officer to the Board and encourages balanced decision making. In addition, the Board believes that this structure provides an environment in which its independent directors are fully informed, have significant input into the content of Board meetings and are able to provide objective and thoughtful oversight of management. Our Board also separated the roles in recognition of the differences in responsibilities. While our Chief Executive Officer is responsible for the day-to-day leadership of the Company and its business operations, the Chairman of the Board provides guidance to the Board, sets the agenda for Board meetings and presides over the meetings of the full Board and the meetings of the Boards non-management directors. The Board Chairman also provides performance feedback on behalf of the Board to our Chief Executive Officer. The Board intends to carefully evaluate from time to time whether our Chief Executive Officer and Chairman positions should remain separate based on what the Board believes is best for the Company and its stockholders.\nBoard Oversight of Risk\nThe Board is actively involved in the oversight of risks that could affect the Company. The Board as a whole has responsibility for risk oversight of the Companys risk management policies and procedures, with reviews of certain areas being conducted by the relevant Board committee. The Board satisfies this responsibility through reports by each Committee Chair regarding the Committees considerations and actions, as well as through regular reports directly from management responsible for oversight of particular risks within the Company. Specifically, the Board committees address the following risk areas:\n● The Compensation Committee is responsible for overseeing the management of risks related to the Companys executive compensation plans and arrangements.\n● The Audit Committee discusses with management the Companys major financial and other risk exposures and the steps management has taken to monitor and control such exposures.\nThe Board as a whole considers risks related to regulatory and compliance matters as well as risks related to the Companys sales and marketing and research and development initiatives.\nThe Board encourages management to promote a corporate culture that incorporates risk management into the Companys day-to-day business operations.\nStockholder Recommendations for Director Nominees\nIn nominating candidates for election as a director, the Board will consider a reasonable number of candidates recommended by a single stockholder who has held over 20% of PURE Bioscience common stock for over one year and who satisfies the notice, information and consent provisions set forth in our Bylaws and Corporate Governance Guidelines. Stockholders who wish to recommend a candidate may do so by writing to the Board in care of the Corporate Secretary, PURE Bioscience, Inc., 771 Jamacha Road, #512, El Cajon, California 92019. The Board will use the same evaluation process for director nominees recommended by stockholders as it uses for other director nominees. A printed copy of our Bylaws may be obtained by any stockholder upon request to our Corporate Secretary.\nIdentification and Evaluation of Director Nominees\nIn evaluating nominees for membership on our Board, our Board applies the Board membership criteria set forth in our Corporate Governance Guidelines. Under these criteria, the Board takes into account many factors, including an individuals business experience and skills (including skills in core areas such as operations, management, technology, accounting and finance, strategic planning and international markets), as well as independence, judgment, knowledge of our business and industry, professional reputation, leadership, integrity and ability to represent the best interests of the Companys stockholders. In addition, the Board also considers the ability to commit sufficient time and attention to the activities of the Board, as well as the absence of any potential conflicts with the Companys interests. The Board does not assign specific weights to particular criteria and no particular criterion is necessarily applicable to all prospective nominees. The Board does not have a formal policy with respect to diversity of nominees. Rather, our Board considers Board membership criteria as a whole and seeks to achieve diversity of occupational and personal backgrounds on the Board.\nOur Board regularly assesses the appropriate size of our Board, and whether any vacancies on our Board are expected due to retirement or otherwise. In the event that vacancies are anticipated, or otherwise arise, the Board will consider various potential candidates who may come to the attention of the Board through current Board members, professional search firms, stockholders or other persons. Each candidate brought to the attention of the Board, regardless of who recommended such candidate, is considered on the basis of the criteria set forth in our corporate governance guidelines. As stated above, our Board will consider candidates proposed for nomination by our significant stockholders. Stockholders may propose candidates by submitting the names and supporting information to: Corporate Secretary, PURE Bioscience, Inc., 771 Jamacha Road, #512, El Cajon, California 92019. Supporting information should include (a) the name and address of the candidate and the proposing stockholder, (b) a comprehensive biography of the candidate and an explanation of why the candidate is qualified to serve as a director taking into account the criteria identified in our corporate governance guidelines, (c) proof of ownership, the class and number of shares, and the length of time that the shares of our voting securities have been beneficially owned by each of the candidate and the proposing stockholder, and (d) a letter signed by the candidate stating his or her willingness to serve, if elected. Item 11. Executive Compensation\nSummary Compensation Table\nThe following table sets forth a summary of cash and non-cash compensation awarded, earned or paid for services rendered to us during the fiscal years ended July 31, 2023 and July 31, 2022 by our named executive officers, consisting of (i) each individual serving as principal executive officer during the fiscal year ended July 31, 2023 and (ii) our other two most highly compensated officers serving during the fiscal year ended July 31, 2023.\nName and Principal Position Fiscal Year Salary\n($)(1)\nBonus Option Awards\n($)(2)\nAll Other Compensation\n($)(3)\nTotal Compensation\n($)\nRobert Bartlett $ 109,000 $ 17,500 (4) $ - $ 3,300 $ 129,800\nChief Executive Officer $ - - $ - $ - $ -\nMark Elliott $ 180,000 - $ 15,000 (5) $ - $ 195,000\nVice President Finance $ 180,000 - $ - $ - $ 180,000\nTom Myers $ 200,000 - $ 37,000 (6) $ - $ 237,000\nExecutive Vice President of Technology & Development $ 200,000 - $ - $ - $ 200,000\nTom Y. Lee $ - - $ 48,000 (7) $ 44,000 $ 92,000\nChief Executive Officer $ - - $ - $ 74,000 $ 74,000\n(1) Amounts reflect salary earned during the respective fiscal years.\n(2) Amounts for the years ended July 31, 2023 and 2022 reflect the grant date fair value for financial statement reporting purposes with respect to stock options granted during the respective fiscal years, calculated in accordance with authoritative guidance.\n(3) Represents $3,300 in Board fees for Mr. Bartletts service prior to his appointment as Chief Executive Officer. Represents $30,000 in Board fees and $14,000 for medical insurance payments reimbursed to Mr. Lee during the fiscal year ended July 31, 2023. Represents $60,000 in Board fees and $14,000 for medical insurance payments reimbursed to Mr. Lee during the fiscal year ended July 31, 2022.\n(4) Represents a sign-on bonus paid to Mr. Bartlett upon his appointment as Chief Executive Officer.\n(5) Represents an award consisting of options to purchase 100,000 shares of common stock.\n(6) Represents two awards consisting of options to purchase 250,000 shares of common stock.\n(7) Represents two awards consisting of options to purchase 325,000 shares of common stock.\n(7) Mr. Lee resigned as Chief Executive Officer and President of the Company in March 2023.\nNarrative to Summary Compensation Table\nThe compensation program established for the Companys executive officers consisted of the following elements:\nBase Salary: The base salaries of our named executive officers depend on their job responsibilities, the market rate of compensation paid by companies in our industry for similar positions, our financial position and performance, and the strength of our business. Base salaries provide a fixed means of compensation in order to attract and retain talent. Mr. Lee received no base salary as Chief Executive Officer prior to his resignation in March 2023. The base salary for Mr. Bartlett was voluntary reduced from $300,000 per year to $200,000 per year during the fiscal year ended July 31, 2023. Mr. Elliotts base salary was $180,000 per year during the fiscal year ended July 31, 2023. The base salary for Mr. Myers was $200,000 per year during the fiscal year ended July 31, 2023.\nPerformance-Based Cash Awards: As part of the Companys executive compensation program, our executive officers are eligible to receive performance-based cash awards. The annual performance-based cash awards are based on the executive officers individual performance and the Companys actual performance compared to the corporate goals approved by the Board and the Compensation Committee. Following the end of each fiscal year, the Board and the Compensation Committee is responsible for determining the bonus amount payable to an executive officer based on that executive officers individual performance during the fiscal year and its determination of the Companys actual performance compared to the corporate goals established for that fiscal year. Due to the Companys limited financial resources and performance, our named executive officers did not receive any performance-based cash bonuses for the years ended July 31, 2023 and 2022.\nLong-Term Equity Awards: Equity ownership by our executive officers and key employees encourages them to create long-term value and aligns their interests with those of our stockholders. As a result, our executive compensation program provides for the issuance of stock options and restricted stock units, or RSUs, as determined by the Compensation Committee and our Board.\nOutstanding Equity Awards at Year-End\nThe following table provides a summary of all equity awards held by our named executive officers that were outstanding as of July 31, 2023. Mr. Bartlett did not receive any equity grants during the fiscal year ended July 31, 2023.\nOption Awards\nName Number of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nExercisable Number of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nUnexercisable Option\nExercise Price ($) Option\nExpiration Date\nTom Y. Lee (1) 150,000 50,000 $ 0.20 9/30/2032 (2)\n62,500 62,500 $ 0.20 9/30/2023 (2)\n150,000 - $ 0.45 6/18/2031 (3)\n200,000 - $ 0.45 6/18/2031 (3)\n350,000 - $ 0.79 5/15/2030 (4)\n200,000 - $ 0.33 1/29/2030 (4)\n150,000\n$ 0.29 10/1/2029 (4)\n200,000 - $ 1.19 6/22/2027 (5)\nMark Elliott 75,000 25,000 $ 0.20 9/30/2032 (6)\n100,000 - $ 0.45 6 /18/2031 (7)\n150,000 - $ 0.33 1 /29/2030 (8)\n150,000 - $ 0.79 5 /15/2030 (8)\nTom Myers 93,750 31,250 $ 0.20 9/30/2032 (9)\n62,500 62,500 $ 0.20 9/30/2023 (9)\n125,000 - $ 0.45 6 /18/2031 (10)\n125,000 - $ 0.33 1 /29/2030 (11)\n125,000 - $ 0.79 5 /15/2030 (11)\n(1) Mr. Lee resigned as Chief Executive Officer and President of the Company in March 2023.\n(2) During the year ended July 31, 2023, we granted Mr. Lee awards consisting of an option to purchase 325,000 shares of common stock. 200,000 options vest quarterly over one year. The remaining 125,000 options vest annually over two years. All 325,000 options have a ten-year term.\n(3) During the year ended July 31, 2021, we granted Mr. Lee awards consisting of an option to purchase 350,000 shares of common stock. 200,000 options vest quarterly over one year. The remaining 150,000 options vest quarterly over two years. All 350,000 options have a ten-year term.\n(4) During the year ended July 31, 2020, we granted Mr. Lee awards consisting of an option to purchase 700,000 shares of common stock. 500,000 options vest quarterly over one year. The remaining 200,000 options vest quarterly over two years. All 700,000 options have a ten-year term.\n(5) During the year ended July 31, 2017, we granted Mr. Lee a ten-year award consisting of an option to purchase 200,000 shares of common stock. 50% of the option vested January 15, 2018 with the remaining 50% vesting on January 15, 2019.\n(6) During the year ended July 31, 2023, we granted Mr. Elliott awards consisting of an option to purchase 100,000 shares of common stock. The options have a ten-year term and vest in four quarterly installments.\n(7) During the year ended July 31, 2021, we granted Mr. Elliott awards consisting of an option to purchase 100,000 shares of common stock. The options have a ten-year term and vest in four quarterly installments.\n(8) During the year ended July 31, 2020, we granted Mr. Elliott awards consisting of an option to purchase 300,000 shares of common stock. The options have a five-year term and vest in four quarterly installments.\n(9) During the year ended July 31, 2023, we granted Mr. Myers awards consisting of an option to purchase 250,000 shares of common stock. 125,000 options vest quarterly over one year. The remaining 125,000 options vest annually over two years. All 250,000 options have a ten-year term.\n(10) During the year ended July 31, 2021, we granted Mr. Myers awards consisting of an options to purchase 125,000 shares of common stock. The options have a ten-year term and vest in four quarterly installments.\n(11) During the year ended July 31, 2020, we granted Mr. Myers awards consisting of an options to purchase 250,000 shares of common stock. The options have a five-year term and vest in four quarterly installments.\nDuring the year ended July 31, 2023, Messrs. Lee, Myers and Elliott had 212,000, 156,250 and 75,000 option awards vest, respectively. There was no respective value on vesting.\nEmployment Agreements; Potential Payments Upon Termination or a Change in Control for Current Executive Officers\nOn March 15, 2023, we entered into an employment agreement with Robert Bartlett, or the Bartlett Employment Agreement, to serve as our Chief Executive Officer pursuant to which Mr. Bartlett was entitled to receive an annual base salary of $300,000, a one-time signing bonus of $17,500 and an option to purchase 500,000 shares of our Common Stock. During the fiscal year ended July 31, 2023, Mr. Bartletts salary was voluntarily reduced from $300,000 to $200,000. Mr. Bartletts employment is at will and may be terminated at any time, with or without case (as defined in the Bartlett Employment Agreement) with 30-days advance written notice.\nCode Section 162(m) Provisions\nSection 162(m) of the U.S. Internal Revenue Code, or the Code, generally disallows a tax deduction to public companies for compensation in excess of $1 million paid to the Chief Executive Officer or any of the four most highly compensated officers. Prior to changes in tax law taking effect in 2018, there was an exception to the $1.0 million limitation for performance-based compensation, including stock options, meeting certain requirements. Before such amendments we had not adopted a policy that all compensation must qualify as deductible under Section 162(m) of the Code. The exemption from the Section 162(m) deduction limit for performance-based compensation has been repealed, effective for taxable years beginning after December 31, 2017, such that compensation paid to our Chief Executive Officer and certain other executive officers in excess of $1.0 million will not be deductible unless it qualifies for transition relief applicable to certain arrangements in place as of November 2, 2017.\nCompensation of Directors\nThe following table sets forth compensation earned in the fiscal year ended July 31, 2023 by each of our non-employee directors who are not named executive officers.\nFees Earned\nor Paid in\nCash\nOption\nAwards\nTotal\nCompensation\nName ($) ($)(1) ($)\nIvan Chen $ 37,500 $ 22,250 $ 59,750\nDavid M. Rendall $ 33,250 $ 18,600 $ 51,850\nBernard Blotner $ 16,100\n$ 16,100\n(1) Amounts for the year ended July 31, 2023 reflect the grant date fair value for financial statement reporting purposes with respect to stock options granted during the fiscal year, calculated in accordance with authoritative guidance.\nNarrative to Director Compensation Table\nEach non-employee director of the Company receives cash fees from the Company for their services as members of the Board and any committee of the Board as follows:\n● Each non-employee director receives an annual fee of $30,000 payable for such directors service on the Board and each member of the Audit Committee and Compensation Committee receives an additional annual fee of $4,000 and $2,500, respectively, payable for such directors service on the committee.\n● The Chair of the Audit Committee receives an additional annual fee of $10,000 for such Chairs service and the Chair of the Compensation Committee receives an additional annual fee of $5,000 for such Chairs service.\nAnnual fees are normally paid to each non-employee director in four equal installments on a quarterly basis. Any non-employee directors serving a portion of the year are entitled to receive such fees on a pro rata basis based on their length of service during the year. Mr. Bartlett received $3,300 on a pro rata basis for his service on the Board prior to his appointment as Chief Executive Officer. Mr. Myers did not receive any additional compensation for his board service.\nAdditionally, new members of the Board are entitled to receive stock options in an amount to be determined by the Compensation Committee or the Board.\nDuring the fiscal year ended July 31, 2023, Messrs. Chen and Rendall received options to purchase 150,000 and 125,000 shares of common stock. The options vest fifty percent (50%) on the date of the next annual meeting and fifty percent (50%) on the date of the following years annual meeting. Mr. Blotner did not receive any equity awards during the fiscal year ended July 31, 2023\nIn the past, our Board has approved each year, generally in the first or second calendar quarter of the year, an annual option or stock grant for our non-employee directors. Any such grant is at the discretion of the Board, which considers the recommendation of our Compensation Committee. Upon the Boards approval of any such grant, each non-employee director generally may elect whether to receive the grant as an option or stock award. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table provides information regarding the beneficial ownership of our common stock as of October 30, 2023, or the Evaluation Date, by: (i) each of our current directors, (ii) each of our named executive officers as set forth in Item 11 of this Annual Report, (iii) all such directors and executive officers as a group and (iv) our five percent or greater stockholders. The table is based upon information supplied by our officers, directors and principal stockholders and a review of Schedules 13D and 13G, if any, filed with the SEC. Unless otherwise indicated in the footnotes to the table and subject to community property laws where applicable, we believe that each of the stockholders named in the table has sole voting and investment power with respect to the shares indicated as beneficially owned.\nApplicable percentages are based on 111,856,473 shares outstanding as of the Evaluation Date, adjusted as required by rules promulgated by the SEC. These rules generally attribute beneficial ownership of securities to persons who possess sole or shared voting power or investment power with respect to those securities. In addition, the rules include shares of our common stock issuable pursuant to the exercise of stock options or warrants or settlement of restricted stock units that are either immediately exercisable or exercisable within 60 days of the Evaluation Date. These shares are deemed to be outstanding and beneficially owned by the person holding those securities for the purpose of computing the percentage ownership of that person, but they are not treated as outstanding for the purpose of computing the percentage ownership of any other person.\nName (1) Number of\nShares\nBeneficially\nOwned\nPercent of\nCommon\nStock\nTom Y. Lee 45,475,625 (2) 40.08 %\nMark Elliott 547,350 (3) *\nTom Myers 1,381,350 (4) 1.22 %\nIvan Chen 1,400,000 (5) 1.24 %\nDavid M. Rendall 564,871 (6) *\nRobert Bartlett 50,000 (7) *\nBernard Blotner 10,000 (8) *\nAll of our named executive officers and directors as a group (7 persons) 49,429,196 (9) 42.54 %\n* Indicates less than one percent of the outstanding shares of the Companys common stock.\n(1) Unless, noted below, the address for each person listed in the table is c/o PURE Bioscience, Inc., 771 Jamacha Road, #512, El Cajon, California 92019.\n(2) Consists of 1,462,500 shares of common stock subject to options currently exercisable or exercisable within 60 days of the Evaluation Date, and 44,013,125 shares of common stock held directly by Mr. Lee and his affiliates.\n(3) Consists of 475,000 shares of common stock subject to options currently exercisable or exercisable within 60 days of the Evaluation Date, and 72,350 shares of common stock held directly by Mr. Elliott.\n(4) Consists of 531,250 shares of common stock subject to options currently exercisable or exercisable within 60 days of the Evaluation Date, and 850,100 shares of common stock held directly by Mr. Myers.\n(5) Consists of 650,000 shares of common stock subject to options currently exercisable or exercisable within 60 days of the Evaluation Date, and 750,000 shares of common stock held directly by Mr. Chen.\n(6) Consists of 162,500 shares of common stock subject to options currently exercisable or exercisable within 60 days of the Evaluation Date, and 402,371 shares of common stock held directly by Mr. Rendall.\n(7) Consists of 50,000 shares of common stock held directly by Mr. Bartlett.\n(8) Consists of 10,000 shares of common stock held directly by the Blotner Family 1998 Trust.\n(9) Consists of 3,281,250 shares of common stock subject to options currently exercisable or exercisable within 60 days of the Evaluation Date and 46,147,946 shares of common stock, held by all directors and executive officers as a group.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934, as amended, or the Act, requires our executive officers and directors and persons who beneficially own more than 10% of our Common Stock to file initial reports of beneficial ownership and reports of changes in beneficial ownership with the SEC. Such persons are required by SEC regulations to furnish us with copies of all Section 16(a) forms filed by such persons.\nTo the Companys knowledge, no person who, during the fiscal year ended July 31, 2023, was a director or officer of the Company, or beneficial owner of more than ten percent of the Companys Common Stock (which is the only class of securities of the Company registered under Section 12 of the Act), failed to file on a timely basis reports required by Section 16 of the Act during such fiscal year.\nInformation About Our Equity Compensation Plans\nEquity Incentive Plan\nIn February 2016, we amended and restated our 2007 Equity Incentive Plan, or the 2007 Plan, to, among other changes, increase the number of shares of common stock issuable under the 2007 Plan by 4,000,000 shares and extend the term of the 2007 Plan until February 4, 2026. The 2007 Plan provides for the grant of incentive and non-qualified stock options, as well as other share-based payment awards, to our employees, directors, consultants and advisors. These awards have up to a 10-year contractual life and are subject to various vesting periods, as determined by the Compensation Committee of the Board of Directors.\nEquity Incentive Plan\nIn January 2021, we amended and restated our 2017 Equity Incentive Plan, or the 2017 Plan, to, among other changes, increase the number of shares of common stock issuable under the 2017 Plan by 5,000,000 shares and extend the term of the 2007 Plan until January 2031. The 2017 Plan provides for the grant of incentive and non-qualified stock options, as well as other share-based payment awards, to our employees, directors, consultants and advisors. These awards have up to a 10-year contractual life and are subject to various vesting periods, as determined by the Compensation Committee of the Board of Directors.\nAll of our equity incentive plans are administered by the Compensation Committee. The exercise price for stock options is always at or above the fair market value of our common stock on the date the award is granted. Fair market value is defined by the Plan and is based on prevailing market prices of our common stock as reported by the OTCQB. The term of stock options granted and their vesting schedules are determined by the Compensation Committee, subject to any limitations defined in the Plan. The Compensation Committee also determines the vesting of other, non-option, stock awards.\nOn June 23, 2017 we filed a Form S-8 to register shares of common stock underlying equity awards granted to our directors and officers outside the 2007 Plan. The S-8 registered 3,150,000 shares with respect to RSUs and options, which were also granted on the same date.\nOn August 23, 2017 we filed a Form S-8 to register shares of common stock underlying equity awards granted to our directors, officers and consultants outside the 2007 Plan. The S-8 registered 850,000 shares with respect to RSUs and options, which were also granted on the same date.\nThe following table sets forth, as of July 31, 2023, information with respect to our equity compensation plans, and with respect to certain other options and warrants.\nPlan Category Number of\nsecurities to\nbe issued upon\nexercise of\noutstanding\noptions, warrants\nand rights (a)(1)\nWeighted average\nexercise price of\noutstanding\noptions, warrants\nand rights (b)\nNumber of\nsecurities\nremaining\navailable for\nfuture issuance\nunder equity\ncompensation\nplans (excluding\nsecurities\nreflected in\ncolumn (a)) (c)\nEquity compensation plans approved by stockholders 6,300,625 $ 0.44 5,722,000\nEquity compensation plans not approved by stockholders 400,000 1.15 -\nTotal 6,700,625 $ 0.48 5,722,000\n(1) Includes options only and does not include restricted stock units Item 13. Certain Relationships and Related Transactions, and Director Independence\nExcept as described below and other than Board or employment relationships and compensation resulting from those employment relationships, no director, executive officer, 5% stockholder or immediate family member of any of the foregoing, was a party to any transaction or series of transactions since August 1, 2021 (the beginning of the year ended July 31, 2022), or is to be a party to any currently proposed transaction or series of proposed transactions, in which (i) we were or are to be a participant, (ii) the amount involved exceeds the lesser of $120,000 or one percent of the average of our total assets at fiscal year-end for the fiscal years ended July 31, 2023 and 2022, which is $32,700, and (iii) any director, executive officer, or immediate family member of any of the foregoing had or will have a direct or indirect material interest.\nFor information with respect to the compensation paid to our executive officers and directors, see heading Executive Compensation of this annual report.\nOn July 29, 2019, we entered into the Sublease with SwabPlus, effective July 25, 2019, pursuant to which we subleased certain office and industrial space for our corporate headquarters. The premises are located in Rancho Cucamonga, California. In December 2020, the Sublease expired but we continued to rent on a month-to-month basis. Subsequent to July 31, 2023, our month-to month lease at the Rancho Cucamonga premises was terminated and we now operate completely remote.\nTom Y. Lee, our former Chief Executive Officer, Chairman of the Board and President, serves as chairman of the board of directors and chief executive officer of SwabPlus. Mr. Lee also serves as president of Hermosa Property, Inc., the landlord of the premises subject to the Sublease. The Sublease was considered by the Company in accordance with the Companys Related Party Transaction and Procedures Policy, and approved by the disinterested members of the Board.\nEquity Transactions with our Directors and Officers\nOn July 3, 2023, we entered the Private Placement Note Financing pursuant to which we entered into the Purchase Agreement with certain Lenders pursuant to which we issued the Lenders Notes with an aggregate principal balance of $1,015,000. The Notes Documents provide for subsequent closings for an aggregate offering size of $1.8 million in principal balance, of which we have issued an aggregate principal of $785,000 to the Lenders since the initial closing in July 2023. Messrs. Tom Y. Lee and Ivan Chen, each members of our Board invested $1,785,000 and $15,000, respectively, in the Private Placement, through affiliates or directly. The disinterested members of the Board approved the Private Placement. On October 20, 2023 we issued an additional Note pursuant to the Note Purchase Agreement in a subsequent closing with an aggregate principal of $785,000.\nOn July 15, 2022, we completed a closing, or the Closing, of a private placement financing, or the Private Placement Financing, to accredited investors, or the Investors. We raised $3.5 million in the Closing and issued an aggregate of 23,333,332 shares, or the Private Placement Shares, of our common stock at a purchase price of $0.15 per share. The Private Placement Shares issued in the Private Placement Financing were issued pursuant to a Securities Purchase Agreement, or the Securities Purchase Agreement, entered into with the Investors. Mr. Tom Y. Lee, our then-serving Chief Executive Officer and current member of our Board invested $3,261,250 through his affiliates. In addition, Ivan Chen and David Rendall, both members of our Board, invested $45,000 and $48,750, respectively. The disinterested members of our Board approved the Private Placement Financing.\nCompensation of Our Current Directors and Executive Officers\nFor information with respect to the compensation offered to our current directors and executive officers, please see the descriptions under the heading Executive Compensation of this Annual Report.\nRelated Party Transaction Policy and Procedures\nPursuant to our Related Party Transaction and Procedures, our executive officers, directors, and principal stockholders, including their immediate family members and affiliates, are prohibited from entering into a related party transaction with us without the prior consent of our Audit Committee or our independent directors. Any request for us to enter into a transaction with an executive officer, director, principal stockholder, or any of such persons immediate family members or affiliates, must first be presented to our Audit Committee for review, consideration and approval. In approving or rejecting the proposed agreement, our Audit Committee will consider the relevant facts and circumstances available and deemed relevant, including, but not limited, to the risks, costs and benefits to us, the terms of the transaction, the availability of other sources for comparable services or products, and, if applicable, the impact on a directors independence. Our Audit Committee shall approve only those agreements that, in light of known circumstances, are in, or are not inconsistent with, our best interests, as our Audit Committee determines in the good faith exercise of its discretion.\nCompensation Committee Interlocks and Insider Participation\nNone of the members of our Compensation Committee are or have been an officer or employee of us. During fiscal 2023, 2022 and 2021, no member of our Compensation Committee had any relationship with us requiring disclosure under Item 404 of Regulation S-K. Except as set forth above, none of our executive officers served on the compensation committee (or its equivalent) or board of directors of another entity any of whose executive officers served on our Compensation Committee or board of directors.\nBoard Composition\nWe are not currently listed on any national securities exchange or in an inter-dealer quotation system that has established a standard for independence. However, in evaluating the independence of our members and the composition of the committees of our Board of Directors, our Board utilizes the definition of independence as that term is defined by applicable listing standards of the NYSE MKT. As of the date of this Annual Report, our Board consists of six members, three of whom are considered independent as that term is defined by applicable listing standards of the NYSE MKT. Our independent directors include: Messrs. Chen, Blotner and Rendall.\nOur directors are appointed annually, and hold office until their successors have been elected and qualified or until their earlier death, resignation, disqualification, or removal. Item 14. Principal Accountant Fees and Services\nIndependent Registered Public Accounting Firms Fee Summary\nThe following table provides information regarding the fees billed to us by Weinberg & Company, P.A. for the years ended July 31, 2023 and 2022, respectively. All fees described below were approved by the Board or the Audit Committee:\nFor the years ended July 31,\nAudit Fees $ 102,000\n$ 107,000\nAudit-Related Fees $ - $ -\nTax Fees $ 24,000\n$ 17,000\nAll Other Fees $ - $ -\nTotal Fees $ 126,000\n$ 124,000\nAudit Fees: For the years ended July 31, 2023 and 2022, the aggregate audit fees billed by our independent public accounting firm were for services rendered for the audit and quarterly reviews of our financial statements, including our Annual Report on Form 10-K and our periodic reports, and fees incurred related to the filings of registration statements.\nAudit-Related Fees: For the years ended July 31, 2023 and 2022, there were no audit-related fees billed by our independent public accounting firm.\nTax Fees: consist of amounts billed by an affiliate of our independent auditors for services in connection with the preparation of our federal and state tax returns.\nAll Other Fees: For the years ended July 31, 2023 and 2022, there were no fees billed by our independent public accounting firm for other services, other than the fees described above.\nPre-Approval Policies and Procedures\nOur Audit Committees policy is to pre-approve all audit and permissible non-audit services provided by our independent auditors. These services may include audit services, audit-related services, tax services and other services. Pre-approval is generally provided for up to one year and any pre-approval is detailed as to the particular service or category of services. The independent auditor and management are required to periodically report to the Audit Committee regarding the extent of services provided by the independent auditor in accordance with this pre-approval. Any proposed services not included within the list of pre-approved services or any proposed services that will cause the Company to exceed the pre-approved aggregate amount requires specific pre-approval by the Audit Committee. All audit fees, audit-related fees, tax fees, and other fees listed in the table above were approved by the Audit Committee pursuant to its pre-approval policies and procedures.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a) (1)\nThe list of financial statements filed in response to Part II, Item 8 is set forth at the end of this Annual Report.\n(2)\nSchedules are omitted because they are not applicable or the required information is shown in the financial statements or notes thereto.\n(b)\nThe following exhibits are filed as part of this Annual Report pursuant to Item 601 of Regulation S-K:\n3.1\nCertificate of Incorporation of PURE Bioscience, Inc. (incorporated by reference to Exhibit 3.1 to the Annual Report on Form 10-K, filed with the SEC on October 29, 2012).\n3.1.1\nCertificate of Amendment to Certificate of Incorporation of PURE Bioscience, Inc. (incorporated by reference to Exhibit 3.1.1 to the Annual Report on Form 10-K, filed with the SEC on October 29, 2012).\n3.2\nBylaws of PURE Bioscience, Inc. (incorporated by reference to Exhibit 3.2 to the Annual Report on Form 10-K, filed with the SEC on October 29, 2012).\n3.2.1\nAmendment to the Bylaws of PURE Bioscience, Inc. (incorporated by reference to Exhibit 3.2.1 to the Annual Report on Form 10-K, filed with the SEC on October 29, 2012).\n4.1\nForm of Warrant (incorporated by reference to Exhibit 4.1 of the Current Report on Form 8-K filed with the SEC on December 7, 2016).\n4.2\nForm of Placement Agent Warrant (incorporated by reference to Exhibit 4.2 of the Current Report on Form 8-K filed with the SEC on December 7, 2016).\n4.3 *\nDescription of Capital Stock\n4.4\nForm of Convertible Promissory Note (incorporated by reference to Exhibit 4.1 of the Current Report on Form 8-K filed with the SEC on July 10, 2023).\n10.1\nAmended and Restated PURE Bioscience 2007 Equity Incentive Plan (incorporated by reference from Exhibit 10.1 to the Current Report on Form 8-K, filed with the SEC on February 5, 2016)\n10.2 #\nForm of Indemnification Agreement (incorporated by reference to Exhibit 10.2 to the Annual Report on Form 10-K filed with the SEC on October 24, 2013).\n10.3\nForm of Officer and Director Indemnification Agreement (incorporated by reference to Exhibit 10.2 of the Annual Report on Form 10-K filed with the SEC on October 24, 2013).\n10.4\nManufacturing Supply Agreement, dated June 21, 2019, by and between Pure Bioscience Inc. and Intercon Chemical Company (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on June 26, 2019).\n10.5 #\nForm of RSU Agreement between PURE Bioscience, Inc. and executive officers (incorporated by reference to Exhibit 10.32 of the Annual Report on Form 10-K filed with the SEC on October 28, 2015).\n10.6 #\nForm of Non-Employee Director RSU Agreement (Non-plan) (incorporated by reference to Exhibit 99.5 of the Current Report on Form 8-K filed with the SEC on June 23, 2017).\n10.7 #\nForm of Non-Employee Director Option Agreement (Non-plan) (incorporated by reference to Exhibit 99.6 of the Current Report on Form 8-K filed with the SEC on June 23, 2017).\n10.8 #\nPure Bioscience, Inc. 2017 Equity Incentive Plan (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on January 18, 2018).\n10.9\nPromissory Note, dated June 28, 2018, issued to Tom Y. Lee (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on July 2, 2018).\n10.10\nForm of Warrant Amendment (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on February 22, 2019).\n10.11\nForm of Amendment to Securities Purchase Agreement (incorporated by reference to Exhibit 10.2 of the Current Report on Form 8-K filed with the SEC on June 29, 2019).\n10.12\nForm of Securities Purchase Agreement (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on October 3, 2019).\n10.13\nSublease Agreement, effective July 25, 2019, by and between the Company and SwabPlus L.P. (incorporated by reference to Exhibit 10.2 of the Current Report on Form 8-K filed with the SEC on August 2, 2019).\n10.14\nForm of Securities Purchase Agreement (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SE on July 19, 2022).\n10.15\nForm of Note Purchase Agreement (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on July 10, 2023).\n10.16\nEmployment Agreement by and between the Registrant and Robert Bartlett, dated as of March 15, 2023.\n21.1\nSubsidiaries of the Registrant (incorporated by reference to Exhibit 21.1 to the Annual Report on Form 10-K, filed with the SEC on October 13, 2009)\n23.1 *\nConsent of Weinberg and Company, P.A.\n31.1 *\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2 *\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1 *\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2 *\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n*\nThe following materials from the Companys Annual Report on Form 10-K for the annual period ended July 31, 2023, formatted in iXBRL (Inline eXtensible Business Reporting Language): (i) Consolidated Balance Sheets as of July 31, 2023 and 2022; (ii) Consolidated Statements of Operations for the years ended July 31, 2023 and 2022; (iii) Consolidated Statements of Stockholders Equity for the years ended July 31, 2023 and 2022, (iv) Consolidated Statements of Cash Flows for the years ended July 31, 2023 and 2022; and (v) Notes to Consolidated Financial Statements.\n104*\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n* Filed herewith.\n# Management contract or compensatory plan or arrangement.\nCertain confidential portions of this exhibit were omitted by means of marking such portions with an asterisk because the identified confidential portions (i) are not material and (ii) would be competitively harmful if publicly disclosed. The Company hereby undertakes to provide further information regarding such redacted information to the Commission upon request.\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPURE BIOSCIENCE, INC.\nDATE\n/s/ Robert Bartlett\nOctober 30, 2023\nRobert Bartlett\nPresident and Chief Executive Officer\nPower of Attorney\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Robert Bartlett and Mark Elliott, and each of them, as his true and lawful attorney-in-fact and agent, with full power of substitution and resubstitution, for him and in his name, place and stead, in any and all capacities, to sign any and all amendments to this Annual Report on Form 10-K, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in connection therewith, as fully to all intents and purposes as he might or could do in person, hereby ratifying and confirming all that said attorneys-in-fact and agents, or any of them, or their or his substitutes, may lawfully do or cause to be done by virtue thereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report is signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nNAME\nTITLE\nDATE\n/s/ ROBERT BARTLETT\nPresident, Chief Executive Officer, Director\nOctober 30, 2023\nRobert Bartlett\nPrincipal Executive Officer\n/s/ MARK ELLIOTT\nVice President, Finance\nOctober 30, 2023\nMark Elliott\nPrincipal Financial and Accounting Officer\n/s/ IVAN CHEN\nChairman of the Board\nOctober 30, 2023\nIvan Chen\n/s/ TOM MYERS\nDirector\nOctober 30, 2023\nTom Myers\n/s/ DAVID RENDALL\nDirector\nOctober 30, 2023\nDavid Rendall\n/s/ TOM Y. LEE\nDirector\nOctober 30, 2023\nTom Y. Lee\n/s/ BERNARD BLOTNER\nDirector\nOctober 30, 2023\nBernard Blotner\nIndex to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm PCAOB ID NO: 572\nConsolidated Balance Sheets as of July 31, 2023 and 2022\nConsolidated Statements of Operations for the years ended July 31, 2023 and 2022\nConsolidated Statements of Stockholders Equity for the years ended July 31, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended July 31, 2023 and 2022\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors\nPure Bioscience Inc.\nRancho Cucamonga, Ca.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Pure Bioscience Inc. (the Company) and Subsidiaries as of July 31, 2023 and 2022, and the related statements of operations, stockholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the Company has suffered recurring losses from operations and negative cash flows from operating activities that raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nImpairment Assessment of Long-Lived Assets\nCritical Audit Matter Description\nThe Company reviews property, plant, and equipment (long-lived assets) for impairment whenever events or changes in circumstances, known as triggering events, indicate that the carrying amount of a long-lived asset or asset group, may not be recoverable. Management considers various factors when determining if long-lived assets should be evaluated for impairment, including a significant adverse change in the business climate or industry conditions, a current period operating or cash flow loss combined with a history of losses, a significant adverse change in the extent or manner in which an asset is used, or a current expectation that the asset will be sold or otherwise disposed of before the end of its useful life. The carrying value of property, plant, and equipment, net as of July 31, 2023 was $221,000. During fiscal year 2023, the Company recorded impairment charges of approximately $315,000 to its long-lived assets.\nWe identified the identification of impairment indicators for long-lived assets as a critical audit matter because of the significant assumptions management makes when determining whether events or circumstances have occurred indicating that the carrying amounts of property, plant and equipment may not be recoverable. This required a high degree of auditor judgment and an increased extent of effort when performing audit procedures to evaluate whether management appropriately identified impairment indicators.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the assessment of possible indicators of impairment included the following, among others:\n● We obtained an understanding of managements process of identifying events or circumstances that may indicate the carrying amount of long-lived assets may not be recoverable.\n● We evaluated the reasonableness of managements cash flow forecasts by comparing the forecasts to historical performance, considering actual financial performance and management expectations for future performance.\n● We recalculated the impairment recorded based on the excess of the carrying value of long-term assets over its estimated fair value as of July 31, 2023.\n● We assessed the appropriateness of the disclosures in the financial statements.\nWe have served as the Companys auditor since 2019.\n/s/ Weinberg and Company, P.A\nLos Angeles, California\nOctober 30, 2023\nPURE Bioscience, Inc.\nConsolidated Balance Sheets\nJuly 31, 2023 July 31, 2022\nAssets\nCurrent assets\nCash and cash equivalents $ 1,095,000 $ 3,391,000\nAccounts receivable 285,000 201,000\nInventories, net 88,000 179,000\nRestricted cash 75,000 75,000\nPrepaid expenses 61,000 18,000\nTotal current assets 1,604,000 3,864,000\nProperty, plant and equipment, net 221,000 620,000\nTotal assets $ 1,825,000 $ 4,484,000\nLiabilities and stockholders equity\nCurrent liabilities\nAccounts payable $ 422,000 $ 488,000\nAccrued liabilities 110,000 87,000\nTotal current liabilities 532,000 575,000\nLong-term liabilities\nNote payable to related parties 1,021,000 -\nTotal long-term liabilities 1,021,000 -\nTotal liabilities 1,553,000 575,000\nCommitments and contingencies - -\nStockholders equity\nPreferred stock, $0.01 par value: 5,000,000 shares authorized, no shares issued and outstanding - -\nCommon stock, $0.01 par value: 150,000,000 shares authorized, 111,856,473 shares issued and outstanding at July 31, 2023, and 111,356,473 shares issued and outstanding at July 31, 2022 1,119,000 1,114,000\nAdditional paid-in capital 132,398,000 132,079,000\nAccumulated deficit (133,245,000 ) (129,284,000 )\nTotal stockholders equity 272,000 3,909,000\nTotal liabilities and stockholders equity $ 1,825,000 $ 4,484,000\nSee accompanying notes.\nPURE Bioscience, Inc.\nConsolidated Statements of Operations\nYear ended\nJuly 31,\nNet product sales $ 1,871,000 $ 1,813,000\nRoyalty revenue 6,000 40,000\nTotal revenue 1,877,000 1,853,000\nCost of goods sold 906,000 853,000\nGross Profit 971,000 1,000,000\nOperating costs and expenses\nSelling, general and administrative 4,302,000 4,051,000\nResearch and development 297,000 319,000\nImpairment of fixed assets 315,000 55,000\nImpairment of intangibles - 299,000\nTotal operating costs and expenses 4,914,000 4,724,000\nLoss from operations (3,943,000 ) (3,724,000 )\nOther income (expense)\nInterest expense, net (14,000 ) (6,000 )\nOther income (expense), net (4,000 ) -\nGain on extinguishment of indebtedness, net - 239,000\nTotal other income (expense) (18,000 ) 233,000\nNet loss $ (3,961,000 ) $ (3,491,000 )\nBasic and diluted net loss per share $ (0.04 ) $ (0.04 )\nShares used in computing basic and diluted net loss per share 111,404,418 88,835,424\nSee accompanying notes.\nPURE Bioscience, Inc.\nConsolidated Statements of Stockholders Equity\nShares Amount Capital Deficit Equity\nCommon Stock Additional\nPaid-In Accumulated Total\nStockholders\nShares Amount Capital Deficit Equity\nBalance July 31, 2021 87,223,141 $ 873,000 $ 128,253,000 $ (125,793,000 ) $ 3,333,000\nIssuance of common stock in private placements to related parties, net 23,333,332 233,000 3,267,000\n3,500,000\nShare-based compensation expense - stock options - - 465,000 - 465,000\nShare-based compensation expense - restricted stock units - - 102,000 - 102,000\nIssuance of common stock for vested restricted stock units 800,000 8,000 (8,000 ) - -\nNet loss - - - (3,491,000 ) (3,491,000 )\nBalance July 31, 2022 111,356,473 $ 1,114,000 $ 132,079,000 $ (129,284,000 ) $ 3,909,000\nBalance 111,356,473 $ 1,114,000 $ 132,079,000 $ (129,284,000 ) $ 3,909,000\nShare-based compensation expense - stock options - - 262,000 - 262,000\nShare-based compensation expense - restricted stock units - - 62,000 - 62,000\nIssuance of common stock for vested restricted stock units 500,000 5,000 (5,000 ) - -\nNet loss - - - (3,961,000 ) (3,961,000 )\nBalance July 31, 2023 111,856,473 $ 1,119,000 $ 132,398,000 $ (133,245,000 ) $ 272,000\nBalance 111,856,473 $ 1,119,000 $ 132,398,000 $ (133,245,000 ) $ 272,000\nSee accompanying notes.\nPURE Bioscience, Inc.\nConsolidated Statements of Cash Flows\nYear Ended\nJuly 31,\nOperating activities\nNet loss $ (3,961,000 ) $ (3,491,000 )\nAdjustments to reconcile loss to net cash used in operating activities:\nShare-based compensation 324,000 567,000\nImpairment of fixed assets 315,000 55,000\nDepreciation and amortization 117,000 213,000\nReserve for inventory obsolescence 34,000 75,000\nImpairment of intangibles - 299,000\nGain on extinguishment of indebtedness - (239,000 )\nChanges in operating assets and liabilities:\nAccounts receivable (84,000 ) 167,000\nInventories 57,000 78,000\nPrepaid expenses (43,000 ) 14,000\nAccounts payable and accrued liabilities (43,000 ) (156,000 )\nInterest on note payable 6,000 -\nNet cash used in operating activities (3,278,000 ) (2,418,000 )\nInvesting activities\nPurchases of property, plant and equipment (33,000 ) (81,000 )\nNet cash used in investing activities (33,000 ) (81,000 )\nFinancing activities\nNet proceeds from note payable to related parties 1,015,000 -\nNet proceeds from the sale of common stock - 3,500,000\nNet cash provided by financing activities 1,015,000 3,500,000\nNet (decrease) and increase in cash, cash equivalents, and restricted cash (2,296,000 ) 1,001,000\nCash, cash equivalents, and restricted cash at beginning of year 3,466,000 2,465,000\nCash, cash equivalents, and restricted cash at end of year $ 1,170,000 $ 3,466,000\nReconciliation of cash, cash equivalents, and restricted cash to the consolidated balance sheets\nCash and cash equivalents $ 1,095,000 $ 3,391,000\nRestricted cash 75,000 75,000\nTotal cash, cash equivalents and restricted cash $ 1,170,000 $ 3,466,000\nSupplemental disclosure of cash flow information\nCash paid for taxes $ 5,000 $ 2,000\nSee accompanying notes.\nPURE Bioscience, Inc.\nNotes to Consolidated Financial Statements\n1. Organization and Business\nAll references to PURE, we, our, and us refer to PURE Bioscience, Inc. and our wholly owned subsidiary.\nPURE Bioscience, Inc. is focused on developing and commercializing our proprietary antimicrobial products that provide solutions to the health and environmental challenges of pathogen and hygienic control. Our technology platform is based on patented stabilized ionic silver, and our initial products contain silver dihydrogen citrate, or SDC. SDC is a broad-spectrum, non-toxic antimicrobial agent that is manufactured as a liquid delivered in various concentrations. We currently distribute and contract the manufacture and distribution of our SDC-based disinfecting and sanitizing products. We also contract manufacture and sell SDC-based formulations to manufacturers for use as a raw material ingredient in the production of personal care products. We believe our technology platform has potential application in a number of industries. We intend to focus our current resources on providing food safety solutions to the food industry.\nWe were incorporated in the state of California in August 1992 as Innovative Medical Services. In September 2003, we changed our name to PURE Bioscience. In March 2011, we reincorporated in the state of Delaware. We operate in one business segment.\nLiquidity and Going Concern\nWe have a history of recurring losses, and as of July 31, 2023 we have incurred a cumulative net loss of $133,245,000. During the fiscal year ended July 31, 2023, we recorded a net loss of $3,961,000 on recorded net revenue of $1,877,000. In addition, during the year ended July 31, 2023 we used $3,311,000 in operating and investing activities resulting in a cash balance of $1,095,000 as of July 31, 2023. Our history of recurring operating losses, and negative cash flows from operating activities give rise to substantial doubt regarding our ability to continue as a going concern. The financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classifications of liabilities that may result from our possible inability to continue as a going concern.\nOur future capital requirements depend on numerous forward-looking factors. These factors may include, but are not limited to, the following: the acceptance of, and demand for, our products; our success and the success of our partners in selling our products; our success and the success of our partners in obtaining regulatory approvals to sell our products; the costs of further developing our existing products and technologies; the extent to which we invest in new product and technology development; and the costs associated with the continued operation, and any future growth, of our business. The outcome of these and other forward-looking factors will substantially affect our liquidity and capital resources.\nUntil we can continually generate positive cash flow from operations, we will need to continue to fund our operations with the proceeds of offerings of our equity and debt securities. However, we cannot ensure that additional financing will be available when needed or that, if available, financing will be obtained on terms favorable to us or to our stockholders. If we raise additional funds from the issuance of equity securities, substantial dilution to our existing stockholders would likely result. If we raise additional funds by incurring debt financing, the terms of the debt may involve significant cash payment obligations as well as covenants and specific financial ratios that may restrict our ability to operate our business.\n2. Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying consolidated financial statements include the consolidated accounts of PURE Bioscience, Inc. and its wholly owned subsidiary, ETIH2O Inc., a Nevada corporation. ETIH2O Inc. has no business and no material assets or liabilities and there have been no significant transactions related to ETIH2O Inc. during the periods presented in the consolidated financial statements. All inter-company balances and transactions have been eliminated.\nRevenue Recognition\nEffective August 1, 2018, we adopted the Financial Accounting Standards Board or the FASB, Accounting Standards Codification or ASC, Topic 606, Revenue from Contracts with Customers or Topic 606. Under Topic 606, revenue is recognized at an amount that reflects the consideration to which we expect to be entitled in exchange for transferring goods or services to a customer. This principle is applied using the following 5-step process:\n1. Identify the contract with the customer\n2. Identify the performance obligations in the contract\n3. Determine the transaction price\n4. Allocate the transaction price to the performance obligations in the contract\n5. Recognize revenue when (or as) each performance obligation is satisfied\nUnder Topic 606, we recognize revenue when we satisfy a performance obligation by transferring control of the promised goods or services to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services.\nOur technology platform is based on patented stabilized ionic silver, and our initial products contain silver dihydrogen citrate, or SDC. SDC is a broad-spectrum, non-toxic antimicrobial agent, which offers residual protection and formulates well with other compounds. We sell various configurations and dilutions of SDC direct to customers and through distributors. We currently offer PURE® Hard Surface as a food contact surface sanitizer and disinfectant to restaurant chains, food processors and food transportation companies. We also offer PURE Control® as a direct food contact processing aid.\nContract terms for unit price, quantity, shipping and payment are governed by sales agreements and purchase orders which we consider to be a customers contract in all cases. The unit price is considered the observable stand-alone selling price for the arrangements. Any promotional or sales discounts are applied evenly to the units sold for purposes of calculating standalone selling price.\nProduct sales generally consist of a single performance obligation that we satisfy at a point in time. We recognize product revenue when the following events have occurred: (a) we have transferred physical possession of the products, (b) we have a present right to payment, (c) the customer has legal title to the products, and (d) the customer bears significant risks and rewards of ownership of the products.\nOur direct customer and distributor sales are invoiced based on received purchase orders. Our payment terms on invoiced direct customer and distributor sales range between 30 and 90 days after we satisfy our performance obligation. The majority of our customers are on 30 day payment terms. We currently offer no right of return on invoiced sales and maintain no allowance for sales returns.\nShipping and handling are treated as activities to fulfill promises to customers and any amounts billed to a customer, if applicable, represent revenues earned for the goods provided. Costs related to such shipping and handling billings are classified as cost of sales.\nWe do not have significant categories of revenue that may impact how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors.\nA summary of our revenue by product type for the fiscal years ended July 31, 2023 and 2022 is as follows:\nSummary of Revenue by Product\nJuly 31,\nPURE Hard Surface $ 1,786,000 $ 1,498,000\nSILVÉRION 85,000 315,000\nRevenue $ 1,871,000 $ 1,813,000\nVariable Consideration\nWe record revenue from customers in an amount that reflects the transaction price we expect to be entitled to after transferring control of those goods or services. From time to time, we offer sales promotions on our products such as discounts. Variable consideration is estimated at contract inception only to the extent that it is probable that a significant reversal of revenue will not occur.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America, or GAAP, requires management to make estimates and assumptions that affect the amounts reported in the consolidated financial statements, and the disclosures made in the accompanying notes to the consolidated financial statements. Actual results could differ materially from those estimates. Those estimates and assumptions include estimates for reserves of uncollectible accounts, inventory obsolescence, depreciable lives of property and equipment, analysis of impairments of recorded long-term tangible and intangible assets, realization of deferred tax assets, accruals for potential liabilities and assumptions made in valuing stock instruments issued for services.\nCash and Cash Equivalents\nCash and cash equivalents consist of cash and highly liquid investments with original maturities from the purchase date of three months or less.\nRestricted Cash\nThe Company is required to maintain $75,000 in a restricted certificate of deposit account in order to fully collateralize four revolving credit card accounts.\nAccounts Receivable\nTrade accounts receivable are recorded net of allowances for doubtful accounts. We evaluate the collectability of our trade accounts receivable based on a number of factors. In circumstances where we becomes aware of a specific customers inability to meet its financial obligations to the Company, a specific reserve for bad debts is estimated and recorded, which reduces the recognized receivable to the estimated amount the Company believes will ultimately be collected. In addition to specific customer identification of potential bad debts, bad debt charges are recorded based on our historical losses and an overall assessment of past due trade accounts receivable outstanding. Management determined no allowance for doubtful accounts was necessary at July 31, 2023 and 2022.\nInventories\nInventories are stated at the lower of cost or net realizable value, and net of a valuation allowance for potential excess or obsolete material. Cost is determined using the average cost method. We regularly review our inventory quantities on hand and record a provision for excess and obsolete inventory based primarily on our estimated forecast of product demand and our ability to sell the product(s) concerned. Demand for our products can fluctuate significantly. Factors that could affect demand for our products include unanticipated changes in consumer preferences, general market conditions or other factors, which may result in cancellations of advance orders or a reduction in the rate of reorders placed by customers. Additionally, our managements estimates of future product demand may be inaccurate, which could result in an understated or overstated provision required for excess and obsolete inventory. At July 31, 2023 and 2022, the Company determined that an additional reserve for inventory obsolescence of $34,000 and $75,000, respectively was required.\nProperty, Plant and Equipment\nProperty, plant and equipment is stated at cost less accumulated depreciation. Depreciation is computed using the straight-line method over the estimated useful lives of the assets. The estimated useful lives of our property, plant, and equipment range from three to ten years. Capitalized costs associated with leasehold improvements are depreciated over the lesser of the useful life of the asset or the remaining life of the lease. Depreciation is generally included in selling, general and administrative expense. Depreciation related to manufacturing is systematically allocated to inventory produced, and expensed through cost of goods sold at the time inventory is sold.\nManagement assesses the carrying value of property and equipment whenever events or changes in circumstances indicate that the carrying value may not be recoverable. If there is indication of impairment, management prepares an estimate of future cash flows expected to result from the use of the asset and its eventual disposition. If these cash flows are less than the carrying amount of the asset, an impairment loss is recognized to write down the asset to its estimated fair value. For the year ended July 31, 2023, management performed its annual impairment test and determined that its forecasted operations could no longer support $237,000 of manufacturing equipment previously capitalized as fixed assets, and as such an impairment was recognized. In addition, we wrote down $78,000 of construction in progress due to the termination of the Companys lease at its primary facility in Rancho Cucamonga, California. During the year ended July 31, 2022, we wrote down $55,000 of fixed assets destroyed by fire at a third-party location.\nPatents\nWe have filed a number of patent applications with the United States Patent and Trademark Office and in foreign countries. Certain legal and related costs incurred in connection with pending patent applications have been capitalized. Costs related to successful patent applications in prior years were capitalized and were amortized over the lesser of the remaining useful life of the related technology or the remaining patent life, commencing on the date the patent is issued. Costs related to patent applications are expensed in the period and recorded as a component of selling, general and administrative expense.\nImpairment of Long-Lived Assets\nIn accordance with GAAP, if indicators of impairment exist, we assess the recoverability of the affected long-lived assets, including our capitalized patent costs, by determining whether the carrying value of such assets can be recovered through undiscounted future operating cash flows. If impairment is indicated, we measure the amount of such impairment by comparing the carrying value of the asset to the fair value of the asset and we record the impairment as a reduction in the carrying value of the related asset and a charge to operating results. Estimating the undiscounted future cash flows associated with long-lived assets requires judgment, and assumptions could differ materially from actual results. As of July 31, 2023, management performed its annual impairment test and determined that its forecasted operations could no longer support $237,000 of manufacturing equipment previously capitalized as fixed assets, and as such an impairment was recognized. In addition, we wrote down $78,000 of construction in progress due to the termination of the Companys lease at its primary facility in Rancho Cucamonga, California. As of July 31, 2022, management performed its annual impairment test and determined that its forecasted operations could no longer support the $299,000 carrying value of previously capitalized patents, and as such all amounts were impaired.\nShipping and Handling Costs\nShipping and handling costs incurred by us for product shipments are included in cost of goods sold.\nResearch and Development Costs\nResearch and development costs are expensed as incurred.\nShare-Based Compensation\nWe periodically issue stock options and restricted stock awards to employees and non-employees in non-capital raising transactions for services and for financing costs. We account for such grants issued and vesting to employees based on ASC 718, whereby the value of the award is measured on the date of grant and recognized as compensation expense on the straight-line basis over the vesting period.\nWe estimate the fair value of share-based payment awards at the date of grant using the Black-Scholes option valuation model. The Black-Scholes option valuation model requires the input of subjective assumptions, including price volatility of the underlying stock, risk-free interest rate, dividend yield, and expected life of the option. Share-based compensation expense is based on awards ultimately expected to vest, and therefore is reduced by expected forfeitures.\nFair Value Measurements\nThe Company determines the fair value of its assets and liabilities based on the exchange price in U.S. dollars that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value maximize the use of observable inputs and minimize the use of unobservable inputs. The Company uses a fair value hierarchy with three levels of inputs, of which the first two are considered observable and the last unobservable, to measure fair value:\n● Level 1 - Quoted prices in active markets for identical assets or liabilities.\n● Level 2 - Inputs, other than Level 1, that are observable, either directly or indirectly, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\n● Level 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nThe carrying amounts of financial instruments such as cash, accounts receivable, inventories, accounts payable and accrued liabilities, approximate the related fair values due to the short-term maturities of these instruments.\nConcentrations\nGross sales. For the year ended July 31, 2023, one individual customer accounted for 24% of our net product sales. No other individual customer accounted for 10% or more of our net product sales. The geographic breakdown of net product sales was as follows: 100% U.S. For the year ended July 31, 2022, three individual customers accounted for 14%, 13% and 10% of our net product sales. No other individual customer accounted for 10% or more of our net product sales. The geographic breakdown of net product sales was as follows: 100% U.S.\nAccounts receivable. As of July 31, 2023, we had accounts receivable from two customers that comprised 28% and 17% of total accounts receivable, respectively. As of July 31, 2022, we had accounts receivable from one customer that comprised 15% of total accounts receivable and two customers that comprised 13% of total accounts receivable, respectively.\nPurchases. For the fiscal year ended July 31, 2023, one vendor accounted for 19% of our purchases. For the fiscal year ended July 31, 2022, one vendor accounted for 19% of our purchases.\nAccounts payable. As of July 31, 2023, one vendor accounted for 29% of the total trade accounts payable. As of July 31, 2022, one vendor accounted for 25% of the total trade accounts payable.\nIncome Taxes\nWe recognize deferred tax assets and liabilities for temporary differences between the tax basis of assets and liabilities and the amounts at which they are carried in the financial statements based upon the enacted tax rates in effect for the year in which the differences are expected to reverse. A valuation allowance is established to reduce deferred tax assets to the amount expected to be realized.\nIncome (Loss) Per Share\nBasic net loss per common share is computed as net loss divided by the weighted average number of common shares outstanding for the period. Our diluted net loss per common share is the same as our basic net loss per common share because we incurred a net loss during each period presented, and the potentially dilutive securities from the assumed exercise of all outstanding stock options, restricted stock units, and warrants would have an anti-dilutive effect. As of July 31, 2023 and 2022, stock options, shares issuable upon the conversion of debt, and shares issuable under restricted stock unit awards of 14,220,381 and 7,291,625, respectively, have been excluded from the computation of diluted shares outstanding.\nSegments\nWe operate in one segment for the manufacture and distribution of our products. In accordance with the Segment Reporting Topic of the ASC, our chief operating decision maker has been identified as the Chief Executive Officer and President, who reviews operating results to make decisions about allocating resources and assessing performance for the entire Company. Existing guidance, which is based on a management approach to segment reporting, establishes requirements to report selected segment information quarterly and to report annually entity-wide disclosures about products and services, major customers, and the countries in which the entity holds material assets and reports revenue. All material operating units qualify for aggregation under Segment Reporting due to their similar customer base and similarities in: economic characteristics; nature of products and services; and procurement, manufacturing and distribution processes. Since the Company operates in one segment, all financial information required by Segment Reporting can be found in the accompanying financial statements.\nReclassification\nFor the fiscal year ended July 31, 2022, $55,000 of selling, general and administrative expense has been reclassified as impairment of fixed assets. This reclassification did not have an impact on our results of operations or financial condition for the fiscal year ended July 31, 2023 and 2022.\nRecent Accounting Pronouncements\nIn June 2016, the FASB issued ASU No. 2016-13, Credit Losses - Measurement of Credit Losses on Financial Instruments or ASC 326. The standard significantly changes how entities will measure credit losses for most financial assets, including accounts and notes receivable. The standard will replace todays incurred loss approach with an expected loss model, under which companies will recognize allowances based on expected rather than incurred losses. Entities will apply the standards provisions as a cumulative-effect adjustment to retained earnings as of the beginning of the first reporting period in which the guidance is effective. As small business filer, the standard will be effective for us for interim and annual reporting periods beginning after December 15, 2022. The Company is currently assessing the impact of adopting this standard on the Companys financial statements and related disclosures.\nIn May 2021, the FASB issued ASU 2021-04, Earnings Per Share (Topic 260), Debt - Modifications and Extinguishments (Subtopic 470-50), Compensation - Stock Compensation (Topic 718), and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40): Issuers Accounting for Certain Modifications or Exchanges of Freestanding Equity-Classified Written Call Options or ASU 2021-04. ASU 2021-04 provides guidance as to how an issuer should account for a modification of the terms or conditions or an exchange of a freestanding equity-classified written call option (i.e., a warrant) that remains classified after modification or exchange as an exchange of the original instrument for a new instrument. An issuer should measure the effect of a modification or exchange as the difference between the fair value of the modified or exchanged warrant and the fair value of that warrant immediately before modification or exchange and then apply a recognition model that comprises four categories of transactions and the corresponding accounting treatment for each category (equity issuance, debt origination, debt modification, and modifications unrelated to equity issuance and debt origination or modification). ASU 2021-04 is effective for all entities for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. The adoption of ASU 2021-04 did not have any impact on the Companys consolidated financial statement presentation or disclosures.\nRecent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the Securities and Exchange Commission did not or are not believed by management to have a material impact on the Companys present or future consolidated financial statement presentation or disclosures.\n3. Balance Sheet Details\nInventories consist of the following:\nSchedule of Inventories\nJuly 31,\nRaw materials $ 11,000 $ 19,000\nFinished goods 77,000 160,000\nInventories $ 88,000 $ 179,000\nInventories at July 31, 2023 and 2022, are net of a reserve for inventory obsolescence of $259,000 and $225,000, respectively.\nProperty, plant, and equipment consist of the following:\nSchedule of Property Plant and Equipment\nJuly 31,\nComputers and equipment $ 1,615,000 $ 1,582,000\nConstruction in progress - 78,000\nProperty, plant, and equipment, gross 1,615,000 1,660,000\nLess accumulated depreciation (1,394,000 ) (1,040,000 )\nProperty, plant, and equipment, net $ 221,000 $ 620,000\nAs of July 31, 2023, management performed its annual impairment test and determined that its forecasted operations could no longer support $237,000 of manufacturing equipment previously capitalized as fixed assets, and as such an impairment was recognized. In addition, we wrote down $78,000 of construction in progress due to the termination of the Companys lease at its primary facility in Rancho Cucamonga, California.\nDepreciation expense for the years ended July 31, 2023 and 2022 was $117,000 and $146,000, respectively.\n4. Commitments and Contingencies\nLegal\nFrom time to time, we could become involved in disputes and various litigation matters that arise in the normal course of business. Lawsuits against us or our officers or directors by employees, former employees, stockholders, partners, customers, or others, or actions taken by regulatory authorities, could be very costly and substantially disrupt our business. Such lawsuits and actions are not uncommon, and we may not be able to resolve such disputes or actions on terms favorable to us, and there may not be sufficient capital resources available to defend such actions effectively, or at all. As of July 31, 2023, there were no material lawsuits against the Company.\nManufacturing\nEffective June 9, 2019, we entered into a five-year manufacturing supply agreement with Intercon Chemical Company or ICC with a three-year renewal term option or the Manufacturing Supply Agreement. The agreement consists of manufacturing, packaging, and distribution of PUREs SDC-based products and contains no mandatory purchase commitment levels. The Manufacturing Supply Agreement provides:\n● ICC licenses PUREs patents and technology know-how for the non-exclusive manufacture of PUREs SDC-based products.\n● ICC will invest in plant improvements to allow for expanded SDC production.\n● ICCs R&D team will collaborate on SDC product line development.\nThe Manufacturing Supply Agreement may be terminated by mutual written consent, or by either party upon the material breach of the terms of the agreement by the other party.\nSilver is the primary active ingredient in SDC and is a readily available commodity. The other active and inactive ingredients in our products are readily available from multiple sources.\n5. Debt\nNote Purchase Agreement with Related Parties\nOn July 3, 2023, the Company entered into a Note Purchase Agreement (the Note Purchase Agreement) with certain accredited investors (Lenders) pursuant to which the Company issued the Lenders convertible promissory notes (the Notes, collectively with the Note Purchase Agreement, the Note Documents) with an aggregate principal balance of $1,015,000 (the Private Placement).The Note Documents provide for subsequent closings for an aggregate offering size of $1.8 million in principal balance. Messrs. Tom Y. Lee and Ivan Chen, each members of the Companys Board of Directors (the Board) invested $1,000,000 and $15,000 respectively in the Private Placement, through affiliates or directly. The disinterested members of the Board approved the Private Placement.\nThe Note Documents provided that the interest to the Lender shall accrue at the rate of 7.55%, compounded annually. The Maturity Date (as defined in the Notes) of the Notes is the third-year anniversary of the date of issuance, or such earlier date as the Notes provide.\nConversion. All or any portion of the principal amount of the Note, plus accrued and unpaid interest, is convertible at any time, in whole or in part, at a Lenders or the Companys option, into shares of the Companys common stock at a conversion price equal to the 30-day volume-weighted average price of the Companys common stock as reported on the market or exchange on which the Companys common stock is listed or quoted for trading (the VWAP) on the date of conversion on the last trading day prior to the date of conversion, provided that such conversion price is at least $0.15 per share and less than or equal to $0.23 per share, subject to certain customary adjustments. Additionally, at any time following July 3, 2024, the holders of a majority of the outstanding principal balance under the Notes may elect specified in writing to convert all of the Notes at a conversion price equal to the VWAP, provided that the conversion price is equal to at least $0.15 per share, subject to certain customary adjustments.\nFurther, in the event of certain corporate transactions, all outstanding principal and unpaid accrued interest due on such Notes shall be automatically converted into conversion shares on the trading day immediately prior to the closing date of such corporate transaction. The number of shares to be issued upon such conversion shall be based on the VWAP on the last trading day prior to the public announcement of the execution of the definitive documents with respect to such transaction.\nEvents of Default. The Notes Documents provide for certain events of default that are typical for a transaction of this type, including, among other things, default in the payment of principal or interest for more than 30 days, the Companys making an assignment for the benefit of creditors, within 15 days after the commencement of bankruptcy proceedings against the Company, or breach of certain covenants described below.\nCovenants. The Company will be subject to certain customary covenants regarding the current public information, reservation of adequate share reserve, and maintenance of intellectual property rights, among other customary matters.\nDuring the year ended July 31, 2023, interest of $6,000 was added to the principal resulting in a balance owed of $1,021,000 at July 31, 2023.\nReceipt of CARES funding\nIn April 2021, we were funded $239,000 under the Payroll Protection Program (PPP) through California Bank and Trust. The PPP was established as part of the Coronavirus Aid, Relief and Economic Security Act (the CARES Act) and is administered by the U.S. Small Business Administration. The CARES Act was established in order to enable small businesses to pay employees during the economic slowdown caused by COVID-19 by providing forgivable loans to qualifying businesses for up to 2.5 times their average monthly payroll costs. The amount borrowed under the CARES Act is eligible to be forgiven provided that (a) the Company uses the PPP Funds during the eight week period after receipt thereof, and (b) the PPP Funds are only used to cover payroll costs (including benefits), rent, mortgage interest, and utility costs. The amount of loan forgiveness will be reduced if, among other reasons, the Company does not maintain staffing or payroll levels. Principal and interest payments on any unforgiven portion of the PPP Funds (the PPP Loan) will be deferred for six months and will accrue interest at a fixed annual rate of 1.0% and carry a two year maturity date. There is no prepayment penalty on the CARES Act Loan.\nDuring the fiscal year ended July 31, 2022, we applied and received loan forgiveness under the provisions of the CARES Act for the entire $239,000 loan. This amount was recorded as a gain on extinguishment of indebtedness on the Consolidated Statement of Operations during the fiscal year ended July 31, 2022.\n6. Stockholders Equity\nPreferred Stock\nAs of July 31, 2023, the Companys Board of Directors is authorized to issue 5,000,000 shares of preferred stock with a par value of $0.01 per share, in one or more series. As of July 31, 2023, and July 31, 2022, there were no shares of preferred stock issued and outstanding.\nCommon Stock\nAs of July 31, 2023, 150,000,000 shares of common stock with a par value of $0.01 per share are authorized for issuance.\nPrivate Placement Financing from Related Parties - Fiscal Year 2022\nOn July 15, 2022, we completed a closing or (the Closing) of a private placement financing or the Private Placement Financing, to accredited investors or the Investors. We raised $3.5 million in the Closing and issued an aggregate of 23,333,332 shares (collectively, the Shares) of our common stock at a purchase price of $0.15 per share. The Shares issued in the Private Placement Financing were issued pursuant to a Securities Purchase Agreement or the Securities Purchase Agreement entered into with the Investors. Mr. Tom Y. Lee, President, Chief Executive Officer and a member of the Companys Board of Directors or the Board invested $3,261,250 through his affiliates. In addition, Ivan Chen and David Rendall, both members of the Board, invested $45,000 and $48,750, respectively. The disinterested members of the Board approved the Private Placement Financing.\nThe issuance and sale of the Shares was not registered under the Securities Act of 1933, as amended or the Securities Act, and these Shares may not be offered or sold in the United States absent registration under or exemption from the Securities Act and any applicable state securities laws. The Shares were issued and sold in reliance upon an exemption from registration afforded by Section 4(a)(2) of the Securities Act and Rule 506 of Regulation D promulgated under the Securities Act. The Investors represented to the Company that each was an accredited investor within the meaning of Rule 501 of Regulation D under the Securities Act, and that each was receiving the Shares for investment for its own account and without a view to distribute them.\n7. Share-Based Compensation\nRestricted Stock Units\nWe issue restricted stock unit awards or RSUs, to key management and as compensation for services to consultants and others. The RSUs typically vest over a one to three-year period and carry a ten-year term. Each RSU represents the right to receive one share of common stock, issuable at the time the RSU subsequently settles, as set forth in the Restricted Stock Unit Agreement. We determine that fair value of those awards at the date of grant, and amortize those awards as an expense over the vesting period of the award. The shares earned under the grant are usually issued when the award settles at the end of the term. As of July 31, 2021, there were 1,212,500 RSUs granted of which 1,679,167 were issuable.\nDuring the fiscal years ended July 31, 2023 and 2022, we recognized $62,000 and $102,000 of compensation cost relating to the vesting of RSUs, respectively. In addition, during the fiscal year ended July 31, 2023 and 2022, 166,667 and 166,666 RSUs vested, respectively. As of July 31, 2023, there no unrecognized non-cash compensation cost related to RSUs.\nDuring the fiscal year ended July 31, 2023 and 2022, 500,000 and 800,000 RSUs were delivered. All of the remaining 712,500 RSUs outstanding are vested and issuable as of July 31, 2023. These RSUs are issued upon settlement date which is defined as for each Vested Unit, the earliest of (i) the ten-year anniversary of the Grant Date; (ii) sixty days after the date the Grantees Service ceases for any reason and such cessation constitutes a separation from service within the meaning of Section 409A of the Code; (iii) the date of Grantees death or (iv) the date of a Change in Control that constitutes a change in control event within the meaning of Section 409A of the Code.\nA summary of our restricted stock unit activity and related data is as follows:\nSchedule of Restricted Stock Activity\nTotal RSU Shares Vested and Issuable\nOutstanding at July 31, 2021 2,012,500 1,679,167\nGranted - -\nVested - 166,666\nDelivered (800,000 ) (800,000 )\nForfeited - -\nOutstanding at July 31, 2022 1,212,500 1,045,833\nGranted - -\nVested - 166,667\nDelivered (500,000 ) (500,000 )\nForfeited - -\nOutstanding at July 31, 2023 712,500 712,500\nStock Option Plans\nEquity Incentive Plan\nIn February 2016, we amended and restated our 2007 Equity Incentive Plan, or the 2007 Plan, to, among other changes, increase the number of shares of common stock issuable under the 2007 Plan by 4,000,000 shares and extend the term of the 2007 Plan until February 4, 2026. The 2007 Plan provides for the grant of incentive and non-qualified stock options, as well as other share-based payment awards, to our employees, directors, consultants and advisors. These awards have up to a 10-year contractual life and are subject to various vesting periods, as determined by the Compensation Committee of the Board of Directors. As of July 31, 2023, there were approximately 971,000 shares available for issuance under the 2007 Plan.\nEquity Incentive Plan\nIn January 2021, we amended and restated our 2017 Equity Incentive Plan, or the 2017 Plan, to, among other changes, increase the number of shares of common stock issuable under the 2017 Plan by 5,000,000 shares and extend the term of the 2007 Plan until January 2031. The 2017 Plan provides for the grant of incentive and non-qualified stock options, as well as other share-based payment awards, to our employees, directors, consultants and advisors. These awards have up to a 10-year contractual life and are subject to various vesting periods, as determined by the Compensation Committee of the Board of Directors. As of July 31, 2023, there were approximately 4,751,000 shares available for issuance under the 2017 Plan.\nStock Option Activity\nDuring the fiscal year ended July 31, 2023, the Compensation Committee of the Board of Directors granted 1,935,000 stock options to our employees, officers, directors and consultants with a fair value of $241,000 as determined by the Black Scholes option pricing model. The vesting terms of the options vary between one and two years and carry a ten year term.\nDuring the fiscal year ended July 31, 2022, the Compensation Committee of the Board of Directors granted 170,000 stock options to new employees. The options have a fair value of $36,000, as determined by the Black Scholes option pricing model, vest between one and three years and carry a ten-year term.\nA summary of our stock option activity for the fiscal years ended July 31, 2023 and 2022 is as follows:\nSchedule of Stock Option Activity\nShares Weighted-\nAverage\nExercise Price Aggregate\nIntrinsic\nValue\nOutstanding at July 31, 2021 8,644,125 $ 0.76 $ 124,000\nGranted 170,000 $ 0.29 -\nExercised - $ - -\nCancelled (2,735,000 ) $ 1.04 -\nOutstanding at July 31, 2022 6,079,125 $ 0.62 $ -\nGranted 1,935,000 $ 0.20 -\nExercised - $ - -\nCancelled (1,313,500 ) $ 0.69 -\nOutstanding at July 31, 2023 6,700,625 $ 0.48 $ -\nSchedule of Stock Option Outstanding and Exercisable\nOutstanding Exercisable\nRange of Exercise Prices Number of Shares Outstanding Weighted Average Remaining Contractual Life\n(in years) Weighted Average Exercise Price Number of Shares Exercisable Weighted Average Remaining Contractual Life\n(in years) Weighted Average Exercise Price\n$0.22 to $0.50 4,725,625 7.86 $ 0.32 4,105,208 7.68 $ 0.34\n$0.51 to $1.00 1,515,000 6.10 $ 0.76 1,515,000 6.10 $ 0.76\n$1.01 to $1.40 460,000 3.84 $ 1.17 460,000 3.84 $ 1.17\n6,700,625 7.19 $ 0.48 6,080,208 6.99 $ 0.51\nThe weighted average expected term of options outstanding at July 31, 2023 was 7.39 years.\nFor the fiscal year ended July 31, 2023 share-based compensation expense for stock options vesting during the period was $262,000. For the fiscal year ended July 31, 2022 share-based compensation expense for stock options vesting during the period was $465,000.\nAt July 31, 2023, options to purchase 6,080,208 shares of common stock were exercisable. These options had a weighted-average exercise price of $0.51 and a weighted average remaining contractual term of 6.99 years. The weighted average grant date fair value for options granted during the fiscal year ended July 31, 2023 was $0.15. The total unrecognized compensation cost related to unvested stock option grants as of July 31, 2023 was approximately $45,000 and the weighted average period over which these grants are expected to vest is 0.40 years. The intrinsic value of options outstanding at July 31, 2023 was zero.\nWe use the Black-Scholes valuation model to calculate the fair value of stock options. Share-based compensation expense is recognized over the vesting period using the straight-line method. The fair value of stock options was estimated at the grant date using the following weighted average assumptions:\nSchedule of Fair Value Assumptions\nFor the years ended\nJuly 31,\nVolatility 91.90 % 88.35 %\nRisk-free interest rate 4.00 % 1.17 %\nDividend yield 0.0 % 0.0 %\nExpected life 5.34 years 5.59 years\nVolatility is the measure by which our stock price is expected to fluctuate during the expected term of an option. Volatility is derived from the historical daily change in the market price of our common stock, as we believe that historical volatility is the best indicator of future volatility.\nThe risk-free interest rates used in the Black-Scholes calculations are based on the prevailing U.S. Treasury yield as determined by the U.S. Federal Reserve.\nWe have never paid dividends on our common stock and do not anticipate paying dividends on our common stock in the foreseeable future. Accordingly, we have assumed no dividend yield for purposes of estimating the fair value of our share-based compensation.\nThe weighted average expected life of options was estimated using the average of the contractual term and the weighted average vesting term of the options. Certain options granted to consultants are subject to variable accounting treatment and are required to be revalued until vested.\n8. Related Party Transactions\nOn July 29, 2019, we entered into a Sublease Agreement or the Sublease with SwabPlus L.P. or SwabPlus, effective July 25, 2019, pursuant to which we subleased certain office and industrial space for our corporate headquarters. The premises are located in Rancho Cucamonga, California. In December 2020, the Sublease expired but we continued to rent on a month-to-month basis. Subsequent to July 31, 2023, our month-to month lease at the Rancho Cucamonga was terminated. The Company now operates 100% virtually.\nRent expense, including common area maintenance and real property taxes related to the SwabPlus lease, was $142,000 and $87,000 for the years ended July 31, 2023 and 2022, respectively. Tom Y. Lee, the Companys Chief Executive Officer, Chairman of the Board and President, also serves as chairman of the board of directors and chief executive officer of SwabPlus. Mr. Lee also serves as president of Hermosa Property, Inc., the landlord of the premises subject to the Sublease. The Sublease was considered by the Company in accordance with the Companys Related Party Transaction and Procedures Policy, and approved by the disinterested members of the Board.\nAs of July 31, 2023 and July 31, 2022, accounts payable include $103,000 and $182,000 in board fees due to officers and directors, respectively.\nOn July 3, 2023, we entered into the Note Purchase Agreement (see Note 5) with certain Lenders pursuant to which the Company issued the Lenders Notes, with an aggregate principal balance of $1,015,000. The Note Documents provide for subsequent closings for an aggregate offering size of $1.8 million in principal balance. Messrs. Tom Y. Lee and Ivan Chen, each members of the Companys Board of Directors (the Board) invested $1,000,000 and $15,000 respectively in the Private Placement, through affiliates or directly. The disinterested members of the Board approved the Private Placement. Interest expense on the notes payable was $6,000 during the year ended July 31, 2023. On October 20, 2023 we issued an additional Note with an aggregate principal of $785,000 to Mr. Lee pursuant to the Note Purchase Agreement in a subsequent closing.\nOn July 15, 2022, we completed a closing (the Closing) of a private placement financing (the Private Placement Financing) to accredited investors (the Investors). We raised $3.5 million in the Closing and issued an aggregate of 23,333,332 shares (collectively, the Shares) of our common stock at a purchase price of $0.15 per share. The Shares issued in the Private Placement Financing were issued pursuant to a Securities Purchase Agreement (the Securities Purchase Agreement) entered into with the Investors. Mr. Tom Y. Lee, Chief Executive Officer and a member of the Companys Board of Directors (the Board) invested $3,261,250 through his affiliates. In addition, Ivan Chen and David Rendall, both members of the Board, invested $45,000 and $48,750, respectively. The disinterested members of the Board approved the Private Placement Financing.\n9. Income Taxes\nWe file federal and state consolidated tax returns with our subsidiaries. Our income tax provision for the years ended July 31, 2023 and 2022 was $1,650; the minimum state franchise taxes we pay regardless of income or loss.\nAt July 31, 2023, we had federal and state tax net operating loss carry-forwards of approximately $110.5 million and $64.5 million, respectively. Utilization of the net operating loss carry-forwards may be subject to a substantial annual limitation due to ownership change limitations that may have occurred or that could occur in the future, as required by Section 382 of the Internal Revenue Code as well as similar state provisions. These ownership changes may limit the amount of net operating loss carry-forwards that can be utilized annually to offset future taxable income and tax, respectively. In general, an ownership change, as defined by Section 382 of the Internal Revenue Code results from a transaction or series of transactions over a three-year period resulting in an ownership change of more than 50 percentage points of the outstanding stock of a company by certain stockholders or public groups. Since our formation, we have raised capital through the issuance of capital stock on several occasions (both before and after our initial public offering in 1996) which, combined with the purchasing stockholders subsequent disposition of those shares, may have resulted in such an ownership change, or could result in an ownership change in the future upon subsequent disposition. While we do not believe that we have experienced an ownership change, the pertinent tax rules related thereto are complex and subject to varying interpretations, and thus complete assurance cannot be provided that the taxing authorities would not take an alternative position.\nOur current federal tax loss carry-forwards began expiring in the year ended July 31, 2020 and, unless previously utilized, all but $9.1 million will completely expire in the year ending July 31, 2038. The $9.1 million can be carried forward indefinitely. Our state tax loss carry-forwards began to expire in the year ending July 31, 2029, and will completely expire in the year ending July 31, 2040.\nSignificant components of our deferred tax assets are as follows:\nSchedule of Deferred Tax Assets\nJuly 31,\nNet operating loss carry-forward $ 28,200,000 $ 27,360,000\nStock options and warrants 2,060,000 2,160,000\nOther temporary differences 70,000 (10,000 )\nTotal deferred tax assets 30,330,000 29,510,000\nValuation allowance for deferred tax assets (30,330,000 ) (29,510,000 )\nNet deferred tax assets $ - $ -\nA reconciliation of income taxes computed using the statutory income tax rate, compared to the effective tax rate, is as follows:\nSchedule of Reconciliation of Income Tax Rate\nFederal tax benefit at the expected statutory rate (21 )% (21 )%\nState income tax, net of federal tax benefit (7 ) (7 )\nOther - -\nValuation allowance\nIncome tax benefit - effective rate - % - %\nFollowing authoritative guidance, we recognize the tax benefit from a tax position if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position.\nOur practice is to recognize interest and/or penalties related to income tax matters in income tax expense; however we have had no accrued interest or penalties at either July 31, 2023 or July 31, 2022. We are subject to income taxes in the United States and in various states, and our historical tax years remain subject to future examination by the U.S. and state tax authorities. During the years ended July 31, 2023 and 2022, we did not record any activity related to our unrecognized tax benefits.\nThe Company and its subsidiaries are subject to federal income tax as well as income tax of multiple state jurisdictions. With few exceptions, the Company is no longer subject to income tax examination by tax authorities in major jurisdictions for tax years prior to 2012. However, to the extent allowed by law, the taxing authorities may have the right to examine prior periods where net operating losses were generated and carried forward, and make adjustments up to the amount of the carryforwards. The Company is not currently under examination by the IRS or state taxing authorities.\n10. Subsequent Events\nNote with Related Parties\nOn October 20, 2023 we issued a Note to Mr. Lee, a member of the Board, with an aggregate principal of $785,000 in a subsequent closing of the Private Placement. See Note 5. Debt for additional information relating to the Private Placement."
}