{
    "cik": "1008653",
    "company": "Ecomax, Inc",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "7200",
    "state_of_inc": "NV",
    "state_location": "NY",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1008653/0001493152-23-037116-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1008653/000149315223037116/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1008653/0001493152-23-037116.txt",
    "filename": "1008653_10K_2023_0001493152-23-037116.htm",
    "content": "ITEM 1. BUSINESS\nSome of the statements contained in this annual report on Form 10-K of Ecomax, Inc. (hereinafter the Company, We or the Company) discuss future expectations, contain projections of our plan of operation or financial condition or state other forward-looking information. In this annual report, forward-looking statements are generally identified by the words such as anticipate, plan, believe, expect, estimate, and the like. Forward-looking statements involve future risks and uncertainties, there are factors that could cause actual results or plans to differ materially from those expressed or implied. These statements are subject to known and unknown risks, uncertainties, and other factors that could cause the actual results to differ materially from those contemplated by the statements. The forward-looking information is based on various factors and is derived using numerous assumptions. A reader, whether investing in the Companys securities or not, should not place undue reliance on these forward-looking statements, which apply only as of the date of this annual report. Important factors that may cause actual results to differ from projections include, for example:\n● the success or failure of managements efforts to implement the Companys plan of operation;\n● the ability of the Company to fund its operating expenses;\n● the ability of the Company to compete with other companies that have a similar plan of operation;\n● the effect of changing economic conditions impacting the Companys plan of operation;\n● the ability of the Company to meet the other risks as may be described in future filings with the United States Securities and Exchange Commission, or the SEC.\nGeneral Background of the Company\nEcomax, Inc. (formerly known as Ecomat Inc.) was incorporated on December 14, 1995 pursuant to the laws of the State of Delaware and was formed to develop the Ecomat concept - an environmentally sound solution to the current standard dry-cleaning method that utilizes perchloroethylene, which has been shown to have various toxic effects.\nOn March 26, 1999, the Company filed a petition under Chapter 7 for liquidation of the Companys business. As a result, all of the Companys properties were transferred to a United States trustee and the Company terminated all of its business operations. The bankruptcy trustee has disposed of all of the assets.\nOn June 14, 2006, the bankruptcy court granted an order approving the contract and finding that Park Avenue Group was a good faith purchaser within the meaning of 11 USC Section 363(m) of the Bankruptcy Code.\nOn June 15, 2006, and as a result of the Bankruptcy courts order, Park Avenue Group appointed Ivo Heiden to the board of directors of the Company and to serve as its Chief Executive Officer, Chief Financial Officer, sole director, and Chairman of the board of directors.\nOn February 5, 2007, the Company issued 13,230,000 shares of common stock to Ivo Heiden, for services provided valued at $2,500. Since then, Ivo Heiden controlled 78.58% of the issued and outstanding shares of common stock.\nOn February 9, 2007, the Company completed its change in domicile to Nevada.\nOn January 5, 2021, the Company entered into a Stock Purchase Agreement (the SPA) with Clark Orient (BVI) Limited, (Clark Orient), Mr. Heiden, and WWYD, Inc. (WWYD, Inc. was a 5% or more shareholder of the Company. Mr. Heiden and WWYD, Inc. are collectively referred to as the Sellers), pursuant to which Clark Orient acquired 20,205,000 shares of common stock of the Company (the Shares) from Sellers for an aggregate purchase price of $320,000. The transaction contemplated in the SPA closed on January 7, 2021. The Shares represented approximately 85% of the issued and outstanding common stock of the Company. The transaction resulted in a change in control of the Company.\nIn connection with the change in control, Mr. Heiden, the then Chief Executive Officer, Chief Financial Officer, sole director, and Chairman of the board of directors of the Company, resigned from all of his positions with the Company and the resignations became effective on January 6, 2021. Ms. Yang Gui was appointed as the Chief Executive Officer, Chief Financial Officer, sole director, and Chairwoman of the board of directors of the Company, effective on January 6, 2021.\nOn March 11, 2021, upon the departure of Ms. Yang Gui, Mr. Yu Yam Anthony Chau was appointed as the Chief Executive Officer, Chief Financial Officer, sole director, and Chairman of the board of directors of the Company, effective on March 11, 2021.\nOn March 18, 2021, by unanimous written consent of the board of directors of the Company, the board of directors adopted resolutions approving 1) a reverse split of the Companys common stock at a ratio of 1-for-10, whereby every 10 shares of the issued and outstanding common stock shall be combined into one share of issued and outstanding common stock (the Reverse Stock Split); 2) an increase in the number of the authorized capital stock from 75,000,000 to 500,000,000, with the par value remaining at $0.0001 per share, consisting of 450,000,000 shares of common stock, par value $0.0001 per share and 50,000,000 shares of preferred stock, par value $0.0001 per share (the Increase of Authorized Stock); 3) a change of the Companys name and ticker from Ecomat, Inc. and ECMT, to Ecomax, Inc. and ECMX (the Change of Name, together with the Reverse Stock Split and the Increase of Authorized Stock, collectively, the Corporate Actions); 4) amendments to its articles of incorporation to reflect the Corporate Actions (the Amendments of Articles of Incorporation); and 5) a proposal that such resolutions be submitted for a vote of the stockholders of the Company.\nOn March 18, 2021, the stockholder holding in the aggregate 20,205,000 shares of common stock, or approximately 85% of the common stock outstanding on such date, approved the Corporate Actions.\nOn April 1, 2021, the Company filed a preliminary information statement on Schedule 14C with the United States Securities and Exchange Commission (the SEC).\nOn April 13, 2021, the Company filed a definitive information statement on Schedule 14C with the SEC.\nOn April 20 and 21, 2021, the Company filed a certificate of change and a certificate of amendment with the Secretary of State of the State of Nevada with respect to the Corporate Actions.\nOn April 28, 2021, the Company filed an Issuer Notification Form with the Financial Industry Regulatory Authority (FINRA) requesting confirmation of the Change of Name.\nThe Corporate Actions, as of the date of this report, have all come into effect. As of the date of this report, our ticker symbol on OTC Markets has been changed to EMAX and our name has been changed to Ecomax, Inc.\nOn September 30, 2022, upon the departure of Mr. Yu Yam Anthony Chau, Mr. Raymond Chen was appointed as the Chief Executive Officer, Chief Financial Officer, sole director, and Chairman of the board of directors of the Company, effective September 30, 2022.\nOn February 16, 2023 and March 1, 2023, the Company entered into a sale of goods agreement (the Sale Agreement) and a distributor agreement (the Distributor Agreement), respectively, with Rocitin Company Limited, a Hong Kong company (Rocitin), and commenced substantial business operations, and thus ceased being a shell company.\nOur Business\nOverview\nOn February 16, 2023, the Company entered into the Sale Agreement with Rocitin. Under the terms of the Sale Agreement, the Company has agreed to purchase 10,000 bottles of Rocitin NMN, a nutritional supplement manufactured by Pharmazeutische Fabrik Evers GmbH & Co. KG, a German company, in which each bottle contains 60 capsules, 10080 mg of NMN, at HK $500 (approximately $64.01) per bottle (the Products), with the initial shipment of 2,000 bottles from Rocitin. Except for the payment of the initial shipment of 2,000 bottles of the Products made on March 1, 2023, the payment of the residual 8,000 bottles of the Products shall be made within 45 days from the date of each invoice from Rocitin to the Company. Pursuant to the Sale Agreement, Rocitin will deliver the Products to the location specified by the Company within 15 days of the payment being made.\nOn March 1, 2023, the Company entered the Distributor Agreement with Rocitin. Under the terms of the Distributor Agreement, Rocitin shall store the Products purchased by the Company from it pursuant to the Sale Agreement in an appropriate warehouse leased by it in Hong Kong, distribute the Products on a non-exclusive basis, and use its best efforts to promote and maximize the sale of the Products within Hong Kong, Macau, Taiwan and China (collectively, the Territory) on behalf of the Company, as well as provide reasonable after-sale support to the purchasers of the Products. In addition, Rocitin shall provide monthly reports to the Company due by the 15th of each month concerning the Products sales and the marketing activities of the previous month.\nPursuant to the Distributor Agreement, the Company and Rocitin share any gross profit generated by the distribution of the Products on a 50/50 basis; that is, revenue generated from sales of the Products to third parties minus the original purchase price of the Products paid by the Company to Rocitin, will be shared between the Company and Rocitin on a 50/50 ratio (the Sharing Ratio).\nAs of June 30, 2023, Rocitin delivered 6,000 bottles of the Products that the Company purchased to the warehouse leased by it in Hong Kong and distributed and sold approximately 4,952 bottles of the Products in the Territory, in accordance with the Distributor Agreement, which generated gross revenue of approximately HK $3,327,744 (approximately $424,391). The Company was allocated HK $2,901,872, (approximately $370,079) from the gross profit, which amount represents the Sharing Ratio, as stipulated in the Distributor Agreement.\nOur Product\nAs of June 30, 2023, the Company has been selling and distributing one product, Rocitin NMN, to customers in the Territory. Rocitin NMN is a nutritional supplement manufactured by Pharmazeutische Fabrik Evers GmbH & Co. KG, a German company. Each bottle contains 60 capsules, 10080 mg of NMN.\nNMN, as β-Nicotinamide Mononucleotide, exists in some fruits, vegetables, and poultry. It is a molecule naturally occurring in all life forms and can be transformed into a significant coenzyme NAD+ within cells, which is important to human metabolism. Research, including but not limited to Nicotinamide mononucleotide (NMN) as an anti-aging health product - Promises and safety concerns, has shown that NAD+ levels in the body will decrease with age, and that exogenous supplementation of NMN enhances NAD+ levels and thus the function of human cells. For example, NMN helps to convert food energy into cell energy efficiently to boost energy metabolism and maintain healthy mitochondrial functions. In addition, NMN also helps to repair broken DNA, regulate the stability of DNA and cell death, and improve neurodegenerative and metabolic conditions.\nDistribution and Customers\nUnder the terms of the Distributor Agreement, Rocitin shall store the Products purchased by us from it pursuant to the Sale Agreement in an appropriate warehouse leased by it in Hong Kong, distribute the Products on a non-exclusive basis, and use its best efforts to promote and maximize the sale of the Products within the Territory on behalf of the Company, as well as provide reasonable after-sale support to the purchasers of the Products.\nDuring the fiscal year ended June 30, 2023, Rocitin, on our behalf, sold and distributed the Products directly to customers in China through several cross-border e-commerce platforms such as Xiaohongshu, Douyin, JD.com, and Tmall, and to customers in Hong Kong, Macau and Taiwan through its website. We did not cooperate with any distributors and dealers to sell the Products within the Territory during the fiscal year ended June 30, 2023.\nAs all of our customers were retail customers who directly purchased the Products from us through cross-border e-commerce platforms and Rocitins website during the fiscal year ended June 30, 2023, we did not have any major customers to depend upon.\nSupplier\nAs of June 30, 2023, we have only one supplier, Rocitin. Pursuant to the Sale Agreement with Rocitin, we agreed to purchase 10,000 bottles of the Products. For the fiscal year ended June 30, 2023, we purchased 6,000 bottles of the Products from Rocitin. As our business is still at the beginning stage and under our evaluation, we do not intend to enter into a continuous or long-term supply agreement with Rocitin until we fulfill our obligation under the Sale Agreement to purchase 10,000 bottles of the Products. We believe not being bound by a continuous or long-term supply agreement can allow us to maintain flexibility regarding choosing our supplier and determining whether to further develop the current business operation or seek other prospective new business opportunities.\nFor the fiscal year ended June 30, 2023, Rocitin directly sourced the Products from Pharmazeutische Fabrik Evers GmbH & Co. KG, a German company that manufactures the Products (Fabrik Evers GmbH). While Fabrik Evers GmbH is the only source of the Products, neither Rocitin nor the Company intend to enter a long-term supply agreement with it, since we can generally find similar replacements in the market from the competitors of Fabrik Evers GmbH.\nOur Strategy\nAs the Company intends to further develop the preceding business operation, its management also continues to seek other prospective new business opportunities.\nThe Companys management has substantial flexibility in identifying and selecting prospective new business opportunities. The Company is dependent on the judgment of its management in connection with this process. In evaluating a prospective business opportunity, we would consider, among other factors, the following:\n● costs associated with pursuing a new business opportunity;\n● growth potential of the new business opportunity;\n● experiences, skills and availability of additional personnel necessary to pursue a potential new business opportunity;\n● necessary capital requirements;\n● the competitive position of the new business opportunity;\n● stage of business development;\n● the market acceptance of the potential products and services;\n● proprietary features and degree of intellectual property; and\n● the regulatory environment that may be applicable to any prospective business opportunity.\nThe foregoing criteria are not intended to be exhaustive and there may be other criteria that management may deem relevant. In connection with an evaluation of a prospective or potential business opportunity, management may be expected to conduct a due diligence review.\nThe time and costs required to pursue new business opportunities, which includes negotiating and documenting relevant agreements and preparing requisite documents for filing pursuant to applicable securities laws, cannot be ascertained with any degree of certainty. In addition, the global COVID-19 pandemic has created significant challenges for us to research potential targets and any target business with which we ultimately consummate a business combination, may be materially adversely affected by the COVID-19 pandemic.\nManagement intends to devote such time as it deems necessary to carry out the Companys affairs. The exact length of time required for the pursuit of any new potential business opportunities is uncertain. No assurance can be made that we will be successful in our efforts. We cannot project the amount of time that our management will actually devote to the Companys plan of operation.\nThe Company intends to conduct its activities so as to avoid being classified as an Investment Company under the Investment Company Act of 1940, and therefore avoid application of the costly and restrictive registration and other provisions of the Investment Company Act of 1940 and the regulations promulgated thereunder.\nIntellectual Property\nAs of June 30, 2023, we do not have, and are not applying for, any intellectual properties.\nGovernment Approval\nAs of June 30, 2023, we do not need any approval from any applicable government to sell the Products in the Territory.\nGovernmental & Environmental Regulations\nAs of June 30, 2023, we are subject to certain import regulations and administrative requirements of the governments in the Territory. We have been complying with all applicable regulations and administrative requirements to import the Products. Expenditures for compliance with applicable regulations and administrative requirements to import the Products have not had, and are not expected to have, a material effect on our capital expenditures, results of operations, or competitive position.\nAs of June 30, 2023, we are not subjected to any specific environmental regulations for selling and distributing the Products in the Territory.\nCompetition\nDue to the low barriers to entering the market of selling NMN products in the Territory, we compete with many distributors who sell NMN products similar to ours, especially in China and Hong Kong. Many of these distributors are more established than we are and have significantly greater financial, technical, and other resources than we presently possess. Some of our competitors may be able to respond more quickly to new opportunities, market changes or changes in customer preferences, and may be able to undertake more extensive promotional activities and adopt more aggressive pricing strategies than we are. Despite the above and the fact that we have yet to develop certain competitive advantages, as our business is still at the beginning stage, we believe we will have the potential to compete by making the most of our flexibility to select suppliers and manufacturers who are able to provide the Products with good quality and lower cost.\nEmployees\nMr. Raymond Chen, our Chief Executive Officer and Chief Financial Officer, is our sole executive officer. Mr. Chen devotes his full time to administering the Companys business operations and other affairs. As we further develop our business, we intend to hire additional persons on an as-needed basis.\nLegal Proceedings\nThere is no material litigation, arbitration, governmental proceeding or any other legal proceeding currently pending or known to be contemplated against us or any member of our management team in their capacity as such, and we and the member of our management team have not been subject to any such proceeding in the 10 years preceding the date of this report. We may however be involved, from time to time, in claims and lawsuits incidental to the conduct of our business in the ordinary course. We carry insurance coverage in such amounts as we believe to be reasonable under the circumstances and that may or may not cover any or all of our liabilities in respect of these matters. We do not believe that the ultimate resolution of these matters will have a material adverse impact on our consolidated financial position, cash flows or results of operations, but cannot guarantee same. ITEM 1A. RISK FACTORS\nAs a smaller reporting company, we are not required to provide the information required by this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2. PROPERTIES\nThe Companys corporate office is located at 630 Fifth Avenue, Suite 2338, New York, NY 10111, which space is provided to us on a rent-free basis by New York Listing Management Inc. The Company believes that the office facilities are sufficient for the foreseeable future and this arrangement will remain until we find a new business opportunity. ITEM 3. LEGAL PROCEEDINGS\nWe are not currently involved in any material legal proceedings. From time-to-time we are, and we anticipate that we may be, involved in legal proceedings, claims, and litigation arising in the ordinary course of our business and otherwise. The ultimate costs to resolve any such matters could have a material adverse effect on our financial statements. We could be forced to incur material expenses with respect to these legal proceedings, and in the event that there is an outcome in any that is adverse to us, our financial position and prospects could be harmed. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nOur common stock is currently quoted on the OTC market Pink Sheets under the symbol EMAX and has very limited trading. We cannot assure you that there will be a market in the future for our common stock. The closing price of our common stock on the OTC on October 11, 2023 was $0.602 per share. As of October 11, 2023, our shares of common stock were held by approximately 47 stockholders of record. The transfer agent of our common stock is Standard Registrar and Transfer Company, Inc. at 440 East 400 South, Suite 200, Salt Lake City, UT 84111. Their phone number is (801) 571-8844.\nDividends\nHolders of common stock are entitled to dividends when, as, and if declared by the board of directors of the Company (the Board of Directors), out of funds legally available therefore. We have never declared cash dividends on its common stock and our Board of Directors does not anticipate paying cash dividends in the foreseeable future as it intends to retain future earnings to finance the growth of our businesses. There are no restrictions in our articles of incorporation or bylaws that restrict us from declaring dividends.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nNo equity compensation plan or agreements under which our common stock is authorized for issuance has been adopted during the fiscal year ended June 30, 2023 and 2022.\nRecent Sales of Unregistered Securities\nNone.\nRecent Purchases of Equity Securities by us and our Affiliated Purchasers\nNone. ITEM 6. SELECTED FINANCIAL DATA\n[Reserved] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITIONS AND RESULTS OF OPERATIONS\nThe following discussion and analysis of financial condition and results of operations relates to the operations and financial condition reported in the consolidated financial statements of the Company thereto, which appear elsewhere in this Annual Report on Form 10-K, and should be read in conjunction with such financial statements and related notes included in this report. Except for the historical information contained herein, the following discussion, as well as other information in this report, contain forward-looking statements, within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and are subject to the safe harbor created by those sections. Actual results and the timing of the events may differ materially from those contained in these forward-looking statements due to many factors, including those discussed in the Forward-Looking Statements set forth elsewhere in this Annual Report on Form 10-K.\nManagements Plan of Operation\nThe following discussion contains forward-looking statements. Forward-looking statements give our current expectations or forecasts of future events. You can identify these statements by the fact that they do not relate strictly to historical or current facts. They use of words such as anticipate, estimate, expect, project, intend, plan, believe, and other words and terms of similar meaning in connection with any discussion of future operating or financial performance. From time to time, we also may provide forward-looking statements in other materials we release to the public.\nOverview\nOn February 16, 2023, the Company entered into the Sale Agreement with Rocitin. Under the terms of the Sale Agreement, the Company has agreed to purchase 10,000 bottles of Rocitin NMN, a nutritional supplement manufactured by Pharmazeutische Fabrik Evers GmbH & Co. KG, a German company, in which each bottle contains 60 capsules, 10080 mg of NMN, at HK $500 (approximately $64.01) per bottle (the Products), with the initial shipment of 2,000 bottles from Rocitin. Except for the payment of the initial shipment of 2,000 bottles of the Products made on March 1, 2023, the payment of the residual 8,000 bottles of the Products shall be made within 45 days from the date of each invoice from Rocitin to the Company. Pursuant to the Sale Agreement, Rocitin will deliver the Products to the location specified by the Company within 15 days of the payment being made.\nOn March 1, 2023, the Company entered the Distributor Agreement with Rocitin. Under the terms of the Distributor Agreement, Rocitin shall store the Products purchased by the Company from it pursuant to the Sale Agreement in an appropriate warehouse leased by it in Hong Kong, distribute the Products on a non-exclusive basis, and use its best efforts to promote and maximize the sale of the Products within Hong Kong, Macau, Taiwan and China (collectively, the Territory) on behalf of the Company, as well as provide reasonable after-sale support to the purchasers of the Products. In addition, Rocitin shall provide monthly reports to the Company due by the 15th of each month concerning the Products sales and the marketing activities of the previous month.\nPursuant to the Distributor Agreement, the Company and Rocitin shall share any gross profit generated by the distribution of the Products on a 50/50 basis; that is, revenue generated from sales of the Products to third parties minus the original purchase price of the Products paid by the Company to Rocitin, will be shared between the Company and Rocitin on a 50/50 ratio (the Sharing Ratio).\nAs of June 30, 2023, Rocitin delivered 6,000 bottles of the Products that the Company purchased to the warehouse leased by it in Hong Kong and distributed and sold approximately 4,952 bottles of the Products in the Territory, in accordance with the Distributor Agreement, which generated gross revenue of approximately HK $3,327,744 (approximately $424,391). The Company was allocated HK $2,901,872, (approximately $370,079) from the gross profit, which amount represents the Sharing Ratio, as stipulated in the Distributor Agreement\nAs the Company intends to further develop the preceding business operation, its management also continues to seek other prospective new business opportunities.\nThe Companys management has substantial flexibility in identifying and selecting prospective new business opportunities. The Company is dependent on the judgment of its management in connection with this process. In evaluating a prospective business opportunity, we would consider, among other factors, the following:\n● costs associated with pursuing a new business opportunity;\n● growth potential of the new business opportunity;\n● experiences, skills and availability of additional personnel necessary to pursue a potential new business opportunity;\n● necessary capital requirements;\n● the competitive position of the new business opportunity;\n● stage of business development;\n● the market acceptance of the potential products and services;\n● proprietary features and degree of intellectual property; and\n● the regulatory environment that may be applicable to any prospective business opportunity.\nThe foregoing criteria are not intended to be exhaustive and there may be other criteria that management may deem relevant. In connection with an evaluation of a prospective or potential business opportunity, management may be expected to conduct a due diligence review.\nThe time and costs required to pursue new business opportunities, which includes negotiating and documenting relevant agreements and preparing requisite documents for filing pursuant to applicable securities laws, cannot be ascertained with any degree of certainty. In addition, the global COVID-19 pandemic has created significant challenges for us to research potential targets and any target business with which we ultimately consummate a business combination, may be materially adversely affected by the COVID-19 pandemic.\nManagement intends to devote such time as it deems necessary to carry out the Companys affairs. The exact length of time required for the pursuit of any new potential business opportunities is uncertain. No assurance can be made that we will be successful in our efforts. We cannot project the amount of time that our management will actually devote to the Companys plan of operation.\nThe Company intends to conduct its activities so as to avoid being classified as an Investment Company under the Investment Company Act of 1940, and therefore avoid application of the costly and restrictive registration and other provisions of the Investment Company Act of 1940 and the regulations promulgated thereunder\nResults of Operations during the fiscal year ended June 30, 2023 as compared to the fiscal year ended June 30, 2022\nWe have generated $424,391 during the fiscal year ended June 30, 2023 and did not generate any revenues during the fiscal year 2022. We had total operating expenses of $176,512, including general and administrative expenses of $122,200, and sales expenses of $54,312 during the fiscal year ended June 30, 2023, compared to $105,448, including $105,448 general and administrative expenses during the fiscal year ended June 30, 2022. We incurred interest expenses of $22,188 during the fiscal year ended June 30, 2023, compared to interest expenses of $9,158 during the fiscal year ended June 30, 2022. During the years ended June 30, 2023, and 2022, we had a net loss of $89,920 and $114,605, respectively, mainly due to the change in companys revenue in 2023.\nLiquidity and Capital Resources\nThe Company has recently commenced its business operation and has limited cash resources other than advances provided by our majority shareholder or an affiliated party. We are dependent upon interim funding provided by our majority shareholder or an affiliated party to pay operating expenses and professional fees and expenses. Our majority shareholder and an affiliated party have agreed to provide funding as may be required to pay for accounting fees and other administrative expenses of the Company until such time the Company generates sufficient profits to pay these fees. The Company would be unable to continue as a going concern without interim financing provided by our majority shareholder and our affiliated party.\nIf we require additional financing, we cannot predict whether equity or debt financing will become available at terms acceptable to us, if at all. The Company depends upon services provided by management and funding provided by our majority shareholder or our affiliated party to fulfill its filing obligations under the Exchange Act. At present, the Company has limited financial resources to pay for such services.\nThe following table shows a summary of our cash flows for the periods presented:\nFiscal Years Ended June 30,\nChange ‘23 vs. ‘22\nNet cash (used in) provided by\nOperating activities $ (206,807 ) $ (124,871 ) $ (81,936 )\nFinancing activities 206,807 124,871 81,936\nIncrease (decrease) in cash $ 0 $ 0 $ 0\nNet cash used in our operating activities was $206,807 and $124,871 for the fiscal years ended June 30, 2023 and 2022, respectively. The increase of $81,936 was due mainly to a $81,936 increase in operating assets.\nOur financing activities generated a cash inflow of $206,807 and $124,871 for the fiscal years ended June 30, 2023 and 2022, respectively, due to the funds borrowed from our majority shareholder and an affiliated party and a loan from the lender (described below).\nDuring the next 12 months we anticipate incurring costs related to:\n● filing of Exchange Act reports,\n● the current business operation,\n● registered agent fees and accounting fees, and\n● investigating, analyzing and consummating an acquisition or business combination.\nAs of June 30, 2023, we had current assets of $168,506, and on June 30, 2022, we had no current assets. As of June 30, 2023, we had $466,116 in liabilities, consisting of accounts payable of $17,422, an advance from a related party of $415,601, accrued interest due to related parties of $7,812 in one loan agreement, and accrued expenses of $25,280. As of June 30, 2022, we had $207,690 in liabilities consisting of accounts payable of $3,250, an advance from a related party of $191,091, accrued interest due to related parties of $3,329 in one loan agreement, and accrued expenses of $10,020.\nDuring the fiscal year ended June 30, 2023, we had negative cash flow from operating activities of $206,807, due to a net loss of $89,920, and a change in operating assets. We financed our negative cash flow from operations and $206,807 in advances from New York Listing Management, Inc, an affiliated party. During the fiscal year ended June 30, 2022, we had negative cash flow from operating activities of $124,871, mainly due to a net loss of $114,605 offset by a decrease in accounts payable and accrued liabilities of $10,266. We financed our negative cash flow from operations and $124,871 in advances from New York Listing Management, Inc, an affiliated party.\nThe Company currently plans to satisfy its cash requirements for the next 12 months through borrowings from New York Listing Management, Inc, as well as from the revenue generated from operations, and believes it can satisfy its cash requirements so long as it is able to obtain such financing from New York Listing Management, Inc and the current business operation continues successfully. The Company expects that money borrowed and generated from such sources will be used during the next 12 months to satisfy the Companys operating costs, professional fees and general corporate purposes.\nOn March 31, 2021, we entered into a loan agreement with New York Listing Management, Inc, a related party, under which we are able to receive funding of up to $200,000 for general operating expenses from time-to-time as needed by the Company (the NYLM Loan Agreement). The NYLM Loan Agreement bears an interest rate of 8% per annum and is due and payable on the date that is three hundred sixty-six (366) days from the date of such loan agreement. On March 31, 2022, we extended the NYLM Loan Agreement with New York Listing Management, Inc and such loan agreement was to mature on March 31, 2023. On April 1, 2023, we re-signed the NYLM Loan Agreement with New York Listing Management, Inc, and the loan agreement has no expiration, is due on demand, and the borrowing limit has been increased to $800,000. As of June 30, 2023 and 2022, the outstanding balance on this loan was $415,601 and $191,091, respectively, with accrued interest of $7,812 and $3,329, respectively. As of June 30, 2023, we expensed interest of $22,188, related to the NYLM Loan Agreement.\nThe Company intends to repay the loan from New York Listing Management, Inc at a time when it has the cash resources to do so.\nThe Company has only limited capital. Additional financing is necessary for the Company to continue as a going concern. Our independent auditors issued an unqualified audit opinion for the years ended June 30, 2023 and 2022 with an explanatory paragraph expressing uncertainty as to the Companys ability to remain as a going concern.\nOff-Balance Sheet Arrangements\nAs of June 30, 2023 and 2022, we did not have any off-balance sheet arrangements, as defined in Item 303(a)(4)(ii) of Regulation S-K promulgated under the Securities Act of 1934.\nSignificant Accounting Policies\nOur significant accounting policies are described in the notes to our financial statements for the years ended June 30, 2023 and 2022, and are included elsewhere in this annual report. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe have not entered into, and do not expect to enter into, financial instruments for trading or hedging purposes. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nOur financial statements required by this item are included on the pages immediately following the Index to Financial Statements appearing on page. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nEffective as of April 27, 2023, the Board of Directors of the Company approved the engagement of Qi CPA LLC (Qi) to serve as the Companys independent registered public accounting firm for the fiscal year ended June 30, 2023 and quarterly periods ended March 31, 2023, September 30, 2023, December 31, 2023 and March 31, 2024.\nDuring the two fiscal years ended June 30, 2022 and 2021, and the subsequent interim period through April 26, 2023, neither the Company nor anyone acting on its behalf has consulted with Qi with respect to (i) the application of accounting principles to a specified transaction, either completed or proposed, or the type of audit opinion that might be rendered on the Companys financial statements, and neither a written report nor oral advice was provided to us by Qi that was an important factor considered by us in reaching a decision as to any accounting, auditing or financial reporting issue, or (ii) any other matter that was the subject of a disagreement as defined in Item 304(a)(1)(iv) of Regulation S-K and the related instructions to Item 304 of Regulation S-K or a reportable event as described in Item 304(a)(1)(v) of Regulation S-K.\nOn April 27, 2023, the Board of Directors of the Company notified M&K CPAS, PLLC (the Former Auditor) that the Former Auditor was dismissed as the Companys independent registered public accounting firm. The decision to dismiss the Former Auditor was approved by the Board of Directors of the Company.\nThe reports of the Former Auditor on the Companys consolidated financial statements as of and for the fiscal years ended June 30, 2022 and 2021 did not contain an adverse opinion or a disclaimer of opinion, and were not qualified or modified as to uncertainty, audit scope or accounting principle.\nDuring fiscal years ended June 30, 2022 and 2021, and the subsequent interim period through April 26, 2023, there were no disagreements as described under Item 304(a)(1)(iv) of Regulation S-K with the Former Auditor on any matter of accounting principles or practices, financial statement disclosure, or auditing scope or procedure, which disagreements, if not resolved to the Former Auditors satisfaction, would have caused the Former Auditor to make reference to the subject matter thereof in connection with its reports on the financial statements of the Company for such years. In addition, during the fiscal years ended June 30, 2022 and 2021, and the subsequent interim period through April 26, 2023, there were no reportable events as described under Item 304(a)(1)(v) of Regulation S-K.\nThe Former Auditor furnished a letter addressed to the U.S. Securities and Exchange Commission stating it agrees with the above statements. A copy of the Former Auditors letter, dated May 2, 2023, was attached as Exhibit 16.1 of Form 8-k the Company filed with the Securities and Exchange Commission on May 2, 2023. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nAs of June 30, 2023, the Companys Chief Executive Officer conducted an evaluation regarding the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) or 15d-15(e) under the Exchange Act. Based upon the evaluation of these controls and procedures as provided under the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework (2013), our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were ineffective because of the identification of material weaknesses, including lack of sufficient internal accounting personnel in order to ensure complete documentation of complex transactions and adequate financial reporting during the fiscal year ended June 30, 2023. The Company has no formal control process related to the identification and approval of related party transactions. As a company that has just commenced its business operation, the Company currently has limited personnel, and, as of the date of this report, it has not taken corrective actions to address the ineffective disclosure controls and procedures. The Company intends to take corrective actions in the future when it generates sufficient profits to do so.\nManagements Annual Report on Internal Control Over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Exchange Act Rule 13a-15. Internal control over financial reporting is defined in Rule 13a-15(f) and 15(d)-15(f) under the Exchange Act as a process designed to provide reasonable assurance to the Companys management and Board of Directors regarding the preparation and fair presentation of published financial statements. Management conducted an assessment of the Companys internal control over financial reporting as of June 30, 2023 based on the framework and criteria established by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework (2013).\nBased on our assessment and those criteria, we have concluded that our internal control over financial reporting was ineffective because of the identification of material weaknesses, including lack of sufficient internal accounting personnel in order to ensure complete documentation of complex transactions and adequate financial reporting during the year ended June 30, 2023. The Company has no formal control process related to the identification and approval of related party transactions. As a company that has just commenced its business operation, the Company currently has limited personnel, and, as of the date of this report, it has not taken corrective actions to address the ineffective disclosure controls and procedures. The Company intends to take corrective actions in the future when it generates sufficient profits to do so.\nOur management is also responsible for establishing and maintaining adequate internal control over financial reporting. The Companys internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to temporary rules of the SEC that permit the Company to provide only managements report in this annual report.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting or in other factors identified in connection with the evaluation required by paragraph (d) of Exchange Act Rules 13a-15 or 15d-15 that occurred during the fiscal year ended June 30, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth the name and age of the sole member of our Board of Directors and executive officer of the Company and the positions he holds.\nName\nAge\nTitle\nRaymond Chen\nChief Executive Officer, Chief Financial Officer, Director and Chairman of the Board of Directors\nMr. Chen has extensive experience in the financial industry and in company management. From September 2010 to January 2015, he served as a business advisor to many start-ups in the United States. From April 2016 to September 2022, Mr. Chen served as a senior financial advisor of Qianhai Meijiao (Shenzhen) Consulting Management Co., Ltd, a company based in Shenzhen, China. Mr. Chen obtained his M.B.A degree from Campbellsville University, Kentucky, in 2007, and obtained his Bachelor degree in accounting from Nanjing Tech University, China, in 2006. Mr. Chen has not been a director of any public company in the last three years.\nDirectors Compensation\nOur director holds office until the next annual meeting of stockholders and until his successor has been duly elected and qualified. There are no agreements with respect to the election of directors. We do not compensate our directors. Officers of the Company are appointed annually by the Board of Directors and each executive officer serves at the discretion of the Board of Directors.\nCommittees of the Board of Directors\nOur Board of Directors has not established any committees, including an audit committee, a compensation committee, a nominating committee or any committee performing a similar function. The functions of those committees are being undertaken by our sole board member. Because we have only one director and do not have any independent directors, the establishment of committees of the Board of Directors would not provide any benefits to our company and could be considered more form than substance, as of the date of this report.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, our sole director and executive officer has not, during the past ten years:\n● been convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n● had any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n● been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n● been found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n● been the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n● been the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCode of Ethics\nThe Company adopted a Code of Ethics pursuant to rules described in Regulation S-K.\nFamily Relationships\nThere are no family relationships between the director and executive officer of the Company. ITEM 11. EXECUTIVE COMPENSATION\nThe table below summarizes all compensation awarded to, earned by, or paid to our Chief Executive Officer and Chief Financial Officer who occupied such position at the end of our latest fiscal year.\nStock\nOption Stock All Other\nName and\nSalary Bonus Awards Awards Compensation Total\nPrincipal Position Year ($) ($) ($) (#) ($) ($)\nRaymond Chen\nChief Executive Officer\nand Chief Financial Officer(1)\n$ 54,000 N/A N/A N/A N/A $ 54,000\n$ 54,000 N/A N/A N/A N/A $ 54,000\n(1) Mr. Chen received employment compensation pursuant to an employment agreement entered into with the Company dated September 30, 2022 as the Companys Chief Executive Officer and Chief Financial Officer.\nOption Grants in Last Fiscal Year\nThe Company did not grant any options in the fiscal year ended June 30, 2023.\nPension, Retirement or Similar Benefit Plans\nThere are no arrangements or plans in which we provide pension, retirement, or similar benefits for directors or executive officers. We have no material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers.\nEmployment Agreements\nThe Company has not entered into employment agreements with officers and other key employees except as disclosed in this Item 11.\nEquity Compensation Plan\nThe Company does not have any Equity Compensation Plan.\nDirectors and Officers Liability Insurance\nThe Company currently does not have insurance for directors and officers against liability. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth information regarding the beneficial ownership of our common stock as of June 30, 2023. The information in this table provides the ownership information for: each person known by us to be the beneficial owner of more than 5% of our common stock; each of our directors; each of our executive officers; and our executive officers and directors as a group.\nBeneficial ownership has been determined in accordance with the rules and regulations of the SEC and includes voting or investment power with respect to the shares. Unless otherwise indicated, the persons named in the table below have sole voting and investment power with respect to the number of shares indicated as beneficially owned by them.\nName of Beneficial Owner Common\nStock\nBeneficially\nOwned Percentage of\nCommon\nStock\nOwned\nDirector and Officers\nRaymond Chen(1) 0 %\n5% Shareholders\nClark Orient (BVI) Limited 2,020,500 84.861 %\nROOM 2906, 29/F\nCHINA ONLINE CENTRE\n333 LOCKHART ROAD, WANCHAI\nHONG KONG\nCHINA\nPalatin AG 156,000 6.552 %\nBeethovenstrasse 43\n8022 Zuerich, Switzerland\nAll officers and directors as a group (one person) 0 %\n(1) The address of Mr. Chen is 630 Fifth Avenue, Suite 2338, New York, NY, 10111 ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nDuring the years ended June 30, 2023 and 2022, New York Listing Management Inc. made cash advances of $224,510 and $131,336, respectively, to the Company for franchise taxes, audit fees and registered agent fees. As of June 30, 2023 and 2022, the Company owed $415,601 and $191,091, respectively, in accrued interest to New York Listing Management Inc. The interest for these advances is 8%. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe Companys Board of Directors appointed M&K CPAS, PLLC as the Companys independent public accountant for the fiscal year ended June 30, 2022. The Companys Board of Directors has appointed Qi CPA LLC as the Companys independent public accountant for the fiscal year ended June 30, 2023 and quarterly periods ended March 31, 2023, September 30, 2023, December 31, 2023 and March 31, 2024.\nPrincipal Accounting Fees\nThe following table presents the fees for professional audit services rendered by M&K CPAS, PLLC for the audit of the Companys annual financial statements for the fiscal year ended June 30, 2022, and fees billed for other services rendered by M&K CPAS, PLLC during the period.\nYear Ended\nJune 30, 2022\nAudit fees $ 10,750\nAudit Related Fees -\nTax Fees -\nAll Other Fees -\nIn total 10,750\nThe following table presents the fees for professional audit services rendered by Qi CPA LLC for the audit of the Companys annual financial statements for the fiscal year ended June 30, 2023, and fees billed for other services rendered by Qi CPA LLC during such period.\nYear Ended\nJune 30, 2023\nAudit fees $ 15,000\nAudit Related Fees\nTax Fees\nAll Other Fees\nIn total 15,000\nEffective May 6, 2003, the SEC adopted rules that require that before our independent registered public accounting firm is engaged by us to render any auditing or permitted non-audit related service, the engagement be:\n● approved by our audit committee; or\n● entered into pursuant to preapproval policies and procedures established by the audit committee, provided the policies and procedures are detailed as to the particular service, the audit committee is informed of each service, and such policies and procedures do not include delegation of the audit committees responsibilities to management.\nWe do not have an audit committee. Our sole director preapproves all services provided by our independent registered public accounting firms. However, all of the above services and fees were reviewed and approved by the sole board member for the respective services were rendered. ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULE\n(a) The following documents are filed as exhibits to this report on Form 10-K or incorporated by reference herein. Any document incorporated by reference is identified by a parenthetical reference to the SEC filing that included such document.\n(1) Financial Statements: See Index to Financial Statements on page.\n(2) Financial statement schedules are omitted because they are not required or are not applicable or the required information is shown in the financial statements or notes thereto.\n(3) Exhibits\nExhibit No.\nDescription\n3.1\nCertificate of Incorporation (incorporated by reference to our Form 10, Exhibit No.3.1, filed with the Securities and Exchange Commission on July 10, 2017)\n3.2\nBylaws (incorporated by reference to our Form 10, Exhibit No.3.2, filed with the Securities and Exchange Commission on July 10, 2017)\n3.3\nCertificate of Amendment dated as of April 21, 2021 and Nevada State Business License dated as of April 22, 2021 (incorporated by reference to our Form 8-K, Exhibit No.3.2, filed with the Securities and Exchange Commission on May 26, 2021.)\n3.4\nCertificate of Change dated as of April 20, 2021 (incorporated by reference to our Form 8-K, Exhibit No.3.1, filed with the Securities and Exchange Commission on May 26, 2021.)\n10.1\nSale of Goods Agreement between Ecomax, Inc. and Rocitin Company Limited. Dated February 16, 2023 (incorporated by reference to our Form 8-K, Exhibit No.10.1, filed with the Securities and Exchange Commission on March 22, 2023.)\n10.2\nDistributor Agreement between Ecomax, Inc. and Rocitin Company Limited. Dated March 1, 2023 (incorporated by reference to our Form 8-K, Exhibit No.10.1, filed with the Securities and Exchange Commission on March 22, 2023.)\n14.1*\nCode of Business Conduct and Ethics of the Registrant\n16.1\nLetter from M&K CPAS, PLLC to the U.S. Securities and Exchange Commission (incorporated by reference to our Form 8-K, Exhibit No.16.1, filed with the Securities and Exchange Commission on May 2, 2023.)\n31.1*\nCertification of Chief Executive Officer pursuant to Exchange Act Rule 13a-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of Chief Financial Officer pursuant to Exchange Act Rule 13a-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1**\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2**\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nXBRL Instance Document *\n101.SCH\nXBRL Taxonomy Extension Schema Document *\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document *\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document *\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document *\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document *\nCover Page Interactive Data File (Embedded within the Inline XBRL document and included in Exhibit)\n* Filed herewith.\n** In accordance with Item 601(b)(32)(ii) of Regulation S-K and SEC Release No. 34-47986, the certifications furnished in Exhibits 32.1 and 32.2 herewith are deemed to accompany this Form 10-K and will not be deemed filed for purposes of Section 18 of the Exchange Act. Such certifications will not be deemed to be incorporated by reference into any filings under the Securities Act or the Exchange Act.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Company and in the capacities and on the date indicated.\nEcomax, Inc.\nBy: /s/ Raymond Chen\nRaymond Chen\nChief Executive Officer, Director and Chairman of the Board of Directors\n(Principal Executive Officer)\nDate: October 13, 2023\nBy: /s/ Raymond Chen\nRaymond Chen\nChief Financial Officer\n(Principal Financial and Principal Accounting Officer)\nDate: October 13, 2023\nECOMAX, INC.\nReport of Independent Registered Public Accounting Firm (PCAOB ID No: 6631)\nFinancial Statements:\nConsolidated Balance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Stockholders Deficit for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2023 and 2022\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nof Ecomax, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Ecomax, Inc. (the Company) as of June 30, 2023 and the related statements of operations, stockholders deficiency, and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of Ecomax, Inc. as of June 30, 2023 and the results of its operations and cash flows for the year then ended in conformity with accounting principles generally accepted in the United States.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nGoing Concern Uncertainty\nThe accompanying financial statements referred to above have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Companys present financial situation raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to this matter are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition- Refer to Note 2\nCritical Audit Matter Description\nRevenue recognition was identified as the critical audit matter due to fiscal year 2023 was the first year the Company began make sales since inception and it is the first time the Company adopted ASC 606. Revenue recognized was significant to the financial statements as a whole. The sale is from a sole product.\nHow the Critical Audit Matter was Addressed in the Audit:\nOur principal audit procedures related to the Companys sales included:\n1. Reviewed the Companys revenue recognition process and ascertained the Company has adopted ASC 606.\n2. Performed detail testing on sales to ascertain sales are valid and accurate\n3. Performed sales cutoff procedures to verify sales are recorded in the proper period.\n4. Considered the adequacy of the disclosure in the financial statements in relation to sales.\nQi CPA LLC\nValley Stream, New York\nOctober 13, 2023\nWe have served as the Companys auditor since 2023.\nECOMAX, INC.\nBALANCE SHEETS\nBalance Sheets as of June 30, 2023 and 2022\nJune 30, June 30,\nASSETS\nCurrent assets:\nCash $ - $ -\nAccounts receivable 101,552 -\nInventories 66,954\nTotal current assets 168,506 -\nTOTAL ASSETS $ 168,506 $ -\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent liabilities:\nAccounts payable - trade $ 17,422 $ 3,250\nNote payable - related party 415,601 191,091\nAccrued interest related party 7,812 3,329\nAccured expenses 25,280 10,020\nAccrued expenses - related party - -\nAccured expenses 25,280 10,020\nTotal current liabilities 466,116 207,690\nStockholders deficit:\nPreferred stock, $0.0001 par value; 50,000,000 authorized; none issued and outstanding as of June 30, 2023 and 2022. - -\nCommon stock, $0.0001 par value; 450,000,000 shares authorized; 2,380,958 issued and outstanding as of June 30, 2023 and 2022\nAdditional paid-in capital 286,524 286,524\nAccumulated deficit (584,372 ) (494,452 )\nTotal stockholders deficit (297,610 ) (207,690 )\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT) $ 168,506 $ -\nSee Summary of Significant Accounting Policies and Notes to Financial Statements.\nECOMAX, INC.\nSTATEMENTS OF OPERATIONS\nFiscal Year Ended June, 30\nRevenues:\nSales $ 424,391 $ -\nCost of goods sold 315,612 -\nGross profit 108,780 -\nCost and expenses:\nSales expenses 54,312\nGeneral and administrative 122,200 105,448\nTotal operating expenses 176,512 105,448\nOther income and expenses\nInterest expenses 22,188 9,158\nNet loss $ (89,920 ) $ (114,605 )\nPer common share - basic and diluted\nBasic and diluted net loss $ (0.04 ) $ (0.05 )\nWeighted average shares\nOutstanding, basic and diluted 2,380,958 2,380,958\nSee Summary of Significant Accounting Policies and Notes to Financial Statements.\nECOMAX, INC.\nSTATEMENTS OF STOCKHOLDERS DEFICIT\nNumber of\nShares Stated or\nPar Value Paid-in\nCapital Accumulated\nDeficit Total\nCommon stock Additional\nNumber of\nShares Stated or\nPar Value Paid-in\nCapital Accumulated\nDeficit Total\nBalance as of June 30, 2021 2,380,958 $ 238 $ 286,524 $ (379,847 ) $ (93,085 )\nNet loss - - - (114,605 ) (114,605 )\nBalance as of June 30, 2022 2,380,958 286,524 (494,452 ) (207,690 )\n-\nBalance as of June 30, 2022 2,380,958 $ 238 $ 286,524 $ (494,452 ) $ (207,690 )\nNet loss - - - (89,920 ) (89,920 )\nBalance as of June 30, 2023 2,380,958 286,524 (584,372 ) (297,610 )\nSee Summary of Significant Accounting Policies and Notes to Financial Statements.\nECOMAX, INC.\nSTATEMENTS OF CASH FLOWS\nFiscal Year Ended\nCash flows from operating activities:\nNet loss $ (89,920 ) $ (114,605 )\nAdjustments to reconcile net loss to cash used in operating activities:\nChange in operating assets and liabilities:\nAccounts receivable (101,552 )\nInventories (66,954 )\nAccounts payable and accrued liabilities 51,619 (10,266 )\nNet cash used by operating activities (206,807 ) (124,871 )\nCash flows from financing activities:\nAdvances from related party 206,807 124,871\nNet cash provided by financing activities 206,807 124,871\nChange in cash - -\nCash at beginning of period - -\nCash at end of period $ - $ -\nNon-cash investing and financing activities:\nForgiveness of accrued interest, related party $ - $ -\nForgiveness of advances, related party $ - $ -\nForgiveness of convertible short-term notes, related party $ - $ -\nAccrued interest to debt $ 17,704 $ 6,495\nSee Summary of Significant Accounting Policies and Notes to Financial Statements.\nEcomax, Inc.\nNotes to Financial Statements\nJune 30, 2023\nNote 1. Organization and Nature of Business\nEcomax, Inc., formerly Ecomat, Inc. (the Company) was incorporated on December 14, 1995 pursuant to the laws of the State of Delaware. On February 9, 2007, the Company completed its change in domicile to Nevada. The Company used to operate a wet-cleaning process which was one of the first environmentally sound solution to current dry-cleaning methods. Currently, the Company is actively engaging in the distribution of personal healthcare products and nutrition supplements.\nOn April 13, 2021 the Board of Directors (the Board) of the Company filed the following with the State of Nevada:\n● A reverse stock split of common stock of one share for every ten (1-for-10) shares outstanding.\n● A change in name from Ecomat, Inc. to Ecomax, Inc.;\n● An increase in the authorized number of shares of capital stock from 75,000,000 to 500,000,000, including 450,000,000 shares of common stock and 50,000,000 shares of preferred stock, and;\nAll share and per share information, including earnings per share, in this Form 10-K have been retroactively adjusted to reflect this reverse stock split and certain items in prior period financial statements have been revised to conform to the current presentation.\nNote 2. Summary of Significant Accounting Policies\nSignificant Accounting Policies:\nUse of Estimates:\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statement and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from the estimates.\nCash and Cash Equivalents:\nFor financial statement presentation purposes, the Company considers those short-term, highly liquid investments with original maturities of three months or less to be cash or cash equivalents. There were no cash equivalents as of June 30, 2023 or June 30, 2022.\nProperty and Equipment:\nNew property and equipment are recorded at cost. Depreciation is computed using the straight-line method over the estimated useful lives of the assets, generally 5 years. Expenditures for renewals and betterments are capitalized. Expenditures for minor items, repairs and maintenance are charged to operations as incurred. Gain or loss upon sale or retirement due to obsolescence is reflected in the operating results in the period the event takes place.\nInventories\nInventories as of June 30, 2023 consist of 1,048 bottles of Rocitin NMN purchased from our Hong Kong supplier. Inventories are stated at the lower cost (first-in, first-out method) or market. The valuation of inventory requires the Company to estimate obsolescence, excess, and slowing-moving inventories. The Company evaluates the recoverability of the inventory based on expected demand and market conditions. No inventory write down was recorded in the periods presented.\nValuation of Long-Lived Assets:\nWe review the recoverability of our long-lived assets including equipment, goodwill and other intangible assets, when events or changes in circumstances occur that indicate that the carrying value of the asset may not be recoverable. The assessment of possible impairment is based on our ability to recover the carrying value of the asset from the expected future pre-tax cash flows (undiscounted and without interest charges) of the related operations. If these cash flows are less than the carrying value of such asset, an impairment loss is recognized for the difference between estimated fair value and carrying value. Our primary measure of fair value is based on discounted cash flows. The measurement of impairment requires management to make estimates of these cash flows related to long-lived assets, as well as other fair value determinations.\nStock Based Compensation:\nStock-based awards are accounted for using the fair value method in accordance with ASC 718, Share-Based Payments. Our primary type of share-based compensation consists of stock options. We use the Black-Scholes option pricing model in valuing options. The inputs for the valuation analysis of the options include the market value of the Companys common stock, the estimated volatility of the Companys common stock, the exercise price of the warrants and the risk-free interest rate.\nFair Value of Financial Instruments:\nFASB ASC 825, Financial Instruments, requires entities to disclose the fair value of financial instruments, both assets and liabilities recognized and not recognized on the balance sheet, for which it is practicable to estimate fair value. FASB ASC 825 defines fair value of a financial instrument as the amount at which the instrument could be exchanged in a current transaction between willing parties. As of June 30, 2023 and June 30, 2022, the carrying value of certain financial instruments (cash and cash equivalents, accounts payable and accrued expenses.) approximates fair value due to the short-term nature of the instruments or interest rates, which are comparable with current rates.\nRevenue Recognition\nIt is the Companys policy that revenues from product sales are recognized in accordance with Accounting Standards Codification (ASC 606) Revenue Recognition. Five basic steps must be followed to recognize revenue; (1) Identify contract(s) with a customer that creates enforceable rights and obligations; (2) Identify performance obligations in the contract, such as promises to transfer goods or services to a customer; (3) Determine the transaction price, (i.e. the amount of consideration in a contract to which an entity believes it is entitled in exchange for transferring promised goods or services to a customer); (4) Allocate the transaction price to the performance obligations in the contract, which requires the Company to allocate the transaction price to each performance obligation on the basis of the relative standalone selling prices of each distinct good or services promised in the contract; and (5) Recognize revenue when (or as) the entity satisfies a performance obligation by transferring a promised good or service to a customer. The amount of revenue recognized is the amount allocated to the satisfied performance obligation. Adoption of ASC 606 has not changed the timing and nature of the Companys revenue recognition and there has been no material effect on the Companys consolidated financial statements.\nThe Company engaged a supplier to purchase inventory. The supplier also stores, sells and distributes the goods on the Companys behalf. The selling price and cost are predetermined between the Company and the supplier. Any profits are shared 50/50 in accordance with the agreement.\nOur revenue (referred to in our financial statements as Sales) consists primarily of the sale of Rocitin NMN products for cash or otherwise agreed-upon credit terms. Our customers consist primarily of wholesalers. Our revenue generating activities have a single performance obligation and are recognized at the point in time when control transfers and our obligation has been fulfilled, which is when the related goods are shipped or delivered to the customer, depending upon the method of distribution, and shipping terms. We have elected to treat shipping as a fulfillment activity. Revenue is measured as the amount of consideration we expect to receive in exchange for the sale of our product. The Company has no obligation to accept the return of products sold other than for replacement of damaged products. Other than quantity price discounts negotiated with customers prior to billing and delivery (which are reflected as a reduction in sales), the Company does not offer any sales incentives or other rebate arrangements to customers.\nEarnings per Common Share:\nWe compute net income (loss) per share in accordance with ASC 260, Earning per Share. ASC 260 requires presentation of both basic and diluted earnings per share (EPS) on the face of the income statement. Basic EPS is computed by dividing net income (loss) available to common shareholders (numerator) by the weighted average number of shares outstanding (denominator) during the period. Diluted EPS gives effect to all dilutive potential common shares outstanding during the period using the treasury stock method and convertible preferred stock using the if-converted method. In computing Diluted EPS, the average stock price for the period is used in determining the number of shares assumed to be purchased from the exercise of stock options or warrants. Diluted EPS excludes all dilutive potential shares if their effect is anti-dilutive.\nIncome Taxes:\nWe have adopted ASC 740, Accounting for Income Taxes. Pursuant to ASC 740, we are required to compute tax asset benefits for net operating losses carried forward. The potential benefits of net operating losses have not been recognized in these financial statements because the Company cannot be assured it is more likely than not it will utilize the net operating losses carried forward in future years.\nWe must make certain estimates and judgments in determining income tax expense for financial statement purposes. These estimates and judgments occur in the calculation of certain tax assets and liabilities, which arise from differences in the timing of recognition of revenue and expense for tax and financial statement purposes.\nDeferred tax assets and liabilities are determined based on the differences between financial reporting and the tax basis of assets and liabilities using the tax rates and laws in effect when the differences are expected to reverse. ASC 740 provides for the recognition of deferred tax assets if realization of such assets is more likely than not to occur. Realization of our net deferred tax assets is dependent upon our generating sufficient taxable income in future years in appropriate tax jurisdictions to realize benefit from the reversal of temporary differences and from net operating loss, or NOL, carryforwards. We have determined it more likely than not that these timing differences will not materialize and have provided a valuation allowance against substantially all of our net deferred tax asset.\nManagement will continue to evaluate the realizability of the deferred tax asset and its related valuation allowance. If our assessment of the deferred tax assets or the corresponding valuation allowance were to change, we would record the related adjustment to income during the period in which we make the determination. Our tax rate may also vary based on our results and the mix of income or loss in domestic and foreign tax jurisdictions in which we operate.\nIn addition, the calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax regulations. We recognize liabilities for anticipated tax audit issues in the U.S. and other tax jurisdictions based on our estimate of whether, and to the extent to which, additional taxes will be due. If we ultimately determine that payment of these amounts is unnecessary, we will reverse the liability and recognize a tax benefit during the period in which we determine that the liability is no longer necessary. We will record an additional charge in our provision for taxes in the period in which we determine that the recorded tax liability is less than we expect the ultimate assessment to be.\nASC 740 which requires recognition of estimated income taxes payable or refundable on income tax returns for the current year and for the estimated future tax effect attributable to temporary differences and carry-forwards. Measurement of deferred income tax is based on enacted tax laws including tax rates, with the measurement of deferred income tax assets being reduced by available tax benefits not expected to be realized.\nUncertain Tax Positions:\nThe provisions of ASC 740-10-25, Accounting for Uncertainty in Income Taxes, prescribe a more-likely-than-not threshold for financial statement recognition and measurement of a tax position taken (or expected to be taken) in a tax return. This ASC also provides guidance on the recognition of income tax assets and liabilities, classification of current and deferred income tax assets and liabilities, accounting for interest and penalties associated with tax positions, and related disclosures.\nOur federal and state income tax returns are open for fiscal years ending on or after June 30, 2007. We are not under examination by any jurisdiction for any tax year. As of June 30, 2023, we had no material unrecognized tax benefits and no adjustments to liabilities or operations were required under ASC 740.\nRecently Issued Accounting Pronouncements:\nIn December 2019, the FASB issued ASU 2019-12 - Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. This ASU provides an exception to the general methodology for calculating income taxes in an interim period when a year-to-date loss exceeds the anticipated loss for the year. This update also (1) requires an entity to recognize a franchise tax (or similar tax) that is partially based on income as an income-based tax and account for any incremental amount incurred as a non-income-based tax, (2) requires an entity to evaluate when a step-up in the tax basis of goodwill should be considered part of the business combination in which goodwill was originally recognized for accounting purposes and when it should be considered a separate transaction, and (3) requires that an entity reflect the effect of an enacted change in tax laws or rates in the annual effective tax rate computation in the interim period that includes the enactment date. The Company adopted this ASU on July 1, 2021. Upon adoption, there was no effect to the Company.\nThe Company has considered all new accounting pronouncements and has concluded that there are no new pronouncements that may have a material impact on results of operations, financial condition, or cash flows, based on current information.\nNote 3. Going Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern. As of June 30, 2023, the Company had no cash and negative working capital of $297,610. For the years ended June 30, 2023 and June 30, 2022, the Company had losses of $89,920 and $114,605, respectively. These conditions raise substantial doubt about the Companys ability to continue as a going concern for a reasonable period of time. The future of the Company is dependent upon managements success in its efforts and limited resources to conduct the Companys current business. These financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nCurrently, the Company obtain capital from a significant shareholder to meet its minimal operating expenses. If the current single business model is not successful, we do not believe that we could succeed in raising additional capital from unrelated parties or to sustain our operations without some strategic transaction, such as a business combination or merger. If we are unable to generate enough revenues to cover the costs of operation, we expect that we would need to either continue to borrow funds from related party, or cease all operations and wind down. Although we are currently evaluating our strategic alternatives with respect to all aspects of our business, we cannot assure you that any actions that we take would raise or generate sufficient capital to fully address the uncertainties of our financial position.\nNote 4. Accounts Receivable\nThe carrying value of accounts receivable is reduced by an allowance that reflects the Companys best estimate of the amounts that will not be collected. The Company makes estimations of the collectability of accounts receivable. Many factors are considered in estimating the general allowance, including reviewing delinquent accounts receivable, performing an aging analysis and a customer credit analysis, and analyzing historical bad debt records and current economic trends.\nOur accounts receivable consisted of $101,552 with no bad debt allowance as of June 30, 2023 and nil as of June 30, 2022.\nNote 5. Inventories\nOur inventories consisted of $66,954 of Rocitin NMN as of June 30, 2023 and nil as of June 30, 2022.\nNote 6. Related Party Transactions\nAdvances from related party:\nOn March 31, 2021, we entered into a Loan Agreement with New York Listing Management Inc, a significant shareholder of the Company, under which we receive funding for general operating expenses from time-to-time as needed by the Company. The Loan Agreement bears an interest of 8% per annum and shall be due and payable on a date 366 days from the date of the loan. On April 1, 2022, the Loan Agreement was extended to March 31, 2023. On April 1, 2023, the Loan Agreement was re-signed. Under the new term, the loan has no expiration date and is due on demand. As of June 30, 2023 and June 30, 2022 the outstanding balance on this loan was $415,601 and $191,091, with accrued interest of $7,812 and $3,329, respectively. During the years ended June 30, 2023 and June 30, 2022, the Company borrowed $224,510 and $131,336, respectively, under this Loan Agreement. During the years ended June 30, 2023 and June 30, 2022 the Company expensed interest of $22,188 and $9,158, respectively, related to this Loan Agreement.\nNote 7. Income Taxes\nWe have adopted ASC 740 which provides for the recognition of a deferred tax asset based upon the value the loss carry-forwards will have to reduce future income taxes and managements estimate of the probability of the realization of these tax benefits.\nWe have a current operating loss carry-forward of $575,191. We have determined it more likely than not that these timing differences will not materialize and have provided a valuation allowance against substantially all our net deferred tax asset.\nFuture utilization of currently generated federal and state NOL and tax credit carry forwards may be subject to a substantial annual limitation due to the ownership change limitations provided by the Internal Revenue Code of 1986, as amended and similar state provisions. The annual limitation may result in the expiration of NOL and tax credit carry forwards before full utilization.\nSchedule of Deferred Tax Assets\nJune 30, 2023 June 30, 2022\nIndividual components giving rise to the deferred tax assets are as follows:\nFuture tax benefit arising from net operating loss carryovers $ 55,459 $ 103,835\nLess valuation allowance (55,459 ) (103,835 )\nTotal deferred tax asset $ - $ -\nThe Company is not under examination by any jurisdiction for any tax year. Our federal and state income tax returns are open for fiscal years ending on or after June 30, 2007.\nNote 8. Stockholders Equity\nCommon Stock\nThe certificate of incorporation authorizes the issuance of 450,000,000 shares of common stock, par value $0.0001. All issued shares of common stock are entitled to one vote per share of common stock. As of June 30, 2023, the Company has 2,380,958 shares of common stock issued and outstanding.\nDuring the years ended June 30, 2023, and 2022, the Company did not issue any shares of common stock.\nPreferred Stock\nThe certificate of incorporation authorizes the issuance of 50,000,000 shares of preferred stock with a par value of $0.0001 per share. None are issued.\nStock Based Compensation\nThere were no grants of employee or non-employee stock or options in either fiscal period ended June 30, 2023 and 2022.\nNote 9. Subsequent Events\nThe Companys management has performed subsequent events procedures through the date the financial statements were available to be issued. There were no other subsequent events requiring adjustment to or disclosure in the consolidated financial statements."
}