{
    "cik": "1015155",
    "company": "CHARLES & COLVARD LTD",
    "filing_type": "10-K",
    "filing_date": "2023-10-12",
    "period_of_report": "2023-06-30",
    "sic": "3910",
    "state_of_inc": "NC",
    "state_location": "NC",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1015155/0001140361-23-048055-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1015155/000114036123048055/ef20010992_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1015155/0001140361-23-048055.txt",
    "filename": "1015155_10K_2023_0001140361-23-048055.htm",
    "content": "Item 1.\nBusiness\nOverview\nOur Mission\nAt Charles & Colvard, Ltd., our mission is to provide a more conscious and conflict-free fine jewelry experience for our customers. We are dedicated to blazing a more brilliant path forward with our Made, not Mined™ gemstones and committed to creating fine jewelry with a conscience.\nAbout Charles & Colvard\nCharles & Colvard, Ltd., a North Carolina corporation founded in 1995 (which may be referred to as Charles & Colvard, we, us, or our) is a globally recognized fine jewelry company specializing in lab created gemstones. We manufacture, market, and distribute Charles & Colvard Created Moissanite® (which we refer to as moissanite or moissanite jewels) and in September 2020, we announced our expansion into the lab grown diamond market with the launch of Caydia®, an exclusive brand of premium lab grown diamonds. We offer gemstones and finished jewelry featuring our proprietary moissanite jewels and premium lab grown diamonds for sale in the worldwide fine jewelry market. Charles & Colvard is the original source of created moissanite, and in 2015, we debuted Forever One™, our premium moissanite gemstone brand. As an e-commerce and multi-channel destination for fine jewelry featuring lab grown gemstones, we believe that the addition of lab grown diamonds is a natural progression for the Charles & Colvard brand.\nOne of our unique differentiators, moissanite - The Worlds Most Brilliant Gem® - is core to our ambition to create a movement around environmentally and socially responsible fine jewelry that is as exquisite as it is ethical. We believe that we are leading the way in delivering the premium moissanite brand through technological advances in gemstone manufacturing, cutting, polishing, and setting. By coupling what we believe to be unprecedented moissanite jewels with responsibly sourced precious metals, we are delivering a uniquely positioned product line for the conscientious consumer. Our Caydia® lab grown diamonds are hand selected by our Gemological Institute of America, or GIA, certified gemologists to meet Charles & Colvards uncompromising standards and validated by independent third-party experts. Our Caydia® lab grown diamonds are available currently in E, F, and G color grades (based on the GIAs color grading scale) with a minimum clarity in accordance with the GIAs VS1 clarity classification along with excellent polish and symmetry. All of our Caydia® lab grown diamonds as well as our moissanite gemstones are set with responsibly-sourced, mostly recycled precious metals.\nOur strategy is to build a globally revered and ethical brand of lab created gemstones and finished jewelry that appeal to a wide consumer audience. We believe this strategy leverages our advantages of being the original and leading worldwide source of Charles & Colvard Created Moissanite® and offering a curated assortment of jewelry featuring Caydia® lab grown diamonds, which together we believe offers an ideal combination of ethics, quality, and value. We believe a direct relationship with consumers is important to this strategy, which entails delivering tailored educational content, engaging in dialogue with our audience, and positioning our brand to meet the demands of todays conscious and ethically minded consumer.\nWe believe our expanding application of an omni-channel sales strategy across the jewelry trade and to the end consumer with accessible lab created gemstones and value branded finished jewelry featuring Charles & Colvard moissanite and lab grown diamonds positions our goods at the many touchpoints where consumers are when they are making their buying decisions - thereby creating greater exposure for our brand and increasing consumer demand.\nWe sell loose moissanite jewels, lab grown diamonds, and finished jewelry set with these gems through two operating segments: our Online Channels segment, which encompasses our digital properties components, comprised of our charlesandcolvard.com, charlesandcolvarddirect.com, and moissaniteoutlet.com websites, e-commerce outlets, including marketplaces, drop-ship customers, and other pure-play, exclusively e-commerce customers; and our Traditional segment, which consists of domestic and international distributors and retail customers, including end-consumers through our first Charles & Colvard Signature Showroom, which opened in October 2022.\nWe report segment information based on the management approach. This segment reporting approach designates the internal reporting used by management for making operating decisions and assessing performance as the source of our operating and reportable segments. For more information about our operating segments, see Note 3 to our consolidated financial statements in Item 8, Financial Statements and Supplementary Data, of this Annual Report on Form 10-K.\nCybersecurity Event\nOn or about June 28, 2023, we identified a cybersecurity incident that temporarily disrupted the Companys IT network and resulted in some limited downtime for certain systems. Upon discovery, we took immediate action to activate our incident response and business continuity protocols. We took immediate action to contain the incident, and appropriate incident response professionals were engaged to assist in investigating the nature and scope of the event and to further harden the Companys defenses. Through investigation, we confirmed that this event was related to an apparent ransomware attack involving the unauthorized encryption of some Company files and the deployment of malware.\nOur investigation revealed no evidence that any sensitive customer data was compromised as a result of this incident, and our relationship with our customers has not been negatively impacted. We have worked closely with engaged security specialists to assist in the review and assessment of our information technology controls, and, subsequent to June 30, 2023, we implemented recommended strengthening of our access requirements, and improved our unauthorized access detection.\nSubsequent to June 30, 2023, we temporarily implemented manual processes to conduct our operations with as little disruption to production as possible. All major systems, including our enterprise resource planning, or ERP, financial systems and affected manufacturing and service operations, were restored as quickly as possible from available backups, and the incident did not have a material impact on the operations of our business operating segments. No payments were made to the ransomware threat actors.\nWe have incurred costs in the first quarter of the fiscal year ending June 30, 2024, or Fiscal 2024, and expect to continue to incur costs in connection with this incident. In the first quarter of 2024, these costs have been primarily comprised of various third-party consulting services, including forensic experts, restoration experts, legal counsel, and other information technology professional expenses, enhancements to our cybersecurity measures, costs to restore our systems and access our data, and employee-related expenses, including with respect to increased overtime. We expect to incur these, and other costs related to this incident in the future.\nAdditional information on the risks we face related to this event and other potential cybersecurity incidents is included in Part I, Item 1A.\nRisk Factors\nWe operate in a dynamic and rapidly changing business environment that involves substantial risk and uncertainty, and these risks may change over time. The following discussion addresses some of the risks and uncertainties that could cause, or contribute to causing, actual results to differ materially from expectations. In evaluating our business, you should pay particular attention to the descriptions of risks and uncertainties described below. If any of these risks actually occur, our business, financial condition, or results of operations could be materially and adversely affected.\nRisks Related to our Operations\nOur business and our results of operations could be materially adversely affected as a result of general economic and market conditions. Our business, including our sales volumes and overall profitability, depends on consumer demand for our products and could be adversely impacted further by unfavorable general economic conditions, declines in consumer confidence and consumer disposable income, rising energy and fuel prices, increasing freight costs, rising inflation rates, recession and fears of recession, consumer debt levels, increased interest rates, and higher tax rates. Our business could also be adversely impacted by possible disruptions in global financial markets, including severely diminished liquidity and credit availability, declines in economic growth, increased unemployment levels, and uncertainty about economic stability, including the increased risk of global trade tensions and geopolitical unrest such as the ongoing conflict between Russia and Ukraine, and domestic political and geopolitical instability. We are unable to predict the likely duration and severity of the effects of these disruptions in the financial markets and the adverse domestic and global economic conditions, and if these economic conditions deteriorate, our business and results of operations could be materially and adversely affected.\nOngoing unfavorable economic conditions may continue to lead consumers to further delay or reduce purchases of our products and services and projected consumer demand for our products and services may not grow as we expect. The consequences of such adverse effects could also include interruptions or delays in our suppliers performance of our contracts, reductions and delays in customer purchases, delays in or the inability of customers to obtain financing to purchase our products, and bankruptcy of customers or suppliers. Prolonged or pervasive economic downturns could also slow the pace of any planned future showroom openings that we may have going forward.\nLuxury products, such as fine jewelry, are discretionary purchases for consumers. Recessionary economic cycles, higher interest rates, higher tax rates, higher fuel and energy costs, higher freight costs, higher inflation rates, higher levels of unemployment, adverse conditions in the residential real estate and mortgage markets, tighter access to consumer credit, increased consumer debt levels, unsettled financial markets, and other economic factors that may affect consumer spending or buying habits could materially and adversely affect demand for our products. In addition, volatility in the financial markets has had and may continue to have a negative impact on consumer spending patterns. A reduction in consumer spending or disposable income may affect us more significantly than companies in other industries and could have a material adverse effect on our business, results of operations, and financial condition.\nOur future financial performance depends upon increased consumer acceptance, growth of sales of our products, and operational execution of our strategic initiatives. We believe that most consumers are not generally aware of the existence and attributes of moissanite jewels and lab grown diamonds and that the consumer market for moissanite jewels, lab grown diamonds, and finished jewelry featuring both moissanite and lab grown diamonds remains in the early stages of development and consumer acceptance. The degree of future market acceptance and demand is subject to a significant amount of uncertainty. Our future financial performance will depend, in part, upon greater consumer acceptance of moissanite jewels and lab grown diamonds as an ethically sourced, affordable, luxurious alternative to other gemstones, such as a mined diamond, and our ability to develop brands and execute strategic initiatives, particularly in our Online Channels segment, to grow our sales and operating income. As we execute our strategy to build and reinvest in our business, significant expenses and investment of cash will be required going forward and this may adversely affect our operating income. If we are unable to execute and achieve desired revenue levels, we may adjust our strategic initiatives in response to the results of our investments.\nIn addition, consumer acceptance may be affected by retail jewelers and jewelry manufacturers acceptance of moissanite jewels, lab grown diamonds, and finished jewelry featuring both moissanite and lab grown diamonds. The quality, design, and workmanship of the jewelry settings, whether manufactured by us or other manufacturers, could affect both consumers perception and acceptance of our products and costs incurred by returns and markdowns.\nTherefore, as other competitors enter the moissanite and lab grown diamond market, we do and could continue to face market share and pricing pressures for our own products. In addition, the lower quality of competitors gemstones could negatively impact consumer perception of moissanite jewels and lab grown diamonds, and in turn, acceptance of our jewels.\nThus, our future financial performance may be affected by:\nOur ability to develop and promote the Charles & Colvard brands, such as Forever One™, Moissanite by Charles & Colvard®, and Caydia®, all of which are used in finished jewelry featuring moissanite and lab grown diamonds, which may in part drive interest in and demand for moissanite and lab grown diamond jewelry at the consumer level;\nOur ability to differentiate Charles & Colvard Created Moissanite® and Caydia® from competing products, including competitive moissanite and the rapidly emerging lab grown diamond industry;\nOur ability to operationally execute our digital marketing strategy for our Online Channels segment;\nOur continued ability and the ability of manufacturers, designers, and retail jewelers to select jewelry settings that encourage consumer acceptance of and demand for our moissanite jewels, lab grown diamonds, and finished jewelry;\nOur ability to understand our consumer market segment and effectively market to them a compelling value proposition that leads to converted customers;\nOur relationship with Wolfspeed;\nThe continued willingness and ability of our jewelry distributors and other jewelry suppliers, manufacturers, and designers to market and promote Charles & Colvard Created Moissanite® and Caydia® to the retail jewelry trade;\nThe continued willingness of distributors, retailers, and others in our distribution channels to purchase loose Forever One™, Moissanite by Charles & Colvard®, and Caydia® gemstones as well as their continued willingness of manufacturers, designers, and retail jewelers to undertake setting of the loose jewels;\nOur continued ability and the ability of jewelry manufacturers and retail jewelers to set loose moissanite jewels and lab grown diamonds in finished jewelry with high-quality workmanship; and\nOur continued ability and the ability of retail jewelers, including that of our internal retail jewelry marketing team in connection with the Charles & Colvard Signature Showroom, which is our first retail jewelry brick-and-mortar location that we opened in October 2022, to effectively market and sell finished jewelry featuring moissanite and lab grown diamonds to consumers.\nWe face intense competition in the worldwide gemstone and jewelry industry. The jewelry industry is highly competitive, and we compete with numerous other jewelry products. In addition, we face competition from mined diamonds, lab grown diamonds, other moissanite, and simulants. A substantial number of companies supply products to the jewelry industry, many of whom we believe have greater financial resources than we do. Competitors could develop new or improved technologies, including those for lab grown diamonds, that may render the price point for our moissanite and our lab grown diamonds noncompetitive, which could have an adverse effect on our business, results of operations, and financial condition.\nWith the launch of our Caydia® product line, we believe that our entry into the lab-grown diamond market could be a potential threat to - and increase competition for - our core moissanite products. While our moissanite gemstones and finished jewelry set with moissanite generally have different price points than those of our Caydia® product line, any cannibalization of moissanite product sales resulting from sales of our lab-created diamonds could have an adverse impact on sales of our moissanite jewels and finished jewelry set with moissanite.\nWe have previously relied on our patent rights and other intellectual property rights to maintain our competitive position. Our U.S. product and method patents for moissanite jewels expired in 2015 and most of our patents in foreign jurisdictions expired in 2016 with one in Mexico that expired in 2021. Since the expiration of our product and method patents we have noted new providers of moissanite and competitive products entering the market. We will continue to rely on our carefully executed brand awareness and digital marketing campaigns to build our consumer relationships and maintain our competitive position going forward. If, however, we are unable to successfully build strong brands for our moissanite jewels, lab grown diamonds, and finished jewelry featuring moissanite and lab grown diamonds or competition grows faster than expected, we may not have commercially meaningful protection for our products or a commercial advantage against our competitors or their competitive products or processes, which may have a material adverse effect on our business, results of operations, and financial condition.\nOur information technology, or IT, infrastructure, and our network has been and may be impacted by a cyber-attack or other security incident as a result of the rise of cybersecurity events. Our business operations rely on the secure processing, storage, and transmission of certain confidential, sensitive, proprietary, and other information, as well as personal information about our customers and employees. Cyber-attacks, including those associated with the current conflict in Eastern Europe, are rapidly evolving as cyber criminals have become increasingly sophisticated and carry out direct large-scale, complex, and automated attacks against companies or through their vendors.\nBreaches of our technology systems, whether from circumvention of security systems, denial-of-service attacks or other cyber-attacks, hacking, phishing attacks, computer viruses, ransomware or malware, employee or insider error, malfeasance, social engineering, vendor software supply chain compromises, physical breaches or other actions, have resulted and may result in manipulation or corruption of sensitive data, material interruptions or malfunctions in our websites, applications, data processing and certain products and services, or disruption of other business operations. Furthermore, any such breaches could compromise the confidentiality and integrity of material information held by us (including information about our business, employees, or customers), as well as sensitive information, the disclosure of which could lead to identity theft. Breaches of our product services that rely on technology and internet connectivity can expose us to product and other liability risk and reputational harm. Measures that we take to avoid, detect, mitigate, or recover from material incidents may be insufficient, circumvented, or may become ineffective.\nWe are not able to anticipate or prevent all such cyber-attacks and, to the extent a cyber-attack or other security incident results in a breach of the above-described information, it could disrupt our business operations, harm our reputation, compel us to comply with applicable data breach notification laws, subject us to litigation, regulatory investigation, or otherwise subject us to liability under laws, regulations and contractual obligations. This could result in increased costs to us and result in significant legal and financial exposure and/or reputational harm.\nOn or about June 28, 2023, we identified a cybersecurity incident that temporarily disrupted the Companys IT network and resulted in some limited downtime for certain systems. This event was related to an apparent ransomware attack involving the unauthorized encryption of some of our files and the deployment of malware. This incident required us to temporarily implement manual processes to conduct our operations with as little disruption to production as possible.\nWe have invested and continue to invest in risk management and information security and data privacy measures in order to protect our systems and data, including employee training, organizational investments, incident response plans, table-top exercises, and technical defenses. The cost and operational consequences of implementing, maintaining, and enhancing data or system protection measures could increase significantly to overcome intense, complex, and sophisticated global cyber threats.\nIn addition, we and certain of our third-party vendors receive and store certain information associated with our sales operations and other aspects of our business. In connection with our e-commerce business, we rely on encryption and authentication technology licensed from third parties to effect secure transmission of confidential information. Our disclosure controls and procedures address cybersecurity and include elements intended to ensure that there is an analysis of potential disclosure obligations arising from security breaches. We also maintain compliance programs to address the potential applicability of restrictions against trading while in possession of material, nonpublic information generally and in connection with a cybersecurity breach. The breakdown in existing controls and procedures around our cybersecurity environment may prevent us from detecting, reporting or responding to cyber incidents in a timely manner and could have a material adverse effect on our financial position and value of our Companys stock. Despite our implementation of security measures, our IT systems and e-commerce business are vulnerable to damages from computer viruses, natural disasters, unauthorized access, cyber-attack, and other similar disruptions.\nConstantly evolving privacy regulatory regimes are creating new legal compliance challenges. Domestic and international privacy and data security laws are complex and changing rapidly. There are a variety of laws and regulations, including regulations by federal government agencies, including the Federal Trade Commission, or FTC, and state and local agencies. In addition to federal laws such as §5 of the Federal Trade Commission Act, the Gramm-Leach-Bliley Act, and the Fair Credit Reporting Act, certain states have also enacted laws regulating companies collection, use, and disclosure of personal information and requiring the implementation of reasonable data security measures. Various laws across states and U.S. territories also require businesses to notify affected individuals, governmental entities, and/or credit reporting agencies of certain security breaches affecting personal information. International privacy laws, including in Canada and the European Union, or E.U., pose further challenges. These domestic and international laws are not consistent, and compliance with these laws in the event of a widespread data breach would be complex and costly.\nIn addition, privacy advocates and industry groups have regularly proposed, and may propose in the future, self-regulatory standards by which we are legally or contractually bound. If we fail to comply with these obligations or standards, we may face substantial liability or fines.\nDespite our efforts to comply with all applicable data protection laws and regulations, any actual or perceived non-compliance could result in litigation and proceedings against us by governmental entities, customers, or others, fines and civil or criminal penalties, limited ability or inability to operate our business, offer services, or market our business in certain jurisdictions, negative publicity and harm to our brand and reputation, and reduced overall demand for our products and services. Such occurrences could adversely affect our business, financial condition, and results of operations.\nWe have historically been dependent on a single supplier for substantially all of our silicon carbide, or SiC crystals, the raw materials we use to produce moissanite jewels; if our supply of high-quality SiC crystals is interrupted, our business may be materially harmed. We are party to an exclusive supply agreement with Wolfspeed, which we have historically been dependent on for the provision of substantially all of the SiC material we use to produce moissanite jewels. Under the terms and conditions of the Supply Agreement, we agreed to purchase from Wolfspeed, and Wolfspeed agreed to supply, all of our required SiC material, subject to terms and conditions that allow us to purchase certain amounts of SiC materials from third parties under limited conditions. The Supply Agreement will expire by its terms in 2025, and Wolfspeed has initiated a confidential arbitration alleging we are in breach of the agreement (see We are subject to arbitration, litigation, and demands, which could result in significant liability and costs, and impact our resources and reputation. and Item 3, Legal Proceedings). If our supply of high-quality SiC crystals is interrupted, then we may not be able to meet demand for moissanite jewels and our business may be materially and adversely affected. There is no guaranty that we would be able to obtain similar quality SiC crystals from another provider. There can be no assurance that Wolfspeed will continue to produce and supply us with SiC crystals of sufficient quality, sizes, and volumes that we desire or that we will be able to continue to negotiate future purchase commitments at acceptable, competitive prices that enable us to manage our inventories and raw material costs effectively.\nWe are subject to certain risks due to our international operations, distribution channels, and vendors. We have continued our direct international sales operations, with international net sales accounting for approximately 3% of total consolidated net sales during Fiscal 2023. We also currently have numerous international wholesale distributors and retail sales channels covering portions of Canada, the U.K., Western Europe, Australia and New Zealand, Southeast Asia, the Middle East, and China. In addition, we use certain companies based outside the U.S. to facet our moissanite jewels and to manufacture finished jewelry. Any international expansion plans we choose to undertake will increase the complexity of our business, require attention from management and other personnel and cause additional strain on our operations, financial resources and our internal financial control and reporting functions. Further, our expansion efforts may be unsuccessful as we have limited experience selling our products in certain international markets and in conforming to the local cultures, standards, or policies necessary to successfully compete in those markets. In addition, we may have to compete with retailers that have more experience with local markets. Our ability to expand and succeed internationally may also be limited by the demand for our products, the ability to successfully transact in foreign currencies, the ability of our brand to resonate with consumers globally and the adoption of online or Internet commerce in these markets. Different privacy, censorship and liability standards and regulations, and different intellectual property laws in foreign countries may also prohibit expansion into such markets or cause our business and results of operations to suffer. Through our planned international expansion and our continued reliance on development of foreign markets and use of foreign vendors, we are subject to the risks of conducting business outside of the U.S.\nThese risks include the following:\nthe adverse effects on U.S.-based companies operating in foreign markets that might result from war; terrorism; changes in diplomatic, trade, or business relationships (including labor disputes); or other political, social, religious, or economic instability;\nan outbreak of a contagious disease, such as COVID-19 and other potential future public health crises, which may cause us or our distributors, vendors, or customers to temporarily suspend our or their respective operations in the affected city or country;\nthe continuing adverse economic effects of any global financial crisis;\nunexpected changes in, or impositions of, legislative or regulatory requirements;\ndelays resulting from difficulty in obtaining export licenses;\ninternational regulatory requirements, tariffs and other trade barriers and restrictions, including the consequences of U.S. or international led tariff actions;\nthe burdens of complying with a variety of foreign laws and regulations, including foreign taxation and varying consumer and data protection laws, and other factors beyond our control, and the risks of non-compliance;\nlonger payment cycles and greater difficulty in collecting accounts receivable;\nour reliance on third-party carriers for product shipments to our customers;\nrisk of theft of our products during shipment;\nlimited payment, shipping and insurance options for us and our customers;\ndifficulties in obtaining export, import or other business licensing requirements;\ncustoms and import processes, costs or restrictions;\nthe potential difficulty of enforcing agreements with foreign customers and suppliers; and\nthe complications related to collecting accounts receivable through a foreign countrys legal or banking system.\nIn particular, there is currently significant uncertainty about the future relationship between the U.S. and various other countries, with respect to trade policies, treaties, government regulations, and tariffs. For example, the recent imposition of tariffs and/or increase in tariffs on various products by the U.S. and other countries, including China and Canada, have introduced greater uncertainty with respect to trade policies and government regulations affecting trade between the U.S. and other countries, and new and/or increased tariffs have subjected, and may in the future subject, us to additional costs and expenditure of resources. Major developments in trade relations, including the imposition of new or increased tariffs by the U.S. and/or other countries, and any emerging nationalist trends in specific countries could alter the trade environment and consumer purchasing behavior which, in turn, could have a material effect on our financial condition and results of operations. The U.S. and China signed a contingent trade deal to reduce planned tariff increases. However, because of the current geopolitical unrest in eastern Europe and the apparent Chinese-Russian alliance, concerns over the stability of these bilateral trade relations continue to exist, and in some cases, have heightened in 2023.\nSeparately, with the U.K.s exit from the E.U. in January 2020, known as Brexit, the ongoing uncertainties of the trading relationship between the U.K. and the E.U. have yet to be completely realized and the ultimate outcome and long-term impacts for the U.K. and Europe remain uncertain. Ongoing changes and uncertainties related to Brexit, including trade frictions and Britains high inflation rate, continue to subject us to heightened trade risks in that region. In addition, disruptions to trade and free movement of goods, services, and people to and from the U.K., disruptions to the workforce of our business partners, increased foreign exchange volatility with respect to the British pound, and additional legal, political and economic changes also subject us to further uncertainty in the region. If these actions impacting our international distribution and sales channels result in increased costs for us or our international partners, such changes could result in higher costs to us, adversely affecting our operations, particularly as we expand our international presence.\nAdditionally, while substantially all of our foreign transactions are denominated in U.S. dollars, foreign currency fluctuations could impact demand for our products or the ability of our foreign suppliers to continue to perform. Further, some of our foreign distributors operate relatively small businesses and may not have the financial stability to assure their continuing presence in their markets. There can be no assurance that the foregoing factors will not adversely affect our operations in the future or require us to modify our anticipated business practices.\nOur business and our results of operations could be materially adversely affected as a result of our inability to fulfill orders on a timely basis. The availability of certain shapes and sizes of our loose moissanite and lab grown diamond gems, including our Forever-One™, Moissanite by Charles & Colvard®, and Caydia® gems, may be at risk. In addition, finished jewelry has a large variety of styles of which we maintain on-hand stock for such core designs as stud earrings, solitaire and three-stone rings, pendants, and bracelets; and made-to-order under strict deadlines for certain wholesale and direct-to-consumer e-commerce outlets. We must adequately maintain relationships, forecast material and product demand, and operate within the lead times of third parties that facet jewels and manufacture finished jewelry settings to ensure adequate on-hand quantities and meet shipment requirements for customer orders in a timely manner. In addition, we are currently dependent upon certain vendors for most of the faceting of our loose gems. If any or all of these vendors were to cancel their arrangements with us, we could experience a disruption in our operations and incur additional costs to procure faceting services from a replacement vendor. The inability to fulfill orders on a timely basis and within promised customer deadlines could result in a cancellation of the orders and loss of customer goodwill that could materially and adversely affect our business, results of operations, and financial condition.\nWe are currently dependent on a limited number of distributor and retail partners in our Traditional segment for the sale of our products. A significant portion of the moissanite jewels and finished jewelry featuring moissanite that we sell are distributed through a limited number of distributors and retail partners in our Traditional segment, and therefore, we are dependent upon these companies for distribution of our products. Our three largest customers collectively accounted for approximately 21% and 31% of our net sales during the fiscal years ended June 30, 2023 and 2022, respectively. As we continue to build our finished jewelry business, we anticipate in the near term that a significant portion of the moissanite jewels and finished jewelry featuring moissanite that we sell through our Traditional segment will continue to be to a limited number of distributors and retailers.\nWe may experience quality control challenges from time to time that can result in lost revenue and harm to our brands and reputation. Part of our strategy for success is to align Charles & Colvard with reputable, high-quality, and sophisticated strategic partners. The achievement of this goal depends in large part on our ability to provide customers with high-quality moissanite and finished jewelry featuring moissanite. Although we take measures to ensure that we sell only the best quality products, we may face quality control challenges, which could impact our competitive advantage. There can be no assurance we will be able to detect and resolve all quality control issues prior to shipment of products to our distributors, manufacturers, retailers, and end consumers. Failure to do so could result in lost revenue, lost customers, significant warranty and other expenses, and harm to our reputation.\nThe effects of COVID-19 and other potential future public health crises, epidemics, pandemics or similar events on our business, operating results, and cash flows are uncertain. We could be negatively impacted by the widespread outbreak of an illness or other communicable disease, or any other public health crisis that results in economic and trade disruptions. During Fiscal 2023, our performance has been affected by supply chain disruptions and delays, as well as labor challenges associated with employee absences, travel restrictions, remote work, and adjusted work schedules. The impact of COVID-19 on our operational and financial performance in future periods, including our ability to execute our business plans in the expected timeframe, remains uncertain and will depend on future COVID-19-related developments, including the impact of COVID-19 infection or potential new variants or subvariants, the effectiveness and adoption of COVID-19 vaccines and therapeutics, supplier impacts and related government actions to prevent and manage disease spread, including the implementation of any federal, state, local or foreign COVID-19-related controls. The long-term impacts of COVID-19 on consumer shopping and spending patterns, including product and commodity priorities affected by general economic conditions that impact demand for our products and services and our business also are difficult to predict, but could negatively affect our future results and performance.\nSeasonality of our business may adversely affect our net sales and operating income. Sales in the retail jewelry industry are typically seasonal due to increased consumer purchases during the calendar year-end holiday season. Because historically we have primarily sold our loose moissanite jewels and finished jewelry featuring moissanite at wholesale pricing to distributors, manufacturers, and retailers, our sales to support the holiday season have largely taken place during the third and beginning of the fourth calendar quarters, depending on the sales channel and the level of advance planning and production our customers undertook. As sales of our finished jewelry featuring moissanite and lab grown diamonds to retailers and directly to consumers increase, both in dollars and as a percentage of total sales, our results for the three months in the calendar quarter ending December 31 of each year may depend upon the general level of retail sales during the holiday season as well as general economic conditions and other factors beyond our control. In anticipation of increased sales activities during the three months in the calendar quarter ending December 31 of each year, we may incur significant additional expenses and increases in our finished jewelry inventory levels to support expected sales in the second half of the calendar year.\nWe have experienced a higher degree of seasonality in the three months ending December 31, primarily as a result of the calendar year-end holiday season sales to end consumers through our Online Channels segment and as a result of increased sales through our brick-and-mortar retailers within our Traditional segment. Our quarterly results of operations may continue to fluctuate as a result of a number of factors, including seasonal cycles, the timing of new product introductions, the timing of orders by our customers, and the mix of product sales demand, and these factors may significantly affect our results of operations in a given quarter.\nOur operations could be disrupted by natural disasters. We conduct substantially all of our activities, including executive management, manufacturing, packaging, and distribution activities, at one central North Carolina location. Although we have taken precautions to safeguard our facility, including obtaining business interruption insurance, any future natural disaster, such as a hurricane, flood or fire, could significantly disrupt our operations and delay or prevent product shipment during the time required to repair, rebuild or replace our facility, which could be lengthy and result in significant expenses. Furthermore, the insurance coverage we maintain may not be adequate to cover our losses in any particular case or continue to be available at commercially reasonable rates and terms. In addition, the vendors that perform some of the faceting of our loose moissanite jewels are located in regions that are susceptible to tsunamis, flooding, and other natural disasters that may cause a disruption in our vendors operations for sustained periods and the loss or damage of our work-in-process inventories located at such vendors facilities. Damage or destruction that interrupts our ability to deliver our products could impair our relationships with our customers. Prolonged disruption of our services as a result of a natural disaster may result in product delivery delays, order cancellations, and loss of substantial revenue, which could materially and adversely affect our business, results of operations, and financial condition.\nSales of moissanite and lab grown diamond jewelry could be dependent upon the pricing of precious metals, which is beyond our control. Any increases in the market price of precious metals (primarily gold) could affect the pricing and sales of jewelry incorporating moissanite jewels and lab grown diamonds. The majority of price increases in precious metals are passed on to the end consumer in the form of higher prices for finished jewelry. These higher prices could have a negative impact on the sell-through of moissanite and lab grown diamond jewelry at the retail level. From 2007 through 2023, the price of gold has fluctuated significantly, resulting in generally higher retail price points for gold jewelry. Accordingly, higher gold prices could have an adverse impact on both sales of moissanite and lab grown diamond finished jewelry and the jewelry industry as a whole.\nOur current customers may potentially perceive us as a competitor in the finished jewelry business. As described above, we are currently dependent on a limited number of customers, including distributors and retailers, for the sale of our products in the Traditional segment. Our design, manufacture, and marketing of finished jewelry featuring moissanite and lab grown diamonds for sale to distributors and retailers may result in some of these current customers perceiving us as a competitor, despite our efforts to use primarily non-conflicting sales channels. In response, these customers may choose to reduce their orders for our products. This reduction in orders could occur faster than our sales growth in this business, which could materially and adversely affect our business, results of operations, and financial condition.\nIf the e-commerce opportunity changes dramatically or if e-commerce technology or providers change their models, our results of operations may be adversely affected. As e-commerce emerges as one of our primary selling channels, our business model becomes more reliant on third-party platforms to achieve success. Should our products, product listings, or business not meet the requirements of certain third-party transactional channels such as marketplaces, comparison shopping engines, or social commerce sites, it may affect our ability to meet our revenue targets. Additionally, Amazon.com, Inc., eBay Inc., Walmart.com, or other desirable e-commerce platforms may decide to make significant changes to their respective business models, policies, systems, or plans, and those changes could impair or inhibit our ability to sell our products through those channels. Further, a significant change in consumer online behavior or the introduction of new or disruptive technology could adversely affect overall e-commerce trends and diminish the value of investments we have made in select online channels. Any of these results could cause a significant reduction in our revenue and have a material adverse effect on our results of operations.\nGovernmental regulation and oversight might adversely impact our operations. We are subject to governmental regulations in the manufacture and sale of moissanite jewels and finished jewelry featuring moissanite and lab grown diamonds. In addition, the precious metal in our finished jewelry may be subject to requirements, which vary by country and by state, such as hallmarking and alloy content. We may be under close scrutiny both by governmental agencies and by competitors in the gemstone industry, any of which may challenge our promotion and marketing of our moissanite jewels and finished jewelry products featuring moissanite and lab grown diamonds. While we have a policy to ensure compliance with applicable regulations, if our production or marketing of moissanite jewels and/or finished jewelry featuring moissanite and lab grown diamonds is challenged by governmental agencies or competitors, or if regulations are issued that restrict our ability to market our products, our business, results of operations, and financial condition could be materially adversely affected.\nRisks Related to our Financial Position\nThe execution of our business plans could significantly impact our liquidity. The execution of our business plans to expand our Online Channels segment and global market opportunities, as well as to create required inventory of our Forever One™, Moissanite by Charles & Colvard®, and Caydia® gemstones, requires significant investment of our resources, which may reduce our cash position. Should we fail to execute our business plans, we could see delays in the return of cash from our investments, resulting in a decrease in our liquidity. Under our $5.00 million cash collateralized line of credit facility, or the JPMorgan Chase Credit Facility that we obtained from JPMorgan Chase Bank, N.A., effective July 7, 2021, as amended July 28, 2022 and amended further effective June 21, 2023, failure to comply with the covenants and defaults contained in the JPMorgan Chase Credit Facility or any other instrument or document executed in connection with the JPMorgan Chase Credit Facility could restrict our ability to draw on such facility. In addition, we currently have an effective shelf registration statement on Form S-3 on file with the SEC that allows us to periodically offer and sell, individually or in any combination, shares of common stock, shares of preferred stock, warrants to purchase shares of common stock or preferred stock, and units consisting of any combination of the foregoing types of securities, up to a total of $25.00 million, of which all is available. However, we may offer and sell no more than one-third of our public float (which is the aggregate market value of our outstanding common stock held by non-affiliates) in any 12-month period. Further, if we would be unable to access the capital markets or issue equity securities on terms that are acceptable to us or at all, our cash, cash equivalents, and restricted cash and other working capital may be constrained to meet our working capital and capital expenditure needs. Given our current liquidity position, it is unlikely that we would not be able to draw on the JPMorgan Chase Credit Facility, as amended, which matures on July 31, 2024. There is no guarantee of extension or renewal in connection with the terms and conditions of the JPMorgan Chase Credit Facility.\nWe are subject to arbitration, litigation, and demands, which could result in significant liability and costs, and impact our resources and reputation. From time to time, we may be involved in legal proceedings or subject to claims incident to the ordinary course of business. The outcome of litigation is inherently uncertain, and there can be no assurances that favorable outcomes will be obtained. On July 28, 2023, Wolfspeed initiated a confidential arbitration against us for breach of contract claiming damages, plus interest, costs, and attorneys fees. Wolfspeed has alleged that the Company failed to satisfy the purchase obligations provided in the Supply Agreement for Fiscal 2023 in the amount of $4.25 million and failed to pay for $3.30 million of SiC crystals Wolfspeed delivered to us. Wolfspeed further alleges that the Company intends to breach our remaining purchase obligations under the Supply Agreement, representing an additional $18.5 million in alleged damages. This arbitration and other such proceedings or claims could result in adverse judgments, settlements, fines, penalties, injunctions, or other relief and, regardless of outcome, can have an adverse impact on us for reasons including diverting managements attention away from our business operations and incurring substantial costs and expenses relating directly to these actions. For more information on our pending legal proceedings, see Part I, Item 3. Legal Proceedings.\nThe financial difficulties or insolvency of one or more of our major customers or their lack of willingness and ability to market our products could adversely affect results. We are subject to a concentration of credit risk amongst our major customers (some of whom are distributors), and a default by any of these customers on their amounts owed to us could have a material adverse effect on our financial position. Future sales and our ability to collect accounts receivable depend, in part, on the financial strength of our customers and our distributors willingness and ability to successfully market our products. We estimate an allowance for accounts for which collectability is at risk and this allowance adversely impacts profitability. In the event customers experience greater than anticipated financial difficulties, insolvency, or difficulty marketing products, we expect profitability to be further adversely impacted by our failure to collect accounts receivable in excess of the amount due, net of the estimated allowance. In these circumstances, we may demand the return of product sold to such customers, resulting in an increase in inventory and a reduction in accounts receivable.\nNegative or inaccurate information on social media could adversely affect our brand and reputation. We are actively using various forms of digital and social media outreach to accomplish greater awareness of our brand and the value proposition we offer. These social media platforms and other forms of Internet-based communications allow access not only by us, but by any individual, to a broad audience of consumers and other interested persons. Consumers value readily available information concerning goods that they have or plan to purchase; however, they may act on such information without further investigation or authentication. Many social media platforms, including those relating to recruiting and placement activities, immediately publish the content of their participants posts, often without filters or checks on accuracy of the content posted. While we actively monitor social media sites, we may be unable to quickly and effectively respond to or correct inaccurate and/or unfavorable information posted on social media platforms. Any such information may harm our reputation or brand, which could in turn materially and adversely affect our business, results of operations, and financial condition.\nWe rely on assumptions, estimates and data to calculate certain of our key metrics and real or perceived inaccuracies in such metrics may harm our reputation and negatively affect our business. We believe that certain metrics are key to our business, including but not limited to average order value, or AOV, and revenue growth for charlesandcolvard.com, our primary transactional website. As both the industry in which we operate and our business continue to evolve, so too might the metrics by which we evaluate our business. While the calculation of these metrics is based on what we believe to be reasonable estimates, our internal tools are not independently verified by a third party and may have a number of limitations and, furthermore, our methodologies for tracking these metrics may change over time. We continue to improve upon our tools and methodologies to capture data and believe that our current metrics are accurate; however, the improvement of our tools and methodologies could cause inconsistency between current data and previously reported data, which could confuse investors or lead to questions about the integrity of our data. In addition, if the internal tools we use to track these metrics under-count or over-count performance or contain algorithm or other technical errors, the data we report may not be accurate. Accordingly, you should not place undue reliance on these metrics.\nWe may not be able to adequately protect our intellectual property, which could harm the value of our products and brands and adversely affect our business. We rely primarily on patent, copyright, trademark, and trade secret laws, as well as confidentiality procedures and contractual restrictions, to establish and protect our proprietary rights, all of which provide only limited protection. We held U.S. product and method patents for moissanite jewels, which expired in 2015, under which we believed that we had broad, exclusive rights to manufacture, use, and sell moissanite jewels in the U.S. We had these same patents in 25 foreign jurisdictions primarily across Asia and Europe that expired in 2016 and one in Mexico that expired in 2021. However, our product and method patent expirations have enabled competitors and other businesses to duplicate and market a similar product and enter the marketplace. There can be no assurance that any patents issued to or licensed by or to us will provide any significant commercial protection, that we will have sufficient resources to protect our respective patents and proprietary rights, that any additional patents will be issued in the future, or that any existing or future patents will be upheld by a court should we seek to enforce our rights against an infringer.\nThe existence of valid patents does not prevent other companies from independently developing competing technologies. Existing producers of SiC crystals or others may refine existing processes for growing SiC crystals or develop new technologies for growing large single crystals of SiC or colorless SiC crystals in a manner that does not infringe any patents issued to or licensed by or to us. Accordingly, existing and potential competitors have been able to develop products that are competitive with or superior to certain of our products, and such competition could have a material adverse effect on our business, results of operations, and financial condition.\nIn addition, we have certain trademarks and pending trademark applications that support our moissanite and lab grown diamond branding strategy. The success of our growth strategy may depend on our continued ability to use our existing brand names in order to increase consumer awareness and further develop strong brands around our moissanite jewels and finished jewelry collections. We cannot assure that any future trademark or other registrations will be issued for pending or future applications or that we will be able to obtain licenses or other contractual rights to use brand names that may infringe the proprietary rights of third parties. We also cannot assure that any registered or unregistered trademarks or other intellectual property or contractual rights will be enforceable or provide adequate protection of our proprietary rights. Our inability to secure proprietary protection with respect to our brands could have a material adverse effect on our business, results of operations, and financial condition.\nWe also cannot be certain that our products and brand names do not or will not infringe valid patents, trademarks, and other intellectual property rights held by third parties. We may be subject to legal proceedings and claims from time to time relating to the intellectual property of others in the ordinary course of our business. Litigation to determine the validity of any third partys claims could result in significant expense and divert the efforts of our technical and management personnel, whether or not such litigation is determined in our favor. In the event of an adverse result of any such litigation, we could be required to expend significant resources to develop non-infringing technology or to obtain licenses for, and pay royalties on the use of, the technology subject to the litigation. We have no assurance that we would be successful in such development or that any such license would be available on commercially reasonable terms.\nEnvironmental, social, and governance matters may impact our business, reputation, financial condition, and results of operations. Increasingly, companies are being measured by their performance on a variety of environmental, social, and governance, or ESG, matters, which are considered to contribute to the long-term sustainability of companies performance. Recently, many investors, including large institutional investors, have publicly emphasized the importance of ESG measures to their investment decisions.\nOur assessments on ESG matters include, among others, the Companys efforts and impacts, including impacts associated with our suppliers or other business partners, on environmentally and socially responsible fine jewelry, climate change, diversity, ethics, and compliance with applicable regulations.\nThere can be no certainty that we will manage such ESG matters successfully, or that we will successfully meet investors expectations as to our proper role, or our own ESG goals and values. This could lead to risk of litigation or reputational damage relating to our ESG policies or performance. Further, our decisions regarding ESG matters may not be consistent with our short-term financial expectations and may not ultimately produce the long-term benefits that we expect, in which case our business, reputation, financial condition, and operating results may be adversely impacted.\nIf we fail to evaluate, implement, and integrate strategic acquisition or disposition opportunities successfully, our business may suffer. From time to time, we evaluate strategic opportunities available to us for product, technology, or business acquisitions or dispositions. If we choose to make acquisitions or dispositions, we face certain risks, such as failure of an acquired business to meet our performance expectations, failure to recognize cost savings from a disposition, diversion of management attention, retention of management and existing customers of our current and any acquired business, and difficulty in integrating or separating a businesss operations, personnel, and financial and operating systems. We may not be able to successfully address these risks or any other problems that arise from future acquisitions or dispositions. Any failure to successfully evaluate strategic opportunities and address risks or other problems that arise related to any acquisition or disposition could adversely affect our business, results of operations, and financial condition.\nRisks Related to Ownership of our Common Stock\nOur failure to maintain compliance with Nasdaqs continued listing requirements could result in the delisting of our common stock. Our common stock is currently listed on The Nasdaq Capital Market. In order to maintain this listing, we must satisfy minimum financial and other requirements. On June 12, 2023, we received a notification letter from Nasdaqs Listing Qualifications Department indicating that we are not in compliance with Nasdaq Listing Rule 5550(a)(2), because the minimum bid price of our common stock on the Nasdaq Capital Market has closed below $1.00 per share for 30 consecutive business days. The notification letter has no immediate effect on the Nasdaq listing or trading in our common stock. In accordance with Nasdaq Listing Rule 5810(c)(3)(A), we have 180 calendar days, or until December 11, 2023, to regain compliance with the minimum $1.00 bid price per share requirement. To regain compliance, any time before December 11, 2023, the bid price of our common stock must close at $1.00 per share or more for a minimum of 10 consecutive business days. On December 11, 2023, if we meet the continued listing requirement for market value of publicly held shares and all other initial listing standards for The Nasdaq Capital Market (except for the minimum bid price requirement), and we notify Nasdaq of our intent to cure the deficiency, we may be provided with an additional 180 calendar day compliance period to regain compliance. If we are not eligible for an additional compliance period at that time, Nasdaq will provide us with written notification that our common stock will be subject to delisting. Upon such notice, we may appeal Nasdaqs delisting determination to a Nasdaq hearing panel. There can be no assurance that, if we appeal Nasdaqs determination, such appeal would be successful.\nWhile we intend to engage in efforts to regain compliance, and thus maintain our listing, there can be no assurance that we will be able to regain compliance during the applicable time periods set forth above. If we fail to continue to meet all applicable listing requirements in the future and Nasdaq determines to delist our common stock, the delisting could substantially decrease trading in our common stock and adversely affect the market liquidity of our common stock; adversely affect our ability to obtain financing on acceptable terms, if at all; and may result in the potential loss of confidence by investors, suppliers, customers, employees, and fewer business development opportunities. Additionally, the market price of our common stock may decline further, and shareholders may lose some or all of their investment.\nSome anti-takeover provisions of our charter documents may delay or prevent a takeover of our Company. A number of provisions of our articles of incorporation and bylaws impact matters of corporate governance and the rights of shareholders. Certain of these provisions have an anti-takeover effect and may delay or prevent takeover attempts not first approved by our Board of Directors (including takeovers that certain shareholders may deem to be in their best interests). These provisions also could delay or frustrate the removal of incumbent directors or the assumption of control by shareholders. We believe that these provisions are appropriate to protect our interests and the interests of all of our shareholders.\nWe cannot guarantee that our share repurchase program will be utilized to the full value approved, or that it will enhance long-term stockholder value and repurchases we consummate could increase the volatility of the price of our common stock and could have a negative impact on our available cash balance. Our Board authorized a share repurchase program pursuant to which we may repurchase up to $5.00 million of our common stock through April 29, 2025. The manner, timing and amount of any share repurchases may fluctuate and will be determined based on a variety of factors, including the market price of our common stock, our priorities for the use of cash to support our business operations and plans, general business and market conditions, tax laws, and alternative investment opportunities. The share repurchase program authorization does not obligate us to acquire any specific number or dollar value of shares. Further, our share repurchases could have an impact on our share trading prices, increase the volatility of the price of our common stock, or reduce our available cash balance such that we will be required to seek financing to support our operations. Our share repurchase program may be modified, suspended, or terminated at any time, which may result in a decrease in the trading prices of our common stock. Even if our share repurchase program is fully implemented, it may not enhance long-term stockholder value. Item 1B.\nUnresolved Staff Comments\nNot applicable. Item 2.\nProperties\nWe currently lease approximately 36,350 square feet of office, retail, storage, and light manufacturing space in Research Triangle Park, North Carolina, from an unaffiliated third-party that is used by both of our current operating and reportable business segments.\nThe majority of all U.S. personnel, including our executive offices, sales offices, and administrative personnel, as well as our production and distribution facilities are housed in our current leased space. Item 3.\nLegal Proceedings\nFrom time to time, we may be involved in legal proceedings or subject to claims incident to the ordinary course of business. The outcome of litigation is inherently uncertain, and there can be no assurances that favorable outcomes will be obtained. In addition, regardless of the outcome, such proceedings or claims can have an adverse impact on us because of defense and settlement costs, diversion of resources and other factors.\nOn July 28, 2023, Wolfspeed initiated a confidential arbitration against us for breach of contract claiming damages, plus interest, costs, and attorneys fees. Wolfspeed has alleged that the Company failed to satisfy the purchase obligations provided in the Supply Agreement for Fiscal 2023 in the amount of $4.25 million and failed to pay for $3.30 million of SiC crystals Wolfspeed delivered to us. Wolfspeed further alleges that the Company intends to breach our remaining purchase obligations under the Supply Agreement, representing an additional $18.5 million in alleged damages.\nWhile the Company is evaluating Wolfspeeds claims, we dispute the amount sought, and we intend to vigorously defend our position, including asserting rights and defenses that the Company may have under the Supply Agreement, at law and in equity. A hearing has not yet been scheduled. The final determinations of liability arising from this matter will only be made following comprehensive investigations, discovery and arbitration processes. Item 4.\nMine Safety Disclosures\nNot applicable.\nPART II Item 5.\nMarket for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nPeriod\nTotal\nNumber of\nShares\nPurchased\nAverage Price\nPaid per share\nTotal Number of\nshares Purchased\nas Part of\nPublicly\nAnnounced Plans\nor Programs(1)\nApproximate\nDollar Value of\nShares that May\nYet be Purchased\nUnder the Plans or\nPrograms\nApril 1, 2023 - April 30, 2023\n-\n$\n-\n-\n$\n4,510,021\nMay 1, 2023 - May 31, 2023\n-\n$\n-\n-\n$\n4,510,021\nJune 1, 2023 - June 30, 2023\n-\n$\n-\n-\n$\n4,510,021\nTotal\n-\n$\n-\n-\n$\n4,510,021\n(1)\nOn May 5, 2022, we announced that our Board of Directors had approved a share repurchase program to permit us to repurchase up to $5.00 million worth of our issued and outstanding common stock over the three-year period ending April 29, 2025.\nMarket for Registrants Common Equity\nOur common stock is traded on the Nasdaq Capital Market under the symbol CTHR. As of September 29, 2023, there were 210 shareholders of record of our common stock.\nWe did not pay any dividends on our common stock during the fiscal years ended June 30, 2023 and 2022. We will regularly review and consider the best policies and practices for our company, including the dividend policy. The payment of future dividends will be dependent on the facts and circumstances at the time of that review. Item 6.\n[Reserved] Item 7.\nManagements Discussion and Analysis of Financial Condition and Results of Operations\nThe following Managements Discussion and Analysis of Financial Condition and Results of Operations, or MD&A, is intended to provide a better understanding of our consolidated financial statements, including a brief discussion of our business and products, key factors that impacted our performance, and a summary of our operating results. This information should be read in conjunction with Item 1A, Risk Factors and our consolidated financial statements and the notes thereto included in Item 8, Financial Statements and Supplementary Data of this Annual Report on Form 10-K. Historical results and percentage relationships among any amounts in the consolidated financial statements are not necessarily indicative of trends in operating results for future periods.\nBusiness Overview\nOur Mission\nAt Charles & Colvard, Ltd., our mission is to provide a more conscious and conflict-free fine jewelry experience for our customers. We are dedicated to blazing a more brilliant path forward with our Made,\nnot Mined™ gemstones and committed to creating fine jewelry with a conscience.\nAbout Charles & Colvard\nCharles & Colvard, Ltd., a North Carolina corporation founded in 1995 (which may be referred to as Charles & Colvard, we, us, or our) is a globally recognized fine jewelry company specializing in lab created gemstones. We manufacture, market, and distribute Charles & Colvard Created Moissanite® (which we refer to as moissanite or moissanite jewels) and in September 2020, we announced our expansion into the lab grown diamond market with the launch of Caydia®, an exclusive brand of premium lab grown diamonds. We offer gemstones and finished jewelry featuring our proprietary moissanite jewels and premium lab grown diamonds for sale in the worldwide fine jewelry market. Charles & Colvard is the original source of created moissanite, and in 2015, we debuted Forever One™, our premium moissanite gemstone brand. As an e-commerce and multi-channel destination for fine jewelry featuring lab grown gemstones, we believe that the addition of lab grown diamonds is a natural progression for the Charles & Colvard brand.\nWe sell loose moissanite jewels, lab grown diamonds, and finished jewelry set with these gems through two operating segments: our Online Channels segment, which encompasses our digital properties components, comprised of our charlesandcolvard.com and moissaniteoutlet.com websites, charlesandcolvarddirect.com, e-commerce outlets, including marketplaces, drop-ship customers, and other pure-play, exclusively e-commerce customers; and our Traditional segment, which consists of domestic and international distributors and retail customers, including end-consumers through our first Charles & Colvard Signature Showroom, which opened in October 2022. We report segment information based on the management approach. This segment reporting approach designates the internal reporting used by management for making operating decisions and assessing performance as the source of our operating and reportable segments.\nWe operate in an e-commerce environment characterized by both complexity in global markets and ongoing economic uncertainties in the U.S. and internationally. Our strategy is to build a globally revered and accessible brand of gemstones and finished fine jewelry products set with moissanite and lab grown diamonds. We believe that our goods appeal to a wide consumer audience and leverage our advantage of being the original and leading worldwide source of moissanite and purveyor of premium lab grown diamonds. We believe a direct relationship with consumers is an important component to this strategy, which entails delivering tailored educational content, engaging in interactive dialogue with our audience, and positioning our brand to meet the demands of todays discerning consumer. A significant component of our strategy in this environment is to focus on our core products, improving the quality and predictability of the delivery of our products and services, and placing those products quickly into the hands of our U.S. and international customers at affordable prices. Moreover, recognizing today that our customers and vendors are resource constrained, we are endeavoring to develop and extend our portfolio of products in a disciplined manner with a focus on domestic markets close to our core capabilities, as well as growing our global marketplace sales. We continue to focus on affordability initiatives. We also expect to continue innovating and investing in lab created gemstone technologies to fulfill evolving product requirements for our customers and investing in our people so that we have the technical and production skills necessary to succeed without limiting our ability to build sound financial returns to our investors.\nWe believe our expanding application of an omni-channel sales strategy across the fine jewelry trade and to the end consumer with accessible gemstones and value branded finished jewelry featuring Charles & Colvard Created Moissanite® and Caydia® lab grown diamonds positions our products at the many touchpoints where consumers are when they are making their buying decisions - thereby continuing to create greater exposure for our brand and increasing consumer demand.\nCybersecurity Event Update\nOn or about June 28, 2023, we identified a cybersecurity incident that temporarily disrupted the Companys IT network and resulted in some limited downtime for certain systems. Upon discovery, we took immediate action to activate our incident response and business continuity protocols. We took immediate action to contain the incident and appropriate incident response professionals were engaged to assist in investigating the nature and scope of the event and to further harden the Companys defenses. Through investigation, we confirmed that this event was related to an apparent ransomware attack involving the unauthorized encryption of some Company files and the deployment of malware.\nOur investigation revealed no evidence that any sensitive customer data was compromised as a result of this incident, and our relationship with our customers has not been negatively impacted. We have worked closely with engaged security specialists to assist in the review and assessment of our information technology controls, and, subsequent to June 30, 2023, we implemented recommended strengthening of our access requirements, and improved our unauthorized access detection.\nSubsequent to June 30, 2023, we temporarily implemented manual processes to conduct our operations with as little disruption to production as possible. All major systems, including our enterprise resource planning, or ERP, financial systems and affected manufacturing and service operations, were restored as quickly as possible from available backups, and the incident did not have a material impact on the operations of our business operating segments. No payments were made to the ransomware threat actors.\nWe have incurred costs in the first quarter of the fiscal year ending June 30, 2024, or Fiscal 2024, and expect to continue to incur costs in connection with this incident. In the first quarter of 2024, these costs have been primarily comprised of various third-party consulting services, including forensic experts, restoration experts, legal counsel, and other information technology professional expenses, enhancements to our cybersecurity measures, costs to restore our systems and access our data, and employee-related expenses, including with respect to increased overtime. We expect to incur these and other costs related to this incident in the future.\nAdditional information on the risks we face related to this event and other potential cybersecurity incidents is included in Part I, Item 1A., Risk Factors.\nHighlights of the Fiscal Year Ended June 30, 2023\nDuring the fiscal year ended June 30, 2023, we delivered on several key initiatives, which we believe positions us for future growth as we move forward into the fiscal year ending June 30, 2024, or Fiscal 2024. These accomplishments in the fiscal year ended June 30, 2023, or Fiscal 2023, include the following:\nStrengthen our Brand. In early December 2022, we hosted a multiple-day private press event in New York City that included interviews with editors of numerous fashion and jewelry print and electronic media publications to showcase and promote our brand of fine jewelry. Throughout the fiscal quarter ended December 31, 2022, our finished jewelry products were featured in multiple national and local print and electronic media publications, such as InStyle, HuffPost, Forbes, AC Magazine, The Knot®, National Jeweler, WRAL, and the Triangle Business Journal. During the quarter, we also launched local print media public relations campaigns in Midtown Magazine and Raleigh\nMagazine to promote the opening of our Charles & Colvard Signature Showroom. In January 2023, we launched our bridal and fashion jewelry collections on 15- and 30-second commercial advertisement packages on NBC Universals Peacock Streaming Service, or Peacock. Peacock is now the streaming home for NBCs broadcast shows, including the networks own Peacock Original Broadcasts on Originals Hub, Bravo Hub, NBC Network Hub, Telemundo Hub, WWE Hub, MSNBC Hub, and Hallmark Channel Hub. In mid-January, we participated in the Wedding Venue at Raleigh, North Carolinas Maxwell Winter Showcase. Charles & Colvard was the premier bridal and anniversary jewelry vendor that participated in this event. Raleighs Maxwell events are well known in the Central North Carolina region and offer a setting where a touch of modern elegance meets classic luxury. This event, in particular, provided our collections with a premier setting to showcase our bridal and anniversary fine jewelry brands to the regional retail market. In April 2023 we hosted a private/invite-only Spring Preview in New York City with over 30 editors and influencers from The Knot, NBCU, Today, US Weekly, etc. to showcase new Forever One™ and Caydia® fine jewelry styles;\nMarketing Strategy to Increase Awareness. In addition to the accomplishments discussed above in Strengthen Our Brand, as we move forward into Fiscal 2024, our strategic focus remains centered on the health and growth of our brand on a global scale. We will continue to execute our key strategies with an ongoing commitment to measured spending and generating sustainable earnings improvement. In December 2022, the popularity of our Made, not Mined™ Caydia® lab grown diamonds was the subject of a proprietary news feature broadcast on Spectrum News Channel 1, which is a primary cable news channel network that is broadcast statewide throughout North Carolina. Lastly, and in conjunction with our community outreach programs, during the December year-end holiday season, we sponsored the 29th Annual Jingle Ball at the North Carolina Museum of Natural Sciences, which is hosted by Capital City Clauses, Inc., a federally registered 501(c)(3) nonprofit corporation whose mission is to enrich childrens lives in the Raleigh metropolitan area by providing toy gifting and basic needs to those who are underprivileged and in need during the Christmas holidays and beyond;\nEnhance and Expand Product Assortment. In Fiscal 2023, we took several steps to broaden available selections of finished jewelry, which features our exclusive brand of premium lab grown diamonds, with an expanded Couture Collection assortment of finished jewelry that showcases a combination of mixed cuts of our Caydia® lab grown diamonds and recycled precious metals featuring new designs of rings, earrings, and pendant styles that we believe is the future of Made, not Mined™ fine jewelry. We believe this collection showcases a combination of mixed cut gemstones in single designs to create consumer interest. Also, during Fiscal 2023, we expanded our Ouro Edition of fine jewelry to include Caydia® lab grown diamond fashion pieces. The Ouro Edition is our curation of polished recycled 14 karat gold jewelry pieces with a design focus on geometric shapes. We believe that Ouro - which is Portuguese for gold - will bring a fresh approach to our finished jewelry in modern dimensional styles in yellow gold to bring our fine luxury jewelry to the forefront of modern fashion. In addition, with the launch of our latest lab grown precious gemstones in color, which we announced in October 2022, we are now offering a colorful new dimension of our Made, not Mined™ fine jewelry repertoire featuring lab grown ruby, sapphire, and emerald gemstones. We further offered an expanded assortment of Caydia® lab grown diamonds to include higher total carat weight items adding finished jewelry featuring lab grown diamonds with total carat weights of up to and in some cases exceeding 4.0 carats. Previously, we focused primarily on smaller total carat weight items of finished jewelry featuring our Caydia® lab grown diamonds. In Fiscal 2023 we expanded our bridal and engagement fine jewelry collections of styles featuring Forever One™ moissanite to continue to showcase and promote finished jewelry featuring our core product gemstone. Lastly, we launched 55 styles of our patented Signature Collection engagement ring and wedding band designs featuring Forever One™ moissanite and expanded our Caydia® lab grown diamond Couture Collection to include additional ring, necklace, earring, and bracelet styles; and launched 47 new fine jewelry styles on charlesandcolvard.com across all categories: and\nBroaden our Footprint. In October 2022, we officially opened the first Charles & Colvard Signature Showroom located in our corporate headquarters in North Carolinas Research Triangle Park. We believe that consumers are responding positively to our patented Signature Collection designs as well as our wide assortment of Forever One™ moissanite and Caydia® lab grown diamond fine jewelry. Also in October 2022, we hosted a private press event for community leaders and influencers, allowing them to experience the new broadcast studio located in our corporate headquarters. This studio is a digital extension of the sales team and a tool that our marketing team utilizes for video content production, live-stream shopping, designer and influencer interviews, and fashion photography. We believe our brick-and-mortar expansion and digital marketing capability will continue to further position and define our brand in what we believe is a rapidly evolving consumer landscape and allow us to compete more effectively and, we believe, increase our market share within the fine jewelry space. In June 2023, we launched charlesandcolvarddirect.com selling loose moissanite gems (Forever One™ and Moissanite by Charles & Colvard®) to specific retailers. In addition, we launched three new dropship partnerships with Moissanite by Charles & Colvard® fine jewelry.\nAs evidenced by our results for Fiscal 2023, domestic and global inflation and rising interest rates, coupled with ongoing fears of recession and the overall worsening of macroeconomic conditions that we witnessed during the fiscal year ended June 30, 2023, combined to continue eroding consumer confidence and presenting major challenges for the global retail and e-commerce industry. While American consumers continue spending more on consumer goods to keep up with higher prices, consumers are spending on necessities and other required goods and services and moving away from spending on luxury items. We expect that consumers will continue to feel pressured financially, particularly throughout the remaining calendar year 2023. We are facing similar challenges to other retailers, including those in the e-commerce space, but particularly those in the luxury product retail arena. In addition, we continue seeing ongoing increased costs of digital advertising spend, known as cost-per-click in the digital advertising world, due to intense competition and pricing pressures in the lab grown gem and finished jewelry space. While management remains focused to take the required steps necessary to mitigate the impact, the Companys costs that continue to increase will result in further pressure on its revenues, margins, and cash flows.\nOur MD&A generally discusses Fiscal 2023 and Fiscal 2022 items and year-to-year comparisons between Fiscal 2023 and Fiscal 2022.\nResults of Operations\nThe following table sets forth certain consolidated statements of operations data for the fiscal years ended June 30, 2023 and 2022:\nYear Ended June 30,\nNet sales\n$\n29,946,234\n$\n43,089,024\nCosts and expenses:\nCost of goods sold\n25,212,383\n22,845,702\nSales and marketing\n13,686,049\n12,421,138\nGeneral and administrative\n5,023,822\n4,948,980\nTotal costs and expenses\n43,922,254\n40,215,820\n(Loss) Income from operations\n(13,976,020\n)\n2,873,204\nOther income (expense):\nInterest income\n297,262\n19,277\nLoss on foreign currency exchange\n-\n(34\n)\nTotal other income, net\n297,262\n19,243\n(Loss) Income before income taxes\n(13,678,758\n)\n2,892,447\nIncome tax expense\n(5,902,036\n)\n(518,532\n)\nNet (loss) income\n$\n(19,580,794\n)\n$\n2,373,915\nConsolidated Net Sales\nConsolidated net sales for the fiscal years ended June 30, 2023 and 2022 comprise the following:\nYear Ended June 30,\nChange\nDollars\nPercent\nFinished jewelry\n$\n23,985,614\n$\n29,712,230\n$\n(5,726,616\n)\n(19\n)\n%\nLoose jewels\n5,960,620\n13,376,794\n(7,416,174\n)\n(55\n)\n%\nTotal consolidated net sales\n$\n29,946,234\n$\n43,089,024\n$\n(13,142,790\n)\n(31\n)\n%\nConsolidated net sales were $29.95 million for the fiscal year ended June 30, 2023 compared to $43.09 million for the fiscal year ended June 30, 2022, a decrease of $13.14 million, or 31%. We had lower net sales in both operating business segments during the fiscal year ended June 30, 2023. Overall consumer confidence has continued to show signs of weakening due to general economic uncertainties, coupled with domestic and worldwide inflation, including recessionary fears, and rising interest rates. Notwithstanding the calendar year-end 2022 holiday shopping season and the Valentines Day occasion during February 2023 and Mothers Day during May 2023, these conditions have brought about lower consumer demand for our finished jewelry products, which resulted in lower net sales in our Online Channels segment during the fiscal year ended June 30, 2023. These same general economic conditions also caused weakness in demand for moissanite jewels from our domestic and international distributors, which in turn resulted in lower loose jewel and jewelry product net sales during the fiscal year ended June 30, 2023 in our Traditional segment.\nSales of finished jewelry represented 80% and 69% of total consolidated net sales for the fiscal years ended June 30, 2023 and 2022, respectively. For the fiscal year ended June 30, 2023, finished jewelry sales were $23.99 million compared to $29.71 million for the fiscal year ended June 30, 2022, a decrease of $5.73 million, or 19%. This decrease in finished jewelry sales was due primarily to lower demand across all of our finished jewelry products as a result of adverse global and domestic general economic conditions and increased competition.\nSales of loose jewels represented 20% and 31% of total consolidated net sales for the fiscal years ended June 30, 2023 and 2022, respectively. For the fiscal year ended June 30, 2023, loose jewel sales were $5.96 million compared to $13.38 million for the fiscal year ended June 30, 2022, a decrease of $7.42 million, or 55%. The decrease for the fiscal year ended June 30, 2023 was due primarily to lower sales of loose jewels through our distribution network in our Online Channels segment and Traditional segment, as a result of global and domestic general adverse macroeconomic conditions and increased competition.\nU.S. net sales accounted for approximately 97% and 95% of total consolidated net sales during the fiscal years ended June 30, 2023 and 2022, respectively. U.S. net sales decreased to $29.06 million during the fiscal year ended June 30, 2023 compared to $41.14 million during the fiscal year ended June 30, 2022, primarily as a result of decreased sales to U.S. customers in both our Online Channels segment and Traditional segment for the same reasons outlined above.\nOur largest U.S. customer during the fiscal years ended June 30, 2023 and 2022 accounted for 14% of total consolidated net sales during each of the fiscal years then ended. Other than our U.S. customer noted above during the fiscal years ended June 30, 2023 and 2022, we had no other customers with sales that represented 10% or more of total consolidated net sales for the periods then ended. We expect that we, along with our customers, will remain dependent on our ability to maintain and enhance our customer-related programs. A change in or loss of any of these customer or retailer relationships could have a material adverse effect on our results of operations.\nInternational net sales accounted for approximately 3% and 5% of total consolidated net sales during the fiscal years ended June 30, 2023 and 2022, respectively. International net sales decreased to $890 thousand during the fiscal year ended June 30, 2023 compared to $1.95 million in the fiscal year ended June 30, 2022. International sales decreased during the fiscal year ended June 30, 2023, compared to the prior fiscal year primarily due to lower demand in our international distributor market due to shutdowns in the Asia Pacific region and increased competition during the fiscal year ended June 30, 2023, coupled with the strength of the U.S. dollar against foreign currencies. In light of the effects of ongoing global economic conditions, we continue to evaluate these and other potential distributors in international markets to determine the best long-term partners. As a result, and in light of the impact from the ongoing worldwide pandemic and international trade challenges, we expect that our sales in these markets may significantly fluctuate each reporting period.\nWe did not have an international customer account for 10% or more of total consolidated sales during the fiscal years ended June 30, 2023 and 2022. A portion of our international consolidated sales represents jewels sold internationally that may be re-imported to U.S. retailers.\nCosts and Expenses\nCost of Goods Sold\nCost of goods sold for the fiscal years ended June 30, 2023 and 2022 are as follows:\nYear Ended June 30,\nChange\nDollars\nPercent\nProduct line cost of goods sold:\nFinished jewelry\n$\n12,397,091\n$\n13,932,700\n$\n(1,535,609\n)\n(11\n)%\nLoose jewels\n2,744,977\n6,169,790\n(3,424,813\n)\n(56\n)%\nTotal product line cost of goods sold\n15,142,068\n20,102,490\n(4,960,422\n)\n(25\n)%\nNon-product line cost of goods sold\n10,070,315\n2,743,212\n7,327,103\n%\nTotal cost of goods sold\n$\n25,212,383\n$\n22,845,702\n$\n2,366,681\n%\nTotal cost of goods sold was $25.21 million for the fiscal year ended June 30, 2023, compared to $22.85 million for the fiscal year ended June 30, 2022, a net increase of approximately $2.37 million, or 10%. Product line cost of goods sold is defined as product cost of goods sold in each of our Online Channels segment and Traditional segment excluding non-capitalized expenses from our manufacturing and production control departments, comprising personnel costs, depreciation, rent, utilities, and corporate overhead allocations; freight out; inventory write-downs; and other inventory adjustments, comprising costs of quality issues, and damaged goods.\nThe increase in total cost of goods sold for the fiscal year ended June 30, 2023, as compared to the fiscal year ended June 30, 2022 was primarily driven by an increase in non-product line cost of goods sold offset by a decrease of sales of finished jewelry and loose jewels during the fiscal year ended June 30, 2023 in both of our Online Channels segment and Traditional segment. We experienced lower demand in our Online Channels segment as a result of lower finished jewelry product demand and loose jewel demand during the fiscal year ended June 30, 2023. Likewise, we saw lower loose jewel product demand and finished jewelry product demand in our Traditional segment throughout Fiscal 2023.\nThe net increase in non-product line cost of goods sold for the fiscal year ended June 30, 2023 comprises a write-down of approximately $5.9 million representing the carrying value of a portion of the Companys non-Forever One™ loose jewels inventory. The non-Forever One™ material inventory (mainly the classifications for our multiple grade Moissanite by Charles & Colvard® gemstones and lab-grown diamonds) is comprised of raw materials, or boules, work-in-process gemstones, and loose finished gemstones. Certain grades of the Companys Moissanite by Charles & Colvard® loose gemstones and lab-grown diamonds have seen a market deterioration which started in the quarterly period ended June 30, 2023 due to the recent downward pricing pressure on both mined and lab grown diamonds. These trends in the diamond market have now put considerable pricing pressure on moissanite - for rough and loose gemstones - and due to oversupply of rough and loose gems for lab grown diamonds the net realizable value of such inventory has decreased. Additionally, the net increase includes an approximate $1.1 million increase in other inventory adjustments principally related to Fiscal 2023 cycle book-to-physical inventory adjustments and changes in production standard cost variances compared to those in the fiscal year ended June 30, 2022 and an approximate $549,000 increase in non-capitalized manufacturing production control expenses principally related to the timing of when work-in-process goods are received into inventory and overhead costs are allocated. These increases was partially offset by a $127,000 decrease in freight out principally from decreased shipments resulting from lower Online Channels segment sales during the fiscal year ended June 30, 2023 and an approximate $76,000 decrease in inventory write-offs, exclusive of amounts previously mentioned, primarily related to decreases in obsolescence reserves in the fiscal year ended June 30, 2023, compared to those in the comparable prior fiscal year.\nFor further discussion of non-product line cost of goods sold, see Note 3 to our consolidated financial statements in Item 8, Financial Statements and Supplementary Data, of this Annual Report on Form\n10-K.\nSales and Marketing\nSales and marketing expenses for the fiscal years ended June 30, 2023 and 2022 are as follows:\nYear Ended June 30,\nChange\nDollars\nPercent\nSales and marketing\n$\n13,686,049\n$\n12,421,138\n$\n1,264,911\n%\nSales and marketing expenses were $13.69 million for the fiscal year ended June 30, 2023 compared to $12.42 million for the fiscal year ended June 30, 2022, an increase of approximately $1.26 million, or 10%. The increase in sales and marketing expenses for the fiscal year ended June 30, 2023 compared to the fiscal year ended June 30, 2022 was primarily due to a $513,000 increase in advertising and digital marketing expenses due to an increase in targeted direct-to-consumer top-of-funnel brand awareness campaigns; a $252,000 increase in compensation expenses; a $242,000 increase in general business and franchise taxes; a $175,000 increase in professional services principally comprising consulting services for marketing support in the current year period; a $28,000 increase in telephone-related communications expenses; a $22,000 increase in employee-related recruiting and search fees for new hires; a $15,000 increase in supplies and customer promotional gifts, primarily a gift with purchase program associated with the opening of our Signature Showroom in the current fiscal year; a $14,000 increase in software-related costs incurred primarily in connection with new software-related agreements associated with upgraded sales-related operating systems; a $3,000 increase in depreciation and amortization expense principally related to new sales-related systems hardware and software; and a $3,000 net increase in general office-related expenses. These increases were offset partially by a $2,000 decrease in travel expenses.\nThe increase in digital marketing expenses for the fiscal year ended June 30, 2023 compared to the fiscal year ended June 30, 2022 was primarily due to an $821,000 increase in digital advertising spend; a $92,000 increase in outside agency fees; and a $1,000 increase in print media expenses. These increases were offset partially by a $186,000 decrease in cooperative advertising; a $135,000 decrease in brand awareness marketing campaign expenditures as a result of fewer promotional activities in the current fiscal year; and an $80,000 decrease in expenses relating to our participation in the 2021 JCK Trade Show held in the prior fiscal year for which we did not host a booth in the 2022 JCK Trade show held during the current fiscal year.\nCompensation expenses for the fiscal year ended June 30, 2023 compared to the fiscal year ended June 30, 2022 increased primarily as a result of a $344,000 increase in salaries (due to fluctuations in headcount throughout the year), commissions, and related employee benefits in the aggregate and a $5,000 increase in severance-related expenses associated with a reduction-in-force during the current fiscal year. These increases were partially offset by a $62,000 decrease in bonus expense and a $35,000 decrease in employee stock-based compensation expense.\nGeneral and Administrative\nGeneral and administrative expenses for the fiscal years ended June 30, 2023 and 2022 are as follows:\nYear Ended June 30,\nChange\nDollars\nPercent\nGeneral and administrative\n$\n5,023,822\n$\n4,948,980\n$\n74,842\n%\nGeneral and administrative expenses were $5.02 million for the fiscal year ended June 30, 2023 compared to $4.95 million for the fiscal year ended June 30, 2022, an increase of approximately $75,000, or 2%. The increase in general and administrative expenses for the fiscal year ended June 30, 2023 compared to the fiscal year ended June 30, 2022 was primarily due to a $199,000 increase in professional services; a $187,000 increase in depreciation and amortization expense related to general office leasehold improvements associated with the lease on our corporate headquarters and business expansion related to the opening of our new Charles & Colvard Signature Showroom also located in our headquarters campus; a $105,000 increase in travel and expense related expenditures as we returned to more traditional business travel patterns following the pandemic; an $84,000 increase in bad debt expense associated with our allowance for doubtful accounts reserve policy; an increase of $72,000 in general business taxes and licenses; and a $21,000 increase in insurance expense, principally related to increased cybersecurity premiums. These increases were partially offset by a $411,000 decrease in compensation expenses; a $163,000 decrease in bank fees resulting from the revised fee structure associated with different banking arrangements in place in the current fiscal year versus those in the prior fiscal year; a $14,000 decrease in rent expense, primarily related to our corporate headquarters operating lease; and a $4,000 net decrease in miscellaneous other general and administrative expenses.\nCompensation expenses decreased for the fiscal year ended June 30, 2023 compared to the fiscal year ended June 30, 2022 primarily due to a $463,000 decrease in employee stock-based compensation expense and a $169,000 decrease in bonus expense. These decreases were partially offset by a $217,000 net increase in salaries and related employee benefits in the aggregate (due to fluctuations in headcount throughout the year), and a $5,000 increase in severance-related expenses associated with a reduction-in-force during the current fiscal year.\nProfessional services fees increased for the fiscal year ended June 30, 2023 compared to the fiscal year ended June 30, 2022 primarily due to a $118,000 increase in legal fees associated with corporate governance matters; a $53,000 increase in broker commissions primarily related to our stock repurchase program; a $24,000 increase in investor relations fess; and a $4,000 increase in fees associated with audit and tax services.\nInterest Income\nInterest income for the fiscal years ended June 30, 2023 and 2022 is as follows:\nYear Ended June 30,\nChange\nDollars\nPercent\nInterest income\n$\n297,262\n$\n19,277\n$\n277,985\n*\n%\n* Not meaningful\nCertain cash balances in excess of operating needs are deposited into and maintained in an interest-bearing account with a commercial bank. Accordingly, during the fiscal years ended June 30, 2023 and 2022, we earned interest from cash on deposit in this interest-bearing account. The increase in earned interest for the fiscal year ended June 30, 2023 reflects movement of invested funds into a higher-yield money market fund in late Fiscal 2022, coupled with the overall increase in interest rates during Fiscal 2023 compared with those in Fiscal 2022.\nLoss on Foreign Currency Exchange\nLoss on foreign currency exchange related to foreign sales transacted in functional currencies other than the U.S. dollar for the fiscal years ended June 30, 2023 and 2022 are as follows:\nYear Ended June 30,\nChange\nDollars\nPercent\nLoss on foreign currency exchange\n$\n-\n$\n$\n(34\n)\n(100\n)%\nDuring the fiscal year ended June 30, 2022, we had international sales transactions denominated in currencies other than the U.S. dollar that resulted in foreign currency exchange net losses. There were no such international sales transactions denominated in foreign currencies during the fiscal year ended June 30, 2023.\nProvision for Income Taxes\nOur statutory tax rate as of June 30, 2023 is 22.94% and consisted of the federal income tax rate of 21.00% and a blended state income tax rate of 1.94%, net of the federal benefit. Our statutory tax rate as of the fiscal year ended June 30, 2022 was 22.45% and consisted of the federal income tax rate of 21.00% and a blended state income tax rate of 1.45%, net of the federal benefit. Our effective income tax rate reflects the effect of federal and state income taxes on earnings and the impact of differences in book and tax accounting arising primarily from the permanent tax benefits associated with stock-based compensation transactions during the accounting period then ended. Driven by the establishment of the valuation allowance during the fiscal quarter ended March 31, 2023, our effective tax rate for the fiscal year ended June 30, 2023 was a negative 43.15%. For the fiscal year ended June 30, 2022, our effective income tax rate was 17.93%.\nWe recognized a net income tax expense of approximately $5.90 million for the fiscal year ended June 30, 2023, compared with a net income tax expense of approximately $519,000 for the fiscal year ended June 30, 2022.\nAs of each reporting date, we consider new evidence, both positive and negative, that could impact our view with regard to future realization of deferred tax assets. During the three months ended March 31, 2023, we determined that due to the worsening global macro-economic conditions and heightened levels of inflation, including fears of recession, coupled with the effects from worldwide political unrest and the ongoing economic impact from the COVID pandemic, the risks associated with these conditions led us to conclude that it was not more likely than not we would have sufficient future taxable income to utilize our deferred tax assets. Additionally, we determined that the positive evidence was no longer sufficient to offset available negative evidence, primarily as a result of the pre-tax operating losses incurred during the three- and nine-month periods ended March 31, 2023. Consequently, we established a full valuation allowance against our deferred tax assets. As of June 30, 2023, we determined that sufficient negative evidence continued to exist to conclude it was uncertain that we would have sufficient future taxable income to utilize our deferred tax assets, and therefore, we maintained a full valuation allowance against its deferred tax assets.\nConversely, as of June 30, 2022, we determined at that time our expectations of future taxable income in upcoming tax years, including estimated growth rates applied to future expected taxable income that included significant management estimates and assumptions, would continue to be sufficient to result in full utilization of our remaining federal net operating loss carryforwards and certain of the deferred tax assets prior to any statutory expiration. As a result, we determined that sufficient positive evidence existed as of June 30, 2022, to conclude that it was more likely than not deferred tax assets of approximately $5.85 million remained realizable. However, we further determined that sufficient negative evidence continued to exist to conclude it was uncertain that we would have sufficient future taxable income to utilize certain of our deferred tax assets. Therefore, we continued to maintain a valuation allowance against the deferred tax assets relating to certain state net operating loss carryforwards from our e-commerce subsidiary due to the timing uncertainty of when it would generate positive taxable income to utilize the associated deferred tax assets. In addition, a valuation allowance remained against certain deferred tax assets relating to operating loss carryforwards relating to our dormant subsidiary located in Hong Kong.\nCertain Operating Metrics\nWe believe that certain metrics are key to our business, including but not limited to monitoring our average order value, or AOV, primarily in our transactional website charlesandcolvard.com. We use the AOV computation in part to make strategic digital marketing-related decisions and to monitor the performance and return on investment of our marketing activities. Our AOV is based on financial results and customer-related data for charlesandcolvard.com, LLC, our wholly owned subsidiary through which we operate our primary transactional website. Our calculation for AOV is sensitive to several factors, including sales volume and product mix. Therefore, we believe that this metric may vary widely going forward as we respond to ever- changing consumer demand and provide the products - that may have widely variable price points - which our audiences are seeking.\nFor the fiscal years ended June 30, 2023 and June 30, 2022, our AOV, based on charlesandcolvard.com revenue, net of returns, divided by the total number of customer orders, is estimated to be approximately $1,100 in each year.\nAn additional metric that we use to manage charlesandcolvard.com operations and to make strategic digital marketing decisions for our transactional website is period-over-period revenue growth. While we believe this metric is sensitive to many factors and may vary in future periods, we expect to continue to monitor and base our marketing-related investments in part on charlesandcolvard.com revenue growth going forward.\nFor the fiscal year ended June 30, 2023, we experienced a 20% year-over-year decline in charlesandcolvard.com revenue compared to revenue for the fiscal year ended June 30, 2022.\nLiquidity and Capital Resources\nCapital Structure and Debt\nLong-Term Liquidity and Capital Structure\nWe have an effective shelf registration statement on Form S-3 on file with the SEC that allows us to periodically offer and sell, individually or in any combination, shares of common stock, shares of preferred stock, warrants to purchase shares of common stock or preferred stock, and units consisting of any combination of the foregoing types of securities, up to a total of $25.00 million, of which all is available. However, we may offer and sell no more than one-third of our public float (which is the aggregate market value of our outstanding common stock held by non-affiliates) in any 12-month period. Our ability to issue equity securities under the shelf registration statement is subject to market conditions, which may be in turn, subject to, among other things, the potential disruption and volatility that may be caused by ongoing effects of rising inflation rates and fear of recession. Any capital raise is not assured and may not be at terms that would be acceptable to us.\nFinancing Activities\nLong-Term Financing Activities\nIn accordance with authority granted by our Board of Directors on April 29, 2022, we can repurchase up to approximately $5.00 million in shares outstanding of our common stock over the three-year period ending April 29, 2025. Pursuant to the terms of the repurchase authorization, the common stock share repurchases are generally at the discretion of management. As we repurchase our common shares, which have no par value, we report such shares held as treasury stock on the accompanying consolidated balance sheets as of June 30, 2023 and 2022, with the purchase price recorded within treasury stock.\nDuring the fiscal years ended June 30, 2023 and 2022, we repurchased 358,116 shares and 30,287 shares, respectively, of our common stock for an aggregate price of $451,815 and $38,164, respectively, pursuant\nto the repurchase authorization.\nOperating Activities and Cash Flows\nWe require cash to fund our operating expenses and working capital requirements, including outlays for capital expenditures. As of June 30, 2023, our principal sources of liquidity were cash and cash equivalents totaling $10.45 million, trade accounts receivable of $380,000, and net current inventory of $7.48 million, as compared to cash and cash equivalents of $15.67 million, trade accounts receivable of $2.22 million, and net current inventory of $11.02 million as of June 30, 2022. We also had access during Fiscal 2023 to a $5.00 million cash collateralized line of credit facility, or the JPMorgan Chase Credit Facility, that we obtained effective July 9, 2021, as amended July 28, 2022 and amended further effective June 21, 2023, from JPMorgan Chase Bank, N.A., or JPMorgan Chase.\nDuring the fiscal year ended June 30, 2023, our working capital decreased by approximately $11.55 million to $17.51 million from $29.06 million at June 30, 2022. As described more fully below, the decrease in working capital at June 30, 2023 is primarily attributable to a net decrease in our cash, cash equivalents, and restricted cash, a decrease in our allocation of inventory from long-term to short-term due to a lower expected sell through of inventory on hand in the upcoming period, a decrease in our accounts receivable, an increase in our accounts payable, a decrease in our prepaid expenses and other assets, and an increase in our short-term operating lease liabilities. These factors were offset partially by a decrease in our accrued expenses and other liabilities.\nCash used for investing activities was principally for construction-in-process expenditures related to our retail expansion program and the completion of the construction of our first Signature Showroom and other leasehold improvements in our corporate office.\nCash used for financing activities is related to repurchases of our common stock pursuant to the terms of an effective stock repurchase authorization.\nDuring the fiscal year ended June 30, 2023, approximately $3.88 million of cash was used by our operations. The primary drivers of our cash flows from operations were a net loss in the amount of approximately $19.58 million and a decrease in accrued expenses and other liabilities of approximately $927,000. These factors were offset partially by the favorable impact of approximately $12.8 million of non-cash expenses driven by the deferred tax valuation allowance, and the inventory write-down recorded during the year ended June 30, 2023; a decrease in accounts receivable of $1.77 million; a decrease in prepaid expenses and other assets of $893,000; a decrease in inventory during year ended June 30, 2023 of $755,000; and an increase in accounts payable of $385,000.\nAccounts receivable decreased principally due to the decreased level of sales on credit during the three months ended June 30, 2023, as compared with the sales during the period leading up to June 30, 2022. From time to time, we have offered extended Traditional segment customer payment terms beyond 90 days to certain credit-worthy customers the extension of these terms may not immediately increase liquidity as a result of ongoing current-period sales. In addition, we believe our competitors and other vendors in the wholesale jewelry industry have expanded their use of extended payment terms and, in aggregate, we believe that, through our use of extended payment terms, we provide a competitive response in our market during the current global economic environment. We believe that we are unable to estimate the impact of these actions on our net sales, but we believe that if we ceased providing extended payment terms, we would be at a competitive disadvantage for some Traditional segment customers in the marketplace during this economic period and that our net sales and profits would likely be adversely impacted.\nDuring the fiscal year ended June 30, 2023, prepaid expenses and other assets decreased principally as a result of a decrease in the right-of-use asset associated with leasehold improvements in connection with the lease for our corporate headquarters facilities (which for financial reporting purposes is classified with prepaid expenses and other assets in the consolidated statement of cash flows) and the timing of certain vendor payments, primarily for insurance-related premium expenses, in advance of goods or services received. During the fiscal year ended June 30, 2023, accrued expenses and other liabilities decreased principally due the timing of payments for certain incurred expenses, principally for compensation and related benefits, and a decrease in the operating lease liability associated with the lease for our corporate headquarters facilities. During the fiscal year ended June 30, 2023, accounts payable increased primarily as a result of the timing of payments for costs associated with inventory-related purchases and professional services incurred.\nDuring the fiscal year ended June 30, 2022, our working capital decreased by approximately $1.08 million to $29.06 million from $30.14 million at June 30, 2021. As described more fully below, the decrease in working capital at June 30, 2022 is primarily attributable to an increase in our accounts payable, a decrease in our allocation of inventory from long-term to short-term due to a lower expected sell through of inventory on hand in the upcoming period, an increase in our short-term operating lease liabilities; and a net decrease in our cash, cash equivalents, and restricted cash. These factors were offset partially by a decrease in our accrued expenses and other liabilities, an increase in our accounts receivable, and an increase in our prepaid expenses and other assets. Our cash used for investing activities principally for construction-in-process expenditures related to our retail expansion program and the construction of our first Signature Showroom and other leasehold improvements in our corporate offices was offset partially by cash provided by net financing activities.\nDuring the fiscal year ended June 30, 2022, approximately $573,000 of cash was provided by our operations. The primary drivers of our cash flows from operations were the favorable effect of net income in the amount of $2.37 million, which also included $1.87 million of non-cash expenses; an increase in accounts payable of $1.63 million; and an increase in prepaid expenses and other assets of $927,000. These factors were offset partially by an increase in inventory of $4.54 million; a decrease in accrued expenses and other liabilities of $1.20 million; an increase in accounts receivable of $484,000; and a decrease in accrued income taxes of $10,000.\nWe manufactured approximately $6.76 million and $9.23 million in loose jewels and $12.75 million and $16.98 million in finished jewelry, which includes the cost of the loose jewels and the purchase of precious metals and labor in connection with jewelry production, during the fiscal years ended June 30, 2023 and 2022, respectively. We expect our purchases of precious metals and labor to fluctuate in conjunction with the levels of our finished jewelry business. In addition, the price of gold has fluctuated significantly over the past decade, resulting in higher retail price points for gold jewelry. Because the market prices of gold and other precious metals are beyond our control, upward price trends could have a negative impact on our operating cash flow as we manufacture finished jewelry.\nHistorically, our raw material inventories of SiC crystals had been purchased under exclusive supply agreements with a limited number of suppliers. Because the supply agreements restricted the sale of these crystals exclusively to us, the suppliers negotiated minimum purchase commitments with us that, when combined with reduced sales levels during prior periods in which the purchase commitments were in effect, have resulted in levels of inventories that are higher than we might otherwise maintain. As of June 30, 2023 and 2022, $19.28 million and $22.49 million, respectively, of our inventories were classified as long-term assets. Loose jewel sales and finished jewelry that we manufacture will utilize both the finished goods loose jewels currently on-hand and, as we deplete certain shapes and sizes, our on-hand raw material SiC crystals of $422,000 and new raw material that we may purchase pursuant to the Supply Agreement.\nA more detailed description of our inventories is included in Note 6 to our consolidated financial statements in Item 8, Financial Statements and Supplementary Data, of this Annual Report on Form\n10-K.\nWe made income tax payments of approximately $5,900 and $0 during the fiscal years ended June 30, 2023 and 2022, respectively. As of June 30, 2023 and 2022, we had federal tax net operating loss carryforwards of approximately $24.76 million and $16.53 million, respectively, expiring between 2034 and 2037, or that have no expiration, which can be used to offset against future federal taxable income; North Carolina tax net operating loss carryforwards of approximately $20.01 million and $19.77 million, respectively, expiring between 2023 and 2035; and various other state tax net operating loss carryforwards expiring between 2027 and 2040, which can be used to offset against future state taxable income.\nShort-Term Capital Resources\nLine of Credit\nEffective July 7, 2021, we obtained from JPMorgan Chase our $5.00 million cash collateralized JPMorgan Chase Credit Facility. The JPMorgan Chase Credit Facility may be used for general corporate and working capital purposes, including permitted acquisitions and certain additional indebtedness for borrowed money, installment obligations, and obligations under capital and operating leases. The\nJPMorgan Chase Credit Facility is secured by a cash deposit in the amount of $5.05 million held by JPMorgan Chase as collateral for the line of credit facility. Effective July 28, 2022, the JPMorgan Chase Credit Facility was amended to, among other things, extend the maturity date to July 31, 2023, and append our obligations under the JPMorgan Chase Credit Facility to be guaranteed by our wholly owned subsidiaries, Charles & Colvard Direct, LLC, charlesandcolvard.com, LLC, and moissaniteoutlet.com, LLC. Effective June 21, 2023, the JPMorgan Chase Credit Facility was amended further to extend the maturity date to July 31, 2024.\nEach advance under the JPMorgan Chase Credit Facility, as amended, accrues interest at a rate equal to the sum of JPMorgan Chases monthly secured overnight financing rate, or the SOFR rate, to which JPMorgan Chase is subject with respect to the adjusted SOFR rate as established by the U.S. Federal Reserve Board, plus a margin of 1.25% per annum and an unsecured to secured interest rate adjustment of 0.10% per annum. Prior to its amendment on July 31, 2022, each advance under the JPMorgan Chase Credit Facility would have accrued interest at a rate equal to JPMorgan Chases monthly LIBOR rate multiplied by a statutory reserve rate for eurocurrency funding to which JPMorgan Chase is subject with respect to the adjusted LIBOR rate as established by the U.S. Federal Reserve Board, plus a margin of 1.25% per annum. Interest is calculated monthly on an actual/360-day basis and payable monthly in arrears. Principal outstanding during an event of default, at JPMorgan Chases option, accrues interest at a rate of 3% per annum in excess of the above rate. Any advance may be prepaid in whole or in part at any time.\nThe JPMorgan Chase Credit Facility is evidenced by a credit agreement, as amended, between us and JPMorgan Chase, or the JPMorgan Chase Credit Agreement, dated as of June 21, 2023, and customary ancillary documents, in the principal amount not to exceed $5.00 million at any one time outstanding and a line of credit note, or the JPMorgan Chase Line of Credit Note, in which we promise to pay on or before July 31, 2024, the amount of $5.00 million or so much thereof as may be advanced and outstanding. In the event of default, JPMorgan Chase, at its option, may accelerate the maturity of advances outstanding under the JPMorgan Chase Credit Facility. The JPMorgan Chase Credit Agreement and ancillary documents contain customary covenants, representations, fees, debt, contingent obligations, liens, loans, leases, investments, mergers, acquisitions, divestitures, subsidiaries, affiliate transactions, changes in control, as well as indemnity, expense reimbursement, and confidentiality provisions.\nIn connection with the JPMorgan Chase Credit Facility, effective July 7, 2021, we incurred a non-refundable origination fee in the amount of $10,000 that was paid in full to JPMorgan Chase upon execution of the JPMorgan Chase Credit Facility on July 12, 2021. There was no origination fee paid to JPMorgan Chase in connection with the amended JPMorgan Chase Credit Facility, dated July 28, 2022 and June 21, 2023.\nEvents of default under the JPMorgan Chase Credit Facility include, without limitation, a default, event of default, or event that would constitute a default or event of default (pending giving notice or lapse of time or both), of any provision of the JPMorgan Chase Credit Agreement, the JPMorgan Chase Line of Credit Note, or any other instrument or document executed in connection with the JPMorgan Chase Credit Agreement or with any of our indebtedness, liabilities, and obligations to JPMorgan Chase or would result from the extension of credit to us by JPMorgan Chase.\nAs of June 30, 2023, we had not borrowed against the JPMorgan Chase Credit Facility.\nMore detailed descriptions of our JPMorgan Chase Credit Facility are included in Note 11 to our consolidated financial statements in Item 8, Financial Statements and Supplementary Data, of this Annual Report on Form 10-K.\nLong-Term Capital Commitments\nContractual Agreement\nOn December 12, 2014, we entered into the Supply Agreement with Wolfspeed. Under the Supply Agreement, subject to certain terms and conditions, we agreed to exclusively purchase from Wolfspeed, and Wolfspeed agreed to exclusively supply, 100% of our required SiC materials in quarterly installments that must equal or exceed a set minimum order quantity. The initial term of the Supply Agreement was scheduled to expire on June 24, 2018, unless extended by the parties. Effective June 22, 2018, the Supply Agreement was amended to extend the expiration date to June 25, 2023. The Supply Agreement, as amended, also provides for the exclusive production of our premium moissanite product, Forever One™ and provided us with one option, subject to certain conditions, to unilaterally extend the term of the Supply Agreement for an additional two-year period following the expiration of the initial term. In addition, the amendment to the Supply Agreement established a process by which Wolfspeed may begin producing alternate SiC material based on our specifications that will give us the flexibility to use the materials in a broader variety of our products, as well as to permit us to purchase certain amounts of SiC materials from third parties under limited conditions. On August 26, 2020, the Supply Agreement was further amended, effective June 30, 2020, to extend the expiration date to June 29, 2025, which may be further extended by mutual agreement of the parties. The Supply Agreement was also amended to, among other things, (i) spread our total purchase commitment under the Supply Agreement in the amount of approximately $52.95 million over the term of the Supply Agreement, as amended; (ii) establish a process by which Wolfspeed has agreed to accept purchase orders in excess of the agreed-upon minimum purchase commitment, subject to certain conditions; and (iii) permit us to purchase revised amounts of SiC materials from third parties under limited conditions. Our total purchase commitment under the Supply Agreement, as amended, until June 2025 is approximately $52.95 million, of which approximately $24.75 million remains to be purchased as of June 30, 2023.\nFor more information regarding the second amendment to our Supply Agreement, executed on August 26, 2020, see Note 10 to our consolidated financial statements in Item 8, Financial Statements and Supplementary Data, of this Annual Report on Form 10-K.\nDuring the fiscal years ended June 30, 2023 and 2022, we purchased approximately $1.80 million and $6.29 million, respectively, of SiC crystals from Wolfspeed. The Company has made no purchases of SiC crystals during the nine-month period ended June 30, 2023 while in discussions regarding the terms of the Supply Agreement. Such discussions included potential renegotiation of the Supply Agreement, but the parties have not reached an agreement.\nOn July 28, 2023, Wolfspeed initiated a confidential arbitration against us for breach of contract claiming damages, plus interest, costs, and attorneys fees. Wolfspeed has alleged that the Company failed to satisfy the purchase obligations provided in the Supply Agreement for Fiscal 2023 in the amount of $4.25 million and failed to pay for $3.30 million of SiC crystals Wolfspeed delivered to us. Wolfspeed further alleges that the Company intends to breach our remaining purchase obligations under the Supply Agreement, representing an additional $18.5 million in alleged damages.\nWhile the Company is evaluating Wolfspeeds claims, we dispute the amount sought, and we intend to vigorously defend our position, including by asserting rights and defenses that the Company may have under the Supply Agreement, at law and in equity. A hearing has not yet been scheduled . The final determinations of liability arising from this matter will only be made following comprehensive investigations, discovery and arbitration processes.\nGoing forward, we expect to use existing cash and cash equivalents and access to other working capital resources, including but not limited to the issuance of equity securities, together with future cash expected to be provided by operating activities to finance our purchase commitment under the Supply Agreement, as amended.\nFor more information in connection with the Wolfspeed arbitration matter, see Part I, Item 3, Legal Proceedings and Note 10 to our consolidated financial statements in Item 8, Financial Statements and Supplementary Data, of this Annual Report on Form 10-K.\nLiquidity and Capital Trends\nWe believe that our existing cash and cash equivalents and access to other working capital resources, including but not limited to the issuance of equity securities, and cash expected to be provided by operating activities combined will be sufficient to meet our working capital and capital expenditure needs over the next twelve months.\nFrom a long-term perspective, we believe that our ongoing access to capital markets, including but not limited to the issuance of equity securities or even potential debt securities, coupled with cash provided by operating activities in future periods beyond the next twelve months, will continue to provide us with the necessary liquidity to meet our long-term working capital and capital expenditure requirements.\nIn connection with our short- and long-term capital resources, we have an effective shelf registration statement on Form S-3 on file with the SEC that allows us to periodically offer and sell, individually or in any combination, shares of common stock, shares of preferred stock, warrants to purchase shares of common stock or preferred stock, and units consisting of any combination of the foregoing types of securities, up to a total of $25.00 million, of which all is available. However, we may offer and sell no more than one-third of our public float (which is the aggregate market value of our outstanding common stock held by non-affiliates) in any 12-month period. Our ability to issue equity securities under the shelf registration statement is subject to market conditions, which may be in turn, subject to, among other things, the potential disruption and volatility that may be caused by ongoing effects of rising inflation and fears of recession. Any capital raise is not assured and may not be at terms that would be acceptable to us.\nOur future capital requirements and the adequacy of available funds will depend on many factors, including the ongoing uncertainty surrounding rising inflation and fears of recession that could lead to further disruption and volatility in the global capital markets as well as its impact on our rate of sales growth; the expansion of our sales and marketing activities; the timing and extent of raw materials and labor purchases in connection with loose jewel production to support our moissanite jewels and lab grown diamond business and precious metals and labor purchases in connection with jewelry production to support our finished jewelry business; the timing of capital expenditures; and the risk factors described in more detail in Risk Factors in Part I, Item 1A, of this Annual Report on Form 10-K. Currently, we have the JPMorgan Chase Credit Facility, as amended, through its expiration on July 31, 2024, which we believe would mitigate these risks to our cash and liquidity position. Also, we may make investments in, or acquisitions of, complementary businesses, which could also require us to seek additional equity or debt financing.\nCritical Accounting Estimates\nOur discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements, which we prepared in accordance with accounting principles generally accepted in the United States, or U.S. GAAP. The preparation of these consolidated financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, and expenses and related disclosures of contingent assets and liabilities. Critical accounting estimates are defined as those most important to the financial statement presentation and that require the most difficult, subjective, or complex judgments. We base our estimates on historical experience and on various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Under different assumptions and/or conditions, those actual results of operations may materially differ. The most significant estimates impacting our consolidated financial statements relate to the valuation and classification of inventories, accounts receivable reserves, and revenue recognition. We also have other policies that we consider key accounting policies, but these policies typically do not require us to make estimates or judgments that are difficult or subjective.\nValuation and Classification of Inventories\nAny inventory on hand at the measurement date in excess of our current requirements based on historical and anticipated levels of sales is classified as long-term on our Consolidated Balance Sheets. The classification of our inventory as either current or long-term inventory requires us to estimate the portion of on-hand inventory that can be realized over the next 12 months and does not include precious metal, labor, and other inventory purchases expected to be both purchased and realized in cost of sales over the next 12 months.\nEach accounting period we evaluate the valuation and classification of inventories including the need for potential inventory write-downs, which also include significant estimates by management for obsolescence, shrinkage, and rework. Obsolescence reserves are based on an estimated loss percentage factor, determined by a combination of managements analysis of current production-related conditions, coupled with historical work-in-process and customer-related obsolescence experience over time for specific product gemstones and finished jewelry affected by these conditions. Shrinkage reserves are based on an estimated loss percentage factor, determined by a combination of managements analysis of current gemstones in production status and on memo at third-party locations, coupled with historical work-in-process shrinkage-related experience over time for specific product gemstones and jewelry impacted by these conditions. The rework reserves are also based on an estimated loss percentage factor, determined by a combination of managements analysis of current production-related conditions, coupled with historical work-in-process rework experience over time for specific previously finished gemstones affected by these conditions.\nRevenue Recognition\nWe recognize substantially all of our revenue at a point in time when control of our goods has passed to the customer with the exception of consigned goods. We consider our performance obligation related to the shipment of goods satisfied at the time this control is transferred. We also have a variable consideration element related to most of our contracts in the form of product return rights. At the time revenue is recognized, an allowance for estimated returns is established and any change in the allowance for returns is charged against net sales in the current period. For our Traditional segment customers, the returns policy generally allows for the return of jewels and finished jewelry with a valid reason for credit within 30 days of shipment. Customers on both our charlesandcolvard.com and moissaniteoutlet.com websites may also generally return purchases within 30 days, respectively, of the shipment date in accordance with our returns policies as disclosed on our charlesandcolvard.com and moissaniteoutlet.com websites. Periodically, we ship loose jewel goods and finished goods to Traditional segment customers on consignment terms. Under these consignment terms, the customer assumes the risk of loss and has an absolute right of return for a specified period that typically ranges from six months to one year. Our Online Channels segment and Traditional segment customers are generally required to make payments on consignment shipments within 30 to 60 days upon the customer informing us that such inventory will be kept by the customer. Accordingly, we do not recognize revenue on these consignment transactions until the earlier of (i) the customer informing us that the inventory will be kept by the customer; (ii) the expiration of the right of returns period; or (iii) the customer informing us that the inventory has been sold.\nAccounts Receivable Reserves\nEstimates are used to determine the amount of two reserves against trade accounts receivable. The first reserve is an allowance for sales returns. At the time revenue is recognized, we estimate future returns using a historical return rate that is reviewed quarterly with consideration of any contractual return privileges granted to customers and we reduce sales and trade accounts receivable by this estimated amount.\nThe second reserve is an allowance for uncollectible accounts for the measurement of estimated credit losses resulting from the failure of our customers to make required payments. This allowance reduces trade accounts receivable to an amount expected to be collected. We use a current expected credit losses model whereby we estimate credit losses expected over the life of our pool of exposures based on historical percentages of uncollectible accounts, changes in payment history, and facts and circumstances, including any current extenuating economic conditions, regarding specific accounts that become known to, or forecasted by, us to be uncollectible when evaluating the adequacy of the allowance for uncollectible accounts. We determine a credit loss percentage based on the age of the receivable that we deem uncollectible related to potential credit losses. We record an allowance for such credit losses, which includes a provision for expected losses based on historical write-offs, adjusted for current conditions as deemed necessary, reasonable and supportable forecasts about future conditions, and a specific reserve for accounts deemed at risk. The allowance is our estimate for accounts receivable as of the balance sheet date that ultimately will not be collected. Any changes in the allowance are reflected in the results of operations in the period in which the change occurs. We write-off accounts receivable and the related allowance recorded previously when it becomes probable, based upon customer facts and circumstances, that such amounts will not be collected. We generally use internal collection efforts, which may include our sales personnel as deemed appropriate. After all internal collection efforts have been exhausted, we generally write-off the underlying account receivable.\nAny accounts with significant balances are reviewed separately to determine an appropriate allowance based on the facts and circumstances of the specific underlying customer account. Item 7A.\nQuantitative and Qualitative Disclosures About Market Risk\nNot applicable. Item 8.\nFinancial Statements and Supplementary Data\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage Number\nReport of Independent Registered Public Accounting Firm (BDO USA, P.C., Raleigh, NC; PCAOB ID: 243)\nConsolidated Balance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations for the fiscal years ended June 30, 2023 and 2022\nConsolidated Statements of Shareholders Equity for the fiscal years ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the fiscal years ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nShareholders and Board of Directors\nCharles & Colvard, Ltd.\nMorrisville, North Carolina\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Charles & Colvard, Ltd. (the Company) as of June 30, 2023, and 2022, the related consolidated statements of operations, shareholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at June 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nInventories Net Realizable Value\nAs described in Notes 2 and 6 to the Companys consolidated financial statements, inventories totaled approximately $26.8 million at June 30, 2023. Inventories are stated at the lower of cost or net realizable value. Each accounting period, the Company evaluates the valuation of inventories including the need for potential inventory write-downs, which includes significant estimates by management.\nWe identified managements estimation of the net realizable value of inventories, including inventory write-downs, as a critical audit matter. The Companys inventories are subject to various market factors, including changes in styling trends and competition, that could indicate a decline in the net realizable value. Given the inherent uncertainty in estimating the future marketability of the Companys products, auditing managements estimation of the net realizable value of inventories required a high degree of auditor judgment and increased audit effort.\nThe primary procedures we performed to address this critical audit matter included:\nEvaluating the reasonableness of the inputs used in managements inventory reserve calculations including prices for similar products recently sold by the Company, current and expected margins based on current period sales of inventories on hand, and industry trends.\nAssessing the reserve analysis to determine whether management identified evidence of potential declines in marketability, including slow moving inventory, for which carrying value may exceed estimates of net realizable value and appropriately evaluated potential write-downs.\n/s/ BDO USA, P.C.\nWe have served as the Companys auditor since 2010.\nRaleigh, North Carolina\nOctober 12, 2023\nCHARLES & COLVARD, LTD.\nCONSOLIDATED\nBALANCE SHEETS\nJune 30,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n10,446,532\n$\n15,668,361\nRestricted cash\n5,122,379\n5,510,979\nAccounts receivable, net\n380,085\n2,220,816\nInventory, net\n7,476,046\n11,024,276\nNote receivable\n250,000\n250,000\nPrepaid expenses and other assets\n901,354\n1,190,012\nTotal current assets\n24,576,396\n35,864,444\nLong-term assets:\nInventory, net\n19,277,530\n22,488,524\nProperty and equipment, net\n2,491,569\n1,901,176\nIntangible assets, net\n305,703\n265,730\nOperating lease right-of-use assets\n2,183,232\n2,787,419\nDeferred income taxes, net\n-\n5,851,904\nOther assets\n49,658\n49,658\nTotal long-term assets\n24,307,692\n33,344,411\nTOTAL ASSETS\n$\n48,884,088\n$\n69,208,855\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable\n$\n4,786,155\n$\n4,401,229\nOperating lease liabilities, current portion\n880,126\n856,571\nAccrued expenses and other liabilities\n1,395,479\n1,546,483\nTotal current liabilities\n7,061,760\n6,804,283\nLong-term liabilities:\nNoncurrent operating lease liabilities\n2,047,742\n2,846,805\nTotal long-term liabilities\n2,047,742\n2,846,805\nTotal liabilities\n9,109,502\n9,651,088\nCommitments and contingencies (Note 10)\nShareholders equity:\nCommon stock, no par value; 50,000,000 shares authorized; 30,912,108 shares issued and 30,523,705 shares outstanding at June 30, 2023 and 30,778,046 shares issued and 30,747,759 shares outstanding at June 30,\n57,242,211\n57,242,211\nAdditional paid-in capital\n26,205,919\n25,956,491\nTreasury stock, at cost, 388,403 shares and 30,287 shares at June 30, 2023 and 2022, respectively\n(489,979 )\n(38,164 )\nAccumulated deficit\n(43,183,565\n)\n(23,602,771\n)\nTotal shareholders equity\n39,774,586\n59,557,767\nTOTAL LIABILITIES AND SHAREHOLDERS EQUITY\n$\n48,884,088\n$\n69,208,855\nSee Notes to Consolidated Financial Statements.\nCHARLES & COLVARD, LTD.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended June 30,\nNet sales\n$\n29,946,234\n$\n43,089,024\nCosts and expenses:\nCost of goods sold\n25,212,383\n22,845,702\nSales and marketing\n13,686,049\n12,421,138\nGeneral and administrative\n5,023,822\n4,948,980\nTotal costs and expenses\n43,922,254\n40,215,820\n(Loss) Income from operations\n(13,976,020\n)\n2,873,204\nOther income (expense):\nInterest income\n297,262\n19,277\nLoss on foreign currency exchange\n-\n(34\n)\nTotal other income, net\n297,262\n19,243\n(Loss) Income before income taxes\n(13,678,758\n)\n2,892,447\nIncome tax expense\n(5,902,036\n)\n(518,532\n)\nNet (loss) income\n$\n(19,580,794\n)\n$\n2,373,915\nNet (loss) income per common share:\nBasic\n$\n(0.64\n)\n$\n0.08\nDiluted\n(0.64\n)\n0.08\nWeighted average number of shares used in computing net (loss) income per common share:\nBasic\n30,376,745\n30,363,076\nDiluted\n30,376,745\n31,316,028\nSee Notes to Consolidated Financial Statements.\nCHARLES & COLVARD, LTD.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\nCommon Stock\nNumber of\nShares\nAmount\nAdditional\nPaid-in\nCapital\nTreasury\nStock\nAccumulated\nDeficit\nTotal\nShareholders\nEquity\nBalance at June 30, 2021\n29,913,095\n$\n56,057,109\n$\n25,608,593\n$ -\n$\n(25,976,686\n)\n$\n55,689,016\nStock-based compensation\n-\n-\n774,341\n-\n-\n774,341\nIssuance of restricted stock\n242,725\n-\n-\n-\n-\n-\nStock option exercises\n622,226\n1,185,102\n(426,443 )\n-\n-\n758,659\nRepurchases of common stock\n(30,287 )\n-\n-\n(38,164 )\n-\n(38,164 )\nNet income\n-\n-\n-\n-\n2,373,915\n2,373,915\nBalance at June 30, 2022\n30,747,759\n$\n57,242,211\n$\n25,956,491\n$ (38,164 )\n$\n(23,602,771\n)\n$\n59,557,767\nStock-based compensation\n-\n-\n249,428\n-\n-\n249,428\nIssuance of restricted stock\n178,750\n-\n-\n-\n-\n-\nCancellation of restricted stock\n(44,688\n)\n-\n-\n-\n-\n-\nRepurchases of common stock\n(358,116 )\n-\n-\n(451,815 )\n-\n(451,815 )\nNet loss\n-\n-\n-\n-\n(19,580,794\n)\n(19,580,794\n)\nBalance at June 30, 2023\n30,523,705\n$\n57,242,211\n$\n26,205,919\n$ (489,979 )\n$\n(43,183,565\n)\n$\n39,774,586\nSee Notes to Consolidated Financial Statements.\nCHARLES & COLVARD, LTD.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended June 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet (loss) income\n$\n(19,580,794\n)\n$\n2,373,915\nAdjustments to reconcile net (loss) income to net cash (used in) provided by operating activities:\nDepreciation and amortization\n653,157\n479,308\nStock-based compensation\n249,428\n774,341\nProvision for uncollectible accounts\n98,000\n14,000\nRecovery of sales returns\n(23,000\n)\n(84,000\n)\nInventory write-downs\n6,004,000\n195,000\nRecovery of accounts receivable discounts\n(4,496\n)\n(4,285\n)\nDeferred income taxes\n5,851,904\n498,926\nChanges in operating assets and liabilities:\nAccounts receivable\n1,770,227\n(484,457\n)\nInventory\n755,224\n(4,535,080\n)\nPrepaid expenses and other assets, net\n892,845\n926,780\nAccounts payable\n384,926\n1,626,856\nAccrued income taxes\n-\n(9,878\n)\nAccrued expenses and other liabilities\n(926,512\n)\n(1,198,873\n)\nNet cash (used in) provided by operating activities\n(3,875,091\n)\n572,553\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchases of property and equipment\n(1,229,571\n)\n(1,496,471\n)\nPayments for intangible assets\n(53,952\n)\n(64,188\n)\nNet cash used in investing activities\n(1,283,523\n)\n(1,560,659\n)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nRepurchases of common stock\n(451,815\n)\n(38,164\n)\nStock option exercises\n-\n758,659\nNet cash (used in) provided by financing activities\n(451,815\n)\n720,495\nNET DECREASE IN CASH, CASH EQUIVALENTS AND RESTRICTED CASH\n(5,610,429\n)\n(267,611\n)\nCASH, CASH EQUIVALENTS AND RESTRICTED CASH, BEGINNING OF YEAR\n21,179,340\n21,446,951\nCASH, CASH EQUIVALENTS AND RESTRICTED CASH, END OF YEAR\n$\n15,568,911\n$\n21,179,340\nSupplemental disclosure of cash flow information:\nCash paid during the year for income taxes\n$\n5,900\n$\n-\nSee Notes to Consolidated Financial Statements.\nCHARLES & COLVARD, LTD.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.\nDESCRIPTION OF BUSINESS\nCharles & Colvard, Ltd. (the Company), a North Carolina corporation, was founded in 1995. The Company manufactures, markets, and distributes Charles\n& Colvard Created Moissanite® (hereinafter referred to as moissanite or moissanite jewels) and finished jewelry featuring moissanite, including Forever One™, the Companys premium moissanite gemstone brand, for sale in the worldwide fine jewelry market. The Company also markets and distributes Caydia® lab grown diamonds and finished jewelry featuring lab grown diamonds for sale in the worldwide fine jewelry market.\nThe Company sells loose moissanite jewels, loose lab grown diamonds, and finished jewelry featuring both moissanite and lab grown diamonds at wholesale prices to distributors, manufacturers, retailers, and designers, including some of the largest distributors and jewelry manufacturers in the world. In addition, In May 2023, the Company launched charlesandcolvarddirect.com, a direct-to-wholesaler sales portal, which is a gemstone product disposition wholesale outlet. The Companys finished jewelry and loose moissanite jewels and lab grown diamonds that are mounted into fine jewelry by other manufacturers are sold at retail outlets and via the Internet. The Company sells at retail prices to end-consumers through its own Charles & Colvard Signature Showroom, which opened in October 2022, and also through its wholly owned operating subsidiary, charlesandcolvard.com, LLC, third-party online marketplaces, drop-ship, and other pure-play, exclusively e-commerce outlets. The Company also sells at discount retail prices to end-consumers through moissaniteoutlet.com, LLC, a wholly owned operating subsidiary of charlesandcolvard.com, LLC, and third-party online marketplaces.\n2.\nBASIS OF PRESENTATION AND SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation and Principles of Consolidation - The accompanying consolidated financial statements as of and for the fiscal years ended June 30, 2023 and 2022, include the accounts of the Company and its wholly owned subsidiaries charlesandcolvard.com, LLC; including its wholly-owned subsidiary, moissaniteoulet.com, LLC, which was formed and organized as of February 24, 2022; Charles & Colvard Direct, LLC; and Charles & Colvard (HK) Ltd., the Companys Hong Kong subsidiary, which was entered into dormancy as of September 30, 2020 following its re-activation in December 2017. Charles & Colvard (HK) Ltd. previously became dormant in 2009 and has had no operating activity since 2008. Charles & Colvard Direct, LLC, had no operating activity during the fiscal years ended June 30, 2023 or 2022. All intercompany accounts have been eliminated.\nUse of Estimates - The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (U.S. GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. As future events and their effects cannot be fully determined with precision, actual results of operations, cash flow, and financial position could differ significantly from estimates. The most significant estimates impacting the Companys consolidated financial statements relate to valuation and classification of inventories, accounts receivable reserves, stock-based\ncompensation, and revenue recognition. Changes in estimates are reflected in the consolidated financial statements in the period in which the change in estimate occurs.\nReclassification - Certain amounts in the Companys consolidated financial statements for the fiscal year ended June 30, 2022 have been reclassified to conform to current presentation, principally amounts presented in Note 9, Accrued Expenses and Other Liabilities, relating to the combination of accrued sales tax and accrued franchise taxes, which had previously been presented separately. These reclassifications had no impact on the Companys consolidated financial position or consolidated results of operations as of or for the fiscal years ended June 30, 2023 and 2022.\nCash and Cash Equivalents - All highly liquid investments with an original maturity of three months or less from the date of purchase are considered to be cash equivalents. The Companys cash and cash equivalents include cash on deposit and a money market fund.\nRestricted Cash - In accordance with the terms of the Companys cash collateralized $5.00 million credit facility from JPMorgan Chase Bank, N.A. (JPMorgan Chase), which the Company entered into on July 12, 2021, as amended July 28, 2022 and amended further effective June 21, 2023, the Company is required to keep $5.1 million in a cash deposit account held by JPMorgan Chase. Such amount was held as security for the Companys credit facility from JPMorgan Chase. Accordingly, during the term of the JPMorgan Chase credit facility, the cash deposit held by JPMorgan Chase is classified as restricted cash for financial reporting purposes on the Companys Consolidated Balance Sheets.\nFor additional information regarding the Companys cash collateralized credit facility with JPMorgan Chase, see Note 11, Debt.\nPursuant to the terms and conditions of the Companys broker-dealer agreement with Oppenheimer & Co., Inc. (Oppenheimer), with whom the Company has engaged to transact common stock share repurchases in connection with its stock repurchase program, the Company is required to maintain a funded liquid margin account held by Oppenheimer for the benefit of the Company. The purpose of this account is to fund the Companys common stock repurchases and any underlying transaction costs and fees. Depending upon the level and timing of stock repurchase activity, the funded margin account cash balance will fluctuate from time to time. At June 30, 2023 and 2022, cash in the amount of approximately $30 and $461,000, respectively, was held by Oppenheimer. Such cash amount held by Oppenheimer was classified as restricted cash for financial reporting purposes on the Companys Consolidated Balance Sheets.\nFor additional information regarding the Companys stock repurchase program, see Note 12, Shareholders Equity and Stock-Based Compensation.\nThe reconciliation of cash, cash equivalents, and restricted cash, as presented on the Consolidated Statements of Cash Flows, consists of the following as of the dates presented:\nJune 30,\nCash and cash equivalents\n$\n10,446,532\n$\n15,668,361\nRestricted cash\n5,122,379\n5,510,979\nTotal cash, cash equivalents, and restricted cash\n$\n15,568,911\n$\n21,179,340\nConcentration of Credit Risk - Financial instruments that potentially subject the Company to concentrations of credit risk consist principally of cash on deposit and cash equivalents held with banks and trade accounts receivable. The Company places cash deposits with federally insured financial institutions and maintains its cash at banks and financial institutions it considers to be of high credit quality. However, the Companys cash deposits may at times exceed the Federal Deposit Insurance Corporations insurable limits. Accordingly, balances in excess of federally insured limitations may not be insured. The Company has not experienced losses on these accounts, and management believes that the Company is not exposed to significant risks on such accounts.\nTrade receivables potentially subject the Company to credit risk. Payment terms on trade receivables for the Companys Traditional segment customers are generally between 30 and 90 days, though it may offer extended terms with specific customers and on significant orders from time to time. The Company extends credit to its customers based upon a number of factors, including an evaluation of the customers financial condition and credit history that is verified through trade association reference services, the customers payment history with the Company, the customers reputation in the trade, and/or an evaluation of the Companys opportunity to introduce its moissanite jewels or finished jewelry featuring moissanite to new or expanded markets. Collateral is not generally required from customers. The need for an allowance for uncollectible accounts is determined based upon factors surrounding the credit risk of specific customers, historical trends, and other information.\nSee Note 14, Major Customers and Concentration of Credit Risk, for further discussion of credit risk within trade accounts receivable.\nAccounts Receivable Reserves - Estimates are used to determine the amount of two reserves against trade accounts receivable. The first reserve is an allowance for sales returns. At the time revenue is recognized, the Company estimates future returns using a historical return rate that is reviewed quarterly with consideration of any contractual return privileges granted to customers and it reduces sales and trade accounts receivable by this estimated amount. The Companys allowance for sales returns was $568,000 and $591,000 at June 30, 2023 and 2022, respectively.\nThe following are reconciliations of the allowance for sales returns balances for the periods presented:\nYear Ended June 30,\nBalance, beginning of year\n$\n591,000\n$\n675,000\nAdditions charged to operations\n5,405,613\n6,012,069\nSales returns\n(5,428,613\n)\n(6,096,069\n)\nBalance, end of year\n$\n568,000\n$\n591,000\nThe second reserve is an allowance for uncollectible accounts for the measurement of estimated credit losses resulting from the failure of the Companys customers to make required payments. This allowance reduces trade accounts receivable to an amount expected to be collected. The Company uses a current expected credit losses model whereby management estimates credit losses expected over the life of its pool of exposures based on historical percentages of uncollectible accounts, changes in payment history, and facts and circumstances, including any current extenuating economic conditions, regarding specific accounts that become known to, or forecasted by, management to be uncollectible when evaluating the adequacy of the allowance for uncollectible accounts. The Company determines a credit loss percentage based on the age of the receivable that it deems uncollectible related to potential credit losses. The Company records an allowance for such credit losses, which includes a provision for expected losses based on historical write-offs, adjusted for current conditions as deemed necessary, reasonable and supportable forecasts about future conditions, and a specific reserve for accounts deemed at risk. The allowance is the Companys estimate for accounts receivable as of the balance sheet date that ultimately will not be collected. Any changes in the allowance are reflected in the results of operations in the period in which the change occurs. The Company writes-off accounts receivable and the related allowance recorded previously when it becomes probable, based upon customer facts and circumstances, that such amounts will not be collected. The Company generally uses internal collection efforts, which may include its sales personnel as it deems appropriate. After all internal collection efforts have been exhausted, the Company generally writes-off the underlying account receivable.\nAny accounts with significant balances are reviewed separately to determine an appropriate allowance based on the facts and circumstances of the specific underlying customer account. During its review for the fiscal years ended June 30, 2023 and 2022, the Company determined no additional reserves were necessary for specific accounts. Based on these criteria, management determined that allowances for uncollectible accounts receivable of $183,000 and $85,000 at June 30, 2023 and 2022, respectively, were required.\nThe following are reconciliations of the allowance for uncollectible accounts balances as of the periods presented:\nYear Ended June 30,\nBalance, beginning of year\n$\n85,000\n$\n71,000\nAdditions charged to operations\n98,000\n14,000\nBalance, end of year\n$\n183,000\n$\n85,000\nAlthough the Company believes that its reserves are adequate, if the financial condition of its customers deteriorates, resulting in an impairment of their ability to make payments, or if it underestimates the allowances required, additional allowances may be necessary, which would result in increased expense in the period in which such determination is made.\nInventories - Inventories are stated on an average cost basis at the lower of cost or net realizable value. Inventory costs include direct material and labor, inbound freight, purchasing and receiving costs, inspection costs, and warehousing costs. Any inventory on hand at the measurement date in excess of the Companys current requirements based on historical and anticipated levels of sales is classified as long-term on the Companys Consolidated Balance Sheets. The Companys classification of its inventory as either current or long-term inventory requires it to estimate the portion of on-hand inventory that is expected to be realized over the next 12 months and does not include precious metal, labor, and other inventory purchases expected to be both purchased and realized in cost of sales over the next 12 months.\nEach accounting period, the Company evaluates the valuation and classification of inventories including the need for potential inventory write-downs, which also include significant estimates by management. The Companys inventory-related valuation allowances are recorded in the aggregate rather than an individual item approach for each obsolescence, rework, and shrinkage valuation allowance.\nProperty and Equipment - Property and equipment are stated at cost and are depreciated over their estimated useful lives using the straight-line method as follows:\nMachinery and equipment\n5 to 12 years\nComputer hardware\n3 to 5 years\nComputer software\n3 years\nFurniture and fixtures\n5 to 10 years\nLeasehold improvements\nShorter of the estimated useful life or lease term\nIntangible Assets - The Company capitalizes costs associated with obtaining or defending patents issued or pending for inventions and license rights related to the manufacturing of moissanite gemstones and fine jewelry set with moissanite and lab grown diamond jewels. Such costs are amortized over the life of the patent, generally 15 years. The Company also capitalizes licenses it obtains for the use of certain advertising images and external costs incurred for trademarks. Such costs are amortized over the period of the license or estimated useful life of the trademark, respectively.\nImpairment of Long-Lived Assets - The Company evaluates the recoverability of its long-lived assets by reviewing them for possible impairment whenever events or changes in circumstances indicate that the carrying value of such assets may not be recoverable. The recoverability of assets to be held and used is measured by comparing the carrying value of the asset to future net undiscounted cash flows expected to be generated by the asset. If such assets are considered to be impaired, the impairment is measured as the amount by which the carrying value exceeds the fair value and such amount is recognized as an operating expense in the period in which the determination is made. As of June 30, 2023, the Company did not identify any indicators of long-lived asset impairment.\nIn addition to the recoverability assessment, the Company routinely reviews the remaining estimated useful lives of its long-lived assets. Any reduction in the useful-life assumption would result in increased depreciation and amortization expense in the current period in which such determination is made, as well as in subsequent periods.\nRevenue Recognition - Revenue is recognized to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the Company expects to be entitled in exchange for those goods or services. To achieve this principle, the Company performs the following five steps: (i) identification of a contract with a customer; (ii) identification of any separate performance obligations; (iii) determination of the transaction price; (iv) allocation of the transaction price to the performance obligations in the contract; and (v) recognition of revenue when the Company has satisfied the underlying performance obligations. The Company recognizes substantially all of its revenue at a point in time when control of the Companys goods has passed to the customer with the exception of consigned goods. The Company considers its sole performance obligation related to the shipment of goods satisfied at the time this control is transferred which is typically upon shipment but may be upon delivery depending on the contractual arrangement with the customer. Customer payment terms for these shipments typically range between 30- and 90-days. Customers purchasing items through the Companys websites pay amounts in advance of the Company transferring control of the goods. Amounts received in advance of the transfer of control are included in deferred revenue within accrued expenses and other liabilities on the consolidated balance sheets until the time of the transfer of control of the goods. The amounts included in deferred revenue of $452,866 and $774,891 at June 30, 2022 and June 30, 2021, respectively, were recorded in net sales during the fiscal years ended June 30, 2023 and June 30, 2022, respectively. The opening accounts receivable, net balance as of July 1, 2021 was $1,662,074. The Company has elected to treat shipping and handling performed after control has transferred to customers as a fulfillment activity, and additionally, has elected the practical expedient to report sales taxes on a net basis. The Company records shipping and handling expense related to product sales as cost of sales.\nThe Company has a variable consideration element related to most of its contracts in the form of product return rights. At the time revenue is recognized, an allowance for estimated returns is established and any change in the allowance for returns is charged against net sales in the current period. For the Companys Traditional segment customers, the returns policy generally allows for the return of jewels and finished jewelry with a valid reason for credit within 30 days of shipment. Online Channels segment customers in both of the Companys transactional websites, charlesandcolvard.com and moissaniteoutlet.com, may also generally return purchases within 30 days of the shipment date in accordance with the Companys returns policies as disclosed on its charlesandcolvard.com and moissaniteoutlet.com websites.\nPeriodically, the Company ships loose jewel goods and finished goods to Traditional segment customers on consignment terms. Under these consignment terms, the customer assumes the risk of loss and has an absolute right of return for a specified period that typically ranges from six months to one year. The Companys Online Channels segment and Traditional segment customers are generally required to make payments on consignment shipments within 30 to 60 days upon the customer informing the Company that it will keep the inventory. Accordingly, the Company does not recognize revenue on these consignment transactions until the earlier of (i) the customer informing the Company that it will keep the inventory; (ii) the expiration of the right of return period; or (iii) the customer informing the Company that the inventory has been sold to the end consumer.\nThe Company presents disaggregated net sales by its Online Channels segment and its Traditional segment for both finished jewelry and loose jewels product lines. The Company also presents disaggregated net sales by geographic area between the United States and international locations. For financial reporting purposes, disaggregated net sales amounts are presented in Note 3, Segment Information and Geographic Data.\nReturns Asset and Refund Liabilities\nThe Company maintains a returns asset account and a refund liabilities account to record the effects of its estimated product returns and sales returns allowance. The Companys returns asset and refund liabilities are updated at the end of each financial reporting period and the effect of such changes are accounted for in the period in which such changes occur.\nThe Company estimates anticipated product returns in the form of a refund liability based on historical return percentages and current period sales levels. The Company also accrues a related returns asset for goods expected to be returned in salable condition, less any expected costs to recover such goods, including return shipping costs that the Company may incur. As of June 30, 2023 and 2022, the Companys refund liabilities balances were $568,000 and $591,000, respectively, and are included as allowances for sales returns within accounts receivable, net, in the accompanying consolidated balance sheets. As of June 30, 2023 and 2022, the Companys returns asset balances were $290,000 and $260,000, respectively, and are included within prepaid expenses and other assets in the accompanying consolidated balance sheets.\nCost of Goods Sold - Cost of goods sold is primarily composed of inventory sold during the period; inventory written-down during the period due to ongoing quality and obsolescence reviews; salaries and payroll-related expenses for personnel involved in preparing and shipping product to customers; an allocation of shared expenses such as rent, utilities, communication expenses, and depreciation related to preparing and shipping product to customers; and outbound freight charges.\nAdvertising Costs - Advertising production costs are expensed as incurred. Media placement costs are expensed the first time the underlying advertising appears.\nThe Company also offers a cooperative advertising program to certain of its distributor and retail partners that reimburses, via a credit towards future purchases, a portion of their marketing costs based on the customers net purchases from the Company and is subject to the customer providing documentation of all advertising performed that includes the Companys products. For the fiscal years ended June 30, 2023 and 2022, these approximate amounts were $606,000 and $792,000, respectively, and are included as a component of sales and marketing expenses. Because the Company receives a distinct good or service in exchange for consideration and the fair value of the benefit can be reasonably estimated, these transactions are reflected as sales and marketing expenses.\nAdvertising expenses, inclusive of the cooperative advertising program, for the fiscal years ended June 30, 2023 and 2022, were approximately $7.89 million and $7.38 million, respectively.\nSales and Marketing - Sales and marketing costs are expensed as incurred. These costs include all expenses of promoting and selling the Companys products and include such items as the salaries, payroll-related expenses, and travel of sales and marketing personnel; digital marketing; advertising; trade shows; market research; sales commissions; and an allocation of overhead expenses attributable to these activities. Except for an allocation to general and administrative expenses, these costs also include the operating expenses of charlesandcolvard.com, LLC, the Companys wholly owned operating subsidiary, which include the operating expenses of its wholly owned subsidiary, moissaniteoutlet.com, LLC.\nGeneral and Administrative - General and administrative costs are expensed as incurred. These costs include the salaries and payroll-related expenses of executive, finance, information technology, and administrative personnel; legal, investor relations, and professional fees; general office and administrative expenses; Board of Directors fees; rent; bad debts; and insurance.\nStock-Based Compensation - The Company recognizes compensation expense for stock-based awards based on estimated fair values on the date of grant. The Company uses the Black-Scholes-Merton option pricing model to determine the fair value of stock options. The fair value of restricted stock awards is determined by the market price of the Companys common stock on the date of grant. The expense associated with stock-based compensation is recognized on a straight-line basis over the requisite service period of each award.\nFair value of stock options using the Black-Scholes-Merton option pricing model is estimated on the date of grant utilizing certain assumptions for dividend yield, expected volatility, risk-free interest rate, and expected lives of the awards, as follows:\nDividend Yield. Although the Company issued dividends in prior years, a dividend yield of zero is used due to the lack of recent dividend payments and the uncertainty of future dividend payments;\nExpected Volatility. Volatility is a measure of the amount by which a financial variable such as share price has fluctuated (historical volatility) or is expected to fluctuate (expected volatility) during a period. The Company estimates expected volatility giving primary consideration to the historical volatility of its common stock;\nRisk-Free Interest Rate. The risk-free interest rate is based on the published yield available on U.S. Treasury issues with an equivalent term remaining equal to the expected life of the stock option; and\nExpected Lives. The expected lives of the issued stock options represent the estimated period of time until exercise or forfeiture and are based on the simplified method of using the mid-point between the vesting term and the original contractual term. The simplified method is used because historically the Company has not had sufficient option exercise experience.\nThe assumptions used in calculating the fair value of stock-based payment awards represent managements best estimates, but these estimates involve inherent uncertainties and the application of managements judgment. As a result, if factors change and the Company uses different assumptions, the Companys stock-based compensation expense could be materially different in the future. In addition, the Company is required to estimate the expected forfeiture rates of stock-based awards and only recognize expense for those shares expected to vest. In estimating the Companys forfeiture rates, the Company analyzes its historical forfeiture rates. If the Companys actual forfeiture rates are materially different from its estimates, or if the Company re-evaluates the forfeiture rates in the future, the stock-based compensation expense could be significantly different from what the Company has recorded in the current period.\nIncome Taxes - Deferred income taxes are recognized for the income tax consequences of temporary differences by applying enacted statutory income tax rates applicable to future years to differences between the financial statement carrying amounts and the income tax bases of existing assets and liabilities. Valuation allowances are established when necessary to reduce deferred income tax assets to the amount that is more likely than not to be realized.\nNet (Loss) Income per Common Share - Basic net (loss) income per common share is computed by dividing net (loss) income by the weighted average number of common shares outstanding during the periods. Diluted net (loss) income per common share is computed using the weighted average number of common and dilutive common equivalent shares outstanding during the periods. Common equivalent shares consist of stock options and unvested restricted shares that are computed using the treasury stock method.\nAs of the dates presented, the following table reconciles the differences between the basic and diluted net (loss) income per share presentations:\nYear Ended June 30,\nNumerator:\nNet (loss) income\n$\n(19,580,794\n)\n$\n2,373,915\nDenominator:\nWeighted average common shares outstanding:\nBasic\n30,376,745\n30,363,076\nEffect of dilutive securities\n-\n952,952\nDiluted\n30,376,745\n31,316,028\nNet (loss) income per common share:\nBasic\n$\n(0.64\n)\n$ 0.08\nDiluted\n$\n(0.64\n)\n$ 0.08\nFor the fiscal year ended June 30, 2023, stock options to purchase approximately 1.82 million shares were excluded from the computation of diluted net loss per common share because the effect of inclusion of such amounts would be anti-dilutive to net loss per common share. For the fiscal year ended June 30, 2022, stock options to purchase approximately 758,000 were excluded from the computation of diluted net income per common share because the exercise price of the stock options was greater than the average market price of the common shares or the effect of inclusion of such amounts would be anti-dilutive to net income per common share. Approximately 179,000 shares of unvested restricted stock are excluded from the computation of diluted net loss per common share as of June 30, 2023 because the shares are performance-based, and the underlying conditions have not been met as of the period presented and the effects of the inclusion of such shares would be anti-dilutive to net loss per common share. Approximately 45,000 shares of unvested restricted stock were excluded from the computation of diluted net income per common share as of June 30, 2022 because the shares were performance-based, and the underlying conditions had not been met as of June 30, 2022.\n3.\nSEGMENT INFORMATION AND GEOGRAPHIC DATA\nThe Company reports segment information based on the management approach. The management approach designates the internal reporting used by management for making operating decisions and assessing performance as the source of the Companys operating and reportable segments.\nThe Company manages its business through two operating and reportable segments based on its distribution channels to sell its product lines, loose jewels and finished jewelry: its Online Channels segment, which consists of e-commerce outlets including charlesandcolvard.com, moissaniteoutlet.com, third-party online marketplaces, drop-ship retail, and other pure-play, exclusively e-commerce outlets; and its Traditional segment, which consists of wholesale and retail customers, including its own Charles & Colvard Signature Showroom and charlesandcolvarddirect.com. The accounting policies of the Online Channels segment and Traditional segment are the same as those described in Note 2, Basis of Presentation and Significant Accounting Policies.\nThe Company evaluates the financial performance of its segments based on net sales and product line gross profit, or the excess of product line sales over product line cost of goods sold. The Companys product line cost of goods sold is defined as product cost of goods sold, excluding non-capitalized expenses from the Companys manufacturing and production control departments, comprising personnel costs, depreciation, leases, utilities, and corporate overhead allocations; freight out; inventory write-downs; and other inventory adjustments, comprising costs of quality issues, and damaged goods.\nSummary financial information by reportable segment for the periods presented is as follows:\nYear Ended June 30, 2023\nOnline\nChannels\nTraditional\nTotal\nNet sales\nFinished jewelry\n$\n19,607,941\n$\n4,377,673\n$\n23,985,614\nLoose jewels\n1,884,939\n4,075,681\n5,960,620\nTotal\n$\n21,492,880\n$\n8,453,354\n$\n29,946,234\nProduct line cost of goods sold\nFinished jewelry\n$\n9,214,749\n$\n3,182,342\n$\n12,397,091\nLoose jewels\n705,576\n2,039,401\n2,744,977\nTotal\n$\n9,920,325\n$\n5,221,743\n$\n15,142,068\nProduct line gross profit\nFinished jewelry\n$\n10,393,192\n$\n1,195,331\n$\n11,588,523\nLoose jewels\n1,179,363\n2,036,280\n3,215,643\nTotal\n$\n11,572,555\n$\n3,231,611\n$\n14,804,166\nDepreciation and amortization\n$\n215,978\n$\n437,179\n$\n653,157\nCapital expenditures\n$\n423,150\n$\n806,421\n$\n1,229,571\nYear Ended June 30, 2022\nOnline\nChannels\nTraditional\nTotal\nNet sales\nFinished jewelry\n$\n23,539,347\n$\n6,172,883\n$\n29,712,230\nLoose jewels\n3,240,702\n10,136,092\n13,376,794\nTotal\n$\n26,780,049\n$\n16,308,975\n$\n43,089,024\nProduct line cost of goods sold\nFinished jewelry\n$\n9,837,830\n$\n4,094,870\n$\n13,932,700\nLoose jewels\n1,209,832\n4,959,958\n6,169,790\nTotal\n$\n11,047,662\n$\n9,054,828\n$\n20,102,490\nProduct line gross profit\nFinished jewelry\n$\n13,701,517\n$\n2,078,013\n$\n15,779,530\nLoose jewels\n2,030,870\n5,176,134\n7,207,004\nTotal\n$\n15,732,387\n$\n7,254,147\n$\n22,986,534\nDepreciation and amortization\n$\n235,643\n$\n243,665\n$\n479,308\nCapital expenditures\n$\n305,586\n$\n1,190,885\n$\n1,496,471\nThe Company does not allocate any assets to the reportable segments, and, therefore, no asset information is reported to the chief operating decision maker or disclosed in the financial information for each segment.\nA reconciliation of the Companys product line cost of goods sold to cost of goods sold as reported in the consolidated financial statements is as follows:\nYear Ended June 30,\nProduct line cost of goods sold\n$\n15,142,068\n$\n20,102,490\nNon-capitalized manufacturing and production control expenses\n2,210,494\n1,661,207\nFreight out\n1,068,437\n1,195,062\nInventory write-downs\n6,004,000\n195,000\nOther inventory adjustments\n787,384\n(308,057\n)\nCost of goods sold\n$\n25,212,383\n$\n22,845,702\nA reconciliation of the Companys consolidated product line gross profit to the Companys consolidated net (loss) income before income taxes is as follows:\nYear Ended June 30,\nProduct line gross profit\n$\n14,804,166\n$\n22,986,534\nNon-allocated cost of goods sold\n(10,070,315\n)\n(2,743,212\n)\nSales and marketing\n(13,686,049\n)\n(12,421,138\n)\nGeneral and administrative\n(5,023,822\n)\n(4,948,980\n)\nTotal other income, net\n297,262\n19,243\n(Loss) Income before income taxes\n$\n(13,678,758\n)\n$\n2,892,447\nThe Company recognizes sales by geographic area based on the country in which the customer is based. Sales to international end consumers made through the Companys transactional websites, charlesandcolvard.com, charlesandcolvarddirect.com, and moissaniteoutlet.com, are included in international sales for financial reporting purposes. A portion of the Companys Traditional segment sales made to international wholesale distributors represents products sold internationally that may be re-imported to U.S. retailers.\nAll intangible assets, as well as property and equipment, as of June 30, 2023 and 2022, are held and located in the United States.\nThe following presents net sales data by geographic area for the periods presented:\nYear Ended June 30,\nNet sales\nUnited States\n$\n29,056,696\n$\n41,138,538\nInternational\n889,538\n1,950,486\nTotal\n$\n29,946,234\n$\n43,089,024\n4.\nFAIR VALUE MEASUREMENTS\nUnder U.S. GAAP, fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. U.S. GAAP also establishes a hierarchy for inputs used in measuring fair value that maximizes the use of observable inputs and minimizes the use of unobservable inputs by requiring that the most observable inputs be used when available. Observable inputs are obtained from independent sources and can be validated by a third party, whereas unobservable inputs reflect assumptions regarding what a third party would use in pricing an asset or liability.\nThe fair value hierarchy consists of three levels based on the reliability of inputs, as follows:\nLevel 1. Quoted prices in active markets for identical assets and liabilities;\nLevel 2. Inputs other than Level 1 quoted prices that are directly or indirectly observable; and\nLevel 3. Unobservable inputs that are not corroborated by market data.\nThe Company evaluates assets and liabilities subject to fair value measurements on a recurring and non-recurring basis to determine the appropriate level to classify them for each reporting period. This determination requires significant judgments to be made by the Companys management. The financial instruments identified as subject to fair value measurements on a recurring basis are cash, cash equivalents, and restricted cash, notes receivable, trade accounts receivable, and trade accounts payable. All financial instruments are reflected in the consolidated balance sheets at carrying value, which approximates fair value due to the short-term nature of these financial instruments.\nThere were no assets measured at fair value on a non-recurring basis as of June 30, 2023 or 2022.\n5.\nNOTE RECEIVABLE\nOn March 5, 2021, the Company entered into a $250,000 convertible promissory note agreement (the Convertible Promissory Note), with an unrelated third-party strategic marketing partner. The Convertible Promissory Note is unsecured and was scheduled originally to mature on March 5, 2022. In February 2022, the Company entered into an amendment to the Convertible Promissory Note that was effective as of December 9, 2021 and changed the maturity date to September 30, 2022. Effective September 26, 2022, the Company further amended the Convertible Promissory Note (the September 2022 Amendment) and changed the maturity date to June 20, 2024 (the Maturity Date). In accordance with the terms of the September 2022 Amendment, the note receivable is classified as a current note receivable within the accompanying consolidated financial statements as of June 30, 2023.\nInterest is accrued at a simple rate of 0.14% per annum and will continue to accrue until the Convertible Promissory Note is converted in accordance with the conversion privileges contained within the Convertible Promissory Note or is repaid. Principal outstanding during an event of default accrues interest at the rate of 5% per annum. In accordance with the terms of the September 2022 Amendment, accrued and unpaid interest on the Convertible Promissory Note is classified as a current asset and included in other current assets in the accompanying consolidated financial statements as of June 30, 2023.\nSubject to the borrowers completion of a specified equity financing transaction (an Equity Financing) on or prior to the Maturity Date, the unpaid principal amount, including accrued and unpaid interest, automatically converts into equity units of the most senior class of equity securities issued to investors in the Equity Financing at the lesser of 80% of the per unit price of the units purchased by investors or the price equal to $33,500,000 divided by the aggregate number of outstanding units of the borrower immediately prior to the closing of the financing. Unless converted as provided in the Convertible Promissory Note, the principal amount, including accrued and unpaid interest, will, on the Maturity Date, at the Companys option either (i) become due and payable to the Company, or (ii) convert into equity units at the specified conversion price in accordance with the terms of the Convertible Promissory Note.\n6.\nINVENTORIES\nThe Companys total inventories, net consisted of the following as of the dates presented:\nJune 30,\nFinished jewelry:\nRaw materials\n$\n1,288,906\n$\n1,697,361\nWork-in-process\n1,223,670\n1,260,728\nFinished goods\n12,772,611\n12,100,910\nFinished goods on consignment\n2,039,506\n2,135,856\nTotal finished jewelry\n17,324,693\n17,194,855\nLoose jewels:\nRaw materials\n421,603\n1,985,355\nWork-in-process\n6,131,853\n8,485,713\nFinished goods\n2,294,270\n5,454,266\nFinished goods on consignment\n254,323\n303,491\nTotal loose jewels\n9,102,049\n16,228,825\nTotal supplies inventory\n326,834\n89,120\nTotal inventory\n$\n26,753,576\n$\n33,512,800\nAs of the dates presented, the Companys total inventories, are classified as follows:\nJune 30,\nShort-term portion\n$\n7,476,046\n$\n11,024,276\nLong-term portion\n19,277,530\n22,488,524\nTotal inventory\n$\n26,753,576\n$\n33,512,800\nThe Companys work-in-process inventories include raw SiC crystals on which processing costs, such as labor and sawing, have been incurred; and components, such as metal castings and finished goods set with moissanite jewels, that have been issued to jobs in the manufacture of finished jewelry. The Companys moissanite jewel manufacturing process involves the production of intermediary shapes, called preforms, that vary depending upon the expected size and shape of the finished jewel. To maximize manufacturing efficiencies, preforms may be made in advance of current finished inventory needs but remain in work-in-process inventories. As of June 30, 2023 and 2022, work-in-process inventories issued to active production jobs approximated $1.99 million and $2.76 million, respectively.\nThe Companys moissanite and lab grown diamond jewels do not degrade in quality over time and inventory generally consists of the shapes and sizes most commonly used in the jewelry industry. In addition, approximately one-half of the Companys jewel inventory is not mounted in finished jewelry settings and is therefore not subject to fashion trends. Product obsolescence is closely monitored and reviewed by management as of and for each financial reporting period.\nThe Company manufactures finished jewelry featuring moissanite and lab grown diamonds. Relative to loose moissanite jewels and lab grown diamonds, finished jewelry is more fashion-oriented and subject to styling trends that could render certain designs obsolete over time. The majority of the Companys finished jewelry featuring moissanite and lab grown diamonds is held in inventory for resale and largely consists of such core designs as stud earrings, solitaire and three-stone rings, pendants, and bracelets that tend not to be subject to significant obsolescence risk due to their classic styling. In addition, the Company generally holds smaller quantities of designer-inspired and trend moissanite fashion jewelry that is available for resale through retail companies and through its Online Channels segment. The Company also carries a limited amount of inventory as part of its sample line that the Company uses in the selling process to its customers.\nThe Companys continuing operating subsidiaries carry no net inventories, and inventory is transferred without intercompany markup from the parent entity as product line cost of goods sold when sold to the end consumer.\nThe Companys inventories are stated at the lower of cost or net realizable value on an average cost basis. Each accounting period the Company evaluates the valuation and classification of inventories including the need for potential inventory write-downs, which also include significant estimates by management. As a result of the deterioration of marketability of certain of the Companys loose jewels inventory, management determined that the inventory has lost certain of its revenue-generating ability and the net realizable value of this inventory has fallen below that of its historical carrying cost. The multiple grades of the Companys Moissanite by Charles & Colvard® loose gemstones and lab-grown diamonds have seen a market deterioration which started in the quarterly period ended June 30, 2023 due to the recent downward pricing pressure on both mined and lab grown diamonds. These trends in the diamond market have now put considerable pricing pressure on moissanite - for rough and loose gemstones - and due to oversupply of rough and loose gems for lab grown diamonds the net realizable value of such inventory has decreased.\nIncluded in cost of goods sold during the quarter and year ended June 30, 2023, is the write-down of approximately $5.9 million of a portion of the Companys non-Forever One™ loose jewels inventory in response to pricing pressures and constrained consumer demand that has impacted the net realizable value of such inventory. The non-Forever One™ material inventory is comprised of raw materials, or boules, work-in-process gemstones, and loose finished gemstones.\n7.\nPROPERTY AND EQUIPMENT\nProperty and equipment, net, consists of the following as of the dates presented:\nJune 30,\nComputer software\n$\n2,865,994\n$\n2,392,465\nMachinery and equipment\n1,203,585\n1,182,171\nComputer hardware\n1,841,972\n1,621,198\nLeasehold improvements\n2,213,330\n1,847,227\nFurniture and fixtures\n676,014\n528,742\nTotal\n8,800,895\n7,571,803\nLess accumulated depreciation\n(6,309,326\n)\n(5,670,627\n)\nProperty and equipment, net\n$\n2,491,569\n$\n1,901,176\nDepreciation expense for the fiscal years ended June 30, 2023 and 2022 was approximately $639,000\nand $471,000, respectively.\n8.\nINTANGIBLE ASSETS\nIntangible assets, net, consist of the following as of the dates presented:\nWeighted Average\nRemaining\nJune 30,\nAmortization Period\n(in Years)\nPatents\n$\n1,017,007\n$\n1,017,007\n11.6\nTrademarks\n296,294\n242,342\n9.0\nLicense rights\n6,718\n6,718\n-\nTotal\n1,320,019\n1,266,067\nLess accumulated amortization\n(1,014,316\n)\n(1,000,337\n)\nIntangible assets, net\n$\n305,703\n$\n265,730\nAmortization expense for the fiscal years ended June 30, 2023 and 2022 was approximately $14,000\nand $8,000, respectively. Amortization expense on existing intangible assets is estimated to be approximately $28,000 for the fiscal year ending June 30, 2024, approximately $27,000 for each of the fiscal years ending June 30, 2025, 2026, and 2027, and approximately $26,000\nfor the fiscal year ending June 30, 2028. The amortization expense for the remaining unamortized balance of the total intangible assets, net, will be recognized in fiscal years ending after June 30, 2028.\n9.\nACCRUED EXPENSES AND OTHER LIABILITIES\nTotal accrued expenses and other liabilities consist of the following as of the dates presented:\nJune 30,\nDeferred revenue\n$\n566,896\n$\n452,866\nAccrued compensation and related benefits\n382,630\n614,443\nAccrued cooperative advertising\n243,861\n137,467\nAccrued sales tax and franchise taxes\n202,091\n341,706\nOther accrued expenses\nAccrued expenses and other liabilities\n$\n1,395,479\n$\n1,546,483\n10.\nCOMMITMENTS AND CONTINGENCIES\nLease Arrangements\nOn December 9, 2013, the Company entered into a Lease Agreement, as amended on December 23, 2013, April 15, 2014, and January 29, 2021 (the Lease Agreement), for its corporate headquarters, which occupies approximately 36,350 square feet of office, storage and light manufacturing space and is classified as an operating lease for financial reporting purposes. The expiration date of the base term of the Lease Agreement is October 31, 2026 and the terms of the Lease Agreement contain no early termination provisions. Provided there is no outstanding uncured event of default under the Lease Agreement, the Company has an option to extend the lease term for a period of five years. The Companys option to extend the term of the Lease Agreement must be exercised in writing on or before 270 days prior to expiration of the then-current term. If the option is exercised, the monthly minimum rent for each of the extended terms will be adjusted to the then prevailing fair market rate.\nThe Company took possession of the leased property on May 23, 2014, once certain improvements to the leased space were completed and did not have access to the property before this date. Upon execution of the third amendment to the Lease Agreement (the Lease Amendment) on January 29, 2021, the Lease Amendment included a rent abatement in the amount of approximately $214,000, which is reflected in the rent payments used in the calculation of the right-of-use (ROU) asset and lease liability once remeasured upon the execution of the Lease Amendment to extend the lease term. The Lease Amendment also included an allowance for leasehold improvements offered by the landlord in an amount not to exceed approximately $545,000. The Company has been reimbursed approximately $506,000 by the landlord for qualified leasehold improvements in accordance with the terms of the Lease Amendment. This reimbursement by the landlord reduced the remaining ROU asset by the same amount and is being recognized prospectively over the remaining term of the lease.\nThe Company has no other material operating leases and is not party to leases that would qualify for classification as a finance lease, variable lease, or short-term lease.\nAs of June 30, 2023, the Companys balance sheet classifications of its leases are as follows:\nOperating Leases:\nNoncurrent operating lease ROU assets\n$\n2,183,232\nCurrent operating lease liabilities\n$\n880,126\nNoncurrent operating lease liabilities\n2,047,742\nTotal operating lease liabilities\n$\n2,927,868\nThe Companys total operating lease cost was approximately $698,000 and $596,000 for the fiscal years ended June 30, 2023 and 2022, respectively.\nThe Companys estimated incremental borrowing rate used and assumed discount rate with respect to operating leases was 2.81% and the remaining operating lease term was 3.33 years.\nAs of June 30, 2023, the Companys remaining future payments under operating leases for each fiscal year ending June 30 are as follows:\n$\n893,660\n918,236\n943,487\n317,327\nTotal lease payments\n3,072,710\nLess: imputed interest\n144,842\nPresent value of lease payments\n2,927,868\nLess: current lease liability\n880,126\nTotal long-term lease liability\n$\n2,047,742\nThe Company makes cash payments for amounts included in the measurement of its lease liabilities. During the fiscal years ended June 30, 2023 and 2022, cash paid for operating leases was approximately $916,000 and $550,000,\nrespectively.\nPurchase Commitments\nOn December 12, 2014, the Company entered into an exclusive supply agreement (the Supply Agreement) with Wolfspeed, Inc. (Wolfspeed), formerly known as Cree, Inc. Under the Supply Agreement, subject to certain terms and conditions, the Company agreed to exclusively purchase from Wolfspeed, and Wolfspeed agreed to exclusively supply, 100% of the Companys required SiC materials in quarterly installments that must equal or exceed a set minimum order quantity. The initial term of the Supply Agreement was scheduled to expire on June 24, 2018, unless extended by the parties.\nEffective June 22, 2018, the Supply Agreement was amended to extend the expiration date to June 25, 2023. The Supply Agreement was also amended to (i) provide the Company with one option, subject to certain conditions, to unilaterally extend the term of the Supply Agreement for an additional two-year period following expiration of the initial term; (ii) establish a process by which Wolfspeed may begin producing alternate SiC material based on the Companys specifications that will give the Company the flexibility to use the materials in a broader variety of its products; and (iii) permit the Company to purchase certain amounts of SiC materials from third parties under limited conditions.\nEffective June 30, 2020, the Supply Agreement was further amended to extend the expiration date to June 29, 2025, which may be extended again by mutual agreement of the parties. The Supply Agreement was also amended to, among other things, (i) spread the Companys total purchase commitment under the Supply Agreement in the amount of approximately $52.95 million over the term of the Supply Agreement, as amended; (ii) establish a process by which Wolfspeed has agreed to accept purchase orders in excess of the agreed-upon minimum purchase commitment, subject to certain conditions; and (iii) permit the Company to purchase revised amounts of SiC materials from third parties under limited conditions.\nThe Companys total purchase commitment under the Supply Agreement, as amended, until June 2025 is approximately $52.95 million, of which approximately $24.75 million remains to be purchased as of June 30, 2023. Over the life of the Supply Agreement, as amended, the Companys future minimum annual purchase commitments of SiC crystals range from approximately $4.00 million to $10.00 million each year.\nDuring the fiscal years ended June 30, 2023 and 2022, the Company purchased approximately $1.80 million and $6.29 million, respectively, of SiC crystals from Wolfspeed.\nThe Company has made no purchases of SiC crystals during the nine-month period ended June 30, 2023 while in discussions regarding the terms of the Supply Agreement.\nOn July 28, 2023, Wolfspeed initiated a confidential arbitration against the Company for breach of contract claiming damages, plus interest, costs, and attorneys fees. Wolfspeed has alleged that the Company failed to satisfy the purchase obligations provided in the Supply Agreement for Fiscal 2023 in the amount of $4.25 million and failed to pay for $3.30 million of SiC crystals Wolfspeed delivered to the Company. Wolfspeed further alleges that the Company intends to breach its remaining purchase obligations under the Supply Agreement, representing an additional $18.5 million in alleged damages.\nWhile the Company is evaluating Wolfspeeds claims, the Company disputes the amount sought, and intends to vigorously defend its position, including by asserting rights and defenses that the Company may have under the Supply Agreement at law and in equity. A hearing has not yet been scheduled. The final determinations of liability arising from this matter will only be made following comprehensive investigations, discovery and arbitration processes.\n11.\nDEBT\nLine of Credit\nEffective July 7, 2021, the Company obtained from JPMorgan Chase a $5.00 million cash collateralized line of credit facility (the JPMorgan Chase Credit Facility). The JPMorgan Chase Credit Facility may be used for general corporate and working capital purposes, including permitted acquisitions and certain additional indebtedness for borrowed money, installment obligations, and obligations under capital and operating leases. The JPMorgan Chase Credit Facility is secured by a cash deposit in the amount of $5.1 million held by JPMorgan Chase as collateral for the line of credit facility and was scheduled to mature on July 31, 2022. Effective July 28, 2022, the JPMorgan Chase Credit Facility was amended to, among other things, extend the maturity date to July 31, 2023, and append the Companys obligations under the JPMorgan Chase Credit Facility to be guaranteed by the Companys wholly owned subsidiaries, Charles & Colvard Direct, LLC, charlesandcolvard.com, LLC, and moissaniteoutlet.com, LLC. Effective, June 21, 2023, the JPMorgan Chase Credit Facility was amended further to extend the maturity date to July 31, 2024.\nEach advance under the JPMorgan Chase Credit Facility, as amended, accrues interest at a rate equal to the sum of JPMorgan Chases monthly secured overnight financing rate (SOFR rate) to which JPMorgan Chase is subject with respect to the adjusted SOFR rate as established by the U.S. Federal Reserve Board, plus a margin of 1.25% per annum and an unsecured to secured interest rate adjustment of 0.10% per annum. Prior to the July 31, 2022 amendment, each advance under the JPMorgan Chase Credit Facility would have accrued interest at a rate equal to JPMorgan Chases monthly LIBOR rate multiplied by a statutory reserve rate for eurocurrency funding to which JPMorgan Chase is subject with respect to the adjusted LIBOR rate as established by the U.S. Federal Reserve Board, plus a margin of 1.25% per annum. Interest is calculated monthly on an actual/360-day basis and payable monthly in arrears. Principal outstanding during an event of default, at JPMorgan Chases option, accrues interest at a rate of 3% per annum in excess of the above rate. Any advance may be prepaid in whole or in part without penalty at any time.\nThe JPMorgan Chase Credit Facility is evidenced by a credit agreement, as amended, between JPMorgan Chase and the Company (the JPMorgan Chase Credit Agreement), effective as of June 21, 2023, and customary ancillary documents, in the principal amount not to exceed $5.00 million at any one time outstanding and a line of credit note (the JPMorgan Chase Line of Credit Note) in which the Company promises to pay on or before July 31, 2024, the amount of $5.00 million or so much thereof as may be advanced and outstanding. In the event of default, JPMorgan Chase, at its option, may accelerate the maturity of advances outstanding under the JPMorgan Chase Credit Facility. The JPMorgan Chase Credit Agreement and ancillary documents contain customary covenants, representations, fees, debt, contingent obligations, liens, loans, leases, investments, mergers, acquisitions, divestitures, subsidiaries, affiliate transactions, changes in control, as well as indemnity, expense reimbursement, and confidentiality provisions.\nIn connection with the JPMorgan Chase Credit Facility, effective July 7, 2021, the Company incurred a non-refundable origination fee in the amount of $10,000 that was paid in full to JPMorgan Chase upon execution of the JPMorgan Chase Credit Facility on July 12, 2021. No origination fee was paid to JPMorgan Chase in connection with amending the JPMorgan Chase Credit Facility on July 28, 2022, and June 21, 2023. The Company also agreed to maintain its primary banking depository and disbursement relationship with JPMorgan Chase.\nEvents of default under the JPMorgan Chase Credit Facility include, without limitation, a default, event of default, or event that would constitute a default or event of default (pending giving notice or lapse of time or both), of any provision of the JPMorgan Chase Credit Agreement, the JPMorgan Chase Line of Credit Note, or any other instrument or document executed in connection with the JPMorgan Chase Credit Agreement or with any of the indebtedness, liabilities, and obligations of the Company to JPMorgan Chase or that would result from the extension of credit by JPMorgan Chase to the Company.\nAs of June 30, 2023, the Company had not borrowed against the JPMorgan Chase Credit Facility.\nThe Company had no outstanding debt during the fiscal year ended June 30, 2023.\n12.\nSHAREHOLDERS EQUITY AND STOCK-BASED COMPENSATION\nCommon Stock\nThe Company is authorized to issue 50,000,000 shares of common stock, no par value. As of June 30, 2023 and 2022, it had 30,523,705 and 30,747,759 shares of common stock outstanding, respectively. Holders of the Companys common stock are entitled to one vote for each share held.\nPreferred Stock\nThe Board of Directors is authorized, without further shareholder approval, to issue up to 10,000,000 shares of preferred stock, no par value. The preferred stock may be issued from time to time in one or more series. No shares of preferred stock had been issued as of June 30, 2023.\nRepurchases of Common Stock\nPursuant to authority granted by the Companys Board of Directors on April 29, 2022, the Company can repurchase up to approximately $5.00 million in shares outstanding of the Companys common stock over the three-year period ending April 29, 2025. Pursuant to the terms of the repurchase authorization, the common stock share repurchases are generally at the discretion of the Companys management. As the Company repurchases its common shares, which have no par value, the Company reports such shares held as treasury stock on the accompanying consolidated balance sheets as of June 30, 2023 and 2022, with the purchase price recorded within treasury stock.\nDuring the fiscal years ended June 30, 2023 and 2022, the Company repurchased 358,116 shares and 30,287 shares, respectively, of the Companys common stock for an aggregate price of $451,815 and $38,164, respectively, pursuant to the repurchase authorization.\nDividends\nThe Company paid no cash dividends during the fiscal years ended June 30, 2023 and 2022.\nShelf Registration Statement\nThe Company has an effective shelf registration statement on Form S-3 on file with the U.S. Securities and Exchange Commission (the SEC) which allows it to periodically offer and sell, individually or in any combination, shares of common stock, shares of preferred stock, warrants to purchase shares of common stock or preferred stock, and units consisting of any combination of the foregoing types of securities, up to a total of $25.00 million, of which all is available. However, the Company may offer and sell no more than one-third of its public float (which is the aggregate market value of the Companys outstanding common stock held by non-affiliates) in any 12-month period. The Companys ability to issue equity securities under its effective shelf registration statement is subject to market conditions.\nEquity Compensation Plans\n2018 Equity Incentive Plan\nOn November 21, 2018, the shareholders of the Company approved the adoption of the Charles & Colvard, Ltd. 2018 Equity Incentive Plan, (the 2018 Plan). The 2018 Plan will expire by its terms on September 20, 2028.\nThe 2018 Plan provides for the grant of equity-based awards to selected employees, directors, and consultants of the Company and its affiliates. The aggregate number of shares of the Companys common stock that could be issued pursuant to awards granted under the 2018 Plan are not to exceed the sum of 3,300,000 plus the number of shares of common stock underlying any award granted under any stock incentive plan maintained by the Company prior to the 2018 Plan (each, a 2018 Prior Plan) that expires, terminates or is canceled or forfeited under the terms of the 2018 Prior Plans. Stock options granted to employees under the 2018 Plan generally vest over four years and have terms of up to 10 years. The vesting schedules and terms of stock options granted to independent contractors vary depending on the specific grant, but the terms are no longer than 10 years. Stock option awards granted to members of the Board of Directors generally vest at the end of one year from the date of the grant. The vesting schedules of restricted stock awards granted to employees or independent contractors vary depending on the specific grant but are generally four years or less. Only stock options and restricted stock have been granted under the 2018 Plan. As of June 30, 2023 and 2022, there were 1,261,331 and 1,101,211 stock options outstanding under the 2018 Plan, respectively.\n2008 Stock Incentive Plan\nIn May 2008, the shareholders of the Company approved the adoption of the Charles & Colvard, Ltd. 2008 Stock Incentive Plan, as amended on March 31, 2015 and approved by the shareholders of the Company on May 20, 2015 and further amended on March 15, 2016 and approved by the shareholders of the Company on May 18, 2016 (the 2008 Plan). The 2008 Plan expired (with respect to future grants) on May 26, 2018.\nThe 2008 Plan authorized the Company to grant stock options, stock appreciation rights, restricted stock, and other equity awards to selected employees, directors, and independent contractors. The aggregate number of shares of the Companys common stock that could be issued pursuant to awards granted under the 2008 Plan were not to exceed the sum of 6,000,000 plus any shares of common stock subject to an award granted under any stock incentive plan maintained by the Company prior to the 2008 Plan (each, a 2008 Prior Plan) that is forfeited, cancelled, terminated, expires, or lapses for any reason without the issuance of shares pursuant to the award, or shares subject to an award granted under a 2008 Prior Plan which shares are forfeited to, or repurchased or reacquired by, the Company. Stock options granted to employees under the 2008 Plan generally vest over four years and have terms of up to 10 years. The vesting schedules and terms of stock options granted to independent contractors vary depending on the specific grant, but the terms are no longer than 10 years. Stock option awards granted to members of the Board of Directors generally vest at the end of one year from the date of the grant. The vesting schedules of restricted stock awards granted to employees or independent contractors vary depending on the specific grant but are generally four years or less. Only stock options and restricted stock had been granted under the 2008 Plan. As of June 30, 2023 and 2022, there were 556,334 and 557,592 stock options outstanding under the 2008 Plan, respectively.\nStock-Based Compensation\nThe following table summarizes the components of the Companys stock-based compensation included in net income for the periods presented:\nYear Ended June 30,\nEmployee stock options\n$\n225,694\n$\n243,576\nRestricted stock awards\n23,734\n530,765\nTotal\n$\n249,428\n$\n774,341\nNo stock-based compensation was capitalized as a cost of inventory during the fiscal years ended June 30, 2023 and 2022.\nStock Options\nThe following is a summary of the stock option activity for the fiscal years ended June 30, 2023 and 2022:\nShares\nWeighted\nAverage\nExercise Price\nOutstanding at June 30, 2021\n2,235,286\n$\n1.24\nGranted\n289,793\n$\n2.47\nExercised\n(622,226 )\n$ 1.15\nForfeited\n(24,753\n)\n$\n1.04\nExpired\n(219,297\n)\n$\n2.57\nOutstanding at June 30, 2022\n1,658,803\n$\n1.32\nGranted\n270,787\n$\n1.02\nForfeited\n(65,765\n)\n$\n1.99\nExpired\n(46,160\n)\n$\n1.76\nOutstanding at June 30, 2023\n1,817,665\n$\n1.24\nThe weighted average grant date fair value of stock options granted during the fiscal years ended June 30, 2023 and 2022 was $0.59 and $1.27, respectively. The total fair value of stock options that vested during the fiscal years ended June 30, 2023 and 2022 was approximately $229,000 and $222,000, respectively.\nThe fair value of each stock option is estimated on the date of grant using the Black-Scholes-Merton option pricing model with the following weighted average assumptions for stock options granted during the periods presented:\nYear Ended June 30,\nDividend yield\n0.0\n%\n0.0\n%\nExpected volatility\n61.0\n%\n61.6\n%\nRisk-free interest rate\n3.75\n%\n1.46\n%\nExpected lives (years)\n5.4\n4.5\nThe following tables summarize information in connection with stock options outstanding at June 30, 2023:\nOptions Outstanding\nOptions Exercisable\nOptions Vested or Expected to Vest\nBalance\nas of\nJune 30, 2023\nWeighted\nAverage\nRemaining\nContractual Life\n(Years)\nWeighted\nAverage\nExercise\nPrice\nBalance\nas of\nJune 30, 2023\nWeighted\nAverage\nRemaining\nContractual Life\n(Years)\nWeighted\nAverage\nExercise\nPrice\nBalance\nas of\nJune 30, 2023\nWeighted\nAverage\nRemaining\nContractual Life\n(Years)\nWeighted\nAverage\nExercise\nPrice\n1,817,665\n6.27\n$\n1.24\n1,405,916\n5.50\n$\n1.22\n1,789,617\n6.23\n$\n1.23\nAs of June 30, 2023, the unrecognized stock-based compensation expense related to unvested stock options was approximately $171,000, which is expected to be recognized over a weighted average period of approximately 15 months.\nThe aggregate intrinsic value of stock options outstanding and vested or expected to vest at June 30, 2023 and 2022 was approximately $127,000 and $410,000, respectively. These amounts are before applicable income taxes and represent the closing market price of the Companys common stock at June 30, 2023 and 2022, respectively, less the grant price, multiplied by the number of stock options that had a grant price that is less than the closing market price. These amounts represent the amounts that would have been received by the optionees had these stock options been exercised on those dates. The aggregate intrinsic value of stock options exercised during the fiscal year ended June 30, 2022 was approximately $886,000. During the fiscal year ended June 30, 2022, the total estimated tax benefit associated with certain stock options that were exercised during each period was approximately $89,000. There were no stock options exercised during the fiscal year ended June 30, 2023.\nRestricted Stock\nThe following is a summary of the restricted stock activity for the fiscal years ended June 30, 2023 and 2022:\nShares\nWeighted\nAverage\nGrant Date\nFair Value\nUnvested at June 30, 2021\n178,750\n$\n0.72\nGranted\n242,725\n$\n2.75\nVested\n(242,725\n)\n$\n1.25\nUnvested at June 30, 2022\n178,750\n$\n2.75\nGranted\n178,750\n$\n0.97\nVested\n(134,063\n)\n$\n2.75\nCancelled\n(44,687 )\n$\n2.75\nUnvested at June 30, 2023\n178,750\n$\n0.97\nThe unvested restricted shares as of June 30, 2023 are all performance-based restricted shares and were scheduled to vest, subject to achievement of the underlying performance goals, in July 2023. None of the restricted shares are expected to vest; therefore, no stock-based compensation expense was recorded on these shares during the year ended June 30, 2023. As of June 30, 2023, the estimated unrecognized stock-based compensation expense related to unvested restricted shares subject to achievement of performance goals was approximately $173,000, none of which is expected to be recognized. The performance-based restricted shares expired, as the performance conditions were not met.\n13.\nINCOME TAXES\nThe Company accounts for income taxes under the asset and liability method. Under the asset and liability method, deferred income taxes are recognized for the income tax consequences of temporary differences by applying enacted statutory income tax rates applicable to future years to differences between the financial statement carrying amounts and the income tax bases of existing assets and liabilities.\nThe Companys income tax net expense for the periods presented comprises the following:\nYear Ended June 30,\nCurrent:\nFederal\n$\n-\n$\n-\nState\n(50,132\n)\n(19,606\n)\nTotal current (expense) benefit\n(50,132\n)\n(19,606\n)\nDeferred:\nFederal\n(5,568,311\n)\n(493,910\n)\nState\n(283,593\n)\n(5,016\n)\nTotal deferred (expense) benefit\n(5,851,904\n)\n(498,926\n)\nIncome tax net (expense) benefit\n$\n(5,902,036\n)\n$\n(518,532\n)\nSignificant components of the Companys noncurrent deferred tax assets, net, as of the dates presented are as follows:\nJune 30,\nDeferred tax assets:\nReversals and accruals\n$\n183,907\n$\n487,333\nFederal net operating loss (NOL) carryforwards\n5,198,460\n3,471,594\nState NOL carryforwards\n743,287\n532,300\nHong Kong NOL carryforwards\n995,566\n995,566\nSection 263A adjustment\n120,078\n118,916\nStock-based compensation\n107,842\n155,139\nInventory valuation & obsolescence reserve\n3,465,024\n1,631,339\nOperating lease liabilities\n703,254\n850,910\nNoncurrent deferred tax assets\n11,517,418\n8,243,097\nValuation allowance\n(10,562,696\n)\n(1,442,213\n)\nNoncurrent deferred tax assets, net\n954,722\n6,800,884\nDeferred tax liabilities:\nPrepaid expenses\n(15,770\n)\n(52,792\n)\nDepreciation\n(414,555\n)\n(255,734\n)\nOperating lease right-of-use assets\n(524,397\n)\n(640,454\n)\nNoncurrent deferred tax liabilities\n(954,722\n)\n(948,980\n)\nTotal noncurrent deferred tax assets, net\n$\n-\n$\n5,851,904\nThe following are reconciliations between expected income taxes, computed at the applicable statutory federal income tax rate applied to pretax accounting income, and the income tax net expense for the periods presented:\nYear Ended June 30,\nAnticipated income tax benefit (expense) at the statutory rate\n$\n2,872,539\n$\n(607,414\n)\nState income tax benefit (expense), net of federal tax effect\n430,355\n(36,928\n)\nIncome tax effect of uncertain tax positions\n-\n7,804\nReturn to provision adjustments\n-\nStock-based compensation\n(67,627\n)\n131,898\nOther changes in deferred income tax assets, net\n(16,820\n)\n(24,380\n)\n(Increase) Decrease in valuation allowance\n(9,120,483\n)\n10,083\nIncome tax net (expense) benefit\n$\n(5,902,036\n)\n$\n(518,532\n)\nThe Companys statutory tax rate as of June 30, 2023 is 22.94% and consisted of the federal income tax rate of 21.00% and a blended state income tax rate of 1.94%, net of the federal benefit. The Companys statutory tax rate as of the fiscal year ended June 30, 2022 was 22.45% and consisted of the federal income tax rate of 21.00% and a blended state income tax rate of 1.45%, net of the federal benefit. The Companys effective income tax rate reflects the effect of federal and state income taxes on earnings and the impact of differences in book and tax accounting arising primarily from the permanent tax benefits associated with stock-based compensation transactions during the accounting period then ended. Driven by the establishment of the valuation allowance during the year ended June 30, 2023, the Companys effective tax rate for the fiscal year ended June 30, 2023 was a negative 43.15%. For the fiscal year ended June 30, 2022, the Companys effective income tax rate was 17.93%.\nAs of each reporting date, management considers new evidence, both positive and negative, that could impact the Companys view with regard to future realization of deferred tax assets. During the three months ended March 31, 2023, management determined that due to the worsening global macro-economic conditions and heightened levels of inflation, including fears of recession, coupled with the effects from worldwide political unrest and the ongoing economic impact from the COVID pandemic, the risks associated with these conditions led management to conclude that it was not more likely than not the Company would have sufficient future taxable income to utilize its deferred tax assets. Additionally, the Companys management determined that the positive evidence was no longer sufficient to offset available negative evidence, primarily as a result of the pre-tax operating losses incurred during the three- and nine-month periods ended March 31, 2023. Consequently, management established a full valuation allowance against the Companys deferred tax assets. As of June 30, 2023, the Companys management determined that sufficient negative evidence continued to exist to conclude it was uncertain that the Company would have sufficient future taxable income to utilize its deferred tax assets, and therefore, the Company maintained a full valuation allowance against its deferred tax assets.\nConversely, as of June 30, 2022, the Companys management determined at that time its expectations of future taxable income in upcoming tax years, including estimated growth rates applied to future expected taxable income that included significant management estimates and assumptions, would continue to be sufficient to result in full utilization of the Companys remaining federal net operating loss carryforwards and certain of the deferred tax assets prior to any statutory expiration. As a result, the Companys management determined that sufficient positive evidence existed as of June 30, 2022, to conclude that it was more likely than not deferred tax assets of approximately $5.85 million remained realizable. However, the Companys management further determined that sufficient negative evidence continued to exist to conclude it was uncertain that the Company would have sufficient future taxable income to utilize certain of its deferred tax assets. Therefore, the Company continued to maintain a valuation allowance against the deferred tax assets relating to certain state net operating loss carryforwards from the Companys e-commerce subsidiary due to the timing uncertainty of when it would generate positive taxable income to utilize the associated deferred tax assets. In addition, a valuation allowance remained against certain deferred tax assets relating to operating loss carryforwards relating to the Companys dormant subsidiary located in Hong Kong.\nAs of June 30, 2023 and 2022, the Company had federal tax net operating loss carryforwards of approximately $24.76 million and $16.53 million, respectively, expiring between 2034 and 2037, or that have no expiration, which can be used to offset against future federal taxable income; North Carolina tax net operating loss carryforwards of approximately $20.01 million and $19.77 million, respectively, expiring between 2023 and 2035; and various other state tax net operating loss carryforwards expiring between 2027 and 2040, which can be used to offset against future state taxable income.\nAs of each of June 30, 2023 and 2022, there was approximately $6.03 million in net operating loss carryforwards in Hong Kong. In accordance with the Hong Kong tax code, these amounts can be carried forward indefinitely to offset future taxable income in Hong Kong. The Companys deferred tax assets in Hong Kong were fully reserved with a valuation allowance of $996,000 as of each of June 30, 2023 and 2022, and had been fully reserved in all prior fiscal periods due to the uncertainty of future taxable income in this jurisdiction to utilize the deferred tax assets. Charles & Colvard (HK) Ltd., the Companys Hong Kong subsidiary, was entered into dormancy as of September 30, 2020, following its re-activation in December 2017. Charles & Colvard (HK) Ltd. previously became dormant in the second quarter of 2009 and has had no operating activity since 2008. If the Company uses any portion of its deferred tax assets in future periods, the valuation allowance would need to be reversed and may impact the Companys future operating results.\n14.\nMAJOR CUSTOMERS AND CONCENTRATION OF CREDIT RISK\nAt times, a portion of the Companys accounts receivable will be due from customers that have individual balances of 10% or more of the Companys total gross accounts receivable.\nThe following is a summary of customers that represent 10% or more of total gross accounts receivable as of the dates presented:\nJune 30,\nCustomer A\n%\n*\n%\nCustomer B\n%\n*\n%\nCustomer C\n%\n*\n%\nCustomer D\n** %\n%\nCustomer E\n** %\n%\nCustomer F\n** %\n%\n*\nCustomers A, B, and C did not have individual balances that represented 10% or more of total gross accounts receivable as of June 30, 2022.\n**\nCustomers D, E, and F did not have individual balances that represented 10% or more of total gross accounts receivable as of June 30, 2023.\nA significant portion of sales is derived from certain customer relationships. The following is a summary of customers that represent greater than or equal to 10% of total net sales for the periods presented:\nYear Ended June 30,\nCustomer E\n%\n%\nThe customer above is included in the Companys Traditional segment. The Company records its sales returns allowance at the corporate level based on several factors including historical sales return activity and specific allowances for known customer returns.\n15.\nEMPLOYEE BENEFIT PLAN\nAll full-time employees who meet certain length of service requirements are eligible to participate in and receive benefits from the Companys 401(k) Plan. This plan provides for matching contributions by the Company in such amounts as the Board of Directors may annually determine, as well as a 401(k) option under which eligible participants may defer a portion of their salaries. The Company contributed a total of approximately $171,000 and $76,000\nto its employee benefit defined contribution plan during the fiscal years ended June 30, 2023 and 2022, respectively. Item 9.\nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A.\nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures as of June 30, 2023. The term disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended, or Exchange Act, means controls and other procedures of a company that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the companys management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate, to allow timely decisions regarding required disclosure. Management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, as ours are designed to do, and management necessarily applies its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Based on such evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of June 30, 2023, our disclosure controls and procedures were effective at the reasonable assurance level.\nChanges in Internal Control over Financial Reporting\nWe routinely review our internal control over financial reporting and from time to time make changes intended to enhance the effectiveness of our internal control over financial reporting. During the three months ended June 30, 2023, we made no changes to our internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act, that we believe materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Our internal control system was designed to provide reasonable assurance to our management and Board of Directors regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nOur internal control over financial reporting includes those policies and procedures that:\n(i)\npertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n(ii)\nprovide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n(iii)\nprovide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on the financial statements.\nAll internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to the reliability of financial reporting and the preparation of financial statements.\nIn making the assessment of internal control over financial reporting, our management used the criteria issued by the Committee of Sponsoring Organizations of the Treadway Commission, or COSO, in Internal Control-Integrated Framework (2013). Based on that assessment and those criteria, management determined that our internal control over financial reporting was effective as of June 30, 2023. Item 9B.\nOther Information\nNone.\nItem 9C.\nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10.\nDirectors, Executive Officers and Corporate Governance Item 11.\nExecutive Compensation Item 12.\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters Item 13.\nCertain Relationships and Related Transactions, and Director Independence Item 14.\nPrincipal Accounting Fees and Services\nThe information called for in Items 10 through 14 is incorporated by reference from our definitive Proxy Statement relating to our 2023 Annual Meeting of Shareholders, which will be filed with the SEC within 120 days after the end of the fiscal year ended June 30, 2023.\nPART IV Item 15.\nExhibits, Financial Statement Schedules\n(a)(1) and (2). The consolidated financial statements and report of our independent registered public accounting firm are filed as part of this report (see Index to Financial Statements, at Part II, Item 8). The financial statement schedules are not included in this Item as they are either not applicable or the information is otherwise included in the consolidated financial statements or the notes to the consolidated financial statements.\n(a)(3). The following exhibits have been or are being filed herewith and are numbered in accordance with Item 601 of Regulation S-K:\nExhibit No.\nDescription\n3.1\nRestated Articles of Incorporation of Charles & Colvard, Ltd. (incorporated herein by reference to Exhibit 3.1 to our Annual Report on Form 10-K for the year ended December 31, 2004)\n3.2\nBylaws of Charles & Colvard, Ltd., as amended and restated, effective May 19, 2011 (incorporated herein by reference to Exhibit 3.1 to our Current Report on Form 8-K, as filed with the SEC on May 24, 2011)\n4.1\nSpecimen Certificate of Common Stock (incorporated herein by reference to Exhibit 4.1 to our Annual Report on Form 10-K for the year ended December 31, 1998)\n4.2\nDescription of Common Stock (incorporated herein by reference to Exhibit 4.2 to our Annual Report on Form 10-K for the year ended June 30, 2021)\n10.1\nExclusive Supply Agreement, dated as of December 12, 2014, by and among Charles & Colvard, Ltd., Cree, Inc. and, solely for purposes of Section 6(c) of the Exclusive Supply Agreement, Charles & Colvard Direct, LLC and moissanite.com, LLC (incorporated herein by reference to Exhibit 10.4 to our Quarterly Report on Form 10-Q for the quarter ended December 31, 2020, as filed with the SEC on February 4, 2021)**\n10.2\nFirst Amendment to Exclusive Supply Agreement, dated as of June 22, 2018, by and between Charles & Colvard, Ltd. and Cree, Inc. (incorporated herein by reference to Exhibit 10.1 to our Current Report on Form 8-K, as filed with the SEC on June 27, 2018)*\n10.3\nSecond Amendment to Exclusive Supply Agreement, effective as of June 30, 2020, by and between Charles & Colvard, Ltd. and Cree, Inc. (incorporated herein by reference to Exhibit 10.3 to our Annual Report on Form 10-K for the fiscal year ended June 30, 2020, as filed with the SEC on September 4, 2020)**\n10.4\nCredit Agreement, dated as of July 12, 2021, by and among Charles & Colvard, Ltd., and JPMorgan Chase Bank, N.A. (incorporated herein by reference to Exhibit 10.1 to our Current Report on Form 8-K, as filed with the SEC on July 13, 2021)\n10.5\nFirst Amendment to Credit Agreement, dated as of June 16, 2023 (effective June 21, 2023), by and among Charles & Colvard, Ltd., and JPMorgan Chase Bank, N.A. (incorporated herein by reference to Exhibit 10.2 to our Current Report on Form 8-K, as filed with the SEC on June 27, 2023)\n10.6\nLine of Credit Note, dated as of July 12, 2021, by and among Charles & Colvard, Ltd., and JPMorgan Chase Bank, N.A. (incorporated herein by reference to Exhibit 10.2 to our Current Report on Form 8-K, as filed with the SEC on July 13, 2021)\n10.7\nLine of Credit Note, dated as of July 28, 2022, by and among Charles & Colvard, Ltd., and JPMorgan Chase Bank, N.A. (incorporated herein by reference to Exhibit 10.2 to our Current Report on Form 8-K, as filed with the SEC on August 2, 2022)\n10.8\nNote Modification Agreement, dated as of June 16, 2023 (effective June 21, 2023), by and among Charles & Colvard, Ltd., and JPMorgan Chase Bank, N.A. (incorporated herein by reference to Exhibit 10.4 to our Current Report on Form 8-K, as filed with the SEC on June 27, 2023)\n10.9\nLease Agreement, dated December 9, 2013, between Charles & Colvard, Ltd. and Southport Business Park Limited Partnership (incorporated herein by reference to Exhibit 10.11 to our Annual Report on Form 10-K for fiscal year ended June 30, 2021, as filed with the SEC on September 3, 2021)**\n10.10\nFirst Amendment to Lease, dated December 23, 2013, between Charles & Colvard, Ltd. and Southport Business Park Limited Partnership (incorporated herein by reference to Exhibit 10.20 to our Annual Report on Form 10-K for the year ended December 31, 2013)\n10.11\nSecond Amendment to Lease, dated April 15, 2014, between Charles & Colvard, Ltd. and Southport Business Park Limited Partnership (incorporated herein by reference to Exhibit 10.1 to our Quarterly Report on Form 10-Q for the quarter ended June 30, 2014)\n10.12\nThird Amendment to Lease Agreement, dated January 29, 2021, between Charles & Colvard, Ltd. and SBP Office Owner, L.P., successor to Southport Business Park Limited Partnership (incorporated herein by reference to Exhibit 10.5 to our Quarterly Report on Form 10-Q for the quarter ended December 31, 2020, as filed with the SEC on February 4, 2021)\n10.13+\nBoard Compensation Program, effective October 1, 2017 (incorporated herein by reference to Exhibit 10.1 to our Quarterly Report on Form 10-Q for the quarter ended September 30, 2017)\n10.14+\nCharles & Colvard, Ltd. 2008 Stock Incentive Plan, as amended (incorporated herein by reference to Exhibit 10.1 to our Current Report on Form 8-K, as filed with the SEC on May 20, 2016)\n10.15+\nForm of Employee Incentive Stock Option Agreement under the Charles & Colvard, Ltd. 2008 Stock Incentive Plan (incorporated herein by reference to Exhibit 10.116 to our Current Report on Form 8-K, as filed with the SEC on June 2, 2008)\n10.16+\nForm of Employee Nonqualified Stock Option Agreement under the Charles & Colvard, Ltd. 2008 Stock Incentive Plan (incorporated herein by reference to Exhibit 10.118 to our Current Report on Form 8-K, as filed with the SEC on June 2, 2008)\n10.17+\nCharles & Colvard, Ltd. 2018 Equity Incentive Plan (incorporated herein by reference to Exhibit 10.1 to our Current Report on Form 8-K, as filed with the SEC on November 9, 2018)\n10.18+\nForm of Restricted Stock Award Agreement under the Charles & Colvard, Ltd. 2018 Equity Incentive Plan (incorporated herein by reference to Exhibit 10.2 to our Current Report on Form 8-K, as filed with the SEC on November 9, 2018)\n10.19+\nForm of Employee Incentive Stock Option Agreement under the Charles & Colvard, Ltd. 2018 Equity Incentive Plan (incorporated herein by reference to Exhibit 10.3 to our Current Report on Form 8-K, as filed with the SEC on November 9, 2018)\n10.20+\nForm of Employee Nonqualified Stock Option Agreement under the Charles & Colvard, Ltd. 2018 Equity Incentive Plan (incorporated herein by reference to Exhibit 10.4 to our Current Report on Form 8-K, as filed with the SEC on November 9, 2018)\n10.21+\nForm of Non-Employee Director Nonqualified Stock Option Agreement under the Charles & Colvard, Ltd. 2018 Equity Incentive Plan (incorporated herein by reference to Exhibit 10.5 to our Current Report on Form 8-K, as filed with the SEC on November 9, 2018)\n10.22+\nForm of Independent Contractor Nonqualified Stock Option Agreement under the Charles & Colvard, Ltd. 2018 Equity Incentive Plan (incorporated herein by reference to Exhibit 10.6 to our Current Report on Form 8-K, as filed with the SEC on November 9, 2018)\n10.23+\nCharles & Colvard, Ltd. Fiscal 2021 Senior Management Equity Incentive Program, effective July 1, 2020 (incorporated herein by reference to Exhibit 10.1 to our Current Report on Form 8-K, as filed with the SEC on August 4, 2020)\n10.24+\nCharles & Colvard, Ltd. Fiscal 2022 Senior Management Equity Incentive Program, effective July 1, 2021 (incorporated herein by reference to Exhibit 10.1 to our Current Report on Form 8-K, as filed with the SEC on September 15, 2021)\n10.25+\nCharles & Colvard, Ltd. Fiscal 2023 Senior Management Equity Incentive Program, effective July 1, 2022 (incorporated herein by reference to Exhibit 10.1 to our Current Report on Form 8-K, as filed with the SEC on November 9, 2022)\n10.26+\nEmployment Agreement, dated May 23, 2017, by and between Charles & Colvard, Ltd. and Clint J. Pete (incorporated herein by reference to Exhibit 10.1 to our Current Report on Form 8-K, as filed with the SEC on May 24, 2017)\n10.27+\nEmployment Agreement, dated May 23, 2017, by and between Charles & Colvard, Ltd. and Don OConnell (incorporated herein by reference to Exhibit 10.2 to our Current Report on Form 8-K, as filed with the SEC on May 24, 2017)\n10.28+\nAmendment to 2017 Employment Agreement, dated April 9, 2020, by and between Charles & Colvard, Ltd. and Clint J. Pete (incorporated herein by reference to Exhibit 10.2 to our Current Report on Form 8-K, as filed with the SEC on April 9, 2020)\n10.29+\nAmendment to 2017 Employment Agreement, dated April 9, 2020, by and between Charles & Colvard, Ltd. and Don OConnell (incorporated herein by reference to Exhibit 10.3 to our Current Report on Form 8-K, as filed with the SEC on April 9, 2020)\n10.30+\nAmended and Restated Employment Agreement, effective as of June 1, 2020, by and between Charles & Colvard, Ltd. and Don OConnell (incorporated herein by reference to Exhibit 10.2 to our Current Report on Form 8-K, as filed with the SEC on May 29, 2020)\n21.1++\nSubsidiaries of Charles & Colvard, Ltd.\n23.1++\nConsent of BDO USA, P.C.\n31.1++\nCertification by Chief Executive Officer pursuant to Rule 13a-14(a) under the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2++\nCertification by Chief Financial Officer pursuant to Rule 13a-14(a) under the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1++\nCertification by Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2++\nCertification by Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS++\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH++\nInline XBRL Taxonomy Extension Schema Document\n101.CAL++\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF++\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB++\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE++\nInline XBRL Taxonomy Extension Presentation Linkbase document\n104++\nCover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document contained in Exhibit 101\n*\nAsterisks located within the exhibit denote information which has been redacted pursuant to a request for confidential treatment filed with the SEC.\n**\nAsterisks located within the exhibit denote information which has been redacted pursuant to Item 601(b)(10)(iv) of Regulation S-K because such information is both not material and would likely cause competitive harm to us if publicly disclosed.\n+\nDenotes management contract or compensatory plan or arrangement.\n++\nDenotes filed herewith.\nItem 16.\nForm 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCHARLES & COLVARD, LTD.\nBy:\n/s/ Don OConnell\nOctober 12, 2023\nDon OConnell\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nBy:\n/s/ Don OConnell\nOctober 12, 2023\nDon OConnell\nDirector, President and Chief Executive Officer\nBy:\n/s/ Clint J. Pete\nOctober 12, 2023\nClint J. Pete\nChief Financial Officer (Principal Financial Officer and Chief Accounting Officer)\nBy:\n/s/ Neal I. Goldman\nOctober 12, 2023\nNeal I. Goldman\nChairman of the Board of Directors\nBy:\n/s/ Anne M. Butler\nOctober 12, 2023\nAnne M. Butler\nDirector\nBy:\n/s/ Benedetta I. Casamento\nOctober 12, 2023\nBenedetta I. Casamento\nDirector\nBy:\n/s/ Ollin B. Sykes\nOctober 12, 2023\nOllin B. Sykes\nDirector"
}