{
    "cik": "1021917",
    "company": "Awaysis Capital, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-11-04",
    "period_of_report": "2022-06-30",
    "sic": "6512",
    "state_of_inc": "DE",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1021917/0001493152-22-030675-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1021917/000149315222030675/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1021917/0001493152-22-030675.txt",
    "filename": "1021917_10K_2022_0001493152-22-030675.htm",
    "content": "Item 1. Description of Business Item 1A. Risk Factors Item 1B. Unresolved Staff Comments\nNot Applicable. Item 2. Description of Property.\nOur principal executive office is located at 3400 Lakeview Drive, Suite 100, Miramar, Florida, pursuant to a 62 month lease that commenced at or around September 1, 2022. This facility, consisting of 2,349 square feet, is expected to provide the space and infrastructure necessary to accommodate our present operations, based on our current business plan. The annual rent for the first lease year is approximately $50,000, with future lease years subject to escalation clauses.\nAs of June 30, 2022, we own the Casamora Resort Assets, which are still under development. Item 3. Legal Proceedings.\nFrom time to time, we may become involved in various lawsuits and legal proceedings, which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm business.\nWe are not currently a party in any legal proceeding or governmental regulatory proceeding nor are we currently aware of any pending or potential legal proceeding or governmental regulatory proceeding proposed to be initiated against us that would have a material adverse effect on us or our business. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nThere is no established trading market for our shares of Common Stock. Since May 25, 2022, our Common Stock has been quoted on the OTC Pink Market under the ticker symbol AWCA. There can be no assurance that a trading market will ever develop or, if such a market does develop, that it will continue. Prior to May 25, 2022, our Common Stock was quoted on the OTC Pink Market under the symbol ASZP.\nThe following table shows the high and low bid prices of our Common Stock for the periods indicated. These quotations reflect inter-dealer prices, without retail mark-up, markdown or commissions, and may not represent actual transactions.\nAs of November 2, 2022, there were approximately 152 holders of record of our common stock, and the last reported closing sales price of our common stock on that date was $0.3299.\nQuarter Ended High Low\nJune 30, 2022 $ 0.4499 $ 0.1500\nMarch 31, 2022 0.6400 0.1500\nDecember 31, 2021 $ 0.3900 $ 0.0550\nSeptember 30, 2021 0.2000 0.0010\nJune 30, 2021 0.1387 0.0010\nMarch 31, 2021 $ 0.1500 $ 0.0035\nDecember 31, 2020 0.0500 0.0080\nSeptember 30, 2020 0.2000 0.0050\nDividend Policy\nWe have never declared or paid any cash dividend. We do not anticipate that we will declare or pay any dividends in the foreseeable future. Our current policy is to retain earnings, if any, to fund operations, and the development and growth of our business. Any future determination to pay cash dividends will be at the discretion of our Board and will be dependent upon our financial condition, operation results, capital requirements, applicable contractual restrictions, restrictions in our organizational documents, and any other factors that our Board deems relevant.\nEquity Compensation Plan Information Table\nThe following table provides information about shares of our common stock that may be issued upon the exercise of options under all of our existing compensation plans as of June 30, 2022.\nNumber of\nsecurities to\nbe issued\nupon\nexercise of\noutstanding\noptions,\nwarrants\nand rights Weighted-\naverage\nexercise\nprice of\noutstanding\noptions,\nwarrants\nand rights Number of\nsecurities\nremaining\navailable for\nfuture issuance\nPlan Category\nEquity compensation plans approved by security holders:\n2022 Omnibus Performance Award Plan - - 19,977,931\nEquity compensation plans not approved by security holders: - - -\nTotal\n19,977,931\nUnregistered Sale of Securities\nDuring the past three years, the Company made the following issuances of its unregistered securities, none of which involved any underwriters, underwriting discounts or commissions. Unless otherwise specified below, the Company believes these transactions were exempt from registration under the Securities Act in reliance on the exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933, as amended (the Securities Act) and Rule 506(b) under Regulation D of the Securities Act, as transactions by an issuer not involving any public offering. The recipients of the securities in each of these transactions represented their intentions to acquire the securities for investment purposes only and not with a view to or for sale in connection with any distribution thereof.\nBetween May 26, 2022, and June 30, 2022, the Company sold, in a private offering of up to $25 million of the Companys Common Stock, at a price per share of $1.00 (the Offering), the Company entered into a Subscription Agreement with investors in the Offering for an aggregate of 1,818,000 shares of Common Stock with a total subscription price of $1,818,000. The Company has received a total of $625,000 and still has pending an aggregate of 1,193,000 shares of Common Stock (the Pending Shares) for a total subscription receivable of $1,193,000. The Company expects such proceeds to be funded, and the Pending Shares to be issued, by the end of November 2022.\nAll purchases made in connection with the Offering were pursuant to Subscription Agreements & Investor Suitability Questionnaires as between the Company and each of the investors.\nAs of June 30, 2022, as partial consideration for our acquisition of the Casamora Awaysis Assets, we were obligated to issue to the seller of such assets an aggregate of 56.8 million shares of our common stock based on a per share price equal to the market price on the date of appraisal of $0.150. Such shares have not been issued as of the date hereof, and they are expected to be issued in the second fiscal quarter of 2023. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nForward Looking Statements\nCertain information contained in this MD&A includes forward-looking statements. Statements which are not historical reflect our current expectations and projections about our future results, performance, liquidity, financial condition and results of operations, prospects and opportunities and are based upon information currently available to us and our management and their interpretation of what is believed to be significant factors affecting our existing and proposed business, including many assumptions regarding future events. Actual results, performance, liquidity, financial condition and results of operations, prospects and opportunities could differ materially and perhaps substantially from those expressed in, or implied by, these forward-looking statements as a result of various risks, uncertainties and other factors, including those risks described in detail in the section of this Annual Report on Form 10-K entitled Risk Factors as well as elsewhere in this Annual Report.\nForward-looking statements, which involve assumptions and describe our future plans, strategies, and expectations, are generally identifiable by use of the words may, should, would, will, could, scheduled, expect, anticipate, estimate, believe, intend, seek, or project or the negative of these words or other variations on these words or comparable terminology.\nIn light of these risks and uncertainties, and especially given the nature of our existing and proposed business, there can be no assurance that the forward-looking statements contained in this section and elsewhere in this Annual Report on Form 10-K will in fact occur. Potential investors should not place undue reliance on any forward-looking statements. Except as expressly required by the federal securities laws, there is no undertaking to publicly update or revise any forward-looking statements, whether as a result of new information, future events, changed circumstances or any other reason.\nOverview\nWe are a real estate investment and management company focused on acquisition, construction, selling and managing rentals of residential vacation home communities in desirable travel destinations. We seek to create value through the targeting and acquisition, development, and up-cycling, rebranding, and repositioning of currently undervalued operating and shovel ready residential/resort communities in global travel destinations, with the intention to relaunch these assets under the Awaysis brand with the goals of creating a network of residential and resort enclave communities that will optimize both sales and rental revenues, providing attractive returns to owners and exceptional vacation experiences to travelers. At least initially, our target acquisitions are resorts that have not been completed nor have a prior operational history. As such we intend to purchase the real estate and finish the development, then we would sell the finished units and put them in a rental pool.\nThe Company seeks to own and grow a stable, cash generating, diversified portfolio of single-family and luxury resort/residence properties in the Caribbean, Europe, South America, and the United States.\nOur business strategy entails targeting and identifying undervalued assets in emerging markets located in proximity to high demand travel destinations. The Company intends to focus these efforts on shovel-ready properties and/or other assets that we believe can be used to optimize sales and rental revenues. We have currently identified five properties in the country of Belize, all of which are expected to constitute our initial real estate portfolio. To that effect, on June 30, 2022, we closed on the acquisition of certain real estate assets in San Pedro, Belize (the Casamora Awaysis Assets), pursuant to our previously announced series of Agreements of Purchase and Sale, all dated April 15, 2022. The total consideration paid by us for the properties subject to the agreements was at the appraisal value of $11.4 million (excluding transaction costs and fees) and was settled in a combination of a Purchase Money Mortgage of $2.6 million at 0% interest rate, payable on demand, a Purchase Money Mortgage of $280,000 at 0% interest rate that was paid on August 8, 2022 and 56.8 million shares of the Companys common stock based on a per share price equal to the market price on the date of appraisal of $0.150. As the first acquisition by the Company in Belize and an important milestone, the Company expects to rebrand the Casamora Awaysis Asset, so it is easily identifiable as an Awaysis Property and fit perfectly with its strategy of creating a countrywide network of Awaysis residential enclave communities in the country for owners and guests to travel, work and play.\nCost of Revenues\nThe company had no revenues as of June 30, 2022, and no cost of revenues.\nSales and Marketing Expenses\nOur sales and marketing expenses consist primarily of salaries, commissions and other personnel-related expenses, which may include share-based compensation, for employees engaged in sales, marketing and support of our products and services, promotional and public relations expenses and management and administration expenses in support of sales and marketing.\nGeneral and Administrative Expenses\nOur general and administrative costs include payroll, employee benefits, and other personnel-related costs, which include share-based compensation, associated with administrative and support staff, as well as legal and accounting costs, insurance costs, and other administrative fees.\nResults of Operations - Fiscal Years Ended June 30, 2022 and June 30, 2021\nWe had no significant activity during our fiscal year ended June 30, 2021. We commenced activities and started to incur material costs in the fiscal year ended June 30, 2022 as a result of our change in control transaction in November 2021 and commencement in February 2022 of our business strategy of acquiring, developing, and managing residential vacation home communities in desirable travel destinations.\nWe have incurred recurring losses to date. Our financial statements have been prepared assuming that we will continue as a going concern and, accordingly, do not include adjustments relating to the recoverability and realization of assets and classification of liabilities that might be necessary should we be unable to continue in operation.\nWe expect we will require additional capital to meet our long-term operating requirements. We expect to raise additional capital through, among other things, the sale of equity or debt securities.\nRevenues\nWe recognized no revenue during the years ended June 30, 2022, and 2021, as we had no revenue generating activities during these periods.\nSales and Marketing Expenses\nDuring the years ended June 30, 2022, and 2021, we incurred sales and marketing expenses of $49,269 and $0, consisting of marketing and support of our products and services, promotional and public relations expenses and management and administration expenses in support of sales and marketing.\nGeneral and Administrative Expenses\nDuring the years ended June 30, 2022, and 2021, we incurred general and administrative expenses of $190,582 and $12,023, consisting of audit and accounting fees, travel and entertainment, payroll and employee benefits, legal fees, filing fees and transfer agent fees, all relating to both sustaining the corporate existence of the Company and public company-related expenses and transitioning from being a shell company to an operating company under its new management.\nOperating Loss\nDuring the years ended June 30, 2022, and 2021, we recognized operating losses of $(239,851) and $(12,023), respectively. These losses were primarily attributable to the Company transitioning from being a shell company to an operating company under its new management and brand.\nOther Income (Expenses)\nDuring the years ended June 30, 2022, and 2021, we incurred interest expenses of $0 and $2,488, respectively.\nNet Loss\nDuring the years ended June 30, 2022, and 2021 we recognized net losses of $(239,851) and $(14,511), respectively. These losses were primarily attributable to accounting, marketing, legal, filing fees and transfer agent fees to sustaining the corporate existence of the Company and public company related expenses, and transitioning from being a shell company to an operating company under its new management and brand.\nLiquidity and Capital Resources\nAs of June 30, 2022, we had cash of $481,965 and had a positive working capital of $8,959,498, of which was mainly from the issuance of shares for real estate inventory and sale of shares from private placement. We have sufficient cash or commitments for funding to satisfy our basic operations for at least 12 months, and expect the anticipated cost of development of our first properties to come from pre-sales and not cash-on-hand. We will need to raise additional cash to satisfy our long-term requirements.\nPresently, our principal shareholder has indicated its intention to provide such funds as may be required for the Company to become, and remain, a fully reporting public company while seeking to create value for shareholders by pursuing our business plan to reinvent the Company as a real estate investment and management company. Such intentions do not represent a binding commitment by the principal shareholder and there is no guarantee that our principal shareholder will be able to provide the funding necessary to achieve this objective.\nIf we are unable to obtain the necessary funding from our principal shareholder, we anticipate facing major challenges in raising the necessary funding to affect our business plan. Raising debt or equity funding for small publicly quoted, penny stock companies is extremely challenging. We can provide no assurance that financing will be available in the amounts it needs or on terms acceptable to it, if at all. If we are not able to secure adequate additional working capital when it becomes needed, it may be required to make reductions in spending, extend payment terms with suppliers, liquidate assets where possible and/or suspend or curtail planned acquisitions and developments. Any of these actions could materially harm our planned business.\nOur plan for satisfying our cash requirements and to remain operational beyond the next 12 months or to further expand our asset base is through the sale of shares of our capital stock to third parties. While we intend in the short term to seek to raise up to $25 million through the sale of our common stock, we cannot assure you we will be successful in raising any or all of such capital and in meeting our working capital needs. Through June 30, 2022, we have raised an aggregate of $1,818,000 in such private placement and can give no assurance that we will be successful in raising the remaining funds being sought. The capital raises from issuances of equity securities could result in additional dilution to our shareholders. In addition, to the extent we determine to incur indebtedness, our incurrence of debt could result in debt service obligations and operating and financing covenants that would restrict our operations.\nCash Flows from Operating Activities\nWe have not generated positive cash flows from operating activities for the years ended June 30, 2022, or 2021. Net cash flows used in operating activities were $(200,381) and $(5,923) for the years ended June 30, 2022, and 2021, respectively.\nCash Flows from Investing Activities\nDuring the years ended June 30, 2022, and 2021, net cash flow used for investing activities was $22,145 and $0, respectively.\nCash Flows from Financing Activities\nIn 2021, we financed our operations primarily by way of advances from notes payable from a former director and former majority shareholder, and in 2022 through June 30, 2022, we have financed our operations by way of advances from our current majority shareholder, issuance of shares and debt for real estate inventory, and cash raised from the private placement offering. The Company offered up to $25 million worth of restricted shares of common stock to a limited number of accredited investors, at a price per share of $1.00.\nFor the years ended June 30, 2022, and 2021, net cash from financing activities was $704,491 and $5,923, respectively.\nWe are dependent upon the receipt of capital investment or other financing to fund our ongoing operations and to execute our business plan to become a real estate investment and management company. In addition, we are dependent upon our controlling shareholder to provide continued funding and capital resources. If continued funding and capital resources are unavailable at reasonable terms, we may not be able to implement our plan of operations.\nCritical Accounting Policies\nThe company applies judgment and estimates that may have material effect in the eventual outcome of assets, liabilities, revenues and expenses, accounts receivable, inventory and goodwill. The following explains the basis and the procedure where judgment and estimates are applied.\nInventories\nNew real estate inventory is carried at the lower of cost or net realizable value. The cost of finished inventories determined on the specific identification method is removed from inventories and recorded as a component of cost of sales at the time revenue is recognized. In addition, an allocation of depreciation and amortization is included in cost of goods sold. Under the specific identification method, if finished real estate inventory can be sold for a profit there is no basis to write down the inventory below the lower of cost or net realizable value.\nGoing Concern\nOur financial statements are prepared using accounting principles generally accepted in the United States of America (GAAP) applicable to a going concern, which contemplates the realization of assets and the liquidation of liabilities in the normal course of business. As reflected in the financial statements, we had an accumulated deficit at June 30, 2022 and 2021, a net loss and net cash used in operating activities for the reporting periods then ended. As of year, ended June 30, 2022, and 2021, we had cash in the amount of $481,965 and -0-, respectively. As of June 30, 2022 and 2021, we had executed subscription pending funding in the amount of $1,193,000 and -0-, respectively.\nThe Company is commencing operations and seeking to generate sufficient revenue and have received sufficient subscriptions and funding to support its current basic operations for at least the next 12 months; however, the Companys cash position may not be sufficient to support the Companys long-term strategy. While the Company believes in the viability of its strategy to commence operations and generate sufficient revenue to further develop its first properties through presales, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Companys ability to further implement its business plan, generate sufficient revenue through presales or otherwise, and its ability to raise additional funds by way of private offering or debt. The financial statements do not include any adjustments related to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot required. Item 8. Financial Statements and Supplementary Data.\nThe consolidated financial statements and supplementary data required by this item are included in this Annual Report on Form 10-K immediately following Part IV and are incorporated herein by reference. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nThe Company needs to implement disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934 (the Exchange Act), that are designed to ensure that information required to be disclosed in the Companys Exchange Act reports are recorded, processed, summarized, and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission, and that such information is accumulated and communicated to our Chief Executive Officer and Chief Financial Officer to allow timely decisions regarding required disclosure.\nAs of June 30, 2022, the Chief Executive Officer and Chief Financial Officer carried out an assessment, of the effectiveness of the design and operation of our then existing disclosure controls and procedures pursuant to Exchange Act Rules 13a-15(b) and 15d-15(b). As of the date of this assessment, the Chief Executive Officer and Chief Financial Officer concluded that the Companys disclosure controls and procedures were not effective as of June 30, 2022 to provide reasonable assurance that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosures. Management came to this result due to the Company failing to timely file a Current Report on Form 8-K to announce the acquisition of the Casamora Awaysis Assets.\nAlthough we have begun to rectify these weaknesses by the hiring of Amir Vasquez as our new CFO, our remediation of these deficiencies is still ongoing.\nManagements Annual Report on Internal Control Over Financial Reporting.\nOur management is responsible for establishing and maintaining effective internal control over financial reporting (as defined in Rule 13a - 15(f) of the Exchange Act). There are inherent limitations to the effectiveness of any internal control, including the possibility of human error and the circumvention or overriding of controls. Accordingly, even effective internal controls can provide only reasonable assurance with respect to financial statement preparation. Further, because of changes in conditions, the effectiveness of internal control may vary over time. We have assessed the effectiveness of our internal controls over financial reporting (as defined in Rule 13a -15(f) of the Exchange Act) as of June 30, 2022, and have concluded that, as of June 30, 2022, our internal control over financial reporting was effective.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to the rules of the Securities and Exchange Commission that permit us to provide only managements report in this annual report.\nChanges in Internal Control Over Financial Reporting.\nThere were no changes in our internal control over financial reporting, identified in connection with the evaluation of such internal control that occurred during our last fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNone.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nBoard of Directors\nWe currently have six directors serving on our Board. The following table lists the names, ages and positions of the individuals who serve as directors of the Company, as of June 30, 2022:\nName\nAge\nTitles\nMichael Singh\nChairman, Chief Executive Officer and Director\nDr. Andrew E. Trumbach\nDirector and President\nLisa-Marie Iannitelli\nExecutive Vice President, Investor Relations, and Director\nDr. Claude Stuart\nDirector\nDr. Narendra Kini\nDirector\nTyler Trumbach\nChief Legal Counsel and Director\nMichael Singh, Chairman, Chief Executive Officer and Director. Mr. Singh has been the Companys Chief Executive Officer and a member of the Companys Board of Directors since November 23, 2021. Mr. Singh is the founder and CEO of BTALCO Limited for over 20 years, and which is a leading logistics provider in Belize. Mr. Singh is also the managing partner for Island Club Resorts Ltd since June 2002 and has successfully developed, operated and sold the Belize Yacht Club, a major condominium development in San Pedro, Ambergris Caye, which consists of approximately 80 luxury units. Mr. Singh is also, since February 2016, the founder and Managing Partner of Century 21 Belize, a leading provider of real estate sales services in Belize. Mr. Singh holds a degree in Finance and International Business from Loyola University in New Orleans. At various times, he has served in the capacity of CEO for the Ministry of Tourism, Civil Aviation and Culture, and CEO of the Ministry of Trade and Investments, in Belize. Mr. Singh has extensive experience in a variety of successful Belize-based ventures.\nMr. Singh is an Executive Director of Harthorne Capital, Inc.\nThe Company believes that Mr. Singh is qualified to serve as a member of the Board of Directors due to his extensive business experience.\nDr. Andrew E. Trumbach, Director. Dr. Trumbach has been a member of the Companys Board of Directors and President since November 23, 2021. Dr. Trumbach previously served as the Chief Financial Officer of the Company until his resignation on August 15, 2022. Since 1992, Dr. Trumbach has been a consultant providing tax, accounting and financial analysis services and accounting information systems solutions to middle market companies and family-owned businesses. From 2008 to 2014, Dr. Trumbach was a part-time Professor at Nova Southeastern University, H. Wayne Huizenga School of Business and Entrepreneurship, where he taught classes on accounting, financial management , cost accounting, and accounting information systems. He has been the part-time Chief Financial Officer of Omnia Wellness Inc. (OTCQB:OMWS) since March 2021. He was the EVP/CFO of a holding company from 2008 to 2019 that owned and operated one of the largest perfume distribution businesses operating worldwide. The company acquired and managed affiliated companies that included over 45 retail stores and a duty-free company operating airline, cruise, and retail duty free and duty paid concessions located in cruise, airport, and border locations worldwide. Prior to 2008, Dr. Trumbach spent 14 years as the CFO/CIO and Sr VP of a family-owned holding and investment company that included a portfolio that consisted of commercial, industrial, and residential real estate holdings, mining operations, outdoor advertising, publishing, polling, water and sewer utility, mobile home parks, data centers, and funeral homes. Prior to moving to industry, Dr. Trumbach spent three years working in an international accounting firm and five years in a regional firm working in public accounting in both the Caribbean and the United States. Dr. Trumbach is currently the owner of Writeup Express, Inc. and Ajuni Properties Inc. In addition to a Bachelor of Science degree in Accounting and a Master of Business Administration degree, Dr. Trumbach has earned Doctorate degrees in both Information Technology Management and Accounting. He has undertaken numerous consulting projects for major companies in the United States and the Caribbean.\nDr. Trumbach is the President, CFO and an Executive Director of Harthorne Capital, Inc.\nThe Company believes that Dr. Trumbach is qualified to serve as a member of the Board of Directors due to his extensive business and financial experience, including acting as executive officers and directors of other public companies.\nLisa Marie Iannitelli, Executive Vice President, Investor Relations and Director. Ms. Iannitelli has been the Companys Executive Vice President, Investor Relations and a member of the Companys Board of Directors since November 23, 2021. Ms. Iannitelli has been the CEO and President of Wentworth Capital Markets Inc. since January 2017. Prior to that, from October 2010 to December 2018, Ms. Iannitelli was Director of Investor Relations & Business Development at The Delavaco Group. From March 2005 to August 2010, she was a Compliance Officer and then was an Investment Associate, at BMO Nesbitt Burns Inc. Ms. Iannitelli is an executive director of Harthorne Capital, Inc.\nThe Company believes that Ms. Iannitelli is qualified to serve as a member of the Board of Directors due to her extensive investor relations experience and experience assisting real estate companies to go public.\nDr. Claude Stuart, Director. Dr. Stuart has been a member of the Companys Board of Directors since February 17, 2022. Dr. Stuart is an Adjunct Assistant Professor of Mathematics at Farmingdale State College of the State University of New York, and an instructor for the New York City Department of Education for more than the past five years. He earned a Bachelor of Science in Economics from Rider University, a Juris Doctorate from Seton Hall University School of Law, a Master of Science in Mathematics from St. Johns University, and a Doctorate in Education Administration from Dowling College, New York. He is an attorney and is admitted to practice law in the New Jersey Supreme Court and Federal Court. He is also a trustee of the New York Annual Conference of the United Methodist Church, a not-for-profit organization, a member of the Council of Finance and Administration, and a member of the Audit Committee and the Board of Camping and Retreat Ministries. He is the Vice-President and Treasurer of Friends Supporting the Anglican Diocese of Belize Inc., a not-for-profit organization registered in the State of New York. He is also the Northeast-Regional Director of Benjamin Banneker Association, an affiliate of The National Council of Teachers in Mathematics and a member of several research and professional organizations.\nThe Company believes that Dr. Stuart is qualified to serve as a member of the Board of Directors due to his experience as an attorney and his education.\nDr. Narendra M. Kini, Director. Dr. Kini has been a member of the Companys Board of Directors since February 17, 2022. Dr. Kini has more than 25 years experience as a Chief Executive Officer, Chief Medical Officer, and an ER and Trauma doctor. Dr. Kini most recently served as the Chief Medical Officer of the State of Florida COVID-19 Infectious Disease Field Hospital System where he oversaw all clinical personnel for the 9-hospital system. In that role, Dr. Kini provided training and in-servicing, ran drills with clinical staff, ensured quality patient care, and provided guidance regarding necessary equipment and supplies to treat COVID-19 patients. Prior to that, from January 2008 until June 2019, Dr. Kini served as the Chief Executive Officer for Nicklaus Childrens Hospital (f/k/a Miami Childrens Hospital), providing management to the 26 facilities in the system and a 309-bed hospital with 3,000 employees and 700 plus physicians. He also provided ancillary and clinical operations leadership as the Chief Medical Officer for Trinity Health, a 45-hospital, $5 billion system. Dr. Kini also works as a consultant for innovation in digital health at KiniConsult, a company he founded in 2019. A graduate from University of Alabama and Medical College of Wisconsin, Dr. Kini has a Master of Science in Health Management to complement his Medical Doctorate degree.\nThe Company believes that Dr. Kini is qualified to serve as a member of the Board of Directors due to his education and experience.\nTyler Trumbach, Chief Legal Counsel and Director. Mr. Trumbach has been the Companys Chief Legal Counsel and a member of the Companys Board of Directors since February 17, 2022. Mr. Trumbach is a member of the Florida and New York bars. He graduated in 2013 from Columbia University with a B.A. in Economics and History. He was involved in various political organizations and served two terms as President of the Columbia University College Republicans. After Columbia, Mr. Trumbach attended Fordham University School of Law where he obtained his J.D. While at law school, Tyler was a member of the Urban Law Journal where he wrote a note analyzing the effects of Dodd-Frank on the current mortgage marker. He was also a participant in the Fordham Criminal Defense Clinic where he represented low-income clients in the Manhattan Criminal Court with the guide of the clinic professors. He was employed as in-house legal counsel for Carolina Financial Securities LLC and since 2017, he has been the principal of the Law Offices of Tyler A. Trumbach, P.A.\nMr. Trumbach is the son of Dr. Andrew Trumbach, the Companys President, and a director.\nThe Company believes that Mr. Trumbach is qualified to serve as a member of the Board of Directors due to his education and experience as an attorney.\nExecutive Officers\nFollowing are the name, age and other information for our executive officers. All company officers have been appointed to serve until their successors are elected and qualified or until their earlier resignation or removal. Information regarding Michael Singh, our Chairman and Chief Executive Officer, Dr. Andrew E. Trumbach, our President, Tyler Trumbach, our Chief Legal Counsel, and Lisa-Marie Iannitelli, our Executive Vice President, Investor Relations, is set forth above under Board of Directors.\nName\nAge\nTitles\nMichael Singh\nChairman, Chief Executive Officer and Director\nDr. Andrew E. Trumbach\nDirector and President\nAmir Vasquez\nChief Financial Officer\nLisa-Marie Iannitelli\nExecutive Vice President, Investor Relations and Director\nTyler Trumbach\nChief Legal Counsel and Director\nAmir Vasquez, CFO. Mr. Vasquez has served as the Companys Chief Financial Officer since August 15, 2022. Mr. Vasquez is an experienced controller and finance professional. He received his bachelors degree in accounting and earned a Master of Finance Degree from Florida International University. Amir has been working in the accounting and finance field for over 10 years, beginning his career at the international accounting firm of Pannell Kerr Forster. He is also an experienced financial analyst having worked with international banks, oil companies and multinational duty-free and perfume distributors. From August 2018 to August 2022, he was an accountant at AB Diversified Enterprises Inc., a manufacturer and distributor. Prior to that, from August 2013 to August 2018, he was an accountant at Duty Free Partners LLC, a retailer.\nCommittees of the Board of Directors\nStructure and Operation of the Board\nWe do not have standing audit, compensation, or nominating committees of our Board. However, the full Board performs all of the functions of a standing audit committee, compensation committee and nominating committee. The Board currently consists of six directors: Mr. Singh (Chairman), Dr. Trumbach, Ms. Iannitelli, Dr. Stuart, Dr. Kini and Mr. Trumbach. The following is a brief description of these functions of the Board:\nNomination of Directors\nThe Board does not currently have a standing nominating committee, and thus we do not have a nominating committee charter. Due to our small size and limited operations to date, the Board determined that it was appropriate for the entire Board to act as the nominating committee. The full Board currently has the responsibility of selecting individuals to be nominated for election to the Board. Board candidates are typically identified by existing directors or members of management. The Board will consider director candidates recommended by shareholders. Any such candidates will be evaluated on the same basis as other candidates being evaluated by the Board. Information with respect to such candidates should be sent to Awaysis Capital, Inc., 3400 Lakeview Drive, Suite 100, Miramar, FL 33027; c/o Chairman. The Board considers the needs for the Board as a whole when identifying and evaluating nominees and, among other things, considers diversity in background, age, experience, qualifications, attributes and skills in identifying nominees, although it does not have a formal policy regarding the consideration of diversity.\nAudit Committee Related Function\nWe do not have a standing audit committee, and thus we do not have an audit committee charter. Due to our small size and limited operations to date, the Board determined that it was appropriate for the entire Board to act as the audit committee. The Board intends to review with management and the Companys independent public accountants the Companys financial statements, the accounting principles applied in their preparation, the scope of the audit, any comments made by the independent accountants upon the financial condition of the Company and its accounting controls and procedures and such other matters as the Board deems appropriate. Because the Companys common stock is traded on the OTC Pink market, the Company is not subject to the listing requirements of any securities exchange regarding audit committee related matters.\nAudit Committee Financial Expert\nWe do not have an independent audit committee financial expert, and we do not have an audit committee. Dr. Trumbach meets the definition of an audit committee financial expert but he is not independent.\nRisk Oversight\nThe Boards risk oversight is administered primarily through the following:\n● review and approval of an annual business plan;\n● review of a summary of risks and opportunities at meetings of the Board;\n● review of business developments, business plan implementation and financial results;\n● oversight of internal controls over financial reporting; and\n● review of employee compensation and its relationship to our business plans.\nDue to the small size and early stage of the Company, we have not adopted a formal policy on whether there should be a separate Non-Executive Chairman.\nCompensation Committee Related Function\nThe Board does not currently have a standing compensation committee, and thus we do not have a compensation committee charter. Due to our small size and limited operations to date, the Board determined that it was appropriate for the entire Board to act as the compensation committee. The full Board currently has the responsibility for reviewing and establishing compensation for executive officers and making policy decisions concerning salaries and incentive compensation for executive officers of the Company.\nThe Companys executive compensation program is administered by the Board, which determines the compensation of the executive officers of the Company. In reviewing the compensation of the individual executive officers, the Board intends to consider the recommendations of the executive officers, published compensation surveys and current market conditions.\nCommunication with Shareholders\nShareholders wishing to communicate with the Board can send an email to info@awaysiscpaital.com or write or telephone to the Companys corporate offices:\nAwaysis Capital, Inc.\nChairman\nLakeview Drive, Suite 100\nMiramar, FL 33027\nTelephone: (855)795-3311\nCode of Business Conduct and Ethics\nWe adopted a Code of Business Conduct and Ethics that applies to, among other persons, our principal executive officers, principal financial officer, principal accounting officer or controller, and persons performing similar functions. Our Code of Business Conduct and Ethics is filed with this Annual Report on Form 10-K.\nCorporate Governance\nSection 16(a) Reports\nSection 16(a) of the Exchange Act requires our executive officers, directors, and persons who own more than 10% of a registered class of our equity securities, to file with the SEC reports of ownership of our securities and changes in reported ownership. Executive officers, directors and greater than 10% beneficial owners are required by SEC rules to furnish us with copies of all Section 16(a) reports they file. Based solely on a review of the copies of such forms furnished to us, or written representations from the reporting persons that no Form 5 was required, we believe that, during the fiscal year ended June 30, 2022, with the exception of one untimely Form 3 for each of Messrs. Trumbach, Nelson, Singh, Trumbach, Narendra and Iannitelli, all Section 16(a) filing requirements applicable to our officers, directors and greater than 10% beneficial owners have been met. Item 11. Executive Compensation.\nThe following table sets forth information regarding each element of compensation that was paid or awarded to the named executive officers of the Company for the periods indicated.\nName and Principal Position Year(1) Salary\n($) Bonus\n($) Stock\nAwards\n($) Option\nAwards\n($) Non-Equity\nIncentive Plan\nCompensation\n($) All Other\nCompensation\n($) Total\n($)\nMichael Singh(2) 8,650 -\n-\n-\n-\n-\n8,650\nCEO, President & Chairman - - - - - - -\nCalvin Smiley(3) - - - - - - -\nFormer CEO - - - - - - -\nDr. Andrew Trumbach(4) 8,650 -\n-\n-\n-\n-\n8,650\nPresident and Former Chief Financial Officer - - - - - - -\nLisa-Marie Iannitelli (5) -\n-\n-\n-\n-\n-\n-\nExecutive Vice President - - - - - - -\nTyler Trumbach(6) -\n-\n-\n-\n-\n-\n-\nChief Legal Counsel\n- - - - - - -\n(1) 2022 represents the fiscal year ended June 30, 2022, and 2021 represents the fiscal year ended June 30, 2021.\n(2) Mr. Singh was hired by the Company on November 23, 2021.\n(3) Mr. Smiley resigned from his executive roles with the Company on November 23, 2021.\n(4) Dr. Trumbach was hired by the Company on November 23, 2021, as President and Chief Financial Officer. On August 15, 2022, he resigned as Chief Financial Officer of the Company.\n(5) Ms. Iannitelli was hired by the Company on November 23, 2021.\n(6) Mr. Tyler Trumbach was engaged as an Attorney on November 23, 2021 and was hired by the Company as an employee on February 17, 2022.\nOutstanding Equity Awards at Fiscal Year-End\nThere are no outstanding equity awards held by the named executive officers as of the end of the fiscal year ended June 30, 2022.\nExecutive Employment Agreements\nAmir Vasquez\nMr. Amir Vasquez, the Chief Financial Officer of the Company since August 15, 2022, entered into an Employment Agreement with the Company. Pursuant to the Employment Agreement, Mr. Vasquez will receive an annual base salary of $150,000 (the Base Salary), which will be reviewed on an annual basis to determine potential increases, if any, based on Mr. Vasquezs performance and that of the Company. Additionally, Mr. Vasquez may earn an annual bonus of up to 200% of Base Salary, payable based on performance in the previous fiscal year, and based on the achievement of objectives agreed to with the Companys Chief Executive Office and/or President for each fiscal year.\nMr. Vasquez is also entitled to customary benefits and vacation, and is subject to customary confidentiality, ownership of intellectual property, non-disparagement, non-solicitation and non-compete provisions, as described in the Employment Agreement.\nThe Employment Agreement may be terminated by the Company at any time without prior notice for Cause, as defined in the Employment Agreement. Upon termination for Cause, Mr. Vasquez will be provided with any unpaid, earned Base Salary up to the date of termination.\nThe Employment Agreement may be terminated at any time without Cause, and provided that Mr. Vasquez executes a general release, the Company shall pay to Mr. Vasquez an amount equal to 12-months Base Salary (the Severance) plus accrued unused vacation; provided that the Company shall not be required to pay the Severance in the event the Company elects to enforce the Employment Agreements non-competition provisions and pay salary post-termination pursuant to the terms of the Employment Agreement.\nMr. Vasquez can terminate the Employment Agreement and his employment at any time for any reason on 30 days prior written notice. In case of Good Reason, as defined in the Employment Agreement, the Company shall pay to Mr. Vasquez the Severance plus accrued unused vacation; provided that the Company shall not be required to pay the Severance in the event the Company elects to enforce the Employment Agreements non-competition provisions and pay salary post-termination pursuant to the terms of the Employment Agreement.\nMr. Vasquez will be entitled to participate in the Companys incentive plans and shall initially be granted options to purchase 500,000 shares of the Companys common stock.\nTyler Trumbach, Esq.\nOn July 25, 2022, we entered into an Employment Agreement with Tyler Trumbach, the Companys Chief Legal Counsel and a director.\nPursuant to the Employment Agreement, Mr. Trumbach will receive an annual base salary of $200,000 (the Base Salary), payable in shares of common stock of the Company or cash, depending on cash availability. The Base Salary will be reviewed on an annual basis to determine potential increases, if any, based on Mr. Trumbach s performance and that of the Company. Additionally, Mr. Trumbach may earn an annual bonus of up to 200% of Base Salary, payable based on performance in the previous fiscal year, and based on the achievement of objectives agreed to with the Companys Chief Executive Office and/or President for each fiscal year.\nMr. Trumbach is also entitled to customary benefits and vacation, and is subject to customary confidentiality, ownership of intellectual property, non-disparagement, non-solicitation and non-compete provisions, as described in the Employment Agreement.\nThe Employment Agreement may be terminated by the Company at any time without prior notice for Cause, as defined in the Employment Agreement. Upon termination for Cause, Mr. Trumbach will be provided with any unpaid, earned Base Salary up to the date of termination.\nThe Employment Agreement may be terminated at any time without Cause, and provided that Mr. Trumbach executes a general release, the Company shall pay to Mr. Trumbach an amount equal to 12-months Base Salary (the Severance) plus accrued unused vacation; provided that the Company shall not be required to pay the Severance in the event the Company elects to enforce the Employment Agreements non-competition provisions and pay salary post-termination pursuant to the terms of the Employment Agreement.\nMr. Trumbach can terminate the Employment Agreement and his employment at any time for any reason on 30 days prior written notice. In case of Good Reason, as defined in the Employment Agreement, the Company shall pay to Mr. Trumbach the Severance plus accrued unused vacation; provided that the Company shall not be required to pay the Severance in the event the Company elects to enforce the Employment Agreements non-competition provisions and pay salary post-termination pursuant to the terms of the Employment Agreement.\nMr. Trumbach will be entitled to participate in the Companys incentive plans and shall initially be granted options to purchase 1,500,000 shares of the Companys common stock.\nLimits on Liability and Indemnification\nWe provide directors and officers insurance for our current directors and officers.\nOur certificate of incorporation eliminates the personal liability of our directors to the fullest extent permitted by law. The certificate of incorporation further provides that the Company will indemnify its directors to the fullest extent permitted by law.\nDirector Compensation\nNo compensation was paid by the Company to its directors as such during the year ended June 30, 2022, or 2021. In consideration for their board service, we intend to compensate our outside directors in the form of options for each year for their continued service. We also reimburse our directors reasonable out of pocket expenses incurred in attending board meetings and in carrying out their board duties. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table shows the number of shares of our common stock beneficially owned, as November 2, 2022, by (i) each of our directors and director nominees, (ii) each of our named executive officers, (iii) all of our current directors and executive officers as a group, and (iv) all those known by us to be to a beneficial owner of more than 5% of the Companys common stock. In general, beneficial ownership refers to shares that an individual or entity has the power to vote or dispose of, and any rights to acquire common stock that are currently exercisable or will become exercisable within 60 days of November 2, 2022. We calculated percentage ownership in accordance with the rules of the SEC. The percentage of common stock beneficially owned is based on 100,143,322 shares outstanding as of November 2, 2022. In addition, shares issuable pursuant to options or other convertible securities that may be acquired within 60 days of November 2, 2022 are deemed to be issued and outstanding and have been treated as outstanding in calculating and determining the beneficial ownership and percentage ownership of those persons possessing those securities, but not for any other persons.\nThis table is based on information supplied by each director, officer and principal stockholder of the Company. Except as indicated in footnotes to this table, the Company believes that the stockholders named in this table have sole voting and investment power with respect to all shares of Common Stock shown to be beneficially owned by them, based on information provided by such stockholders. Unless otherwise indicated, the address for each director, executive officer and 5% or greater stockholders of the Company listed is: c/o Awaysis Capital, Inc., 3400 Lakeside Drive, ,Suite 100, Miramar, FL 33027\nBeneficial Owner Number of Shares\nBeneficially Owned Percentage of\nCommon Stock\nBeneficially Owned\nHarthorne Capital, Inc.(1) 98,008,000 97.87 %\nMichael Singh (1 ) (1 )%\nAmir Vasquez (2) - - %\nAndrew Trumbach (1 ) (1 )%\nLisa-Marie Iannitelli (1 ) (1 )%\nClaude Stuart - - %\nNarendra Kini - - %\nTyler Trumbach - - %\nCalvin Smiley - -\nAll current directors and executive officers as a group (7 persons) 98,008,000 97.87 %\n(1) Pursuant to a Schedule 13D filed with the Securities and Exchange Commission on March 14, 2022, Harthorne Capital, Inc. (Harthorne) operates as a holding entity for Mr. Singh and Dr. Trumbachs initial investments in the Company. Additionally, each of Mr. Singh, Dr. Trumbach and Ms. Iannitelli are Executive Directors of Harthorne. Each of Mr. Singh, Dr. Trumbach and Ms. Iannitelli disclaims beneficial ownership of all such securities except to the extent of his or her pecuniary interest therein, other than those securities reported herein as being held directly by such Reporting Person.\n(2) Mr. Vasquez was appointed as the Companys Chief Financial Officer since August 15, 2022. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nRelated Person Transaction\nThe Board intends to implement a policy to review, approve and oversee any transaction between us and any related person and any other potential conflict of interest situations on an ongoing basis, and develops policies and procedures for the approval of related party transactions. Prior to consideration of a transaction with a related person, the material facts as to the related persons relationship or interest in the transaction would be disclosed to the disinterested directors. The transaction would not be approved unless a majority of the members of the Board who are not interested in the transaction approve the transaction. The Board intends to takes into account, among other factors that it deems appropriate, whether the related person transaction is on terms no less favorable to us than terms generally available in a transaction with an unrelated third-party under the same or similar circumstances and the extent of the related persons interest in the related person transaction.\nEach of Mr. Singh, Dr. Trumbach and Ms. Iannitelli are Executive Directors of Harthorne, the owner of approximately 98% of the issued and outstanding shares of common stock of the Company.\nAs of June 30, 2022, and 2021, Harthorne advanced $12,497 and $5,923, respectfully, relating to costs paid on behalf of the Company.\nFamily Relationships\nTyler Trumbach, the Companys Chief Legal Counsel and a director, is the son of Dr. Andrew Trumbach, the president and a director of the Company. There are no other familial relationships between any of our officers and directors.\nApart from the disclosures set forth under this Item 13, there have been no related party transactions, or any other transactions or relationships required to be disclosed pursuant to Item 404 of Regulation S-K.\nDirector Independence\nWe use the definition of independence of The NASDAQ Stock Market to make this determination. NASDAQ Listing Rule 5605(a)(2) provides that an independent director is a person other than an officer or employee of the company or any other individual having a relationship, which, in the opinion of the Companys Board, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. The NASDAQ listing rules provide that a director cannot be considered independent if:\n● The director is, or at any time during the past three years was, an employee of the company;\n● The director or a family member of the director accepted any compensation from the company in excess of $120,000 during any period of 12 consecutive months within the three years preceding the independence determination (subject to certain exclusions, including, among other things, compensation for board or board committee service);\n● A family member of the director is, or at any time during the past three years was, an executive officer of the company;\n● The director or a family member of the director is a partner in, controlling shareholder of, or an executive officer of an entity to which the company made, or from which the company received, payments in the current or any of the past three fiscal years that exceed 5% of the recipients consolidated gross revenue for that year or $200,000, whichever is greater (subject to certain exclusions);\n● The director or a family member of the director is employed as an executive officer of an entity where, at any time during the past three years, any of the executive officers of the company served on the compensation committee of such other entity; or\n● The director or a family member of the director is a current partner of the companys outside auditor, or at any time during the past three years was a partner or employee of the companys outside auditor, and who worked on the companys audit.\nUnder such definitions, one of our directors can be considered independent. Item 14. Principal Accountant Fees and Services.\nThe Board of Directors has reviewed and discussed the audited consolidated financial statements of Awaysis Capital, Inc. for the fiscal year ended June 30, 2022, with management and have reviewed related written disclosures of BF Borgers CPA PC, our independent accountants of the matters required to be discussed by SAS 114 (Codification of Statements on Auditing Standards, AU Section 380), as amended, with respect to those statements. We have reviewed the written disclosures and the letter from BF Borgers CPA PC required by regulatory and professional standards and have discussed with BF Borgers CPA PC its independence in connection with its audit of our most recent financial statements. Based on this review and these discussions, the Board of Directors recommends that the financial statements be included in this Form 10-K for the year ended June 30, 2022.\nWe have also reviewed the various fees that we paid or accrued to BF Borgers CPA PC during the year ended June 30, 2022, and 2021 for services they rendered in connection with our annual audits and quarterly reviews, as well as for any other non-audit services they rendered.\nThe following table shows the fees for professional services rendered by BF Borgers CPA PC for the audit of our financial statements for the years ended June 30, 2022, and 2021 and fees billed for other services rendered by BF Borgers CPA PC during those periods:\nAudit Fees $ 0 $ 0\nAudit Related Fees $ 5,500 $ 0\nTax Fees $ 0 $ 0\nAll Other Fees $ 0 $ 0\nTotal $ 5,500 $ 0\nAudit fees consist of fees billed for professional services rendered for the audit of our financial statements that are normally provided by the above auditors in connection with statutory and regulatory filings or engagements. Audit-related fees consist of fees billed for professional services rendered for the review of SEC filings or review in quarterly reports and services that are normally provided by the above auditors in connection with statutory and regulatory filings. Tax fees consist of fees to prepare the Companys federal and state income tax returns. Other fees relate to advisory services related research on accounting or other regulatory matters.\nPre-Approval Policies and Procedures\nWe have not adopted a policy on pre-approval of audit and permissible non-audit services.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a) The following documents are filed as part of this Annual Report on Form 10-K:\n(1) Financial Statements:\nThe financial statements are filed as part of this Annual Report on Form 10-K commencing on page and are hereby incorporated by reference.\n(2) Financial Statement Schedules:\nThe financial statement schedules are omitted as they are either not applicable or the information required is presented in the financial statements and notes thereto.\n(3) Exhibits:\nThe documents set forth below are filed herewith or incorporated by reference to the location indicated.\nExhibit Number\nDescription of Document\n3.1\nArticles of Incorporation (1)\n3.2\nCertificate of Amendment of Certificate of Incorporation (1)\n3.3\nCertificate of Amendment to its Articles of Incorporation (2)\n3.4\nBy-Laws (1)\n10.1*\n2022 Omnibus Performance Award Plan (3)\n10.2\nAgreement of Purchase and Sale, dated as of April 15, 2022, by and between JV Group, Inc. and Curah Capital Corporation (4)\n10.3\nAgreement of Purchase and Sale, dated as of April 15, 2022, by and between JV Group, Inc. and Agorapyth X Corporation (4)\n10.4\nAgreement of Purchase and Sale, dated as of April 15, 2022, by and between JV Group, Inc. and Abraxas Corporation (4)\n10.5*\nEmployment Agreement with Tyler Trumbach (5)\n10.6*\nEmployment Agreement with Amir Vasquez (6)\n10.7\nDemand Promissory Note dated June 30, 2022 with Curah Capital Corporation\n10.8\nDemand Promissory Note dated June 30, 2022 with Abraxas Corporation\n14.1\nCode of Business Conduct and Ethics\n21.1\nSubsidiaries of the Registrant\n31.1\nCertification Pursuant to Securities Exchange Act Rule 13(a)-14(a), as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification Pursuant to Securities Exchange Act Rule 13(a)-14(a), as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nInline XBRL Instance - The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH\nInline XBRL Taxonomy Extension Schema.\n101.CAL\nInline XBRL Taxonomy Extension Calculation.\n101.DEF\nInline XBRL Taxonomy Extension Definition.\n101.LAB\nInline XBRL Taxonomy Extension Labels.\n101.PRE\nInline XBRL Taxonomy Extension Presentation.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*\nIndicates Management contract or compensatory plan or arrangement\n(1) Incorporated by reference from the exhibit included in the Companys Registration Statement on Form 10 filed with the SEC dated August 2, 2021.\n(2) Incorporated by reference from the exhibit included in the Companys Current Report on Form 8-K filed with the SEC on May 23, 2022.\n(3) Incorporated by reference from Appendix B of the Information Statement on Schedule 14C filed with the SEC on March 4, 2022.\n(4) Incorporated by reference from the exhibit included in the Companys Current Report on Form 8-K filed with the SEC on April 21, 2022.\n(5) Incorporated by reference from the exhibit included in the Companys Current Report on Form 8-K filed with the SEC on July 29, 2022.\n(6) Incorporated by reference from the exhibit included in the Companys Current Report on Form 8-K filed with the SEC on August 16, 2022.\nItem 16. Form 10-K Summary\nNone\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAWAYSIS CAPITAL, INC.\n/s/ Michael Singh\nMichael Singh\nChairman and Chief Executive Officer\nDated: November 4, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Michael Singh\nChairman and Chief Executive Officer\nNovember 4, 2022\nMichael Singh\n(Principal Executive Officer)\n/s/ Amir Vasquez\nChief Financial Officer\nNovember 4, 2022\nAmir Vasquez\n(Principal Financial and Accounting Officer)\n/s/ Andrew Trumbach\nPresident and Director\nNovember 4, 2022\nAndrew Trumbach\n/s/ Lisa-Marie Iannitelli\nExecutive Vice President and Director\nNovember 4, 2022\nLisa-Marie Iannitelli\n/s/ Claude Stuart\nDirector\nNovember 4, 2022\nClaude Stuart\n/s/ Narendra Kini\nDirector\nNovember 4, 2022\nNarendra Kini\n/s/ Tyler Trumbach\nChief Legal Counsel and Director\nNovember 4, 2022\nTyler Trumbach\nAwaysis Capital, Inc.\nIndex to Consolidated Financial Statements\nAudited Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm (BF Borgers CPA PC - PCAOB #: 5041)\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations for the Years Ended June 30, 2022 and 2021\nConsolidated Statements of Changes in Stockholders Equity For the Years Ended June 30, 2022, and 2021\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Awaysis Capital, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Awaysis Capital, Inc. as of June 30, 2022 and June 30, 2021, the related statements of operations, stockholders equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Company's ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matter\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments.\nWe determined that there are no critical audit matters.\n/S/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Companys auditor since 2021\nLakewood, CO\nNovember 4, 2022\nAwaysis Capital, Inc.\n(formerly known as JV Group, Inc.)\nConsolidated Balance Sheets\nJune 30, 2022 June 30, 2021\n(Audited) (Audited)\nAssets\nCurrent assets\nCash $ 481,965 $ -\nPrepaid expenses 2,500\nInventory 11,409,500 -\nTotal current assets 11,893,965\nNon-current assets\nFixed assets, net 22,145 -\nTotal non-current assets 22,145 -\nTotal Assets $ 11,916,110 $ 200\nLiabilities and Stockholders Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses $ 41,970 $ 19,640\nAdvances-related party 12,497 5,923\nNotes payable 2,880,000 -\nTotal current liabilities 2,934,467 25,563\nTotal Liabilities 2,934,467 25,563\nStockholders Equity\nPreferred stock - 25,000,000 shares authorized $0.01 par value none issued and outstanding at June 30, 2022 and June 30, 2021, respectively - -\nCommon stock - 1,000,000,000 shares authorized $0.01 par value issued and outstanding; common shares at June 30, 2022 and June 30, 2021 were 99,748,541 and 98,879,655, respectively 997,486 988,797\nCommon stock subscribed - common shares at June 30, 2022 and June 30, 2021 were 58,056,334 and 0, respectively 580,563 -\nAdditional paid-in capital 9,850,605 -\nAccumulated deficit (1,254,011 ) (1,014,160 )\nSubscription receivable (1,193,000 ) -\nTotal stockholders equity 8,981,643 (25,363 )\nTotal Liabilities and Stockholders Equity $ 11,916,110 $ 200\nSee notes to audited consolidated financial statements\nAwaysis Capital, Inc.\n(formerly known as JV Group, Inc.)\nConsolidated Statements of Operations\n(Audited)\nYear Ended Year Ended\nJune 30, 2022 June 30, 2021\nRevenue $ - $ -\nOperating expenses\nSales and Marketing 49,269 -\nGeneral and administrative 190,582 12,023\nTotal operating expenses 239,851 12,023\nLoss from operations (239,851 ) (12,023 )\nOther expense\nInterest expense - (2,488 )\nTotal other expense - (2,488 )\nNet loss before income taxes (239,851 ) (14,511 )\nIncome taxes\nNet loss $ (239,851 ) $ (14,511 )\nBasic and diluted per common share amounts:\nBasic and diluted net loss $ (0.00 ) $ (0.00 )\nWeighted average number of common shares outstanding (basic and diluted) 98,958,324 98,879,655\nSee notes to audited consolidated financial statements\nAwaysis Capital, Inc.\n(formerly known as JV Group, Inc.)\nConsolidated Statements of Changes in Stockholders Equity\nFor the Years Ended June 30, 2022, and 2021\n(Audited)\nCommon Stock Additional\nTotal\nShares Common Stock Paid In Capital Accumulated Deficit Subscription Receivable Shareholders Equity\nBalance at June 30, 2020 98,879,655 $ 988,797 $ - $ (999,649 ) $ - $ (10,852 )\nNet Loss\n- - (14,511 ) - (14,511 )\nBalance at June 30, 2021 98,879,655 $ 988,797 $ - $ (1,014,160 ) $ - $ (25,363 )\nShares issued for professional services 243,886 2,439 40,297\n42,736\nShares issued at $1.00 625,000 6,250 618,750\n625,000\nShares subscribed for purchase of asset 56,863,334 568,633 7,960,867\n8,529,500\nShares subscribed at $1.00 1,193,000 11,930 1,181,070\n(1,193,000) -\nIncrease in paid in capital\n49,620\n49,620\nNet Loss\n(239,851 )\n(239,851 )\nBalance at June 30, 2022 157,804,875 $ 1,578,049 $ 9,850,605 $ (1,254,011 ) $ (1,193,000 ) $ 8,981,643\nSee notes to audited consolidated financial statements\nAwaysis Capital, Inc.\n(Formerly JV Group, Inc.)\nConsolidated Statements of Cash Flows\n(Audited)\nYear Ended Year Ended\nJune 30, 2022 June 30, 2021\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (239,851 ) $ (14,511 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nStock based compensation for services\n42,736 -\nChanges in operating assets and liabilities:\n(Increase) Decrease in Prepaid expenses (2,500 ) -\nIncrease (decrease) in accounts payable and accrued expenses 41,970 8,588\nNet Cash Used In Operating Activities (157,645 ) (5,923 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchase of fixed assets (22,145 ) -\nNet Cash Used In Investing Activities (22,145 ) -\nCASH FLOWS FROM FINANCING ACTIVITIES:\nIncrease in related party advances, net 12,497 5,923\nProceeds from additional paid in capital 24,258 -\nProceeds from sale of common stock 625,000 -\nNet Cash Provided By Financing Activities 661,755 5,923\nNet increase in cash 481,965 -\nCash - Beginning of Year - -\nCash - End of Year $ 481,965 $ -\nSUPPLEMENTARY CASH FLOW INFORMATION:\nCash Paid During the Period for:\nTaxes $ - $ -\nInterest - -\nNon-Cash Transactions:\nInventory Acquired from Debt and stock issuance 11,409,500 -\nExpenses paid directly by officer on behalf of the Company $ 12,497 $ -\nSee notes to audited consolidated financial statements\nAwaysis Capital, Inc.\nNotes to the Consolidated Financial Statements\n1. NATURE OF OPERATIONS\nNature of Business\nAwaysis Capital, Inc. (formerly known as JV Group, Inc.), a Delaware corporation, (Awaysis, JV Group, the Company, we, us or our) is a publicly quoted shell company transitioning to an operating company. We are a real estate investment and management company focused on acquisition, construction, selling and managing rentals of residential vacation home communities in desirable travel destinations. We seek to create value through the targeting and acquisition, development, and up-cycling, rebranding, and repositioning of currently undervalued operating and shovel ready residential/resort communities in global travel destinations, with the intention to relaunch these assets under the Awaysis brand with the goals of creating a network of residential and resort enclave communities that will optimize both sales and rental revenues, providing attractive returns to owners and exceptional vacation experiences to travelers.\nThe Companys principal executive office is located at 3400 Lakeside Dr, Miramar, FL 33027.\nCompany History\nJV Group was formed in Delaware on September 29, 2008 under the name ASPI, Inc.\nOn May 18, 2022, we changed our name from JV Group, Inc. to Awaysis Capital, Inc. In connection with this name change, we changed our ticker symbol from ASZP to AWCA and effective May 25, 2022, we began trading on the OTC Market under our new symbol.\nIn December 2021, we formed a wholly owned subsidiary, Awaysis Capital, LLC, a Florida single member limited liability corporation to hold the office lease and to become the master payroll company for Awaysis Capital Inc.\nWe also formed a wholly owned subsidiary, Awaysis Casamora Limited, a Belize single member limited liability corporation to hold the title to the acquisition of the Casamora assets.\nFrom October 2015 to February 2022, we were a publicly quoted shell company seeking to merge with an entity with experienced management and opportunities for growth in return for shares of our common stock to create values for our shareholders. In February 2022, the Board of Directors of the Company determined to pursue a business strategy of acquiring, developing and managing residential vacation home communities in desirable travel destinations.\nThe Companys principal executive office is located at 3400 Lakeside Drive, Suite 100, Miramar, FL 33027 and its main number is 855-795-3377. The Companys website address is www.awaysisgroup.com.\nIn March 2020 the World Health Organization declared COVID-19 a pandemic. The Company is still assessing the impact COVID-19 may have on its business, but there can be no assurance that this analysis will enable the Company to avoid part or all of any impact from the spread of COVID-19 or its consequences, including downturns in business sentiment generally. The extent to which the COVID-19 pandemic and global efforts to contain its spread will impact the Companys operations will depend on future developments, which are highly uncertain and cannot be predicted at this time, and include the duration, severity and scope of the pandemic and the actions taken to contain or treat the COVID-19 pandemic.\nWe currently have not been directly impacted by the Covid-19 outbreak due to our limited operations. However, management believes the effect of the pandemic outbreak on the global economy has driven demand for vacation home ownership and remote work at home while travelling. The Company believes that this will enhance its ability to raise funding for working capital and other needs and to attract an experienced management team to take advantage of the opportunities for growth.\n2. SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe summary of significant accounting policies is presented to assist in the understanding of the financial statements. These policies conform to GAAP and have been consistently applied. The Company has selected June 30 as its financial year end. The Company did not earn any revenue during the years ended June 30, 2022.\nPrincipals of Consolidation\nThe consolidated financial statements include accounts of the Companys wholly-owned subsidiaries Awaysis Capital, LLC and Awaysis Casamora Limited. All significant intercompany balances and transactions have been eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nWe maintain cash balances in a non-interest-bearing account and unrestricted cash in escrow that currently does not exceed federally insured limits. For the purpose of the statements of cash flows, all highly liquid investments with a maturity of three months or less are considered to be cash equivalents. As of June 30, 2022, our cash balance was $481,965.\nFair Value Measurements\nASC Topic 820, Fair Value Measurements and Disclosures (ASC 820), provides a comprehensive framework for measuring fair value and expands disclosures which are required about fair value measurements. Specifically, ASC 820 sets forth a definition of fair value and establishes a hierarchy prioritizing the inputs to valuation techniques, giving the highest priority to quoted prices in active markets for identical assets and liabilities and the lowest priority to unobservable value inputs. ASC 820 defines the hierarchy as follows:\nLevel 1 - Quoted prices are available in active markets for identical assets or liabilities as of the reported date. The types of assets and liabilities included in Level 1 are highly liquid and actively traded instruments with quoted prices, such as equities listed on the New York Stock Exchange.\nLevel 2 - Pricing inputs are other than quoted prices in active markets but are either directly or indirectly observable as of the reported date. The types of assets and liabilities in Level 2 are typically either comparable to actively traded securities or contracts or priced with models using highly observable inputs.\nLevel 3 - Significant inputs to pricing that are unobservable as of the reporting date. The types of assets and liabilities included in Level 3 are those with inputs requiring significant management judgment or estimation, such as complex and subjective models and forecasts used to determine the fair value of financial transmission rights.\nOur financial instruments consist of prepaid expenses, accounts payable, accounts payable - related party and note payable - related party. The carrying amount of our prepaid expenses, accounts payable, accounts payable - related party and note payable - related party approximate their fair values because of the short-term maturities of these instruments.\nRelated Party Transactions\nA related party is generally defined as (i) any person that holds 10% or more of our membership interests including such persons immediate families, (ii) our management, (iii) someone that directly or indirectly controls, is controlled by or is under common control with us, or (iv) anyone who can significantly influence our financial and operating decisions. A transaction is considered to be a related party transaction when there is a transfer of resources or obligations between related parties. See Note 8 below for details of related party transactions in the period presented.\nFixed Assets\nFixed assets are carried at cost less accumulated depreciation and amortization. Depreciation is computed using the straight-line method over the estimated useful lives. The fixed assets include property, equipment and software which ownership is maintained by the Company.\nLeases\nWe determine if an arrangement is a lease at inception. Operating leases are included in operating lease right-of-use (ROU) as assets, operating lease non-current liabilities, and operating lease current liabilities in our balance sheet. Finance leases are property and equipment, other current liabilities, and other non-current liabilities in the balance sheet.\nROU assets represent the right to use an asset for the lease term and lease liability represent the obligation to make lease payment arising from the lease. Operating lease ROU assets and liabilities are recognized at the commencement date based on the present value of lease payments over lease term. As most of the leases doesnt provide an implicit rate, we generally use the incremental borrowing rate on the estimated rate of interest for collateralized borrowing over a similar term of the lease payments at commencement date. The operating ROU asset also includes any lease payments made and exclude lease incentives. Lease expense for lease payment is recognized on a straight-line basis over lease term.\nWe were not party to any lease agreements during the year ended June 30, 2022, or 2021.\nIncome Taxes\nThe Company accounts for income taxes under Section 740-10-30 of the FASB Accounting Standards Codification. Deferred income tax assets and liabilities are determined based upon differences between the financial reporting and tax bases of assets and liabilities and are measured using the enacted tax rates and laws that will be in effect when the differences are expected to reverse. Deferred tax assets are reduced by a valuation allowance to the extent management concludes it is more likely than not that the assets will not be realized. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the statements of operations in the period that includes the enactment date.\nThe Company adopted section 740-10-25 of the FASB Accounting Standards Codification (Section 740-10-25). Section 740-10-25 addresses the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the financial statements. Under Section 740-10-25, the Company may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than fifty percent (50%) likelihood of being realized upon ultimate settlement. Section 740-10-25 also provides guidance on de-recognition, classification, interest and penalties on income taxes, accounting in interim periods and requires increased disclosures.\nThe estimated future tax effects of temporary differences between the tax basis of assets and liabilities are reported in the accompanying balance sheets, as well as tax credit carry-backs and carry-forwards. The Company periodically reviews the recoverability of deferred tax assets recorded on its balance sheets and provides valuation allowances as management deems necessary.\nManagement makes judgments as to the interpretation of the tax laws that might be challenged upon an audit and cause changes to previous estimates of tax liability. In addition, the Company operates within multiple taxing jurisdictions and is subject to audit in these jurisdictions. In managements opinion, adequate provisions for income taxes have been made for all years. If actual taxable income by tax jurisdiction varies from estimates, additional allowances or reversals of reserves may be necessary.\nRevenue Recognition\nRevenue Recognition Standard, ASC 606 is used by the Company to recognize revenue. ASC 606 standards were jointly issued by the Financial Accounting Standards Board (FASB) and the International Accounting Standards Board (IASB). Revenues are recognized when control of the promised goods or services are transferred to a customer, in an amount that reflects the consideration that the Company expects to receive in exchange for those goods or services. The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfills its obligations under each of its agreements:\nStep 1: Identify the contract(s) with customers\nStep 2: Identify the performance obligations in the contract\nStep 3: Determine the transaction price\nStep 4: Allocate the transaction price to performance obligations\nStep 5: Recognize revenue when the entity satisfies a performance obligation\nAt this time, we have not identified specific planned revenue streams, nor have we recognized any revenue during the years ended June 30, 2022, and 2021.\nInventory\nNew real estate inventory is carried at the lower of cost or net realizable value. The cost of finished inventories determined on the specific identification method is removed from inventories and recorded as a component of cost of sales at the time revenue is recognized. In addition, an allocation of depreciation and amortization is included in cost of goods sold. Under the specific identification method, if finished real estate inventory can be sold for a profit there is no basis to write down the inventory below the lower of cost or net realizable value.\nInventory of real estate under construction was $11,409,500 and $0 as of June 30, 2022 and 2021, respectively.\nFair Value of Financial Instruments - From inception, the Company adopted ASC 820, Fair Value Measurements and Disclosures, which provides a framework for measuring fair value under GAAP. Fair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. The standard also expands disclosures about instruments measured at fair value and establishes a fair value hierarchy, which requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The standard describes three levels of inputs that may be used to measure fair value:\n● Level 1: Quoted prices for identical assets and liabilities in active markets.\n● Level 2: Quoted prices for similar assets and liabilities in active markets; quoted prices for identical or similar assets and liabilities in markets that are not active; and model-derived valuations in which all significant inputs and significant value drivers are observable in active markets; and\n● Level 3: Valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nThe carrying amounts of financial instruments including cash, accounts payable, warrant liability and notes payable approximated fair value as of June 30, 2022, and 2021 due to the relatively short maturity of the respective instruments.\nAdvertising and Marketing Costs\nWe expense advertising costs when advertisements occur. Advertising for the Company consists primarily of the creation and marketing of the Awaysis brand guideline, logo, wordmark, tagline, and website. Advertising expenses amounted to approximately $44,800 and $0 as of June 30, 2022, and June 30, 2021, respectively.\nStock Based Compensation\nThe cost of equity instruments issued to employees and non-employees in return for goods and services is measured by the grant date fair value of the equity instruments issued in accordance with ASC 718, Compensation - Stock Compensation. The related expense is recognized as services are rendered or vesting periods elapse.\nNo stock-based compensation was issued during the quarters ended June 30, 2022 and 2021.\nNet Loss per Share Calculation\nBasic earnings (loss) per common share (EPS) is computed by dividing net income (loss) available to common stockholders by the weighted-average number of common shares outstanding for the period. Diluted earnings (loss) per share is computed by dividing net income (loss) by the weighted average shares outstanding, assuming all dilutive potential common shares were issued. Dilutive loss per share excludes all potential common shares if their effect is anti-dilutive.\nNo potentially dilutive debt or equity instruments were issued or outstanding during the year ended June 30, 2022, and 2021.\nRecently Issued Accounting Pronouncements\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326) Measurement of Credit Losses on Financial Instruments (ASU 2016-13). The main objective of ASU 2016-13 is to provide financial statement users with more decision-useful information about the expected credit losses on financial instruments and other commitments to extend credit held by a reporting entity at each reporting date. To achieve this objective, the amendments in ASU 2016-13 replace the incurred loss impairment methodology in current U.S. GAAP with a methodology that reflects expected credit losses and requires consideration of a broader range of reasonable and supportable information to inform credit loss estimates. ASU 2016-13 is effective for fiscal years beginning after December 15, 2021, including interim periods within those years, and must be adopted under a modified retrospective method approach. Entities may adopt ASU 2016-13 earlier as of the fiscal years beginning after December 15, 2018, including interim periods within those years. The Company is currently evaluating the provisions of this guidance and assessing its impact on the Companys financial statements and disclosures. Implementation of this ASU had no material impact on the consolidated financial statements.\nIn August 2020, the FASB issued ASU 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40)-Accounting for Convertible Instruments and Contracts in an Entitys Own Equity. ASU 2020-06 reduces the number of accounting models for convertible debt instruments and convertible preferred stock. For convertible instruments with conversion features that are not required to be accounted for as derivatives under Topic 815, Derivatives and Hedging, or that do not result in substantial premiums accounted for as paid-in capital, the embedded conversion features no longer are separated from the host contract. ASU 2020-06 also removes certain conditions that should be considered in the derivatives scope exception evaluation under Subtopic 815-40, Derivatives and Hedging-Contracts in Entitys Own Equity, and clarify the scope and certain requirements under Subtopic 815-40. In addition, ASU 2020-06 improves the guidance related to the disclosures and earnings-per-share (EPS) for convertible instruments and contract in entitys own equity. ASU 2020-06 is effective for public business entities that meet the definition of a Securities and Exchange Commission (SEC) filer, excluding entities eligible to be smaller reporting companies as defined by the SEC, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. The Board specified that an entity should adopt the guidance as of the beginning of its annual fiscal year. Implementation of this ASU had no material impact on the consolidated financial statements.\nAs of June 30, 2022, there were several new accounting pronouncements issued by the Financial Accounting Standards Board. Each of these pronouncements, as applicable, has been or will be adopted by the Company. Management does not believe the adoption of any of these accounting pronouncements has had or will have a material impact on the Companys consolidated financial statements.\n3. GOING CONCERN\nThe Company adopted Accounting Standards Update No. 2014-15, Presentation of Financial Statements-Going Concern (Subtopic 205-40): Disclosure of Uncertainties about an Entitys Ability to Continue as a Going Concern (ASU 2014-15). The Companys financial statements have been prepared assuming that it will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. As reflected in the financial statements, the Company had an accumulated deficit at June 30, 2022 and 2021, a net loss and net cash used in operating activities for the reporting periods then ended. As of year, ended June 30, 2022 and 2021, it has cash in the amount of $481,965 and -0- respectively. As of June 30, 2022, and 2021 It has executed subscription to be funded in the amount of $1,193,000 and -0- respectively.\nThe Company is commencing operations and seeking to generate sufficient revenue and have received sufficient subscriptions and funding to support its current basic operations for at least the next 12 months; however, the Companys cash position may not be sufficient to support the Companys long-term strategy. While the Company believes in the viability of its strategy to commence operations and generate sufficient revenue to further develop its first properties through presales, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Companys ability to further implement its business plan, generate sufficient revenue through presales or otherwise, and its ability to raise additional funds by way of private offering or debt. The financial statements do not include any adjustments related to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\n4. ACCOUNTS PAYABLE AND ACCRUED EXPENSES\nAs of June 30, 2022 and 2021, the balance of accounts payable and accrued expenses was $41,970 and $19,640, respectively, and related primarily to expenses relating to Prop-tech Software development, SEC filings, outstanding legal expenses and share transfer expenses.\n5. ADVANCES - RELATED PARTY\nAs of June 30, 2022 and 2021, the balance of advances - related party was $12,497 and $5,923 respectfully and related to costs paid on behalf of the Company by an entity controlled by two of our directors.\n6. NOTES PAYABLE\nThe Company has notes payable as of June 30, 2022 and 2021 in the amount of approximately $2,880,000 and -0-, respectively.\nIn furtherance of the foregoing, on June 30, 2022, the Company purchased from a non-related party, real estate asset appraised at $11,409,500 and executed two unsecured demand promissory notes bearing annual interest rates of 0%. The first is for $2,600,000 and the second was in the amount of $280,000. This second note was subsequently fully paid on August 8, 2022.\n7. COMMITMENTS & CONTINGENCIES\nLegal Proceedings\nWe were not subject to any legal proceedings during the twelve months ended June 30, 2022 and 2021 and, to the best of our knowledge, no legal proceedings are pending or threatened.\nContractual Obligations\nOn May 31, 2022, the Company entered into a software development agreement with D&M Enterprises LLC in the amount of $22,145 to develop a hospitality Proptech software solution for our property management and hospitality services. $12,595 is due and pending as of June 30, 2022.\n8. STOCKHOLDERS EQUITY (DEFICIT)\nPreferred Stock\nAs of June 30, 2022, we were authorized to issue 25,000,000 shares of preferred stock with a par value of $0.01.\nNo shares of preferred stock were issued and outstanding during the year ended June 30, 2022.\nCommon Stock\nAs of June 30, 2022, we were authorized to issue 1,000,000,000 shares of common stock with a par value of $0.01, of which 99,748,541 shares of common stock were issued and outstanding and 58,056,334 shares of common stock were subscribed, contractually obligated and committed to be issued but not yet issued.\nDuring the year ended June 30, 2022, the Company issued 243,886 common shares for payment of professional services in the amount of $42,736.\nDuring the year ended June 30, 2022, the Company became contractually obligated and committed to issue an aggregate of 56,863,334 common shares as partial consideration for the purchase of real estate inventory in the amount of $8,529,500. All of such shares are deemed subscribed for and purchased by the sellers of the real estate as at June 30, 2022, but have not been issued by the Company as it waits for instructions from such sellers.\nDuring the year ended June 30, 2022, the Company sold 625,000 common shares in a private offering, at a price per share of $1.00 for $625,000 in gross proceeds.\nDuring the year ended June 30, 2022, the Company entered into subscription agreements with investors in a private offering, for 1,193,000 shares, at a price per share of $1.00 for $1,193,000 and has a subscription receivable of $1,193,000 related to that sale as of June 30, 2022.\nThe Company has not declared or paid any dividends or returned any capital to common stock shareholders as of June 30, 2022 and 2021.\nWarrants\nNo warrants were issued or outstanding during the twelve months ended June 30, 2022 or 2021.\nStock Options\nThe company has adopted the 2022 Omnibus Performance Award Plan in February 2022. The Plan authorizes the granting of 19,977,931 of the Companys Common Stock.\nNo stock options were issued or outstanding during the twelve months ended June 30, 2022 or 2021.\n9. SUBSEQUENT EVENTS\nThe Company evaluated subsequent events after June 30, 2022, in accordance with FASB ASC 855 Subsequent Events, through the date of the issuance of these financial statements.\nAs of September 1, 2022, the Company has entered into a sixty-two (62) month office lease agreement with WPT Land 2 LP for offices at 3400 Lakeside Drive, Miramar, FL 33027.\nSee Note 9. Notes Payable, with respect to the repayment of a promissory note on August 8, 2022."
}