{
    "cik": "1022505",
    "company": "SideChannel, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-27",
    "period_of_report": "2023-09-30",
    "sic": "7374",
    "state_of_inc": "DE",
    "state_location": "MA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1022505/0001493152-23-046278-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1022505/000149315223046278/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1022505/0001493152-23-046278.txt",
    "filename": "1022505_10K_2023_0001493152-23-046278.htm",
    "content": "ITEM 1. BUSINESS\nReverse Merger\nOn July 1, 2022 (the Closing Date), the Company, then known as Cipherloc Corporation, a Delaware corporation, completed its acquisition (Business Combination) of all the outstanding equity securities of SideChannel, Inc., a Massachusetts corporation, pursuant to an Equity Securities Purchase Agreement dated May 16, 2022 (the Purchase Agreement). On September 9, 2022, SideChannel, Inc., the acquired Massachusetts corporation and a subsidiary of the registrant, changed its name to SCS, Inc. (the Subsidiary or SCS) and Cipherloc Corporation, the Delaware parent company of SCS, changed its name to SideChannel, Inc.\nThe transaction was accounted for as a reverse acquisition merger, in accordance with accounting principles generally accepted in the United States of America (GAAP). Under this method of accounting, SCS was deemed to be the accounting acquirer for financial reporting purposes. This determination was primarily based on the facts that, immediately following the Business Combination: (1) the majority of the Board of Directors of the combined company will be composed of directors designated by the Sellers under the terms of the Purchase Agreement; and (2) existing members of SCS management constituted the management of the combined company. Because SCS has been determined to be the accounting acquirer in the Business Combination, but not the legal acquirer, the transaction is deemed a reverse acquisition under the guidance of the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 805, Business Combinations. As a result, the historical financial statements of SideChannel are the historical financial statements of the combined company.\nFollowing the closing of the Business Combination, SCS became a wholly owned subsidiary of the Company. As used herein, the words the Company refers to SideChannel, Inc., together with its subsidiaries.\nBusiness Overview & Strategy\nThe Company is a provider of cybersecurity services and technology to companies; national, state and local municipalities; and non-profits. The Companys website is www.sidechannel.com.\nOur mission is to make cybersecurity easy and accessible for mid-market and emerging companies, a market that we believe is currently underserved. We believe that our cybersecurity offerings will reduce risks for our customers through identifying and developing cybersecurity, privacy, and risk management solutions. We anticipate that our target customers will continue to need cost-effective security solutions beginning with but not limited to what we refer to as virtual Chief Information Security Officer services (vCISO or vCISO Services).\nWe have developed a new software product, Enclave, that we believe offers companies of all sizes the means to simplify several crucial cybersecurity infrastructure procedures, including encryption, microsegmentation and access control. Enclave is a modern network segmentation platform that combines access control, asset inventory, encryption and zero trust network access to create a microsegmentation solution that prioritizes both IT and cybersecuritys highest-level needs. Enclave is purpose-built to:\n● Simultaneously secure and segment networks\n● Limit the damage a bad actor can do by decreasing the digital square footage they can explore\n● Easily implement access controls for employees, support staff, and third-party vendors while never disrupting current operations\nOur strategy focuses on growth from the following three areas:\n1. Securing new vCISO clients\n2. Adding new Cybersecurity Software and Services offerings such as Enclave\n3. Increasing adoption of Cybersecurity Software and Services offerings at vCISO clients, including Enclave\nvCISO engagements typically include a fixed monthly subscription fee with durations longer than twelve (12) months. Rates for vCISO time and material projects range from $350 to $425 per hour. Each of our vCISOs is generally embedded into the C-suite executive teams of two (2) to four (4) of our clients. We augment our vCISO offering with a full range of other cybersecurity services through a team of security engineers combined with a network of third-party service providers and value-added resellers (VARs). Commercial relationships with VARs provide SideChannel with additional internal capabilities to mitigate cybersecurity risks. We earn a commission on software engagements we generate through VARs.\nWe have implemented an account management organization responsible for delivering services and software to our clients. Our vCISOs and the security and privacy engineers that support them are part of our account management organization. As this team delivers vCISO Services for our clients, we often identify projects to implement and maintain programs that reduce cybersecurity risks that expand our scope of work and increase our revenue generating potential. Similarly, as this team delivers a new cybersecurity service or installs cybersecurity software at a client, we often learn about opportunities to improve the protection of our clients digital assets through additional service and software engagements.\nOur vCISO engagements provide our clients with the C-suite cybersecurity leadership needed to effectively mitigate cybersecurity risks and support ongoing operation of critical business functions. This strategic cybersecurity leadership will often result in additional statements of work for SideChannel to deliver the Cybersecurity Software and Services needed to address gaps in our clients cybersecurity framework. We track revenue and other key performance indicators using the vCISO Services category and Cybersecurity Software and Services category. Detail on the revenue performance of these categories is discussed in Managements Discussion and Analysis of Financial Condition and Results of Operations in Part II, Item 7 of this Annual Report on Form 10-K.\nWe currently provide Cybersecurity Software and Services and intend to increase our delivery of more tech-enabled services to address the needs of our customers, including:\n● Additional Virtual Chief Information Security Officers\n● Zero trust\n● Third-party risk management\n● Due diligence\n● Privacy\n● Threat intelligence, and\n● Managed end-point security solutions\nWe believe that our current and prospective customers in the mid-market will favor our approach, as it provides them with an efficient way to work with a single vendor to manage and oversee their cybersecurity programs. We also believe that our approach will reduce our customers overall security costs and streamline their ability to increase their sales, reduce regulatory risks, and monitor their risk posture.\nWe believe that we provide a full range of cybersecurity solutions through our employees, our network of subcontractors, and our array of partnerships with third-party service providers and software companies. We work with our clients to help them select the right cybersecurity tools, products, and solutions. We believe that our use of a combination of employees and subcontractors allows us to cost effectively grow our client base and broaden the subject matter expertise of our service delivery teams while maintaining the agility needed to move directly into implementation of projects, which we believe reduces the risk to our customers. Our subcontractors also provide us with sales leads and referrals and may resell our services to their own client base.\nEnclave, A SideChannel Proprietary Software Product\nWe are developing products and services around our unique insight into mid-market and emerging companies. During September 2022, SideChannel announced a proprietary product, Enclave, which simplifies a particularly important cybersecurity task called microsegmentation. Industry standard cybersecurity and risk management frameworks, such as National Institute of Standards and Technology Cybersecurity Framework (NIST CSF) and Center for Internet Security Controls (CIS), prioritize inventory of assets and access control as top requirements for a sustainable and compliant cybersecurity program. CIS version 8 controls call for organizations to:\n● Control 1 - Establish and maintain an accurate, detailed, and up-to-date inventory of all enterprise assets with the potential to store or process data.\n● Control 2 - Actively manage (inventory, track, and correct) all software (operating systems and applications) on the network so that only authorized software is installed and can execute, and that unauthorized and unmanaged software is found and prevented from installation or execution.\n● Control 3 - Configure data access control lists based on a users need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications.\nWe built Enclave to address these extremely critical cybersecurity controls along with many others. Enclave seamlessly combines access control, microsegmentation, encryption and other secure networking concepts to create a comprehensive solution. Through software it allows Information Technology (IT) to easily segment the enterprise network, place the right staff in those segments and direct traffic. Unlike open, traditional models, Enclave allows for near-limitless micro-segmented networks to operate insulated from one another.\nFurther information about Enclave is available at https://sidechannel.com/enclave/.\nCompany History\nThe Company was incorporated in the State of Texas on June 22, 1953, as American Mortgage Company. During 1996, the Company acquired the operations of Eden Systems, Inc. (Eden), making it a wholly owned subsidiary. Eden was engaged in water treatment and the retailing of cleaning products. Edens operations were sold on October 1, 1997. On May 16, 1996, the Company changed its name to National Scientific Corporation. From September 30, 1997, through the year ended September 30, 2001, the company aimed its efforts in the research and development of semiconductor proprietary technology and processes and in raising capital to fund its operations and research. Effective August 27, 2014, the Company changed its name to Cipherloc Corporation. The Company became a Delaware corporation on September 30, 2021.\nBusiness Combination Between Cipherloc Corporation and SideChannel, Inc. (now known as SCS, Inc.)\nAs part of the Business Combination, the former stockholders of SCS (the Sellers) exchanged all of their equity securities in SCS for a total of 59,900,000 shares of the Companys common stock (the First Tranche Shares), and 100 shares of the Companys newly designated Series A Preferred Stock, $0.001 par value (the Series A Preferred Stock). The In addition the Sellers were entitled to receive up to an additional 59,900,000 shares of the Companys common stock (the Second Tranche Shares and together with the First Tranche Shares and the Series A Preferred Stock, the Shares) at such time that the operations of SCS, as a subsidiary of the Company, achieved at least $5.5 million in revenue (the Milestone) for any twelve-month period occurring after the Closing Date and before the 48-month anniversary of the execution of the Purchase Agreement. The number of the Second Tranche Shares could have been reduced or increased, based upon whether SCS working capital as of the Closing Date is less than or more than zero (Closing Working Capital Adjustment). The number of the Second Tranche Shares was also subject to adjustment based upon any successful indemnification claims made by the parties pursuant to the Purchase Agreement. The Closing Working Capital Adjustment increased the Second Tranche Shares by 2,116,618 shares of common stock. The 100 shares of Series A Preferred Stock were converted to common stock on May 4, 2023.\nThe Shares are subject to a Lock-Up/Leak-Out Agreement, pursuant to which, subject to certain exceptions, the Sellers may not directly or indirectly offer to sell, or otherwise transfer, any of the Shares for twenty-four months after the Closing Date without the prior written consent of the Company. Notwithstanding the foregoing, pursuant to the Lock-Up/Leak-Out Agreement, each of the Sellers may sell up to 20% of their Shares beginning twelve (12) months after the Closing Date, and the remaining 80% of their shares of Common Stock beginning twenty-four (24) months after the Closing Date.\nResearch and Development\nSince Enclave is a proprietary software product, we classify all of our software development activities to be research and development. The success of our software product, Enclave, depends on our ability to provide our customers with reliable, innovative features and benefits that are delivered before, or at least no later than, our competitors. At September 30, 2023, we employed a total of three (3) software engineers engaged in product development. In addition, when the demands of product development exceed the capacity or knowledge of our in-house staff, we retain temporary third-party consultants to assist us.\nOur research and development expenditures for the fiscal years ended September 30, 2023 and September 30, 2022 were $669,000 and $178,000, respectively. These costs were incurred to develop Enclave which is a product acquired in the Business Combination.\nCompetition\nThe cybersecurity software and services market is highly competitive, subject to rapid change, and significantly affected by new product introductions and other activities of market participants.\nSome of our competitors have greater financial, technical, sales, marketing, and other resources than we do. Because of these and other factors, competitive conditions in the markets we operate in are likely to continue to intensify in the future, as participants compete for market share. Increased competition could result in price reductions for our products and services, possibly reducing our net revenue and profit margins and resulting in a loss of our market share, any of which would likely harm our business.\nWe believe that our future results depend largely upon our ability to serve our clients and customers with the products and services described earlier better than our competitors, and by offering new services and product enhancements, whether such product and service offerings are developed internally or through acquisition. We also believe that we must provide product and service offerings that compete favorably against those of our competitors with respect to ease of use, reliability, performance, range of useful features, reputation and price.\nWe anticipate that we will face increasing pricing pressures from our competitors in the future. Since there are low barriers to entry into the cybersecurity services and software markets, we believe competition in these markets will persist and intensify in the future.\nOur chief services competitors include companies such as Optiv, NCC, Coalfire, PwC, EY, Deloitte, and GuidePoint. Our primary software competitors are companies such as Perimeter 81, Zscaler, Palo Alto, and Illumio.\nIntellectual Property\nProtective Measures\nWe believe that our intellectual property is an important and vital asset, which enables us to develop, market, and sell our products and services and enhance our competitive position. Our intellectual property includes our proprietary business and technical know-how, inventions, works of authorship, and confidential information. To protect our intellectual property, we rely primarily upon legal rights in trade secrets, patents, copyrights, and trademarks, in addition to our policies and procedures, security practices, contracts, and relevant operational measures.\nWe protect the confidentiality of our proprietary information by entering into non-disclosure agreements with our employees, contractors, and other entities with which we do business. In addition, our license agreements related to our software and proprietary information include confidentiality terms. These agreements are generally non-transferable. We also employ access controls and associated security measures to protect our facilities, equipment, and networks.\nPatents, Copyrights, Trademarks, and Licenses\nOur products, particularly our software and related documentation, are protected under domestic and international copyright laws and other laws related to the protection of intellectual property and proprietary rights. Currently, we have six patents filed with the U.S. Patent and Trademark Office. We employ procedures to label copyrightable works with the appropriate proprietary rights notices, and we actively enforce our rights in the United States and abroad. However, these measures may not provide us with adequate protection from infringement, and our intellectual property rights may be challenged.\nOur SideChannel and Enclave logos are registered trademarks with the U.S. Patent and Trademark Office. In the United States, we can maintain our trademark rights and renew trademark registrations for as long as the trademarks are in use.\nGovernment Regulation\nExport Control Regulations. We expect that all of our products will be subject to U.S. export control laws and applicable foreign government import, export and/or use requirements. The level of such control generally depends on the nature of the products in question. Often, the level of export control is impacted by the nature of the software and cybersecurity incorporated into our products. In those countries where such controls apply, the export of our products may require an export license or authorization. However, even if a transaction qualifies for a license exception or the equivalent, it may still be subject to corresponding reporting requirements. For the export of some of our products, we may be subject to various post-shipment reporting requirements. Minimal U.S. export restrictions apply to all our products, whether or not they perform cybersecurity functions. If we become a Department of Defense contractor in the future, certain registration requirements may be triggered by our sales. In addition, certain of our products and related services may be subject to the International Traffic in Arms Regulations (ITAR) if our software or services are specifically designed or modified for defense purposes. If we become engaged in manufacturing or exporting ITAR-controlled goods and services (even if we do not export such items), we will be required to register with the U.S. State Department.\nTo date, Export Control Regulations have had no material impact on our business.\nEnhancements to our existing products may be subject to review under the Export Administration Act to determine what export classification they will receive. In addition, any new products that we release in the future will also be subject to such review before we can export them. The U.S. Congress continues to discuss the correct level of export control in possible anti-terrorism legislation. Such export regulations may be modified at any time. Modifications to these export regulations could reduce or eliminate our ability to export some or all of our products from the United States in the future, which could put us at a disadvantage in competing with companies located outside of the U.S. Modifications to U.S. export regulations could restrict us from exporting our existing and future products. Any such modifications to export regulations may put us at a competitive disadvantage with respect to selling our products internationally.\nPrivacy Laws. We may be subject to various international, federal and state regulations regarding the treatment and protection of personally identifying and other regulated information. Applicable laws may include U.S. federal laws and implementing regulations, such as the GLBA and HIPAA, as well as state and international laws and regulations, including the California Consumer Privacy Act (CCPA) and the European Union General Data Protection Regulation (GDPR). Some of these laws have requirements on the transmittal of data from one jurisdiction to another. In the event our systems are compromised, many of these privacy laws require that we provide notices to our customers whose personally identifiable data may have been compromised. Additionally, if we transfer data in violation of these laws, we could be subjected to substantial fines. To mitigate the risk of having such data compromised, we use cybersecurity, software and other security procedures to protect our databases.\nPersonnel\nAs of September 30, 2023, we had 23 full-time employees. We also have approximately 11 independent contractors that provide services to us. We anticipate that we will need to increase our staffing in the foreseeable future. ITEM 1A. RISK FACTORS\nOur business, financial condition and results of operations and the market price for our common stock are subject to numerous risks, many of which are driven by factors that we cannot control or predict. An investment in our common stock involves a high degree of risk. You should carefully consider the following information about these risks, together with the other information contained in this Annual Report on Form 10-K, including the information regarding Forward-Looking Statements earlier in this Form 10-K immediately prior to Part I, Item 1 and Part II, Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations, before investing in our common stock. If any of the events anticipated by the risks described below occur, our results of operations and financial condition could be adversely affected, which could result in a decline in the market price of our common stock, causing you to lose all or part of your investment. Additional risks that we do not yet know of, or that we currently think are immaterial, may also affect our business and results of operations.\nSummary of Risk Factors:\nThe following list provides a summary of risk factors discussed in further detail below:\nRisks Related to Our Financial Position and Need for Capital, including:\n● We have incurred net losses and may never achieve profitability.\n● Our ability to continue as a going concern may depend upon our ability to raise additional capital and such capital may not be available on acceptable terms, or at all.\n● If we can raise additional funding, we may be required to do so on terms that are dilutive to our stockholders.\nRisks Related to Our Business and Results of Operations, including:\n● We depend significantly upon the continued involvement of our present management and on our ability to attract and retain talented employees.\n● Our products and services face significant competition in our markets.\n● We face intense competition in our market, especially from larger, well-established companies, and we may lack sufficient financial or other resources to maintain or improve our competitive position. If we are unable to develop new and enhanced products and services, or if we are unable to continually improve the performance, features, and reliability of our existing products and services, our competitive position would weaken, and our business and operating results could be adversely affected.\n● Our operating results may vary significantly from period to period and have been unpredictable, which has and might continue to cause the market price of our common stock to be volatile.\n● Our future revenue and operating results will depend significantly on our ability to retain clients and customers and the ability to add new clients and customers.\n● A network or data security incident may allow unauthorized access to our or our end users network or data, harm our reputation, create additional liability and adversely impact our financial results.\n● Our services, products, systems, and website and the related data may be subject to intentional disruption that could materially harm our reputation and future sales.\n● Our products are complex and operate in a wide variety of environments, systems and configurations, which could result in failures of our products to function as designed.\n● Outages or problems with systems and infrastructure supplied by third-parties could negatively affect our business, financial condition and financial results.\n● Current global financial conditions have been characterized by increased volatility, which could negatively impact our business, prospects, liquidity and financial condition.\n● If we experience delays and/or defaults in payments, we could be unable to recover all expenditures.\nRisks Related to Our Industry, including:\n● We face intense competition.\n● Delays in product development schedules may adversely affect our revenues.\n● If we do not accurately predict, prepare for, and respond promptly to rapidly evolving technological and market developments, our competitive position, financial results and prospects will be harmed.\n● Actual, possible, or perceived defects or vulnerabilities in our products or services could harm our reputation and divert resources.\nRisks Related to Our Intellectual Property, including:\n● Our proprietary rights may be difficult to enforce.\n● If our end users experience data losses, our brand, reputation and business could be harmed.\n● Claims by others that we infringe their proprietary technology could harm our business.\n● We rely on the availability of third-party licenses.\n● Our use of open-source software could negatively affect us.\nRisks Related to Cyberattacks, including:\n● Cyberattacks and security vulnerabilities could lead to reduced revenue, increased costs, liability claims, or harm to our reputation or competitive position.\n● Security of our information technology may be threatened.\n● Security of our products, services, devices, and customers data may be breached.\n● Development and deployment of defensive measures are ongoing.\n● Disclosure and misuse of personal data could result in liability and harm our reputation.\nRisks Related to Our Common Stock, including:\n● The market price for our common stock has been volatile and our common stock is thinly traded.\n● Substantial sales of our common stock, or the perception that such sales might occur, could depress the market price of our common stock.\n● Holders of our common stock have a risk of potential dilution.\n● The anti-dilutive rights of certain warrants could result in significant dilution to our existing stockholders.\n● Our common stock is subject to restrictions on sales by broker-dealers and penny stock rules.\n● Our common stock is not listed on a national exchange.\nRisks Related to Regulations and Our Compliance with Such Regulations, including:\n● We previously identified material weaknesses in our disclosure controls and procedures and internal control over financial reporting, which have not yet been remediated by us.\n● We are subject to changing laws and regulations.\nRisks Related to Our Contractual Agreements, including:\n● The accounting treatment of the proposed exchange offer of our issued warrants could have a material adverse impact on our financial statements and reduce our net income.\n● The purchase agreement related to our 2021 private placement includes customary covenants that we must comply with, or we may suffer potential monetary and other penalties.\nGeneral Risk Factors, including:\n● Our charter allows us to issue blank check preferred stock and establish its terms, conditions, rights, powers and preferences without stockholder approval.\n● We will continue to incur increased costs as a result of being a reporting company and, given our limited capital resources, such additional costs may have an adverse impact on our profitability.\n● Failure to adequately manage our planned aggressive growth strategy may harm our business or increase our risk of failure.\n● We may apply working capital and future funding to uses that ultimately do not improve our operating results or increase the market price of our securities.\n● Our websites may encounter technical problems and service interruptions.\n● We have never paid or declared any dividends on our common stock.\nRisks Related to Our Financial Position and Need for Capital\nWe have incurred net losses and may never achieve profitability.\nOur likelihood of success must be considered in light of the problems, expenses, difficulties, complications and delays frequently encountered in connection with development of a new business enterprise. Our accumulated deficit as of September 30, 2023, was $18.9 million primarily driven by $11.9 million of one-time charges related to the Business Combination, which closed on July 1, 2022 and the $4.9 million of intangible asset impairment charge during the year ended September 30, 2023.\nWe cannot assure you that that any of our new products and services currently under development will be successfully commercialized, and the extent of our future losses and the timing of any possible profitability, if ever achieved, are highly uncertain. If we are unable to achieve profitability, we may be unable to continue our operations.\nOur ability to continue as a going concern may depend upon our ability to raise additional capital and such capital may not be available on acceptable terms, or at all.\nWe currently believe that our available cash will allow us to fund our operations through at least December 2024. Nevertheless, we may need to raise additional capital to fund operating losses, support future expansion, develop new or enhanced products and services, hire employees, respond to competitive pressures, acquire technologies, or respond to unanticipated events or requirements before then. Our managements plans include attempting to improve our profitability and our ability to generate sufficient cash flow from operations to meet our operating needs on a timely basis, obtaining additional working capital funds through equity and debt financing arrangements, and restructuring on-going operations to eliminate inefficiencies and reduce our expenses. However, we are not assured that these plans and arrangements will be sufficient to fund our ongoing capital expenditures, working capital, and other requirements. The outcome of these actions cannot be predicted at this time. There can be no assurance that any additional financings will be available to us on satisfactory terms and conditions, if at all. If adequate funds are not available on acceptable terms, we may be unable to develop or enhance our products and services, take advantage of future opportunities or respond to competitive pressures or unanticipated requirements, any of which could have a material adverse effect on our business, financial condition and operating results. If we raise additional funds through the issuance of equity securities, or convertible debt, the percentage ownership of our stockholders will be reduced, and holders may experience dilution in net book value per share.\nThe amount of capital we may need depends on many factors, including the progress, timing, scope and market acceptance of our product development programs; the time and cost required to obtain any necessary regulatory approvals; our ability to enter into and maintain collaborative, licensing and other commercial relationships; and our ability to secure commitment of time and resources from third-parties to the development and commercialization of our products.\nThe capital markets have been unpredictable for unprofitable companies such as ours. The amount of capital that we may be able to raise depends on variables that are beyond our control. As a result, we may not be able to secure financing on terms acceptable to us, or at all. Even if we are able to consummate a financing arrangement, the amount raised may not be sufficient to meet our future needs. If adequate funds are not available on acceptable terms, or at all, our business, including our results of operations, financial condition and our continued viability will be materially adversely affected.\nIf we can raise additional funding, we may be required to do so on terms that are dilutive to our stockholders.\nOur future issuances of new equity may dilute the ownership percentage of our existing stockholders. The extent of such dilution will depend on the number of shares issued. Neither the amount of funds that may be received in such an equity financing, nor the price per share of our equity securities issued are known at this time.\nRisks Related to Our Business and Results of Operations\nInflation and geo-political events increase the risk that we are unable to achieve and maintain profitable operations.\nInflation may cause our costs to increase, which we may not be able to pass onto customers. Inflation may also impact our customers profitability and the budgets they have available to spend on cybersecurity and other products we offer. The wars in Ukraine and the Middle East and tensions between China and the US could have impacts on many variables that impact our business or our customers businesses.\nWe depend significantly upon the continued involvement of our present management and on our ability to attract and retain talented employees.\nOur success depends significantly upon our present management, who are involved in our strategic planning and operations. Our business requires that we successfully attract and retain talented employees and contractors. The competition for individuals with expertise in our industry is intense, and we cannot assure that such individuals will be available to us on acceptable terms, or at all.\nIf we are less successful in our recruiting efforts, or if we are unable to retain key existing employees, our ability to develop and deliver successful products and services will be adversely affected. Effective succession planning is also important to our long-term success. Our failure to ensure effective transfer of knowledge and smooth transitions involving key employees could hinder our strategic planning and execution.\nOur products and services face significant competition in our markets, and if they do not compete successfully, our business will suffer.\nOur current and proposed products and services face, and will continue to face, intense competition from larger and smaller companies, as well as from academic and research institutions. We compete in an industry that is characterized by: (i) rapid technological change, (ii) evolving industry standards, (iii) emerging competition, and (iv) new service and product introductions. Our competitors have existing products and technologies that will compete with our products and technologies and may develop and commercialize additional products and technologies that will compete with our products and technologies. Some of these new products and services may have functionality that ours do not have. Because many competing companies and institutions have greater financial resources than us, they may be able to: (i) provide broader services and product lines, and (ii) fully develop and deploy new products faster than we can with their larger and broader resources. Our competitors also generally have greater development capabilities than we do and have greater experience in undertaking testing of products, obtaining regulatory approvals, and manufacturing and marketing their products. They also have greater name recognition and better access to customers, clients, licensees, and resellers than we do. Our chief services competitors include companies such as Optiv, NCC, Coalfire, PwC, EY, Deloitte, and GuidePoint. Our primary product competitors for Enclave are companies such as Perimeter 81, Zscaler, Palo Alto, and Illumio.\nIf we are unable to develop new and enhanced products and services, or if we are unable to continually improve the performance, features, and reliability of our existing products and services, our competitive position would weaken, and our business and operating results could be adversely affected.\nOur future success depends on our ability to effectively respond to evolving threats to consumers and potential customers, as well as competitive technological developments and industry changes, by developing or introducing new and enhanced products and services on a timely basis. In the past, Cipherloc has incurred significant research and development expenses. As a result of the Business Combination, we expect to continue to incur research and development expenses as we strive to remain competitive and as we focus on organic growth through internal innovation. If we are unable to anticipate or react to competitive challenges or if existing or new competitors gain market share in any of our markets, our competitive position would weaken, and we could experience a decline in our revenues and net income, which could adversely affect our business and operating results. Additionally, we must continually address the challenges of dynamic and accelerating market trends, increasingly sophisticated cyber-attacks and intrusions and competitive developments. Customers may require features and capabilities that our current products do not have. Our failure to develop new products and improve our existing products to satisfy customer preferences and needs and effectively compete with other market offerings in a timely and cost-effective manner will harm our ability to retain our customers (if any) and the ability of our licensees or resellers to retain their customers, and to create or increase demand for our products, which may adversely impact our operating results. The development and introduction of our new or enhanced products will involve a significant commitment of time and resources and will be subject to a number of risks and challenges, including but not limited to:\n● Lengthy development cycles;\n● Evolving industry and regulatory standards and technological developments by our competitors and customers (if any) and the customers of our licensees and resellers;\n● Rapidly changing customer preferences and needs;\n● Evolving platforms, operating systems, and hardware products, such as mobile devices, and related product and service interoperability challenges;\n● Entering into new or unproven markets; and\n● Executing new product and service strategies.\nIf we are not successful in managing these risks and challenges, or if our new or improved products and services are not technologically competitive in the market, or do not achieve market acceptance, our business and operating results would be adversely affected, our market share would decline, and our margins would contract.\nOur operating results may vary significantly from period to period and have been unpredictable, which has and might continue to cause the market price of our common stock to be volatile.\nOur operating results, in particular, our revenues, gross margins, operating margins, and operating expenses, have historically varied significantly from period to period, and we expect such variation to continue as a result of a number of factors, many of which are outside of our control and may be difficult to predict, including:\n● our ability to attract and retain customers (if any) and/or the ability of our licensees and resellers to retain customers or sell products and services;\n● the budgeting cycles, seasonal buying patterns, and purchasing practices of potential customers and customers of our licensees and resellers;\n● price competition;\n● the timing and success of our new product and service introductions by us or our competitors or any other change in the competitive landscape of our industry, including consolidation among our competitors, licensees, resellers, clients, or customers, and strategic relationships entered into by and between our competitors;\n● changes in the mix of our services, products, and support;\n● changes in the growth rate of the cybersecurity technology market;\n● the timing and costs related to the development or acquisition of technologies or businesses or strategic partnerships;\n● lack of synergy, or the inability to realize expected synergies, resulting from any acquisitions or strategic partnerships;\n● our inability to execute, complete or integrate efficiently any acquisitions that we have or may hereafter undertake;\n● increased expenses, unforeseen liabilities, or write-downs and any impact on our operating results from any acquisitions we may consummate;\n● our ability to create sizeable and productive distribution channels for our proprietary software;\n● decisions by potential customers, or the customers of our licensees and resellers, to purchase cybersecurity solutions from larger, more established cybersecurity software and service vendors, or from their sales channel partners;\n● timing of revenue recognition from the delivery of existing and future statements of work;\n● Insolvency or credit difficulties confronting customers (if any), our licensees and resellers, or the customers of our licensees and resellers, which could adversely affect their ability to purchase or pay for our products and services and offerings;\n● the cost and potential outcomes of any litigation, which could have a material adverse effect on our business;\n● seasonality or cyclical fluctuations in our markets due to holiday schedules, industry events, or customer funding policies that may impact our ability to secure new clients or deliver services to existing clients;\n● future accounting pronouncements or changes in our accounting policies, including the potential impact of the adoption and implementation of the Financial Accounting Standards Boards new standard regarding revenue recognition; and\n● general macroeconomic conditions including interest rates, inflation and increasing labor costs, in some or all regions in which we operate.\nAny one of the factors above, or the cumulative effect of some of the factors referred to above, may result in significant fluctuations in our operating results including our revenue and net income. This variability and unpredictability could result in our failure to meet our revenue, margin, or other operating result expectations, or those of securities analysts or investors for a particular period. If we fail to meet or exceed such expectations for these or any other reasons, the market price of our common stock could decline substantially, and we could face costly lawsuits, including securities class action suits.\nWe face intense competition in our market, especially from larger, well-established companies, and we may lack sufficient financial or other resources to maintain or improve our competitive position.\nThe market for cybersecurity technologies is intensely competitive, and we expect competition to increase in the future from established competitors and new market entrants. Our main competitors fall into three categories:\n● large companies that incorporate security or encryption features in their services and products, such as Googles Cloud Platform, Amazons AWS services, and Microsofts Azure, or those that have acquired, or may acquire, cybersecurity services, products, or technologies and have the technical and financial resources to bring competitive solutions to the market;\n● independent security vendors, such as Optiv and Coalfire, that offer cybersecurity products; and\n● small and large companies that offer cybersecurity services and technologies that compete with our services and products.\nMany of our existing competitors have, and some of our potential competitors may have, substantial competitive advantages such as:\n● greater name recognition and longer operating histories;\n● larger sales and marketing budgets and resources;\n● broader distribution and established relationships with distributors and customers (if any), or the customers of our licensees and resellers;\n● greater customer support resources;\n● greater resources to make strategic acquisitions or enter strategic partnerships; and\n● greater financial, technical, and other resources.\nIn addition, some of our larger competitors have substantially broader and more diverse product and service offerings, which may make them less susceptible to downturns in a particular market and allow them to leverage their relationships based on other services and products or incorporate functionality into existing services and products to gain business in a manner that discourages users from purchasing our services, products and subscriptions, including through selling at zero or negative margins, offering concessions, product bundling, or closed technology platforms. Many of our smaller competitors that specialize in providing protection from a single type of security threat are often able to deliver these specialized cybersecurity or security products to the market more quickly than we can.\nOrganizations that use legacy products and services may believe that these products and services are sufficient to meet their security needs, or that our platform only serves the needs of a portion of the cybersecurity technology market. Accordingly, many organizations have invested substantial personnel and financial resources to design and operate their networks and have established deep relationships with other providers of cybersecurity services and products. As a result, these organizations may prefer to purchase from their existing suppliers rather than add or switch to a new supplier such as us, regardless of product performance, features, or greater services offerings, or may be more willing to incrementally add solutions to their cybersecurity infrastructure from existing suppliers than to replace it wholesale with our solutions.\nConditions in our market could change rapidly and significantly because of technological advancements, partnering or acquisitions by our competitors, or continuing market consolidation. New start-up companies that innovate and large competitors that are making significant investments in research and development may invent similar or superior services, products, and technologies that compete with our services and products. Some of our competitors have made or could make acquisitions of businesses that may allow them to offer more directly competitive and comprehensive solutions than they had previously offered and adapt more quickly to innovative technologies and changing needs. Our current and potential competitors may also establish cooperative relationships among themselves or with third-parties that may further enhance their resources and reduce their expenses. These competitive pressures in our market or our failure to compete effectively may result in price reductions, fewer orders, reduced revenue and gross margins, and loss of market share. Any failure to meet and address these factors could materially harm our business and operating results.\nOur future revenue and operating results will depend significantly on our ability to retain clients and customers and the ability to add new clients and customers. Any decline in our retention rates or failure to add new clients and customers will harm our business prospects and operating results.\nWe anticipate that our future revenue and operating results will depend significantly on our ability to retain clients and customers and our ability add new clients and customers. In addition, we may not be able to predict or anticipate accurately future trends in retention or effectively respond to such trends. Our retention rates may decline or fluctuate due to a variety of factors, including the following:\n● our clients and customers levels of satisfaction or dissatisfaction with our products and services;\n● the quality, breadth, and prices of our products and services;\n● our general reputation and events impacting that reputation;\n● the products and services and related pricing offered by our competitors;\n● disruption by new services or changes in law or regulations that impact the need for or efficacy of our products and services;\n● our customer service activities and responsiveness to any customer issues;\n● customer dissatisfaction if they do not receive the full benefit of our services due to their failure to provide all relevant data;\n● customer dissatisfaction with the methods or sufficiency of our remediation services; and\n● changes in target customers planned spending levels as a result of general economic conditions or other factors such as inflation.\nIf we do not retain our existing clients and customers, or add new clients and customers, we may not generate revenue and/or our revenue may grow more slowly than expected, or decline, and our operating results and gross margins will be negatively impacted. In addition, our business and operating results may be harmed if we are unable to increase our retention rates or if they decline.\nWe also must continually add new clients and customers, both to replace those who cancel or elect not to renew their agreements with us and to grow our business beyond our current level. If we are unable to attract new clients and customers in numbers greater than number that cancel or elect not to renew their agreements with us, our client base will decrease, and our business, operating results, and financial condition would be adversely affected.\nA network or data security incident may allow unauthorized access to our or our end users network or data, harm our reputation, create additional liability and adversely impact our financial results.\nIncreasingly, companies are subject to a wide variety of attacks on their networks on an ongoing basis. In addition to traditional computer hackers malicious code (such as viruses and worms), phishing attempts, employee theft or misuse, and denial of service attacks, sophisticated nation-state and nation-state supported actors engage in intrusions and attacks (including advanced persistent threat intrusions) and add to the risks to internal networks, cloud deployed enterprise and customer-facing environments and the information they store and process. Despite significant efforts to create security barriers to such threats, it is virtually impossible for us to entirely mitigate these risks. We, and our third-party software and service providers, may face security threats and attacks from a variety of sources. Our data, corporate systems, third-party systems and security measures and/or those of our licensees, resellers, clients, customers, software providers, independent contractors, employees, end users may be breached due to the actions of outside parties, employee error, malfeasance, a combination of these, or otherwise, and, as a result, an unauthorized party may obtain access to our or our customers data. Furthermore, as a provider of cybersecurity technologies, we may be a more attractive target for such attacks. A breach in our data security or an attack against our service availability, or that of our third-party service providers, could impact our networks or networks secured by our services, products and subscriptions, creating system disruptions or slowdowns and exploiting security vulnerabilities of our services, products, and the information stored on our networks or those of our third-party service providers could be accessed, publicly disclosed, altered, lost, or stolen, which could subject us to liability and cause us financial harm. Any actual or perceived breach of network security in our systems or networks, or any other actual or perceived data security incident we or our third-party service providers suffer, could result in damage to our reputation, negative publicity, loss of channel partners, licensees, resellers, clients, customers, and sales, loss of competitive advantages over our competitors, increased costs to remedy any problems and otherwise respond to any incident, regulatory investigations and enforcement actions, costly litigation, and other liability. In addition, we may incur significant costs and operational consequences of investigating, remediating, eliminating, and putting in place additional tools and devices designed to prevent actual or perceived security incidents, as well as the costs to comply with any notification obligations resulting from any security incidents. Any of these negative outcomes could adversely impact the market perception of our services, products and customer and investor confidence in our company and, moreover, could seriously harm our business or operating results.\nIt is essential to our business strategy that our technology and network infrastructure remain secure and are perceived by any clients and customers we have, and others, to be secure. Despite security measures, however, any network infrastructure may be vulnerable to cyber-attacks by hackers and other security threats. We may face cyber-attacks that attempt to penetrate our network security, sabotage or otherwise disable our research, products and services, misappropriate our proprietary information, or that of our licensees and resellers, or their or our customers and partners, which may include personally identifiable information, or cause interruptions of our internal systems and services. Any cyber-attacks could negatively affect our reputation, damage our network infrastructure and our ability to deploy our products and services, harm our business relationships, and expose us to financial liability.\nOur services, products, systems, and website and the data on these sources may be subject to intentional disruption that could materially harm our reputation and future sales.\nDespite our precautions and ongoing investments to protect against security risks, data protection breaches, cyber-attacks, and other intentional disruptions of our products and services, we expect to be an ongoing target of attacks specifically designed to impede the performance and availability of our offerings and harm our reputation as a company. Similarly, experienced computer programmers or other sophisticated individuals or entities, including malicious hackers, state-sponsored organizations, and insider threats including actions by employees and third-party service providers, may attempt to penetrate our network security or the security of our systems and websites and misappropriate proprietary information or cause interruptions of our services. This risk has increased as more individuals are working from home and utilize home networks for the transmission of sensitive information. Such attempts are increasing in number and in technical sophistication, and if successful could expose us and the affected parties, to risk of loss or misuse of proprietary or confidential information or disruptions of our business operations. While we engage in a number of measures aimed to protect against security breaches and to minimize problems if a data breach were to occur, our information technology systems and infrastructure may be vulnerable to damage, compromise, disruption, and shutdown due to attacks or breaches by hackers or due to other circumstances, such as error or malfeasance by employees or third-party service providers or technology malfunction. The occurrence of any of these events, as well as a failure to promptly remedy these events should they occur, could compromise our systems, and the information stored in our systems could be accessed, publicly disclosed, lost, stolen, or damaged. Any such circumstance could adversely affect our ability to attract and maintain licensees and resellers, and/or for us or our licensees and resellers to retain customers, as well as strategic partners, cause us to suffer negative publicity, and subject us to legal claims and liabilities or regulatory penalties. In addition, unauthorized parties might alter information in our databases, which would adversely affect both the reliability of that information and our ability to market and perform our services. Techniques used to obtain unauthorized access or to sabotage systems change frequently, are constantly evolving and generally are difficult to recognize and react to effectively. We may be unable to anticipate these techniques or to implement adequate preventive or reactive measures. Several recent, highly publicized data security breaches at other companies have heightened consumer awareness of this issue and may embolden individuals or groups to target our systems or those of our licensees, resellers, or strategic partners, or our or their customers.\nOur products are complex and operate in a wide variety of environments, systems and configurations, which could result in failures of our products to function as designed and negatively impact our brand recognition and reputation.\nBecause we offer very complex products, errors, defects, disruptions, or other performance problems with our products may and have occurred. For example, we may experience disruptions, outages, and other performance problems due to a variety of factors, including infrastructure changes, human or software errors, capacity constraints due to an overwhelming number of users accessing our websites simultaneously, fraud, or security attacks. In some instances, we may not be able to identify the cause or causes of these performance problems within an acceptable period of time. Interruptions in our products could impact our revenues or cause licensees, resellers, clients, and customers to cease doing business with us. Our operations are dependent upon our ability to protect our technology infrastructure against damage from business continuity events that could have a significant disruptive effect on our operations. We could potentially lose end user/customer data or experience material adverse interruptions to our operations or delivery of products and services to our clients in a disaster recovery scenario. Further, our business would be harmed if any of these types of events caused our licensees, resellers, or customers, or our licensees and resellers customers or potential customers, to believe that our products are unreliable. We believe that our brand recognition and reputation are critical to retaining existing licensees, resellers, clients and customers, and attracting new licensees, resellers, clients, and customers. Furthermore, negative publicity, whether or not justified, relating to events or activities attributed to us, our employees, our strategic partners, our affiliates, or others associated with any of these parties, may tarnish our reputation and reduce the value of our brands. Damage to our reputation may reduce demand for our products and have an adverse effect on our business, operating results, and financial condition. Moreover, any attempts to rebuild our reputation and restore the value of our brands after such an event may be costly and time consuming, and such efforts may not ultimately be successful.\nIf our products and services do not work properly, our business, financial condition and financial results could be negatively affected, and we could experience negative publicity, declining sales, and legal liability.\nWe produce complex products that incorporate leading-edge technology that must operate in a wide variety of technology environments. Software may contain defects or bugs that can interfere with expected operations in these varying technological environments. There can be no assurance that our testing programs will be adequate to detect all defects prior to the product being introduced, which might decrease customer satisfaction with our products and services. The product reengineering cost to remedy a product defect could be material to our operating results. Our inability to cure a product defect could result in the temporary or permanent withdrawal of a product or service, negative publicity, damage to our reputation, failure to achieve market acceptance, lost revenue and increased expense, any of which could have a material adverse effect on our business, financial condition and financial results.\nOutages or problems with systems and infrastructure supplied by third-parties could negatively affect our business, financial condition and financial results.\nOur business relies on third-party suppliers of the telecommunications infrastructure. We, our clients and customers and our licensees and resellers, and their customers, will use various communications service suppliers and the global internet to provide network access between our data centers and our customers and end-users of our services. If those suppliers do not enable us to provide our clients and customers, or our licensees and resellers customers with reliable, real-time access to our systems (to the extent required), we may be unable to gain or retain clients, customers, licensees and resellers. These suppliers periodically experience outages or other operational problems as a result of internal system failures or external third-party actions. Supplier outages or other problems could materially adversely affect our business, financial results and financial condition.\nCurrent global financial conditions have been characterized by increased volatility, which could negatively impact our business, prospects, liquidity and financial condition.\nCurrent global financial conditions and recent market events have been characterized by increased volatility, and the resulting tightening of the credit and capital markets has reduced the amount of available liquidity and overall economic activity. We cannot guarantee that debt or equity financing, or the ability to generate cash from operations, will be available or sufficient to meet or satisfy our initiatives, objectives or requirements. Our inability to access sufficient amounts of capital on terms acceptable to us for our operations will negatively impact our business, prospects, liquidity and financial condition.\nIf we experience delays and/or defaults in payments, we could be unable to recover all expenditures.\nBecause of the nature of our contracts, at times we will commit resources to projects prior to receiving payments from the counterparty in amounts sufficient to cover our expenditures on projects as they are incurred. Delays in payments may require us to make a working capital investment. Defaults by any of our clients, customers, licensees, and resellers could have a significant adverse effect on our revenues, profitability and cash flow. Our clients, customers, licensees, and resellers may in the future default on their obligations to us or them due to bankruptcy, lack of liquidity, operational failure or other reasons deriving from the current general economic environment. If a client, customer, or licensee defaults on its obligations to us or our licensee, or a licensee or reseller defaults in its payments to us, it could have a material adverse effect on our business, financial condition, results of operations or cash flows.\nRisks Related to Our Industry\nWe face intense competition.\nWe expect to experience intense competition across all markets for our products and services. Our competitors that are focused on narrower product lines may be more effective in devoting technical, marketing, and financial resources to compete with us. In addition, barriers to entry in our businesses generally are low, and products and services, once developed, can be distributed broadly and quickly at a relatively low cost. Open-source software vendors are devoting considerable efforts to developing software that mimics the features and functionality of our current and anticipated products. These competitive pressures may result in decreased sales volumes, price reductions, and/or increased operating costs, such as for marketing and sales incentives, resulting in lower revenue, gross margins, and operating income.\nDelays in product development schedules may adversely affect our revenues.\nThe development of cybersecurity products and services is a complex and time-consuming process. New products and services can require long development and testing periods. Future revenues may include the sale of new products and services that may not yet be developed. Significant delays in product development, including quality assurance testing or significant problems in creating new products and services, could adversely affect our revenue recognition from new products and services. Revenue in certain reporting periods could be lower than anticipated because product development problems could cause the loss of a competitive sale transaction, a delay in invoicing a client, customer, licensee, or reseller or the renegotiation of terms to retain a sale transaction.\nIf we do not accurately predict, prepare for, and respond promptly to rapidly evolving technological and market developments and successfully manage product introductions and transitions to meet changing needs in the cybersecurity technology market, our competitive position, financial results, and prospects will be harmed.\nThe cybersecurity technologies market has grown quickly and is expected to continue to evolve rapidly. Moreover, many of our potential licensees and resellers and their customers operate in markets characterized by rapidly changing technologies and business plans, which require them to add numerous network access points and adapt increasingly complex enterprise networks, incorporating a variety of hardware, software applications, operating systems, and networking protocols. If we fail to accurately predict potential changing needs and emerging technological trends in the cybersecurity technology industry, including in the areas of mobility, virtualization, and cloud computing, our business could be harmed. If we experience unanticipated delays in the availability of new services, products, platform features, and subscriptions, or fail to meet expectations for such availability, our competitive position, financial results, and business prospects will be harmed.\nAdditionally, we must commit significant resources to developing new products and services before knowing whether our investments will result in services, products, subscriptions, and features that the market will accept. The success of new platform features depends on several factors, including appropriate new product definition, differentiation of new services, products, subscriptions, and platform features from those of our competitors, and market acceptance of these products, services and platform features. Moreover, successful new product introduction and transition depends on a number of factors including, our ability to manage the risks associated with new product production ramp-up issues, the availability of application software for new products, and the risk that new products may have quality or other defects or deficiencies, especially in the early stages of introduction. We cannot assure you that we will successfully identify opportunities for new products and services, develop and bring new products and subscriptions to market in a timely manner, or achieve market acceptance of our products and subscriptions, or that products, subscriptions, and technologies developed by others will not render our products, subscriptions, or technologies obsolete or noncompetitive.\nActual, possible, or perceived defects or vulnerabilities in our products or services, the failure of our products or services to detect or prevent a security breach or the misuse of our products could harm our reputation and divert resources.\nBecause our products and services are complex, they may contain defects or errors that are not detected until after their commercial release and deployment. Defects or vulnerabilities may impede or block network traffic, cause our products or services to be vulnerable to electronic break-ins or cause them to fail to help secure networks. We are also susceptible to errors, defects, vulnerabilities, or attacks that may arise at, or be inserted into our products, which are out of our control. Different users deploy and use cybersecurity products in different ways, and certain deployments and usages may subject our products to adverse conditions that may negatively impact the effectiveness and useful lifetime of our products. Our networks and products, including any cloud-based technology we utilize, could be targeted by attacks specifically designed to disrupt our business and harm our reputation. Our products may not prevent all security threats. Because the techniques used by computer hackers to access or sabotage networks change frequently and generally are not recognized until launched against a target, we may be unable to anticipate these techniques. An actual, possible, or perceived security breach or infection of the network of one of the users of our products, regardless of whether the breach is attributable to the failure of our products or services to prevent the security breach, could adversely affect the markets perception of our security products and services and, in some instances, subject us to potential liability that is not contractually limited. We may not be able to correct any security flaws or vulnerabilities promptly, or at all. Our products may also be misused by potential end users or third-parties who obtain access to our products. For example, our products could be used to censor private access to certain information on the internet. Such use of our products for censorship could result in negative press coverage and negatively affect our reputation, even if we take reasonable measures to prevent any improper shipment of our products or if our products are being used improperly or provided by an unauthorized third-party.\nAny actual, possible, or perceived defects, errors or vulnerabilities in our products and services, or misuse of our products and services, could result in:\n● the expenditure of significant financial and development resources in efforts to analyze, correct, eliminate or work around errors or defects or to address and eliminate vulnerabilities;\n● the loss of potential clients, customers, licensees, resellers, or distribution partners;\n● delayed or lost revenue;\n● delay or failure to attain market acceptance;\n● negative publicity and harm to our reputation; and\n● litigation, regulatory inquiries, or investigations that may be costly and harm our reputation and, in some instances, subject us to potential liability that is not contractually limited.\nRisks Related to Our Intellectual Property\nOur proprietary rights may be difficult to enforce, which could enable others to copy or use aspects of our products without compensating us.\nWe rely primarily on patent, trademark, copyright and trade secrets laws and confidentiality procedures and contractual provisions to protect our technology. The claims eventually allowed on any patents issued in the future may not be sufficiently broad to protect our technology or products. Any issued patents may be challenged, invalidated or circumvented, and any rights granted under these patents may not actually provide adequate offensive scope, defensive protection or competitive advantages to us. Patent applications in the United States are typically not published until at least 18 months after filing, or, in some cases, not at all, and publications of discoveries in industry-related literature lag behind actual discoveries. We cannot be certain that we were the first to make the inventions claimed in our pending patent applications, or that we were the first to file for patent protection. Additionally, the process of obtaining patent protection is expensive and time-consuming, and we may not be able to prosecute all necessary or desirable patent applications at a reasonable cost or in a timely manner. In addition, recent changes to the patent laws in the United States, including but not limited to adversary proceedings, first to file, and post-grant review provisions, may bring into question the validity of certain software patents and may make it more difficult and costly to prosecute patent applications. As a result, we may not be able to obtain adequate patent protection or effectively enforce our issued patents.\nDespite our efforts to protect our proprietary rights, unauthorized parties may attempt to copy aspects of our products or obtain and use information that we regard as proprietary. We generally enter into confidentiality or non-solicitation agreements with our employees, consultants, and vendors, as the case may be, and generally limit access to and distribution of our proprietary information. However, we cannot guarantee that the steps taken by us will prevent misappropriation of our technology. Policing unauthorized use of our technology or products is difficult. In addition, the laws of some foreign countries do not protect our proprietary rights to as great an extent as the laws of the United States, and many foreign countries do not enforce these laws as diligently as government agencies and private parties in the United States. From time to time, legal action by us may be necessary to enforce our patents and other intellectual property rights, to protect our trade secrets, to determine the validity and scope of the proprietary rights of others or to defend against claims of infringement or invalidity. Such litigation could result in substantial costs and diversion of resources and could negatively affect our business, operating results and financial condition. If we are unable to protect our proprietary rights (including aspects of our software and products protected other than by patent rights), we may find ourselves at a competitive disadvantage to others who need not incur the additional expense, time and effort required to create the innovative products that would compete with our products.\nIf our end users experience data losses, our brand, reputation and business could be harmed.\nA breach of our end users network security and systems, or other events that cause the loss or public disclosure of, or access by third-parties to, our end users files or data, could have serious negative consequences for our business, including reduced demand for our services, an unwillingness of our clients and customers, and our licensees and resellers or their customers to use our products or services, harm to our brand and reputation. The techniques used to obtain unauthorized access, disable or degrade service, or sabotage systems change frequently, often are not recognized until launched against a target, and may originate from less regulated or remote areas around the world. As a result, our end users may be unable to proactively prevent these techniques, implement adequate preventative or remedial measures, or enforce the laws and regulations that govern such activities. If our end users experience any data loss, data disruption, or any data corruption or inaccuracies, whether caused by security breaches or otherwise, our brand, reputation and business could be harmed.\nOur insurance may not be available now or in the future on acceptable terms, or at all. In addition, our policy may not cover claims against us for loss of data or other indirect or consequential damages. Defending a suit based on any data loss or system disruption, regardless of its merit, could be costly and divert our managements attention.\nClaims by others that we infringe their proprietary technology or other litigation matters could harm our business.\nPatent and other intellectual property disputes are common in the cybersecurity and technology industries. Third-parties may in the future assert claims of infringement of intellectual property rights against us. They may also assert such claims against our licensees, resellers, end users or distribution partners whom we may have to indemnify against claims that our products infringe the intellectual property rights of third-parties. As the number of products and competitors in our market increases and overlaps in service and functionality occur, infringement claims may increase. Any claim of infringement by a third-party, even those without merit, could cause us to incur substantial costs defending against the claim and could distract our management from our business. In addition, litigation may involve patent holding companies, non-practicing entities, or other adverse patent owners who have no relevant product revenue and against whom our own patents may therefore provide little or no deterrence to such plaintiffs we will counter-claim for infringement and invalidation of their patent(s).\nAlthough third-parties may offer a license to their technology, the terms of any offered license may not be acceptable, and the failure to obtain a license or the costs associated with any license could cause our business, financial condition and results of operations to be materially and adversely affected. In addition, some licenses may be non-exclusive and, therefore, our competitors may have access to the same technology licensed to us. Alternatively, we may be required to develop non-infringing technology, which could require significant time, effort, and expense, and may ultimately not be successful. Furthermore, a successful claimant could secure a judgment, or we may agree to a settlement that prevents us from distributing certain products or performing certain services or that requires us to pay substantial damages (including treble damages if we are found to have willfully infringed such claimants patents), royalties or other fees. Any of these events could seriously harm our business, financial condition and results of operations.\nWe may be subject to lawsuits claiming patent infringement. We may also be subject to other litigation in addition to patent infringement claims, such as employment-related litigation and disputes, as well as general commercial litigation, and could become subject to other forms of litigation and disputes, including stockholder litigation. If we are unsuccessful in defending any such claims, our operating results and financial condition and results may be materially and adversely affected. For example, we may be required to pay substantial damages and could be prevented from selling certain of our products. Litigation, with or without merit, could negatively impact our business, reputation and sales in a material adverse fashion.\nWe rely on the availability of third-party licenses and our inability to maintain those licenses could harm our business.\nMany of our products or products under development include software or other intellectual property licensed from third-parties. It may be necessary in the future to renew licenses relating to various aspects of these products or to seek new licenses for existing or new products. Licensors may claim we owe them additional license fees for past and future use of their software and other intellectual property or that we cannot utilize such software or intellectual property in our products going forward. There can be no assurance that the necessary licenses would be available on acceptable terms, if at all.\nThe inability to obtain certain licenses or other rights or to obtain such licenses or rights on favorable terms or for reasonable pricing, or the need to engage in litigation regarding these matters, could result in delays in product releases until equivalent technology can be identified, licensed or developed, if at all, and integrated into our products. Further such events may result in significant license fees and have a material adverse effect on our business, operating results, and financial condition. Moreover, the inclusion in our products or software or other intellectual property licensed from third-parties on a non-exclusive basis or the inclusion in our products of opensource software may limit our ability to differentiate our products from those of our competitors. Not differentiating our products from those of our competitors may adversely affect our results of operations, including reducing our revenue and net income.\nWe also rely on technologies licensed from third-parties in order to operate functions of our business. If any of these third-parties allege that we have not properly paid for such licenses or that we have improperly used the technologies under such licenses, we may need to pay additional fees or obtain new licenses, and such licenses may not be available on terms acceptable to us or at all or may be costly. In any such case, or if we were required to redesign our internal operations to function with new technologies, our business, results of operations and financial condition could be harmed.\nOur use of open-source software in our products could negatively affect our ability to sell our products and subject us to possible litigation.\nOur current products, and/or those under development, contain software modules licensed to or used by us from third-party authors under open-source licenses. Some open-source licenses contain requirements that we make available applicable source code for modifications or derivative works we create based upon the type of open-source software we use. If we combine our proprietary software with open-source software in a certain manner, we could be required to release the source code of our proprietary software to the public under certain open-source licenses. This would allow our competitors to create similar products with lower development effort and time, and ultimately could result in a loss of product sales for us.\nAlthough we monitor our use of open-source software to avoid subjecting our products and subscriptions to conditions we do not intend, the terms of many open-source licenses have not been interpreted by United States courts, and there is a risk that these licenses could be construed in a way that could impose unanticipated conditions or restrictions on our ability to commercialize our products. From time to time, there have been claims against companies that distribute or use open-source software in their products, asserting that open-source software infringes the claimants intellectual property rights. We could be subject to suits by parties claiming infringement of intellectual property rights in what we believe to be licensed open-source software. If we are held to have breached the terms of an open-source software license, we could be required to seek licenses from third-parties to continue offering our products on terms that are not economically feasible, to reengineer our products, to discontinue the sale of our products if reengineering could not be accomplished on a timely basis, or to make generally available, in source code form, our proprietary code, any of which could adversely affect our business, operating results, financial condition and ability to differentiate our products and services.\nIn addition to risks related to license requirements, usage of open-source software can lead to greater risks than use of third-party commercial software, as open-source licensors generally do not provide warranties or assurance of title or controls on origin of the software. In addition, many of the risks associated with usage of open-source software, such as the lack of warranties or assurances of title, cannot be eliminated, and could, if not properly addressed, negatively affect our business. We have established processes to help alleviate these risks, including a review process for screening requests from our development organizations for the use of open-source software, but we cannot be sure that our processes for controlling our use of open-source software in our products will be effective.\nCyberattacks and security vulnerabilities could lead to reduced revenue, increased costs, liability claims, or harm to our reputation or competitive position.\nSecurity of our information technology may be threatened.\nThreats to IT security can take a variety of forms. Individual and groups of hackers and sophisticated organizations, including state-sponsored organizations or nation-states, continuously undertake attacks that pose threats to our customers and our IT. These actors may use a wide variety of methods, which may include developing and deploying malicious software or exploiting vulnerabilities or intentionally designed processes in hardware, software, or other infrastructure in order to attack our products and services or gain access to our networks and datacenters, using social engineering techniques to induce our employees, users, partners, or customers to disclose passwords or other sensitive information or take other actions to gain access to our data or our users or customers data, or acting in a coordinated manner to launch distributed denial of service or other coordinated attacks. Nation-state and state-sponsored actors can deploy significant resources to plan and carry out attacks. Nation-state attacks against us, our customers, or our partners may intensify during periods of intense diplomatic or armed conflict, such as the ongoing conflict in Ukraine. Inadequate account security or organizational security practices may also result in unauthorized access to confidential data. For example, system administrators may fail to timely remove employee account access when no longer appropriate. Employees or third-parties may intentionally compromise our or our users security or systems or reveal confidential information. Malicious actors may employ the IT supply chain to introduce malware through software updates or compromised supplier accounts or hardware.\nCyberthreats are constantly evolving and becoming increasingly sophisticated and complex, increasing the difficulty of detecting and successfully defending against them. We may have no current capability to detect certain vulnerabilities or new attack methods, which may allow them to persist in the environment over long periods of time. Cyberthreats can have cascading impacts that unfold with increasing speed across our internal networks and systems and those of our partners and customers. Breaches of our facilities, network, or data security could disrupt the security of our systems and business applications, impair our ability to provide services to our customers and protect the privacy of their data, result in product development delays, compromise confidential or technical business information harming our reputation or competitive position, result in theft or misuse of our intellectual property or other assets, subject us to ransomware attacks, require us to allocate more resources to improve technologies or remediate the impacts of attacks, or otherwise adversely affect our business. We are also subject to supply chain cyberattacks where malware can be introduced to a software providers customers, including us, through software updates.\nIn addition, our internal IT environment continues to evolve. Often, we are early adopters of new devices and technologies. We embrace new ways of sharing data and communicating internally and with partners and customers using methods such as social networking and other consumer-oriented technologies. Increasing use of generative AI models in our internal systems may create new attack methods for adversaries. Our business policies and internal security controls may not keep pace with these changes as new threats emerge, or emerging cybersecurity regulations in jurisdictions worldwide.\nSecurity of our products, services, devices, and customers data may be breached.\nThe security of our products and services is important in our customers decisions to purchase or use our products or services. Security threats are a significant challenge to companies like us whose business is providing technology products and services to others. Threats to our own IT infrastructure can also affect our customers. Customers using our cloud-based services rely on the security of our infrastructure, including hardware and other elements provided by third-parties, to ensure the reliability of our services and the protection of their data. Adversaries tend to focus their efforts on the most popular operating systems, programs, and services, including many of ours, and we expect that to continue. In addition, adversaries can attack our customers cloud environments, sometimes exploiting previously unknown vulnerabilities, Vulnerabilities in these or any product could persist if the attackers exploited the vulnerabilities with the installation of additional malware, to further compromise customers systems. Customers using our products will continue to get attacked as they move through their digital transformation projects. Inadequate account security practices may also result in unauthorized access, and user activity may result in ransomware or other malicious software impacting a customers use of our products or services. We are increasingly incorporating open-source software into our products. There may be vulnerabilities in open-source software that may make our products susceptible to cyberattacks.\nOur customers operate complex IT systems with third-party hardware and software from multiple vendors that may include systems acquired over many years. They expect our products and services to support all these systems and products, including those that no longer incorporate the strongest current security advances or standards. As a result, we may not be able to discontinue support in our services for a product, service, standard, or feature solely because a more secure alternative is available. Failure to utilize the most current security advances and standards can increase our customers vulnerability to attack. Further, customers of widely varied size and technical sophistication use our technology, and consequently may still have limited capabilities and resources to help them adopt and implement state of the art cybersecurity practices and technologies. In addition, we must account for this wide variation of technical sophistication when defining default settings for our products and services, including security default settings, as these settings may limit or otherwise impact other aspects of IT operations and some customers may have limited capability to review and reset these defaults.\nCyberattacks may adversely impact our customers even if our product services are not directly compromised. We are committed to notifying our customers whose systems have been impacted as we become aware and have actionable information for customers to help protect themselves. We are also committed to providing guidance and support on detection, tracking, and remediation. We may not be able to detect the existence or extent of these attacks for all of our customers or have information on how to detect or track an attack, when we may have no or limited visibility into our customers computing environments.\nDevelopment and deployment of defensive measures are ongoing.\nTo defend against security threats to our internal IT systems, our cloud-based services, and our customers systems, we must continuously engineer more secure products and services, enhance security, threat detection, and reliability features, improve the deployment of software updates to address security vulnerabilities in our own products as well as those provided by others, develop mitigation technologies that help to secure customers from attacks even when software updates are not deployed, maintain the digital security infrastructure that protects the integrity of our network, products, and services, and provide security tools such as firewalls, anti-virus software, and advanced security and information about the need to deploy security measures and the impact of doing so. Customers in certain industries such as financial services, health care, and government may have enhanced or specialized requirements to which we must engineer our products and services.\nThe cost of measures to protect products and customer-facing services could reduce our operating margins. If we fail to do these things well, actual or perceived security vulnerabilities in our products and services, data corruption issues, or reduced performance could harm our reputation and lead customers to reduce or delay future purchases of products or subscriptions to services, or to use competing products or services. Customers may also spend more on protecting their existing computer systems from attack, which could delay adoption of additional products or services. Customers, and third-parties granted access to their systems, may fail to update their systems, continue to run software or operating systems we no longer support, or may fail timely to install or enable security patches, or may otherwise fail to adopt adequate security practices. Any of these could adversely affect our reputation and revenue. Actual or perceived vulnerabilities may lead to claims against us. Our license agreements typically contain provisions that eliminate or limit our exposure to liability, but there is no assurance these provisions will withstand legal challenges. At times, to achieve commercial objectives, we may enter into agreements with larger liability exposure to customers.\nOur products operate in conjunction with and are dependent on products and components across a broad ecosystem of third-parties. If there is a security vulnerability in one of these components, and if there is a security exploit targeting it, we could face increased costs, liability claims, reduced revenue, or harm to our reputation or competitive position.\nDisclosure and misuse of personal data could result in liability and harm our reputation.\nAs we continue to grow the number, breadth, and scale of our cloud-based offerings, we store and process increasingly large amounts of personal data of our customers and users. The continued occurrence of high-profile data breaches provides evidence of an external environment increasingly hostile to information security. Despite our efforts to improve the security controls across our business groups and geographies, it is possible our security controls over personal data, our training of employees and third-parties on data security, and other practices we follow may not prevent the improper disclosure or misuse of customer or user data we or our vendors store and manage. In addition, third-parties who have limited access to our customer or user data may use this data in unauthorized ways. Improper disclosure or misuse could harm our reputation, lead to legal exposure to customers or users, or subject us to liability under laws that protect personal data, resulting in increased costs or loss of revenue. Our software products and services also enable our customers and users to store and process personal data on-premises or, increasingly, in a cloud-based environment we host. Government authorities can sometimes require us to produce customer or user data in response to valid legal orders. In the U.S. and elsewhere, we advocate for transparency concerning these requests and appropriate limitations on government authority to compel disclosure. Despite our efforts to protect customer and user data, perceptions that the collection, use, and retention of personal information is not satisfactorily protected could inhibit sales of our products or services and could limit adoption of our cloud-based solutions by consumers, businesses, and government entities. Additional security measures we may take to address customer or user concerns, or constraints on our flexibility to determine where and how to operate datacenters in response to customer or user expectations or governmental rules or actions, may cause higher operating expenses or hinder growth of our products and services.\nRisks Related to Our Common Stock\nHistorically, the market price for our common stock has been volatile, and you may not be able to sell our stock at a favorable price, or at all.\nYou should consider an investment in our common stock to be risky, and you should invest in our common stock and securities convertible into our common stock only if you can withstand a complete loss and wide fluctuations in the market value of your investment. Some factors that may cause the market price of our common stock to fluctuate, in addition to the other risks mentioned in this Risk Factors section and elsewhere are:\n● sale of our common stock by our stockholders, executives, and directors;\n● volatility in price and level of trading volumes of our shares of common stock;\n● our ability to obtain financings to conduct and complete research and development activities and other business activities;\n● the timing and success of introductions of new products and services by us or our competitors or any other change in the competitive dynamics of our industry, including consolidation among competitors;\n● Our ability to attract new customers, clients, licensees, and resellers;\n● changes in the development status of our products and services;\n● changes in our capital structure, future issuances of securities, and sales of large blocks of common stock by our stockholders;\n● our cash position;\n● announcements and events surrounding financing efforts, including debt and equity securities;\n● our inability to enter into new markets or develop new products and services;\n● reputational issues;\n● announcements of acquisitions, partnerships, collaborations, joint ventures, new products and services, capital commitments, or other events by us or our competitors;\n● changes in industry conditions or perceptions;\n● our ability to attract analyst to initiate research coverage and once obtained, having such analysts issue research reports, recommendations and any changes in recommendations, price targets, and withdrawals of coverage;\n● departures and additions of key personnel;\n● disputes and litigations related to intellectual properties, proprietary rights, and contractual obligations;\n● changes in applicable laws, rules, regulations, or accounting practices and other dynamics; and\n● other events or factors, many of which may be out of our control.\nIn addition, if the market for stock of companies in our industry or industries related to our industry, or the stock market in general, experiences a loss of investor confidence, the trading price of our common stock could decline for reasons unrelated to our business, financial condition and results of operations. If any of the foregoing occurs, it could cause our stock price to fall and may expose us to lawsuits that, even if unsuccessful, could be costly to defend and a distraction to management.\nSubstantial sales of our common stock, or the perception that such sales might occur, could depress the market price of our common stock.\nWe cannot predict whether future issuances of our common stock, or resale of shares in the open market, will decrease the market price of our common stock. The consequence of any such issuances or resale of our common stock on our market price may be increased as a result of the fact that our common stock is thinly, or infrequently, traded. The exercise of any outstanding options, or the vesting of any restricted stock, that we may grant to directors, executive officers and other employees in the future, or the issuance of common stock in connection with acquisitions and other issuances of our common stock, may decrease the market price of our common stock.\nHolders of our common stock have a risk of potential dilution if we issue additional shares of common stock in the future.\nThe exercise of outstanding options and warrants to purchase our common stock will dilute existing stockholders ownership percentage. On November 7, 2023, we offered to exchange certain outstanding warrants for shares of common stock and new warrants. We closed the November 7 Offer to Exchange on December 26, 2023, resulting in the issuance of 7,270,958 shares of common stock and 17,415,437 new warrants. On September 13, 2021, our stockholders approved an employee stock option plan authorized by our Board of Directors under which we may issue equity awards that may increase the number of outstanding shares of common stock. In the future, we may grant additional stock options, warrants, preferred stock or convertible securities. The exercise or conversion of stock options, warrants, preferred stock, or convertible securities will dilute the ownership percentage of our then existing stockholders. The dilutive effect of the exercise or conversion of these securities may adversely affect our ability to obtain additional capital. The holders of these securities may be expected to exercise or convert their securities when we are able to obtain additional equity capital on terms more favorable than these securities.\nThe anti-dilutive rights of certain warrants could result in significant dilution to our existing stockholders and/or require us to issue a substantially greater number of shares, which may adversely affect the market price of our common stock.\nThe warrants to purchase 55,549,615 shares of our common stock issued to investors in a private placement transaction that closed on April 16, 2021, contain anti-dilution rights such that if we issue, or are deemed to have issued, common stock or common stock equivalents at a price less than the then exercise price of those warrants, the exercise price of those warrants will automatically be reduced to such lower value, and the number of shares of common stock issuable upon exercise thereafter will be adjusted proportionately, so that the aggregate exercise price payable upon exercise of such warrants is the same prior to and after such reduction in exercise price. As a result, the effect of the anti-dilution right may cause significant dilution to our other stockholders.\nThe warrants to purchase 8,332,439 shares of our common stock issuable upon exercise of warrants issued to the placement agent in the private placement include a weighted average anti-dilution right in the event we issue any shares of common stock or equivalents with a value less than the then exercise price. As a result, the effect of the anti-dilution right may cause significant dilution to our other stockholders. The triggering of the anti-dilution rights in the warrants issued in the private placement may result in such securities being exercisable for a significant number of additional shares of common stock and/or exercisable for a reduced exercise price. As a result, the number of shares issuable could prove to be significantly greater than they are currently and could result in substantial dilution to our other stockholders. As of September 30, 2023, no anti-dilution triggers have occurred.\nOn August 22, 2023, the Company commenced a Tender Offer for the 69,281,020 Warrants subject to our Offer to Exchange consisting of (i) warrants to purchase an aggregate of 5,398,966 Shares issued to certain designees of Paulson Investment Company, LLC (Paulson) in 2018 with a ten-year term and with an exercise price of $1.00 (2018 Paulson Warrants), (ii) warrants to purchase an aggregate of 8,332,439 Shares that were issued to certain designees of Paulson in 2021 with a ten-year term and that had an exercise price of $0.18 (2021 Paulson Warrants); and (iii) warrants to purchase an aggregate of 55,549,615 Shares issued to certain investors in 2021 with a five-year term and with an exercise price of $0.36 (2021 Investor Warrants). The 2018 Paulson Warrants and the 2021 Paulson Warrants are collectively referred to as the Paulson Warrants. Under the Offer to Exchange, the holders of the Paulson Warrants were entitled to receive one (1) share of Common Stock for each four (4) Paulson Warrants exchanged (Paulson Exchange Ratio), and (ii) the holders of the Investor Warrants were entitled to receive one (1) share of Common Stock for each six (6) Investor Warrants exchanged (Investor Exchange Ratio). This Offer to Exchange was withdrawn by the Company on November 1, 2023 after deciding that the 24,008,341 warrants that had been validly tendered into and not validly withdrawn, represented 42.3% of the warrant subject to the Offer to Exchange, were insufficient to close the Offer to Exchange.\nA new Tender Offer (Offer to Exchange) was filed on November 7, 2023. The November 7, 2023 Tender Offer contained two material differences from the Tender Offer filed on August 22, 2023:\n● The November 7, 2023, Offer to Exchange excluded the 2018 and 2021 Paulson Warrants (the Paulson Warrants); and\n● The November 7, 2023, Offer to Exchange offered the 2021 Investor Warrant holders one (1) additional Warrant for every 2.5 Warrants exchanged from the 2021 Investor Warrants. The New Warrant includes the following features: $0.18 exercise price; a five (5) year exercise term; a cashless exercise option; and an automatic conversion at $0.36. The New Warrant excludes the anti-dilution rights in the 2021 Investor Warrants.\nThe 55,549,615 2021 Investor Warrants were subject to the November 7, 2023, Offer to Exchange. We closed the November 7 Offer to Exchange on December 26, 2023, resulting in the issuance of 7,270,958 shares of common stock and 17,415,437 new warrants in exchange for 43,538,501 2021 Investor Warrants.\nOur common shares are thinly traded, and in the future may continue to be thinly traded, and you may be unable to sell your shares at or near ask prices or at all, if you need to sell your shares to raise money or otherwise desire to liquidate such shares.\nWe cannot predict the extent to which an active public market for our common stock will develop or be sustained due to a number of factors, including the fact that we are a small company that is relatively unknown to stock analysts, stock brokers, institutional investors and others in the investment community that generate or influence sales volume, and that even if we came to the attention of such persons, they tend to be risk-averse and would be reluctant to follow an unproven company such as ours or purchase or recommend the purchase of our shares until such time as we become more seasoned and viable. As a consequence, there may be periods of several days or more when trading activity in our shares is minimal or non-existent, as compared to a seasoned issuer that has a large and steady volume of trading activity that will generally support continuous sales without an adverse effect on its share price. We cannot give you any assurance that a broader or more active public trading market for our common stock will develop or be sustained, or that even current trading levels will be sustained. You may be unable to sell your common stock at or above your purchase price, if at all, which may result in substantial losses to you. As a consequence of this lack of liquidity, the trading of relatively small quantities of shares by our stockholders may disproportionately influence the price of those shares in either direction. The price for our shares could, for example, decline precipitously in the event that a large number of our common shares are sold on the market without commensurate demand, as compared to a seasoned issuer that could better absorb those sales without adverse impact on its share price. As a consequence of this enhanced risk, more risk-averse investors may, under the fear of losing all or most of their investment in the event of negative news or lack of progress, be more inclined to sell their shares on the market more quickly and at greater discounts than would be the case with the stock of a seasoned issuer.\nA significant number of our shares have been registered for resale, and their sale or potential sale may depress the market price of our common stock.\nAs of September 30, 2023, we had 213,854,781 shares of common stock outstanding and total warrants issued for 69,281,020 shares of common stock. If all 69,281,020 warrants are exercised in full for cash, then they would represent 24.5% of the total shares outstanding. Sales of a significant number of shares of our common stock in the public market, or the potential or expectation of such sales, could harm the market price of our common stock. As large numbers of our common stock are sold, it would increase the supply of our common stock, which would thereby cause a decrease in its price.\nFuture sales and issuances of our securities could result in additional dilution of the percentage ownership of our stockholders and could cause our share price to fall.\nWe expect that we will need significant additional capital in the future to continue our planned operations, including research and development, increased marketing, hiring new personnel, commercializing our products, and continuing activities as an operating public company. To the extent that we raise additional capital by issuing equity securities, our existing stockholders may experience substantial dilution. We may sell common stock, convertible securities or other equity securities in one or more transactions, at prices and in a manner that we determine from time to time, in our discretion. If we sell common stock, convertible securities or other equity securities in more than one transaction, investors may be materially diluted by subsequent sales. Such sales may also result in material dilution to our existing stockholders, and new investors could gain rights superior to our existing stockholders.\nOur common stock is subject to restrictions on sales by broker-dealers and penny stock rules, which may be detrimental to investors.\nOur common stock is subject to Rules 15g-1 through 15g-9 under the Securities Exchange Act of 1934, as amended (the Exchange Act), which impose certain sales practice requirements on broker-dealers who sell our common stock to persons other than established customers and accredited investors (as defined in Rule 501(a) of the Securities Act of 1933, as amended (the Securities Act)). For transactions covered by this rule, a broker-dealer must make a special suitability determination for the purchaser and receive the purchasers written consent to the transaction prior to the sale. This rule adversely affects the ability of broker-dealers to sell our common stock and holders of our common stock to sell their shares of our common stock.\nAdditionally, our common stock is subject to SEC regulations applicable to penny stocks. Penny stocks include any non-Nasdaq equity security that has a market price of less than $5.00 per share, subject to certain exceptions. The regulations require that, prior to any non-exempt buy/sell transaction in a penny stock, a disclosure schedule proscribed by the SEC relating to the penny stock market must be delivered by a broker-dealer to the purchaser of such penny stock. This disclosure must include the amount of commissions payable and the current price quotations for our common stock. The regulations also require that monthly statements be sent to holders of a penny stock that disclose recent price information for the penny stock and information regarding the limited market for penny stocks. These requirements adversely affect the market liquidity of our common stock.\nBecause our common stock is quoted on the OTCQB instead of a national exchange, our investors may have difficulty selling their stock or may experience negative volatility on the market price of our common stock.\nOur common stock is quoted on the OTCQB Market, operated by the OTC Markets Group. The OTCQB is often highly illiquid, in part because it does not have a national quotation system by which potential investors can follow the market price of shares, except through information received and generated by a limited number of broker-dealers that make markets in particular stocks. There is a greater chance of volatility for securities that trade on the OTCQB, as compared to a national exchange or quotation system. This volatility may be caused by a variety of factors, including the lack of readily available price quotations, the absence of consistent administrative supervision of bid and ask quotations, lower trading volume, and market conditions. Investors in our common stock may experience high fluctuations in the market price and volume of the trading market for our securities. These fluctuations, when they occur, have a negative effect on the market price for our securities. Accordingly, our stockholders may not be able to realize a fair price for their shares when they determine to sell them or may have to hold them for a substantial period of time until the liquidity of the market for our common stock improves.\nRisks Related to Regulations and Our Compliance with Such Regulations\nWe previously identified material weaknesses in our disclosure controls and procedures and internal control over financial reporting. If not remediated, our failure to establish and maintain effective disclosure controls and procedures and internal control over financial reporting could result in material misstatements in our financial statements and a failure to meet our reporting and financial obligations, each of which could have a material adverse effect on our financial condition and the trading price of our common stock.\nMaintaining effective internal control over financial reporting and effective disclosure controls and procedures are necessary for us to produce reliable financial statements. Our disclosure controls and procedures and internal controls over financial reporting are currently ineffective and have in the past been subject to material weaknesses. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of a companys annual or interim financial statements will not be prevented or detected on a timely basis. A control deficiency exists when the design or operation of a control does not allow management or employees, in the normal course of performing their assigned functions, to prevent or detect misstatements on a timely basis.\nWe cannot assure you that additional material weaknesses will not arise in the future. The development of new material weaknesses in our internal control over financial reporting, could result in material misstatements in our financial statements and cause us to fail to meet our reporting and financial obligations, which in turn could have a material adverse effect on our financial condition and the trading price of our common stock, and/or result in litigation against us or our management.\nWe are subject to changing laws and regulations.\nU.S. government agencies continue to implement extensive requirements on our industry. These regulations have both positive and negative impacts, with much remaining uncertainty as to how various provisions will ultimately affect our customers, clients, licensees, resellers, end users, and our business. As to prospective legislation and regulation concerning collection, transmission, storage and use of personal data, we cannot determine what effect additional state or federal governmental legislation, regulations, or administrative orders would have on our business in the future. New legislation or regulation may require the reformulation of our business to meet new standards, require us to cease operations, impose stricter qualification and/or registration standards, impose additional record keeping, or require expanded consumer protection measures (such as heightened notification procedures and data subject access rights).\nOur failure to comply with laws and regulations applicable to our business could subject us to fines and penalties and could also cause us to lose potential customers, clients, licensees, resellers and/or for licensees and resellers to lose potential customers in the public sector or negatively impact our ability to contract with the public sector.\nOur business is subject to regulation by various federal, state, regional, local and foreign governmental agencies, including agencies responsible for monitoring and enforcing employment and labor laws, workplace safety, product safety, product labeling, environmental laws, consumer protection laws, anti-bribery laws, data privacy laws, import and export controls, federal securities laws and tax laws and regulations. In certain jurisdictions, these regulatory requirements may be more stringent than in the United States. Noncompliance with applicable regulations or requirements could subject us to investigations, sanctions, enforcement actions, disgorgement of profits, fines, damages and civil and criminal penalties or injunctions. If any governmental sanctions are imposed, or if we do not prevail in any possible civil or criminal litigation, our business, operating results and financial condition could be adversely affected. In addition, responding to any legal action will likely result in a significant diversion of our managements attention and resources and an increase in professional fees and expenses. Enforcement actions and sanctions could harm our business, operating results and financial condition.\nAdditionally, we may be subject to other laws and regulations throughout the world governing data handling, protection and privacy. For example, in June of 2018, California passed the California Consumer Privacy Act, or the CCPA, which provides new data privacy rights for consumers and new operational requirements for companies, became effective in 2021, and in March 2022, Virginia passed a consumer data protection law, the VCDPA, which includes similar rights as set forth in the CCPA. Fines for noncompliance may be up to $7,500 per violation. Additionally, many other states have passed differing privacy and data protection laws in recent years. Significantly, several bills are being worked on in the Senate and the House dealing with these issues, and while it is uncertain that any of them will reach the floor of either chamber, if they do so they will likely impose substantial additional burdens on companies. The costs of compliance with, and other burdens imposed by, the CCPA, the VCDPA and other state or foreign laws, may limit the use and adoption of our products and services and would have an adverse impact on our business. These laws and regulations impose added costs on our business, and failure to comply with these or other applicable regulations and requirements, including non-compliance in the past, could lead to claims for damages from our channel partners, penalties, termination of contracts, loss of exclusive rights in our intellectual property and temporary suspension or permanent debarment from government contracting. Any such damages, penalties, disruptions, or limitations in our ability to do business with the public sector could have an adverse effect on our business and operating results.\nGovernmental restrictions on the sale of our products and services in non-U.S. markets could negatively affect our business, financial condition, and financial results.\nExports of software products and services using cybersecurity technology such as ours are generally restricted by the U.S. government. In addition, some countries impose restrictions on the use of cybersecurity products and services such as ours. The cost of compliance with U.S. and other export laws, or our failure to obtain governmental approvals to offer our products and services in non-U.S. markets, could affect our ability to sell our products and services and could impair our international expansion. We face a variety of other legal and compliance risks. If we or our distributors fail to comply with applicable law and regulations, we may become subject to penalties, fines or restrictions that could materially adversely affect our business, financial condition and financial results.\nRisks Related to Our Contractual Agreements\nThe accounting treatment of the recently issued warrants could have a material adverse impact on our financial statements and reduce our net income.\nThe warrants we issued in the 2021 private placement described in Part II, Item 8, Financial Statements, Note 8, contain various provisions including, but not limited to, various price reset and anti-dilution provisions. We cannot predict the financial impact of the issuance of the warrants on our financial statements, specifically our balance sheet. We also cannot predict the financial impact of the various provisions included in the warrant agreements.\nThe purchase agreement related to our 2021 private placement includes customary covenants that we must comply with, or we may suffer potential monetary and other penalties.\nThe securities purchase agreement we entered into in connection with the recent private placement contains certain customary covenants. If we do not comply with these covenants, we will be in breach of our obligations under the securities purchase agreement, which may lead to exercise by the investors of the remedies available to them under the securities purchase agreement, which may cause a material impact upon our financial condition.\nGeneral Risk Factors\nOur charter allows us to issue blank check preferred stock and establish its terms, conditions, rights, powers and preferences without stockholder approval.\nPursuant to our certificate of incorporation, our Board of Directors has the authority to issue up to 10 million shares of blank check preferred stock and to determine the price, rights, preferences, privileges, and restrictions, including voting rights, of those shares without any additional vote or action by our stockholders. Because our Board of Directors is able to designate the terms, conditions, rights, powers, and preferences of the preferred stock without the vote of a majority of our stockholders, our stockholders will have no control over what designations and preferences our preferred stock will have. The issuance of shares of preferred stock, or the rights associated therewith, could cause substantial dilution to our existing stockholders. Additionally, the dilutive effect of any preferred stock that we may issue may be exacerbated given the fact that such preferred stock may have voting rights, liquidation and/or other rights or preferences that could provide the preferred stockholders with substantial voting control over us and/or give those holders the power to prevent or cause a change in our control. As a result, the issuance of shares of preferred stock may cause the value of our common stock to decrease.\nWe will continue to incur increased costs as a result of being a reporting company and, given our limited capital resources, such additional costs may have an adverse impact on our profitability.\nWe are a reporting company to the Securities and Exchange Commission, or SEC. The rules and regulations under the Exchange Act require reporting companies to provide periodic reports with interactive data files, which require that we engage legal, accounting and auditing professionals, and XBRL (eXtensible Business Reporting Language) and EDGAR (Electronic Data Gathering, Analysis, and Retrieval) service providers. The engagement of such services can be costly, and we may continue to incur additional financial losses, which may adversely affect our ability to continue as a going concern. In addition, the Sarbanes Oxley Act of 2002, as well as a variety of new related and unrelated rules implemented by the SEC, have required changes in corporate governance practices and generally increased the disclosure requirements of public companies. For example, as a result of being a reporting company, we are required to file periodic and current reports and other information with the SEC, and we are adopting and revising policies regarding disclosure controls and procedures, including internal controls over financial reporting.\nThe additional costs we continue to incur in connection with being a reporting company (expected to be approximately seven to eight hundred thousand dollars per year) will continue to further stretch our limited capital resources. Due to our limited resources, we have to allocate resources away from other productive uses in order to continue to comply with our obligations as an SEC reporting company. Further, there is no guarantee that we will have sufficient resources to continue to meet our reporting and filing obligations with the SEC as they come due.\nIf securities or industry analysts do not initiate research coverage on us and, if initiated, fail to publish research or reports, or publish unfavorable research or reports, about our business, our stock price and trading volume may decline.\nThe trading market for our common stock will rely in part on the research and reports that industry or financial analysts publish about us, our business, our markets, and our competitors. We do not currently have any securities or industry analysts that have initiated research coverage on our business. If and when any securities or industry analysts initiate research coverage on our business, we will not control these analysts. If securities analysts do not cover our common stock, the lack of research or other coverage may adversely affect the market price and decrease the trading volume of our common stock. Furthermore, if one or more of the analysts who do cover us downgrade our stock, or if those analysts issue other unfavorable commentary about us or our business, our stock price would likely decline. If one or more of these analysts cease coverage of us or fails to regularly publish reports on us, we could lose visibility in the market, and interest in our stock could decrease, which in turn could cause our stock price or trading volume to decline and may also impair our ability to expand our business and attract new clients and customers to purchase our cybersecurity products and services.\nMarket and economic conditions may negatively impact our business, financial condition, and share price.\nConcerns over increasing inflation, increasing energy costs, geopolitical issues, unstable global credit markets and financial conditions, and volatile oil prices have in the past led to periods of significant economic instability, diminished liquidity and credit availability, declines in consumer confidence and discretionary spending, diminished expectations for the global economy and expectations of slower global economic growth going forward, increased unemployment rates, and increased credit defaults. Our general business strategy may be adversely affected by any such economic downturns, volatile business environments, and continued unstable or unpredictable economic and market conditions. If these conditions continue to deteriorate, or do not improve once they occur, it may make any necessary debt or equity financing needed by us more difficult to complete, more costly, if possible, at all, and more dilutive. Failure to secure any necessary financing in a timely manner and on favorable terms could have a material adverse effect on our growth strategy, financial performance, and share price, and could require us to delay or abandon development or commercialization plans.\nFailure to adequately manage our planned aggressive growth strategy may harm our business or increase our risk of failure.\nFor the foreseeable future, we intend to pursue an aggressive growth strategy for the expansion of our operations through increased product development and marketing. Our ability to rapidly expand our operations will depend upon many factors, including our ability to work in a regulated environment, market value-added products effectively to mid-market and emerging companies and organizations, establish and maintain strategic relationships with suppliers, acquire companies or establish joint ventures to add new features, services or products to our offerings, and obtain adequate capital resources on acceptable terms. Any restrictions on our ability to expand may have a materially adverse effect on our business, results of operations, and financial condition. Accordingly, we may be unable to achieve our targets for sales growth, and our operations may not be successful or achieve anticipated operating results.\nAdditionally, our growth may place a significant strain on our managerial, administrative, operational, and financial resources. Our future success will depend, in part, upon the ability of our management to manage growth effectively. This will require us to, among other things:\n● implement additional management information systems;\n● further develop our operating, administrative, legal, financial, and accounting systems and controls;\n● hire additional personnel;\n● develop additional levels of management within our company;\n● locate additional office space; and\n● maintain close coordination among our engineering, operations, legal, finance, sales and marketing, and client service and support organizations.\nAs a result, we may lack the resources to deploy our services on a timely and cost-effective basis. Failure to accomplish any of these requirements could impair our ability to deliver our products and services in a timely fashion or attract and retain new licensees and resellers.\nIf we do not successfully implement any acquisition strategies, our operating results and prospects could be harmed.\nWe face intense competition within our industry for acquisitions of businesses, technologies and assets. In the future, such competition may become more intense. As such, even if we are able to identify an acquisition target that we would like to acquire, we may not be able to complete the acquisition on commercially reasonable terms, or at all, because of such competition. Furthermore, if we enter into negotiations that are not ultimately consummated, those negotiations will result in diversion of management time and significant out-of-pocket costs. Even if we are able to complete such acquisitions, we may additionally expend significant amounts of cash or incur substantial debt to finance them, which indebtedness could result in restrictions on our business and use of available cash. In addition, we may finance or otherwise complete acquisitions by issuing equity or convertible debt securities, which could result in dilution of our existing stockholders. If we fail to evaluate and execute acquisitions successfully, we may not be able to realize their benefits. If we are unable to successfully address any of these risks, our business, financial condition, and operating results could be harmed.\nIf we make any acquisitions, they may disrupt or have a negative impact on our business.\nIf we make acquisitions in the future, funding permitting, which may not be available on favorable terms, if at all, we could have difficulty integrating the acquired companys assets, personnel and operations with our own. We do not anticipate that any further acquisitions or mergers we may enter into in the future would result in a change of control of the Company. In addition, the key personnel of the acquired business may not be willing to work for us. We cannot predict the effect any expansion may have on our core business. Regardless of whether we are successful in closing an acquisition, the negotiations could disrupt our ongoing business, distract our management and employees and increase our expenses. In addition to the risks described above, acquisitions are accompanied by a number of inherent risks, including, without limitation, the following:\n● the difficulty of integrating acquired products, services or operations;\n● the potential disruption of the ongoing businesses and distraction of our management and the management of any acquired companies;\n● difficulties in maintaining uniform standards, controls, procedures and policies;\n● the potential impairment of relationships with employees, licensees, resellers, clients, and customers as a result of any integration of new management personnel;\n● the potential inability or failure to achieve additional sales and enhance our client, customer, licensee, and reseller base through cross-marketing of the products to new and existing clients, customers, licensees and resellers;\n● the effect of any government regulations which we are unfamiliar with that relate to the business acquired;\n● potential unknown liabilities associated with acquired businesses or product lines, or the need to spend significant amounts to retool, reposition or modify the marketing and sales of acquired products or operations, or the defense of any litigation, whether or not successful, resulting from actions of the acquired company prior to our acquisition; and\n● potential expenses under the labor, environmental and other laws of various jurisdictions.\nOur business could be severely impaired if and to the extent that we are unable to succeed in addressing any of these risks or other problems encountered in connection with an acquisition, many of which cannot be presently identified. These risks and problems could disrupt our ongoing business, distract our management and employees, increase our expenses and adversely affect our results of operations, including reducing our revenue and net income.\nWe may apply working capital and future funding to uses that ultimately do not improve our operating results or increase the market price of our securities.\nIn general, we have complete discretion over the use of our working capital and any new investment capital we may obtain in the future that has no dedicated use of proceeds. Because of the number and variety of factors that could determine our use of funds, our ultimate expenditure of funds (and their uses) may vary substantially from our current intended operating plan for such funds.\nWe intend to use existing working capital and future funding to support the development of our products and services, the expansion of our marketing, or the support of operations to educate the end users of the software we sell. We will also use capital for market and network expansion, acquisitions, and general working capital purposes. However, we do not have more specific plans for the use and expenditure of our capital. Our management has broad discretion to use any or all of our available capital reserves. Our capital could be applied in ways that do not improve our operating results or otherwise increase the market value of a stockholders shares.\nOur websites may encounter technical problems and service interruptions.\nOur websites may in the future experience slower response times or interruptions as a result of increased traffic or other reasons. These delays and interruptions resulting from failure to maintain Internet service connections to our site could frustrate visitors and reduce our future web site traffic, which could have a material adverse effect on our business including a reduction in our sales and net income.\nThe sale of shares of our common stock by our directors and officers may adversely affect the market price for our common stock.\nSales of significant amounts of shares of common stock by our officers and directors, or the prospect of such sales, could adversely affect the market price of our common stock. Our managements stock ownership may discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of us, which in turn could reduce our stock price or prevent our stockholders from realizing a premium over our stocks market price.\nStockholders may be diluted significantly through our efforts to obtain financing and satisfy obligations through the issuance of additional shares of our common stock.\nWhenever possible, our Board of Directors will attempt to use non-cash consideration to satisfy obligations. In many instances, we believe that the non-cash consideration will consist of restricted shares of our common stock, or when shares are issued to our officers, directors and applicable consultants as compensation. Our Board of Directors has authority, without action or vote of the stockholders, to issue all or part of the authorized but unissued shares of our common stock. In addition, we may attempt to raise capital by selling shares of our common stock, possibly at a discount to market. These actions will result in dilution of the ownership interests of existing stockholders, which may further dilute our common stock book value, and that dilution may be material. Such issuances may also serve to enhance existing managements ability to maintain control of us because the shares may be issued to parties or entities committed to supporting existing management.\nIf we do not effectively manage our growth, our business resources and systems may become strained, and we may be unable to increase revenue growth.\nWe plan to grow aggressively and, if successful, our future growth may provide challenges to our organization, requiring us to expand our personnel and our operations. Future growth may strain our infrastructure, operations and other managerial and operating resources. If our business resources become strained, our earnings may be adversely affected, and we may be unable to increase revenue growth. Further, we may undertake contractual commitments that exceed our labor resources, which could also adversely affect our earnings and our ability to increase revenue growth.\nOur growth depends in part on the success of our strategic relationships with third-parties.\nIn order to grow our business, we anticipate that we will need to continue to depend on our relationships with third-parties, including our technology providers. Identifying such third-parties, and negotiating and documenting relationships with them, requires significant time and resources. Our competitors may be effective in providing incentives to third-parties to favor their products or services over utilization of our products and services. In addition, acquisitions of our business partners by our competitors could result in a decrease in the number of our current and potential clients, customers, licensees, resellers, and end users. If we are unsuccessful in establishing or maintaining our relationships with third-parties, our ability to compete in the marketplace or to grow our revenue could be impaired and our results of operations may suffer. Even if we are successful, we cannot assure you that these relationships will result in increased use of our products or increased revenue.\nClaims, litigation, government investigations, and other proceedings may adversely affect our business and results of operations.\nAs a company offering a wide range of products and services, we are regularly subject to actual and threatened claims, litigation, reviews, investigations, and other proceedings, including proceedings relating to goods and services offered by us and by third-parties, and other matters. Any of these types of proceedings, including currently pending proceedings as discussed herein, may have an adverse effect on us because of legal costs, disruption of our operations, diversion of management resources, negative publicity, and other factors. The outcomes of these matters are inherently unpredictable and subject to significant uncertainties. Determining legal reserves and possible losses from such matters involves judgment and may not reflect the full range of uncertainties and unpredictable outcomes. Until the final resolution of such matters, we may be exposed to losses in excess of the amount recorded, and such amounts could be material. Should any of our estimates and assumptions change or prove to have been incorrect, it could have a material effect on our business, consolidated financial position, results of operations, or cash flows. In addition, it is possible that a resolution of one or more such proceedings, including as a result of a settlement, could require us to make substantial future payments, prevent us from offering certain products or services, require us to change our business practices in a manner materially adverse to our business, requiring development of non-infringing or otherwise altered products or technologies, damaging our reputation, or otherwise having a material adverse effect on our operations.\nWe have never paid or declared any dividends on our common stock.\nWe have never paid or declared any dividends on our common stock or preferred stock; however, prior to December 29, 2021, we operated as a limited liability company (LLC) and made distributions of profits to our members. There were equity distributions to LLC members of $461,000 in 2022 and zero ($0) in 2023.\nWe do not anticipate paying, in the near future, dividends or distributions on our common stock. Any future dividends on our common stock will be declared at the discretion of our Board of Directors and will depend on, among other things, our earnings, our financial requirements for future operations and growth, and other facts as we may then deem appropriate. Since we do not anticipate paying cash dividends on our common stock, return on your investment, if any, will depend solely on an increase, if any, in the market value of our common stock. ITEM 1B. UNRESOLVED STAFF COMMENTS\nThis disclosure is not required as the Company is not an accelerated filer, large accelerated filer, nor a well-known seasoned issuer.\nITEM 1C. CYBERSECURITY\nRisk management and strategy\nSideChannel, Inc. recognizes the critical importance of developing, implementing, and maintaining robust cybersecurity measures to safeguard our information systems and protect the confidentiality, integrity, and availability of our data.\nManaging Material Risks & Integrated Overall Risk Management\nSideChannel, Inc. has strategically integrated cybersecurity risk management into our broader risk management framework to promote a company-wide culture of cybersecurity risk management. This integration ensures that cybersecurity considerations are an integral part of our decision-making processes at every level. Our risk management team works closely with our IT department to continuously evaluate and address cybersecurity risks in alignment with our business objectives and operational needs.\nEngage Third-parties on Risk Management\nRecognizing the complexity and evolving nature of cybersecurity threats, SideChannel, Inc. engages with a range of external experts, including cybersecurity assessors, consultants, and auditors in evaluating and testing our risk management systems. These partnerships enable us to leverage specialized knowledge and insights, ensuring our cybersecurity strategies and processes remain at the forefront of industry best practices. Our collaboration with these third-parties includes regular audits, threat assessments, and consultation on security enhancements.\nOversee Third-party Risk\nBecause we are aware of the risks associated with third-party service providers, SideChannel, Inc. implements stringent processes to oversee and manage these risks. We conduct thorough security assessments of all third-party providers before engagement and maintain ongoing monitoring to ensure compliance with our cybersecurity standards. The monitoring includes quarterly assessments by our Chief Information Security Officer (CISO) and on an ongoing basis by our security engineers. This approach is designed to mitigate risks related to data breaches or other security incidents originating from third-parties.\nRisks from Cybersecurity Threats\nWe have not encountered cybersecurity challenges that have materially impaired our operations or financial standing.\nGovernance\nThe Board of Directors is acutely aware of the critical nature of managing risks associated with cybersecurity threats. The Board has established robust oversight mechanisms to ensure effective governance in managing risks associated with cybersecurity threats because we recognize the significance of these threats to our operational integrity and stakeholder confidence,\nBoard of Directors Oversight\nThe Audit Committee is central to the Boards oversight of cybersecurity risks and bears the primary responsibility for this domain. The Audit Committee is composed of board members with diverse expertise including, risk management, technology, and finance, equipping them to oversee cybersecurity risks effectively.\nManagements Role Managing Risk\nThe CISO and the Chief Executive Officer (CEO) play a pivotal role in informing the Audit Committee on cybersecurity risks. They provide comprehensive briefings to the Audit Committee on a regular basis, with a minimum frequency of once per year. These briefings encompass a broad range of topics, including:\n● Current cybersecurity landscape and emerging threats;\n● Status of ongoing cybersecurity initiatives and strategies;\n● Incident reports and learnings from any cybersecurity events; and\n● Compliance with regulatory requirements and industry standards.\nIn addition to our scheduled meetings, the Audit Committee, CISO and CEO maintain an ongoing dialogue regarding emerging or potential cybersecurity risks. Together, they receive updates on any significant developments in the cybersecurity domain, ensuring the Boards oversight is proactive and responsive. The Audit Committee actively participates in strategic decisions related to cybersecurity, offering guidance and approval for major initiatives. This involvement ensures that cybersecurity considerations are integrated into the broader strategic objectives of SideChannel, Inc. The Audit Committee conducts an annual review of the companys cybersecurity posture and the effectiveness of its risk management strategies. This review helps in identifying areas for improvement and ensuring the alignment of cybersecurity efforts with the overall risk management framework.\nRisk Management Personnel\nPrimary responsibility for assessing, monitoring and managing our cybersecurity risks rests with the CISO, Mr. Bill Roberts. With over 25 years of experience in the field of cybersecurity, Mr. Roberts brings a wealth of expertise to his role. His background includes extensive experience as an enterprise CISO and is well-recognized within the industry. His in-depth knowledge and experience are instrumental in developing and executing our cybersecurity strategies. Our CISO oversees our governance programs, tests our compliance with standards, remediates known risks, and leads our employee training program.\nMonitor Cybersecurity Incidents\nThe CISO is continually informed about the latest developments in cybersecurity, including potential threats and innovative risk management techniques. This ongoing knowledge acquisition is crucial for the effective prevention, detection, mitigation, and remediation of cybersecurity incidents. The CISO implements and oversees processes for the regular monitoring of our information systems. This includes the deployment of advanced security measures and regular system audits to identify potential vulnerabilities. In the event of a cybersecurity incident, the CISO is equipped with a well-defined incident response plan. This plan includes immediate actions to mitigate the impact and long-term strategies for remediation and prevention of future incidents.\nReporting to Board of Directors\nThe CISO, in his capacity, regularly informs the Chief Financial Officer (CFO) and Chief Executive Officer (CEO) of all aspects related to cybersecurity risks and incidents. This ensures that the highest levels of management are kept abreast of the cybersecurity posture and potential risks facing SideChannel, Inc. Furthermore, significant cybersecurity matters, and strategic risk management decisions are escalated to the Board of Directors, ensuring that they have comprehensive oversight and can provide guidance on critical cybersecurity issues. ITEM 2. PROPERTIES\nOn December 10, 2021, we entered into a lease for approximately 500 square feet of office space at 146 Main Street in Worcester, Massachusetts, with the option to renew annually for three (3) twelve (12) month periods through December 2025. The annual renewal date is January 1st. Our current lease payment is $948 per month. The lease allows for a two percent (2%) increase effective at the beginning of each renewal period. We anticipate the lease payment to be $967 per month during calendar year 2024. ITEM 3. LEGAL PROCEEDINGS\nAs of the filing date of this Annual Report on Form 10-K, there are no material pending legal proceedings. From time to time, we may be involved in ordinary routine litigation incidental to our business, to which we are a party or which our property is the subject. In addition, none of our officers, directors, affiliates or 5% stockholders (or any associates thereof) is a party adverse to us, or has a material interest adverse to us, in any material proceeding.\nCurrently Pending Litigation\nIn April 2021, Eric Marquez, the former Secretary/Treasurer and Chief Financial Officer of the Company, and certain other plaintiffs, filed a lawsuit against Cipherloc Corporation, our predecessor, and Michael De La Garza, Cipherlocs former Chief Executive Officer and President, in the 20th Judicial District for Hays County, Texas (Case No. 20-0818). The lawsuit alleges causes of action for fraud against Mr. De La Garza (for misrepresentations allegedly made by Mr. De La Garza); breach of contract, for alleged breaches of Mr. Marquezs alleged oral employment agreement, which Mr. Marquez claims required Cipherloc pay him cash and shares of stock; unjust enrichment; quantum meruit; and rescission of certain stock purchases made by certain of the plaintiffs, as well as declaratory relief and fraud. Damages sought exceed $1,000,000. The Company believes Cipherloc made all required payments and delivered the stock to the plaintiffs. The case is currently being defended by the Company. The Company believes it has meritorious defenses to the allegations, and the Company intends to continue to vigorously defend against the litigation. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is traded on the over-the-counter market and is quoted on the OTCQB Venture Market run by OTC Markets Group under the symbol SDCH.\nThe OTC Markets Group is a network of security dealers who buy and sell stock. The dealers are connected by a computer network that provides information on current bids and asks, as well as volume information. The trading of securities on the OTC Markets is often sporadic and investors may have difficulty buying and selling our shares or obtaining market quotations for them, which may have a negative effect on the market price of our common stock.\nThe following table sets forth, for the periods indicated the high and low closing bid quotations for our common stock. These quotations represent inter-dealer quotations, without adjustment for retail markup, markdown, or commission and may not represent actual transactions.\nLow High\nFiscal Year\nFirst Quarter (October 1, 2021 to December 31, 2021) $ 0.07 $ 0.19\nSecond Quarter (January 1, 2022 to March 31, 2022) $ 0.08 $ 0.14\nThird Quarter (April 1, 2022 to June 30, 2022) $ 0.07 $ 0.10\nFourth Quarter (July 1, 2022 to September 30, 2022) $ 0.08 $ 0.16\nFiscal Year\nFirst Quarter (October 1, 2022 to December 31, 2022) $ 0.09 $ 0.14\nSecond Quarter (January 1, 2023 to March 31, 2023) $ 0.04 $ 0.12\nThird Quarter (April 1, 2023 to June 30, 2023) $ 0.04 $ 0.11\nFourth Quarter (July 1, 2023 to September 30, 2023) $ 0.05 $ 0.10\nFiscal Year\nFirst Quarter (October 1, 2023 to December 31, 2023) (1) $ 0.03 $ 0.07\n(1) Through December 18, 2023\nAs of September 30, 2023, there were 213,854,781 shares of our common stock issued and outstanding, and there were approximately 3,100 record holders of our common stock.\nAlso as of September 30, 2023, there were zero (0) shares of Series A Preferred Stock issued and outstanding.\nDividends\nWe have never declared any dividends on our common stock; however, prior to December 29, 2021, we operated as a limited liability company (LLC) and made distributions of profits to LLC members. There were equity distributions to LLC members of $461,000 when we operated as an LLC during fiscal year 2022.\nOur Board of Directors does not intend to declare dividends in the foreseeable future. The declaration, payment, and amount of any future dividends will be made at the discretion our Board of Directors, and will depend upon, among other things, the results of our operations, cash flows and financial condition, operating and capital requirements, and such other factors as our Board of Directors consider relevant at that time. We currently expect to use all available funds to finance the future development and expansion of our business, and we do not anticipate paying dividends on our common stock in the foreseeable future.\nTransfer Agent\nThe Transfer Agent and Registrar for our common stock is Computershare Limited located in Canton, Massachusetts.\nRecent Sales of Unregistered Securities\nExcept as previously disclosed in Form 8-K dated May 9, 2023, respecting the issuance of 62,016,618 shares of common stock in the Business Combination, and as previously disclosed in the Form 8-K dated June 15, 2023, respecting the issuance of 100 shares of common stock upon the conversion of the outstanding 100 shares of Series A Preferred Stock, there have been no sales of unregistered securities during the year ended September 30, 2023.\nPlease refer to the information contained in Item 1. Business under the caption Business Combination Between Cipherloc Corporation and SideChannel, Inc. (now known as SCS, Inc.) of this Form 10-K with respect to shares of our equity securities issued during the twelve-month period ended September 30, 2022. ITEM 6. RESERVED ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Managements Discussion and Analysis of Financial Condition and Results of Operations should be read in conjunction with the accompanying consolidated financial statements and the notes thereto. In addition, please refer to the discussion of our business and markets contained in Part 1, Item 1 of this Annual Report on Form 10-K.\nOverview\nOur Business\nOur mission is to make cybersecurity simple and accessible for mid-market and emerging companies, a market that we believe is currently underserved. We believe that our cybersecurity offerings will identify and develop cybersecurity, privacy, and risk management solutions for our customers. We anticipate that our target customers will continue to need cost-effective security solutions. We intend to provide more tech-enabled services to address the needs of our customers, including virtual Chief Information Security Officer (vCISO), zero trust, third-party risk management, due diligence, privacy, threat intelligence, and managed end-point security solutions.\nOur growth strategy focuses on these three initiatives:\n1. Securing new vCISO clients\n2. Adding new Cybersecurity Software and Services offerings\n3. Increasing adoption of Cybersecurity Software, including Enclave and Services offerings at vCISO clients\nWe internally report our revenue using two categories. The first, vCISO Services, captures the revenue the Chief Information Security Officer services that we provide to our clients on a virtual or outsourced basis, thus the acronym vCISO. Services delivered by SideChannel through our team of vCISOs include assessing the cybersecurity risk profile, implementing policies and programs to mitigate risks, and managing the day-to-day tasks to ensure compliance with the adopted cybersecurity framework. Most of our clients use our vCISO services.\nvCISO engagements typically include a fixed monthly subscription fee with durations longer than twelve (12) months. Hourly rates for vCISO time and material projects range from $350 to $425. Each of our vCISOs is generally embedded into the C-suite executive teams of two (2) to four (4) of our clients.\nOur second revenue category encompasses an array of Cybersecurity Software and Services that our clients deem necessary to protect their digital assets. These augment our vCISO offering and include a full range of other cybersecurity products and services delivered through a team of security engineers along with a network of third-party service providers and value-added resellers (VARs). Commercial relationships with third-party service providers and VARs provide SideChannel with additional internal capabilities to mitigate cybersecurity risks. We earn licensing revenue from software contracts and commissions from third-party service provider partnerships which are included in this revenue category.\nDuring September 2022 we announced a proprietary product called Enclave which simplifies important cybersecurity tasks called asset inventory and microsegmentation. Enclave seamlessly combines access control, microsegmentation, encryption and other secure networking concepts to create a comprehensive solution. It allows Information Technology to easily segment the enterprise network, place the right staff in those segments and direct traffic.\nRevenue\nThe following revenue metrics are for the twelve months ended September 30, 2023, versus the same period in 2022. These summary metrics are accompanied by a table that reflects the revenue by category in fiscal years 2023 and 2022.\n● Total revenue grew by $1.8 million or 37.2%.\n● vCISO Services category revenue grew by $1.3 million or 42.4%.\n● Cybersecurity Software and Services category revenue grew by $0.5 million or 27.9%.\n(000s) % of Total (000s) % of Total $ Change % Change\nRevenue\nvCISO Services $ 4,383 66.7 % $ 3,077 64.3 % $ 1,306 42.4 %\nCybersecurity Software & Services 2,189 33.3 % 1,712 35.7 % 27.9 %\nTotal $ 6,572\n$ 4,789\n$ 1,783 37.2 %\nThe growth in vCISO Services reflects both growth in clients served and an increase in revenue per client. Cybersecurity Software & Services revenue grew from 2022 to 2023 primarily because of an increase in the use of these services by existing Cybersecurity Software and Services clients and secondarily because of an expansion of the services and software offered.\nWe also monitor new and retained revenue. The revenue earned from clients during our first twelve months of working with them is classified as new; while the revenue earned with clients after our first twelve months of working with them is classified as retained. The following table provides details on our new and retained revenue for fiscal years 2023 and 2022:\nRevenue (000s) % of Total (000s) % of Total $ Change % Change\nvCISO\nNew $ 2,512 57.3 % $ 1,923 62.5 % $ 589 30.6 %\nRetained 1,871 42.7 % 1,154 37.5 % 62.1 %\nTotal $ 4,383\n$ 3,077\n$ 1,306 42.4 %\nCybersecurity Software & Services\nNew $ 659 30.1 % $ 813 47.5 % $ (154 ) (18.9 )%\nRetained 1,530 69.9 % 52.5 % 70.2 %\nTotal $ 2,189\n$ 1,712\n$ 477 27.9 %\nTotal Revenue\nNew $ 3,171 48.3 % $ 2,736 57.1 % $ 435 15.9 %\nRetained 3,401 51.7 % 2,053 42.9 % 1,348 65.7 %\nTotal $ 6,572\n$ 4,789\n$ 1,783 37.2 %\nFurther, we consider revenue retention a key performance indicator. Revenue retention is calculated by dividing retained revenue by the prior year total revenue. The following table shows the revenue retention for fiscal years 2023 and 2022 by revenue category.\nvCISO Services 60.8 % 74.2 %\nCybersecurity Software & Services 89.4 % 80.7 %\nTotal 71.0 % 76.5 %\nResults of Operations\nFiscal Year Ended September 30, 2023, Compared to Fiscal Year Ended September 30, 2022\nRevenue. Our revenue was $6.6 million for the year ended September 30, 2023, compared to $4.8 million in the prior year, an increase of $1.8 million or 37.2%. We believe this increase reflects the factors previously discussed in the Overview section above.\nGross Margins. Gross margins increased to 50.7% in fiscal year 2023 from 48.5% in fiscal year 2022, which we attribute to better utilization of our service delivery team.\nGeneral and Administrative Expenses. Our general and administrative expenses were $3.6 million for the year ended September 30, 2023, compared to $1.5 million for the prior year, an increase of $2.1 or 142.5%. The increase in general and administrative expenses primarily resulted from increased staff and related costs including equity-based compensation; higher professional fees and insurance related to the listed nature of the Company. To a lesser extent there were increases in amortization and travel-related costs.\nSales and Marketing Expenses. Our sales and marketing expenses were $1.3 million for the year ended September 30, 2023, compared to $367,000 for the prior year, an increase of $970,000 or 264.3% resulting from our increase in sales and marketing staff and the related costs combined with a higher spend on third-party marketing services.\nResearch and Development Expenses. Our research and development expenses were $669,000 for the year ended September 30, 2023, compared to $178,000 for the prior year, an increase of $491,000 or 275.8%. These costs arose as a result of the Business Combination and are driven by personnel expenses and costs incurred from independent contractors related to the development of Enclave.\nGoodwill Impairment. The goodwill impairment was zero ($0) for the year ended September 30, 2023. We recorded a $5.7 million goodwill impairment charge during the year ended September 30, 2022. The goodwill was related to the acquisition that occurred on July 1, 2022.\nIntangible Asset Impairment. The intangible asset impairment was $4.9 million for the year ended September 30, 2023, and zero ($0) for the prior year. We recorded a finite-lived intangible asset of $4.9 million as a result of acquiring Enclave in the Business Combination. Our impairment testing indicated the full value of this finite-lived intangible asset should be impaired as of September 30, 2023. Incurring impairment neither indicates a decrease in our emphasis on Enclave as a key initiative nor does it suggest a lack of market interest in the product.\nAcquisition Costs. Acquisition costs were $214,000 for the year ended September 30, 2023, which are attributed to an increase in the Second Tranche shares due to the Closing Working Capital Adjustment from the Business Combination. The costs totaling $6.2 million in the prior year were driven by the Business Combination.\nOther Income. Other Income was $29,000 and $13,000 for fiscal years 2023 and 2022 respectively, which reflect interest income from the cash on deposit at our bank.\nIncome Tax Expense (Benefit). We recorded an income tax benefit of $379,000 for the year ended September 30, 2023, compared to an income tax expense of $195,000 for the year ended September 30, 2022. The fiscal year 2022 expense was an estimate of federal and state income tax liability for SCS which was accounted for as a liability on our September 30, 2022, balance sheet. The actual amount of federal and state income taxes due by SCS of $27,000. The net of these two amounts is a $168,000 tax benefit that we recognized in the current fiscal year. In addition, a deferred state tax liability was recognized for a book versus tax basis difference upon the Business Combination. During the year ended September 30, 2023, this deferred tax liability was reduced to zero resulting in a deferred income tax benefit of $211,000.\nLiquidity and Capital Resources\nCash Flows\nDuring fiscal year 2023, we incurred a net loss of $7.0 million and used $1.9 million of cash in operations. Our primary source of liquidity and capital resources has been the $3.6 million in cash received from Cipherloc in the Business Combination in the prior fiscal year. We had an accumulated deficit of $11.9 million as of September 30, 2022. Three (3) non-recurring expenses totaling $16.8 million are included in our accumulated deficit. The non-recurring expenses are $6.2 million for the acquisition costs, including $6.1 million related to the contingent consideration from the Business Combination, $5.7 million impairment of goodwill recorded as a result of the Business Combination, and $4.9 million impairment of intangible assets.\nOur accumulated deficit at September 30, 2023 was $18.9 million.\nThe following table summarizes, for the periods indicated, selected items in our Statements of Cash Flows ($000s):\nYear Ended September 30,\nNet cash (used in) provided by:\nOperating activities $ (1,945 ) $ (396 )\nInvesting activities $ (32 ) $ 3,589\nFinancing activities $ - $ (511 )\nOperating Activities. Net cash used in operations for the year ended September 30, 2023, was $1.9 million as compared to $396,000 for the year ended September 30, 2022. During fiscal year 2023, we recorded intangible asset impairment of $4.9 million and non-cash charges of $805,000 for amortization and stock compensation expense. Our net accounts receivable grew by $222,000 compared to one year ago due to increased sales activity and we experienced a $547,000 decrease in accounts payable and accrued liabilities primarily due to adjustments made to tax liabilities. These uses of cash were offset by a $150,000 increase in our deferred revenue balance.\nInvesting Activities. We used $32,000 on the purchase of fixed assets during the twelve months ended September 30, 2023.\nFinancing Activities. During the year ended September 30, 2023, there was no cash provided by or used in financing activities.\nAs of September 30, 2023, we had $1.1 million in cash and our working capital was $1.5 million. We believe that our existing cash balances are sufficient to fund our operations through at least December 31, 2024.\nTotal operating expenses during fiscal year 2023 were $5.6 million excluding $214,000 of acquisition costs and intangible asset impairment of $4.9 million. Since May, 2023 through the date of this report, we have eliminated approximately $1.2 million of annual operating expenses which have enabled us to lower our breakeven revenue point and allowed us to expect a lower amount of total operating expenses for fiscal year 2024 than we incurred during 2023. The operating expense reductions are being achieved by staff reductions in all areas of the business and the elimination of non-essential third-party supplier relationships.\nWe anticipate total operating expenses to range between $3.7 million and $4.3 million in the next fiscal year with cash flow from operations ranging between negative $300,000 and positive $100,000, which, if negative, will be funded with our existing cash balances. We intend to manage our business such that our current cash reserves will allow us to reach positive cash flow from our operations, but we cannot assure if and when positive cash flow will be achieved. We dont currently have any credit facilities available to us; however, we have had discussions with several lenders about establishing a line of credit secured by our accounts receivable.\nCritical Accounting Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, expenses, and related disclosure of contingent assets and liabilities. On an on-going basis, we evaluate our estimates, including those related to long-lived assets, goodwill, identifiable intangibles and deferred income tax valuation allowances. We base our estimates on historical experience and on appropriate and customary assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Some of these accounting estimates and assumptions are particularly sensitive because of their significance to our consolidated financial statements and because of the possibility that future events affecting them may differ markedly from what had been assumed when the financial statements were prepared.\nGoodwill, Intangible and Long-Lived Assets\nWe account for goodwill and intangible assets in accordance with Accounting Standards Codification (ASC) Topic 350 (Intangibles- Goodwill and Other). Finite-lived intangible assets are amortized over their estimated useful economic life and are carried at cost less accumulated amortization. Goodwill is assessed for impairment at least annually in the fourth quarter, on a reporting unit basis, or more frequently when events and circumstances occur indicating that the recorded goodwill may be impaired. As a part of the goodwill impairment assessment, we have the option to perform a qualitative assessment to determine whether it is more-likely-than-not that the fair value of a reporting unit is less than its carrying amount. If, as a result of our qualitative assessment, we determine this is the case, we are required to perform a goodwill impairment test to identify potential goodwill impairment and measure the amount of goodwill impairment loss to be recognized. The test is discussed below. If, as a result of our qualitative assessment, we determine that it is more-likely-than-not that the fair value of the reporting unit is greater than its carrying amounts, the goodwill impairment test is not required.\nThe quantitative goodwill impairment test, used to identify both the existence of impairment and the amount of impairment loss, compares the fair value of a reporting unit with its carrying amount, including goodwill. If the fair value of a reporting unit exceeds its carrying amount, goodwill of the reporting unit is considered not impaired. If the carrying amount of a reporting unit exceeds its fair value, an impairment loss shall be recognized in an amount equal to that excess, limited to the total amount of goodwill allocated to that reporting unit. The goodwill impairment assessment is based upon the income approach, which estimates the fair value of our reporting units based upon a discounted cash flow approach. This fair value is then reconciled to our market capitalization at year end with an appropriate control premium. The determination of the fair value of our reporting units requires management to make significant estimates and assumptions including the selection of control premiums, discount rates, terminal growth rates, forecasts of revenue and expense growth rates, income tax rates, changes in working capital, depreciation, amortization and capital expenditures. Changes in assumptions concerning future financial results or other underlying assumptions could have a significant impact on either the fair value of the reporting unit or the amount of the goodwill impairment charge. At September 30, 2023 and 2022, goodwill was $1.4 million. In 2022, we evaluated the initial goodwill recorded from the Business Combination of $7.1 million and determined that the carrying value exceeded the fair value and recorded $5.7 million impairment of goodwill during the year ended September 30, 2022. The fair value of the goodwill at September 30, 2023, as determined by our impairment analysis, is in excess of the carrying value; thus, we have incurred no impairment of goodwill in fiscal year 2023.\nWe did not record indefinite-lived intangible assets in the fiscal years ended September 30, 2023, and 2022.\nLong-lived assets, which consist of finite-lived intangible assets and property and equipment, are assessed for impairment whenever events or changes in business circumstances indicate that the carrying amount of the assets may not be fully recoverable or that the useful lives of these assets are no longer appropriate. Each impairment test is based on a comparison of the estimated undiscounted cash flows to the recorded value of the asset. If impairment is indicated, the asset is written down to its estimated fair value. The cash flow estimates used to determine the impairment, if any, contain managements best estimates using appropriate assumptions and projections at that time. We have a finite-lived intangible asset of $4.9 million and we have less than $30,000 in property and equipment. At September 30, 2023 and 2022, finite-lived intangibles and long-lived assets were zero ($0) and $4.9 million, respectively. The intangible impairment was $4.9 million for the year ended September 30, 2023 and zero ($0) for the prior year. We recorded a finite-lived intangible asset of $4.9 million as a result of acquiring Enclave through the Business Combination. The difficulty of projecting the amount and timing of future revenues caused us to conclude a full impairment of the asset was appropriate. Incurring impairment neither indicates a decrease in our emphasis on Enclave as a key initiative nor does it suggest a lack of market interest in the product.\nOff-Balance Sheet Arrangements\nWe did not have during the periods presented, nor do we currently have, any off-balance sheet arrangements as defined under applicable SEC rules. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company is not required to provide the information required by this Item as it is a smaller reporting company, as defined in Rule 229.10(f)(1) of Regulation S-K promulgated by the SEC. ITEM 8. FINANCIAL STATEMENTS\nSIDECHANNEL, INC.\nPage\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM (PCAOB ID Number 587)\nFINANCIAL STATEMENTS:\nBalance Sheets as of September 30, 2023 and 2022\nStatements of Operations for the years ended September 30, 2023 and 2022\nStatements of Stockholders Equity for the years ended September 30, 2023 and 2022\nStatements of Cash Flows for the years ended September 30, 2023 and 2022\nNOTES TO FINANCIAL STATEMENTS\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of SideChannel, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of SideChannel, Inc., (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of operations and comprehensive loss, stockholders equity, and cash flows for each of the years in the two-year period ended September 30, 2023, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the years in the two-year period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nWe determined that there are no critical audit matters.\n/s/ RBSM LLP\nWe have served as the Companys auditor since 2021.\nLas Vegas, Nevada\nDecember 27, 2023\nRBSM LLP (PCAOB ID Number 587)\nSIDECHANNEL, INC.\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except share and per share data)\nSeptember 30, 2023 September 30, 2022\nASSETS\nCurrent assets\nCash $ 1,053 $ 3,030\nAccounts receivable, net\nDeferred costs\nPrepaid expenses and other current assets\nTotal current assets 2,448 4,142\nFixed assets, net -\nGoodwill 1,356\n1,356\nIntangible assets - 4,940\nDeferred costs\nTotal assets $ 3,984 $ 10,768\nLIABILITIES & STOCKHOLDERS EQUITY\nCurrent liabilities\nAccounts payable and accrued liabilities $ 613 $ 786\nDeferred revenue\nPromissory note payable\nIncome taxes payable\nTotal current liabilities 1,161\nDeferred tax liability -\nTotal liabilities 1,372\nCommitments and contingencies - -\nSeries A convertible preferred stock, $0.001 par value, 10,000,000 shares authorized; 0 and 100 shares issued and outstanding as of September 30, 2023 and 2022, respectively - -\nCommon stock, $0.001 par value, 681,000,000 shares authorized; 213,854,781 and 148,724,056 shares issued and outstanding as of September 30, 2023 and 2022, respectively\nAdditional paid-in capital 21,755 21,180\nAccumulated deficit (18,939 ) (11,933 )\nTotal stockholders equity 3,030 9,396\nTotal liabilities and stockholders equity $ 3,984 $ 10,768\nSIDECHANNEL, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands, except share and per share data)\n(Unaudited)\nTwelve Months Ended\nSeptember 30,\nRevenues $ 6,572 $ 4,789\nCost of revenues 3,240 2,468\nGross profit 3,332 2,321\nOperating expenses\nGeneral and administrative 3,586 $ 1,482\nSelling and marketing 1,337\nResearch and development\nGoodwill impairment - 5,702\nIntangible asset impairment 4,940\n-\nAcquisition costs 6,186\nTotal operating expenses 10,746 13,915\nOperating loss (7,414 ) (11,594 )\nOther income, net\nNet loss before income tax expense $ (7,385 ) $ (11,581 )\nIncome tax expense (benefit) (379 )\nNet loss after income tax expense (benefit) $ (7,006 ) $ (11,776 )\nNet loss per common share - basic and diluted $ (0.04 ) $ (0.14 )\nWeighted average common shares outstanding - basic and diluted 175,274,762 81,997,953\nSIDECHANNEL, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\n(In thousands, except preferred shares)\n(Unaudited)\nPreferred Shares Preferred Par Value Common Shares Common Par Value Additional Paid-in-Capital Accumulated Earnings / (Deficit) Stockholders Equity\nFor the Twelve Months Ended September 30, 2023 and 2022\nPreferred Shares Preferred Par Value Common Shares Common Par Value Additional Paid-in-Capital Accumulated Earnings / (Deficit) Stockholders Equity\nBalance at September 30, 2021 $ - 59,900 $ 60 $ 23 $ 344 $ 427\nEquity redemptions - - - - - (100 ) (100 )\nEquity distributions - - - - - (461 ) (461 )\nShares issued for services - - -\nShares issued for vesting of RSUs - - - -\nAcquisition costs - contingent consideration - - - - 6,061 - 6,061\nCipherloc Business Combination - - 88,445 15,024 15,172\nNet loss - - - - - (11,776 ) (11,776 )\nBalance at September 30, 2022 $ - 148,724 $ 149 $ 21,180 $ (11,933 ) $ 9,396\nBalance $ - 148,724 $ 149 $ 21,180 $ (11,933 ) $ 9,396\nShares issued for services - - - -\nStock-based compensation expense - - 2,343 -\nConversion of Preferred to Common (100 ) - - - - - -\nBusiness Combination - Contingent Consideration\n62,017\nNet loss - - - - - (7,006 ) (7,006 )\nBalance at September 30, 2023 - $ - 213,855 $ 214 $ 21,755 $ (18,939 ) $ 3,030\nBalance - $ - 213,855 $ 214 $ 21,755 $ (18,939 ) $ 3,030\nSIDECHANNEL, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands, unaudited)\nYear Ended September 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (7,006 ) $ (11,776 )\nAdjustments to reconcile net loss to net cash flows used in operating activities:\nDepreciation and Amortization\nStock-based compensation\nProvision for doubtful accounts\nBusiness combination related costs 6,061\nGoodwill impairment - 5,702\nIntangible asset impairment 4,940\n-\nChanges in operating assets and liabilities:\nAccounts receivable (225 ) (461 )\nUnbilled revenue - -\nPrepaid expenses and other assets (61 )\nAccounts payable and accrued liabilities (547 ) (18 )\nDeferred revenue (65 )\nNet cash used in operating activities (1,945 ) (396 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nCash and cash equivalents acquired in connection with the Business Combination\n3,589\nPurchase of fixed assets (32 ) -\nNet cash provided by (used in) investing activities (32 ) 3,589\nCASH FLOWS FROM FINANCING ACTIVITIES:\nEquity redemption - (50 )\nEquity distribution - (461 )\nNet cash used in financing activities - (511 )\n(DECREASE) INCREASE IN CASH (1,977 ) 2,682\nCASH, BEGINNING OF PERIOD 3,030\nCASH, END OF PERIOD $ 1,053 $ 3,030\nNON-CASH INVESTING AND FINANCING ACTIVITIES:\nShares issued for services $ 66 $ 43\nEquity redemption with notes payable $ - $ 50\nStock-based compensation included in accounts payable and accrued liabilities $ 21 $ -\nAssets acquired and liabilities assumed $ - $ 11,583\nSIDECHANNEL, INC.\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023, AND 2022\nNOTE 1 - DESCRIPTION OF BUSINESS\nOur mission is to make cybersecurity simple and accessible for mid-market and emerging companies, a market that we believe is currently underserved. We believe that our cybersecurity product and service offerings provide cybersecurity and privacy risk management solutions for our customers. We anticipate that our target customers will continue to need cost-effective security solutions. We intend to provide more tech-enabled services to address the needs of our customers, including virtual Chief Information Security Officer (vCISO), zero trust, third-party risk management, due diligence, privacy, threat intelligence, and managed end-point security solutions.\nOur growth strategy focuses on these three initiatives:\n1. Securing new vCISO clients\n2. Adding new Cybersecurity Software and Services offerings\n3. Increasing adoption of Cybersecurity Software, including Enclave and Services offerings, at vCISO clients\nvCISO engagements typically contain a monthly subscription and rates for vCISO time and material projects ranging from $350 to $425 per hour. Each of our vCISOs is generally embedded into the C-suite executive teams of two (2) to four (4) of our clients. We augment our vCISO offering with a full range of other cybersecurity products and services through a team of security engineer employees combined with a network of third-party service providers and value-added resellers.\nOn July 1, 2022 (the Closing Date) the Company, then known as Cipherloc Corporation, a Delaware corporation, completed its acquisition (Business Combination) of all the outstanding equity securities of SideChannel, Inc., a Massachusetts corporation pursuant to an Equity Securities Purchase Agreement dated May 16, 2022 (the Purchase Agreement). On September 9, 2022, SideChannel, Inc. the acquired Massachusetts corporation and a subsidiary of the registrant, changed its name to SCS, Inc. (the Subsidiary or SCS) and Cipherloc Corporation, the Delaware parent company of the subsidiary has changed its name to SideChannel, Inc.\nThe transaction was accounted for as a reverse acquisition (reverse merger) in accordance with GAAP. Under this method of accounting, SCS was deemed to be the accounting acquirer for financial reporting purposes. This determination was primarily based on the facts that, immediately following the Business Combination: (1) the majority of the Board of Directors of the combined company will be composed of directors designated by the Sellers under the terms of the Purchase Agreement; and (2) existing members of SCS management constituted the management of the combined company. Because SCS has been determined to be the accounting acquirer in the Business Combination, but not the legal acquirer, the transaction is deemed a reverse acquisition under the guidance of the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 805, Business Combinations. As a result, the historical financial statements of SideChannel are the historical financial statements of the combined company.\nFollowing the closing of the Business Combination, SCS, Inc. became a wholly owned subsidiary of the Company. As used herein, the words the Company refers to, for periods following the Business Combination, SideChannel, Inc., together with its subsidiaries.\nOur headquarters are located at 146 Main Street, Suite 405, Worcester, MA, 01608. Our website is www.sidechannel.com.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation and Use of Estimates\nThe accompanying consolidated financial statements include our accounts and those of our wholly owned subsidiaries. All significant intercompany accounts and transactions have been eliminated upon consolidation. The preparation of financial statements in conformity with U.S. GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates. Certain of our accounts, including goodwill, identifiable intangibles, and deferred tax assets and liabilities, including related valuation allowances, are based upon estimates.\nReclassifications\nCertain prior year amounts have been reclassified to be comparable with the current years presentation.\nBusiness Combinations\nAcquired businesses are accounted for using the purchase method of accounting, which requires that the purchase price be allocated to the net assets acquired at their respective fair values. Any excess of the purchase price over the estimated fair values of the net assets acquired is recorded as goodwill. Fair values of intangible assets are estimated by valuation models prepared by our management and third-party advisors. The assets purchased and liabilities assumed have been reflected in our consolidated balance sheets, and the operating results are included in the consolidated statements of operations and consolidated statements of cash flows from the date of acquisition. Any change in the fair value of acquisition-related contingent consideration subsequent to the acquisition date, including changes from events after the acquisition date, will be recognized in the consolidated statement of operations in the period of the estimated fair value change. Acquisition-related transaction costs, including legal and accounting fees and other external costs directly related to the acquisition, are recognized separately from the acquisition and expensed as incurred in general and administrative expense in the consolidated statements of operations.\nCash and Cash Equivalents\nWe consider all highly liquid investments with an original maturity of three months or less to be cash equivalents. We did not have any cash equivalents as of September 30, 2023, and 2022. As of September 30, 2023, and 2022, our cash included cash on hand and cash in the bank. We maintain our cash in accounts held by highly reputable financial institutions which, at times, may exceed federally insured limits as guaranteed by the Federal Deposit Insurance Corporation (FDIC). The FDIC insures these deposits up to $250,000. As of September 30, 2023, approximately $0.8 million of our cash balance was uninsured. We have not experienced any losses on cash.\nAccounts Receivable\nTrade accounts receivable are recorded at the invoiced amount and do not bear interest. We grant credit to customers and generally require no collateral. We do not have any significant off-balance sheet credit exposure related to our customers. We had one (1) customer with an accounts receivable balance that exceeded 10% of accounts receivable at September 30, 2023. Cash flows from accounts receivable are recorded in operating cash flows.\nFair Value of Financial Instruments\nOur financial instruments consisted primarily of cash, accounts receivable, accounts payable and accrued expenses, and embedded conversion features in stock warrants. The carrying amounts of such financial instruments approximate their respective estimated fair value due to the short-term maturities and approximate market interest rates of these instruments.\nFair value is focused on an exit price that would be received upon sale of an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Within the measurement of fair value, the use of market-based information is prioritized over entity specific information and a three-level hierarchy for fair value measurements is used based on the nature of inputs used in the valuation of an asset or liability as of the measurement date.\nThe three-level hierarchy for fair value measurements is defined as follows:\n● Level 1 - inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets;\n● Level 2 - inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability other than quoted prices, either directly or indirectly, including inputs in markets that are not considered to be active;\n● Level 3 - inputs to the valuation methodology are unobservable and significant to the fair value measurement.\nThe fair values of the warrants issued by the Company as part of the acquisition price were determined using level 2 measurements and are discussed in further detail in Note 3.\nGoodwill, Intangible, and Long-Lived Assets\nWe account for goodwill and intangible assets in accordance with Accounting Standards Codification (ASC) Topic 350 (Intangibles - Goodwill and Other). Finite-lived intangible assets are amortized over their estimated useful economic life and are carried at cost less accumulated amortization. Goodwill is assessed for impairment annually during the fourth quarter on a reporting unit basis, or more frequently when events and circumstances occur indicating that the recorded goodwill may be impaired. Goodwill is considered to be impaired if the fair value of a reporting unit is less than its carrying amount. As a part of the goodwill impairment assessment, we have the option to perform a qualitative assessment to determine whether it is more-likely-than-not that the fair value of a reporting unit is less than its carrying amount. If, as a result of our qualitative assessment, we determine that it is more-likely-than-not that the fair value of the reporting unit is greater than its carrying amount, a quantitative goodwill impairment test is not required. However, if, as a result of our qualitative assessment, we determine it is more-likely-than-not that the fair value of a reporting unit is less than its carrying amount, or, if we choose not to perform a qualitative assessment, we are required to perform a quantitative goodwill impairment test to identify potential goodwill impairment and measure the amount of goodwill impairment loss to be recognized.\nThe quantitative goodwill impairment test compares the fair value of a reporting unit with its carrying amount, including goodwill. If the fair value of a reporting unit exceeds its carrying amount, goodwill of the reporting unit is considered not impaired. If the carrying amount of a reporting unit exceeds its fair value, an impairment loss will be recognized in an amount equal to that excess, limited to the total amount of goodwill allocated to that reporting unit. The goodwill impairment assessment is based upon the income approach, which estimates the fair value of our reporting units based upon a discounted cash flow approach. This fair value is then reconciled to our market capitalization at year end with an appropriate control premium. The determination of the fair value of our reporting units requires management to make significant estimates and assumptions including the selection of control premiums, discount rates, terminal growth rates, forecasts of revenue and expense growth rates, income tax rates, changes in working capital, depreciation, amortization, and capital expenditures. Changes in assumptions concerning future financial results or other underlying assumptions could have a significant impact on either the fair value of the reporting unit or the amount of the goodwill impairment charge. The goodwill was evaluated at the acquisition date of July 1, 2022, and the fair value of the goodwill was determined to be less than the carrying amount of the goodwill by $5.702 thousands. As a result, an impairment charge was recorded on the acquisition date of $5.7 million was recorded, and the net carrying amount of goodwill was $1.4 million as of September 30, 2022.\nThe goodwill was evaluated at the balance sheet date of September 30, 2023. For fiscal year 2023, we recorded no impairment of goodwill. For fiscal year 2022, we incurred $5.7 million of goodwill impairment.\nNone of the goodwill associated with the Business Combination is deductible for income tax purposes.\nWe did not record indefinite-lived intangible assets in the fiscal years ended September 30, 2023, and 2022.\nLong-lived assets, which consist of finite-lived intangible assets and property and equipment, are assessed for impairment whenever events or changes in business circumstances indicate that the carrying amount of the assets may not be fully recoverable or that the useful lives of these assets are no longer appropriate. Each impairment test is based on a comparison of the estimated undiscounted cash flows to the recorded value of the asset. If impairment is indicated, the asset is written down to its estimated fair value. The cash flow estimates used to determine the impairment, if any, contain managements best estimates using appropriate assumptions and projections at that time.\nWe recorded $4.9 million of finite-lived intangible assets in the form of Acquired In Process Research & Development (AIPR&D) as a result of acquiring Enclave in the Business Combination as of September 30, 2022. Under ASC 805, AIPR&D are initially recognized at fair value and classified as finite-lived assets until the successful completion or abandonment of the associated research and development efforts. During the development period, these assets will not be amortized as charges to earnings; instead, these assets will be tested for impairment on an annual basis or more frequently if impairment indicators are identified. An impairment loss is measured based on the excess of the carrying amount over the assets fair value. Our impairment testing as of September 30, 2023, indicated the full value of this finite-lived intangible asset should be impaired. The difficulty of projecting the amount and timing of future revenues caused us to conclude a full impairment of the asset was appropriate. Incurring impairment neither indicates a decrease in our emphasis on Enclave as a key initiative nor does it suggest a lack of market interest in the product. The Company did not record any finite-lived intangible asset impairment for the year ended September 30, 2022.\nRevenue Recognition\nWe recognize revenue in accordance with the guidance in ASC Topic 606 (Revenue from Contracts with Customers). We recognize revenue for the sale of products or services when our performance obligations under the terms of a contract with a customer are satisfied and control of the product or service has been transferred to the customer. Generally, this occurs when we deliver a product or perform a service. In certain cases, recognition of revenue is deferred until the product or service is received by the customer or at some other point in the future when we have determined that we have satisfied our performance obligations under the contract. Our contracts with customers may include a combination of products and services, which are generally capable of being distinct and accounted for as separate performance obligations.\nRevenue recognition guidance is a five-step revenue recognition model that requires reporting entities to:\n1. Identify the contract,\n2. Identify the performance obligations of the contract,\n3. Determine the transaction price of the contract,\n4. Allocate the transaction price to the performance obligations, and\n5. Recognize revenue.\nRevenue is recorded in an amount that reflects the consideration we expect to receive in exchange for those products or services. We do not have any material variable consideration arrangements, or any material payment terms with our customers other than standard payment terms which generally range from net 15 to net 90 days.\nNature of Products and Services\nWe identify, develop, and deploy cybersecurity and privacy risk management solutions for our clients and customers in North America. We categorize our products and services as either vCISO Services or Cybersecurity Software and Services. In addition to Enclave, our proprietary software product, we also sell third-party software and services through a network of strategic partnerships.\nTypes of Contracts with Customers\nOur contracts with customers are generally structured as annual subscription agreements or project specific statements of work. Our annual subscription agreements include a minimum number of service hours purchased during the subscription time period. Payment terms and any other customer-specific acceptance criteria are also specified in the contracts and statements of work.\nContract Balances\nWe record accounts receivable at the time of invoicing. Accounts receivable, net of the allowance for doubtful accounts, is included in current assets on our balance sheet. To the extent that we do not recognize revenue at the same time as we invoice, we record a liability for deferred revenue. In certain instances, we also receive customer deposits in advance of invoicing and recording of accounts receivable. Deferred revenue and customer deposits are included in current liabilities on our consolidated balance sheets.\nWe maintain an allowance for doubtful accounts (allowance) equal to 3% of the ending quarterly accounts receivable balance. The allowance is rounded up to the nearest $10,000.\nCosts to Obtain a Contract with a Customer\nThe only costs we incur associated with obtaining contracts with customers are marketing costs incurred with third-party service providers and sales commissions that we pay to our employees, contractors, or third-party sales representatives. Commissions are calculated based on set percentages of the revenue value of each product or service sold. Commissions are considered earned by our internal sales personnel at the time we recognize revenue for a particular transaction. Commissions are considered earned by third-party sales representatives at the time that revenue is recognized for a particular transaction. We record commission expense in our consolidated statements of operations at the time the commission is earned. Commissions earned but not yet paid are included in current liabilities on our balance sheets.\nSee Note 4 for further information about our revenue from contracts with customers.\nLeases\nWe account for leases in accordance with ASC Topic 842 (Leases). We determine if an arrangement is a lease at inception. A lease contract is within scope if the contract has an identified asset (property, plant, or equipment) and grants the lessee the right to control the use of the asset during the lease term. The identified asset may be either explicitly or implicitly specified in the contract. In addition, the supplier must not have any practical ability to substitute a different asset and would not economically benefit from doing so for the lease contract to be in scope. The lessees right to control the use of the asset during the term of the lease must include the ability to obtain substantially all of the economic benefits from the use of the asset as well as decision-making authority over how the asset will be used. Leases are classified as either operating leases or finance leases based on the guidance in ASC Topic 842. Operating leases are included in operating lease ROU assets and operating lease liabilities in our consolidated balance sheets. Finance leases are included in property and equipment and financing lease liabilities. We do not currently have any financing leases.\nOperating lease payments are included in cash outflows from operating activities on our consolidated statements of cash flows.\nWe have made an accounting policy election not to apply the recognition requirements of ASC Topic 842 to short-term leases (leases with a term of one year or less at the commencement date of the lease). Lease expense for short-term lease payments is recognized on a straight-line basis over the lease term.\nFollowing the guidance of ASC Topic 842, we are not required to record ROU assets and operating lease liabilities.\nSee Note 7 for further disclosures regarding our leases.\nResearch and Development and Software Development Costs\nWe expense all research and development costs, including patent and software development costs. Our research and development costs incurred for the year ended September 30, 2023, were $669,000.\nStock-Based Compensation\nWe account for stock-based compensation in accordance with ASC Topic 718 (Compensation - Stock Compensation) which requires that employee share-based equity awards be accounted for under the fair value method and requires the use of an option pricing model for estimating fair value of awards, which is then amortized to expense over the service periods. See further disclosures related to our stock-based compensation plans in Note 8.\nLegal\nWe are subject to legal proceedings, claims, and liabilities which arise in the ordinary course of business, and we accrue for losses associated with legal claims when such losses are probable and can be reasonably estimated. These accruals are adjusted as additional information becomes available or circumstances change. Legal fees are charged to expense as they are incurred.\nIncome Taxes\nWe utilize the asset and liability method in accounting for income taxes. Under this method, deferred tax assets and liabilities are recognized for operating loss and tax credit carryforwards and for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the year in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the results of operations in the period that includes the enactment date. A valuation allowance is recorded to reduce the carrying amounts of deferred tax assets unless it is more likely than not that the value of such assets will be realized.\nWe use the two-step approach to recognize and measure uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. The second step is to measure the tax benefit as the largest amount, which is more than 50% likely of being realized upon ultimate settlement. We consider many factors when evaluating and estimating our tax positions and tax benefits, which may require periodic adjustments. We did not record any liabilities for uncertain tax positions during the years ended September 30, 2023, or 2022.\nNet Loss Per Common Share\nBasic loss per share is computed by dividing net loss available to common stockholders by the weighted average number of common shares outstanding during the reporting period. The weighted average number of shares is calculated by taking the number of shares outstanding and weighting them by the amount of time that they were outstanding. Diluted earnings per share reflects the potential dilution that could occur if stock options, warrants, and other commitments to issue common stock were exercised or equity awards vest resulting in the issuance of common stock that could share in our earnings.\nDiluted loss per share is the same as basic loss per share during periods where net losses are incurred since the inclusion of the potential common stock equivalents would be anti-dilutive as a result of the net loss. During the year ended September 30, 2023, 69,281,020 warrants and 8,636,973 restricted stock units were excluded from the calculation of diluted loss per share because their effect would be anti-dilutive. At September 30, 2022, anti-dilutive warrants and restricted stock units outstanding were 87,628,920 and 4,309,262, respectively.\nSegment Information\nWe manage our operations as a single operating segment for the purposes of assessing performance and making operating decisions. Our focus is on the research, development, and commercialization of our technology.\nWarrants\nWe evaluate warrants in accordance with Topic 480 of the FASB ASC and Topic 815 of the FASB ASC. The result of this accounting treatment is that the fair value of the embedded derivative, if required to be bifurcated, is marked-to-market at each balance sheet date and recorded as a liability. The change in fair value is recorded in the Statement of Operations as a component of other income or expense. Upon exercise of a warrant, it is marked to fair value at the exercise date and then that fair value is reclassified to equity.\nRecent Accounting Announcements\nFASB issues Accounting Standards Updates (ASU) to amend the authoritative literature in the ASC. There have been several ASUs to date that amend the original text of the ASCs. Other than those discussed below, we believe those ASUs issued to date either (i) provide supplemental guidance, (ii) are technical corrections, (iii) are not applicable to us, or (iv) are not expected to have a significant impact on us.\nAccounting Pronouncements Adopted\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. This guidance removes certain exceptions to the general principles in Topic 740 and enhances and simplifies various aspects of the income tax accounting guidance, including requirements such as tax basis step-up in goodwill obtained in a transaction that is not a business combination, ownership changes in investments, and interim-period accounting for enacted changes in tax law. This standard is effective for fiscal years and interim periods within those fiscal years beginning after December 15, 2021. We adopted it on October 1, 2022, without material impact on our financial statements.\nAccounting Pronouncements Not Yet Adopted\nIn June 2016, the FASB issued amendments to the guidance for accounting for credit losses. In November 2019, the FASB deferred the effective date of these amendments for certain companies, including smaller reporting companies. As a result of the deferral, the amendments are effective for us for reporting periods beginning after September 30, 2023. The amendments replace the incurred loss impairment methodology under current GAAP with a methodology that reflects expected credit losses and requires the use of a forward-looking expected credit loss model for accounts receivables, loans, and other financial instruments. The amendments require a modified retrospective approach through a cumulative-effect adjustment to retained earnings as of the beginning of the first reporting period in which the guidance is effective. We plan to adopt the amendments when they become effective for us on October 1, 2023. The adoption of this standard is not expected to have a material impact on the Companys consolidated financial statements.\nNOTE 3 - REVERSE MERGER BETWEEN CIPHERLOC CORPORATION AND SIDECHANNEL, INC. (now known as SCS, Inc.)\nOverview of the Business Combination\nOn July 1, 2022 (the Closing Date) the Company, then known as Cipherloc Corporation, a Delaware corporation, completed its acquisition (Business Combination) of all the outstanding equity securities of SideChannel, Inc., a Massachusetts corporation pursuant to an Equity Securities Purchase Agreement dated May 16, 2022 (the Purchase Agreement). On September 9, 2022, SideChannel, Inc. the acquired Massachusetts corporation and a subsidiary of the registrant, changed its name to SCS, Inc. (the Subsidiary or SCS) and Cipherloc Corporation, the Delaware parent company of the subsidiary has changed its name to SideChannel, Inc.\nThe transaction was accounted for as a reverse acquisition (reverse merger) in accordance with GAAP. Under this method of accounting, SCS was deemed to be the accounting acquirer for financial reporting purposes. This determination was primarily based on the facts that, immediately following the Business Combination: (1) the majority of the Board of Directors of the combined company will be composed of directors designated by the Sellers under the terms of the Purchase Agreement; and (2) existing members of SCS management constituted the management of the combined company. Because SCS has been determined to be the accounting acquirer in the Business Combination, but not the legal acquirer, the transaction is deemed a reverse acquisition under the guidance of the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 805, Business Combinations. As a result, the historical financial statements of SideChannel are the historical financial statements of the combined company.\nFollowing the closing of the Business Combination, SCS, Inc. became a wholly owned subsidiary of the Company. As used herein, the words the Company refers to, for periods following the Business Combination, SideChannel, Inc., together with its subsidiaries.\nSummary of the Business Combination Terms\nPursuant to the Purchase Agreement, on the Closing Date, the former shareholders of the Subsidiary (the Sellers) exchanged all of their equity securities in the Subsidiary for a total of 59,900,000 shares of the Companys common stock (the First Tranche Shares), and 100 shares of the Companys newly designated Series A Preferred Stock, $0.001 par value (the Series A Preferred Stock). The Sellers were entitled to receive up to an additional 59,900,000 shares of the Companys common stock (the Second Tranche Shares and together with the First Tranche Shares and the Series A Preferred Stock, the Shares) at such time that the operations of the Subsidiary, as a subsidiary of the Company, achieved at least $5.5 million in revenue (the Milestone) for any twelve-month period occurring after the Closing Date and before the 48-month anniversary of the execution of the Purchase Agreement. The Second Tranche shares were valued using the closing price on July 1, 2022 of $0.10 per share which resulted in a fair value of $6.1 million.\nThe number of the Second Tranche Shares could have been reduced or increased, based upon whether the Subsidiarys working capital as of the Closing Date was less than or more than zero. The number of the Second Tranche Shares was also subject to adjustment based upon any successful indemnification claims made by the Company pursuant to the Purchase Agreement.\nAs previously disclosed in Form 8-K dated May 9, 2023, a total of 62,016,618 shares of common stock were issued for the Second Tranche and Closing Working Capital Adjustment.\nThe Shares are subject to a Lock-Up/Leak-Out Agreement, pursuant to which, subject to certain exceptions, the Sellers may not directly or indirectly offer to sell, or otherwise transfer, any of the Shares for twenty-four months after the Closing Date without the prior written consent of the Company. Notwithstanding the foregoing, pursuant to the Lock-Up/Leak-Out Agreement, each of the Sellers may sell up to 20% of their Shares beginning twelve months after the Closing Date, and the remaining 80% of their shares of Common Stock beginning twenty-four months after the Closing Date. The Company is currently performing a formal valuation of the acquisition, including an analysis of any purchase price adjustments, and a review of the assets and liabilities acquired to determine appropriate fair values.\nReverse Merger Accounting\nThe Business Combination was accounted for as a reverse merger involving only the exchange of equity. SCS is the accounting acquirer and Cipherloc is the legal acquirer. In order to account for the acquisition, management closed the books of Cipherloc on the Closing Date, closed all equity accounts to additional paid in capital and merged the balance sheets as of the Closing Date. SCS maintained its historical financial statements, only consolidating Cipherlocs assets, liabilities, and equity as of the Closing Date.\nBecause the transaction was between two operating companies, the consideration for Cipherloc assumed by SCS to effectuate the Business Combination was fair valued at approximately $15.2 million composed of $9.0 million in market capitalization of Cipherloc on July 1, 2022 (88.4 million shares outstanding and a per share price of $0.101 plus $6.2 million for the fair value of warrants outstanding on July 2, 2022).\nCipherloc consolidated SCS as of the closing date of the agreement, and the results of operations of Cipherloc include those of SCS. The historical financial statements of Cipherloc before the Business Combination have been replaced with the historical financial statements of SCS before the Business Combination in all future filings with the SEC.\nOn July 5, 2022, Cipherloc amended and restated its articles of incorporation with the office of the Secretary of State of Delaware to change the Companys name to SideChannel, Inc.\nThe Company valued Cipherlocs equity to determine the consideration paid and the purchase price allocation.\nConsideration Paid\nThe consideration paid was determined as follows:\nSCHEDULE OF CONSIDERATION PAID\nShares outstanding 88,445,832\nClosing stock price on July 1, 2022 $ 0.10\nMarket capitalization on July 1, 2022 $ 8,949,834\nFair value of warrants vested at July 1, 2022 $ 6,222,412\nTotal fair value of Cipherloc at July 1, 2022 $ 15,172,246\nThe Company utilized the following assumptions in its Black-Scholes warrant valuation model to calculate the estimated fair value of the financing warrants as of July 1, 2022:\n● Exercise prices: $0.18 to $1.20 ($0.56 weighted average)\n● Expected life in years: 1 to 8.5 years (3.7 weighted average)\n● Annualized volatility: 168.3%\n● Risk free rate: 2.9% to 3.0%\n● Annual Rate of dividends: 0%\nThe Companys objective in estimating expected volatility is to ascertain the assumption about expected volatility that marketplace participants would likely use in determining an exchange price for an option. The Company estimates expected volatility by considering its historical volatility and also considers, based on available information, how the expected volatility of its share price may differ from historical volatility. The Company believes the implied volatility can be useful in estimating expected volatility because it is generally reflective of both historical volatility and expectations of how future volatility will differ from historical volatility. The Company has made a good faith effort to estimate volatility utilized which will result in the best estimate of expected volatility. As of July 1, 2022, the volatility rate used was 168.3%.\nPurchase Price Allocation\nThe acquisition purchase price is allocated based on the fair values of the assets acquired and liabilities assumed, which are based on management estimates and third-party appraisals. The Company engaged a valuation expert to provide guidance to management which was considered and in part relied upon in completing its purchase price allocation. The excess of the purchase price over the aggregate estimated fair value of net assets acquired was allocated to goodwill.\nThe following table summarizes the allocation of the purchase price of the assets and liabilities acquired related to the acquisition as of the closing date (in thousands):\nSUMMARY OF ALLOCATION OF THE PURCHASE PRICE OF THE ASSETS AND LIABILITIES ACQUIRED RELATED TO THE ACQUISITION\nCash\n$ 3,589\nPrepaid expenses and deferred costs\nIntangible assets (AIPR&D)\n4,940\nGoodwill\n7,058\nAccounts payable and accrued liabilities\n(612 )\nDeferred Tax Liability\n(211 )\nAccrued compensation\n(175 )\nConsideration\n$ 15,172\nDeferred Costs\nOn July 23, 2021, Cipherloc entered into a financial advisory and consulting agreement with Paulson Investment Company, LLC (Paulson). The agreement with Paulson remains in place after the Business Combination. Pursuant to the agreement, Paulson will provide the following services at the Companys request: (a) familiarize itself with the Companys business, assets, and financial condition; (b) assist the Company in developing strategic and financial objectives; (c) assist the Company in increasing its exposure in the software industry; (d) assist the Company in increasing its profile in the investment and financial community through introductions to analysts and potential investors, participation in investment conferences and exploitation of reasonably available media opportunities; (e) identify potentially attractive merger and acquisition opportunities; (f) review possible innovative financing opportunities and (g) render other financial advisory services as may be reasonably requested. The term of the agreement is four years from the date of the agreement, unless terminated earlier by either party as provided therein. As compensation for these services, the Company issued to Paulson 4,000,000 shares of the Companys common stock and agreed to reimburse Paulson for all reasonable and documented expenses incurred by Paulson in connection with providing such services. The fair value of the shares issued was $720,000, which Cipherloc recognized as deferred costs which are amortized at a rate of $45,000 per quarter. The unamortized balance of the deferred cost was $555,000 at June 30, 2022. During the years ended September 30, 2023, and September 30, 2022, the Company expensed $180,000 and $45,000 in amortization expenses respectively. The unamortized balance of the deferred costs was $330,000 at September 30, 2023.\nIntangible Assets\nThe estimated fair values of the identifiable intangible assets acquired were calculated using an income valuation approach which requires a forecast of expected future cash flows either through the use of relief-from-royalty method or multi-period excess earnings methods (MPEEM). The estimated useful lives are based on the Companys experience and expectations as to the duration of the time the Company expects to realize benefits of the assets.\nThe estimated fair values of the identifiable intangible assets acquired, estimated useful lives and related valuation methodology are as follows as of September 30, 2022:\nSCHEDULE OF ESTIMATED FAIR VALUES OF THE IDENTIFIABLE INTANGIBLE ASSETS ACQUIRED, ESTIMATED USEFUL LIVES\nIntangible Assets: Preliminary Fair Value (in thousands) Estimated Life in Years Discount Rate Valuation Method\nAIPR&D $ 4,940 5-15 22.75 % Income (MPEEM)\nWe conducted a fair value analysis of the intangible assets acquired as of September 30, 2023 and concluded that the full carrying value of this asset should be impaired. Our balance sheet as of September 30, 2023 reflects this conclusion. Incurring impairment neither indicates a decrease in our emphasis on Enclave as a key initiative nor does it suggest a lack of market interest in the product.\nDeferred Tax Liability\nAs part of the Business Combination, we acquired federal tax net operating loss carryforwards of approximately $35 million. In addition, the intangible asset acquired, AIPR&D, has no basis for tax and resulted in a temporary difference of $4.9 million. These two items were offset and resulted in a deferred tax asset of approximately $7.0 million, which was fully reserved.\nFor state tax purposes, there were only limited state net operating loss carryforwards; consequently, the temporary difference from the intangible asset acquired resulted in a state deferred tax liability of $211,000 at September 30, 2022. At September 30, 2023, there were additional state net operating loss carryforwards to offset the temporary difference from the intangible asset acquired, resulting in a state deferred tax liability of zero ($0).\nUnaudited Pro Forma Operating Results\nThe following presents the unaudited proforma combined results of operations of Cipherloc with SCS for the year ended September 30, 2022 as if the entities were combined on October 1, 2020.\nSCHEDULE OF UNAUDITED PROFORMA OPERATIONS RESULTS\n(In thousands, except per share data)\nFor the Year Ended\nSeptember 30, 2022\nRevenues\n$ 4,789\nCost of revenues\n2,467\nGross profit\n2,322\nOperating expenses (a)\n4,860\nOperating income (loss)\n(2,538 )\nOther income and (expenses)\nNet income (loss) before income taxes\n(2,525 )\nIncome taxes\nNet income (loss)\n$ (2,720 )\nBasic loss per share (b)\n$ (0.03 )\n(a) All costs incurred in connection with the acquisition have been removed from operating expenses in the proforma statement of operations. In fiscal year 2022, Cipherloc incurred $479,000 of transaction expenses and SCS incurred $109,000 of transaction expenses.\n(b) Pro forma weighted average shares outstanding are 82.0 million for the year ended September 30, 2022.\nNOTE 4 - REVENUE\nCustomer Concentration\nNo one customer accounted for more than ten percent (10%) of our revenues during the years ended September 30, 2023, and 2022.\nDeferred Revenue\nDeferred revenue is comprised mainly of unearned revenue related to CISO, risk management, and other professional services. Deferred revenue also includes contracts for professional services to be performed in the future which are recognized as revenue when we deliver the related service pursuant to the terms of the customer arrangement.\nDeferred revenue includes invoiced revenue allocated to remaining performance obligations that has not yet been recognized and will be recognized as revenue in future periods. Deferred revenue was $280,000 at September 30, 2023, and $130,000 at September 30, 2022. The deferred revenue is expected to be earned within 12 months of the balance sheet date.\nChanges in deferred revenue were as follows:\nSCHEDULE OF CHANGES IN DEFERRED REVENUE\nYear Ended September 30, 2023\nBalance on September 30, 2022 $ 130\nRevenue deferred\nRevenue recognized (403 )\nBalance at September 30, 2023 $ 280\nYear Ended September 30, 2022\nBalance on September 30, $ 194\nRevenue deferred\nRevenue recognized (171 )\nBalance at September 30, 2022 $ 130\nSoftware License Agreements\nDuring the year ended September 30, 2022, we recognized a minimal amount in licensing revenue from a licensing agreement between Castle Shield Holdings LLC (Castle Shield) and Cipherloc. We and Castle Shield mutually agreed to terminate this agreement on October 14, 2022.\nWe announced Enclave in September 2022 which is a proprietary software product developed to provide network microsegmentation capabilities, also referred to as zero trust network access (ZTNA).\nNOTE 5 - DEBT\nPursuant to a Membership Interest Redemption Agreement, dated November 3, 2021, by and between us and Akash Desai (Desai Redemption Agreement), we promised to pay Mr. Desai $100,000, without interest, in exchange for Mr. Desais right, title, and interest in us. Mr. Desai was paid $50,000 at the execution of the Desai Redemption Agreement and the remaining $50,000 is due on or before December 31, 2023.\nThe implied interest on the note payable component of the Desai Redemption Agreement was deemed insignificant.\nNOTE 6 - RELATED PARTY TRANSACTIONS\nBrian Haugli, our Chief Executive Officer and our stockholder in the Company, is also a principal shareholder of RealCISO Inc. (RealCISO). On September 22, 2020, SideChannel assigned to RealCISO Inc. certain contracts and intellectual property. We are a reseller of the RealCISO software. We receive revenue from our customers for the use of RealCISO software and pays licensing fees to RealCISO for such use. For the years ended September 30, 2023, and 2022, SideChannel paid $26,000 and $98,000 to RealCISO for licenses, respectively.\nWe also received $63,000 from RealCISO for software development services that we began providing Real CISO during fiscal year 2023.\nNo other related party transactions occurred during the years ending September 30, 2023, and September 30, 2022.\nNOTE 7 - COMMITMENTS AND CONTINGENCIES\nLitigation\nWe are currently not involved in any litigation that we believe could have a material adverse effect on its financial condition or results of operations.\nCurrently Pending Litigation\nIn April 2021, Eric Marquez, the former Secretary/Treasurer and Chief Financial Officer of Cipherloc Corporation, and certain other plaintiffs, filed a lawsuit against Cipherloc Corporation and Michael De La Garza, Cipherlocs former Chief Executive Officer and President, in the 20th Judicial District for Hays County, Texas (Cause No. 20-0818). The lawsuit alleges causes of action for fraud against Mr. De La Garza (for misrepresentations allegedly made by Mr. De La Garza); breach of contract, for alleged breaches of Mr. Marquezs alleged oral employment agreement, which Mr. Marquez claims required Cipherloc pay him cash and shares of stock; unjust enrichment; quantum meruit; and rescission of certain stock purchases made by certain of the plaintiffs, as well as declaratory relief and fraud. Damages sought exceed $1,000,000. We believe we have made all required payments and delivered the stock to the plaintiffs. The case is currently being defended by us. We believe we have meritorious defenses to the allegations, and we intend to continue to vigorously defend against the litigation.\nLeases\nIn December 2021, we and our landlord for our leased office space in Worcester, Massachusetts, entered into a lease agreement. The lease became effective on January 1, 2022 and has a one-year term. The initial monthly rent was $930 and increased to $948 on January 1, 2023 a 2% increase, per the lease agreement. The lease automatically renews for a one-year term, unless either party to the lease agreement notifies the other of the intent to terminate the lease in writing at least 60 days prior to the expiration of the current term. The landlord of the property leased at 146 Main Street in Worcester, Massachusetts, is not an affiliate of ours.\nThis lease has been accounted for as a month-to-month lease, and no right of use asset or lease liability has been recorded at September 30, 2023.\nCash Flow Impact of Leases\nWe are not carrying any assets or liabilities associated with leases for the fiscal years 2023 or 2022. We lease an office at 146 Main Street in Worcester, Massachusetts, for which we expect to pay approximately $12,000 over the next twelve (12) months.\nNOTE 8 - STOCKHOLDERS EQUITY\nEffective December 29, 2021, SCS was authorized to issue 1,000 shares of common stock with a $0.01 per share par value. The 1,000 shares of common stock were exchanged for 59,900,000 shares of Cipherloc common stock and 100 shares of Series A Preferred stock as a result of the Business Combination. The financial statements have been adjusted retroactively to reflect the Cipherloc shares received as being outstanding the outstanding shares of SCS as of September 30, 2020.\nSCS did not have any convertible debt or issued preferred stock.\nAs explained in Note 5, in December 2021, while it was SideChannelSec LLC, the Company promised to pay Mr. Desai $50,000, without interest, in exchange for Mr. Desais right, title, and interest in the Company.\nSideChannel LLC made profit sharing distributions of $461,000 during the fiscal year ended September 30, 2022, in accordance with its partnership agreements. We ceased operations as an LLC on December 29, 2021, and since then have had zero ($0) equity distributions.\nCommon Stock\nAs of September 30, 2023, and 2022, we had 213,854,781 and 148,724,056 shares of common stock outstanding, respectively, and was authorized to issue 681,000,000 shares of common stock at a par value of $0.001.\nCommon Stock Issued for Cash\nWe did not issue shares of common stock for cash during the years ended September 30, 2023, and September 30, 2022.\nCommon Stock Issued for Business Combinations\nOn July 1, 2022, we issued a total of 59,900,000 shares of common stock related to the Business Combination detailed in Note 3 of this Form 10-K.\nOn May 4, 2023, we issued a total of 62,016,618 shares of common stock for the Second Tranche (59,900,000 shares) and Closing Working Capital Adjustment (2,116,618 shares).\nCommon Stock Issued for Services\nOur Board of Directors have elected to have each of its members receive one-half of such members quarterly compensation in the form of shares of the Companys common stock instead of cash. We also use stock as a form of compensation for independent contractors who provide professional services to us in sales, marketing, or administration. During fiscal year 2023, the fair market value of stock issued for services totaled $66,000 for 770,978 shares of common stock compared to $43,000 for 280,557 shares of common stock in fiscal year 2022.\nCommon Stock Issued for Legal Settlement\nOn June 6, 2022, Cipherloc entered into a mediated settlement agreement with Robert LeBlanc. Pursuant to that agreement, Cipherloc had issued a total of 200,000 shares of the Companys common stock to Mr. LeBlanc.\nNo shares were issued for legal settlement during fiscal year 2023.\nCommon Stock and Restricted Stock Units Issued to Directors and Officers\nAs of this filing, we are granting equity compensation awards to employees, directors, and contractors using the 2021 Omnibus Equity Compensation Plan (Equity Incentive Plan) approved by stockholders on September 13, 2021. The approval on September 13, 2021, included a reserve of 8.0 million shares for awards. The Equity Incentive Plan also allows for an annual increase in the reserve up to an amount approximately equal to five percent (5%) of the fully diluted outstanding shares at the end of the prior calendar year. On June 29, 2022, the Board of Directors authorized an 8,186,106 increase in the shares reserved for the Equity Incentive Program. Awards granted under the Equity Incentive Plan in lieu of compensation are exempt from counting against the reserve.\nSCHEDULE OF STOCK OPTIONS\n2021 Omnibus Equity Incentive Plan Reserve\n(In thousands)\nInitial Reserve at September 13, 2021 8,000\nNon-exempt Awards (13,735 )\nForfeitures 1,038\nAnnual Reserve Increases 8,186\nReserve at September 30, 2023 3,489\nReserve percent of outstanding shares at September 30, 2023 1.6 %\nWe have granted and intend to continue granting restricted stock units (RSUs) to directors, employees, and contractors with service-based vesting conditions. The restricted stock units vest over a 3-year service period. The following table summarizes the activity of our restricted stock units granted under our Equity Incentive Plan.\nSCHEDULE OF RESTRICTED STOCK UNITS VESTING\nOutstanding Equity Compensation Grants\n(In thousands) Number of RSUs\nRSU Grants Acquired at July 1, 2022 3,731\nGranted\nVested (198 )\nCanceled/Forfeited (180 )\nOutstanding Grants at September 30, 2022 4,309\nGranted 8,174\nVested (2,988 )\nCanceled/Forfeited (858 )\nOutstanding Grants at September 30, 2023 8,637\nThe weighted average grant-date fair value of all awards granted during the year ended September 30, 2023, was $0.10 per share.\nThe unamortized stock compensation expense at September 30, 2023, is $694,000 and the remaining weighted average term to vesting is 2.3 years.\nPreferred Stock\nAs of September 30, 2023, and 2022, we had zero (0) and 100 shares of preferred stock outstanding, respectively. The shares of Series A Preferred Stock were issued as part of the Business Combination. The 100 shares of preferred stock that were exchanged for SCS, Inc. common stock have been retroactively reflected as issued and outstanding on September 30, 2020. A The Series A Preferred Stock contained a Board Designation Right which provides that the holders of the majority of the Series A Preferred Stock had the right to elect a majority of our Board of Directors. All 100 shares of Series A Preferred Stock were converted to common stock on June 12, 2023.\nWarrants\nOn July 1, 2022, following the Business Combination, we assumed the outstanding warrants of Cipherloc.\nWarrant activities for the period from July 1, 2022, to September 30, 2023, are as follows:\nSCHEDULE OF WARRANT ACTIVITY\nNumber of Warrants (000s) Weighted Average Exercise Price Weighted Average Remaining Life\nWarrants Acquired at July 1, 2022 87,794 $ 0.56 3.82\nGranted - - -\nExercised - - -\nCanceled/Forfeited - - -\nOutstanding at September 30, 2022 87,794 $ 0.56 3.57\nGranted - - -\nExercised - - -\nCanceled/Forfeited (18,513 ) (1.20 ) -\nOutstanding at September 30, 2023 69,281 $ 0.39 3.31\nThe fair value of the warrants was considered as part of the acquisition costs of Cipherloc as described in Note 3.\nNOTE 9 - INCOME TAXES\nFrom SCSs inception to December 29, 2021, SCS was not subject to federal and state income taxes since it was operating as a Limited Liability Company (LLC). Effective with the conversion to a corporation, the stockholders of SCS elected to be taxed as a Subchapter C corporation under the provisions of Subchapter C of the Internal Revenue Code. Federal income taxes were the responsibility of SCSs stockholders during the audited periods, as were certain state income taxes. Therefore, no provision or liability for income taxes is reflected in the financial statements.\nSCS has adopted the provisions related to accounting for uncertainty in income taxes, which defines a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. Management has considered its tax positions and believes that all of the positions taken by SCS in its federal and state tax returns are more likely than not to be sustained upon examination.\nSCS is subject to tax examinations by federal and state tax authorities for years after 2018.\nSideChannelSec, LLC converted to a Massachusetts corporation on December 29, 2021. Upon this conversion SCS will be taxed as a corporation. SCS utilizes the asset and liability method in accounting for income taxes. Under this method, deferred tax assets and liabilities are recognized for operating loss and tax credit carryforwards and for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the year in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the results of operations in the period that includes the enactment date. A valuation allowance is recorded to reduce the carrying amounts of deferred tax assets unless it is more likely than not that the value of such assets will be realized.\nThe provision (benefit) for income taxes from continued operations for the years ended September 30, 2023, and 2022 consist of the following:\nSCHEDULE OF PROVISION (BENEFIT) FOR INCOME TAXES FROM CONTINUED OPERATIONS\n(000s)\nSeptember 30,\n(In thousands)\nCurrent:\nFederal $ (136 ) $ 136\nState (32 )\nTotal $ (168 ) $ 195\nDeferred:\nFederal $ - $ -\nState (211 ) -\nTotal (211 ) -\nProvision (benefit) for income taxes, net $ (379 ) $ 195\nThe difference between income tax expense computed by applying the federal statutory corporate tax rate and actual income tax expense is as follows:\nSCHEDULE OF FEDERAL STATUTORY CORPORATE TAX RATE AND ACTUAL INCOME TAX EXPENSE\nSeptember 30,\nStatutory federal income tax rate 21.00 %\n21.00 %\nNon-deductible contingent consideration (1.89 )\n(8.72 )\nNon-deductible impairment of goodwill -\n(8.14\n)\nNon-deductible stock-based compensation -\n(0.10\n)\nPrior Year Adjustment 1.58\n-\nNon-deductible meals & entertainment (0.22 )\n-\nState tax 3.02\n0.80\nChange in valuation allowance (18.36 )\n(4.84\n)\nEffective tax rate 5.13 %\n- %\nFor the years ended September 30, 2023, and 2022, the difference between the amounts of income tax expense or benefit that would result from applying the statutory rates to pretax income to the reported income tax benefit $379,000 for the year ended September 30, 2023, and income tax expense of $195,000 for the year ended September 30, 2022. The September 30, 2022, expense of $195,000 was accrued as an estimate of income taxes due by SCS, Inc. for activity prior to the Business Combination. The actual taxes due by SCS, Inc. for such activity was zero ($0) resulting in a reversal of the $195,000 accrual during fiscal year 2023. The reversal was partially offset by $27,000 of state income taxes incurred by the Company during fiscal year 2023. In addition, a deferred tax liability was recognized for a book versus tax basis difference for state income taxes upon the business combination with Cipherloc in 2022. During the year ended September 30, 2023 this deferred tax liability was reduced to zero resulting in a deferred income tax benefit of $211,000.\nDeferred income taxes result from temporary differences in the recognition of income and expenses for the financial reporting purposes and for tax purposes. The tax effect of these temporary differences representing deferred tax asset and liabilities result principally from the following:\nFederal\nSCHEDULE OF DEFERRED TAX ASSETS AND LIABILITIES\nSeptember 30,\nNet operating loss carry forward $ 7,603 $ 7,480\nIntangible asset - not deductible for tax (1,038 ) (1,038 )\nAIPR&D capitalization\nOther\nDeferred compensation (59 )\nValuation allowance (6,736 ) (6,383 )\nDeferred income tax asset $ - $ -\nState\nSeptember 30,\nNet operating loss carry forward $ 225 $ 178\nIntangible asset - not deductible for tax (218 ) (211 )\nOther\nValuation allowance (43 ) (178 )\nDeferred income tax asset $ - $ (211 )\nThe Company has a net operating loss carry forward of $36.2 million available to offset future taxable income, of which, $2.6 million will expire within the next five years, $12.5 million will expire thereafter, and the remaining $21.1 million will not expire. For income tax reporting purposes, the Companys aggregate unused net operating losses were subject to the limitations of Section 382 of the Internal Revenue Code, as amended. The Company has adjusted the net operating losses incurred prior to 2015 to reflect only the losses not subject to limitation. The Company has provided for a valuation reserve against the net operating loss benefit, because in the opinion of management based upon the earning history of the Company, it is more likely than not that the benefits will not be realized. For income tax reporting purposes, Management has determined that net operating losses prior to February 5, 2015, are subject to an annual limitation of approximately $525,000.\nUtilization of the pre-Business Combination net operating loss carryforwards (pre-Combination NOLs) attributable to Cipherloc may become subject to a substantial annual limitation under Section 382 of the Internal Revenue Code of 1986 due to ownership changes occurred during the tax year associated with the Business Combination. In general, an ownership change, as defined by Section 382, results from transactions increasing the ownership of certain stockholders or public groups in the stock of a corporation by more than 50% over a three-year period. Future ownership changes may trigger Section 382 and therefore, substantially limit the amount of pre-Combination NOLs that can be utilized annually to offset future taxable income.\nThe Company is current on all its federal income tax filings. The Company is subject to IRS examinations for periods beginning after September 30, 2019, and all net operating losses we may use in future federal tax filings are subject to IRS examination.\nNOTE 10 - SUBSEQUENT EVENTS\nOn November 6, 2023, Anthony Ambrose, a current Member of our Board of Directors (Board), and the Chairman of the Nomination and Corporate Governance Committee, informed us of his upcoming retirement from the Board.\nMr. Ambrose will remain a member of the Board until our next Annual Meeting of Stockholders (Annual Meeting), at which time Mr. Ambrose will not stand for re-election as a Member of the Board.\nMr. Ambroses departure is not the result of any disagreement with our management, our Board, or us on any matter related to its operations, policies, or practices.\nIn recognition of Mr. Ambroses tenure and contributions to us during his nearly five years of service as a member of the Board, we will accelerate the vesting of Mr. Ambroses 333,334 restricted stock units, which were awarded to Mr. Ambrose on July 2, 2022 and previously scheduled to vest pro-ratably on June 1, 2024 and on June 1, 2025. The full amount of unvested restricted stock units will now vest on January 2, 2024. The full terms of Mr. Ambroses separation will be formalized in a forthcoming Separation Agreement between us and Mr. Ambrose.\nAlso on November 7, 2023, we announced an offer (Offer to Exchange) made to certain holders of 55,549,615 of our warrants issued during 2021 with an exercise price of $0.36 and expiration dates between March 31, 2026 and April 16, 2026 (2021 Investor Warrants). The Offer to Exchange provided 2021 Investor Warrant holders one (1) share of common stock for every six 2021 Investor Warrants and one (1) New Warrant for every two and one-half (2.5) 2021 Investor Warrants. The Offer to Exchange expired at 5:00 PM EST on December 26, 2023 (Expiration Date). The New Warrants being offered have a five (5) year term, an exercise price of $0.18, and an automatic conversion if the bid price of the stock is equal to or greater than $0.36 for 30 consecutive days.\nOn November 14, 2023, the Offer to Exchange was amended to include an Amended New Warrant Agreement which removed a restriction on the cashless exercise of the New Warrant.\nOn November 21, 2023, we received a Comment Letter from the SEC about the Offer to Exchange. On December 1, 2023 we filed a response with the SEC to the Comment Letter and on December 4, 2023, we filed an Amended Offer to Exchange which reflected the clarifications and corrections requested by the SEC.\nThe Offer to Exchange was made as an offer for all or none of the 2021 Investor Warrants. At its meeting on December 11, 2023, our Board approved waiving the all or nothing clause and authorized us to close the offer on the Expiration Date if the percentage of 2021 Investor Warrants validly tendered and not validly withdrawn exceed 65% of the total 2021 Investor Warrants outstanding. The Expiration Date was also changed to December 26, 2023.\nOn December 11, 2023, we received a Comment Letter from the SEC requesting clarifications on three responses we submitted regarding the November 21, 2023 Comment Letter. On December 21, 2023, we filed an Amended Offer to Exchange which reflected the clarifications requested by the SEC.\nOn December 26, 2023, we closed the Offer to Exchange and issued 7,270,958 shares of common stock and 17,415,437 New Warrants in exchange for 43,538,501 2021 Investor Warrants (78.4% of the total outstanding 2021 Investor Warrants). ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nOur management is responsible for establishing and maintaining adequate disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, that are designed to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to our principal executive officer to allow timely decisions regarding required disclosure. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in our reports filed or submitted under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer (CEO) and Chief Financial Officer (CFO), to allow timely decisions regarding required disclosure. In designing and evaluating our disclosure controls and procedures, the Company recognized that disclosure controls and procedures, no matter how well conceived and operated, can provide only reasonable assurance of achieving the desired control objectives, and we necessarily are required to apply our judgment in evaluating the cost-benefit relationship of possible disclosure controls and procedures.\nEvaluation of Disclosure Controls and Procedures\nAs of September 30, 2023, our management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act). Our CEO and CFO have concluded, based upon the evaluation described above, that, as of September 30, 2023, our disclosure controls and procedures were not effective at the reasonable assurance level because of the material weaknesses discussed below.\nNotwithstanding the material weakness in internal control over financial reporting described below, our management has concluded that our consolidated financial statements included in this Form 10-K are fairly stated in all material respects in accordance with GAAP.\nMaterial Weaknesses\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of a companys annual or interim financial statements will not be prevented or detected on a timely basis.\nIn connection with the preparation of our audited financial statements for the year ended September 30, 2022, we identified material weaknesses in our internal controls over financial reporting, as of September 30, 2022. These material weaknesses had not been fully remediated as of September 30, 2023. The material weaknesses identified related to the fact that we did not design and maintain accounting policies, procedures and controls to ensure complete, accurate and timely financial reporting in accordance with U.S. GAAP. Specifically, the material weaknesses identified included the following:\n● Did not design and maintain formal accounting policies, procedures and controls to achieve complete, accurate and timely financial accounting, reporting and disclosures, including controls over the preparation and review of account reconciliations, journal entries and classification of certain costs;\n● We had not developed and effectively communicated to our employees our accounting policies and procedures, which resulted in inconsistent practices. Since these entity level programs have a pervasive effect across the organization, management has determined that these circumstances constitute a material weakness;\n● We do not have sufficient, qualified finance and accounting staff with the appropriate U.S. GAAP technical accounting expertise to identify, evaluate and account for accounting and financial reporting, and effectively design and implement systems and processes that allow for the timely production of accurate financial information in accordance with internal financial reporting timelines. As a result, we did not design and maintain formal accounting policies, processes and controls related to complex transactions necessary for an effective financial reporting process; and\n● As a high-growth, smaller reporting company that became responsible for listed financial reporting within the last eighteen (18) months, we have a limited staff and budget available to adequately test and monitor the effectiveness of certain internal controls.\nRemediation Plan\nOur management is actively engaged and committed to taking the steps necessary to remediate the control deficiencies that constituted the material weaknesses. During fiscal year 2023, we made the following enhancement to our control environment:\n● In February 2023, we hired a permanent Staff Accountant whose responsibilities include working with our CFO, existing employees and third-party consultants to improve the design, implementation, execution and supervision of our controls. We expect to continue evaluating our needs for additional personnel. We expect to provide enhanced training to existing and new employees in order to enhance the level of communication and understanding of controls with personnel that provide key information and perform key roles within our financial accounting and reporting function; and\n● We began documenting accounting policies, procedures and controls to achieve complete, accurate, and timely financial accounting, reporting and disclosures including controls over the preparation and review of account reconciliations, journal entries and classification of certain costs.\nOur remediation activities are continuing during fiscal year 2024. In addition to the above actions, we expect to engage in additional activities, including, but not limited to:\n● Engaging external consultants to provide support and to assist us in our evaluation of more complex applications of GAAP, and to assist us with documenting and assessing our accounting policies and procedures until we have sufficient technical accounting resources;\n● Implementing business process-level controls across all significant accounts and information technology general controls across all relevant systems. This includes providing training for control owners that will present expectations as it relates to the control design, execution and monitoring of such controls, including enhancements to the documentation to evidence the execution of the controls; and\n● Implementing improvements to our accounting system to enhance the accuracy of our financial records.\nWe continue to enhance corporate oversight over process-level controls and structures to ensure that there is appropriate assignment of authority, responsibility, and accountability to enable remediation of our material weaknesses. We believe that our remediation plan will be sufficient to remediate the identified material weaknesses and strengthen our controls. As we continue to evaluate, and work to improve our controls, management may determine that additional measures to address control deficiencies or modifications to the remediation plan are necessary.\nWhile we have performed certain remediation activities to strengthen our controls to address the identified material weaknesses, control weaknesses are not considered remediated until new internal controls have been operational for a period of time, are tested, and management concludes that these controls are operating effectively. We will continue to monitor the effectiveness of our remediation measures in connection with our future assessments of the effectiveness of internal control over financial reporting and disclosure controls and procedures, and we will make any changes to the design of our plan and take such other actions that we deem appropriate given the circumstances.\nManagements Annual Report on Internal Control over Financial Reporting\nWe are engaged in the process of design and implementation of our internal control over financial reporting in a manner commensurate with the scale of our operations subsequent to the Business Combination, including the enhancement of our internal and external technical accounting resources (as well as to address the material weaknesses discussed above). However, the design of internal control over financial reporting for our company post-business combination has required and will continue to require significant time and resources from management and other personnel. As a result, management was unable, without incurring unreasonable effort or expense to fully assess our internal control over financial reporting as of September 30, 2023.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in the Companys internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the fiscal year ended September 30, 2023 covered by this Form 10-K that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting, other than described herein. We are continuing to take steps to remediate the material weakness in our internal control over financial reporting, as discussed above.\nInherent Limitation on the Effectiveness of Internal Control\nReaders are cautioned that internal control over financial reporting, no matter how well designed, has inherent limitations and may not prevent or detect misstatements. Therefore, even effective internal control over financial reporting can only provide reasonable assurance with respect to the financial statement preparation and presentation.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this annual report. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nInformation regarding directors and executive officers of the Company, as well as the required disclosures with respect to the Companys audit committee financial expert, is incorporated herein by reference to the information included in our Proxy Statement for our next Annual Meeting of Stockholders which will be filed with the SEC within 120 days after the end of our fiscal year 2023.\nThe Company has adopted a Code of Ethics that applies to all of our directors, officers and employees, including our Chief Executive Officer and Chief Financial Officer. The complete text of this Code of Ethics is available on the SECs EDGAR system as described in Part IV, Item 15 of this Form 10-K. ITEM 11. EXECUTIVE COMPENSATION\nInformation regarding executive compensation of our directors and officers, is incorporated herein by reference to the information included in our Proxy Statement for our next Annual Meeting of Stockholders which will be filed with the SEC within 120 days after the end of our fiscal year 2023. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nInformation regarding security ownership of certain beneficial owners and management and the Companys equity compensation plans are incorporated herein by reference to the information included in our Proxy Statement for our next Annual Meeting of Stockholders which will be filed with the SEC within 120 days after the end of our fiscal year 2023. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nInformation regarding certain relationships and related transactions and director independence is incorporated herein by reference to the information included in our Proxy Statement for our next Annual Meeting of Stockholders which will be filed with the SEC within 120 days after the end of our fiscal year 2023. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation regarding principal accounting fees and services is incorporated herein by reference to the information included in our Proxy Statement for our next Annual Meeting of Stockholders which will be filed with the SEC within 120 days after the end of our fiscal year 2023.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Documents filed as part of this report:\n1. Financial Statements\nThe financial statements and schedules required by this Item 15 are set forth in Part II, Item 8 of this Form 10-K.\n(b) Exhibits. The following exhibits are filed as a part of this report:\nExhibit\nNumber\nDescription of Document\n2.1\nAgreement and Plan of Merger by and between Cipherloc Corporation, a Texas corporation and Cipherloc Corporation, a Delaware corporation (incorporated by reference to Exhibit 2.1 to Current Report on Form 8-K filed September 17, 2021).\n3.1\nCertificate of Incorporation of Cipherloc Corporation, a Delaware corporation (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on September 30, 2021).\n3.2\nBylaws (incorporated by reference to Exhibit 3.2 to the Companys Current Report on Form 8-K, filed on September 30, 2021).\n3.3\nCertificate of Amendment of Certificate of Incorporation of the Company (incorporated by reference to Exhibit 3.2 to the Companys Current Report on Form 8-K filed July 6, 2022).\n3.4\nCertificate of Designation of Series A Preferred Stock (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed July 6, 2022).\n4.1\nDescription of the Registrants Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (filed herewith).\n10.1\nForm of Securities Purchase Agreement between Cipherloc, a Texas corporation and the several purchasers of the Companys units (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on April 8, 2021).\n10.2\nForm of Registration Rights Agreement dated March 31, 2021 (incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on April 8, 2021).\n10.3\nForm of Lockup Agreement between Cipherloc Corporation, a Texas corporation and the several purchasers of the Companys Units (incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed on April 8, 2021).\n10.4\nPlacement Agent Agreement between Cipherloc Corporation, a Texas corporation and Paulsen Investment Company, LLC related to the Companys sole of Units incorporated by reference to Exhibit 10.4.\n10.5\nIndemnification Agreement by and between the Company and Paulson Investment Company, LLC (incorporated by reference to Exhibit 10.5 to the Companys Current Report on Form 8-K filed on April 8, 2021).\n10.6\nLetter Agreement with Paulson Investment Company, LLC (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on July 28, 2021).\n10.9\nRyan Polk Executive Employment Agreement (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on October 12, 2021).\n10.10\n2021 Omnibus Equity Incentive Plan approved by the Companys stockholders at the 2021 Annual Meeting held September 13, 2021 (incorporated by reference to Appendix A to the Companys Definitive Proxy Statement filed on July 20, 2021).\n10.12\nPurchase Agreement between the Company and SideChannel, Inc. and The Sellers Therein and Brian Haugli, as the Seller Representative (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed May 18, 2022).\n10.13\nBrian Haugli Executive Employment Agreement (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on July 6, 2022).\n10.14\nIndependent Contractor Agreement by and between the Company and Thomas Wilkinson (Thomas W. Wilkinson, CPA, PLLC) dated December 28, 2022 (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on December 30, 2022).\n10.15\nRyan Polk 2023 Compensation Change Authorization (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on May 5, 2023).\n10.16\nOffer to Exchange Common Stock for Certain Outstanding Warrants, dated August 21, 2023 (incorporated by reference to Exhibit (a)(1)(A) to the Schedule TO filed on August 22, 2023).\n10.17\nNotice of Extension of the Offer to the Holders of the Warrants, dated September 19, 2023 (incorporated by reference to Exhibit (a)(1)(I) to the Schedule TO Amendment No. 2 filed on September 20, 2023.\n10.18\nNotice of Withdrawal of the Offer to the Holders of Warrants, dated November 3, 2023 (incorporated by reference to Exhibit (a)(1)(J) to the Schedule TO Amendment No. 3 filed on November 3, 2023).\n10.19\nOffer to Exchange Common Stock for Certain Outstanding Warrants, dated November 6, 2023 (incorporated by reference to Exhibit (a)(1)(A) to the Schedule TO filed on November 7, 2023).\n10.20\n2023 Common Stock Purchase Warrant as Amended on November 14, 2023, dated November 14, 2023 (incorporated by reference to Exhibit (a)(1)(F) to the Schedule TO Amendment No. 1 filed on November 14, 2023).\n10.21\nOffer to Exchange Common Stock and New Warrants for 2021 Investor Warrants and Amended on December 1, 2023 (incorporated by reference to Exhibit (a)(1)(H) to the Schedule TO Amendment No. 2 filed on December 4, 2023).\n14.1\nCode of Ethics for Directors, Officers and Employees of SideChannel and its Affiliates, dated August 8, 2019 (incorporated by reference to Exhibit 14.1 to the Companys Current Report on Form 8-K, filed on August 12, 2019).\n21.1\nSubsidiaries of the Registrant.\n23.1*\nConsent of Independent Registered Public Accounting Firm.\n24.1*\nPower of Attorney (included on signature page)\n31.1*\nCertification of Principal Executive Officer Pursuant to the Securities Exchange Act of 1934, Rules 13a-14 and 15d-14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of Principal Financial Officer Pursuant to the Securities Exchange Act of 1934, Rules 13a-14 and 15d-14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1**\nCertification of Principal Executive Officer Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2**\nCertification of Principal Financial Officer Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS*\nInline XBRL Instance Document.\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n101.DEF*\nInline XBRL Taxonomy Extension definition Linkbase Document.\n104*\nCover Page Interactive Data File (formatted as Inline XBRL and contained in the Exhibit 101 attachments).\nIndicates management or compensatory plan or arrangement\n* Filed herewith\n** Furnished herewith\nEXHIBIT 16. FORM 10-K SUMMARY\nNone\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, there unto duly authorized.\nSideChannel, Inc.\nDate: December 27, 2023 By: /s/ Brian Haugli\nBrian Haugli\nPresident and Chief Executive Officer\nDate: December 27, 2023 By: /s/ Ryan Polk\nRyan Polk\nChief Financial Officer\nPOWER OF ATTORNEY\nEach person whose signature appears below hereby appoints Brian Haugli and Ryan Polk, and each of them, as attorney-in-fact with full power of substitution to execute in the name and on behalf of the registrant and each such person, individually and in each capacity stated below, one or more amendments to the annual report on Form 10-K, which amendments may make such changes in the report as the attorney-in-fact acting deems appropriate and to file any such amendment to the annual report on Form 10-K with the Securities and Exchange Commission. Pursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nIn accordance with the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Company and in the capacities and on the dates indicated.\nDate: December 27, 2023 By: /s/ Brian Haugli\nBrian Haugli\nPresident, Chief Executive Officer, and Director (principal executive officer)\nDate: December 27, 2023 By: /s/ Ryan Polk\nRyan Polk\nChief Financial Officer (principal financial officer and principal accounting officer)\nDate: December 27, 2023 By: /s/ Deborah MacConnel\nDeborah MacConnel\nChairwoman of the Board\nDate: December 27, 2023 By: /s/ Anthony Ambrose\nAnthony Ambrose\nDirector\nDate: December 27, 2023 By: /s/ Kevin Powers\nKevin Powers\nDirector\nDate: December 27, 2023 By: /s/ Hugh Regan, Jr.\nHugh Regan, Jr.\nDirector"
}