{
    "cik": "1023459",
    "company": "Simulations Plus, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-28",
    "period_of_report": "2022-08-31",
    "sic": "7373",
    "state_of_inc": null,
    "state_location": "CA",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1023459/0001023459-22-000080-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1023459/000102345922000080/simu-20220831.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1023459/0001023459-22-000080.txt",
    "filename": "1023459_10K_2022_0001023459-22-000080.htm",
    "content": "ITEM 1 -BUSINESS\nAs used in this Annual Report, each of the terms we, us, our, the Company, and Simulations Plus refers to Simulations Plus, Inc. and its wholly owned subsidiaries (both current and previous, as applicable) Cognigen Corporation, of Buffalo, New York; DILIsym Services, Inc. of Research Triangle Park, North Carolina; and Lixoft of Paris, France, unless otherwise stated or the context otherwise requires.\nOVERVIEW\nSimulations Plus, Inc., incorporated in 1996, is a premier developer of modeling and simulation software for drug discovery and development, including the prediction of properties of molecules utilizing both artificial intelligence (AI) and machine-based technology. We also provide consulting services ranging from early drug discovery through preclinical and clinical trial development to regulatory submissions supporting product approval. Our software and consulting services are provided to major pharmaceutical, biotechnology, agrochemical, cosmetics, and food industry companies and academic and regulatory agencies worldwide for use in the conduct of industry-based research. The Company is headquartered in Southern California, with offices in Buffalo, NY, Research Triangle Park, NC, and Paris, France. Our common stock has traded on the Nasdaq Global Select Market under the symbol SLP since May 13, 2021, prior to which it traded on the Nasdaq Capital Market under the same symbol.\nWe are a global leader, delivering relevant, cost-effective software and creative and insightful consulting services. Pharmaceutical and biotechnology companies and hospitals use our software programs and scientific consulting services to guide early drug discovery (molecule design screening and lead optimization), preclinical, and clinical development programs, and the development of generic medicines after patent expiration, including using our software products and services to enhance their understanding of the properties of potential new therapies and to use emerging data to improve formulations, select and justify dosing regimens, support the generics industry, optimize clinical trial designs, and simulate outcomes in special populations, such as in elderly and pediatric patients.\nSEGMENT INFORMATION\nDuring the year ended August 31, 2022, our business was organized into two reportable segments, software and services.\nSOFTWARE\nGeneral\nWe currently offer thirteen software products for pharmaceutical research and development as follows:\nThree simulation products that provide time-dependent results based on solving large sets of differential equations:\n◦GastroPlus®\n◦DDDPlus™\n◦MembranePlus™\nTwo products that predict and analyze static properties of chemicals utilizing both artificial intelligence as well as machine-learning technologies:\n◦ADMET Predictor®\n◦MedChem Designer™\nSix products that are based on mechanistic, mathematical models:\n◦DILIsym®\n◦NAFLDsym®\n◦ILDsym™\n◦IPFsym®\n◦RENAsym®\n◦MITOsym®\nTwo products designed for modeling and simulation that allow for population analyses, rapid clinical trial data analyses and regulatory submissions:\n◦MonolixSuite™ (the combination of Monolix™, PKanalix™, and Simulx™).\n◦PKPlus™\nOur software business represented 61% of our total revenue during the year ended August 31, 2022, primarily generated by the following products:\nGastroPlus\nOur flagship product, initially introduced in 1998, and currently our largest single source of software revenue, is GastroPlus. GastroPlus mechanistically simulates the absorption and drug interaction of compounds administered to humans and animals. It is currently one of the most widely used commercial software products of its type by industry and regulatory agencies in the U.S. and globally. Our goal with GastroPlus is to integrate the most advanced science into user-friendly software to enable researchers and regulators to perform sophisticated analyses of complex compound behaviors in humans and laboratory animals. We work to release updated versions of the program on an ongoing basis.\nIn October 2022, GastroPlus version 9.8.3, which included new mechanisms and updated documentation for key drug interaction standards models, was released. This version added important new capabilities, including improvements to population simulations, additional dosage route models, drug interactions, and automated workflows for virtual bioequivalence simulations to mimic real-world study designs. This version also included a new validated swine PBPK model to drive pharmaceutical and veterinary medicine research and updated options for Monolix™ and NAFLDsym® software, were released.\nBecause of the widespread use of GastroPlus, we have been able to enter both funded and unfunded collaborations with industry and government agencies to drive advances to modeling and simulation science. In all such collaborations, we own the intellectual property developed within the GastroPlus program, and updates are integrated into future versions and made available to all clients. Recent collaborations include:\nAnimal health models: in January 2022, we entered a funded collaboration with a large animal health company to validate current animal physiologically based pharmacokinetic (\"PBPK\") models and add critical new species to GastroPlus to support veterinary medicine and next-generation alternatives to animal testing.\nLong-acting injectable (LAI) formulation model: in October 2021, through a joint proposal with the University of Connecticuts Department of Pharmaceutical Sciences, we were awarded a newly funded contract from the FDA to enhance and validate mechanistic in vitro/in vivo correlation (\"IVIVC\") methods for LAI formulations within GastroPlus.\nDermal absorption -Transdermal Compartmental Absorption and Transit (TCAT™) model: in September 2021, we received a newly funded cooperative agreement from the FDA to expand the dermal formulations which can be mechanistically simulated via the TCAT model within GastroPlus, implement new virtual population groups, and extend bioequivalence calculations to account for local skin concentrations.\nOral absorption - Advanced Compartmental Absorption and Transit (ACAT™) model: in November 2019, we entered a newly funded collaboration with a large pharmaceutical company to modify the mechanistic ACAT™ model in GastroPlus to support gastrointestinal disease research. In January 2021, we entered into a newer funded collaboration with a different large pharmaceutical company to add novel mechanisms for oral peptide formulations within the ACAT model to expand oral absorption modeling beyond small molecules. In January 2022, we entered into a newly funded collaboration with a third large pharmaceutical company to further enhance the ACAT model to aid scientists in the detailed understanding of local drug disposition in the gastrointestinal tract\nOral cavity absorption model: in October 2020, through a joint proposal with the St. Louis College of Pharmacy at the University of Health Sciences and Pharmacy in St. Louis, we were awarded a newly funded cooperative agreement from the FDA to establish novel in vitro/in silico models for the oral cavity route of administration in GastroPlus.\nMonolixSuite\nThe MonolixSuite is a unique solution for modeling and simulation for pharmaceutical companies, biotechnology enterprises, and hospitals. It supports nonparametric analyses, population analyses and modeling, and clinical trial simulation. The extended MonolixSuite contains three main products: Monolix, Simulx, and PKanalix. Monolix 2021R2 was released in June 2022, which combines the most advanced algorithms with a unique ease of use. The products are used by pharmaceutical companies across the globe at each step of drug development, from preclinical to first-in-human, clinical, and post-approval.\nADMET Predictor\nADMET (Absorption, Distribution, Metabolism, Excretion, and Toxicity) Predictor is a top-ranked, chemistry-based computer program that takes molecular structures as inputs and uses machine-learning technology to predict different properties for them. This capability allows chemists to generate estimates for many important molecular properties without the need to synthesize and test the molecules. A chemist can then assess the likely success of many existing molecules in a companys chemical library, as well as molecules that have never been made.\nThe optional ADMET Modeler™ Module in ADMET Predictor enables scientists to use their own experimental data to quickly create proprietary high-quality predictive models using the same powerful AI engine we use to build our top-ranked property predictions.\nVersion 10.4 of ADMET Predictor, marketed as APX.4, was released in May 2022, which added many new features including, but not limited to:\nNew 3D conformer generation functionality to easily predict properties using advanced 3D molecular and atomic descriptors\nNew mouse species models added to the high-throughput pharmacokinetic (\"HTPK\") Simulation Module to complement the rat and human options for novel lead selection activities\nNew transform rules added to the artificial intelligence-driven drug design (\"AIDD\") Module to boost the virtual design space\nImprovements to the API and command line features for flexible deployment and workflow options\nWe have made significant investments in two key areas with recent versions: improving integration of our top-ranked ADMET Predictor and GastroPlus models to leverage our novel ‘Discovery PBPK approaches for chemists and safety researchers, and further enhancing our best-in-class machine-learning engine to assist with drug discovery.\nRecent collaborations include:\nDrug discovery workflows: in December 2019, we entered into a new collaboration agreement with Bayer AG to advance our ADMET Predictor machine-learning software for use within integrated drug discovery workflows by developing improved structure and tautomer handling capabilities that will support data integrity across the different discovery platforms.\nHTPK simulations: in April 2020, we entered into a new collaboration agreement with a large pharmaceutical company to develop enhanced capabilities in our existing HTPK Simulation Module which will incorporate PBPK modeling into the partners discovery platform to support compound screening activities. In September 2020, we entered an accelerated second phase of this collaboration with the sponsor company to add further enhancements to the HTPK Simulation Module calculations and workflows.\nAIDD Module validation: in September 2020, we entered into a collaborative research agreement with a large pharmaceutical company to apply the AIDD Module to an active therapeutic program. We worked with the partner to define the multi-objective parameters against which the lead molecule(s) were to be optimized. In April 2021, we received initial experimental results from 10 candidate molecules selected for synthesis and testing. In August 2021, the second phase of experimental results were received. Peer-reviewed manuscripts of the methodology and results are expected to be jointly published with our collaboration partner in 2023.\nMachine-learning models for ionization constants (pKa): in August 2022, we entered into a new collaboration with a large pharmaceutical company to leverage their expansive internal databases to improve the accuracy of predictions, and extend the chemical coverage space, of our pKa models using the novel machine-learning and atomic descriptor calculation methods within ADMET Predictor.\nSERVICES\nGeneral\nOur scientists and engineers have extensive expertise in drug absorption via various dosing routes, pharmacokinetics, pharmacodynamics, drug-drug interactions, and other areas related to the drug development process. We conduct contracted consulting studies for large customers with complex problems who recognize our expertise in solving them, as well as for smaller customers. The demand for our consulting services has been steadily increasing, and we have expanded our consulting teams to meet the increased workload.\nOur services business represented 39% of our total revenue during the year ended August 31, 2022, primarily generated by the following service offerings:\nPKPD\nOur clinical-pharmacology-based consulting services include population pharmacokinetic and pharmacodynamic (\"PKPD\") modeling, exposure-response analyses, clinical trial simulations, data programming, and technical writing services in support of regulatory submissions. In addition to modeling and simulation consulting services, we provide expertise and assistance with development-related decision-making and support for regulatory interactions related to dose selection, clinical trial design, and understanding of the determinants of safety and efficacy for new medicines.\nQSP/QST\nWe provide creative and insightful consulting services to support our quantitative systems pharmacology/quantitative systems toxicology (\"QSP/QST\") modeling focused on nonalcoholic fatty liver safety (\"NAFLD\"), and nonalcoholic steatohepatitis (\"NASH\"), IPF, heart disease, liver and kidney safety, and radiation syndrome, as well as other areas.\nPBPK\nIn 2014, the FDA and other regulatory agencies began to emphasize the need to encourage mechanistic PBPK modeling and simulation in clinical pharmacology, with final guidance documents completed in 2018. New draft guidance documents, which were released in October 2020, focused on additional biopharmaceutics applications for oral drug product development, manufacturing changes, and controls. This has resulted in an increased need for our scientific consulting staff to drawn upon its extensive experience across multiple therapeutic areas of modeling and simulation methods to provide consulting-related services in support of this sophisticated technique. We support Model-Informed Drug Discovery and Development throughout the entire product lifecycle, from discovery through translational research and clinical development, when an organization does not have the time or resources to use our software directly. More specifically, our clients seek out our consulting services to acquire scientific, therapeutic-area-related modeling and simulation expertise that they do not have in-house.\nBelow is a summary of revenue percentages by each of our software and services businesses for the fiscal years ended August 31:\n2022 2021 2020\nSoftware 61 % 60 % 52 %\nServices 39 % 40 % 48 %\nTotal 100 % 100 % 100 %\nSALES AND MARKETING\nWe market our software and services globally through attendance and presentations at scientific meetings, exhibits at trade shows, seminars at pharmaceutical companies and government agencies, our website, and various communication channels to our database of prospects and customers. At various yearly scientific meetings worldwide, numerous presentations and posters report research performed using our software. Many of these presentations are from industry and FDA scientists; some are from our staff. Numerous peer-reviewed scientific journal articles are published, and conference presentations are delivered each year using our software, primarily by our customers, further supporting its use in a wide range of preclinical and clinical studies.\nOur sales and marketing efforts are handled primarily internally by sales and marketing staff, with our scientific team and several senior management staff assisting our marketing and sales staff with trade shows, seminars, and customer training both online and on-site. We also have independent distributors in Japan, China, India, South Korea, and Brazil, who sell and market our products with support from our scientists and engineers.\nIn March 2021, we launched our MIDD+ (Model-Informed Drug Development) scientific conference, where speakers shared their real-world impact using modeling and simulation technology. During the two-day event, representatives from the U.S. FDA Offices of Clinical Pharmacology, New Drug Products, Research and Standards, and Translational Sciences, and from the U.S. FDA Centers of Drug Evaluation and Research and the National Center for Toxicological Research, as well as ANVISA (The Brazilian Health Regulatory Agency) and Health Canada, provided case studies and software demonstrations on a wide range of topics. The event also featured a panel discussion on the ascent of model-informed drug development and the increasing importance of developing next-generation technology. In February 2022, we hosted the 2022 Model-Informed Drug Development (MIDD+) scientific conference where attendees from 57 countries spent two days focusing on advancing Model-Informed Drug Development. The conference was focused on delivering real-world case studies using modeling and simulation. Tracks included dedicated sessions covering all stages of the drug development process, including discovery, preclinical, clinical, and post-approval/generics. In 2022, the Medicines and Healthcare products Regulatory Agency in the United Kingdom was added to the Regulatory Affairs panel, and speakers from many pharmaceutical and biotech companies presented their latest research.\nCOMPETITION\nWe compete against a number of established companies that provide screening, testing, and research services, and products that are not based on simulation software. There are also software companies whose products do not compete directly with ours but are sometimes closely related. Our competitors in this field include some companies with financial, personnel, research, and marketing resources that are larger than ours.\nMajor pharmaceutical companies conduct drug discovery and development efforts through their internal development staff and outsourcing. Smaller companies generally need to outsource a greater percentage of this effort. Thus, we compete not only with other software suppliers and scientific consulting service providers but with the in-house development and scientific consulting teams at some of the larger pharmaceutical companies.\nBased on our technical knowledge and expertise, we believe that we are strategically positioned to offer competitive modeling and simulation consulting services to companies. Our clients seek out our services for multiple reasons including, without limitation: (i) to acquire scientific, therapeutic-area-related modeling expertise that they do not have in-house, (ii) to address a need for modeling and simulation efforts beyond the capacity of in-house resources, (iii) to fulfill their modeling requirements more efficiently than they could do in-house, and (iv) to utilize our software when they do not have the in-house expertise to do so. We apply our software and assist companies in such areas as PKPD, PBPK, and QSP/QST. We compete against numerous service providers, ranging from departments within large contract research organizations (\"CROs\") to independent consulting organizations of various sizes as well as individual consultants.\nWe believe the key factors in our ability to successfully compete in this field are our ability to: (i) continue to invest in research and development, and develop and support industry-leading simulation and modeling software and related products and services, (ii) develop and maintain a proprietary database of results of physical experiments that serve as a basis for simulated studies and empirical models, (iii) continue to attract and retain a highly-skilled scientific and engineering team, (iv) aggressively promote our products and services to our global market, and (v) develop and maintain relationships with research and development departments of pharmaceutical companies, universities, and government agencies.\nIn addition, we are actively seeking strategic acquisitions to expand both our pharmaceutical software portfolio and services offerings.\nTRAINING AND TECHNICAL SUPPORT\nCustomer training and technical support are important factors in customer satisfaction for our pharmaceutical products, and we believe we are an industry leader in providing strong customer training and technical support in our business areas. We provide in-house seminars at customers and potential customers sites, as well as at selected universities to train students who will soon be industry scientists. These seminars often serve as initial training in the event the potential customer decides to license or evaluate our software. Technical support is provided after the sale of any software in the form of on-site training (at the customers expense), web meetings and telephone, fax, and e-mail assistance to the customers users during the customers license period.\nWe provide telephone, e-mail, and web-based support for all of our software products. Technical support for our software is provided by our life sciences teams and our inside sales and support staff. We have found that most clients need minimal technical support for our software products.\nWe provide support to the GastroPlus User Group in Japan, which was organized by Japanese researchers in 2009. In early 2013, a group of scientists in Europe and North America organized another GastroPlus User Group following the example set in Japan. Over 1,450 members have joined this group to date. We support this group through coordination of online meetings each month and managing the user group website for exchange of information among members. These user groups provide us valuable feedback for desired new features and suggested interface changes.\nRESEARCH AND DEVELOPMENT\nThe development of our software is focused on expanding our product portfolio, designing enhancements to our core technologies, and integrating existing and new products into our principal software architecture and platform technologies. We intend to continue to offer regular updates to our products and to continue to look for opportunities to expand our existing suite of products and services.\nTo date, we have developed products internally, sometimes also licensing or acquiring products, or portions of products, from third parties. In certain instances, these arrangements have required that we pay royalties to third parties; we paid no royalties during the year ended August 31, 2022. We intend to continue to license or otherwise acquire technology or products from third parties when we believe that it makes business sense to do so.\nResearch and development (\"R&D\") activities include both enhancement of existing products and development of new products. Development of new products and adding functionality to existing products are capitalized in accordance with Financial Accounting Standards Board (\"FASB\") Accounting Standards Codification (\"ASC\") 985-20, Costs of Software to Be Sold, Leased, or Marketed. R&D expenditures, which primarily relate to both capitalized and expensed salaries, R&D supplies, and R&D consulting, were $6.4 million during fiscal year 2022, of which $3.2 million was capitalized. R&D expenditures were $6.9 million during fiscal year 2021, of which $2.9 million was capitalized. R&D expenditures during fiscal year 2020 were $5.3 million of which $2.3 million was capitalized.\nOur software products are designed and developed by our development teams which work remotely using collaboration software. Our products and services are delivered electronically.\nCUSTOMERS\nOur customers include companies involved in pharmaceuticals, biotechnology, agrotechnology, and cosmetics, as well as universities, hospitals, and government research organizations. We concentrate on serving the needs of our customers in drug discovery, development, clinical trials, and post-patent generic formulation development. Our current customer base is highly fragmented; in 2022, our three largest customers in terms of revenue each accounted for 5%, 3%, and 3% of our revenues, respectively.\nOur revenues exhibit seasonal fluctuations, with the first fiscal quarter (September-November) and fourth fiscal quarter (June-August) generally having the lowest revenues due to vacations and reduced activities at our customers sites. This is due to pharmaceutical industry buying patterns as well as our revenue recognition policies for software, consulting service slowdowns due to vacations, and lower customer and employee conference attendance in those periods. Revenues for any quarter are not necessarily indicative of revenues for any future period; however, because our pharmaceutical software is licensed on an annual basis, renewals are usually within the same quarter year after year, even though there are certain instances in which the license renewal term may not immediately follow the initial license term and therefore result in a shift of certain customer revenues to a subsequent quarter.\nENVIRONMENTAL RUGULATORY MATTERS\nWe believe we are in compliance in all material respects with all applicable environmental laws. Presently, we do not anticipate that such compliance will have a material effect on capital expenditures, earnings, or competitive position with respect to any of our operations.\nHUMAN CAPITAL RESOURCES\nWe are committed to our people, and we embrace a culture of engagement, empowerment, and equity. Over 90 percent of our global employees are employed full-time, and more than two-thirds work within our life sciences software or consulting divisions. Given the specialized nature of our business, candidates for our open positions are strategically selected for their unique education and skills. The majority of our employees have advanced degrees in mathematics, chemistry, biomedical engineering, and/or the pharmaceutical sciences; approximately half hold doctorate degrees and approximately one-fourth hold masters degrees.\nAs of August 31, 2022, we employed a total of 163 persons, including 157 full-time employees and 6 part-time employees, consisting of 113 in scientific, technical, and research and development, 21 in marketing and sales, and 29 in administration and accounting. Currently 75 employees hold PhDs. (including PharmDs) in their respective science or engineering disciplines, and 40 employees hold one or more Masters degrees. Most of the senior management team and all of the members of our Board of Directors hold graduate degrees.\nWe believe that our future success will depend, in part, on our ability to continue to attract, hire, and retain qualified personnel. To continue to support the endeavor we have implemented an employee referral program and have added a dedicated corporate recruiter to our team to further these efforts. We continue to seek additions to our science and technical staff, although the competition for such personnel in the pharmaceutical industry is intense, we hired over 20 scientists this past year. None of our employees are represented by a labor union, and we have never experienced a work stoppage. We believe that our relations with our employees are good.\nDiversity, Equity and Inclusion\nIn 2020 and 2021, we expanded our Human Resources team to implement unified and consistent policies, procedures, and employee training across all of our business units. In 2022, we added an internal recruiter to focus on expanding our recruitment and hiring presence in the market. We embrace diversity with the knowledge that it can lead to greater innovation, and in our workplace, we foster inclusion so all employees feel they are a part of our team with equal access to all opportunities. One of our goals is to continue expanding our focus on diversity, equity and inclusion. In terms of gender equity, women currently comprise 49% of our workforce.\nCompensation, Training and Awareness Programs\nIn 2022, Company-wide, we engaged an external consulting team to assist in analyzing all of our positions, including job descriptions and our compensation program, and are continuing to refine career paths for the different functions within our organization. We use these career paths as a basis for promoting employee career development and growth within the organization, as well as in recruiting and hiring new talent.\nThe past year we focused on mandated compliance, data privacy and soft-skills training throughout the organization. As we finalize the career paths, we are also committed to including additional training opportunities for technical and leadership development.\nIn addition to these new employee training and development initiatives, we have an ongoing program of cross-specialty training consisting of presentations by expert modelers from each division. These monthly sessions serve to familiarize all divisions with the applications and techniques unique to each division and, in so doing, create opportunities to find synergies, expand the knowledge base across all divisions, and build a shared sense of purpose.\nHealth & Safety\nWe place a high value on maintaining a clean, safe, and healthy environment for our employees. We believe that we have in place effective procedures to identify, evaluate, and mitigate potential risks associated with our operations, although we believe such risks are minimal.\nThe well-being of our employees, whether they are working in our divisional offices or remotely from home offices, is paramount. We believe that we are substantially in compliance with all applicable laws, regulations, and standards, and we make every effort to be attentive and responsive to our employees needs. In our offices, we have provided employees with ergonomic equipment, including ergonomic chairs and standing desks, and for their home offices, we provide an allowance for the purchase of home office equipment.\nWe also consider open and transparent channels of communication to be a critical component of our employee health and wellness program. Toward this end, on a quarterly basis, we hold a company-wide virtual meeting to keep our employees engaged, informed, and apprised of activities occurring at the company and at each division, including quarterly financial results, future goals, and notable milestones.\nINTELLECTUAL PROPERTY AND OTHER PROPRIETARY RIGHTS\nWe primarily protect our intellectual property through copyrights and trade secrets. Our intellectual property consists primarily of source code for computer programs and data files for various applications of those programs in the pharmaceutical software businesses. The expertise of our staff is a considerable asset closely related to intellectual property and attracting and retaining highly qualified scientists and engineers is essential to our business.\nEFFECT OF GOVERNMENT REGULATIONS\nWe believe that our operations are substantially in compliance with all applicable laws and regulations and that we hold all necessary permits to operate our business in each jurisdiction in which our facilities are located. Laws and government regulations are subject to change and interpretation. Our pharmaceutical software products are tools used in research and development and are neither approved nor approvable by the FDA or other government agencies.\nNo significant pollution or other types of hazardous emission result from our operations and it is not anticipated that our operations will be materially affected by federal, state, or local provisions concerning environmental controls. Our costs of complying with environmental, health, and safety requirements have not been material. Furthermore, compliance with federal, state, and local requirements regulating the discharge of materials into the environment, or otherwise relating to the protection of the environment, have not had, nor are they expected to have, any material effect on the capital expenditures, earnings, or competitive position of the Company.\nCOMPANY WEBSITE\nWe maintain a corporate website at: www.simulations-plus.com.\nThe contents of this website are not incorporated in or otherwise to be regarded as part of this Report. We file reports with the SEC which are available on our website free of charge. These reports include annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, Section 16 filings on Form 3, Form 4, and Form 5, and other related filings, each of which is provided on our website as soon as reasonably practical after we electronically file such materials with or furnish them to the SEC. In addition, the SEC maintains a website (www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, including the Company.\nENVIRONMENTAL, SOCIAL, GOVERNANCE\nWe are committed to providing consistent and excellent return to our shareholders, all while maintaining a strong sense of good corporate citizenship that places a high value on the welfare of our employees, the communities in which we operate, and the world as a whole. We believe that effectively prioritizing and managing our Environmental, Social, and Governance (\"ESG\") factors will help create long-term value for our investors. We also believe that transparently disclosing the goals and relevant metrics related to our ESG programs will allow our stakeholders to be informed about our progress.\nThe topics covered in this section are identified through third-party ESG reporting frameworks, standards and metrics, such as the Sustainability Accounting Standards Board (\"SASB\"), and United Nations Sustainable Development Goals (\"SDGs\"). More information regarding our key ESG programs, goals and commitments, and key metrics can be found on our website and in our 2020 ESG Report.\nOur ESG highlights include the following:\nCOVID-19 Response\nWith employee health and safety always a top priority, we proactively implemented a COVID-19 Contingency Plan in late February of 2020, prior to the state-issued stay-at-home orders. The comprehensive plan included information on prevention measures, travel restrictions, when and how to quarantine, the Families First Coronavirus Response Act, sick leave arrangements including caring for family members affected by COVID-19, and workplace safety measures. At the time, as part of our ongoing flexible work initiative to give employees the option of telecommuting or working remotely, over 40 percent of our workforce was already working from home, however in response to the COVID-19 pandemic, we took quick action to ensure the safety of the rest of our workforce by supporting them in setting up home offices.\nSince that initial plan was disseminated, additional updates from management have included the most up-to-date information from the U.S. Department of State, Center for Disease Control (\"CDC\"), and World Health Organization (\"WHO\"), and we have, at all times, encouraged employees to keep management informed of the need for any additional support. Our COVID-19 Contingency Plan communication and our Policy for Returning to Work During the Coronavirus Pandemic specify several CDC-recommended measures to mitigate the spread of COVID-19 in the workplace, including that masks be worn in the office, the importance of social and physical distancing and frequent hand-washing, and that employees are to remain home if feeling unwell and self-quarantine following any possible exposure to the virus. In addition to these measures, we have increased sanitation procedures and updated our travel policy to ensure the safety of those employees who have resumed working in the office and those who travel for business.\nWe will continue to monitor mandates, guidelines, and recommendations issued by the CDC, WHO, and local governments as they are released, and will revise our COVID-19 Contingency Plan communication and our Policy for Returning to Work During the Coronavirus Pandemic accordingly.\nEnvironmental Matters\nWe participate in a recycling program through our local waste management facilities to divert all recyclable materials - bottles, cans, plastics, paper, and cardboard - from landfills. Across the Company, our facilities provide for recycling, and our electronic waste is sent to local approved e-waste recycling centers.\nOur operations are built on continual improvements in efficiency and clean energy. From 2012 to 2019, our Cognigen division redesigned its data center to be more energy efficient as part of our ongoing and increasing commitment to reduce our environmental footprint and energy usage. An example of an upgrade is the installation of an uninterruptible power supply with hot and cold dial separation and regulating the temperature and airflow through in-row cooling units with high efficiency fans based on cooling needs.\nWe are also attentive to our energy use in our office operations. For instance, our Lancaster facility recently switched to renewable energy. Lancaster Choice Energy (LCE) is the locally run power program created by the City of Lancaster, and we now proudly participate in LCEs Smart Choice 100% renewable energy program. Our decision to opt into the program not only contributes to the citys goal of becoming one of the worlds first net-zero cities, but also reflects our dedication to creating positive impacts on the environment and local communities.\nWe believe we are in compliance in all material respects with all applicable environmental laws. Presently, we do not anticipate that such compliance will have a material effect on capital expenditures, earnings, or competitive position with respect to any of our operations.\nSocial Impact and Supporting our Communities\nOur support for the academic community is broad and deep. We provide certain distinguished professors at academic institutions with free reference site licenses for nonprofit research and teaching, including providing free access to our software in university instruction. In addition to reference site licenses, academic and research institutions are entitled to a 95% discount off commercial license fees, and we offer students and professors either free or substantially reduced fees to attend our training courses and workshops. In recent years, we have sponsored several students with awards given by the Society of Toxicology.\nWe provide sponsorships to numerous conferences, symposia, and associations such as the American Conference on Pharmacometrics (\"ACoP\"), American Association of Pharmaceutical Scientists (\"AAPS\"), American Chemical Society (\"ACS\"), Controlled Release Society (\"CRS\"), Groupe de Métabolisme et Pharmacocinétique (\"GMP\"), and the Gordon Research Conferences.\nWe encourage employees to volunteer in their local communities, and we offer our employees the flexibility they need to participate, from sponsoring and participating in charity golf tournaments to volunteering to serve hot meals to the disadvantaged. In recent years, we have joined the global GivingTuesday movement and donated food, clothing, and financial support to several organizations that serve those in need in our communities.\nOur People\nOur commitment to community, to education, and to gender equity can best be summarized by how we have, for more than a decade, funded a summer scholarship to Tech Trek, a one-week residential science, technology, engineering, and math (\"STEM\") camp founded and operated by the American Association of University Women (\"AAUW\") that is designed to inspire young women to attend college, to major in STEM fields, and to pursue STEM careers. Our own female scientists, who are excellent role models for these young women, have volunteered their time to personally present our Tech Trek scholarship each year.\nCustomer Privacy & Data Security\nWe value customer privacy and the data we collect are only as needed to deliver company information, software products, and consulting services. Our website includes our comprehensive Privacy Policy, which details what and how data are collected, how data are used and stored, and the options for controlling personal data, including opting out, accessing, updating, or deleting it.\nIn recognition of the critical importance of Data Security to our operations, including Cybersecurity, Data Protection, and Customer Privacy, our executive leadership team conducts a thorough examination of all elements of Data Security. Our objective is to ensure the security, confidentiality, and privacy of our systems and information assets, and to follow and be compliant with all relevant laws, regulations, and guidelines, including, but not limited to:\n◦U.S. and State Data Privacy Laws\n◦The EUs General Data Protection Regulation (\"GDPR\")\n◦Pharmaceutical Good Practice Quality Guidelines, including FDA 21 CFR Part 11\n◦The Sarbanes-Oxley Act\n◦The Personal Information Protection Law of the Peoples Republic of China (\"PIPL\")\nOur corporate-level IT department brings greater consistency, efficiency, and functional IT support across all divisions. The IT department is responsible for centralizing divisional data processing, storage, and backup capabilities at each of our geographical locations. The IT department is also responsible for ensuring that corporate IT policies are aligned and compliant with all applicable regulatory provisions and current best practices.\nOur corporate-level Data Protection Officer (\"DPO\") is responsible for establishing and maintaining a Personal Data Privacy program throughout the Company that is compliant with applicable data privacy laws and legislation at the state and federal levels, as well as the EUs GDPR, and Chinas PIPL. The DPO is leading our efforts to further build and implement a company-wide Personal Data Protection and Customer Privacy framework, along with appropriate protocols and training.\nOur ongoing program of employee training in security awareness keeps our staff fully informed about potential cyber threats - such as phishing and malware - with periodic random phishing tests.\nBusiness Ethics\nFrom the Companys inception, we have placed the highest emphasis on conducting our business with honesty and integrity. The highest ethical standards are expected of management and employees alike, and we continuously strive to create a corporate culture of honesty, integrity, and trust. Throughout our operations and in our dealings with our stakeholders, we endeavor to engender the confidence that the Companys conduct is beyond reproach.\nThe policies we have developed are intended to:\n◦Define and disseminate our core values and the legal requirements applicable to good business conduct and ethical behavior\n◦Offer guidance in understanding Company policies, interpreting laws, and handling Company-related issues and situations\n◦Foster clear, ethical behaviors and conduct to create an atmosphere of respect, trust, cooperation, and collaboration throughout the Company and its activities\n◦Provide clear and well-defined procedures by which employees can easily obtain information, ask questions, and, if necessary, report any suspected violations of any of our Business Ethics policies\nIn addition to abiding by all applicable laws, all management and employees are required to comply fully with our Corporate Code of Business Conduct and Ethics which sets forth the Companys values, business culture, and practices.\nHuman Rights\nThe Company was founded on the belief that our software technologies could lead to important advances in healthcare, thereby improving patient outcomes, advancing and improving global health, and bettering the lives of humankind. This objective cannot be accomplished without a commitment to Human Rights, and we are committed to ensuring that, in our day-to-day business practices, in our business relationships, and in matters of employment, we will uphold our own principles as delineated in our Corporate Code of Business Conduct and Ethics. Furthermore, we support the principles set forth in the United Nations International Bill of Human Rights, specifically the Universal Declaration of Human Rights, and the ILO Declaration on Fundamental Principles and Rights at Work. As we evolve this policy, we will look to the UN Guiding Principles on Business and Human Rights (\"UNGPs\") for guidance.\nGovernance\nWe are committed to ensuring strong corporate governance practices on behalf of our shareholders and other stakeholders. We believe strong corporate governance provides the foundation for financial integrity and shareholder confidence. Our Board of Directors is responsible for the oversight of risks facing the Company, while our management is responsible for the day-to-day management of risk. The Board, as a whole, directly oversees our strategic and business risk, including risks related to financial reporting, compensation practices, ESG, and product developments. More information about our corporate governance features can be found in our Proxy Statement for the 2023 Annual Meeting of Shareholders (the \"Proxy Statement\"), which will be filed within 120 days after August 31, 2022, the close of our fiscal year covered by this Annual Report. ITEM 1A - RISK FACTORS\nYou should carefully consider the risks described below, as well as the other information in this Report, including our financial statements and the related notes and the section entitled Managements Discussion and Analysis of Financial Condition and Results of Operations, before investing in our publicly traded securities. The occurrence of any of the events or developments described below could harm our business, financial condition, operating results, and/or growth prospects. The risks described below are not the only ones facing us. Our business is also subject to the risks that affect many other companies, such as competition, technological obsolescence, labor relations, general economic conditions, geopolitical changes, and international operations. We operate in a rapidly changing environment that involves a number of risks, some of which are beyond our control. Additional risks not currently known to us or that we currently believe are immaterial also may impair our business operations and our liquidity. The risks described below could cause our actual results to differ materially from those contained in the forward-looking statements we have made in this Report, the information incorporated herein by reference, and those forward-looking statements we may make from time to time. You should understand that it is not possible to predict or identify all such factors. Consequently, you should not consider the following to be a complete discussion of all potential risks or uncertainties.\nCertain Risks Related to Our Business\nOur business is subject to risks arising from epidemic diseases, such as the recent outbreak of the COVID-19 illness.\nThe occurrence of regional epidemics or a global pandemic such as COVID-19 may adversely affect our operations, financial condition, and results of operations. The COVID-19 pandemic has had widespread, rapidly evolving, and unpredictable impacts on global society, economies, financial markets, and business practices. The extent to which global pandemics impact our business going forward will depend on factors such as the duration and scope of the pandemic; governmental, business, and individuals' actions in response to the pandemic; and the impact on economic activity including the possibility of recession or financial market instability.\nCertain Risks Related to Our Marketplace and Environment\nOur ability to sustain or increase revenues will depend upon our success in entering new markets, continuing to increase our customer base, and in deriving additional revenues from our existing customers.\nOur products are currently used primarily by modeling and simulation specialists in companies involved in pharmaceuticals, biotechnology, agrotechnology, and cosmetics, as well as universities, hospitals, and government research organizations. One component of our overall business strategy is to derive more revenues from our existing customers by expanding their use of our products and services. Such strategy would have our customers utilize our scientific informatics platforms and our tools and components to leverage vast amounts of information stored in both corporate databases and public data sources in order to make informed scientific and business decisions during the research and development process. In addition, we seek to expand into new markets, and new areas within our existing markets, by acquiring businesses in these markets, attracting and retaining personnel knowledgeable in these markets, identifying the needs of these markets, and developing marketing programs to address these needs. If successfully implemented, these strategies would increase the usage of our software and services by pharmacologists or pharmacometricians operating within our existing pharmaceutical, biotechnology, and chemical customers, as well as by new customers in other industries. However, if our strategies are not successfully implemented, our products and services may not achieve market acceptance or penetration in targeted new departments within our existing customers or in new industries. As a result, we may incur additional costs and expend additional resources without being able to sustain or increase revenue.\nConsolidation within the pharmaceutical and biotechnology industries may continue to lead to fewer potential customers for our products and services.\nA significant portion of our customer base consists of pharmaceutical and biotechnology companies. Consolidation within the pharmaceutical and biotechnology industries may result in fewer customers for our products and services. Although the industry consolidation that has taken place over the past 20 years has not prevented our business from growing to date, if one of the parties to a consolidation uses the products or services of our competitors, we may lose existing customers as a result of such consolidation.\nIncreasing competition and increasing costs within the pharmaceutical and biotechnology industries, drug development and services industry, and the life science market for modeling and simulation software and cheminformatics products may affect the demand for our products and services, which may affect our results of operations and financial condition.\nOur pharmaceutical and biotechnology customers demand for our products is impacted by continued demand for their products and by our customers research and development costs. Demand for our customers products could decline, and prices charged by our customers for their products may decline, as a result of governmental regulations and increasing competition, including competition from companies manufacturing generic drugs. In addition, our customers expenses could continue to increase as a result of increasing costs of complying with government regulations and other factors. A decrease in demand for our customers products, pricing pressures associated with the sales of these products, and additional costs associated with product development, could cause our customers to reduce research and development expenditures. Although our products increase productivity and reduce costs in many areas, because our products and services depend on such research and development expenditures, our revenues may be significantly reduced.\nHealth care reform and restrictions on reimbursement may affect the pharmaceutical, biotechnology, and industrial chemical companies that purchase or license our products or services, which may affect our results of operations and financial condition.\nThe continuing efforts of government and third-party payers in the markets we serve to contain or reduce the cost of health care may reduce the profitability of pharmaceutical, biotechnology, and industrial chemical companies, causing them to reduce research and development expenditures. Because some of our products and services depend on such research and development expenditures, our revenues may be significantly reduced. We cannot predict what actions federal, state, or private payers for health care goods and services may take in response to any health care reform proposals or legislation.\nWe face strong competition in the life science market for modeling and simulation software and for cheminformatics products.\nThe market for our modeling and simulation software products for the life science market is intensely competitive. We currently face competition from other scientific software providers, larger technology and solutions companies, in-house development by our customers and academic and government institutions, and the open-source community. Some of our competitors and potential competitors have longer operating histories in certain segments of our industry than we do and could have greater financial, technical, marketing, research and development, and other resources. Many of our competitors offer products and services directed at more specific markets than those we target, enabling these competitors to focus a greater proportion of their efforts and resources on these markets. Some offerings that compete with our products are developed and made available at lower cost by government organizations and academic institutions, and these entities may be able to devote substantial resources to product development and also offer their products to users for little or no charge. We also face competition from open-source software initiatives, in which developers provide software and intellectual property free over the Internet. In addition, some of our customers spend significant internal resources in order to develop their own software. Moreover, we intend to leverage our scientific informatics platform in order to enable our customers to more effectively utilize the vast amounts of information stored in both their databases and public data sources in order to make informed scientific and business decisions during the research and development process. This strategy could lead to competition from much larger companies that provide general data storage and management software. There can be no assurance that our current or potential competitors will not develop products, services, or technologies that are comparable to, superior to, or render obsolete, the products, services, and technologies we offer. There can be no assurance that our competitors will not adapt more quickly than we to technological advances and customer demands, thereby increasing such competitors market share relative to ours. Any material decrease in demand for our technologies or services may have a material adverse effect on our business, financial condition, and results of operations.\nWe are subject to pricing pressures in some of the markets we serve.\nThe market for modeling and simulation products for the life science industry is intensely competitive. Although the average price of our software licenses has increased or remained relatively constant for fiscal years 2020, 2021, and 2022, we may experience a decline in the future. In response to increased competition and general adverse economic conditions in this market, we may be required to modify our pricing practices. Changes in our pricing model could adversely affect our revenues and earnings.\nOur operations may be interrupted by the occurrence of a natural disaster or other catastrophic event at our primary facilities.\nOur research and development operations and administrative functions are primarily conducted at our facilities in Lancaster, California; Buffalo, New York; Paris, France; and Research Triangle Park, North Carolina. Although we have contingency plans in effect for natural disasters or other catastrophic events, the occurrence of such events could still disrupt our operations. For example, our Lancaster, California facility is located in a state that is particularly susceptible to earthquakes. Any natural disaster or catastrophic event in our facilities or the areas in which they are located could have a significant negative impact on our operations.\nOur insurance coverage may not be sufficient to avoid material impact on our financial position or results of operations resulting from claims or liabilities against us, and we may not be able to obtain insurance coverage in the future.\nWe maintain insurance coverage for protection against many risks of liability. The extent of our insurance coverage is under continuous review and is modified as we deem it necessary. Despite this insurance, it is possible that claims or liabilities against us may have a material adverse impact on our financial position or results of operations. In addition, we may not be able to obtain any insurance coverage, or adequate insurance coverage, when our existing insurance coverage expires. For example, we do not carry earthquake insurance for our facilities in Lancaster, California, because we do not believe the costs of such insurance are reasonable in relation to the potential risk for our part of California.\nChanges in government regulation or in practices relating to the pharmaceutical or biotechnology industries, including potential health care reform, could decrease the need for the services we provide.\nGovernmental agencies throughout the world, but particularly in the U.S., strictly regulate the drug development process. Our business involves helping pharmaceutical and biotechnology companies, among others, navigate the regulatory drug approval process. Accordingly, many regulations, and often new regulations, are expected to result in higher regulatory standards and often additional revenues for companies that service these industries. However, some changes in regulations, such as a relaxation in regulatory requirements or the introduction of streamlined or expedited drug approval procedures, or an increase in regulatory requirements that we have difficulty satisfying or that make our services less competitive, could eliminate or substantially reduce the demand for our services.\nAny negative commentaries made by any regulatory agencies or any failure by us to comply with applicable regulations and related guidance could harm our reputation and operating results, and compliance with new regulations and guidance may result in additional costs.\nAny negative commentaries made by any regulatory agencies or any failure on our part to comply with applicable regulations could result in the termination of ongoing research or the disqualification of data for submission to regulatory authorities. This could harm our reputation, our prospects for future work, and our operating results. If our operations are found to violate any applicable law or other governmental regulations, we might be subject to civil and criminal penalties, damages, and fines. Any action against us for violation of these laws, even if we successfully defend against it, could cause us to incur significant legal expenses, divert our managements attention from the operation of our business, and damage our reputation.\nOur sales cycle is lengthy, and customers may delay entering into contracts or decide not to adopt our products or solutions after we have expended significant time and resources and supported evaluation by them of our technology, which could result in delays in recognizing revenue and negatively impact our results of operations.\nOngoing negotiations and evaluation projects for new products, with new customers or in new markets may not result in significant revenues for us if we are unable to close new engagements on terms favorable to us in a timely manner, or at all. Unexpected delays in our sales cycle could cause our revenues to fall short of expectations. Further, the timing and length of negotiations required to enter into agreements with our customers and the ultimate enforcement of complex negotiated contractual provisions as we intended is difficult to predict. If we do not successfully negotiate certain key complex contractual provisions, there are disputes regarding such provisions, or if they are not enforceable as we intended, our revenues and results of operations would suffer. Further, if we were to incur significant effort and then fail to enter into final contracts with prospective customers, or if a contract is terminated earlier than expected, our revenues and results of operations could suffer.\nMany of our contracts are fixed price and may be delayed or terminated or reduced in scope for reasons beyond our control, or we may underprice or overrun cost estimates with these contracts, potentially resulting in financial losses.\nMany of our contracts provide for services on a fixed-price or fee-for-service with a cap basis and, accordingly, we bear the financial risk if we initially underprice our contracts or otherwise overrun our cost estimates. In addition, these contracts may be terminated or reduced in scope either immediately or upon notice. Cancellations may occur for a variety of reasons, and often at the discretion of the client. The loss, reduction in scope, or delay of a large contract or the loss or delay of multiple contracts could materially adversely affect our business, although our contracts frequently entitle us to receive the costs of winding down the terminated projects, as well as all fees earned by us up to the time of termination. Some contracts also entitle us to a predetermined termination fee and irrevocably committed costs/expenses.\nWe could experience a breach of the confidentiality of the information we hold or of the security of our computer systems.\nWe operate large and complex computer systems that contain significant amounts of client data. As a routine element of our business, we collect, analyze, and retain substantial amounts of data pertaining to the clinical study data analysis we conduct for our clients. Unauthorized third parties could attempt to gain entry to such computer systems for the purpose of stealing data or disrupting the systems. We believe that we have taken appropriate measures to protect them from intrusion, and we continue to improve and enhance our systems in this regard, but in the event that our efforts are unsuccessful, we could suffer significant harm. Our contracts with our clients typically contain provisions that require us to keep confidential the information generated from these studies. In the event the confidentiality of such information was compromised, we could suffer significant harm.\nImpairment of goodwill or intangible assets may adversely impact future results of operations.\nWe have intangible assets, including goodwill, capitalized computer software development costs, intellectual property, and other intangible assets, on our balance sheet due to our acquisitions of businesses. The initial identification and valuation of these intangible assets and the determination of the estimated useful lives at the time of acquisition involve use of management judgments and estimates. These estimates are based on, among other factors, input from accredited valuation consultants, reviews of projected future income cash flows, and statutory regulations. The use of alternative estimates and assumptions might have increased or decreased the estimated fair value of our goodwill and intangible assets that could potentially result in a different impact to our results of operations. If the future growth and operating results of our business are not as strong as anticipated and/or our market capitalization declines, this could impact the assumptions used in calculating the fair value of goodwill or intangibles. To the extent goodwill or intangibles are impaired, their carrying value will be written down to their implied fair value and a charge will be made to our income from continuing operations. Such an impairment charge could materially and adversely affect our operating results.\nCertain Risks Related to Our Operations\nSoftware defects or malfunctions in our products could hurt our reputation among our customers, result in delayed or lost revenue, and expose us to liability.\nOur business and the level of customer acceptance of our products depend upon the continuous, effective, and reliable operation of our software and related tools and functions. To the extent that defects cause our software to malfunction, and our customers use of our products is interrupted, our reputation could suffer, and our revenue could decline or be delayed while such defects are remedied. We may also be subject to liability for the defects and malfunctions of third-party technology partners and others with whom our products and services are integrated.\nDelays in the release of new or enhanced products or services or undetected errors in our products or services may result in increased cost to us, delayed market acceptance of our products, and delayed or lost revenue.\nTo achieve market acceptance, new or enhanced products or services can require long development and testing periods, which may result in delays in scheduled introduction. Any delays in the release schedule for new or enhanced products or services may delay market acceptance of these products or services and may result in delays in new customer orders for these new or enhanced products or services, or the loss of customer orders. In addition, new or enhanced products or services may contain a number of undetected errors or bugs when they are first released. Although we extensively test each new or enhanced software product or service before it is released to the market, there can be no assurance that significant errors will not be found in existing or future releases. As a result, in the months following the introduction of certain releases, we may need to devote significant resources to correct these errors. There can be no assurance, however, that all of these errors can be corrected.\nWe are subject to risks associated with the operation of a global business.\nWe derive a significant portion of our total revenue from our operations in international markets. During the years ended August 31, 2022, 2021, and 2020, 30%, 31%, and 29%, respectively, of our total revenue was derived from our international operations. Our global business may be affected by local economic conditions, including inflation, recession, and currency-exchange-rate fluctuations. In addition, political and economic changes, including international conflicts and terrorist acts, throughout the world may interfere with our or our customers activities in particular locations and result in a material adverse effect on our business, financial condition, and operating results. Potential trade restrictions, exchange controls, adverse tax consequences, and legal restrictions may affect the repatriation of funds into the U.S. Also, we could be subject to unexpected changes in regulatory requirements, the continued global spread and impact of the COVID-19 pandemic, the difficulties of compliance with a wide variety of foreign laws and regulations, potentially negative consequences from changes in or interpretations of U.S. and foreign tax laws, import and export licensing requirements, and longer accounts receivable cycles in certain foreign countries. These risks, individually or in the aggregate, could have an adverse effect on our results of operations and financial condition. For example, we are subject to compliance with the U.S. Foreign Corrupt Practices Act and similar anti-bribery laws, which generally prohibit companies and their intermediaries from making improper payments to foreign government officials for the purpose of obtaining or retaining business. While our employees, distributors, and agents are required to comply with these laws, we cannot be sure that our internal policies and procedures will always protect us from violations of these laws despite our commitment to legal compliance and corporate ethics. The occurrence or allegation of these types of risks may adversely affect our business, performance, prospects, value, financial condition, and results of operations.\nThe drug discovery and development services industry is highly competitive.\nOur clinical pharmacology division often competes for business not only with other clinical research organization (CROs), but also with internal discovery and development departments within our larger clients, who may have greater resources than ours. We also compete with universities and teaching hospitals for outsourced services. We compete based on a variety of factors, including without limitation:\nreputation for on-time quality performance\nreputation for regulatory compliance\nexpertise and experience in multiple specialized areas\nscope and breadth of service and product offerings across the drug discovery and development spectrum\nability to provide flexible and customized solutions to support our clients drug discovery and development needs\nprice/value\ntechnological expertise and efficient drug development processes\nfinancial stability\naccessibility of client data through secure portals\nability to acquire, process, analyze, and report data in an accurate manner\nIf we do not compete successfully, our business could suffer. Increased competition could lead to price and other concessions that might adversely affect our operating results. The drug discovery and development services industry has continued to see a trend towards consolidation, particularly among biotechnology companies, who are acquisition targets for each other and for larger pharmaceutical companies. If this trend continues, it is likely to produce more competition among the larger companies and CROs generally, with respect to both clients and acquisition candidates. In addition, while there are substantial barriers to entry for large, global competitors with broad-based services, small, specialized entities considering entering the CRO industry will continue to find lower barriers to entry, and private equity firms may determine that there are opportunities to acquire and consolidate these companies, thus further increasing possible competition. More generally, our competitors or others might develop technologies, services, or products that are more effective or more commercially attractive than our current or future technologies, services, or products, or that render our technologies, services, or products less competitive or obsolete. If competitors introduce superior technologies, services, or products and we cannot make enhancements to ours to remain competitive, our competitive position, and in turn our business, revenue, and financial condition, would be materially and adversely affected. In the aggregate, these competitive pressures may affect the attractiveness of our technologies, services, or products and could adversely affect our financial results.\nChanges in applicable U.S. and international tax laws or regulations and the resolution of tax disputes could negatively affect our financial results.\nWe are subject to income taxes, as well as non-income-based taxes, in both the U.S. and various foreign jurisdictions in which we do business. Significant judgment is required in determining our worldwide provision for income taxes and other tax liabilities. Changes in tax laws or tax rulings may have a significant adverse impact on our effective tax rate. For example, the U.S. and many countries where we do business are actively considering or have recently enacted changes in relevant tax, accounting, and other laws, regulations, and interpretations. Recently, the Biden Administration committed to increasing the corporate income tax rate, and to increasing the tax rate applied to profits earned outside the U.S. If enacted, the impact of these potential new rules could be material to our tax provision and the value of our deferred tax assets and liabilities.\nFurther, in the ordinary course of a global business, there are many intercompany transactions and calculations where the ultimate tax determination could change if tax laws or tax rulings were to be modified. We are also subject to non-income-based taxes, such as payroll, sales, use, value-added, net-worth, property, and goods-and-services taxes, in both the U.S. and various foreign jurisdictions. Although we believe that our income and non-income-based tax estimates are appropriate, there is no assurance that the final determination of tax audits or tax disputes will not be different from what is reflected in our historical income tax provisions and accruals.\nGiven the unpredictability of possible further changes to the U.S. or foreign tax laws and regulations and their potential interdependency, it is very difficult to predict the cumulative effect of such tax laws and regulations on our results of operations and cash flow, but such laws and regulations (and changes thereto) could adversely impact our financial results.\nContract research services create a risk of liability.\nAs a CRO, we face a range of potential liabilities which may include:\nErrors or omissions in reporting of study detail in preclinical studies that may lead to inaccurate reports, which may undermine the usefulness of a study or data from the study, or which may potentially advance studies absent the necessary support or inhibit studies from proceeding to the next level of testing\nRisks associated with our possible failure to properly care for our clients property, such as research models, records, work in progress, or other archived materials\nContractual risk transfer indemnifications generally do not protect us against liability arising from certain of our own actions, such as negligence or misconduct. We could be materially and adversely affected if we are required to pay damages or bear the costs of defending any claim that is outside any contractual indemnification provision, or if a party does not fulfill its indemnification obligations, or the damage is beyond the scope or level of insurance coverage. We also often contractually indemnify our clients (subject to a limitation of liability), similar to the way they indemnify us, and we may be materially adversely affected if we have to fulfill our indemnity obligations. Furthermore, there can be no assurance that we nor a party required to indemnify us will be able to maintain such insurance coverage (either at all or on terms acceptable to us).\nUpgrading our software could result in implementation issues and business disruptions.\nWe update our software on a regular basis and are continually in the process of refactoring our software programs. In doing so, we face the possibility that existing users will find the software unacceptable, or new users may not be as interested as they have been in the past versions. Translation errors might introduce new software bugs that will not be caught.\nThe drug discovery and development industry has a history of patent and other intellectual property litigation, involvement in intellectual property lawsuits is often very costly.\nThe drug discovery and development industry has a history of patent and other intellectual property litigation and these lawsuits will likely continue. Accordingly, we face potential patent infringement suits by companies that have patents for similar products and methods used in business or other suits alleging infringement of their intellectual property rights. Legal proceedings relating to intellectual property could be expensive, take significant time, and divert managements attention from other business concerns, whether we win or lose. If we do not prevail in an infringement lawsuit brought against us, we might have to pay substantial damages, including treble damages, and we could be required to stop the infringing activity or obtain a license to use technology on unfavorable terms.\nWe may not be able to successfully develop and market new services and products.\nWe may seek to develop and market new services and products that complement or expand our existing business or service offerings. We cannot guarantee that we will be able to identify new technologies of interest to our customers. Even if we are able to identify new technologies of interest, we may not be able to negotiate license agreements on acceptable terms, or at all. If we are unable to develop new services and products and/or create demand for those newly developed services and products, our future business, results of operations, financial condition, and cash flows could be adversely affected.\nAbility to incur debt could adversely affect our business and growth prospects.\nOn March 31, 2020, the Company entered into a Credit Agreement with Wells Fargo Bank, N.A. The Credit Agreement provided us with a credit facility of $3.5 million through April 15, 2022 (the \"Termination Date\"), on which date the Credit Agreement terminated in accordance with its terms. As a result, we can no longer draw down against the line of credit. We chose not to renew or pursue an alternative credit facility as we do not foresee a need to utilize such credit facility within the next twelve months. As of the Termination Date, there were no amounts drawn against the line of credit.\nShould circumstances require us to incur debt and a lender could not be found to provide that debt, this could have a significant adverse effect on our business, including making it more difficult for us to obtain financing on favorable terms, limiting our ability to capitalize on significant business opportunities, and making us more vulnerable to rising interest rates.\nWe depend on key personnel and may not be able to retain these employees or recruit additional qualified personnel, which could harm our business.\nOur success depends to a significant extent on the continued services of our senior management and other members of management. We have employment agreements with our CEO, CFO, and division presidents that range from one to three years. If our CEO, CFO, division presidents, or other members of senior management do not continue in their present positions, our business may suffer. Because of the specialized scientific nature of our business, we are highly dependent upon attracting and retaining qualified scientific and technical and managerial personnel. While we have a strong record of employee retention, there is still significant competition for qualified personnel in the software, pharmaceutical, and biotechnology fields. Therefore, we may not be able to attract and retain the qualified personnel necessary for the development of our business. The loss of the services of existing personnel, as well as the failure to recruit additional key scientific, technical, and managerial personnel in a timely manner, could harm our business.\nIf we are not successful in selecting and integrating the businesses and technologies we acquire, or in managing our current and future divestitures, our business may suffer.\nOver the years, we have expanded our business through acquisitions. We continue to search to acquire businesses and technologies and form strategic alliances. However, businesses and technologies may not be available on terms and conditions we find acceptable. We risk spending time and money investigating and negotiating with potential acquisition or alliance partners, but not completing transactions. Even if completed, acquisitions and alliances involve numerous risks which may include: difficulties in achieving business and continuing financial success; difficulties and expenses incurred in assimilating and integrating operations, services, products, technologies, or pre-existing relationships with our customers, distributors, and suppliers; challenges with developing and operating new businesses, including those which are materially different from our existing businesses and which may require the development or acquisition of new internal capabilities and expertise; challenges of maintaining staffing at the acquired entities, including loss of key employees; potential losses resulting from undiscovered liabilities of acquired companies that are not covered by the indemnification we may obtain from the seller(s); the presence or absence of adequate internal controls and/or significant fraud in the financial systems of acquired companies; diversion of managements attention from other business concerns; acquisitions that become dilutive to earnings, or in the event of acquisitions made through the issuance of our common stock to the shareholders of the acquired company, dilutive to the percentage of ownership of our existing shareholders; new technologies and products developed by others which cause businesses or assets we acquire to become less valuable; and risks that disagreements or disputes with prior owners of an acquired business, technology, service, or product may result in litigation expenses and dilution of our managements attention. In the event that an acquired business or technology or an alliance does not meet our expectations, our results of operations may be adversely affected.\nSome of the same risks exist when we decide to sell a business, site, or product line. In addition, divestitures could involve additional risks, including, without limitation, the following: difficulties in the separation of operations, services, products, and personnel, and the need to agree to retain or assume certain current or future liabilities in order to complete the divestiture. We evaluate the performance and strategic fit of our businesses. These and any divestitures may result in significant write-offs, including those related to goodwill and other intangible assets, which could have an adverse effect on our results of operations and financial condition. In addition, we may encounter difficulty in finding buyers or alternative exit strategies at acceptable prices and terms and in a timely manner. We may not be successful in managing these or any other significant risks that we encounter in divesting a business, site, or product line, and as a result, we may not achieve some or all of the expected benefits of the divestitures.\nOur quarterly and annual operating results fluctuate and may continue to fluctuate in the future, and if we fail to meet the expectations of analysts or investors, our stock price and the value of your investment could decline substantially.\nWe believe that operating results for any particular quarter are not necessarily a meaningful indication of future results. Nonetheless, fluctuations in our quarterly operating results could negatively affect the market price of our common stock. Our results of operations in any quarter or annual period have varied in the past and may vary from quarter to quarter or year to year. Our results of operations are influenced by various factors, many of which are out of our control, including without limitation:\nchanges in the general global economy\nthe number and scope of ongoing client engagements; the commencement, postponement, delay, progress, completion, or cancellation of client contracts in the quarter\nchanges in customer budget cycles\nthe number and scope of ongoing client engagements\nthe commencement, postponement, delay, progress, completion, or cancellation of client contracts in the quarter\nchanges in the mix of our products and services\ncompetitive pricing pressures\nthe extent of cost overruns\nbuying patterns of our clients\nbudget cycles of our clients\nthe effect of potential acquisitions and consequent integration\nthe timing of new product releases by us or our competitors\ngeneral economic factors, including factors relating to disruptions in the world credit and equity markets and the related impact on our customers access to capital\nchanges in tax laws, rules, regulations, and tax rates in the locations in which we operate\nthe timing and charges associated with completed acquisitions and other events\nthe financial performance of our investments\nexchange rate fluctuations\nWe derive a significant percentage of our revenues from a concentrated group of customers and the loss of more than one of our major customers could materially and adversely affect our business, results of operations or financial condition.\nThree customers accounted for 5%, 3%, and 3%, respectively, of revenue for fiscal year 2022. Three customers accounted for 11%, 4%, and 3%, respectively, of revenues for fiscal year 2021. Three customers accounted for 9%, 7% and 7% (a dealer account in Japan representing various customers), respectively, of revenues for fiscal year 2020. The loss of any of our major customers could have a material adverse effect on our results of operations and financial condition. We may not be able to maintain our customer relationships, and our customers may delay payment under, or fail to renew, their agreements with us, which could adversely affect our business, results of operations, or financial condition. Any reduction in the amount of revenues that we derive from these customers, without an offsetting increase in new revenues to other customers, could have a material adverse effect on our operating results. A significant change in the liquidity or financial position of our customers could also have a material adverse effect on the collectability of our accounts receivable, our liquidity, and our future operating results.\nWe conduct business outside the U.S., which exposes us to foreign currency exchange rate risk, amongst other risk, and could have a negative impact on our financial results.\nWe operate on a global basis. In the three years ended August 31, 2022, 2021, and 2020, we had revenues of $6.7 million, $4.8 million, and $5.0 million, respectively, denominated in foreign currency in certain Asian and European markets. We expanded our operations in Europe in 2020 with the addition of Lixoft in Paris, France.\nAs we continue to increase our international operations, our revenues and expenditures in foreign currencies are expected to become more material and subject to greater foreign currency exchange-rate fluctuations. Also, our foreign distributors typically sell our products in local currency, which impacts the price to foreign consumers. Additionally, Lixoft's functional currency is the Euro. Future foreign currency exchange rate fluctuations and global credit markets may cause changes in the U.S. dollar value of our purchases or sales and materially affect our revenues, profit margins, and results of operations, when converted to U.S. dollars. Changes in the value of the U.S. dollar relative to other currencies could result in material foreign currency exchange-rate fluctuations and, as a result, our net earnings could be materially adversely affected.\nAs we continue to expand international operations and increase purchases and sales in foreign currencies, we may utilize derivative instruments, as needed, to hedge our foreign currency exchange-rate risk. Our hedging strategies will depend on our forecasts of revenues, expenses, and cash flows, which are inherently subject to inaccuracies. Foreign currency exchange-rate hedges, transactions, re-measurements, or translations could materially impact our consolidated financial statements.\nA significant portion of our operating expenses is relatively fixed and planned expenditures are based in part on expectations regarding future revenues.\nAccordingly, unexpected revenue shortfalls may decrease our gross margins and could cause significant changes in our operating results from year to year. As a result, in future quarters, our operating results could fall below the expectations of securities analysts or investors, in which event our stock price would likely decrease.\nIf our customers cancel their contracts or terminate or delay their clinical trials, we may lose or delay revenues and our business may be adversely impacted.\nCertain of our customer contracts are subject to cancellation by our customers at any time with limited notice. Customers engaged in clinical trials may terminate or delay a clinical trial for various reasons, including the failure of the tested product to satisfy safety or efficacy requirements, unexpected or undesired clinical results, decisions to deemphasize a particular product or forgo a particular clinical trial, decisions to downsize clinical development programs, insufficient patient enrollment or investigator recruitment, and production problems resulting in shortages of required clinical supplies. Any termination or delay in the clinical trials would likely result in a consequential delay or termination in those customers service contracts. We have experienced terminations and delays of our customer service contracts in the past (although no such past terminations have had a significant impact on our results of operations), and we expect to experience additional terminations and delays in the future. The termination of single-study arrangements could result in decreased revenues and the delay of our customers clinical trials could result in delayed professional services revenues, which could adversely impact our business.\nIf our security is breached, our business could be disrupted, our operating results could be harmed, and customers could be deterred from using our products and services.\nOur business relies on the secure electronic transmission, storage, and hosting of sensitive information, including clinical data, financial information, and other sensitive information relating to our customers, company, and workforce. As a result, we face some risk of a deliberate or unintentional incident involving unauthorized access to our computer systems (including, among other methods, cyberattacks or social engineering) that could result in misappropriation or loss of assets or sensitive information, data corruption, or other disruption of business operations. In light of this risk, we have devoted significant resources to protecting and maintaining the confidentiality of our information, including implementing security and privacy programs and controls, training our workforce, and implementing new technology. We have no guarantee that these programs and controls will be adequate to prevent all possible security threats. We believe that any compromise of our electronic systems, including the unauthorized access, use, or disclosure of sensitive information, or a significant disruption of our computing assets and networks, would adversely affect our reputation and our ability to fulfill contractual obligations, and would require us to devote significant financial and other resources to mitigate such problems, and could increase our future cybersecurity costs. Moreover, unauthorized access, use, or disclosure of such sensitive information could result in contractual or other liability. In addition, any real or perceived compromise of our security or disclosure of sensitive information may result in lost revenues by deterring customers from using or purchasing our products and services in the future or prompting them to use competing service providers.\nAny failure by us to properly protect customer data we possess or are deemed to possess, in connection with the conduct of clinical trials, could subject us to significant liability.\nOur customers use our solutions to collect, manage, and report information in connection with the conduct of clinical trials. This information may be considered our customers proprietary information. Since we receive and process our customers data from customers utilizing our hosted solutions, there is a risk that we could be liable if there were a breach of any obligation to a protected person under contract, standard of practice, or regulatory requirement. If we fail to properly protect our customers data that is in our possession or deemed to be in our possession, we could be subjected to significant liability and our reputation would be harmed.\nWe rely upon a single internal hosting facility and Amazon Web Services to deliver certain solutions to our customers and any disruption of or interference with our hosting systems, operations, or use of the Amazon Web Services could harm our business and results of operations.\nSubstantially all of the computer hardware necessary to provide Cognigen solutions to our customers is located at our internal hosting facility in Buffalo, New York. In addition to our dedicated hosting facility, we utilize third-party cloud computing services from Amazon Web Services (\"AWS\") to help us efficiently scale our cloud-based solutions and provide training. Because we cannot easily switch our AWS-serviced operations to another cloud provider, any disruption of or interference with our use of AWS would impact our operations, and our business would be adversely impacted. Our systems and operations or those of AWS could suffer damage or interruption from human error, fire, flood, power loss, telecommunications failure, break-ins, terrorist attacks, acts of war, and similar events. The occurrence of a natural disaster, an act of terrorism or other unanticipated problems at our or AWS hosting facilities could result in lengthy interruptions in our service. Although we and AWS maintain backup facilities and disaster recovery services in the event of a system failure, these may be insufficient or fail. Any system failure, including network, software, or hardware failure, which causes an interruption in our Buffalo data center or our use of AWS, or that causes a decrease in responsiveness of our cloud-based solutions, could damage our reputation and cause us to lose customers, which could harm our business and results of operations. Our business may be harmed if our customers and potential customers believe our service is unreliable.\nDefects or errors in our software applications could harm our reputation, result in significant cost to us and impair our ability to market our solutions.\nOur software applications are inherently complex and may contain defects or errors, some of which may be material. Errors may result from our own technology or from the interface of our cloud-based solutions with legacy systems and data which we did not develop. The risk of errors is particularly significant when a new product is first introduced or when new versions or enhancements of existing products are released. The likelihood of errors is increased when we do more frequent releases of new products and enhancements of existing products. We have, from time to time, found defects in our solutions. Although these past defects have not resulted in any litigation against us to date, we have invested significant capital, technical, managerial, and other resources to investigate and correct these past defects and we have needed to divert these resources from other development efforts. In addition, material performance problems or defects in our solutions may arise in the future. Material defects in our cloud-based solutions could result in a reduction in revenues, delay in market acceptance of our solutions, or credits or refunds to our customers. In addition, such defects may lead to the loss of existing customers and difficulty in attracting new customers, diversion of development resources, or harm to our reputation. Correction of defects or errors could prove to be impossible or impractical. The costs incurred in correcting any defects or errors or in responding to resulting claims or liability may be substantial and could adversely affect our operating results.\nIf we are not able to reliably meet our data storage and management requirements, or if we experience any failure or interruption in the delivery of our services over the Internet, customer satisfaction and our reputation could be harmed, and customer contracts may be terminated.\nAs part of our current business model, we deliver our software over the Internet and store and manage hundreds of terabytes of data for our customers, resulting in substantial information technology infrastructure and ongoing technological challenges, which we expect to continue to increase over time. If we do not reliably meet these data storage and management requirements, or if we experience any failure or interruption in the delivery of our services over the Internet, customer satisfaction and our reputation could be harmed, leading to reduced revenues and increased expenses. Our hosting services are subject to service-level agreements and, in the event that we fail to meet guaranteed service or performance levels, we could be subject to customer credits or termination of these customer contracts. If the cost of meeting these data storage and management requirements increases, our results of operations could be harmed.\nSome of our software solutions and services utilize open-source software, and any failure to comply with the terms of one or more of these open-source licenses could adversely affect our business.\nSome of our software solutions utilize software covered by open-source licenses. Open-source software is typically freely accessible, usable and modifiable, and is used by our development team in an effort to reduce development costs to speed up the development process. Certain open-source software licenses require a user who intends to distribute the open-source software as a component of the users software to disclose publicly part or all of the source code to the users software. In addition, certain open-source software licenses require the user of such software to make any derivative works of the open-source code available to others on unfavorable terms or at no cost. This can subject previously proprietary software to open-source license terms. While we monitor the use of all open-source software in our products, processes, and technology and try to ensure that no open-source software is used in such a way as to require us to disclose or make available the source code to the related product or solution, such use could inadvertently occur. This could harm our intellectual property position and have a material adverse effect on our business.\nWe may be unable to adequately enforce or defend our ownership and use of our intellectual property and other proprietary rights.\nOur success is heavily dependent upon our intellectual property and other proprietary rights. We rely upon a combination of trademark, trade secret, copyright, patent, and unfair competition laws, as well as license and access agreements and other contractual provisions, to protect our intellectual property and other proprietary rights. In addition, we attempt to protect our intellectual property and proprietary information by requiring certain of our employees and consultants to enter into confidentiality, noncompetition, and assignment-of-inventions agreements. The steps we take to protect our intellectual property rights may not be adequate to prevent misappropriation of our technology by third parties or may not be adequate under the laws of some foreign countries, which may not protect our intellectual property rights to the same extent as do the laws of the United States.\nThe laws of some foreign countries do not protect intellectual property rights to the same extent as the laws of the United States. Many companies have encountered significant problems in protecting and defending intellectual property rights in certain foreign jurisdictions. This could make it difficult for us to stop infringement or the misappropriation of our intellectual property rights.\nOur attempts to protect our intellectual property may be challenged by others or invalidated through administrative process or litigation, and agreement terms that address noncompetition are difficult to enforce in many jurisdictions and may not be enforceable in any particular case. In addition, there remains the possibility that others will reverse engineer our products in order to introduce competing products, or that others will develop competing technology independently. If we resort to legal proceedings to enforce our intellectual property rights or to determine the validity and scope of the intellectual property or other proprietary rights of others, the proceedings could be burdensome and expensive, even if we were to prevail. The failure to adequately protect our intellectual property and other proprietary rights may have a material adverse effect on our business, results of operations, or financial condition.\nCurrent and future litigation against us, which may arise in the ordinary course of our business, could be costly and time-consuming to defend.\nWe are subject to claims that arise in the ordinary course of business, such as claims brought by our customers in connection with commercial disputes and employment claims made by our current or former employees. Third parties may in the future assert intellectual property rights to technologies that are important to our business and demand back royalties or demand that we license their technology. Litigation may result in substantial costs and may divert managements attention and resources, which may seriously harm our business, overall financial condition, and operating results. Insurance may not cover such claims, may not be sufficient for one or more such claims, and may not continue to be available on terms acceptable to us. A claim brought against us that is uninsured or underinsured could result in unanticipated costs, negatively affecting our business, results of operations, and financial condition.\nWe could incur substantial costs resulting from product liability claims relating to our products or services or our customers use of our products or services.\nAny failure or errors in a customers clinical trial caused or allegedly caused by our products or services could result in a claim for substantial damages against us by our customers or the clinical trial participants, regardless of our responsibility for the failure. Although we are generally entitled to indemnification under our customer contracts against claims brought against us by third parties arising out of our customers use of our products, we might find ourselves entangled in lawsuits against us that, even if unsuccessful, may divert our resources and energy and adversely affect our business. Further, in the event we seek indemnification from a customer, a court may not enforce our indemnification right if the customer challenges it or the customer may not be able to fund any amounts for indemnification owed to us. In addition, our existing insurance coverage may not continue to be available on reasonable terms or may not be available in amounts sufficient to cover one or more large claims, or the insurer may disclaim coverage as to any future claim.\nOur business depends on the clinical trial market, and a downturn in this market could cause our revenues to decrease.\nSome of our business depends on clinical trials conducted or sponsored by pharmaceutical, biotechnology, and medical device companies, CROs, and other entities. Our revenues may decline as a result of conditions affecting these industries, including general economic downturns, increased consolidation, decreased competition, or fewer products under development. Other developments that may affect these industries and harm our operating results include product liability claims, changes in government regulation, changes in governmental price controls or third-party reimbursement practices, and changes in medical practices. Disruptions in the world credit and equity markets may also result in a global downturn in spending on research and development and clinical trials and may impact our customers access to capital and their ability to pay for our solutions. Any decrease in research and development expenditures or in the size, scope, or frequency of clinical trials could materially adversely affect our business, results of operations, or financial condition.\nAs a public company, we are obligated to maintain proper and effective internal control over financial reporting. As our business expands both organically and through acquisitions, we may be unable to effectively adapt our current systems to our changing business needs and may fail to develop and maintain an effective system of disclosure controls and internal control over financial reporting which could impair our ability to produce timely and accurate financial statements or comply with applicable laws and regulations.\nAs a public company, we are subject to the reporting requirements of the Securities Exchange Act of 1934, as amended (the Exchange Act), the Sarbanes-Oxley Act of 2002 (the Sarbanes-Oxley Act), the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (the Dodd-Frank Act), and other applicable securities rules and regulations. Compliance with these rules and regulations will increase our legal and financial compliance costs, make some activities more difficult, time-consuming, and/or costly, and increase demand on our systems and resources. The Exchange Act requires, among other things, that we file annual, quarterly, and current reports with respect to our business and operating results. The Sarbanes-Oxley Act requires, among other things, that we maintain effective disclosure controls and procedures and internal control over financial reporting. As a company, we continually review and evaluate the adequacy of our disclosure controls and procedures and internal controls over financial reporting for deficiencies and improvements.\nAs we expand our operations through acquisitions and organic growth, our current systems for disclosure controls and procedures and internal control over financial reporting may be inadequate to meet our growing and changing business. Accordingly, we may require significant resources and management oversight to maintain and, if necessary, improve our disclosure controls and procedures and internal control over financial reporting. As a result, managements attention may be diverted from other business concerns, which could adversely affect our business and operating results. In addition, we may need to hire more employees in the future or engage outside consultants with respect to developing and maintaining our disclosure controls and internal control over financial reporting, which would increase our costs and expenses.\nIn addition, as a public company, we are required, pursuant to Section 404 of the Sarbanes-Oxley Act, to furnish a report by management on, among other things, the effectiveness of our internal control over financial reporting. Effective internal control over financial reporting is necessary for us to provide reliable financial reports and, together with adequate disclosure controls and procedures, is designed to prevent fraud. As a result of the growth of our business both organically and through acquisitions, we may fail to implement required new or improved controls, or experience difficulties in their implementation, which may cause us to not meet our reporting obligations. If we or our independent registered public accounting firm were to identify a material weakness, and/or if we are unable to assert that our internal control over financial reporting is effective, we could lose investor confidence in the accuracy and completeness of our financial reports, which could cause the price of our common stock to decline, and we may be subject to investigation by the SEC.\nAs a public company, we may incur significant administrative workload and expenses in connection with new and changing compliance requirements.\nAs a public company with common stock listed on The Nasdaq Global Select Market, we must comply with various laws, regulations, and requirements. New laws and regulations, as well as changes to existing laws and regulations affecting public companies, including the provisions of the Sarbanes-Oxley Act, the Dodd-Frank Act, and rules adopted by the SEC and by the Nasdaq Global Select Market, may result in increased general and administrative expenses and a diversion of managements time and attention as we respond to new requirements.\nCertain Risks Related to Ownership of Our Common Stock\nWe have been paying quarterly dividends on shares of our common stock, and although there has been a consistent track record of paying these dividends, the Board of Directors may suspend the dividend, and, consequently, your ability to achieve a return on your investment will depend on appreciation in the price of our common stock.\nShould the Board of Directors suspend the dividend and decide to use those funds to invest more into our business, you may not receive any dividends on your investment in our common stock for the foreseeable future and the success of an investment in shares of our common stock will depend upon any future appreciation in its value. Shares of our common stock may depreciate in value or may not appreciate in value.\nIf our operating and financial performance in any given period does not meet any guidance that we provide to the public, the market price of our common stock may decline.\nWe may, but are not obligated to, provide public guidance on our expected operating and financial results for future periods. Any such guidance will be comprised of forward-looking statements subject to the risks and uncertainties described in this prospectus and in our other public filings and public statements. Our actual results may not always be in line with or exceed any guidance we have provided, especially in times of economic uncertainty. If, in the future, our operating or financial results for a particular period do not meet any guidance we provide or the expectations of investment analysts, or if we reduce our guidance for future periods, the market price of our common stock may decline. Even if we do issue public guidance, there can be no assurance that we will continue to do so in the future.\nThe price of our common stock may fluctuate significantly, and investors could lose all or part of their investments.\nShares of our common stock were sold in our initial public offering (IPO) in 1996 at a price of $1.25 per share (on a post-split basis), and our common stock has subsequently traded as high as $90.92 and as low as $0.38 from our IPO through August 31, 2022. However, an active, liquid, and orderly market for our common stock on the Nasdaq Global Select Market or otherwise may not be sustained, which could depress the trading price of our common stock. The trading price of our common stock may be subject to wide fluctuations in response to various factors, some of which are beyond our control, including without limitation:\nour quarterly or annual earnings or those of other companies in our industry\nannouncements by us or our competitors of significant contracts or acquisitions\nchanges in accounting standards, policies, guidance, interpretations, or principles\ngeneral economic and stock market conditions, including disruptions in the world credit and equity markets\nthe failure of securities analysts to cover our common stock or changes in financial estimates by analysts\nfuture sales of our common stock\nthe other factors described in these Risk Factors\nIn recent years, the stock market in general, and the market for technology-related companies in particular, has experienced wide price and volume fluctuations. This volatility has had a significant impact on the market price of securities issued by many companies, including companies in our industry. The price of our common stock could fluctuate based upon factors that have little to do with our performance, and these fluctuations could materially reduce our stock price.\nIn the past, some companies, including companies in our industry, have had volatile market prices for their securities and have had securities class action suits filed against them. The filing of a lawsuit against us, regardless of the outcome, could have a material adverse effect on our business, financial condition, and results of operations, as it could result in substantial legal costs and a diversion of our managements attention and resources.\nThe price of our common stock may be volatile, and our stockholders may not be able to resell shares of our common stock at or above the price they paid.\nThe trading price of our common stock is volatile and could be subject to wide fluctuations in response to various factors, some of which are beyond our control. Factors that could cause volatility in the market price of our common stock include, but are not limited to:\nachievement of expected software product and consulting service revenues and profitability, including the effects of seasonality on our results of operations, as well as adjustments to our revenues forecasts\nthe ongoing COVID-19 pandemic, see -Certain Risks Related to our Business-Our business is subject to risks arising from epidemic diseases, such as the recent outbreak of the COVID-19 illness\nannouncements of new products by us or our competitors\nannouncements or developments in any intellectual property infringement actions in which we may become involved\nour operating results\nresults from, or any delays in, clinical trial programs of our clients and their need for our services\nchanges or developments in laws or regulations applicable to our products\nconsolidation within the pharmaceutical and biotechnology industries leading to fewer potential customers for our products and services\ndelays in the release of new or enhanced products or services or undetected errors in our products or services may result in increased cost to us, delayed market acceptance of our products, and delayed or lost revenue\nadverse actions taken by regulatory agencies with respect to our clinical trials, manufacturing supply chain, or sales and marketing activities\nthe success of our efforts to acquire or develop additional products\nannouncements concerning our competitors or the pharmaceutical industry in general\nactual or anticipated fluctuations in our operating results\nFDA or other U.S. or foreign regulatory actions affecting us or our industry or other healthcare reform measures in the United States\nchanges in financial estimates or recommendations by securities analysts\ntrading volume of our common stock\nsales of our common stock by us, our executive officers and directors, or our stockholders in the future\ngeneral economic and market conditions and overall fluctuations in the United States equity markets, including volatility related to the recent coronavirus outbreak and related health concerns\nthe loss of any of our key scientific or management personnel\nBroad market fluctuations may adversely affect the trading price or liquidity of our common stock. In the past, when the market price of a stock has been volatile, holders of that stock have sometimes instituted securities class action litigation against the issuer. If any of our stockholders were to bring such a lawsuit against us, we could incur substantial costs defending the lawsuit and the attention of our management would be diverted from the operation of our business, which could seriously harm our financial position. Any adverse determination in litigation could also subject us to significant liabilities.\nIf securities or industry analysts issue an adverse or misleading opinion regarding our stock, or our inclusion in the S&P 600 discontinues, our stock price and trading volume could decline.\nThe trading market for our common stock is influenced by the research and reports that industry or securities analysts publish about us or our business as well as the stock indices that our common stock is included in. If any of the analysts who cover us issue an adverse or misleading opinion regarding us, our business model, our intellectual property or our stock performance, or if our operating results fail to meet the expectations of analysts, our stock price would likely decline. If one or more of these analysts cease coverage of us or fail to publish reports on us regularly, or if the S&P 600 removes us from its index, we could lose visibility in the financial markets, which in turn could cause our stock price or trading volume to decline.\nWe may raise capital through the issuance of our common stock, convertible debt, or equity-linked securities, which could result in dilution to our stockholders or a negative impact on the price of our common stock.\nWe may choose to raise additional capital due to market conditions or strategic considerations. To the extent that additional capital is raised through the sale of equity, convertible debt or other equity-linked securities, the issuance of these securities could result in dilution to our stockholders or result in downward pressure on the price of our common stock. ITEM 1B - UNRESOLVED STAFF COMMENTS\nNone. ITEM 2 - PROPERTIES\nWe lease 9,255 square feet of office space in Lancaster, California, where our corporate headquarters are located. The lease term extends to January 31, 2026, and the base rent is $17 thousand per month. The lease agreement gives the Company the right, upon 180 days prior notice, to opt out of all or part of the last four years of the term, with no penalty.\nWe lease 4,317 square feet of office space in Buffalo, New York. The lease term extends to November 30, 2026, and the base rent is $7 thousand per month with an annual 2% increase. The lease agreement provides the Company with two five-year renewal options and the right to terminate the lease with one years prior written notice with certain penalties. We previously leased 12,623 square feet of office space at a different location in Buffalo, New York. That lease term extended to November 2021 and the base rent was $16 thousand per month.\nWe have a data center colocation space in Buffalo, New York, with a lease term through November 30, 2026, and rent of $4 thousand per month with an annual 3% increase.\nWe lease 3,386 square feet of office space in Durham, North Carolina. The lease term extends to September 30, 2023, and the base rent is $8 thousand per month with an annual 3% increase.\nWe lease 2,300 square feet of office space in Paris, France. The lease term extends to November 30, 2024, and the rent is $5 thousand per month and adjusted each December based on a consumer price index.\nThe Company believes its existing facilities and equipment are in good operating condition and are suitable for the conduct of its business. ITEM 3 - LEGAL PROCEEDINGS\nWe may become subject to litigation, claims, investigations, and audits arising from time to time in the ordinary course of our business. At this time, however, we are not a party to any legal proceedings and are not aware of pending legal proceedings. ITEM 4 - MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II ITEM 5 - MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nThe Companys common stock, par value $0.001 per share, has traded on the Nasdaq Global Select Market under the symbol SLP since May 13, 2021, prior to which it traded on the Nasdaq Capital Market under the same symbol.\nHolders\nAs of October 19, 2022, there were 51 shareholders of record. A substantially greater number of holders of our common stock are street name or beneficial holders, whose shares are held by banks, brokers, and other financial institutions.\nDividends\nThe following dividends were declared by our Board of Directors during the fourth quarter of fiscal year 2022:\n(in thousands, except dividend per share amounts)\nFiscal Year Record Date Distribution\nDate # of Shares\nOutstanding on\nRecord Date Dividend per\nShare Total\nAmount\n2022 7/25/2022 8/01/2022 20,239 $ 0.06 $ 1,214\nAlthough we paid quarterly dividends of $0.06 per share of common stock each quarter in 2022, all future dividends are subject to declaration by our Board of Directors. There can be no assurances that our Board of Directors will continue the dividend distributions for any specified number of quarters. Refer to Note 8 - Shareholders Equity of the Notes to Financial Statements (Part II, Item 8 of this Report) for further details regarding dividends.\nSecurities authorized for issuance under equity compensation plans\nOn December 23, 2016, the Board of Directors adopted, and on February 23, 2017, the shareholders approved, the 2017 Equity Incentive Plan (the \"2017 Plan\"), under which a total of 1.0 million shares of common stock has been reserved for issuance. The 2017 plan would have terminated in December 2026; however, the 2017 Plan was replaced by the Companys 2021 Plan (as defined below), and as a result, no further issuances of shares may be made under the 2017 Plan.\nOn April 9, 2021, the Board of Directors adopted, and on June 23, 2021, the shareholders approved, the 2021 Equity Incentive Plan (the 2021 Plan), under which a total of 1.3 million shares of common stock has been reserved for issuance. The 2021 Plan will terminate in 2031.\nAs of August 31, 2022, employees and directors held Qualified Incentive Stock Options (\"ISOs\") and Non-Qualified Stock Options (NQSOs) to purchase 1.2 million shares of common stock at exercise prices ranging from $6.85 to $66.14 per share.\nEquity Compensation Plan Information\nThe following table provides information as of August 31, 2022, regarding our equity compensation plans:\n(in thousands, except weighted-average amounts)\nPlan category Number of securities to be issued upon exercise of outstanding options Weighted-average exercise price of outstanding options Number of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\nColumn reference (a) (b) (c)\nEquity Compensation Plans Approved by Security Holders 1,245 28.61 1,034\nEquity compensation plans not approved by security holders - - -\nTotal 1,245 28.61 1,034\nShareholder Return Performance Graph\nThe following graph compares the cumulative total stockholder return on Simulations-Plus, Inc. (SLP) common stock of a $100 investment from August 31, 2018, through August 31, 2022, assuming reinvestment of dividends, with a similar investment in the Russell 3000 index (Russell 3000) and with the companies listed in the Nasdaq Composite - Total Returns (IXIC), and the S&P600 Health Care Equipment & Services Industry Group Index (\"SP600-3510\"). The historical information set forth below is not necessarily indicative of future performance. This performance graph shall not be deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or incorporated by reference into any of our filings under the Securities Act of 1933, as amended, of the Exchange Act, except as shall be expressly set forth by specific reference in such filing.\n2018 2019 2020 2021 2022\nSLP $135.11 $236.47 $392.48 $292.94 $402.00\nNASDAQ $126.02 $123.74 $182.98 $237.12 $184.65\nRussell 3000 $117.79 $117.05 $139.55 $183.07 $157.68\nSP600-3510 $155.39 $132.62 $135.65 $210.73 $159.48\nRecent Sales of Unregistered Securities; Use of Proceeds from Registered Securities\nAs discussed elsewhere in this Report, on April 1, 2022, the Company released from escrow an aggregate of 20,326 unregistered shares of the Companys common stock to the former shareholders of Lixoft as partial payment of a $2.0 million holdback of the closing consideration payable pursuant to that Share Purchase and Contribution Agreement entered into by and among the Company and the former shareholders of Lixoft, dated March 31, 2020 (the \"SPCA\"). The shares had an aggregate value of $0.7 million.\nOn May 5, 2022, the Company issued an aggregate of 23,825 unregistered shares of the Companys common stock to the former shareholders of Lixoft pursuant to the Agreement. The shares had an aggregate value of $1.2 million and were issued as a portion of an earnout payment in connection with the satisfaction of certain year-over-year performance thresholds set forth in the SPCA.\nThe shares released as partial payment of the $2.0 million holdback and issued as partial payment of the earnout were issued in a transaction not involving a public offering in reliance upon an exemption from registration provided by Section 4(a)(2) of the Securities Act and/or Regulation S promulgated thereunder.\nDuring the fiscal year ended August 31, 2022, there were no other unregistered sales of our securities that were not reported in a Current Report on Form 8-K or our Quarterly Reports on Form 10-Q.\nRepurchases\nThere is currently no share repurchase program pending, and the Company has made no repurchases of its securities since fiscal year 2011; however, the Board of Directors may decide to institute such a program in the future. ITEM 6 - [RESERVED] ITEM 7 - MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following Managements Discussion and Analysis is intended to assist the reader in understanding our results of operations and financial condition. Managements Discussion and Analysis is provided as a supplement to, and should be read in conjunction with, our audited consolidated financial statements beginning on page of this Report. This Report includes certain statements that may be deemed to be forward-looking statements within the meaning of Section 27A of the Securities Act. All statements, other than statements of historical fact, included in this Report that address activities, events or developments that we expect, project, believe, or anticipate will or may occur in the future, including matters having to do with expected and future revenue, our ability to fund our operations and repay debt, business strategies, expansion and growth of operations and other such matters, are forward-looking statements. These statements are based on certain assumptions and analyses made by our management in light of its experience and its perception of historical trends, current conditions, expected future developments, and other factors it believes are appropriate in the circumstances. These statements are subject to a number of assumptions, risks and uncertainties, including general economic and business conditions, the business opportunities (or lack thereof) that may be presented to and pursued by us, our performance on our current contracts and our success in obtaining new contracts, our ability to attract and retain qualified employees, and other factors, many of which are beyond our control. You are cautioned that these forward-looking statements are not guarantees of future performance and those actual results or developments may differ materially from those projected in such statements.\nManagement Overview\nFiscal Year 2022 Financial Highlights:\nConsolidated revenues increased by $7.4 million, or 16%, to $53.9 million for the year ended August 31, 2022, compared to $46.5 million for the year ended August 31, 2021\nConsolidated gross profit increased by $7.2 million, or 20%, to $43.1 million for the year ended August 31, 2022, compared to $35.9 million for the year ended August 31, 2021\nIncome from operations increased by $3.7 million, or 33%, to $14.9 million for the year ended August 31, 2022, from $11.3 million for the year ended August 31, 2021\nNet income increased by $2.7 million, or 28% to $12.5 million for the year ended August 31, 2022, compared to $9.8 million for the year ended August 31, 2021\nDiluted earnings per share increased by $0.13, or 28% to $0.60 for the year ended August 31, 2022, compared to $0.47 for the year ended August 31, 2021\nStrategy Going Forward:\nContinue to pursue customer collaborations to support expansion of our products and services portfolio\nContinue our aggressive marketing campaigns and expand our use of social media and digital advertising\nContinue to expand our sales staff and distributor channels\nContinue to recruit scientific staff to support our product and services innovation\nContinue to seek strategic acquisitions that complement our existing solutions portfolio and expand our markets\nFiscal year 2022 was yet another record year for the Company. We believe the continued growth of our pharmaceutical software and services business is the result of steadily increasing adoption and awareness of the value of simulation and modeling software tools across the pharmaceutical industry, the continuing push by regulatory agencies for increased use of modeling and simulation, and the expertise we offer as consultants to assist companies involved in the research and development of new medicines. We continue to be a leader in the fast-growing global biosimulation market.\nResults of Operations\nComparison of fiscal year 2022 and fiscal year 2021\n(in thousands) Year ended August 31\n2022 2021 $ Change % Change\nRevenue $ 53,906 $ 46,466 $ 7,440 16 %\nCost of revenue 10,822 10,600 222 2 %\nGross profit 43,084 35,866 7,218 20 %\nResearch and development 3,208 4,047 (839) (21) %\nSelling, general, and administrative 24,965 20,566 4,399 21 %\nTotal operating expenses 28,173 24,613 3,560 14 %\nIncome from operations 14,911 11,253 3,658 33 %\nOther income (expense), net 204 (168) 372 (221) %\nIncome before income taxes 15,115 11,085 4,030 36 %\nProvision for income taxes (2,632) (1,303) (1,329) 102 %\nNet income $ 12,483 $ 9,782 $ 2,701 28 %\nRevenues\nRevenues increased by $7.4 million or 16%, to $53.9 million for the year ended August 31, 2022, compared to $46.5 million for the year ended August 31, 2021. This increase is primarily due to a $5.0 million, or 18%, increase in software-related revenue and $2.5 million, or 13%, increase in service-related revenue when comparing the years ended August 31, 2022, and 2021.\nCost of revenues\nCost of revenues remained relatively consistent with a slight increase of $0.2 million, or 2%, for the year ended August 31, 2022, compared to the year ended August 31, 2021. The increase is primarily due to a $0.4 million, or 5%, increase in service-related cost of revenue, partially offset by a decrease of $0.2 million, or 5%, in software-related cost of revenue when compared to the year ended August 31, 2021.\nGross profit\nGross profit increased by $7.2 million, or 20%, to $43.1 million for the year ended August 31, 2022, compared to $35.9 million, for the year ended August 31, 2021. The higher gross profit is due to an increase in gross profit for our software business of $5.1 million, or 21%, and an increase in gross profit for our services business of $2.1 million, or 18%.\nOverall gross margin percentage was 80% and 77% for the years ended August 31, 2022, and 2021, respectively.\nResearch and development\nWe incurred $6.4 million of research and development costs during the year ended August 31, 2022. Of this amount, $3.2 million was capitalized as a part of capitalized software development costs and $3.2 million was expensed. We incurred $6.9 million of research and development costs during year ended August 31, 2021. Of this amount, $2.9 million was capitalized and $4.0 million was expensed.\nSelling, general, and administrative expenses\nSelling, general, and administrative (\"SG&A\") expenses increased by $4.4 million, or 21%, to $25.0 million for the year ended August 31, 2022, compared to $20.6 million for the year ended August 31, 2021. The increase was primarily due to an increase in personnel costs of $2.9 million, an increase in insurance costs of $0.6 million related to cyber and D&O premiums, and an increase in travel costs of $0.4 million.\nAs a percent of revenues, SG&A expense was 46% for the year ended August 31, 2022, compared to 44% for the year ended August 31, 2021.\nOther income/expense\nTotal other income was $0.2 million for the year ended August 31, 2022, compared to total other expense of $0.2 million for the year ended August 31, 2021. The increase of $0.4 million is primarily due to an increase in net interest income of $0.5 million and a decrease in the value of contingent consideration of $0.2 million, partially offset by an increase in the loss on currency exchange of $0.4 million.\nProvision for income taxes\nThe provision for income taxes was $2.6 million for the year ended August 31, 2022, compared to $1.3 million for the year ended August 31, 2021. Our effective tax rate increased by 5% to 17% for the year ended August 31, 2022, from 12% for the year ended August 31, 2021. The effective rate differs from anticipated combined statutory rates of 25% due to R&D credits, foreign-tax-related items (tax credits and foreign-deemed intangible income deductions), and the tax effect for stock compensation and disqualifying dispositions. During the year ended August 31, 2021, as a result of an increase in the Company's stock price, a number of employees exercised and sold ISOs granted to them under their corporate incentive plans, creating corporate tax deductions that lowered the effective tax rate, whereas disqualifying dispositions were not as prevalent during the year ended August 31, 2022.\nComparison of fiscal year 2021 and fiscal year 2020\n(in thousands) Year ended August 31\n2021 2020 $ Change % Change\nRevenue $ 46,466 $ 41,589 $ 4,877 12 %\nCost of revenue 10,600 10,649 (49) - %\nGross profit 35,866 30,940 4,926 16 %\nResearch and development 4,047 2,975 1,072 36 %\nSelling, general, and administrative 20,566 16,360 4,206 26 %\nTotal operating expenses 24,613 19,335 5,278 27 %\nIncome from operations 11,253 11,605 (352) (3) %\nOther income (expense), net (168) (218) 50 (23) %\nIncome before income taxes 11,085 11,387 (302) (3) %\nProvision for income taxes (1,303) (2,055) 752 (37) %\nNet income $ 9,782 $ 9,332 $ 450 5 %\nRevenues\nRevenues increased by $4.9 million, or 12%, to $46.5 million for the year ended August 31, 2021, compared to $41.6 million for the year ended August 31, 2020. This increase is primarily due to a $6.1 million, or 28%, increase in software-related revenue, offset by a $1.2 million, or 6%, decrease in service-related revenue when comparing the years ended August 31, 2021, and 2020.\nCost of revenues\nCost of revenues remained relatively consistent for the year ended August 31, 2021, and 2020. The decrease is primarily due to lower contract research organization fees of $0.2 million, lower tech-support costs of $0.1 million, lower labor-related costs of $0.1 million, and lower training and travel costs of $0.1 million, partially offset by higher amortization of software development costs of $0.5 million related to the purchase of Lixoft.\nA significant portion of cost of revenues for pharmaceutical software products is the systematic amortization of capitalized software development costs, which is a fixed cost rather than a variable cost related to revenues. The amortization cost of $2.8 million for the year ended August 31, 2021, increased by $0.5 million compared to fiscal year 2020.\nCost of revenues as a percentage of revenue was 22.8% for the year ended August 31, 2021, compared to 25.6% for the year ended August 31, 2020, resulting in a decrease of 2.8%.\nGross profit\nGross profit increased $4.9 million, or 16%, to $35.9 million for the year ended August 31, 2021, compared to $30.9 million for the year ended August 31, 2020. The increase is due to an increase in gross profit for the software business of $5.7 million, or 31%, offset by a $0.8 million, or 7%, decrease in gross profit for the services business.\nOverall gross margin percentage was 77% and 74% for the year ended August 31, 2021, and 2020, respectively.\nResearch and development\nWe incurred $6.9 million of research and development costs during year ended August 31, 2021. Of this amount, $2.9 million was capitalized and $4.0 million was expensed. We incurred $5.3 million of research and development costs during year ended August 31, 2020. Of this amount, $2.3 million was capitalized and $3.0 million was expensed. The year-over-year increase of $1.6 million, or 30%, in research and development expenditures was primarily due to increased costs in the Simulations Plus, DILIsym, and Lixoft divisions.\nSelling, general, and administrative expenses\nSG&A expenses increased by $4.2 million, or 26% to $20.6 million for the year ended August 31, 2021, compared to $16.4 million for the year ended August 31, 2020. The increase was primarily due to a $4.0 million increase in personnel costs.\nAs a percent of revenues, selling, general and administrative expenses was 44% for the year ended August 31, 2021, compared to 39% for the year ended August 31, 2020.\nOther income/expense\nTotal other expense was $0.2 million for the year ended August 31, 2021, compared to $0.2 million for the year ended August 31, 2020. There was an increase in currency exchange gain of $0.2 million and an increase in interest income of $0.2 million, offset by an increase in the value of contingent consideration of $0.3 million.\nProvision for income taxes\nThe provision for income taxes was $1.3 million for the year ended August 31, 2021, compared to $2.1 million for the year ended August 31, 2020. Our effective tax rate decreased by 6% to 12% from 18% for the same periods.\nThe effective rate differs from anticipated combined statutory rates of 25% due to R&D credits, foreign-tax-related items (tax credits and foreign-deemed intangible income deductions), and the tax effect of stock-compensation-related items for stock compensation and disqualifying dispositions. During the years ended August 31, 2021, and 2020, as a result of an increase in stock prices, a number of employees exercised and sold incentive stock options granted to them under their corporate incentive plans, creating corporate tax deductions that lowered the effective tax rate\nResults of Operations by Business Unit\nComparison of fiscal year 2022 and fiscal year 2021\nRevenues\n(in thousands) Twelve Months Ended August 31,\n2022 2021 Change ($) Change (%)\nSoftware $ 32,642 $ 27,670 $ 4,972 18 %\nServices 21,264 18,796 2,468 13 %\nTotal $ 53,906 $ 46,466 $ 7,440 16 %\nCost of Revenues\n(in thousands) Twelve Months Ended August 31,\n2022 2021 Change ($) Change (%)\nSoftware $ 3,060 $ 3,235 $ (175) (5) %\nServices 7,762 7,365 397 5 %\nTotal $ 10,822 $ 10,600 $ 222 2 %\nGross Profit\n(in thousands) Twelve Months Ended August 31,\n2022 2021 Change ($) Change (%)\nSoftware $ 29,582 $ 24,435 $ 5,147 21 %\nServices 13,502 11,431 2,071 18 %\nTotal $ 43,084 $ 35,866 $ 7,218 20 %\nSoftware Business\nFor the year ended August 31, 2022, the revenue increase of $5.0 million, or 18%, compared to the year ended August 31, 2021, was primarily due to higher revenues from GastroPlus of $2.4 million and an increase in revenue from MonolixSuite Software of $1.6 million. Cost of revenue decreased by $0.2 million or 5% during the same periods, and gross profit increased by $5.1 million, or 21%, primarily due to the increase in revenue.\nServices Business\nFor the year ended August 31, 2022, the revenue increase of $2.5 million, or 13%, compared to the year ended August 31, 2021, was primarily due to higher revenues from PBPK of $1.4 million and an increase in revenues from QSP/QST of $0.5 million. Cost of revenue increased by $0.4 million, or 5%. Gross profit increased by $2.1 million, or 18%, for the same periods.\nComparison of fiscal year 2021 and fiscal year 2020\nRevenues\n(in thousands) Twelve Months Ended August 31,\n2021 2020* Change ($) Change (%)\nSoftware $ 27,670 $ 21,587 $ 6,083 28 %\nServices 18,796 20,002 (1,206) (6) %\nTotal $ 46,466 $ 41,589 $ 4,877 12 %\n*As Lixoft was acquired on April 1, 2020, five months of activity is reflected for fiscal year 2020.\nCost of Revenues\n(in thousands) Twelve Months Ended August 31,\n2021 2020* Change ($) Change (%)\nSoftware $ 3,235 $ 2,883 $ 352 12 %\nServices 7,365 7,766 (401) (5) %\nTotal $ 10,600 $ 10,649 $ (49) - %\n*As Lixoft was acquired on April 1, 2020, five months of activity is reflected for fiscal year 2020.\nGross Profit\n(in thousands) Twelve Months Ended August 31,\n2021 2020* Change ($) Change (%)\nSoftware $ 24,435 $ 18,704 $ 5,731 31 %\nServices 11,431 12,236 (805) (7) %\nTotal $ 35,866 $ 30,940 $ 4,926 16 %\n*As Lixoft was acquired on April 1, 2020, five months of activity is reflected for fiscal year 2020.\nSoftware Business\nFor the year ended August 31, 2021, the revenue increase of $6.1 million, or 28%, compared to the year ended August 31, 2020, was primarily due to increases in revenue from MonolixSuite of $2.9 million, an increase from GastroPlus revenue of $2.2 million and an increase from ADMET Predictor Software of $0.8 million. The cost of revenue increased by $0.4 million, or 12%. Gross profit increased by $5.7 million, or 31%, primarily due to the increase in revenue.\nServices Business\nFor the year ended August 31, 2021, the revenue decrease of $1.2 million, or 6%, compared to the year ended August 31, 2020, was primarily due to a decrease from other services revenue of $1.4 million, a decrease from QSP/QST revenue of $1.0 million, partially offset by an increase from PKPD revenue of $1.1 million. Cost of revenue decreased by $0.4 million, or 5%. Gross profit decreased by $0.8 million, or 7%, for the same periods.\nLIQUIDITY AND CAPITAL RESOURCES\nAs of August 31, 2022, the Company had $51.6 million in cash and cash equivalents, $76.7 million in short-term investments and working capital of $139.1 million. Our principal sources of capital have been cash flows from our operations. We have achieved continuous positive operating cash flow over the last thirteen fiscal years.\nOn March 31, 2020, the Company entered into a Credit Agreement with Wells Fargo Bank, N.A. The Credit Agreement provided us with a credit facility of $3.5 million through April 15, 2022 (the \"Termination Date\"), on which date the Credit Agreement terminated in accordance with its terms. As a result, we can no longer draw down against the line of credit. We chose not to renew or pursue an alternative credit facility as we do not foresee a need to utilize such credit facility within the next twelve months. As of the Termination Date, there were no amounts drawn against the line of credit.\nOn March 31, 2020, we entered into a Share Purchase and Contribution Agreement (the SPCA) with Lixoft. Under the terms of the SPCA, we agreed to pay the former shareholders of Lixoft total consideration of up to $16.5 million, consisting of two-thirds cash and one-third newly issued, unregistered shares of our common stock. At closing, we paid the former shareholders of Lixoft a total of $10.8 million, comprised of cash in the amount of $9.5 million and the issuance of 111,682 shares of our common stock valued at $3.7 million, net of adjustments and a $2.0 million holdback for representations and warranties. In addition, we paid $3.5 million of excess working capital based on the March 31, 2020, financial statements of Lixoft. In addition, the SPCA called for earnout payments of up to an additional $5.5 million, payable in two-thirds cash and one-third newly issued, unregistered shares of our common stock, based on a revenue-growth formula each year for the two years subsequent to April 1, 2020. The former shareholders could earn up to $2.0 million the first year and $3.5 million in year two. In June 2021, $2.0 million was paid out under the first earnout payment, which was comprised of $1.3 million of cash and shares of our common stock valued at $0.7 million. In April 2022, we released from escrow and distributed the $2.0 million holdback consideration, consisting of $1.3 million in cash and shares of our common stock valued at $0.7 million (amounting to an aggregate of 20,326 unregistered shares of our common stock), to the former shareholders of Lixoft. In May 2022, $3.5 million was paid out under the second earnout payment, which was comprised of $2.3 million of cash and shares of our common stock valued at $1.2 million (amounting to an aggregate of 23,825 unregistered shares of our common stock), to the former shareholders of Lixoft in accordance with the SPCA.\nWe believe that our existing capital and anticipated funds from operations will be sufficient to meet our anticipated cash needs for working capital and capital expenditures for the foreseeable future. Thereafter, if cash generated from operations is insufficient to satisfy our capital requirements, we may have to sell additional equity or debt securities or obtain a new credit facility. In the event such financing is needed in the future, there can be no assurance that such financing will be available to us, or, if available, that it will be in amounts and on terms acceptable to us. If cash flows from operations became insufficient to continue operations at the current level, and if no additional financing was obtained, then management would restructure the Company in a way to preserve its pharmaceutical business while maintaining expenses within operating cash flows.\nWe continue to seek opportunities for strategic acquisitions. If one or more such acquisitions is identified, a substantial portion of our cash reserves may be required to complete it; however, we intend to maintain sufficient cash reserves after any acquisition to provide reasonable assurance that outside financing will not be necessary to continue operations. If we identify an attractive acquisition that would require more cash to complete than we are willing or able to use from our cash reserves, we will consider financing options to complete the acquisition, including obtaining loans and issuing additional securities.\nExcept as discussed elsewhere in this Report, we are not aware of any trends or demands, commitments, events, or uncertainties that are reasonably likely to result in a decrease in liquidity of our assets. The trend over the last ten years has been increasing cash deposits from our operating cash flows, and we expect that trend to continue for the foreseeable future.\nCash Flows\nOperating Activities\nNet cash provided by operating activities was $17.9 million for the year ended August 31, 2022. Our operating cash flows resulted primarily from our net income of $12.5 million, which was generated by cash received from our customers, offset by cash payments we made to third parties for their services and employee compensation. In addition, $2.6 million related to changes in balances of operating assets and liabilities was subtracted from net income and $8.0 million related to non-cash charges was added to net income to reconcile to cash flow from operations.\nNet cash provided by operating activities was $19.2 million for the year ended August 31, 2021. Our operating cash flows resulted primarily from our net income of $9.8 million, which was generated by cash received from our customers, offset by cash payments we made to third parties for their services and employee compensation. In addition, $1.0 million related to changes in balances of operating assets and liabilities was added to net income and $8.4 million related to non-cash charges was added to net income to reconcile to cash flow from operations.\nInvesting Activities\nNet cash provided by investing activities during the year ended August 31, 2022, was $4.3 million, primarily due to the proceeds from the sale of short-term investments of $109.1 million, offset by the purchase of short-term investments of $100.8 million and computer software development costs of $3.2 million.\nNet cash used for investing activities during the year ended August 31, 2021, was $26.7 million, primarily due to the purchase of short-term investments of $122.4 million and computer software development costs of $2.9 million, offset by proceeds from the sale of short-term investments totaling $100.2 million.\nFinancing Activities\nNet cash used in financing activities during the year ended August 31, 2022, was $7.6 million, primarily due to dividend payments totaling $4.8 million and a $3.7 million earnout payment to the former shareholders of Lixoft, partially offset by proceeds from the exercise of stock options totaling $0.9 million.\nNet cash used in financing activities during the year ended August 31, 2021, was $4.7 million, primarily due to dividend payments totaling $4.8 million and a $1.3 million earnout payment to the former shareholders of Lixoft, partially offset by proceeds from the exercise of stock options totaling $1.5 million.\nDIVIDENDS\nRefer to Note 8 - Shareholders Equity of the Notes to Financial Statements (Part II, Item 8 of this Report) for details regarding dividends.\nKNOWN TRENDS OR UNCERTAINTIES\nWe have seen some consolidation in the pharmaceutical industry during economic downturns, although these consolidations have not had a negative effect on our total revenues to that industry. Should customer delays, holds, program cancellations, or consolidations and downsizing in the industry continue to occur, those events could adversely impact our revenues and earnings going forward.\nWe believe that the need for improved productivity in the research and development activities directed toward developing new medicines will continue to result in increasing adoption of simulation and modeling tools such as those we produce. New product developments in our pharmaceutical business segments could result in increased revenues and earnings if they are accepted by our markets; however, there can be no assurances that new products will result in significant improvements to revenues or earnings. For competitive reasons, we do not disclose all of our new product development activities.\nOur continued quest for acquisitions could result in a significant change to revenues and earnings if one or more such acquisitions are completed.\nThe potential for growth in new markets (e.g., healthcare) is uncertain. We will continue to explore these opportunities until such time as we either generate revenues or determine that resources would be more efficiently used elsewhere.\nRECENTLY ISSUED OR NEWLY ADOPTED ACCOUNTING STANDARDS\nIn October 2021, the FASB issued ASU No. 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers (ASU 2021-08). The amendment requires contract assets and contract liabilities acquired in a business combination to be recognized and measured in accordance with ASC 606, Revenue from Contracts with Customers, as if the acquirer had originated the contract. The amendment is intended to improve the accounting for acquired revenue contracts with customers in a business combination, related to the recognition of an acquired contract liability, and to payment terms and their effect on subsequent revenue recognized by the acquirer. The amendment also provides certain practical expedients when applying the guidance. ASU 2021-08 is effective for interim and annual periods beginning after December 15, 2022, on a prospective basis, with early adoption permitted. The Company expects to adopt ASU 2021-08 in the first quarter of fiscal year 2024. The Company is currently evaluating the potential impact of ASU 2021-08 to its consolidated financial statements.\nIn November 2021, the FASB issued ASU 2021-10, Government Assistance (Topic 832), which requires business entities to disclose information about transactions with a government that are accounted for by applying a grant or contribution model by analogy (for example, IFRS guidance in IAS 20 or guidance on contributions for not-for-profit entities in ASC 958-605). For transactions within scope, the new standard requires the disclosure of information about the nature of the transaction, including significant terms and conditions, as well as the amounts and specific financial statement line items affected by the transaction. The new guidance is effective for annual reporting periods beginning after December 15, 2021. The Company does not expect that the adoption of this standard will have a material impact on its consolidated financial statements; however, the Company expects to increase its disclosures with respect to government assistance beginning in the first quarter of fiscal year 2023.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nEstimates\nOur financial statements and accompanying notes are prepared in accordance with GAAP. Preparing financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, and expenses. These estimates and assumptions are affected by managements application of accounting policies. Actual results could differ from those estimates. Significant accounting policies for us include revenue recognition, accounting for capitalized software development costs, valuation of stock options, and accounting for income taxes.\nRevenue Recognition\nWe generate revenue primarily from the sale of software licenses and providing consulting services to the pharmaceutical industry for drug development.\nThe Company determines revenue recognition through the following steps:\ni.Identification of the contract, or contracts, with a customer\nii.Identification of the performance obligations in the contract\niii.Determination of the transaction price\niv.Allocation of the transaction price to the performance obligations in the contract\nv.Recognition of revenue when, or as, the Company satisfies a performance obligation\nThe Company accounts for a contract when it has approval and commitment from both parties, the rights of the parties are identified, payment terms are identified, the contract has commercial substance, and collectability of consideration is probable. Contracts generally have fixed pricing terms and are not subject to variable pricing. The Company considers the nature and significance of each specific performance obligation under a contract when allocating the proceeds under each contract. Accounting for contracts includes significant judgement in the estimation of estimated hours/cost to be incurred on consulting contracts, and the di minimis nature of the post-sales costs associated with software sales.\nCapitalized Computer Software Development Costs\nSoftware development costs are capitalized in accordance with ASC 985-20, Costs of Software to Be Sold, Leased, or Marketed. Capitalization of software development costs begins upon the establishment of technological feasibility and is discontinued when the product is available for sale.\nThe establishment of technological feasibility and the ongoing assessment for recoverability of capitalized computer software development costs require considerable judgment by management with respect to certain external factors including, but not limited to, technological feasibility, anticipated future gross revenues, estimated economic life, and changes in software and hardware technologies. Capitalized software development costs are comprised primarily of salaries and direct payroll-related costs and the purchase of existing software to be used in the Companys software products. Total capitalized computer software development costs were $3.2 million, $2.9 million, and $2.4 million for the fiscal years ending August 31, 2022, 2021, and 2020, respectively.\nAmortization of capitalized computer software development costs is calculated on a product-by-product basis on the straight-line method over the estimated economic life of the products, not to exceed five years. Amortization of software development costs amounted to $1.2 million, $1.4 million, and $1.2 million for the fiscal years ending August 31, 2022, 2021, and 2020, respectively. We expect future amortization expense to vary due to increases in capitalized computer software development costs.\nWe test capitalized computer software development costs for recoverability whenever events or changes in circumstances indicate that the carrying amount may not be recoverable.\nIntangible Assets and Goodwill\nThe Company performs valuations of assets acquired and liabilities assumed on each acquisition accounted for as a business combination and recognizes the assets acquired and liabilities assumed at their acquisition date fair value. Acquired intangible assets include customer relationships, software, trade name, and noncompete agreements. The Company determines the appropriate useful life by performing an analysis of expected cash flows based on historical experience of the acquired businesses. Intangible assets are amortized over their estimated useful lives using the straight-line method, which approximates the pattern in which the majority of the economic benefits are expected to be consumed.\nGoodwill represents the excess of the cost of an acquired entity over the fair value of the acquired net assets. Goodwill is not amortized, instead it is tested for impairment annually or when events or circumstances change that would indicate that goodwill might be impaired. Events or circumstances that could trigger an impairment review include, but are not limited to, a significant adverse change in legal factors or in the business climate, an adverse action or assessment by a regulator, unanticipated competition, a loss of key personnel, significant changes in the manner of the Company's use of the acquired assets or the strategy for the Company's overall business, significant negative industry or economic trends, or significant under-performance relative to expected historical or projected future results of operations.\nGoodwill is tested for impairment at the reporting unit level, which is one level below or the same as an operating segment. As of August 31, 2022, the Company determined that it had four reporting units, Simulations Plus, Cognigen, DILIsym, and Lixoft.\nAs of August 31, 2022, the entire balance of goodwill was attributed to three of the Company's reporting units, Cognigen, DILIsym, and Lixoft. Intangible assets subject to amortization are reviewed for impairment whenever events or circumstances indicate that the carrying amount of these assets may not be recoverable. The Company did not recognize any impairment charges during the periods ended August 31, 2022, 2021, or 2020.\nBusiness Acquisitions\nThe Company accounted for the acquisition of Cognigen, DILIsym, and Lixoft using the acquisition method of accounting where the assets acquired and liabilities assumed are recognized based on their respective estimated fair values. The excess of the purchase price over the estimated fair values of the net assets acquired is recorded as goodwill. Determining the fair value of certain acquired assets and liabilities is subjective in nature and often involves the use of significant estimates and assumptions, including, but not limited to, the selection of appropriate valuation methodology, projected revenue, expenses, and cash flows, weighted average cost of capital, discount rates, and estimates of terminal values. Business acquisitions are included in the Company's consolidated financial statements as of the date of the acquisition.\nResearch and Development Costs\nResearch and development costs are charged to expense as incurred until technological feasibility has been established, or when the costs are for maintenance and minor modification of existing software products that do not add significant new capabilities to the products. These costs include salaries, laboratory experiment, and purchased software that was developed by other companies and incorporated into, or used in the development of, our final products.\nIncome Taxes\nThe Company accounts for income taxes in accordance with ASC 740-10, Income Taxes, which requires the recognition of deferred tax assets and liabilities for expected future tax consequences of events that have been included in the financial statements or tax returns.\nUnder this method, deferred income taxes are recognized for the tax consequences in future years of differences between the tax bases of assets and liabilities and their financial reporting amounts at each year end based on enacted tax laws and statutory tax rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized. The provision for income taxes represents the tax payable for the period and the change during the period in deferred tax assets and liabilities.\nStock-Based Compensation\nThe Company accounts for stock options in accordance with ASC 718-10, Compensation-Stock Compensation. Under this method, compensation costs include the estimated grant-date fair value of awards amortized over the options vesting period. Stock-based compensation expense, not including shares issued to Directors for services, was $2.7 million, $2.4 million and $1.3 million for the years ended August 31, 2022, 2021, and 2020, respectively, and is included in the statements of operations as Consulting, Salaries, and Research and Development expense. ITEM 7A - QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs of August 31, 2022, and August 31, 2021, we had cash and cash equivalents of $51.6 million and $37.0 million, respectively. We hold held-to-maturity short-term investments that are exposed to market risk related to changes in interest rates, which could affect the value of our assets and liabilities. We do not hold any trading and/or available-for-sale securities. Some of our cash and cash equivalents are held in money market accounts; however, they are not exposed to market-rate risk.\nIn the years ended August 31, 2022, 2021, and 2020, we sold $6.7 million, $4.8 million, and $5.0 million, respectively, of software licenses through representatives in certain Asian markets in local currencies. As a result, our financial position, results of operations, and cash flows can be affected by fluctuations in foreign currency exchange rates, particularly fluctuations in the Yen and RMB exchange rates. These transactions give rise to receivables that are denominated in currencies other than the entitys functional currency. The value of these receivables is subject to changes because the receivables may become worth more or less due to changes in currency exchange rates. The majority of our software license agreements are denominated in U.S. dollars. We mitigate our risk from foreign currency fluctuations by adjusting prices in our foreign markets on a periodic basis. We base these changes on market conditions while working closely with our representatives. Our Paris, France, division sells mainly in U.S. dollars and Euros and uses the Euro as a functional currency. As such, we are subject to currency translation and exchange rate changes. We do not hedge currencies or enter into derivative contracts. ITEM 8 - FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nSee the financial statements included elsewhere in this Report beginning at page, which are incorporated herein by reference. ITEM 9 - CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A - CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur Chief Executive Officer and our Chief Financial Officer, after evaluating our disclosure controls and procedures (as defined in the Exchange Act Rules 13a-15(e) and 15d-15(e) as of the end of the period covered by this Report (the Evaluation Date), have concluded that as of the Evaluation Date, our disclosure controls and procedures are effective to ensure that information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in Securities and Exchange Commission rules and forms, and to ensure that information required to be disclosed by us in such reports is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, where appropriate, to allow timely decisions regarding required disclosure.\nManagement Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of consolidated financial statements for external purposes in accordance with U.S. GAAP. Management assessed our internal control over financial reporting as of August 31, 2022, the end of our fiscal year. Management based its assessment on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework). Managements assessment included evaluation of elements such as the design and operating effectiveness of key financial reporting controls, process documentation, accounting policies, and our overall control environment.\nBased on this assessment, management has concluded that our internal control over financial reporting was effective as of the end of the fiscal year to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external reporting purposes in accordance with U.S. GAAP. We reviewed the results of managements assessment with the Audit Committee of our Board of Directors.\nInherent Limitations on Effectiveness of Controls\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all errors and all fraud. A control system, no matter how well-designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. The design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Further, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, have been detected. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of the effectiveness of controls to future periods are subject to risks. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures.\nChanges in Internal Control over Financial Reporting\nNo change in the Companys internal controls over financial reporting (as defined in Rule 13a-15(f) and 15d-15(f) of the Exchange Act) occurred during the Companys most recent fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B - OTHER INFORMATION\nNone.\nITEM 9C - DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10 - DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nInformation required by Item 10 is incorporated herein by reference from the Companys definitive proxy statement, to be filed with the Securities and Exchange Commission within 120 days after the end of the fiscal year covered by this Report.\nWe have adopted the Corporate Code of Business Conduct and Ethics (the \"code of ethics\") that applies to each of our directors and employees, including our principal executive officer, principal financial officer, controller, and all other employees performing similar functions. The code of ethics is publicly available on our website at https://www.simulations-plus.com/wp-content/uploads/Code-of-Ethics-11-12-2020.pdf. If we make any substantive amendments to the code of ethics or grant any waiver, including any implicit waiver, from a provision of the code of ethics, we will disclose the nature of the amendment or waiver on that website or in a Current Report on Form 8-K. ITEM 11 - EXECUTIVE COMPENSATION\nThe information required by Item 11 is incorporated herein by reference from the Companys definitive proxy statement, to be filed with the Securities and Exchange Commission within 120 days after the end of the fiscal year covered by this Annual Report. ITEM 12 - SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item pursuant to Item 201(d) of Regulation S-K is set forth under the caption Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities in Part II, Item 5 of this Report, and is incorporated herein by reference.\nThe information required by this Item 12 pursuant to Item 403 of Regulation S-K is incorporated herein by reference from the Companys definitive proxy statement, to be filed with the Securities and Exchange Commission within 120 days after the end of the fiscal year covered by this Report. ITEM 13 - CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item 13 is incorporated herein by reference from the Company's definitive proxy statement to be filed with the Securities and Exchange Commission within 120 days after the end of the fiscal year covered by this Report and is incorporated herein by reference. ITEM 14 - PRINCIPAL ACCOUNTING FEES AND SERVICES\nOur independent registered public accounting firm is Rose, Snyder & Jacobs LLP, Encino, CA, Auditor Firm ID: 468.\nThe information required by Item 14 is incorporated by reference from the Companys definitive proxy statement, to be filed with the Securities and Exchange Commission within 120 days after the end of the fiscal year covered by this Report.\nPART IV ITEM 15 - EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)\n(1)Financial Statements. The consolidated financial statements are included in this Annual Report on Form 10-K beginning on page.\n(2)Financial Statement Schedules. All financial statement schedules have been omitted since the information is either not applicable or required or was included in the financial statements or notes included in this Annual Report on Form 10-K.\n(3)List of Exhibits required by Item 601 of Regulation S-K. See part (b) below.\n(b)Exhibits. The following exhibits are filed or furnished with this report. Those exhibits marked with a () refer to management contracts or compensatory plans or arrangements.\nEXHIBIT NUMBER DESCRIPTION\n2.1 (4)^ Agreement and Plan of Merger, dated July 23, 2014, by and among the Company, Cognigen Corporation and the other parties thereto.\n2.2 (12)^ Share Purchase and Contribution Agreement, dated March 31, 2020.\n3.1 (2) Articles of Incorporation of the Company.\n3.2 (2) Amended and Restated Bylaws of the Company.\n3.3 (15) Certificate of Amendment to the Amended and Restated Bylaws of Simulations Plus, Inc.\n4.1 (1) Form of Common Stock Certificate.\n4.2 (1) Share Exchange Agreement.\n4.3(13) Revolving Line of Credit Note, dated as of March 31, 2020, by and between the Company, as borrower, and Wells Fargo Bank, National Association, as lender.\n4.4(13) Credit Agreement, dated as of March 31, 2020, by and between the Company, as borrower, and Wells Fargo Bank, National Association, as lender.\n10.1 (3)() The Companys 2007 Stock Option Plan, as amended.\n10.2 (10) Second Amendment to Lease by and between the Company and Crest Development LLC, dated as of May 1, 2016.\n10.3 (5) Form of Indemnification Agreement.\n10.4 (7) 2017 Equity Incentive Plan.\n10.5 (6) Stock Purchase Agreement by and among Simulation Plus, Inc., DILIsym Services, Inc., The Shareholders Representative and The Shareholders of DILIsym Services, Inc., dated as of May 1, 2017.\n10.6 (11)() Employment Agreement by and between the Company and Shawn OConnor dated September 3, 2020.\n10.7 (14)() Employment Agreement by and between the Company and Will Frederick, dated December 1, 2020.\n10.8 (15)() Separation Agreement, dated December 1, 2020, by and between the Company and John Kneisel.\n10.9 (13) Third Amendment to Lease by and between the Company and Crest Development LLC, dated as of December 28, 2020.\n10.10 (16)() Simulation Plus, Inc. 2021 Equity Incentive Plan.\n10.11 (17)() First Amendment to Employment Agreement, by and between Simulations Plus, Inc. and Shawn OConnor, dated November 19, 2021.\n10.12()* Employment Agreement by and between the Company and John DiBella, dated January 1, 2022.\n10.13()* Employment Agreement by and between the Company and Brett Howell, dated January 1, 2022.\n10.14()* Employment Agreement by and between the Company and Jill Fiedler-Kelly, dated January 1, 2022.\n21.1 * List of Subsidiaries.\n23.1 * Consent of Independent Registered Public Accounting Firm.\n31.1 * Section 302 - Certification of the Principal Executive Officer.\n31.2 * Section 302 - Certification of the Principal Financial Officer.\n32.1 * Section 906 - Certification of the Chief Executive Office and Chief Financial Officer.\n101.INS** Inline XBRL Instance Document\n101.SCH** Inline XBRL Taxonomy Extension Schema Document\n101.CAL** Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF** Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB** Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE** Inline XBRL Taxonomy Extension Presentation Linkbase Document\n_____________________________\n^ Schedules and exhibits omitted pursuant to Item 601(b)(2) of Registration S-K. The registrant agrees to furnish supplementally a copy of any omitted schedule to the SEC upon request.\n* Filed herewith.\n** The XBRL related information in Exhibit 101 shall not be deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to liability of that section and shall not be incorporated by reference into any filing or other document pursuant to the Securities Act of 1933, as amended, except as shall be expressly set forth by specific reference in such filing or document.\n() Refers to management contracts or compensatory plans or arrangements\n(1) Incorporated by reference to the Companys Registration Statement on Form SB-2 (Registration No. 333-6680) filed on March 25, 1997.\n(2) Incorporated by reference to an exhibit to the Companys Form 10-K for the fiscal year ended August 31, 2010.\n(3) Incorporated by reference to an exhibit to the Companys Form 10-Q filed April 9, 2014.\n(4) Incorporated by reference to an exhibit to the Companys Form 8-K/A filed November 18, 2014.\n(5) Incorporated by reference to an exhibit to the Companys Form 8-K filed August 10, 2016.\n(6) Incorporated by reference to an exhibit to the Companys Form 10-Q filed July 10, 2017.\n(7) Incorporated by reference to Appendix A to the Companys Schedule 14A filed December 29. 2016.\n(8) Incorporated by reference to an exhibit to the Companys Form 10-K for the fiscal year ended August 31, 2016.\n(9) Incorporated by reference to an exhibit to the Companys Form 8-K filed April 2, 2020.\n(10) Incorporated by reference to an exhibit to the Companys Form 8-K filed April 3, 2020.\n(11) Incorporated by reference to an exhibit to the Companys Form 8-K filed September 9, 2020.\n(12) Incorporated by reference to Appendix A to the Companys Definitive Schedule 14A filed December 31, 2018.\n(13) Incorporated by reference to an exhibit to the Companys Form 8-K filed January 4, 2021.\n(14) Incorporated by reference to an exhibit to the Companys Form 10-Q filed January 11, 2021.\n(15) Incorporated by reference to an exhibit to the Companys Form 10-Q filed April 14, 2021.\n(16) Incorporated by reference to an exhibit to the Companys Form 8-K filed June 8, 2021.\n(17) Incorporated by reference to an exhibit to the Companys Form 8-K filed November 19, 2021.\n(c)Financial Statement Schedule.\nSee Item 15(a)(2) above.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOctober 28, 2022\nSIMULATIONS PLUS, INC.\nBy: /s/ Will Frederick\nWill Fredrick\nChief Financial Officer (Principal financial officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title\n/s/ Shawn OConnor Chief Executive Officer (Principal executive officer)\nShawn OConnor\nOctober 28, 2022\n/s/ Walter S. Woltosz Chairman of the Board of Directors\nWalter S. Woltosz\nOctober 28, 2022\n/s/ Dr. Lisa LaVange Director\nDr. Lisa LaVange\nOctober 28, 2022\n/s/ Dr. Daniel Weiner Director\nDr. Daniel Weiner\nOctober 28, 2022\n/s/ Sharlene Evans Director\nSharlene Evans\nOctober 28, 2022\n/s/ Dr. John K. Paglia Director\nDr. John K. Paglia\nOctober 28, 2022\n/s/ Will Frederick Chief Financial Officer (Principal financial\nofficer and principal accounting officer)\nWill Frederick\nOctober 28, 2022\nSIMULATIONS PLUS, INC. & SUBSIDIARIES\nCONTENTS\nAugust 31, 2022, 2021 and 2020\nPage\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n-\nFINANCIAL STATEMENTS\nConsolidated Balance Sheets\nConsolidated Statements of Operations and Comprehensive Income\nConsolidated Statements of Shareholders Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\n-\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Simulations Plus, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Simulations Plus, Inc. and Subsidiaries (the Company) as of August 31, 2022, and 2021, and the related consolidated statements of operations and comprehensive income, stockholders equity, and cash flows for each of the years in the three-year period ended August 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022, and 2021, and the results of its operations and its cash flows for each of the years in the three-year period ended August 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO), and our report dated October 28, 2022, expressed an unqualified opinion.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition - Contract cost estimates\nDescription of the Matter\nAs discussed in Note 2 to the Consolidated Financial Statements, the Company earns a portion of its revenue through consulting service agreements. For performance obligations related to services that are required to be recognized over time, the Company generally measures its progress to completion using an input measure of total labor costs incurred divided by total labor costs expected to be incurred.\nAuditing revenue recognition is complex and highly judgmental due to the variability and uncertainty associated with the Companys assessment of measure of progress. Changes in these estimates would have a significant effect on the amount of revenue recognized.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of controls that address the risk of material misstatement of consulting services revenue including those associated with cost to complete estimates. We tested controls over managements process to collect, review, and approve the data used in assessing revenue recognized over time.\nTo test the measures of progress used for performance obligations related to services that are required to be recognized over time, our audit procedures included, among others, evaluating the appropriateness of the Companys accounting policy for each type of arrangement, testing the identified measure of performance by reading contracts with customers, including all amendments, and reviewing the contract analyses prepared by management. We evaluated whether the selected measures of progress towards satisfaction of performance obligations were applied consistently. We also tested the completeness and accuracy of the underlying data used for the measure of progress by testing the underlying cost data.\nRose, Snyder & Jacobs LLP\nWe have served as the Companys auditor since 2004.\nEncino, California\nOctober 28, 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Simulations Plus, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Simulations Plus, Inc. and Subsidiaries (the Companys) internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control-Integrated Framework (2013) issued by COSO.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheet as of August 31, 2022, and the related consolidated statements of operations and comprehensive income, stockholders equity, and cash flows for each of the three years in the period ended August 31, 2022, and related notes, and our report dated October 28, 2022, expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nRose, Snyder & Jacobs LLP\nEncino, CA\nOctober 28, 2022\nSIMULATIONS PLUS, INC.\nCONSOLIDATED BALANCE SHEETS\nAugust 31,\n(in thousands, except share and per share amounts) 2022 2021\nASSETS\nCurrent assets\nCash and cash equivalents $ 51,567 $ 36,984\nAccounts receivable, net of allowance for doubtful accounts of $12 and $78\n13,787 9,851\nPrepaid income taxes 1,391 1,012\nPrepaid expenses and other current assets 3,377 4,846\nShort-term investments 76,668 86,620\nTotal current assets 146,790 139,313\nLong-term assets\nCapitalized computer software development costs, net of accumulated amortization of $15,672 and $14,438\n9,563 7,646\nProperty and equipment, net 632 1,838\nOperating lease right-of-use assets 1,420 1,276\nIntellectual property, net of accumulated amortization of $7,928 and $6,516\n9,057 10,469\nOther intangible assets, net of accumulated amortization of $2,662 and $2,186\n7,560 6,464\nGoodwill 12,921 12,921\nOther assets 439 51\nTotal assets $ 188,382 $ 179,978\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities\nAccounts payable $ 225 $ 387\nAccrued compensation 3,254 3,185\nAccrued expenses 931 2,419\nContracts payable - 4,550\nOperating lease liability - current portion 461 382\nDeferred revenue 2,864 651\nTotal current liabilities 7,735 11,574\nLong-term liabilities\nDeferred income taxes, net 1,456 1,726\nOperating lease liability 943 896\nTotal liabilities 10,134 14,196\nCommitments and contingencies - -\nShareholders' equity\nPreferred stock, $0.001 par value 10,000,000 shares authorized, no shares issued and outstanding\n$ - $ -\nCommon stock, $0.001 par value and additional paid-in capital -50,000,000 shares authorized; 20,260,070 and 20,141,521 shares issued and outstanding\n138,512 133,418\nRetained earnings 40,044 32,407\nAccumulated other comprehensive loss (308) (43)\nTotal shareholders' equity 178,248 165,782\nTotal liabilities and shareholders' equity $ 188,382 $ 179,978\nThe accompanying notes are an integral part of these consolidated financial statements.\nSIMULATIONS PLUS, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME\nYears Ended August 31,\n(in thousands, except per common share amounts) 2022 2021 2020\nRevenues\nSoftware $ 32,642 $ 27,670 $ 21,587\nServices 21,264 18,796 20,002\nTotal revenues 53,906 46,466 41,589\nCost of revenues\nSoftware 3,060 3,235 2,883\nServices 7,762 7,365 7,766\nTotal cost of revenues 10,822 10,600 10,649\nGross profit 43,084 35,866 30,940\nOperating expenses\nResearch and development 3,208 4,047 2,975\nSelling, general, and administrative 24,965 20,566 16,360\nTotal operating expenses 28,173 24,613 19,335\nIncome from operations 14,911 11,253 11,605\nOther income (expense), net 204 (168) (218)\nIncome before income taxes 15,115 11,085 11,387\nProvision for income taxes (2,632) (1,303) (2,055)\nNet Income $ 12,483 $ 9,782 $ 9,332\nEarnings per share\nBasic $ 0.62 $ 0.49 $ 0.52\nDiluted $ 0.60 $ 0.47 $ 0.50\nWeighted-average common shares outstanding\nBasic 20,196 20,045 17,819\nDiluted 20,749 20,743 18,538\nOther comprehensive (loss) income, net of tax\nForeign currency translation adjustments (265) (101) 58\nComprehensive income $ 12,218 $ 9,681 $ 9,390\nThe accompanying notes are an integral part of these consolidated financial statements.\nSIMULATIONS PLUS, INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\nYear ended August 31,\n(in thousands, except per common share amounts) 2022 2021 2020\nCommon stock and additional paid in capital\nBalance, beginning of period $ 133,418 $ 128,541 $ 15,327\nExercise of stock options 891 1,461 630\nStock-based compensation 2,686 2,405 1,287\nShares issued to Directors for services 351 345 290\nShares issued - Lixoft 1,166 666 3,260\nCommon stock issued for cash, net - - 107,747\nBalance, end of period 138,512 133,418 128,541\nRetained earnings\nBalance, beginning of period 32,407 27,436 22,354\nDeclaration of dividends (4,846) (4,811) (4,250)\nNet income 12,483 9,782 9,332\nBalance, end of period 40,044 32,407 27,436\nAccumulated other comprehensive (loss) income\nBalance, beginning of period (43) 58 -\nOther comprehensive (loss) income (265) (101) 58\nBalance, end of period (308) (43) 58\nTotal shareholders equity $ 178,248 $ 165,782 $ 156,035\nCash dividends declared per common share $ 0.24 $ 0.24 $ 0.24\nThe accompanying notes are an integral part of these consolidated financial statements.\nSIMULATIONS PLUS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear ended August 31,\n(in thousands) 2022 2021 2020\nCash flows from operating activities\nNet income $ 12,483 $ 9,782 $ 9,332\nAdjustments to reconcile net income to net cash provided by operating activities\nDepreciation and amortization 3,574 3,590 2,962\nChange in value of contingent consideration 283 486 203\nAmortization of investment premiums 1,678 2,350 -\nStock-based compensation 3,037 2,750 1,577\nDeferred income taxes (270) (628) (378)\nCurrency translation adjustments (265) (101) -\n(Increase) decrease in\nAccounts receivable (3,936) (2,429) (2,018)\nPrepaid income taxes (379) (42) (12)\nPrepaid expenses and other assets 1,081 (157) (259)\nIncrease (decrease) in\nAccounts payable (162) 39 221\nOther liabilities (1,437) 3,353 23\nDeferred revenue 2,213 210 (739)\nNet cash provided by operating activities 17,900 19,203 10,912\nCash flows from investing activities\nPurchases of property and equipment (819) (1,627) (231)\nPurchase of short-term investments (100,846) (122,395) (67,249)\nProceeds from sale of short-term investments 109,121 100,229 -\nCash used to acquire subsidiaries - - (9,471)\nCash received in acquisition - - 3,799\nCapitalized computer software development costs (3,151) (2,949) (2,353)\nNet cash provided by (used in) investing activities 4,305 (26,742) (75,505)\nCash flows from financing activities\nPayment of dividends (4,846) (4,811) (4,250)\nPayments on contracts payable (3,667) (1,334) (1,761)\nProceeds from the exercise of stock options 891 1,461 630\nProceeds from follow-on public offering, net - - 107,747\nNet cash (used in) provided by financing activities (7,622) (4,684) 102,366\nNet increase (decrease) in cash and cash equivalents 14,583 (12,223) 37,773\nCash and cash equivalents, beginning of year $ 36,984 $ 49,207 $ 11,434\nCash and cash equivalents, end of period $ 51,567 $ 36,984 $ 49,207\nSupplemental disclosures of cash flow information\nIncome taxes paid $ 3,233 $ 1,857 $ 2,353\nNon-Cash Investing and Financing Activities\nStock issued for acquisition of Lixoft $ 1,166 $ 666 $ 3,261\nCreation of contract liabilities for acquisition of subsidiaries $ - $ - $ 4,528\nRight of use assets capitalized $ 624 $ 905 $ 1,499\nThe accompanying notes are an integral part of these consolidated financial statements.\nSimulations Plus, Inc.\nNotes to Consolidated Financial Statements\nFor the Year Ended August 31, 2022\nNOTE 1 - ORGANIZATION AND LINES OF BUSINESS\nOrganization\nSimulations Plus, Inc. (the \"Company\") was incorporated on July 17, 1996. In September 2014, Simulations Plus acquired all of the outstanding equity interests of Cognigen Corporation (\"Cognigen\") and Cognigen became a wholly-owned subsidiary of Simulations Plus, Inc. In June 2017, Simulations Plus acquired DILIsym Services, Inc. (\"DILIsym\") as a wholly-owned subsidiary. In April 2020, Simulations Plus, Inc. acquired Lixoft, a French société par actions simplifiée (\"Lixoft\") as a wholly-owned subsidiary pursuant to a stock purchase and contribution agreement. (Collectively, \"Company\", \"we\", \"us\", \"our\").\nEffective September 1, 2021, the Company merged both Cognigen Corporation and DILIsym with and into Simulations Plus, Inc. through short-form mergers (the Mergers). To effectuate the Mergers, the Company filed Certificates of Ownership with the Secretaries of State of the states of Delaware (Cognigens and DILIsyms state of incorporation) and California (the Companys state of incorporation). Consummation of the Mergers was not subject to approval of the Companys stockholders and did not impact the rights of the Companys stockholders.\nLines of Business\nWe are a premier developer of drug discovery and development software for modeling and simulation, and for the prediction of molecular properties utilizing both artificial intelligence (AI) as well as machine-learning-based technology. We also provide consulting services ranging from early drug discovery through preclinical and clinical trial data analysis and for submissions to regulatory agencies. Our software and consulting services are provided to major pharmaceutical, biotechnology, agrochemical, cosmetics, and food industry companies, and to regulatory agencies worldwide for use in the conduct of industry-based research.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of Simulations Plus and, as of April 1, 2020, Lixoft. All significant intercompany accounts and transactions are eliminated in consolidation.\nUse of Estimates\nOur financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States of America. Preparing financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, and expenses. These estimates and assumptions are affected by managements application of accounting policies. Actual results could differ from those estimates.\nReclassifications\nCertain numbers in the prior year have been reclassified to conform to the current year's presentation.\nRevenue Recognition\nWe generate revenue primarily from the sale of software licenses and by providing consulting services to the pharmaceutical industry for drug development.\nIn accordance with ASC 606, we determine revenue recognition through the following steps:\ni.Identification of the contract, or contracts, with a customer\nii.Identification of the performance obligations in the contract\niii.Determination of the transaction price\niv.Allocation of the transaction price to the performance obligations in the contract\nv.Recognition of revenue when, or as, we satisfy a performance obligation\nComponents of Revenue\nThe following is a description of principal activities from which the Company generates revenue. As part of the accounting for these arrangements, the Company must develop assumptions that require judgment to determine the stand-alone selling price for each performance obligation identified in the contract. Stand-alone selling prices are determined based on the prices at which the Company separately sells its services or goods.\nRevenue Components Typical Payment Terms\nSoftware Revenues:\nSoftware revenues are generated primarily from sales of software licenses at the time the software is unlocked, and the term commences. The license period typically is one year or less. Along with the license a di minimis amount of customer support is provided to assist the customer with the software. Should the customer need more than a di minimis amount of support, they can choose to enter into a separate contract for additional training. Most software is installed on our customers servers and the Company has no control of the software once the sale is made.\nPayments are generally due upon invoicing on a net 30 basis unless other payment terms are negotiated with the customer based on customer history. Typical industry standards apply.\nFor certain software arrangements the Company hosts the licenses on servers maintained by the Company, Revenue for those arrangements is accounted as Software as a Service over the life of the contract. These arrangements are a small portion of software revenues of the Company.\nConsulting Contracts:\nConsulting services provided to our customers are generally recognized over time as the contracts are performed and the services are rendered. The company measures its consulting revenue based on time expended compared to total estimated hours to complete a project. The Company believes the method chosen for its contract revenue best depicts the transfer of benefits to the customer under the contracts. Payment terms vary, depending on the size of the contract, credit history and history with the client and deliverables within the contract.\nConsortium Member Based Services:\nThe performance obligation is recognized on a time elapsed basis, by month, for which the services are provided, as the Company transfers control evenly over the contractual period. Payment is due at the beginning of the period, generally on a net 30 or 60 basis.\nRemaining Performance Obligations\nTransaction price allocated to remaining performance obligations represents contracted revenue that has not yet been recognized, which includes deferred revenue and unbilled amounts that will be recognized as revenue in future periods. As of August 31, 2022, remaining performance obligations were $13.5 million. 86% of the remaining performance obligations are expected to be recognized over the next 12 months, with the remainder recognized thereafter. Remaining performance obligations estimates are subject to change and are affected by several factors, including contract terminations and changes in the scope of contracts.\nDisaggregation of Revenues\nThe components of disaggregation of revenue for the years ended August 31, 2022, 2021, and 2020 were as follows:\nYear ended August 31,\n(in thousands) 2022 2021 2020\nSoftware licenses\nPoint in time $ 31,587 $ 26,725 $ 20,668\nOver time 1,055 945 919\nServices\nOver time 21,264 18,796 20,002\nTotal revenue $ 53,906 $ 46,466 $ 41,589\nIn addition, the Company allocates revenues to geographic areas based on the locations of its customers. Geographical revenues for the years ended August 31, 2022, 2021, and 2020 were as follows:\n(in thousands) Year ended August 31,\n2022 2021 2020\n$ % of total $ % of total $ % of total\nAmericas $ 37,681 70 % $ 32,549 70 % $ 29,674 71 %\nEMEA 10,388 19 % 7,906 17 % 5,827 14 %\nAsia Pacific 5,837 11 % 6,011 13 % 6,088 15 %\nTotal $ 53,906 100 % $ 46,466 100 % $ 41,589 100 %\nContract Balances\nWe receive payments from customers based upon contractual billing schedules, while we recognize revenue when, or as, we satisfy our performance obligations. This timing difference results in accounts receivable, contract assets, and contract liabilities. We record accounts receivable when the right to consideration becomes unconditional. We record a contract asset if the right to consideration is conditioned on something other than the passage of time, such as our future performance. Contract assets are included in prepaid expenses and other current assets on our consolidated balance sheets. We record a contract liability when we have an obligation to transfer goods or services to a customer for which we have either received consideration or a payment is due from a customer. We refer to contract liabilities as deferred revenue on our consolidated balance sheets.\nContract asset balances as of August 31, 2022, and August 31, 2021, were $1.7 million and $3.2 million, respectively.\nDuring the year ended August 31, 2022, the Company recognized $0.6 million of revenue that was included in contract liabilities as of August 31, 2021, and during the year ended August 31, 2021, the Company recognized $0.4 million of revenue that was included in contract liabilities as of August 31, 2020.\nDeferred Commissions\nSales commissions earned by our sales force and our commissioned sales representatives are considered incremental and recoverable costs of obtaining a contract with a customer. We apply the practical expedient as described in ASC 340-40-25-4 to expense costs as incurred for sales commissions, since the amortization period of the asset that we otherwise would have recognized is one year or less. This expense is included in the consolidated statements of operations and comprehensive income as selling, general, and administrative expense.\nCash and Cash Equivalents\nFor purposes of the statements of cash flows, we consider all highly liquid investments purchased with original maturities of three months or less to be cash equivalents.\nAccounts Receivable and Allowance for Credit Losses\nThe Company extends credit to its customers in the normal course of business. The Company evaluates its allowance for credit losses based on its estimate of the collectability of its trade accounts receivable. As part of this assessment, the Company considers various factors including the financial condition of the individual companies with which it does business, the aging of receivable balances, historical experience, changes in customer payment terms, current market conditions, and reasonable and supportable forecasts of future economic conditions. In times of economic turmoil, the Companys estimates and judgments with respect to the collectability of its receivables is subject to greater uncertainty than in more stable periods. Accounts receivable balances will be charged off against the allowance for credit losses after all means of collection have been exhausted and the potential for recovery is considered remote.\nInvestments\nThe Company may invest excess cash balances in short-term and long-term marketable debt securities. Investments may consist of certificates of deposit, money market accounts, government-sponsored enterprise securities, corporate bonds, and/or commercial paper within the parameters of our Investment Policy and Guidelines. The Company accounts for its investments in marketable securities in accordance with ASC 320, Investments - Debt and Equity Securities. This statement requires debt securities to be classified into three categories:\nHeld-to-maturity-Debt securities that the entity has the positive intent and ability to hold to maturity are measured at amortized cost and are presented at the net amount expected to be collected. Any change in the allowance for credit losses during the period is reflected in earnings. Discounts and premiums to par value of the debt securities are amortized to interest income/expense over the term of the security.\nTrading Securities-Debt securities that are bought and held primarily for the purpose of selling in the near term are reported at fair value, with unrealized gains and losses included in earnings.\nAvailable-for-Sale-Debt securities not classified as either securities held-to-maturity or trading securities are reported at fair value. For available-for-sale debt securities in an unrealized loss position, we evaluate as of the balance sheet date whether the unrealized losses are attributable to a credit loss or other factors. The portion of unrealized losses related to a credit loss is recognized in earnings, and the portion of unrealized loss not related to a credit loss is recognized in other comprehensive income.\nWe classify our investments in marketable debt securities based on the facts and circumstances present at the time of purchase of the securities. We subsequently reassess the appropriateness of that classification at each reporting date. During the year ended August 31, 2022, all of our investments were classified as held-to-maturity.\nCapitalized Computer Software Development Costs\nSoftware development costs are capitalized in accordance with ASC 985-20. Capitalization of software development costs begins upon the establishment of technological feasibility and is discontinued when the product is available for sale.\nThe establishment of technological feasibility and the ongoing assessment for recoverability of capitalized software development costs require considerable judgment by management with respect to certain external factors including, but not limited to, technological feasibility, anticipated future gross revenue, estimated economic life, and changes in software and hardware technologies. Capitalized software development costs are comprised primarily of salaries and direct payroll-related costs and the purchase of existing software to be used in our software products.\nAmortization of capitalized software development costs is calculated on a product-by-product basis on the straight-line method over the estimated economic life of the products (not to exceed five years). Amortization of software development costs amounted to $1.2 million, $1.4 million, and $1.2 million for the years ended August 31, 2022, 2021, and 2020, respectively. We expect future amortization expense to vary due to increases in capitalized computer software development costs.\nWe test capitalized computer software development costs for recoverability whenever events or changes in circumstances indicate that the carrying amount may not be recoverable.\nProperty and Equipment\nProperty and equipment are recorded at cost, or fair market value for property and equipment acquired in business combinations, less accumulated depreciation and amortization. Depreciation and amortization are calculated using the straight-line method over the estimated useful lives as follows:\nEquipment 5 years\nComputer equipment 3 to 7 years\nFurniture and fixtures 5 to 7 years\nLeasehold improvements Shorter of life of asset or lease\nMaintenance and minor replacements are charged to expense as incurred. Gains and losses on disposals are included in the results of operations.\nInternal-use Software\nWe have capitalized certain internal-use software costs in accordance with ASC 350-40, which are included in intangible assets. The amortization of such costs is classified as selling, general, and administrative expenses on the consolidated statements of operations. Maintenance of and minor upgrades to internal-use software are also classified as selling, general, and administrative expenses as incurred.\nLeases\nWe determine if an arrangement is a lease at inception. Operating leases are included in operating lease right-of-use (ROU) assets and operating lease liabilities (current and long-term) in our consolidated balance sheets.\nROU assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at the commencement date based on the present value of lease payments over the lease term. As most of our leases do not provide an implicit rate, we generally use our incremental borrowing rate based on the estimated rate of interest for collateralized borrowing over a similar term of the lease payments at the commencement date. The operating lease ROU asset also includes any lease payments made at or before the commencement date and excludes lease incentives. Our lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option. Lease expense is recognized on a straight-line basis over the lease term.\nSupplemental balance sheet information related to operating leases was as follows as of August 31, 2022:\n(in thousands)\nRight of use assets $ 1,420\nLease liabilities, current $ 461\nLease liabilities, long-term $ 943\nOperating lease costs $ 520\nWeighted-average remaining lease term 3.05 years\nWeighted-average discount rate 3.41 %\nIntangible Assets and Goodwill\nWe perform valuations of assets acquired and liabilities assumed on each acquisition accounted for as a business combination and recognize the assets acquired and liabilities assumed at their acquisition-date fair value. Acquired intangible assets include customer relationships, software, trade names, and noncompete agreements. We determine the appropriate useful life by performing an analysis of expected cash flows based on historical experience of the acquired businesses. Finite-lived intangible assets are amortized over their estimated useful lives using the straight-line method, which approximates the pattern in which the majority of the economic benefits are expected to be consumed. Finite-lived intangible assets subject to amortization are reviewed for impairment whenever events or circumstances indicate that the carrying amount of these assets may not be recoverable.\nGoodwill represents the excess of the cost of an acquired entity over the fair value of the acquired net assets. Goodwill and indefinite-lived intangible assets are tested for impairment annually or when events or circumstances change that would indicate that they might be impaired. Events or circumstances that could trigger an impairment review include, but are not limited to, a significant adverse change in legal factors or in the business climate, an adverse action or assessment by a regulator, unanticipated competition, a loss of key personnel, significant changes in the manner of our use of the acquired assets or the strategy for our overall business, significant negative industry or economic trends, or significant underperformance relative to expected historical or projected future results of operations.\nGoodwill and intangible assets are tested for impairment at the reporting unit level, which is one level below or the same as an operating segment. As of August 31, 2022, we determined that we have four reporting units: Simulations Plus, Cognigen, DILIsym, and Lixoft. We did not recognize any impairment charges during the periods ended August 31, 2022, 2021, and 2020.\nReconciliation of Goodwill as of August 31, 2022, and 2021:\n(in thousands) Cognigen DILIsym Lixoft Total\nBalance, August 31, 2020 $ 4,789 $ 5,598 $ 2,534 $ 12,921\nAddition - - - -\nImpairments - - - -\nBalance, August 31, 2021 4,789 5,598 2,534 12,921\nAddition - - - -\nImpairments - - - -\nBalance, August 31, 2022 $ 4,789 $ 5,598 $ 2,534 $ 12,921\nThe following table summarizes other intangible assets as of August 31, 2022:\n(in thousands) Amortization\nPeriod Acquisition\nValue Accumulated\nAmortization Net book\nvalue\nSimulations Plus\nERP Straight line 15 years $ 1,702 $ 80 $ 1,622\nCognigen\nCustomer relationships Straight line 8 years 1,100 1,100 -\nTrade Name None 500 - 500\nDILIsym\nCustomer relationships Straight line 10 years 1,900 997 903\nTrade Name None 860 - 860\nLixoft\nCustomer relationships Straight line 14 years 2,550 437 2,113\nTrade Name None 1,550 - 1,550\nCovenants not to compete Straight line 3 years 60 48 12\n$ 10,222 $ 2,662 $ 7,560\nThe following table summarizes other intangible assets as of August 31, 2021:\n(in thousands) Amortization\nPeriod Acquisition\nValue Accumulated\nAmortization Net book\nvalue\nCognigen\nCustomer relationships Straight line 8 years $ 1,100 $ 963 $ 137\nTrade Name None 500 - 500\nCovenants not to compete Straight line 5 years 50 50 -\nDILIsym\nCustomer relationships Straight line 10 years 1,900 807 1,093\nTrade Name None 860 - 860\nCovenants not to compete Straight line 4 years 80 80 -\nLixoft\nCustomer relationships Straight line 14 years 2,550 258 2,292\nTrade Name None 1,550 - 1,550\nCovenants not to compete Straight line 3 years 60 28 32\n$ 8,650 $ 2,186 $ 6,464\nTotal amortization expense for the years ended August 31, 2022, 2021, and 2020 was $0.6 million, $0.5 million, and $0.4 million, respectively.\nFuture amortization of finite-lived intangible assets for the next five years is as follows:\n(in thousands)\nYear ending\nAugust 31,\nAmount\n2023 $ 493\n2024 $ 481\n2025 $ 481\n2026 $ 481\n2027 $ 434\nBusiness Acquisitions\nThe Company accounted for the acquisition of Lixoft using the acquisition method of accounting where the assets acquired and liabilities assumed are recognized based on their respective estimated fair values. The excess of the purchase price over the estimated fair values of the net assets acquired is recorded as goodwill. Determining the fair value of certain acquired assets and liabilities is subjective in nature and often involves the use of significant estimates and assumptions, including, but not limited to, the selection of appropriate valuation methodology, projected revenue, expenses and cash flows, weighted average cost of capital, discount rates, estimates of advertiser and publisher turnover rates, and estimates of terminal values. Business acquisitions are included in the Company's consolidated financial statements as of the date of the acquisition.\nFair Value of Financial Instruments\nAssets and liabilities recorded at fair value in the consolidated balance sheets are categorized based upon the level of judgment associated with the inputs used to measure their fair value. The categories are as follows:\nLevel Input: Input Definition:\nLevel I Inputs that are unadjusted, quoted prices for identical assets or liabilities in active markets at the measurement date.\nLevel II Inputs, other than quoted prices included in Level I, that are observable for the asset or liability through corroboration with market data at the measurement date.\nLevel III Unobservable inputs that reflect managements best estimate of what market participants would use in pricing the asset or liability at the measurement date.\nFor certain of our financial instruments, including accounts receivable, accounts payable, and accrued compensation and other accrued expenses, the amounts approximate fair value due to their short maturities.\nThe following table summarizes fair value measurements as of August 31, 2022, and August 31, 2021, for assets and liabilities measured at fair value on a recurring basis:\nAugust 31, 2022\n(in thousands) Level 1 Level 2 Level 3 Total\nCash and cash equivalents $ 51,567 $ - $ - $ 51,567\nShort-term investments $ 76,668 $ - $ - $ 76,668\nAugust 31, 2021\n(in thousands) Level 1 Level 2 Level 3 Total\nCash and cash equivalents $ 36,984 $ - $ - $ 36,984\nShort-term investments $ 86,620 $ - $ - $ 86,620\nAcquisition-related contingent consideration obligations $ - $ - $ 3,217 $ 3,217\nAs of August 31, 2022, we had no liability for contingent consideration related to our acquisition of Lixoft as the remaining contingent obligation was settled in May 2022. As of August 31, 2021, we had a liability for contingent consideration related to our acquisition of Lixoft. The fair value measurement of the contingent consideration obligations was determined using Level 3 inputs and was based on a discounted cash flow model using a probability-weighted income approach. The liability is recorded as contracts payable on our consolidated balance sheets, and changes in the fair value of the contingent consideration obligations are recorded as other income (expense), net in our consolidated statements of operations and comprehensive income.\nThe following is a reconciliation of contingent consideration value:\n(in thousands)\nValue as of August 31, 2021 $ 3,217\nContingent consideration payments in cash (2,334)\nContingent consideration payments in stock (1,166)\nChange in value of contingent consideration 283\nValue as of August 31, 2022 $ -\nMarketing\nThe Company expenses marketing costs as incurred. Marketing costs for the years ended August 31, 2022, 2021, and 2020 were $0.2 million, $0.1 million, and $0.1 million, respectively.\nResearch and Development Costs\nResearch and development costs are charged to expense as incurred until technological feasibility has been established. These costs include salaries, laboratory experiments, and purchased software that was developed by other companies and incorporated into, or used in the development of, our final products.\nIncome Taxes\nWe account for income taxes in accordance with ASC 740 which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns.\nUnder this method, deferred income taxes are recognized for the tax consequences in future years of differences between the tax bases of assets and liabilities and their financial reporting amounts at each year-end based on enacted tax laws and statutory tax rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized. The provision for income taxes represents the tax payable for the period and the change during the period in deferred tax assets and liabilities.\nIntellectual property\nOn February 28, 2012, we bought out the royalty agreement with Enslein Research. The cost of $0.1 million is being amortized over 10 years under the straight-line method.\nOn May 15, 2014, we entered into a termination and non-assertion agreement with TSRL, Inc., pursuant to which the parties agreed to terminate an exclusive software licensing agreement entered into between the parties in 1997. As a result, the Company obtained a perpetual right to use certain source code and data, and TSRL relinquished any rights and claims to any GastroPlus products and to any claims, royalties, or other payments under that 1997 agreement. We agreed to pay TSRL total consideration of $6.0 million, which is being amortized over 10 years under the straight-line method.\nOn June 1, 2017, as part of the acquisition of DILIsym, the Company acquired certain developed technologies associated with the drug-induced liver disease (DILI). These technologies were valued at $2.9 million and are being amortized over 9 years under the straight-line method.\nIn September 2018, we purchased certain intellectual property rights of Entelos Holding Company. The cost of $0.1 million is being amortized over 10 years under the straight-line method.\nOn April 1, 2020, as part of the acquisition of Lixoft, the Company acquired certain developed technologies associated with the Lixoft scientific software. These technologies were valued at $8.0 million and are being amortized over 16 years under the straight-line method.\nThe following table summarizes intellectual property as of August 31, 2022:\n(in thousands) Amortization\nPeriod Acquisition\nValue Accumulated\nAmortization Net Book\nValue\nRoyalty Agreement buy out-Enslein Research Straight line 10 years $ 75 $ 75 $ -\nTermination/nonassertion agreement-TSRL Inc. Straight line 10 years 6,000 4,975 1,025\nDeveloped technologies-DILIsym acquisition Straight line 9 years 2,850 1,662 1,188\nIntellectual rights of Entelos Holding Company Straight line 10 years 50 20 30\nDeveloped technologies-Lixoft acquisition Straight line 16 years 8,010 1,196 6,814\n$ 16,985 $ 7,928 $ 9,057\nThe following table summarizes intellectual property as of August 31, 2021:\n(in thousands) Amortization\nPeriod Acquisition\nValue Accumulated\nAmortization Net Book\nValue\nRoyalty Agreement buy out-Enslein Research Straight line 10 years $ 75 $ 71 $ 4\nTermination/nonassertion agreement-TSRL Inc. Straight line 10 years 6,000 4,375 1,625\nDeveloped technologies-DILIsym acquisition Straight line 9 years 2,850 1,346 1,504\nIntellectual rights of Entelos Holding Company Straight line 10 years 50 15 35\nDeveloped technologies-Lixoft acquisition Straight line 16 years 8,010 709 7,301\n$ 16,985 $ 6,516 $ 10,469\nTotal amortization expense for intellectual property agreements for the years ended August 31, 2022, 2021, and 2020 was $1.4 million, $1.4 million, and $1.1 million, respectively.\nFuture amortization of intellectual property for the next five years is as follows:\n(in thousands)\nYear ending\nAugust 31,\nAmount\n2023 $ 1,373\n2024 $ 1,198\n2025 $ 773\n2026 $ 697\n2027 $ 457\nEarnings per Share\nWe report earnings per share in accordance with ASC 260. Basic earnings per share is computed by dividing income available to common shareholders by the weighted-average number of common shares outstanding. Diluted earnings per share is computed similarly to basic earnings per share, except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. The components of basic and diluted earnings per share for the years ended August 31, 2022, 2021, and 2020 were as follows:\nAugust 31,\n(in thousands) 2022 2021 2020\nNumerator\nNet income attributable to common shareholders $ 12,483 $ 9,782 $ 9,332\nDenominator\nWeighted-average number of common shares outstanding during the year 20,196 20,045 17,819\nDilutive effect of stock options 553 698 719\nCommon stock and common stock equivalents used for diluted earnings per share 20,749 20,743 18,538\nStock-Based Compensation\nCompensation costs related to stock options are determined in accordance with ASC 718. Compensation cost is calculated based on the grant-date fair value estimated using the Black-Scholes pricing model and then amortized on a straight-line basis over the requisite service period. Stock-based compensation expense related to stock options, not including shares issued to directors for services, was $2.7 million, $2.4 million, and $1.3 million for the years ended August 31, 2022, 2021, and 2020, respectively.\nImpairment of Long-lived Assets\nWe account for the impairment and disposition of long-lived assets in accordance with ASC 360. Long-lived assets to be held and used are reviewed for events or changes in circumstances that indicate that their carrying value may not be recoverable. We measure recoverability by comparing the carrying amount of an asset to the expected future undiscounted net cash flows generated by the asset. If we determine that the asset may not be recoverable, or if the carrying amount of an asset exceeds its estimated future undiscounted cash flows, we recognize an impairment charge to the extent of the difference between the fair value and the asset's carrying amount. No impairment losses were recorded during the years ended August 31, 2022, 2021, and 2020.\nRecently Issued Accounting Standards\nIn October 2021, the FASB issued ASU No. 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers (ASU 2021-08). The amendment requires contract assets and contract liabilities acquired in a business combination to be recognized and measured in accordance with ASC 606, Revenue from Contracts with Customers, as if the acquirer had originated the contract. The amendment is intended to improve the accounting for acquired revenue contracts with customers in a business combination, related to the recognition of an acquired contract liability, and to payment terms and their effect on subsequent revenue recognized by the acquirer. The amendment also provides certain practical expedients when applying the guidance. ASU 2021-08 is effective for interim and annual periods beginning after December 15, 2022, on a prospective basis, with early adoption permitted. The Company expects to adopt ASU 2021-08 in the first quarter of fiscal year 2024. The Company is currently evaluating the potential impact of ASU 2021-08 to its consolidated financial statements.\nIn November 2021, the FASB issued ASU 2021-10, Government Assistance (Topic 832), which requires business entities to disclose information about transactions with a government that are accounted for by applying a grant or contribution model by analogy (for example, IFRS guidance in IAS 20 or guidance on contributions for not-for-profit entities in ASC 958-605). For transactions within scope, the new standard requires the disclosure of information about the nature of the transaction, including significant terms and conditions, as well as the amounts and specific financial statement line items affected by the transaction. The new guidance is effective for annual reporting periods beginning after December 15, 2021. The Company does not expect that the adoption of this standard will have a material impact on its consolidated financial statements; however, the Company expects to increase its disclosures with respect to government assistance beginning in the first quarter of fiscal year 2023.\nNOTE 3 - OTHER INCOME (EXPENSE), NET\nThe components of other income (expense), net for the years ended August 31, 2022, 2021, and 2020, were as follows:\nYear ended August 31,\n(in thousands) 2022 2021 2020\nInterest income $ 717 $ 201 $ 30\nInterest expense - (22) -\nChange in valuation of contingent consideration (283) (486) (203)\nGain on sale of assets 1 - -\n(Loss) gain on currency exchange (231) 139 (45)\nTotal other income (expense), net $ 204 $ (168) $ (218)\nNOTE 4 - PROPERTY AND EQUIPMENT\nProperty and equipment consisted of the following:\nAugust 31,\n(in thousands) 2022 2021\nEquipment $ 346 $ 293\nComputer equipment 860 606\nFurniture and fixtures 61 36\nLeasehold improvements 13 13\nConstruction in progress - 1,302\nSubtotal 1,280 2,250\nLess accumulated depreciation (648) (412)\nTotal $ 632 $ 1,838\nDepreciation expense was $0.3 million, $0.2 million, and $0.2 million for the years ended August 31, 2022, 2021, and 2020, respectively.\nNOTE 5 - INVESTMENTS\nThe Company invests a portion of its excess cash balances in short-term debt securities. Investments at August 31, 2022, consisted of corporate bonds and term deposits with maturities remaining of less than 12 months. The Company may also invest excess cash balances in certificates of deposits, money market accounts, government-sponsored enterprise securities, and/or commercial paper. The Company accounts for its investments in accordance with ASC 320, Investments - Debt and Equity Securities. As of August 31, 2022, all investments were classified as held-to-maturity securities, as the Company has the positive intent and ability to hold these securities until maturity. The Company believes unrealized losses on investments were primarily caused by rising interest rates rather than changes in credit quality and accordingly has not recorded an allowance for credit losses on its debt securities as of August 31, 2022, and 2021.\nThe following tables summarize the Companys short-term investments as of August 31, 2022, and 2021:\nAugust 31, 2022\n(in thousands) Amortized Cost Gross\nUnrealized\nGains Gross\nUnrealized\nLosses Fair Value\nCommercial notes (due within one year) $ 72,168 $ - $ (839) $ 71,329\nTerm deposits (due within one year) 4,500 4,500\nTotal $ 76,668 $ - $ (839) $ 75,829\nAugust 31, 2021\n(in thousands) Amortized Cost Gross\nUnrealized\nGains Gross\nUnrealized\nLosses Fair Value\nCommercial notes (due within one year) $ 86,620 $ - $ (136) $ 86,484\nTotal $ 86,620 $ - $ (136) $ 86,484\nNOTE 6 - CONTRACTS PAYABLE\nDILIsym Acquisition Liabilities:\nOn June 1, 2017, we acquired DILIsym. The agreement provided for a working capital adjustment, an 18-month $1.0 million holdback provision against certain representations and warranties, and an earnout agreement of up to an additional $5.0 million in earnout payments based on earnings over three years following acquisition. The earnout liability was recorded at an estimated fair value. Payments under the earnout liability started in fiscal year 2019. In September 2018, $1.6 million was paid out under the first earnout payment. A second earnout payment was made in August 2019 in the amount of $1.7 million. The final payment of $1.8 million was paid in August 2020. In addition, no claims were made against the holdback and the $1.0 million holdback provision was released eighteen months after June 1, 2017.\nLixoft Acquisition Liabilities:\nOn April 1, 2020, the Company acquired Lixoft. The agreement provided for a 24-month $2.0 million holdback provision against certain representations and warranties, comprised of $1.3 million of cash and shares of common stock valued at $0.7 million issued and deposited into an escrow account at the date of the agreement. In April 2022, the shares of common stock were released from escrow and $1.3 million of cash was paid to settle the holdback liability. In addition, based on a revenue-growth formula for the two years subsequent to April 1, 2020, the agreement called for earnout payments up to $5.5 million (two-thirds' cash and one-third newly issued, unregistered shares of the Companys common stock). The former shareholders could earn up to $2.0 million the first year and $3.5 million in year two. In June 2021, $2.0 million was paid out under the first earnout payment, which was comprised of $1.3 million of cash and shares of common stock valued at $0.7 million. In May 2022, $3.5 million was paid out under the second earnout payment, which was comprised of $2.3 million cash and shares of common stock valued at $1.2 million.\nAs of August 31, 2022, and 2021 the following liabilities have been recorded:\n(in thousands) August 31, 2022 August 31, 2021\nHoldback liability $ - $ 1,333\nEarnout liability - 3,217\nSubtotal $ - $ 4,550\nLess: Current portion - 4,550\nLong-term $ - $ -\nNOTE 7 - COMMITMENTS AND CONTINGENCIES\nLeases\nWe lease 9,255 square feet of office space in Lancaster, California, where our corporate headquarters are located. The lease term extends to January 31, 2026, and the base rent is $17 thousand per month. The lease agreement gives the Company the right, upon 180 days prior notice, to opt out of all or part of the last four years of the term, with no penalty.\nWe lease 4,317 square feet of office space in Buffalo, New York. The lease term extends to November 30, 2026, and the base rent is $7 thousand per month with an annual 2% increase. The lease agreement provides the Company with two five-year renewal options and the right to terminate the lease with one years prior written notice with certain penalties. We previously leased 12,623 square feet of office space at a different location in Buffalo, New York. That lease term extended to November 2021 and the base rent was $16 thousand per month.\nWe have a data center colocation space in Buffalo, New York, with a lease term through November 30, 2026, and rent of $4 thousand per month with an annual 3% increase.\nWe lease 3386 square feet of office space in Durham, North Carolina. The lease term extends to September 30, 2023, and the base rent is $8 thousand per month with an annual 3% increase.\nWe lease 2,300 square feet of office space in Paris, France. The lease term extends to November 30, 2024, and the rent is $5 thousand per month and adjusted each December based on a consumer price index.\nRent expense, including common area maintenance fees for the years ended August 31, 2022, 2021, and 2020 was $0.6 million, $0.7 million, and $0.6 million, respectively.\nLease liability maturities as of August 31, 2022, were as follows:\n(in thousands) Years Ending August 31, Amount\n2023 $ 511\n2024 411\n2025 346\n2026 219\n2027 34\nTotal undiscounted liabilities 1,521\nLess: imputed interest (117)\nTotal operating lease liabilities (including current portion) $ 1,404\nLine of Credit\nOn March 31, 2020, the Company entered into a Credit Agreement with Wells Fargo Bank, N.A. The Credit Agreement provided us with a credit facility of $3.5 million through April 15, 2022 (the \"Termination Date\"), on which date the Credit Agreement terminated in accordance with its terms. As a result, we can no longer draw down against the line of credit. We chose not to renew or pursue an alternative credit facility as we do not foresee a need to utilize such credit facility within the next twelve months. As of the Termination Date, there were no amounts drawn against the line of credit.\nEmployment Agreements\nIn the normal course of business, the Company has entered into employment agreements with certain of its executive officers that may require compensation payments upon termination.\nLitigation\nWe are not a party to any legal proceedings and are not aware of any pending legal proceedings of any kind.\nNOTE 8 - SHAREHOLDERS' EQUITY\nShares Outstanding\nShares of common stock outstanding for the years ended August 31, 2022, 2021, and 2020 were as follows:\nAugust 31,\n2022 2021 2020\nCommon stock outstanding, beginning of year 20,142 19,923 17,592\nCommon stock issued during the year 119 218 2,331\nCommon stock outstanding, end of year 20,260 20,142 19,923\nDividends\nThe Companys Board of Directors declared cash dividends during the years ended August 31, 2022, and 2021. The details of dividends paid are in the following tables:\n(in thousands, except dividend per share) Fiscal Year 2022\nRecord Date Distribution Date Number of Shares\nOutstanding on\nRecord Date Dividend per\nShare Total Amount\n10/25/2021 11/01/2021 20,148 $ 0.06 $ 1,209\n1/31/2022 2/07/2022 20,178 $ 0.06 1,211\n4/25/2022 5/02/2022 20,207 $ 0.06 1,212\n7/25/2022 8/01/2022 20,239 $ 0.06 1,214\nTotal $ 4,846\n(in thousands, except dividend per share)\nFiscal Year 2021\nRecord Date Distribution Date Number of Shares\nOutstanding on\nRecord Date Dividend per\nShare Total Amount\n10/26/2020 11/02/2020 19,924 $ 0.06 $ 1,195\n1/25/2021 2/01/2021 20,010 $ 0.06 1,201\n4/26/2021 5/03/2021 20,115 $ 0.06 1,207\n7/26/2021 8/02/2021 20,139 $ 0.06 1,208\nTotal $ 4,811\nStock Option Plans\nOn December 23, 2016, the Board of Directors adopted, and on February 23, 2017, the shareholders approved, the 2017 Equity Incentive Plan (the \"2017 Plan\"), under which a total of 1.0 million shares of common stock were reserved for issuance. The 2017 plan would have terminated in December 2026. The 2017 Plan was replaced by the Companys 2021 Plan (as defined below), and as a result, no further issuances of shares may be made under the 2017 Plan.\nOn April 9, 2021, the Board of Directors adopted, and on June 23, 2021, the shareholders approved, the 2021 Equity Incentive Plan (the 2021 Plan), under which a total of 1.3 million shares of common stock have been reserved for issuance. The 2021 Plan will terminate in 2031.\nAs of August 31, 2022, employees and directors held Qualified Incentive Stock Options (\"ISOs\") and Non-Qualified Stock Options (\"NQSOs\") to purchase 1.2 million shares of common stock at exercise prices ranging from $6.85 to $66.14 per share.\nThe following tables summarize information about stock options:\n(in thousands, except per share and weighted-average amounts)\nTransactions During Fiscal Year 2022\nNumber of\nOptions Weighted-Average\nExercise Price\nPer Share Weighted-Average\nRemaining\nContractual Life\nOutstanding, August 31, 2021 1,184 $ 25.63 6.47\nGranted 255 42.13\nExercised (104) 16.15\nCanceled/Forfeited (90) 42.30\nOutstanding, August 31, 2022 1,245 $ 28.61 6.14\nVested and Exercisable, August 31, 2022 711 $ 17.65 4.47\nVested and Expected to Vest, August 31, 2022 1,236 $ 28.51 6.12\n(in thousands, except per share and weighted-average amounts)\nTransactions During Fiscal Year 2021\nNumber of\nOptions Weighted-Average\nExercise Price\nPer Share Weighted-Average\nRemaining\nContractual Life\nOutstanding, August 31, 2020 1,224 $ 17.76 6.79\nGranted 226 57.60\nExercised (204) 12.53\nCanceled/Forfeited (62) 29.83\nOutstanding, August 31, 2021 1,184 $ 25.63 6.47\nVested and Exercisable, August 31, 2021 619 $ 13.36 4.95\nVested and Expected to Vest, August 31, 2021 1,173 $ 25.69 6.47\n(in thousands, except per share and weighted-average amounts)\nTransactions During Fiscal Year 2020\nNumber of\nOptions Weighted-Average\nExercise Price\nPer Share Weighted-Average\nRemaining\nContractual Life\nOutstanding, August 31, 2019 1,163 $ 12.63 7.13\nGranted 223 39.23\nExercised (121) 9.29\nCanceled/Forfeited (41) 14.19\nOutstanding, August 31, 2020 1,224 $ 17.76 6.79\nVested and Exercisable, August 31, 2020 596 $ 10.69 5.59\nVested and Expected to Vest, August 31, 2020 1,194 $ 17.75 6.77\nThe following table summarizes the Intrinsic Value of options outstanding and options exercisable:\n(in thousands) Intrinsic Value\nof Options\nOutstanding Intrinsic\nValue of\nOptions\nExercisable Intrinsic\nValue of\nOptions\nExercised\nFiscal Year 2020 $ 51,273 $ 29,151 $ 4,086\nFiscal Year 2021 $ 25,705 $ 19,373 $ 11,554\nFiscal Year 2022 $ 39,208 $ 30,187 $ 3,572\nThe weighted-average remaining contractual life of options outstanding issued under the Plans, for both ISOs and NQSOs, was 6.14 years at August 31, 2022. The total fair value of non-vested stock options as of August 31, 2022, was $9.1 million and is amortizable over a weighted-average period of 3.27 years.\nThe fair value of these options was estimated at the date of grant using the Black-Scholes option-pricing model. The Black-Scholes option-valuation model was developed for use in estimating the fair value of traded options, which do not have vesting restrictions and are fully transferable. In addition, option-valuation models require the input of highly subjective assumptions, including the expected stock price volatility.\nThe following table summarizes the fair value of the options, including both ISOs and NQSOs, granted during the current fiscal year 2022 and fiscal year 2021:\n(in thousands, except prices) Fiscal Year 2022 Fiscal Year 2021\nEstimated fair value of awards granted $ 4,597 $ 5,092\nUnvested Forfeiture Rate 1.04 % 0 %\nWeighted-average grant price $ 42.13 $ 57.60\nWeighted-average market price $ 42.13 $ 57.60\nWeighted-average volatility 42.80 % 40.49 %\nWeighted-average risk-free rate 1.74 % 0.64 %\nWeighted-average dividend yield 0.58 % 0.42 %\nWeighted-average expected life 6.59 years 6.63 years\nThe exercise prices for the options outstanding at August 31, 2022, ranged from $6.85 to $66.14, and the information relating to these options is as follows:\n(in thousands except prices)\nExercise Price Awards Outstanding Awards Exercisable\nLow High Quantity Weighted -Average\nRemaining\nContractual\nLife Weighted-Average\nExercise\nPrice Quantity Weighted-Average\nRemaining\nContractual\nLife Weighted-Average\nExercise\nPrice\n$ 6.85 $ 9.77 286 2.75 years $ 8.29 286 2.75 years $ 8.29\n$ 9.78 $ 18.76 200 4.32 years $ 10.37 200 4.32 years $ 10.37\n$ 18.77 $ 33.40 241 6.38 years $ 25.21 121 5.97 years $ 24.16\n$ 33.41 $ 47.63 229 8.64 years $ 38.47 41 7.01 years $ 35.41\n$ 47.64 $ 66.14 289 8.56 years $ 56.30 63 8.14 years $ 58.92\n1,245 6.14 years $ 28.61 711 4.47 years $ 17.65\nDuring the fiscal years ended August 31, 2022, 2021, and 2020, we issued 7,120, 5,620 and 7,205 shares of stock valued at $0.4 million, $0.3 million, and $0.3 million, respectively, to our nonmanagement directors as compensation for board-related duties.\nThe balance of our par-value common stock and additional paid-in capital as of August 31, 2022, was $11 thousand and $138.5 million, respectively, and the balance of our par-value common stock and additional paid-in capital as of August 31, 2021, was $10 thousand and $133.4 million, respectively.\nNOTE 9 - INCOME TAXES\nWe utilize ASC 740 to account for income taxes which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns.\nUnder this method, deferred income taxes are recognized for the tax consequences in future years of differences between the tax bases of assets and liabilities and their financial reporting amounts at each year end based on enacted tax laws and statutory tax rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized. The provision for income taxes represents the tax payable for the period and the change during the period in deferred tax assets and liabilities.\nThe components of the income tax provision for the years ended August 31, 2022, 2021, and 2020 were as follows:\n(in thousands) 2022 2021 2020\nCurrent\nFederal $ 2,518 $ 1,315 $ 2,098\nState 611 450 478\nForeign (228) 166 39\nTotal current tax expense 2,901 1,931 2,615\nDeferred\nFederal (4) (379) (428)\nState (265) (249) (132)\nTotal deferred federal and state (269) (628) (560)\nTotal $ 2,632 $ 1,303 $ 2,055\nA reconciliation of the expected income tax computed using the federal statutory income tax rate to the Company's effective income tax rate is as follows for the years ended August 31, 2022, 2021, and 2020:\n2022 2021 2020\nIncome tax computed at federal statutory tax rate 21.0 % 21.0 % 21.0 %\nState taxes, net of federal benefit 3.2 2.0 4.1\nMeals & entertainment - - 0.1\nStock-based compensation 0.6 (6.8) (1.2)\nOther permanent differences 0.4 (0.3) (0.3)\nResearch and development credit (2.2) (1.6) (2.8)\nForeign-tax-related differences (3.2) (2.6) (1.4)\nResearch & credit adjustments to expense - 0.2 0.3\nChange in prior year estimated taxes (2.4) (0.1) (1.8)\nTotal 17.4 % 11.8 % 18.0 %\nSignificant components of the Company's deferred tax assets and liabilities for income taxes for the years ended August 31, 2022, and 2021 are as follows:\n(in thousands) 2022 2021\nDeferred tax assets:\nAccrued compensation $ 563 $ 586\nDeferred revenue 241 102\nCapitalized merger costs 703 703\nIntellectual property 7 7\nResearch and development credits 347 66\nForeign tax credits 101 -\nState taxes 128 72\nAllowance for doubtful accounts 3 20\nState tax deferred 28 80\nTotal deferred tax assets 2,121 1,636\nLess: Valuation allowance - -\nDeferred tax asset 2,121 1,636\nDeferred tax liabilities:\nProperty and equipment (109) (83)\nState tax deferred (30) (26)\nIntellectual property (1,139) (1,456)\nCapitalized computer software development costs (2,299) (1,797)\nTotal deferred tax liabilities (3,577) (3,362)\nNet deferred tax liabilities $ (1,456) $ (1,726)\nWe follow ASC 740 with regard to our accounting for uncertainty in income taxes recognized in the financial statements. Such guidance prescribes a recognition threshold of more likely than not and a measurement process for financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. In making this assessment, we determine whether it is more likely than not that a tax position will be sustained upon examination, based solely on the technical merits of the position and assume that the tax position will be examined by taxing authorities. Interest and penalties were immaterial for fiscal years 2022, 2021, and 2020, respectively. We file income tax returns with the IRS and various state jurisdictions as well as with the countries of India, Belgium and France. Our federal income tax returns for fiscal year 2019 through 2021 are open for audit, and our state tax returns for fiscal year 2018 through 2021 remain open for audit.\nOur review of prior-year tax positions using the criteria and provisions presented in guidance issued by FASB did not result in a material impact on our financial position or results of operations.\nNOTE 10 - CONCENTRATIONS AND UNCERTAINTIES\nFinancial instruments that potentially subject the Company to concentration of credit risk consist principally of cash, cash equivalents, trade accounts receivable, and short-term investments. The Company holds cash and cash equivalents at banks located in California, with balances that often exceed FDIC insured limits. In addition, we hold cash at a bank in France that is not FDIC-insured. Historically, the Company has not experienced any losses in such accounts. While the Company may be exposed to credit losses due to the nonperformance of its counterparties, the Company does not expect the settlement of these transactions to have a material effect on its results of operations, cash flows, or financial condition. The Company maintains cash at financial institutions that may, at times, exceed federally insured limits.\nRevenue concentration shows that international sales accounted for 30%, 31%, and 29% of revenue for the years ended August 31, 2022, 2021, and 2020, respectively. Our three largest customers in terms of revenue accounted for 5%, 3%, and 3% of revenue for fiscal year 2022. Our three largest customers in terms of revenue accounted for 11%, 4%, and 3% of revenue for fiscal year 2021. Our three largest customers in terms of revenue accounted for 9%, 7%, and 7% of revenue for fiscal year 2020.\nAccounts receivable concentrations show that our three largest customers in terms of accounts receivable each comprised between 4% and 8% of accounts receivable as of August 31, 2022, respectively; our two largest customers in terms of accounts receivable comprised 5% and 16% of accounts receivable as of August 31, 2021, respectively.\nWe operate in the biosimulation market, which is highly competitive and changes rapidly. Our operating results could be significantly affected by our ability to develop new products and find new distribution channels for new and existing products.\nNOTE 11 - SEGMENT REPORTING\nThe Company applies ASC 280, Segment Reporting, in determining reportable segments. The Company has two reportable segments: Software and Services. Segment information is presented in the same manner that the chief operating decision maker (\"CODM\") reviews certain financial information based on these reportable segments. The CODM reviews revenue and gross profit for both of the reportable segments. Gross profit is defined as revenue less cost of revenue incurred by the segment.\nNo operating segments have been aggregated to form the reportable segments. The Company does not allocate assets at the reportable segment level as these are managed on an entity-wide group basis and, accordingly, the Company does not report asset information by segment. The Company does not allocate operating expenses that are managed on an entity-wide group basis and, accordingly, the Company does not allocate and report operating expenses at segment level. There are no internal revenue transactions between the Companys segments.\nThe following tables summarize the results for each segment as follows for the years ended August 31, 2022, 2021 and 2020:\n(in thousands) Year ended August 31, 2022\nSoftware Services Total\nRevenues $ 32,642 $ 21,264 $ 53,906\nCost of revenues 3,060 7,762 10,822\nGross profit $ 29,582 $ 13,502 $ 43,084\nGross margin 91 % 63 % 80 %\nOur software business and services business represented 61% and 39% of total revenue, respectively, for the year ended August 31, 2022.\n(in thousands) Year ended August 31, 2021\nSoftware Services Total\nRevenues $ 27,670 $ 18,796 $ 46,466\nCost of revenues 3,235 7,365 10,600\nGross profit $ 24,435 $ 11,431 $ 35,866\nGross margin 88 % 61 % 77 %\nOur software business and services business represented 60% and 40% of total revenue, respectively, for the year ended August 31, 2021.\n(in thousands) Year ended August 31, 2020\nSoftware Services Total\nRevenues $ 21,587 $ 20,002 $ 41,589\nCost of revenues 2,883 7,766 10,649\nGross profit $ 18,704 $ 12,236 $ 30,940\nGross margin 87 % 61 % 74 %\nOur software business and services business represented 52% and 48% of total revenue, respectively, for the year ended August 31, 2020.\nNOTE 12 - EMPLOYEE BENEFIT PLAN\nWe maintain a 401(k) Plan for eligible employees. We make matching contributions equal to 100% of the employees elective deferral, not to exceed 4% of the employee's total compensation. We contributed $0.6 million, $0.5 million, and $0.5 million for fiscal years 2022, 2021, and 2020, respectively.\nNOTE 13 - ACQUISITION\nOn March 31, 2020, we entered into a Share Purchase and Contribution Agreement (the SPCA) with Lixoft. Under the terms of the SPCA, we agreed to pay the former shareholders of Lixoft total consideration of up to $16.5 million, consisting of two-thirds cash and one-third newly issued, unregistered shares of our common stock. At closing, we paid the former shareholders of Lixoft a total of $10.8 million, comprised of cash in the amount of $9.5 million and the issuance of 111,682 shares of our common stock valued at $3.7 million, net of adjustments and a $2.0 million holdback for representations and warranties. In addition, we paid $3.5 million of excess working capital based on the March 31, 2020, financial statements of Lixoft. In addition, the SPCA called for earnout payments of up to an additional $5.5 million, payable in two-thirds cash and one-third newly issued, unregistered shares of our common stock, based on a revenue-growth formula each year for the two years subsequent to April 1, 2020. The former shareholders could earn up to $2 million the first year and $3.5 million in year two. In June 2021, $2.0 million was paid out under the first earnout payment, which was comprised of $1.3 million of cash and shares of our common stock valued at $0.7 million. In April 2022, we released from escrow and distributed the $2.0 million holdback consideration, consisting of $1.3 million in cash and shares of our common stock valued at $0.7 million (amounting to an aggregate of 20,326 unregistered shares of our common stock), to the former shareholders of Lixoft. In May 2022, $3.5 million was paid out under the second earnout payment, which was comprised of $2.3 million of cash and shares of our common stock valued at $1.2 million (amounting to an aggregate of 23,825 unregistered shares of our common stock), to the former shareholders of Lixoft in accordance with the SPCA.\nUnder the acquisition method of accounting, the total purchase price reflects Lixofts tangible and intangible assets and liabilities based on their estimated fair values at the date of the completion of the acquisition (April 1, 2020). The following table summarizes the allocation of the purchase price for Lixoft:\n(in thousands)\nAssets acquired, including cash of $3,799 and accounts receivable of $629\n$ 5,007\nDeveloped technologies acquired 8,010\nEstimated value of intangible assets acquired (customer lists, trade name etc.) 4,160\nEstimated goodwill acquired 2,534\nLiabilities assumed (1,118)\nTotal consideration $ 18,593\nGoodwill has been provided in the transaction based on estimates of future earnings of this subsidiary including anticipated synergies associated with the positioning of the combined company as a leader in model-based drug development.\nNOTE 14 - SUBSEQUENT EVENTS\nDividend Declared\nOn Thursday, October 20, 2022, our Board of Directors declared a quarterly cash dividend of $0.06 per share to our shareholders. The dividend in the amount of $1.2 million will be distributed on Wednesday, November 7, 2022, for shareholders of record as of Monday, October 31, 2022."
}