{
    "cik": "1024478",
    "company": "ROCKWELL AUTOMATION, INC",
    "filing_type": "10-K",
    "filing_date": "2023-11-08",
    "period_of_report": "2023-09-30",
    "sic": "3829",
    "state_of_inc": "DE",
    "state_location": "WI",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1024478/0001024478-23-000126-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1024478/000102447823000126/rok-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1024478/0001024478-23-000126.txt",
    "filename": "1024478_10K_2023_0001024478-23-000126.htm",
    "content": "Item 1. Business\nGeneral\nRockwell Automation, Inc. (Rockwell Automation or the Company) is the worlds largest company dedicated to industrial automation and digital transformation. We understand and simplify our customers complex production challenges and deliver the most valued solutions that combine technology and industry expertise. As a result, we make our customers more resilient, agile, and sustainable, creating more ways to win. See Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations (MD&A) for additional information on our business and long-term strategy.\nThe Company continues the business founded as the Allen-Bradley Company in 1903. The privately-owned Allen-Bradley Company was a leading North American manufacturer of industrial automation equipment when the former Rockwell International Corporation (RIC) purchased it in 1985.\nThe Company was incorporated in Delaware in connection with a tax-free reorganization completed on December 6, 1996, pursuant to which we divested our former aerospace and defense businesses (the A&D Business) to The Boeing Company (Boeing). In the reorganization, RIC contributed all of its businesses, other than the A&D Business, to the Company and distributed all capital stock of the Company to RICs shareowners. Boeing then acquired RIC.\nAs used herein, the terms we, us, our, Rockwell Automation, or the Company include wholly-owned and controlled majority-owned subsidiaries and predecessors unless the context indicates otherwise. Information included in this Annual Report on Form 10-K refers to our continuing businesses unless otherwise indicated.\nWhenever an Item of this Annual Report on Form 10-K refers to information in our Proxy Statement for our Annual Meeting of Shareowners to be held on February 6, 2024 (the Proxy Statement), or to information under specific captions in Item 7. MD&A, or in Item 8. Financial Statements and Supplementary Data (the Consolidated Financial Statements), the information is incorporated in that Item by reference. All date references to years and quarters refer to our fiscal year and quarters, unless otherwise stated.\nOperating Segments\nWe have three operating segments: Intelligent Devices, Software & Control, and Lifecycle Services. The Intelligent Devices segment includes drives, motion, advanced material handling, safety, sensing, industrial components, and configured-to-order products. The Software & Control segment includes control and visualization software and hardware, digital twin, simulation and information software, and network and security infrastructure. The Lifecycle Services segment includes digital consulting, professional services including engineered-to-order solutions, recurring services including cybersecurity, safety, remote monitoring, and asset management, and the Sensia joint venture.\nOur operating segments share common sales, supply chain, and functional support organizations and conduct business globally. Major markets served by all segments consist of discrete end markets (e.g., Automotive including Electric Vehicle and Battery, Semiconductor, and e-Commerce & Warehouse Automation), hybrid end markets (e.g., Food & Beverage, Life Sciences, and Tire), and process end markets (e.g., Oil & Gas, Mining, and Chemicals). See Note 19 in the Consolidated Financial Statements for additional information on our operating segments.\nGeographic Information\nWe do business in more than 100 countries around the world. The largest sales outside the United States on a country of destination basis are in China, Canada, Italy, Mexico, the United Kingdom, and Germany. See Item 1A. Risk Factors\nIn the ordinary course of our business, we face various strategic, operating, compliance, and financial risks. These risks could have an impact on our business, financial condition, operating results, and cash flows. Our most significant risks are set forth below and elsewhere in this Annual Report on Form 10-K.\nOur Enterprise Risk Management (ERM) process seeks to identify and address significant risks. Our ERM process assesses, manages, and monitors risks consistent with the integrated risk framework in the Enterprise Risk Management - Integrated Framework (2017) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). We believe that risk-taking is an inherent aspect of the pursuit of our strategy. Our goal is to manage risks prudently rather than avoid risks. We can mitigate risks and their impact on the Company only to a limited extent.\nA team of senior executives prioritizes identified risks and assigns an executive to address each major identified risk area and lead action plans to manage risks. Our Board of Directors provides oversight of the ERM process and reviews significant identified risks. The Audit Committee of the Board of Directors also reviews significant financial risk exposures, and the steps management has taken to monitor and manage them. Our other Board committees also play a role in risk management, as set forth in their respective charters.\nOur goal is to proactively manage risks using a structured approach in conjunction with strategic planning, with the intent to preserve and enhance shareowner value. However, the risks set forth below and elsewhere in this Annual Report on Form 10-K and other risks and uncertainties could adversely affect us and cause our results to vary materially from recent results or from our anticipated future results.\nIndustry and Economic Risks\nAdverse changes in macroeconomic or industry conditions may result in decreases in our sales and profitability.\nWe are subject to macroeconomic cycles and when recessions occur, we may experience reduced, canceled or delayed orders, payment delays or defaults, supply chain disruptions, or other adverse events as a result of the economic challenges faced by our customers, prospective customers, and suppliers. As our product lead times are stabilizing, orders may decline as our distributor partners and customers work to lower their working capital by reducing inventory levels.\nDemand for our hardware and software products, solutions, and services is sensitive to changes in levels of production and the financial performance of major industries that we serve. As economic activity slows, credit markets tighten, or sovereign debt concerns arise, companies tend to reduce their levels of capital spending, which could result in decreased demand for our hardware and software products, solutions, and services.\nAs a global company operating in over 100 countries, we face risks related to foreign currency markets. A strengthening U.S. Dollar (USD) may adversely impact our sales and profitability related to business we do outside the U.S. Economic, political, regulatory, and compliance risks, particularly in emerging markets, can restrict our ability to exchange, transact, or pay dividends with foreign currencies we hold.\nOil & Gas is a major industry that we serve, including through our Sensia joint venture. When adverse Oil & Gas industry events arise, companies may reduce their levels of spending, which could result in decreased demand for our hardware and software products, solutions, and services. Demand for our hardware and software products, solutions, and services is sensitive to industry volatility and risks including those related to commodity prices, supply and demand dynamics, production costs, geological and political activities, and environmental regulations including those intended to reduce the impact of climate change.\nWe face the potential harms of natural disasters, including those as a result of climate change, pandemics, acts of war, terrorism, international conflicts, or other disruptions to our operations, the duration and severity of which are highly uncertain and difficult to predict.\nOur business depends on the movement of people and goods around the world. Natural disasters (including but not limited to those as a result of climate change), pandemics, acts or threats of war or terrorism, international conflicts, power outages, fires, explosions, equipment failures, sabotage, political instability, and the actions taken by governments could cause damage to or disrupt our business operations, our suppliers or our customers, and could create economic instability. Disruptions to our information technology (IT) infrastructure from system failures, shutdowns, power outages, telecommunication or utility failures, and other events, including disruptions at third-party IT and other service providers, could also interfere with or disrupt our operations. Although it is not possible to predict such events or their consequences, these events could decrease demand for our hardware and software products, solutions, or services, increase our costs, or make it difficult or impossible for us to deliver products, solutions, or services.\nOur industry is highly competitive.\nWe face strong competition in all of our market segments in several significant respects. We compete based on breadth and scope of our hardware and software product portfolio and solution and service offerings, technology differentiation, the domain expertise of our employees and partners, product performance, quality of our hardware and software products, solutions, and services, knowledge of integrated systems and applications that address our customers business challenges, pricing, delivery, and customer service. The relative importance of these factors differs across the geographic markets and product areas that we serve and across our market segments. We seek to maintain competitive pricing levels across and within geographic markets by continually developing advanced technologies for new hardware and software products and product enhancements and offering complete solutions for our customers business problems. In addition, we continue to drive productivity to reduce our cost structure. If we fail to achieve our objectives, to keep pace with technological changes, or to provide high quality hardware and software products, solutions, and services, we may lose business or experience price erosion and correspondingly lower sales and margins. We expect the level of competition to remain high in the future, which could limit our ability to maintain or increase our market share or profitability.\nVolatility and disruption of the capital and credit markets may result in increased costs to maintain our capital structure.\nOur ability to access the credit markets and the costs of borrowing are affected by the strength of our credit rating and current market conditions. If our access to credit, including the commercial paper market, is adversely affected by a change in market conditions or otherwise, our cost of borrowings may increase or our ability to fund operations may be reduced.\nBusiness and Operational Risks\nWe rely on suppliers to provide equipment, components, and services.\nOur business requires that we buy equipment, components, and services including finished products, electronic components, and commodities. Our reliance on suppliers involves certain risks, including:\nshortages of components, commodities, or other materials, which could adversely affect our manufacturing efficiencies and ability to make timely delivery of our products, solutions, and services;\nchanges in the cost of these purchases due to inflation, exchange rate fluctuations, taxes, tariffs, commodity market volatility, or other factors that affect our suppliers;\npoor quality or an insecure supply chain, which could adversely affect the reliability and reputation of our hardware and software products, solutions, and services;\nembargoes, sanctions, and other trade restrictions that may affect our ability to purchase from various suppliers; and\nintellectual property risks such as challenges to ownership of rights or alleged infringement by suppliers.\nAny of these uncertainties could adversely affect our profitability and ability to compete. We also maintain several single-source supplier relationships because either alternative sources are not available, or the relationship is advantageous due to performance, quality, support, delivery, capacity, or price considerations. Unavailability of, or delivery delays for, single-source components or products could adversely affect our ability to ship the related products in a timely manner. The effect of unavailability or delivery delays would be more severe if associated with our higher volume and more profitable products. Even where substitute sources of supply are available, qualifying alternative suppliers and establishing reliable supplies could cost more or result in delays and a loss of sales.\nOur business success depends on attracting, developing, and retaining highly qualified employees.\nOur success depends on the efforts and abilities of our leadership team and employees across the Company. The skills, experience, and industry knowledge of our employees significantly benefit our operations and performance. The market for employees and leaders with certain skills and experiences is very competitive, and difficulty attracting, developing, and retaining members of our leadership team and key employees could have a negative effect on our business, operating results, and financial condition. Maintaining a positive and inclusive culture and work environment, offering attractive compensation, benefits, and development opportunities, and effectively implementing processes and technology that enable our employees to work effectively and efficiently are important to our ability to attract and retain employees.\nWe sell to customers around the world and are subject to the risks of doing business in many countries.\nWe do business in more than 100 countries around the world. In addition, our manufacturing operations, suppliers, and employees are located in many places around the world. Less than half of our total sales in 2023 were to customers outside the U.S. The future success of our business depends on growth in our sales in all global markets. Our global operations are subject to numerous financial, legal, and operating risks, such as political and economic instability; prevalence of corruption in certain countries; enforcement of contract and intellectual property rights; and compliance with existing and future laws, regulations, and policies, including those related to exports, imports, tariffs, embargoes and other trade restrictions (including sanctions placed on Russia), investments, taxation, product content and performance, employment, and repatriation of earnings. In addition, we are affected by changes in foreign currency exchange rates, inflation rates, and interest rates. The occurrence or consequences of these risks may make it more difficult to operate our business and may increase our costs, which could decrease our profitability and have an adverse effect on our financial condition.\nFailures or security breaches of our products, connected services, manufacturing environment, supply chain, or information and operational technology systems could have an adverse effect on our business.\nWe rely heavily on technology in our hardware and software products, solutions, and services for our customers manufacturing environment, and in our enterprise infrastructure. Despite the implementation of security measures, our systems are vulnerable to unauthorized access by nation states, hackers, cyber-criminals, malicious insiders, and other actors who may engage in fraud, theft of confidential or proprietary information, or sabotage. Our systems could be compromised by malware (including ransomware), cyber-attacks, and other events, ranging from widespread, non-targeted, global cyber threats to targeted advanced persistent threats. Given that our hardware and software products, solutions, and services are used in critical infrastructure, these threats could indicate increased risk for our products, services, solutions, manufacturing, and IT infrastructure. Past global cyber-attacks have also been perpetuated by compromising software updates in widely used software products, increasing the risk that vulnerabilities or malicious content could be inserted into our products. In some cases, malware attacks were spread throughout the supply chain, moving from one company to the next via authorized network connections.\nOur hardware and software products, solutions, and services are used by our direct and indirect customers in applications that may be subject to information theft, tampering, sabotage, or cyber-attacks. Careless or malicious actors could cause a customers process to be disrupted or could cause equipment to operate in an improper manner that could result in harm to people or property. While we continue to improve the security attributes of our hardware and software products, solutions, and services, we can reduce risk, not eliminate it. To a significant extent, the security of our customers systems depends on how those systems are designed, installed, protected, configured, updated, and monitored, and much of this is typically outside our control. In addition, both software and hardware supply chains introduce security vulnerabilities into many products across the industry.\nOur business uses technology resources on a dispersed, global basis for a wide variety of functions including development, engineering, manufacturing, sales, accounting, and human resources. Our vendors, partners, employees, and customers have access to, and share, information across multiple locations via various digital technologies. In addition, we rely on partners and vendors, including cloud providers, for a wide range of products and outsourced activities as part of our internal IT infrastructure and our commercial offerings. Secure connectivity is important to these ongoing operations. Also, our partners and vendors frequently have access to our confidential information as well as confidential information about our customers, employees, and others. We design our security architecture to reduce the risk that a compromise of our partners infrastructure, for example a cloud platform, could lead to a compromise of our internal systems or customer networks. In addition, our Third-Party Risk Program manages risk posed by our suppliers that have access to our confidential information, systems, or network, but this risk cannot be eliminated and vulnerabilities at third parties could result in unknown risk exposure to our business and information. In addition, cyber security threats may pose a significant risk to our third-party partners and could have a material adverse impact on their businesses, operations, products, and services that we use in our day-to-day operations.\nThe current cyber threat environment indicates increased risk for all companies, including those in industrial automation and information technology. Like other global companies, we have experienced cyber threats and incidents, although none have been material or had a material adverse effect on our business or financial condition. Our information security efforts, under the leadership of our Chief Information Security Officer and Chief Product Security Officer, with the support of the entire management team, include major programs designed to address security governance and risk, product security, identification and protection of critical assets, insider risk, third-party risk, security awareness, and cyber defense operations. We believe these measures reduce, but cannot eliminate, the risk of a cybersecurity incident. Any significant security incidents could have an adverse impact on sales, harm our reputation, and cause us to incur legal liability and increased costs to address such events and related security concerns.\nAn inability to respond to changes in customer preferences could result in decreased demand for our products.\nOur success depends in part on our ability to anticipate and offer hardware and software products and services that appeal to the changing needs and preferences of our customers in the various markets we serve. Developing new hardware and software products and service offerings requires high levels of innovation, and the development process is often lengthy and costly. If we are not able to anticipate, identify, develop, and market products that respond to changes in customer preferences and emerging technological and broader industry trends, demand for our products could decline.\nThere are inherent risks in our solutions and services businesses.\nRisks inherent in the sale of solutions and services include assuming greater responsibility for successfully delivering projects that meet a particular customer specification, including defining and controlling contract scope, efficiently executing projects, and managing the performance and quality of our subcontractors and suppliers. If we are unable to manage and mitigate these risks, we could incur cost overruns, liabilities, and other losses that would adversely affect our results of operations.\nWe rely on our distribution channel for a substantial portion of our sales.\nIn North America, a large percentage of our sales are through distributors. In certain other countries, the majority of our sales are also through a limited number of distributors. We depend on the capabilities and competencies of our distributors to sell our hardware and software products, solutions, and services and deliver value to our customers. Disruptions to our existing distribution channel or the failure of distributors to maintain and develop the appropriate capabilities to sell our hardware and software products, solutions, and services could adversely affect our sales. A disruption could result from the sale of a distributor to a competitor, financial instability of a distributor, or other events.\nIntellectual property infringement claims of others and the inability to protect our intellectual property rights could harm our business and our customers.\nOthers may assert intellectual property infringement claims against us or our customers. We frequently provide a limited intellectual property indemnity in connection with our terms and conditions of sale to our customers and in other types of contracts with third parties. Indemnification payments and legal expenses to defend claims could be costly.\nIn addition, we own the rights to many patents, trademarks, brand names, and trade names that are important to our business. The inability to enforce our intellectual property rights (including as a result of counterfeit products and sales made by unauthorized resellers) may have an adverse effect on our results of operations. Expenses related to enforcing our intellectual property rights could be significant.\nIncreasing employee benefit costs and funding requirements could have a negative effect on our operating results and financial condition.\nOne important aspect of attracting and retaining qualified personnel is continuing to offer competitive employee retirement and health care benefits. The expenses we record for our pension and other postretirement benefit plans depend on factors such as changes in market interest rates, the value of plan assets, mortality assumptions, and healthcare trend rates. Significant unfavorable changes in these factors would increase our expenses and funding requirements. Expenses and funding requirements related to employer-funded healthcare benefits depend on laws and regulations, which could change, as well as healthcare cost inflation. An inability to control costs and funding requirements related to employee and retiree benefits could negatively impact our operating results and financial condition.\nStrategic Transactions and Investments Risks\nFailure to identify, manage, complete, and integrate strategic transactions may adversely affect our business or we may not achieve the expected benefits of these transactions.\nAs part of our strategy, we pursue strategic transactions, including acquisitions, joint ventures, investments, and other business opportunities and purchases of technology from third parties. In order to be successful, we must identify attractive transaction opportunities, effectively complete the transaction, and manage post-closing matters, such as integration of the acquired business or technology (including related personnel) and cooperation with our joint venture and other strategic partners. We may not be able to identify, or complete beneficial transaction opportunities given the intense competition for them. Completing these transactions requires favorable environments and we may encounter difficulties in obtaining the necessary regulatory approvals in both domestic and foreign jurisdictions. Even if we successfully identify and complete such transactions, we may not achieve the expected benefits of such transactions and we may not be able to successfully address risks and uncertainties inherent in such transactions, including:\ndifficulties in integrating the purchased or new operations, technologies, products or services, retaining customers, and achieving the expected benefits of the transaction, such as sales increases, access to technologies, cost savings, and increases in geographic or product presence, in the desired time frames;\nloss of key employees or difficulties integrating personnel;\nlegal and compliance issues;\nunknown or undisclosed and unmitigated cyber risks to purchased systems, products, and services;\ndifficulties implementing and maintaining consistent standards, financial systems, internal and other controls, procedures, policies, and information systems;\ndifficulties maintaining relationships with our joint venture and other strategic partners (including as a result of such joint venture and other strategic partners having differing business objectives) and managing disputes with such joint venture and other strategic partners that may arise in connection with our relationships with them; and\ndifficulties in yielding the desired strategic or financial benefit from venture capital investments, including as a result of being a minority investor or macroeconomic conditions.\nStrategic transactions and technology investments could result in debt, dilution, liabilities, increased interest expense, restructuring charges, and impairment and amortization expenses related to goodwill and identifiable intangible assets.\nLegal, Tax, and Regulatory Risks\nNew legislative and regulatory actions could adversely affect our business.\nLegislative and regulatory action, including those related to corporate income taxes, the environment, materials, products, certification, and labeling, privacy, cybersecurity, or climate change, may be taken in the jurisdictions where we operate that may affect our business activities or may otherwise increase our costs to do business.\nIn October 2021, the Organization for Economic Cooperation and Development (OECD) and G20 Finance Ministers reached an agreement, known as Base Erosion and Profit Shifting (BEPS) Pillar Two, that, among other things, ensures that income earned in each jurisdiction that a multinational enterprise operates in is subject to a minimum corporate income tax rate of at least 15%. Discussions related to the formal implementation of this agreement, including within the tax law of each member jurisdiction including the United States, are ongoing. Enactment of this regulation in its current form would increase the amount of global corporate income tax paid by the Company.\nWe are increasingly required to comply with various environmental and other material, product, certification, and labeling laws and regulations (including the emerging European Union Eco-design for Sustainable Products Regulation). Our customers may also be required to comply with such legislative and regulatory requirements. These requirements could increase our costs and could potentially have an adverse effect on our ability to do business in certain jurisdictions. Changes in these requirements could impact demand for our hardware and software products, solutions, and services.\nThe growing focus on environmental, social, and governance (ESG) factors by investors and other stakeholders and evolving compliance requirements by regulators may impact our business. Failure to comply with ESG reporting requirements, including inaccurate or incomplete disclosures, may lead to regulatory penalties, litigation, and reputational damage. While the Company has adopted certain voluntary targets, environmental laws, regulations, or standards may be changed, accelerated, or adopted and impose significant operational restrictions and compliance requirements upon the Company, its products, or customers, which could negatively impact the Companys business, capital expenditures, results of operations, and financial condition.\nCompliance with privacy and cybersecurity regulations could increase our operating costs as part of our efforts to protect and safeguard our sensitive data, personal information, and IT infrastructure. Failure to maintain information privacy could result in legal liability or reputational harm.\nClaims from taxing authorities could have an adverse effect on our income tax expense and financial condition.\nWe conduct business in many countries, which requires us to interpret and comply with the income tax laws and rulings in each of those taxing jurisdictions. Due to the ambiguity of tax laws among those jurisdictions as well as the uncertainty of how underlying facts may be construed, our estimates of income tax liabilities may differ from actual payments or assessments. We must successfully defend any claims from taxing authorities to avoid an adverse effect on our operating results and financial condition.\nPotential liabilities and costs from litigation (including asbestos claims and environmental remediation) could reduce our profitability.\nVarious lawsuits, claims, and proceedings have been or may be asserted against us relating to the conduct of our business or of our divested businesses, including those pertaining to the safety and security of the hardware and software products, solutions, and services we sell, employment, contract matters, and environmental remediation.\nWe have been named as a defendant in lawsuits alleging personal injury as a result of exposure to asbestos that was used in certain of our products many years ago. Our products may also be used in hazardous industrial activities, which could result in product liability claims. The uncertainties of litigation (including asbestos claims) and the uncertainties related to the collection of insurance proceeds make it difficult to predict the ultimate resolution of these lawsuits.\nOur operations are subject to various environmental regulations concerning human health, the limitation and control of emissions and discharges into the air, ground, and water, the quality of air and bodies of water, and the handling, use, and disposal of specified substances. Our financial responsibility to clean up contaminated property or for natural resource damages may extend to previously owned or used properties, waterways and properties owned by unrelated companies or individuals, as well as properties that we currently own and use, regardless of whether the contamination is attributable to prior owners. We have been named as a potentially responsible party at cleanup sites and may be so named in the future, and the costs associated with these current and future sites may be significant.\nWe have, from time to time, divested certain of our businesses. In connection with these divestitures, certain lawsuits, claims, and proceedings may be instituted or asserted against us related to the period that we owned the businesses, either because we agreed to retain certain liabilities related to these periods or because such liabilities fall upon us by operation of law. In some instances, the divested business has assumed the liabilities; however, it is possible that we might be responsible for satisfying those liabilities if the divested business is unable to do so. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nOur global headquarters in Milwaukee, Wisconsin, an owned facility, includes product development, sales, marketing, manufacturing, supply chain operations, finance, and other administrative and executive office functions. Most of our other facilities are leased and shared across our three operating segments. At September 30, 2023, the Company had approximately 50 manufacturing and distribution locations worldwide, disbursed evenly across our regions.\nThere are no major encumbrances (other than financing arrangements, which in the aggregate are not significant) on any of our properties or equipment. Our properties and equipment are in good operating condition and are adequate for our present needs. We do not anticipate difficulty in renewing existing leases as they expire or in finding alternative facilities. Item 3. Legal Proceedings\nThe information required by this Item 3 is contained in Note 17 in the Consolidated Financial Statements within the section entitled Other Matters. Item 4. Mine Safety Disclosures\nNot applicable.\nItem 4A. Information about our Executive Officers\nThe name, age, office and position held with the Company, and principal occupations and employment during the past five years of each of the executive officers of the Company as of November 1, 2023 are:\nName, Office and Position, and Principal Occupations and Employment Age\nBlake D. Moret - Chairman of the Board since January 1, 2018, and President and Chief Executive Officer since July 1, 2016\nRobert L. Buttermore - Senior Vice President and Chief Supply Chain Officer since February 13, 2023; previously Vice President and General Manager, Power Control Business (July 2018 - February 2023)\nMatthew W. Fordenwalt - Senior Vice President, Lifecycle Services since June 1, 2023; previously Vice President and General Manager, Systems and Solutions Business (April 2019 - June 2023), and Senior Director, Global Service Delivery (September 2018 - April 2019)\nNicholas C. Gangestad - Senior Vice President and Chief Financial Officer since March 1, 2021; previously Senior Vice President and Chief Financial Officer, 3M Company (consumer goods, health care and worker safety)\nScott A. Genereux - Senior Vice President and Chief Revenue Officer since February 1, 2021; previously Executive Vice President of Worldwide Field Operations at Veritas (provider of information management services) (2017-2020)\nRebecca W. House - Senior Vice President, Chief People (since July 2020) and Legal Officer and Secretary since January 3, 2017\nFrank C. Kulaszewicz - Senior Vice President since June 1, 2023; previously Senior Vice President Lifecycle Services (from October 2020 - June 2023) and Senior Vice President\nVeena M. Lakkundi - Senior Vice President, Strategy and Corporate Development since November 1, 2021; previously Senior Vice President, Strategy & Business Development (2020-2021), Vice President and General Manager, Industrial Adhesives and Tapes Division (2019-2020), and Vice President and Chief Ethics & Compliance Officer, Compliance and Business Conduct, Legal Affairs (2017-2019) at 3M Company (consumer goods, health care and worker safety)\nJohn M. Miller - Vice President and Chief Intellectual Property Counsel\nTessa M. Myers - Senior Vice President Intelligent Devices since June 6, 2022; previously Vice President and General Manager, Production Operations Management (from April 2021-June 2022), Vice President, Product Management (from October 2020-April 2021), and Regional President, North America\nChristopher Nardecchia - Senior Vice President and Chief Information Officer\nCyril P. Perducat - Senior Vice President (since June 1, 2021) and Chief Technology Officer since July 1, 2021; previously Executive Vice President, Schneider Electric (energy and automation digital solutions)\nTerry L. Riesterer - Vice President and Controller since November 29, 2019; previously Vice President, Corporate Financial Planning and Analysis and Corporate Development (from August 2016-November 2019)\nBrian A. Shepherd - Senior Vice President Software and Control since February 1, 2021; previously President, Production Software SFx (2019-2020) and Senior Vice President, Software Solutions (2017-2019) at Hexagon Manufacturing Intelligence (metrology and manufacturing solution specialist)\nIsaac R. Woods - Vice President and Treasurer since October 1, 2020; previously Director, Finance, Power Control Business (from March 2019-October 2020), and Director, Capital Markets (from January 2017-March 2019)\nThere are no family relationships, as defined by applicable SEC rules, between any of the above executive officers and any other executive officer or director of the Company. No officer of the Company was selected pursuant to any arrangement or understanding between the officer and any person other than the Company. All executive officers are elected annually.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock, $1 par value, is listed on the New York Stock Exchange and trades under the symbol ROK. On October 31, 2023, there were 11,960 shareowners of record of our common stock.\nCompany Purchases\nThe table below sets forth information with respect to purchases made by or on behalf of us of shares of our common stock during the three months ended September 30, 2023:\nPeriod Total Number of Shares Purchased (1)\nAverage Price Paid Per Share (2)\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs Maximum Approx. Dollar Value of Shares that May Yet Be Purchased Under the Plans or Programs (3)\nJuly 1 - 31, 2023 56,822 $ 336.07 56,822 $ 975,955,429\nAugust 1 - 31, 2023 82,698 298.05 82,698 951,307,019\nSeptember 1 - 30, 2023 37,732 291.47 37,732 940,309,320\nTotal 177,252 $ 308.84 177,252\n(1) All of the shares purchased during the quarter ended September 30, 2023, were acquired pursuant to the repurchase program described in (3) below.\n(2) Average price paid per share includes brokerage commissions.\n(3) On May 2, 2022, the Board of Directors authorized us to expend an additional $1.0 billion to repurchase shares of our common stock. Our repurchase program allows us to repurchase shares at managements discretion or at our brokers discretion pursuant to a share repurchase plan subject to price and volume parameters.\nPerformance Graph\nThe following information is not deemed to be soliciting material or to be filed with the SEC or subject to Regulation 14A or 14C under the Exchange Act or to the liabilities of Section 18 of the Exchange Act, and will not be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933, as amended, or the Exchange Act, except to the extent the Company specifically incorporates it by reference into such a filing.\nThe following line graph compares the cumulative total shareowner return on our common stock against the cumulative total return of the S&P Composite-500 Stock Index (S&P 500 Index) and the S&P 500 Selected GICS groups (Capital Goods, Software & Services, and Technology Hardware & Equipment) for the period of five fiscal years from October 1, 2018, to September 30, 2023, assuming in each case a fixed investment of $100 at the respective closing prices on September 30, 2018, and reinvestment of all dividends.\nThe cumulative total returns on Rockwell Automation common stock and each index as of September 30, 2018 through 2023 plotted in the above graph are as follows:\n2018 2019 2020 2021 2022 2023\nRockwell Automation (1)\n$ 100.00 $ 89.94 $ 122.91 $ 166.43 $ 123.89 $ 167.41\nS&P 500 Index 100.00 104.25 120.02 156.01 131.85 160.31\nS&P Selected GICS groups 100.00 107.60 148.77 189.73 159.25 207.01\nCash dividends per common share 3.51 3.88 4.08 4.28 4.48 4.72\n(1) Includes the reinvestment of all dividends in our common stock. Item 6. Reserved\nNot required. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nResults of Operations\nNon-GAAP Measures\nThe following discussion includes organic sales, total segment operating earnings and margin, adjusted income, adjusted EPS, adjusted effective tax rate, and free cash flow, which are non-GAAP measures. See Supplemental Sales Information for a reconciliation of reported sales to organic sales and a discussion of why we believe this non-GAAP measure is useful to investors. See Summary of Results of Operations for a reconciliation of Income before income taxes to total segment operating earnings and margin and a discussion of why we believe these non-GAAP measures are useful to investors. See Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate Reconciliation for a reconciliation of Net income attributable to Rockwell Automation, diluted EPS, and effective tax rate to adjusted income, adjusted EPS, and adjusted effective tax rate, respectively, and a discussion of why we believe these non-GAAP measures are useful to investors. See Financial Condition for a reconciliation of Cash provided by operating activities to free cash flow and a discussion of why we believe this non-GAAP measure is useful to investors.\nOverview\nRockwell Automation, Inc. is the worlds largest company dedicated to industrial automation and digital transformation. Overall demand for our hardware and software products, solutions, and services is driven by:\ninvestments in manufacturing, including new facilities or production lines, upgrades, modifications and expansions of existing facilities or production lines;\ninvestments in basic materials production capacity, which may be related to commodity pricing levels;\nour customers needs for faster time to market, agility to address evolving consumer preferences, operational productivity, asset management and reliability, and business resilience, including security and enterprise risk management;\nour customers needs to continuously improve quality, safety, and sustainability;\nindustry factors that include our customers new product introductions, demand for our customers products or services, and the regulatory and competitive environments in which our customers operate;\nlevels of global industrial production and capacity utilization;\nregional factors that include local political, social, regulatory, and economic circumstances; and\nthe spending patterns of our customers due to their annual budgeting processes and their working schedules.\nLong-term Strategy\nOur strategy is to expand human possibility. Our vision is to create the future of industrial operations. As the worlds largest company dedicated to industrial automation and digital transformation, our strategy is to bring the Connected Enterprise® to life. We understand and simplify our customers complex production challenges and deliver the most valued solutions that combine technology and industry expertise. As a result, we make our customers more resilient, agile, and sustainable, creating more ways to win. We deliver value by helping our customers optimize production, build resilience, empower people, become more sustainable, and accelerate transformation.\nRockwell Automation stands at the intersection of the technological and societal trends that are shaping the future of industrial operations. We see converging megatrends including digitization and artificial intelligence, energy transition and sustainability, shifting demographics, and an increased need for resiliency.\nOur long-term profitable growth framework outlines how we will deliver accelerated growth while we continue to transform our company to meet stakeholder expectations over the longer term:\nachieve faster secular growth in traditional markets due to customer needs for resiliency (including cybersecurity), agility, sustainability, and mitigating impacts of labor shortages;\ngrow share and create new ways to win through technology differentiation, industry focus, go to market acceleration, expanded offerings and new markets;\naccelerate growth in annual recurring revenue;\nadd 1% growth from acquisitions annually; and\ndeliver profitable growth within a disciplined financial framework.\nSustainability\nOur 2022 Sustainability Report highlights our sustainability strategy and outcomes. Our sustainability priorities are focused on three outcomes:\nSustainable Customers - enable our customers to achieve their own sustainability goals, making a positive impact on the world;\nSustainable Company - create innovative, sustainable products and solutions and foster a culture that empowers employees to operate safely, sustainably, and responsibly; and\nSustainable Communities - support the communities in which we live and work, having an impact that extends beyond our own organization.\nWe will meet our customers where they are on their sustainability journey. Whether they are just starting or leading the way, we help them translate insights into impacts across energy, water, and waste. Our technologies provide data transparency across value chains and enable our partners to scale innovative and often industry-first sustainable solutions.\nEnergy - contemporary industrial energy management software solutions that put energy data in context to production data, to reduce energy use across the value chain.\nWater - smart water solutions leverage modern software and analytics to improve operations visibility, system reliability, and worker productivity while supporting security needs and meeting regulatory obligations.\nWaste - enabling the circular economy for managing automation assets. Focus on developing solutions to automate industry-specific processes.\nDifferentiation through Technology Innovation and Domain Expertise\nWe have an industry leading portfolio of hardware, software, and services to give customers the flexibility to choose on-premises, edge, and cloud-native solutions.\nOur integrated control and information architecture, with Logix at its core, is an important differentiator. We are the only automation provider that can support many production disciplines, including discrete, process, batch, safety, security, motion, robotics, and power control, in a single hardware and software environment, helping customers increase the speed of deployment and reduce their total cost of ownership.\nOur open architecture and strong partner ecosystem allow customers to work with best-in-class partners across the technology stack and leverage existing infrastructure with new solutions.\nComplementing our strong technology differentiation is our own domain expertise. Domain expertise refers to the industry and application knowledge required to deliver solutions and services that support customers through the entire lifecycle of their automation investment. The combination of industry-specific domain expertise of our people with our innovative technologies enables us to help our customers automate and transform their manufacturing processes and solve their business challenges. Our digital services business has a deep understanding of customers biggest digital transformation challenges and opportunities for further productivity and growth.\nMarket Access and Expansion\nOver the past decade, our investments in technology and globalization have enabled us to expand our addressed market to over $120 billion. With our focus on innovation and growth, we expect to continue to expand our addressed market over our long-term planning horizon.\nIn most counties, our direct sales force works with Original Equipment Manufacturers (OEMs), system integrators, technology partners, and end users in conjunction with independent distributors. Approximately 70 percent of our global sales are transacted through independent distributors. Sales to our two largest distributors in 2023, 2022, and 2021, which are attributable to all three segments, were approximately 20 percent of our total sales.\nOEMs represent an important growth opportunity. To remain competitive, OEMs need to find the optimal balance of machine cost and performance while reducing their time to market. Our scalable technology, leading design productivity tools, and recent acquisitions in our Intelligent Devices and Software & Control businesses support OEMs in addressing these business needs.\nThe emerging markets of Asia Pacific and Europe, Middle East, and Africa (EMEA) are projected to be the fastest growing over our long-term planning horizon, due to higher levels of infrastructure investment and the growing middle-class population.\nWe believe that increased demand for consumer products in these markets will lead to manufacturing investment and provide us with additional growth opportunities in the future.\nWe have developed a powerful partner ecosystem that acts as an amplifier to our internal capabilities and enables us to serve our customers evolving needs around the world.\nAcquisitions and Investments\nOur acquisition and investment strategy focuses on hardware and software products, solutions, and services that will be catalytic to the organic growth of our core offerings.\nOur key priorities for inorganic investments include:\nannual recurring revenue;\nmarket expansion in Europe and Asia; and\napplication-specific differentiated technology in focus industries.\nIn addition, we make venture investments that enable access to leading-edge and complementary technologies aligned with our strategic priorities, accelerate internal development efforts, reduce time to market, and provide insights into disruptive technologies.\nWe believe these acquisitions and venture investments will help our served market and deliver value to our customers. See Note 4 in the Consolidated Financial Statements for additional information on our recent acquisitions.\nAttracting, Developing, and Retaining Highly Qualified Employees\nAt Rockwell Automation, we promise to expand human possibility within our company and throughout the world of industrial production, and we work to attract and develop highly engaged people who can and want to do their best work.\nOur commitment to diversity, equity, and inclusion starts at the top. Our 11 board members include four female and two African American directors. In fiscal 2021, we hired our first chief diversity officer and made investments to accelerate our efforts to increase diversity, equity, and inclusion across the company.\nA culture of integrity is fundamental to Rockwells core values, including a formal ethics and compliance organization and an Ombuds office that investigates ethical and legal concerns brought forth by employees. Our code of conduct, along with our partner code of conduct and supplier code of conduct prohibits corrupt acts, bribery, and anticompetitive behavior. Employee training is used to reinforce our values companywide, with participation in trainings related to ethics, environment, health and safety, and emergency responses at or near 100%.\nThere are several ways in which we attract, develop, and retain highly qualified employees, including:\nWe make the safety and health of our employees a top priority. We strive for zero workplace injuries and illnesses and operate in a manner that recognizes safety as fundamental to Rockwell Automation being a great place to work. In fiscal 2023, we achieved 0.27 recordable cases per 100 employees.\nWe capture and act upon employee feedback through our annual employee engagement survey. It measures several engagement indicators and drivers and provides an overall employee engagement index (EEI) with external benchmark comparison. The latest survey, conducted in February 2023, showed an EEI of 76, which was eight points higher than the industry norm of 68 for this index. Our global inclusion index score was 81, six points higher than the industry norm of 75.\nWe invest in growth and development of our employees. As the pace of change increases, it is important we provide re-skilling and upskilling opportunities for our technical talent, along with soft skills and leadership development for all. We offer a portfolio of all employee, managerial, and leader training that spans on-demand, virtual, and live instructor-led formats. Our programs focus on basic as well as transformational skills. We take pride in our culture and in fiscal 2021 created an opportunity for our employees to participate in team-based culture workshops that have evolved into a standard during new employee onboarding. In fiscal 2023, the majority of our employees completed one or more of our training programs representing over 650,000 learning hours.\nWe offer employee assistance and work life benefits to all global employees. Our comprehensive benefits include healthcare benefits, disability and life insurance benefits, paid time off, and leave programs. Rockwell offers plans and resources to help employees meet future savings goals through defined benefit and retirement savings plans. We offer flextime, remote work, and part-time arrangements whenever business conditions permit. We believe that face to face interaction is critical for our culture, innovation, people development, and engagement, and that flexible, virtual work arrangements help employees be more productive and engaged. During fiscal 2022, we launched our Hybrid Workplace Program, which combines the values of both physical workspaces and virtual work options, both of which are important for attracting, retaining, and developing employees and facilitating innovation, engagement, and productivity.\nWe monitor employee retention and attrition rates by demographic factors including by gender, ethnicity, generation, years of service, career role, region, business, and function. We generally experienced lower attrition rates in fiscal 2023 as compared to fiscal 2022. We believe the decrease is consistent with market trends experienced broadly across labor markets in fiscal 2023. We use attrition rate information to identify and address unfavorable trends to mitigate risk to our business. See Item 1A. Risk Factors for a discussion of risks relating to our inability to attract, develop, and retain highly qualified employees.\nAt September 30, 2023, our employees, including those employed by consolidated subsidiaries, by region were approximately:\nNorth America 10,000\nEurope, Middle East and Africa 5,500\nAsia Pacific 7,500\nLatin America 6,000\nTotal employees 29,000\nOur employees had the following global gender demographics based on voluntary disclosure:\nSeptember 30, 2023\nWomen Men Undisclosed\nAll employees 33% 67% -%\nIndividual Contributors 34% 66% -%\nPeople Managers 27% 73% -%\nTechnical Talent 19% 81% -%\nManufacturing Associates 46% 53% 1%\nOur U.S. employees had the following race and ethnicity demographics based on voluntary disclosure:\nSeptember 30, 2023\nBlack / African American Asian Hispanic / Latinx White Multiracial, Native American and Pacific Islander Undisclosed\nAll U.S. Employees 8% 11% 5% 70% 2% 4%\nIndividual Contributors 9% 11% 5% 69% 2% 4%\nPeople Managers 6% 8% 6% 76% 1% 3%\nTechnical Talent 6% 13% 5% 72% 2% 2%\nManufacturing Associates 19% 15% 4% 50% 2% 10%\nContinuous Improvement\nProductivity and continuous improvement are important components of our culture. We have programs in place that drive ongoing process improvement, functional streamlining, material cost savings, and manufacturing productivity. These are intended to improve profitability that can be used to fund investments in growth and to offset inflation. Our ongoing productivity initiatives target both cost reduction and improved asset utilization. Charges for workforce reductions and facility rationalization may be required in order to effectively execute our productivity programs.\nU.S. Economic Trends\nIn 2023, sales in the U.S. accounted for over half of our total sales. The various indicators we use to gauge the direction and momentum of our served U.S. markets include:\nThe Industrial Production (IP) Index, published by the Federal Reserve, which measures the real output of manufacturing, mining, and electric and gas utilities. The IP Index is expressed as a percentage of real output in a base year, currently 2017.\nThe Manufacturing Purchasing Managers Index (PMI), published by the Institute for Supply Management (ISM), which indicates the current and near-term state of manufacturing activity in the U.S. According to the ISM, a PMI measure above 50 indicates that the U.S. manufacturing economy is generally expanding while a measure below 50 indicates that it is generally contracting.\nThe table below depicts the trends in these indicators from fiscal 2021 to 2023. These figures are as of November 8, 2023, and are subject to revision by the issuing organizations. The IP Index remains constant in the fourth quarter of fiscal 2023 versus the third quarter of fiscal 2023. Manufacturing PMI results continued to be soft in the fourth quarter of 2023. The Manufacturing PMI reading in the month of September was the highest of the quarter, however it still remains below 50.\nIP Index PMI\nFiscal 2023 quarter ended:\nSeptember 2023 99.6 49.0\nJune 2023 99.6 46.0\nMarch 2023 99.5 46.3\nDecember 2022 99.6 48.4\nFiscal 2022 quarter ended:\nSeptember 2022 102.4 50.9\nJune 2022 101.9 53.0\nMarch 2022 101.1 57.1\nDecember 2021 100.1 58.8\nFiscal 2021 quarter ended:\nSeptember 2021 98.8 60.5\nJune 2021 97.9 60.9\nMarch 2021 96.7 63.7\nDecember 2020 96.1 60.5\nInflation in the U.S. has also had an impact on our input costs and pricing. We used the Producer Price Index (PPI), published by the Bureau of Labor Statistics, which measures the average change over time in the selling prices received by domestic producers for their output. After observing double-digit PPI growth through most of 2022, we have now observed PPI growth in the low single digits for the last three quarters. Producer prices remain elevated, however, year over year increases continued to decelerate following last years' surge in prices.\nNon-U.S. Economic Trends\nIn 2023, sales to customers outside the U.S. accounted for less than half of our total sales. These customers include both indigenous companies and multinational companies with a global presence. In addition to the global factors previously mentioned in the Overview section, international demand, particularly in emerging markets, has historically been driven by the strength of the industrial economy in each region, investments in infrastructure, and expanding consumer markets. We use changes in key countries' gross domestic product (GDP), IP, and PMI as indicators of the growth opportunities in each region where we do business. Industrial output outside the U.S. was mixed in the fourth quarter of fiscal 2023.\nSupply Chain\nWe have a global supply chain, including a network of suppliers and distribution and manufacturing facilities. The supply chain has been stressed by increased demand, along with pandemic-related and other global events that have put additional pressures on manufacturing output. Although there has been a continued gradual improvement in the supply chain environment, this has resulted in and could continue to result in:\nchallenges in our supply chain;\ndifficulty in procuring or inability to procure components and materials necessary for our hardware and software products, solutions, and services;\nincreased costs for commodities and components; and\ndelays in delivering, or an inability to deliver, our hardware and software products, solutions, and services.\nOur total order backlog consists of (in millions):\nSeptember 30,\n2023 2022\nIntelligent Devices $ 1,464.1 $ 2,086.1\nSoftware & Control 897.5 1,456.8\nLifecycle Services 1,747.3 1,654.1\nTotal Company $ 4,108.9 $ 5,197.0\nSee Note 2 in the Consolidated Financial Statements for additional information on the nature of our products and services and revenue recognition.\nWe are closely managing our end-to-end supply chain, from sourcing to production to customer delivery, with a particular focus on all critical and at-risk suppliers and supplier locations globally. We have made large-scale investments to increase capacity across our network in support of our orders growth. Additional actions we are taking include:\nextending order visibility to our supply base to ensure we are appropriately planning for extended component lead times;\nsecuring longer-term supply agreements with critical partners;\nre-engineering of existing products to increase component supply resiliency;\ncapacity investments, including redundant manufacturing lines and additional electronic assembly equipment; and\nqualification of additional suppliers to diversify our supplier base.\nWe believe these and other actions we are taking are enabling us to normalize our product lead times and reduce our backlog.\nSummary of Results of Operations\nThe following table reflects our sales and operating results (in millions, except per share amounts and percentages):\nYear Ended September 30,\n2023 2022 2021\nSales\nIntelligent Devices (a) $ 4,098.2 $ 3,544.6 $ 3,311.9\nSoftware & Control (b) 2,886.0 2,312.9 1,947.0\nLifecycle Services (c) 2,073.8 1,902.9 1,738.5\nTotal sales (d) $ 9,058.0 $ 7,760.4 $ 6,997.4\nSegment operating earnings (1)\nIntelligent Devices (e) $ 828.2 $ 717.6 $ 702.1\nSoftware & Control (f) 953.2 666.7 531.0\nLifecycle Services (g) 148.4 158.3 158.2\nTotal segment operating earnings (2) (h)\n1,929.8 1,542.6 1,391.3\nPurchase accounting depreciation and amortization, and impairment (264.4) (103.9) (55.1)\nCorporate and other (127.9) (104.7) (120.6)\nNon-operating pension and postretirement benefit cost (82.7) (4.7) (63.8)\nChange in fair value of investments 279.3 (136.9) 397.4\nLegal settlement - - 70.0\nInterest expense, net (125.6) (118.8) (93.0)\nIncome before income taxes (i) 1,608.5 1,073.6 1,526.2\nIncome tax provision (330.5) (154.5) (181.9)\nNet income 1,278.0 919.1 1,344.3\nNet loss attributable to noncontrolling interests (109.4) (13.1) (13.8)\nNet income attributable to Rockwell Automation $ 1,387.4 $ 932.2 $ 1,358.1\nDiluted EPS $ 11.95 $ 7.97 $ 11.58\nAdjusted EPS (3)\n$ 12.12 $ 9.49 $ 9.43\nDiluted weighted average outstanding shares 115.6 116.7 117.1\nPre-tax margin (i/d) 17.8 % 13.8 % 21.8 %\nIntelligent Devices segment operating margin (e/a) 20.2 % 20.2 % 21.2 %\nSoftware & Control segment operating margin (f/b) 33.0 % 28.8 % 27.3 %\nLifecycle Services segment operating margin (g/c) 7.2 % 8.3 % 9.1 %\nTotal segment operating margin (2) (h/d)\n21.3 % 19.9 % 19.9 %\n(1) See Note 19 in the Consolidated Financial Statements for the definition of segment operating earnings.\n(2) Total segment operating earnings and total segment operating margin are non-GAAP financial measures. We exclude purchase accounting depreciation and amortization, impairment, corporate and other, non-operating pension and postretirement benefit cost, change in fair value of investments, the $70 million legal settlement in fiscal 2021, interest expense, net, and income tax provision because we do not consider these items to be directly related to the operating performance of our segments. We believe total segment operating earnings and total segment operating margin are useful to investors as measures of operating performance. We use these measures to monitor and evaluate the profitability of our operating segments. Our measures of total segment operating earnings and total segment operating margin may be different from measures used by other companies.\n(3) Adjusted EPS is a non-GAAP earnings measure. See Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate Reconciliation for more information on this non-GAAP measure.\n2023 Compared to 2022\nSales\nSales in fiscal 2023 increased 16.7 percent compared to 2022. Organic sales increased 16.9 percent. Currency translation decreased sales by 1.4 percentage points. Acquisitions increased sales by 1.2 percentage points. Total and organic annual recurring revenue at September 30, 2023, grew approximately 16 percent compared to September 30, 2022. See Annual Recurring Revenue (ARR) for information on this measure. Pricing increased total company sales by approximately 5.5 percentage points, realized in the Intelligent Devices and Software & Control segments.\nThe table below presents our sales for the year ended September 30, 2023, attributed to the geographic regions based upon country of destination, and the percentage change from the same period in 2022 (in millions, except percentages). The results by region and segment were primarily impacted by the composition of backlog versus underlying demand.\nChange vs. Change in Organic\nSales (1) vs.\nYear Ended\nSeptember 30, 2023 Year Ended\nSeptember 30, 2022 Year Ended\nSeptember 30, 2022\nNorth America $ 5,224.0 10.6 % 10.8 %\nEurope, Middle East and Africa 1,870.6 30.1 % 27.9 %\nAsia Pacific 1,358.0 24.8 % 30.5 %\nLatin America 605.4 18.1 % 13.6 %\nTotal Company Sales $ 9,058.0 16.7 % 16.9 %\n(1) Organic sales and organic sales growth exclude the effect of acquisitions, changes in currency exchange rates, and divestitures. See Supplemental Sales Information for information on these non-GAAP measures.\nCorporate and Other\nCorporate and other expenses were $127.9 million in fiscal 2023 compared to $104.7 million in fiscal 2022. The increase was primarily due to the year over year impact of mark-to-market adjustments related to our deferred and non-qualified compensation plans.\nIncome before Income Taxes\nIncome before income taxes increased to $1,608.5 million in 2023 from $1,073.6 million in 2022. The increase was primarily due to higher sales and fair value adjustments in connection with our previous investment in PTC (the PTC adjustments), partially offset by a $157.5 million accounting charge for impairment of goodwill for our Sensia joint venture (goodwill impairment) recognized in 2023, compared to 2022. Total segment operating earnings increased to $1,929.8 million from $1,542.6 million in 2022, due to higher sales, partially offset by higher investment spend and higher incentive compensation.\nSee Critical Accounting Estimates and Note 3 in the Consolidated Financial Statements for further discussion of the goodwill impairment.\nIncome Taxes\nThe effective tax rate in 2023 was 20.5 percent compared to 14.4 percent in 2022. The increase in the effective tax rate was primarily due to a valuation allowance established on certain deferred tax assets of our Sensia joint venture and tax effects of the related goodwill impairment, totaling $33.1 million. The Adjusted Effective Tax Rate in 2023 was 16.4 percent compared to 16.0 percent in 2022.\nSee Note 16 in the Consolidated Financial Statements for a complete reconciliation of the United States statutory tax rate to the effective tax rate and additional information on tax events in 2023 and 2022 affecting each years respective tax rates.\nNet Loss Attributable to Noncontrolling Interests\nNet loss attributable to noncontrolling interests was $109.4 million in 2023 compared to $13.1 million in 2022. The increase was driven by $93.3 million of the accounting charge for goodwill impairment and related tax effects including tax asset valuation allowances that is attributable to noncontrolling interests.\nDiluted EPS and Adjusted EPS\nFiscal 2023 Net income attributable to Rockwell Automation was $1,387.4 million or $11.95 per share, compared to $932.2 million or $7.97 per share in fiscal 2022. The increases in Net income attributable to Rockwell Automation and diluted EPS were primarily due to higher total segment operating earnings and the PTC adjustments, partially offset by $97.3 million of expense for the goodwill impairment net of its related tax and noncontrolling interest effects. Adjusted EPS was $12.12 in fiscal 2023, up 27.7 percent compared to $9.49 in fiscal 2022, primarily due to higher sales, partially offset by higher investment spend and higher incentive compensation.\nIntelligent Devices\nSales\nIntelligent Devices sales increased 15.6 percent in 2023 compared to 2022. Organic sales increased 14.6 percent. The effects of currency translation decreased sales by 1.3 percentage points and acquisitions increased sales by 2.3 percentage points. All regions experienced reported and organic sales increases.\nSegment Operating Margin\nIntelligent Devices segment operating earnings increased 15.4 percent year over year. Segment operating margin was 20.2 percent in 2023, unchanged from a year ago.\nSoftware & Control\nSales\nSoftware & Control sales increased 24.8 percent in 2023 compared to 2022. Organic sales increased 26.1 percent. The effects of currency translation decreased sales by 1.3 percentage points. All regions experienced reported and organic sales increases.\nSegment Operating Margin\nSoftware & Control segment operating earnings increased 43.0 percent year over year. Segment operating margin increased to 33.0 percent in 2023 from 28.8 percent in 2022, primarily due to higher sales, partially offset by higher investment spend and higher incentive compensation.\nLifecycle Services\nSales\nLifecycle Services sales increased 9.0 percent in 2023 compared to 2022. Organic sales increased 10.0 percent. The effects of currency translation decreased sales by 1.6 percentage points and acquisitions increased sales by 0.6 percentage points. All regions experienced reported and organic sales increases.\nSegment Operating Margin\nLifecycle Services segment operating earnings decreased 6.3 percent year over year. Segment operating margin decreased to 7.2 percent in 2023 from 8.3 percent in 2022, as the benefit of higher sales was more than offset by higher incentive compensation costs and one-time expenses to expand future profitability.\n2022 Compared to 2021\nFor a discussion of the Companys fiscal 2022 results compared to fiscal 2021, see the Companys Annual Report on Form 10-K for the year ended September 30, 2022, filed on November 8, 2022.\nSupplemental Segment Information\nPurchase accounting depreciation and amortization, and impairment and non-operating pension and postretirement benefit cost (credit) are not allocated to our operating segments because these costs are excluded from our measurement of each segments operating performance for internal purposes. If we were to allocate these costs, we would attribute them to each of our segments as follows (in millions):\nYear Ended September 30,\n2023 2022 2021\nPurchase accounting depreciation and amortization, and impairment\nIntelligent Devices $ 4.7 $ 2.5 $ 2.7\nSoftware & Control 68.5 69.0 19.2\nLifecycle Services 190.2 31.4 32.1\nNon-operating pension and postretirement benefit cost (credit)\nIntelligent Devices $ 21.2 $ (3.5) $ 14.1\nSoftware & Control 21.2 (3.5) 14.1\nLifecycle Services 28.3 (4.8) 18.8\nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate Reconciliation\nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate are non-GAAP earnings measures that exclude non-operating pension and postretirement benefit cost, purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation, change in fair value of investments, and Net loss attributable to noncontrolling interests, including their respective tax effects. Purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation includes an accounting charge related to goodwill impairment for our Sensia joint venture. The tax effect of the purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation includes the tax effects on the Sensia joint venture goodwill impairment and related Sensia tax asset valuation allowances. Non-operating pension and postretirement benefit cost is defined as all components of our net periodic pension and postretirement benefit cost except for service cost. See Note 14 in the Consolidated Financial Statements for more information on our net periodic pension and postretirement benefit cost.\nWe believe that Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate provide useful information to our investors about our operating performance and allow management and investors to compare our operating performance period over period. Adjusted EPS is also used as a financial measure of performance for our annual incentive compensation. Our measures of Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate may be different from measures used by other companies. These non-GAAP measures should not be considered a substitute for Net income attributable to Rockwell Automation, diluted EPS, and effective tax rate.\nThe following are reconciliations of Net income attributable to Rockwell Automation, diluted EPS, and effective tax rate to Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate, respectively (in millions, except per share amounts and percentages):\nYear Ended September 30,\n2023 2022 2021\nNet income attributable to Rockwell Automation $ 1,387.4 $ 932.2 $ 1,358.1\nNon-operating pension and postretirement benefit cost 82.7 4.7 63.8\nTax effect of non-operating pension and postretirement benefit cost (20.6) (1.9) (16.0)\nPurchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation (1)\n178.3 91.9 43.2\nTax effect of purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation (1)\n(9.4) (22.3) (10.5)\nChange in fair value of investments (2)\n(279.3) 136.9 (397.4)\nTax effect of change in fair value of investments (2)\n67.6 (30.8) 64.7\nAdjusted Income $ 1,406.7 $ 1,110.7 $ 1,105.9\nDiluted EPS $ 11.95 $ 7.97 $ 11.58\nNon-operating pension and postretirement benefit cost 0.72 0.04 0.55\nTax effect of non-operating pension and postretirement benefit cost (0.18) (0.02) (0.14)\nPurchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation 1.54 0.78 0.37\nTax effect of purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation (0.08) (0.19) (0.09)\nChange in fair value of investments (2)\n(2.42) 1.17 (3.39)\nTax effect of change in fair value of investments (2)\n0.59 (0.26) 0.55\nAdjusted EPS $ 12.12 $ 9.49 $ 9.43\nEffective tax rate 20.5 % 14.4 % 11.9 %\nTax effect of non-operating pension and postretirement benefit cost 0.3 % 0.1 % 0.5 %\nTax effect of purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation (3.7) % 0.6 % 0.4 %\nTax effect of change in fair value of investments (2)\n(0.7) % 0.9 % (1.2) %\nAdjusted Effective Tax Rate 16.4 % 16.0 % 11.6 %\n(1) Includes $97.3 million net expense from $157.5 million goodwill impairment charge included in Income before income taxes, $33.1 tax effect from goodwill impairment and related valuation allowances recorded in Income tax provision, and ($93.3) million Net loss attributable to noncontrolling interests.\n(2) Primarily relates to the change in fair value of our previous investment in PTC.\nAnnual Recurring Revenue (ARR)\nOrganic ARR is a key metric that enables measurement of progress in growing our recurring revenue business. It represents the annual contract value of all active recurring revenue contracts at any point in time. Recurring revenue is defined as a revenue stream that is contractual, typically for a period of 12 months or more, and has a high probability of renewal. The probability of renewal is based on historical renewal experience of the individual revenue streams, or management's best estimates if historical renewal experience is not available. Organic ARR growth is calculated as the dollar change in ARR, adjusted to exclude the effects of currency translation and acquisitions, divided by ARR as of the prior period. The effects of currency translation are excluded by calculating Organic ARR on a constant currency basis. When we acquire businesses, we exclude the effect of ARR in the current period for which there was no comparable ARR in the prior period. We believe that Organic ARR provides useful information to investors because it reflects our recurring revenue performance period over period without the effect of acquisitions and changes in currency exchange rates. Organic ARR growth is also used as a financial measure of performance for our annual incentive compensation. Because ARR is based on annual contract value, it does not represent revenue recognized during a particular reporting period or revenue to be recognized in future reporting periods and is not intended to be a substitute for revenue, contract liabilities, or backlog.\nTotal ARR growth is calculated as the dollar change in ARR, adjusted to exclude the effects of currency. The effects of currency translation are excluded by calculating Total ARR on a constant currency basis. Total ARR includes acquisitions even if there was no comparable ARR in the prior period. We believe that Total ARR provides useful information to investors because it reflects our recurring revenue performance period over period including the effect of acquisitions.\nFinancial Condition\nThe following is a summary of our cash flows from operating, investing, and financing activities, as reflected in the Consolidated Statement of Cash Flows (in millions):\nYear Ended September 30,\n2023 2022 2021\nCash provided by (used for)\nOperating activities $ 1,374.6 $ 823.1 $ 1,261.0\nInvesting activities 854.3 (7.8) (2,626.6)\nFinancing activities (1,675.6) (934.2) 1,297.8\nEffect of exchange rate changes on cash 19.2 (52.6) 16.8\nIncrease (decrease) in cash, cash equivalents, and restricted cash $ 572.5 $ (171.5) $ (51.0)\nThe following table summarizes free cash flow, which is a non-GAAP financial measure (in millions):\nYear Ended September 30,\n2023 2022 2021\nCash provided by operating activities $ 1,374.6 $ 823.1 $ 1,261.0\nCapital expenditures (160.5) (141.1) (120.3)\nFree cash flow $ 1,214.1 $ 682.0 $ 1,140.7\nOur definition of free cash flow takes into consideration capital investments required to maintain the operations of our businesses and execute our strategy. Cash provided by operating activities adds back non-cash depreciation expense to earnings but does not reflect a charge for necessary capital expenditures. Our definition of free cash flow excludes the operating cash flows and capital expenditures related to our discontinued operations, if any. Operating, investing, and financing cash flows of our discontinued operations, if any, are presented separately in our Consolidated Statement of Cash Flows. In our opinion, free cash flow provides useful information to investors regarding our ability to generate cash from business operations that is available for acquisitions and other investments, service of debt principal, dividends, and share repurchases. We use free cash flow, as defined, as one measure to monitor and evaluate our performance, including as a financial measure for our annual incentive compensation. Our definition of free cash flow may be different from definitions used by other companies.\nCash provided by operating activities was $1,374.6 million for the year ended September 30, 2023, compared to $823.1 million for the year ended September 30, 2022. Free cash flow was $1,214.1 million for the year ended September 30, 2023, compared to $682.0 million for the year ended September 30, 2022. The year-over-year increases in cash provided by operating activities and free cash flow were primarily due to higher pre-tax income.\nAs of September 30, 2023, all of our remaining PTC Inc. (PTC) common stock (PTC Shares) have been sold. We began selling our shares in fiscal 2022 utilizing both open market and 10b5-1 plan transactions. As of September 30, 2023 and 2022, the fiscal year sales of our PTC shares under our 10b5-1 plan and open market sales resulted in a gross inflow of $1,210.4 million and $210.2 million, respectively. This excludes any tax liability related to the realized gain on sale of the investment. These proceeds will support our future uses of cash. All of our sales of PTC Shares are consistent with the transfer restrictions in the securities purchase agreement, as amended, with PTC.\nOur Short-term debt as of September 30, 2023 and 2022, includes $23.5 million and $42.3 million, respectively, of interest-bearing loans from SLB to Sensia, due December 29, 2023. In December 2022, Sensia entered into an unsecured $75.0 million line of credit. As of September 30, 2023, included in Short-term debt was $70.0 million borrowed against the line of credit with an interest rate of 6.29 percent. Also included in Short-term debt as of September 30, 2022 was commercial paper borrowings of $317.0 million with a weighted average interest rate of 3.03 percent and a weighted average maturity period of 22 days.\nWe repurchased approximately 1.2 million shares of our common stock under our share repurchase program in 2023 at a total cost of $311.0 million and an average cost of $265.48 per share. In 2022, we repurchased approximately 1.3 million shares of our common stock under our share repurchase program at a total cost of $301.1 million and an average cost of $223.05 per share. At September 30, 2023, there were $1.1 million of outstanding common stock share repurchases recorded in Accounts payable that did not settle until 2024. At September 30, 2022, there were $1.6 million of outstanding common stock share repurchases recorded in Accounts payable that did not settle until 2023. Our decision to repurchase shares in 2024 will depend on business conditions, free cash flow generation, other cash requirements, and stock price. At September 30, 2023, we had approximately $940.3 million remaining for share repurchases under our existing board authorizations. See Item 5. Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities, for additional information regarding share repurchases.\nWe expect future uses of cash to include working capital requirements, capital expenditures, acquisitions of businesses and other inorganic investments, dividends to shareowners, repurchases of common stock, additional contributions to our retirement plans and repayments of debt. We expect capital expenditures in 2024 to be approximately $220 million. Significant long-term uses of cash include the following (in millions):\nPayments by Period\nTotal 2024 2025 2026 2027 2028 Thereafter\nLong-term debt and interest (1)\n$ 5,229.1 $ 110.9 $ 406.6 $ 102.3 $ 102.3 $ 343.9 $ 4,163.1\nMinimum lease payments (Note 18) 409.6 100.5 86.3 64.4 49.1 35.4 73.9\nPostretirement benefits (2)\n46.4 7.3 6.8 6.2 5.6 5.0 15.5\nPension funding contribution (3)\n26.6 26.6 - - - - -\nTransition tax (4)\n233.7 58.4 77.9 97.4 - - -\nCapital gains tax on sale of PTC Shares 67.4 67.4 - - - - -\nTotal $ 5,945.4 $ 303.7 $ 577.6 $ 270.3 $ 157.0 $ 384.3 $ 4,252.5\n(1) The amounts for Long-term debt assume that the respective debt instruments will be outstanding until their scheduled maturity dates and include interest but exclude unamortized discount. See Note 7 in the Consolidated Financial Statements for more information regarding our Long-term debt.\n(2) Our postretirement benefit plans are unfunded and are subject to change. Amounts reported are estimates of future benefit payments, to the extent estimable.\n(3) Amounts reported for pension funding contributions reflect current estimates. Contributions to our pension plans beyond 2024 will depend on future investment performance of our pension plan assets, changes in discount rate assumptions, and governmental regulations in effect at the time. Amounts subsequent to 2024 are excluded from the summary above, as we are unable to make a reasonably reliable estimate of these amounts. The minimum contribution for our U.S. pension plan as required by the Employee Retirement Income Security Act (ERISA) is currently zero. We may make additional contributions to this plan at the discretion of management.\n(4) Under the Tax Cuts and Jobs Act of 2017 (the Tax Act), the Company may elect to pay the transition tax interest-free over eight years, with 8% due in each of the first five years, 15% in year six, 20% in year seven, and 25% in year eight.\nWe expect to fund future uses of cash with a combination of existing cash balances, cash generated by operating activities, commercial paper borrowings, or a new issuance of debt or other securities. In addition, we have access to unsecured credit facilities with various banks.\nAt September 30, 2023, approximately half of our Cash and cash equivalents were held by non-U.S. subsidiaries. As a result of the broad changes to the U.S. international tax system under the Tax Act, we account for taxes on earnings of substantially all of our non-U.S. subsidiaries including both non-U.S. and U.S. taxes. We have concluded that earnings of a limited number of our non-U.S. subsidiaries are indefinitely reinvested.\nIn August 2021, we issued $1.5 billion aggregate principal amount of long-term notes in a registered public offering. The offering consisted of $600.0 million of 0.35% notes due in August 2023, $450.0 million of 1.75% notes due in August 2031, and $450.0 million of 2.80% notes due in August 2061, all issued at a discount. Net proceeds to the Company from the debt offering were $1,485.6 million. We used these net proceeds primarily to fund the acquisition of Plex. Refer to Note 4 in the Consolidated Financial Statements for additional information on this acquisition.\nIn March 2019, we issued $1.0 billion aggregate principal amount of long-term notes in a registered public offering. The offering consisted of $425.0 million of 3.50% notes due in March 2029 and $575.0 million of 4.20% notes due in March 2049, both issued at a discount. Net proceeds to the Company from the debt offering were $987.6 million. We used these net proceeds primarily to repay our outstanding commercial paper, with the remaining proceeds used for general corporate purposes.\nWe entered into treasury locks to manage the potential change in interest rates in anticipation of the issuance of the $1.5 billion aggregate notes in August 2021 and the $1.0 billion of fixed rate debt in March 2019. These treasury locks were designated as and accounted for as cash flow hedges. The effective differentials paid on these treasury locks was initially recorded in Accumulated other comprehensive loss, net of tax effect. As a result of the changes in the interest rates on the treasury locks between the time we entered into the treasury locks and the time we priced and issued the notes, the Company made a net payment of $28.0 million to the counterparties from the August 2021 issuance and $35.7 million to the counterparty from the March 2019 issuance. The $28.0 million and $35.7 million net losses on the settlement of the treasury locks were recorded in Accumulated other comprehensive loss, net of tax effect, and are being amortized over the term of the corresponding notes, and recognized as an adjustment to Interest expense in the Consolidated Statement of Operations.\nOn June 29, 2022, we replaced our former $1.25 billion unsecured revolving credit facility with a new five-year $1.5 billion unsecured revolving credit facility, expiring in June 2027. We can increase the aggregate amount of this credit facility by up to $750.0 million, subject to the consent of the banks in the credit facility. We did not borrow against this credit facility or the former credit facility during the periods ended September 30, 2023 and 2022. Borrowings under our new $1.5 billion credit facility bear interest based on short-term money market rates in effect during the period the borrowings are outstanding. The terms of this credit facility contain covenants under which we agree to maintain an EBITDA-to-interest ratio of at least 3.0 to 1.0. The EBITDA-to-interest ratio is defined in the credit facility as the ratio of consolidated EBITDA (as defined in the facility) for the preceding four quarters to consolidated interest expense for the same period.\nLIBOR was the primary basis for determining interest payments on borrowings under our former $1.25 billion credit facility. Our new $1.5 billion credit facility uses the secured overnight funding rate (SOFR) as the primary basis for determining interest payments.\nAmong other uses, we can draw on our credit facility as a standby liquidity facility to repay our outstanding commercial paper as it matures. This access to funds to repay maturing commercial paper is an important factor in maintaining the short-term credit ratings set forth in the table below. Under our current policy with respect to these ratings, we expect to limit our other borrowings under our credit facility, if any, to amounts that would leave enough credit available under the facility so that we could borrow, if needed, to repay all of our then outstanding commercial paper as it matures.\nSeparate short-term unsecured credit facilities of approximately $225.8 million at September 30, 2023, were available to non-U.S. subsidiaries, of which approximately $32.0 million was committed under letters of credit. Borrowings under our non-U.S. credit facilities at September 30, 2023 and 2022, were not significant. We were in compliance with all covenants under our credit facilities at September 30, 2023 and 2022. There are no significant commitment fees or compensating balance requirements under our credit facilities.\nDuring the fourth quarter of fiscal 2021, as a result of the additional leverage added to fund the Plex acquisition, Standard & Poors elected to downgrade our Outlook from Stable to Negative. No changes were made to existing ratings by Moodys or Fitch. The following is a summary of our credit ratings as of September 30, 2023:\nCredit Rating Agency Short Term Rating Long Term Rating Outlook\nStandard & Poors A-1 A Negative\nMoodys P-2 A3 Stable\nFitch Ratings A Stable\nOur ability to access the commercial paper market, and the related costs of these borrowings, is affected by the strength of our credit ratings and market conditions. We have not experienced any difficulty in accessing the commercial paper market. If our access to the commercial paper market is adversely affected due to a change in market conditions or otherwise, we would expect to rely on a combination of available cash and our unsecured committed credit facility to provide short-term funding. In such event, the cost of borrowings under our unsecured committed credit facility could be higher than the cost of commercial paper borrowings.\nWe regularly monitor the third-party depository institutions that hold our cash and cash equivalents and short-term investments. We diversify our cash and cash equivalents and short-term investments among counterparties to minimize exposure to any one of these entities.\nWe use foreign currency forward exchange contracts to manage certain foreign currency risks. We enter into these contracts to hedge our exposure to foreign currency exchange rate variability in the expected future cash flows associated with certain third-party and intercompany transactions denominated in foreign currencies forecasted to occur within the next two years. We also use these contracts to hedge portions of our net investments in certain non-U.S. subsidiaries against the effect of exchange rate fluctuations on the translation of foreign currency balances to the U.S. dollar. In addition, we use foreign currency forward exchange contracts that are not designated as hedges to offset transaction gains or losses associated with some of our assets and liabilities resulting from intercompany loans or other transactions with third parties that are denominated in currencies other than our entities functional currencies. Our foreign currency forward exchange contracts are usually denominated in currencies of major industrial countries. We diversify our foreign currency forward exchange contracts among counterparties to minimize exposure to any one of these entities.\nCash dividends declared to shareowners were $544.0 million in 2023 ($4.72 per common share), $520.8 million in 2022 ($4.48 per common share), and $497.5 million in 2021 ($4.28 per common share). Our quarterly dividend rate as of September 30, 2023, is $1.18 per common share ($4.72 per common share annually), which is determined at the sole discretion of our Board of Directors.\nSupplemental Sales Information\nWe translate sales of subsidiaries operating outside of the United States using exchange rates effective during the respective period. Therefore, changes in currency exchange rates affect our reported sales. Sales by acquired businesses also affect our reported sales. We believe that organic sales, defined as sales excluding the effects of acquisitions and changes in currency exchange rates, which is a non-GAAP financial measure, provides useful information to investors because it reflects regional and operating segment performance from the activities of our businesses without the effect of acquisitions and changes in currency exchange rates. We use organic sales as one measure to monitor and evaluate our regional and operating segment performance. When we acquire businesses, we exclude sales in the current period for which there are no comparable sales in the prior period. We determine the effect of changes in currency exchange rates by translating the respective periods sales using the same currency exchange rates that were in effect during the prior year. When we divest a business, we exclude sales in the prior period for which there are no comparable sales in the current period. Organic sales growth is calculated by comparing organic sales to reported sales in the prior year, excluding divestitures. We attribute sales to the geographic regions based on the country of destination.\nThe following is a reconciliation of reported sales to organic sales by geographic region (in millions):\nYear Ended September 30, 2023 Year Ended September 30, 2022\nReported Sales Less: Effect of\nAcquisitions Effect of\nChanges in\nCurrency Organic\nSales Reported Sales\nNorth America $ 5,224.0 $ 15.6 $ (23.9) $ 5,232.3 $ 4,722.0\nEurope, Middle East and Africa 1,870.6 57.5 (26.3) 1,839.4 1,437.6\nAsia Pacific 1,358.0 18.2 (80.5) 1,420.3 1,088.0\nLatin America 605.4 0.1 22.8 582.5 512.8\nTotal Company Sales $ 9,058.0 $ 91.4 $ (107.9) $ 9,074.5 $ 7,760.4\nYear Ended September 30, 2022 Year Ended September 30, 2021\nReported Sales Less: Effect of\nAcquisitions Effect of\nChanges in\nCurrency Organic\nSales Reported Sales\nNorth America $ 4,722.0 $ 152.0 $ (6.5) $ 4,576.5 $ 4,132.8\nEurope, Middle East and Africa 1,437.6 6.8 (140.5) 1,571.3 1,405.7\nAsia Pacific 1,088.0 0.4 (34.4) 1,122.0 1,012.2\nLatin America 512.8 2.3 (6.6) 517.1 446.7\nTotal Company Sales $ 7,760.4 $ 161.5 $ (188.0) $ 7,786.9 $ 6,997.4\nThe following is a reconciliation of reported sales to organic sales by operating segment (in millions):\nYear Ended September 30, 2023 Year Ended September 30, 2022\nReported Sales Less: Effect of\nAcquisitions Effect of\nChanges in\nCurrency Organic\nSales Reported Sales\nIntelligent Devices $ 4,098.2 $ 80.6 $ (46.4) $ 4,064.0 $ 3,544.6\nSoftware & Control 2,886.0 - (30.7) 2,916.7 2,312.9\nLifecycle Services 2,073.8 10.8 (30.8) 2,093.8 1,902.9\nTotal Company Sales $ 9,058.0 $ 91.4 $ (107.9) $ 9,074.5 $ 7,760.4\nYear Ended September 30, 2022 Year Ended September 30, 2021\nReported Sales Less: Effect of\nAcquisitions Effect of\nChanges in\nCurrency Organic\nSales Reported Sales\nIntelligent Devices $ 3,544.6 $ - $ (89.8) $ 3,634.4 $ 3,311.9\nSoftware & Control 2,312.9 150.6 (52.7) 2,215.0 1,947.0\nLifecycle Services 1,902.9 10.9 (45.5) 1,937.5 1,738.5\nTotal Company Sales $ 7,760.4 $ 161.5 $ (188.0) $ 7,786.9 $ 6,997.4\nCritical Accounting Estimates\nWe believe the following accounting estimates are the most critical to the understanding of our financial statements as they could have the most significant effect on our reported results and require subjective or complex judgments by management. Accounting principles generally accepted in the United States require us to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the consolidated financial statements and revenues and expenses during the periods reported. These estimates are based on our best judgment about current and future conditions, but actual results could differ from those estimates. Refer to Note 1 in the Consolidated Financial Statements for information regarding our significant accounting policies.\nGoodwill - Sensia Reporting Unit\nThe quantitative test of goodwill for impairment requires us to estimate the fair value of our reporting units. Since formation in October 2019, our Sensia joint venture operations have been challenged by the global pandemic, geopolitical activities, volatility in commodity prices, and supply chain dynamics. The cumulative historical growth and profitability below plan have resulted in a declining cushion between carrying value and fair value in previous impairment tests.\nDuring the second quarter of fiscal 2023, we performed our annual quantitative impairment test for our Sensia reporting unit. As a result of that quantitative test, we concluded that the second quarter Goodwill balance within the Sensia reporting unit of $317.5 million was not impaired, as the fair value of the Sensia reporting unit was determined to exceed its carrying value by approximately 10 percent.\nThe joint venture partners appointed a new management team in 2023 and have updated the strategy of Sensia, which included downward revisions to growth and profitability projections for 2024 and future years. Lower sales growth reflects historical performance and an updated outlook of market conditions. Lower profitability reflects an updated view of mix and volume. Based upon the update of Sensias strategy and projections in the fourth quarter, we determined that it was more likely than not that the fair value of Sensia was below its carrying value. As a result of this triggering event, we performed an interim quantitative analysis, using a combination of an income approach derived from discounted cash flows and a market multiples approach using selected comparable public companies, consistent with our annual impairment testing. As of the fourth quarter testing date, the carrying value of our Sensia reporting unit of $665.1 million was determined to be in excess of the reporting units fair value, resulting in a $157.5 million goodwill impairment charge recorded in the Consolidated Statement of Operations. Subsequent to the impairment, $160.3 million of goodwill remains within the Sensia reporting unit.\nCritical assumptions used in this approach included managements estimated future revenue growth rates and margins, a discount rate, and a market multiple. Estimated future revenue growth and margins are based on managements best estimate about current and future conditions. The revenue growth rate assumption reflects above market growth over the next five years before moderating back to a growth rate approximating longer term average inflationary rates. The forecasted near-term growth rate projections take into account recent revenue performance and the orders backlog. Margin assumptions reflect volume and mix, productivity to offset cost inflation, and price used to fund investments. The assumptions and estimates made are based on a number of factors, including historical experience, reference to external product available market and industry growth publications, analysis of peer group projections, and information obtained from the new management team, including backlog. Actual results and forecasts of revenue growth and margins for our Sensia reporting unit may be impacted by its concentration within the Oil & Gas industry and with its customer base. Demand for Sensia hardware and software products, solutions, and services is sensitive to industry volatility and risks, including those related to commodity prices, supply and demand dynamics, production costs, geological activity, and political activities. If such factors impact our ability to achieve forecasted revenue growth rates and margins, the fair value of the reporting unit could decrease, which may result in an additional impairment of the remaining goodwill balance. We determined the discount rate using our weighted average cost of capital adjusted for risk factors including risk associated with our above market revenue growth assumptions, historical performance, and industry-specific and economic factors. Also, industry-specific and economic factors that increase the discount rate or decrease the market multiple can decrease the fair value of the Sensia reporting unit, which may result in an additional future impairment.\nMore information regarding goodwill impairment testing is contained in Note 1 and Note 3 in the Consolidated Financial Statements.\nRetirement Benefits - Pension\nPension costs and obligations are actuarially determined and are influenced by assumptions used to estimate these amounts, including the discount rate. Changes in any of the assumptions and the amortization of differences between the assumptions and actual experience will affect the amount of pension expense in future periods.\nOur global pension expense in 2023 was $122.0 million compared to $74.4 million in 2022. Approximately all of our 2023 global pension expense and 70 percent of our global projected benefit obligation relate to our U.S. pension plan. The discount rate used to determine our 2023 U.S. pension expense was 5.65 percent, compared to 3.86 percent for 2022.\nFor 2024, our U.S. discount rate will increase to 6.10 percent from 5.65 percent in 2023. The discount rate was set as of our September 30 measurement date and was determined by modeling a portfolio of bonds that match the expected cash flow of our benefit plans.\nThe changes in our discount rate have an inverse relationship with our net periodic benefit cost and projected benefit obligation. The following chart illustrates the estimated change in projected benefit obligation and annual net periodic benefit cost assuming a change of 25 basis points in the discount rate for our U.S. pension plans (in millions):\nPension Benefits\nChange in\nProjected Benefit\nObligation Change in Net Periodic Benefit Cost (1)\nDiscount rate $ 52.4 $ 0.2\n(1) Change includes both operating and non-operating pension costs.\nMore information regarding pension benefits is contained in Note 14 in the Consolidated Financial Statements.\nRevenue Recognition - Customer Incentives\nWe offer various incentive programs that provide distributors and direct sale customers with cash rebates, account credits, or additional hardware and software products, solutions, and services based on meeting specified program criteria. Customer incentives are recognized as a reduction of sales if distributed in cash or customer account credits. We record accruals at the time of revenue recognition as a current liability within Customer returns, rebates, and incentives in our Consolidated Balance Sheet or, where a right of setoff exists, as a reduction of Receivables. Customer incentives for additional hardware and software products, solutions, and services to be provided are considered distinct performance obligations. As such, we allocate revenue to them based on relative standalone selling price. Until the incentive is redeemed, the revenue is recorded as a contract liability.\nOur primary incentive program provides distributors with cash rebates or account credits based on agreed amounts that vary depending on the customer to whom our distributor ultimately sells the product. A critical assumption used in estimating the accrual for this program is the time period from when revenue is recognized to when the rebate is processed. Our estimate is based primarily on historical experience. If the time period were to change by 10 percent, the effect would be an adjustment to the accrual of approximately $24.9 million.\nMore information regarding our revenue recognition and returns, rebates, and incentives policies are contained in Note 1 and Note 2 in the Consolidated Financial Statements.\nAcquisitions - Plex Intangible Assets Valuation\nWe account for business acquisitions by allocating the purchase price to tangible and intangible assets acquired and liabilities assumed at their fair values; the excess of the purchase price over the allocated amount is recorded as goodwill. We engaged an independent third-party valuation specialist to assist with the fair value allocation of the purchase price paid for the acquisition of Plex to intangible assets. This required the use of several assumptions and estimates including the customer attrition rate, forecasted cash flows attributable to existing customers, and the discount rate for the customer relationship intangible asset and the royalty rate, forecasted revenue growth rates, and the discount rate for the technology intangible asset. Although we believe the assumptions and estimates made were reasonable and appropriate, these estimates require judgment and are based in part on historical experience and information obtained from Plex management.\nThe key assumption requiring the use of judgement in the valuation of the customer relationship intangible asset was the customer attrition rate of 5 percent. This rate was selected based on historical experience and information obtained from Plex management. A change in the customer attrition rate of 250 basis points would result in a change of $63 million in intangible assets. The key assumptions requiring the use of judgement in the valuation of the technology intangible asset were the royalty rate of 25 percent and the obsolescence factor. The royalty rate was based on a detailed analysis considering the importance of the technology to the overall enterprise and market royalty data. A change in the royalty rate of 500 basis points would result in a change of $47 million in intangible assets. The obsolescence factor was calculated assuming phase out over ten years based on discussions with Plex management, the nature of the technology, its integration into customers manufacturing systems, and other third-party information for similar transactions. A two-year change in this assumption would result in a change of $52 million in intangible assets.\nMore information regarding this business combination is contained in Note 4 in the Consolidated Financial Statements.\nRecent Accounting Pronouncements\nSee Note 1 in the Consolidated Financial Statements regarding recent accounting pronouncements. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are exposed to market risk during the normal course of business from changes in foreign currency exchange rates and interest rates. We manage exposure to these risks through a combination of normal operating and financing activities as well as derivative financial instruments in the form of foreign currency forward exchange contracts.\nForeign Currency Risk\nWe are exposed to foreign currency risks that arise from normal business operations. These risks include the translation of local currency balances of foreign subsidiaries, transaction gains and losses associated with intercompany loans with foreign subsidiaries, and transactions denominated in currencies other than a locations functional currency. Our objective is to minimize our exposure to these risks through a combination of normal operating activities and the use of foreign currency forward exchange contracts. Contracts are usually denominated in currencies of major industrial countries. The fair value of our foreign currency forward exchange contracts is an asset of $49.2 million and a liability of $11.5 million at September 30, 2023. We enter into these contracts with major financial institutions that we believe to be creditworthy.\nWe do not enter into derivative financial instruments for speculative purposes. The strengthening of the U.S. dollar against foreign currencies has an unfavorable impact on our sales and results of operations. While future changes in foreign currency exchange rates are difficult to predict, our sales and profitability may be adversely affected if the U.S. dollar strengthens relative to current levels.\nCertain of our locations have assets and liabilities denominated in currencies other than their functional currencies. We enter into foreign currency forward exchange contracts to offset the transaction gains or losses associated with some of these assets and liabilities. For such assets and liabilities without offsetting foreign currency forward exchange contracts, a 10 percent adverse change in the underlying foreign currency exchange rates would reduce our pre-tax income by approximately $73.9 million.\nWe record all derivatives on the balance sheet at fair value regardless of the purpose for holding them. The use of foreign currency forward exchange contracts allows us to manage transactional exposure to exchange rate fluctuations as the gains or losses incurred on these contracts will offset, in whole or in part, losses or gains on the underlying foreign currency exposure. Derivatives that are not designated as hedges for accounting purposes are adjusted to fair value through earnings. For derivatives that are hedges, depending on the nature of the hedge, changes in fair value are either offset by changes in the fair value of the hedged assets, liabilities, or firm commitments through earnings or recognized in Other comprehensive income (loss) until the hedged item is recognized in earnings. We recognize the ineffective portion of a derivatives change in fair value in earnings immediately. There was no impact on earnings due to ineffective hedges in 2023, 2022, or 2021. A hypothetical 10 percent adverse change in underlying foreign currency exchange rates associated with the hedged exposures and related contracts would not be significant to our financial condition or results of operations.\nInterest Rate Risk\nIn addition to existing cash balances and cash provided by normal operating activities, we use a combination of short-term and long-term debt to finance operations. We are exposed to interest rate risk on certain of these debt obligations.\nOur Short-term debt as of September 30, 2023 and 2022, includes $23.5 million and $42.3 million, respectively, of interest-bearing loans from SLB to Sensia, due December 29, 2023. In December 2022, Sensia entered into an unsecured $75.0 million line of credit. As of September 30, 2023, included in Short-term debt was $70.0 million borrowed against the line of credit with an interest rate of 6.29 percent. Also included in Short-term debt as of September 30, 2022 was commercial paper borrowings of $317.0 million with a weighted average interest rate of 3.03 percent and a weighted average maturity period of 22 days. We have issued, and anticipate continuing to issue, short-term commercial paper obligations as needed. Changes in market interest rates on commercial paper borrowings affect our results of operations. A hypothetical 50 basis point increase in average market interest rates related to our short-term debt would not be significant to our results of operations or financial condition.\nWe had outstanding fixed rate long-term and current portion of long-term debt obligations with a carrying value of $2,871.5 million at September 30, 2023, and $3,476.9 million at September 30, 2022. The fair value of this debt was approximately $2,456.0 million at September 30, 2023, and $3,074.5 million at September 30, 2022. The potential increase in fair value on such fixed-rate debt obligations from a hypothetical 50 basis point decrease in market interest rates would not be significant to our results of operations or financial condition. We currently have no plans to repurchase our outstanding fixed-rate instruments before their maturity and, therefore, fluctuations in market interest rates would not have an effect on our results of operations or shareowners equity. Item 8. Financial Statements and Supplementary Data\nCONSOLIDATED BALANCE SHEET\n(in millions, except per share amounts)\nSeptember 30,\n2023 2022\nASSETS\nCurrent assets\nCash and cash equivalents $ 1,071.8 $ 490.7\nReceivables 2,167.4 1,736.7\nInventories 1,404.9 1,054.2\nOther current assets 266.7 329.1\nTotal current assets 4,910.8 3,610.7\nProperty, net of accumulated depreciation 684.2 586.5\nOperating lease right-of-use assets 349.4 321.0\nGoodwill 3,529.2 3,524.0\nOther intangible assets, net 852.4 902.0\nDeferred income taxes 459.3 384.3\nLong-term investments 157.1 1,056.0\nOther assets 361.6 374.2\nTotal $ 11,304.0 $ 10,758.7\nLIABILITIES AND SHAREOWNERS EQUITY\nCurrent liabilities\nShort-term debt $ 94.7 $ 359.3\nCurrent portion of long-term debt 8.6 609.1\nAccounts payable 1,150.2 1,028.0\nCompensation and benefits 499.9 292.7\nContract liabilities 592.5 507.0\nCustomer returns, rebates, and incentives 452.0 373.1\nOther current liabilities 567.4 403.0\nTotal current liabilities 3,365.3 3,572.2\nLong-term debt 2,862.9 2,867.8\nRetirement benefits 503.6 471.2\nOperating lease liabilities 285.3 263.5\nOther liabilities 543.5 567.3\nCommitments and contingent liabilities (Note 17)\nShareowners equity\nCommon stock ($1.00 par value, shares issued: 181.4)\n181.4 181.4\nAdditional paid-in capital 2,102.5 2,007.1\nRetained earnings 9,255.2 8,411.8\nAccumulated other comprehensive loss (790.1) (917.5)\nCommon stock in treasury, at cost (shares held: 66.6 and 66.2, respectively)\n(7,187.4) (6,957.2)\nShareowners equity attributable to Rockwell Automation, Inc. 3,561.6 2,725.6\nNoncontrolling interests 181.8 291.1\nTotal shareowners equity 3,743.4 3,016.7\nTotal $ 11,304.0 $ 10,758.7\nSee Notes to Consolidated Financial Statements.\nCONSOLIDATED STATEMENT OF OPERATIONS\n(in millions, except per share amounts)\nYear Ended September 30,\n2023 2022 2021\nSales\nProducts and solutions $ 8,224.9 $ 6,993.4 $ 6,285.2\nServices 833.1 767.0 712.2\n9,058.0 7,760.4 6,997.4\nCost of sales\nProducts and solutions (4,808.7) (4,173.4) (3,638.7)\nServices (532.3) (485.0) (461.0)\n(5,341.0) (4,658.4) (4,099.7)\nGross profit 3,717.0 3,102.0 2,897.7\nSelling, general and administrative expenses (2,023.7) (1,766.7) (1,680.0)\nChange in fair value of investments 279.3 (136.9) 397.4\nOther (expense) income (Note 15) (71.3) (1.6) 5.7\nGoodwill impairment (157.5) - -\nInterest expense (135.3) (123.2) (94.6)\nIncome before income taxes 1,608.5 1,073.6 1,526.2\nIncome tax provision (Note 16) (330.5) (154.5) (181.9)\nNet income 1,278.0 919.1 1,344.3\nNet loss attributable to noncontrolling interests (109.4) (13.1) (13.8)\nNet income attributable to Rockwell Automation, Inc. $ 1,387.4 $ 932.2 $ 1,358.1\nEarnings per share:\nBasic $ 12.03 $ 8.02 $ 11.69\nDiluted $ 11.95 $ 7.97 $ 11.58\nWeighted average outstanding shares:\nBasic 114.8 115.9 116.0\nDiluted 115.6 116.7 117.1\nSee Notes to Consolidated Financial Statements.\nCONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME\n(in millions)\nYear Ended September 30,\n2023 2022 2021\nNet income $ 1,278.0 $ 919.1 $ 1,344.3\nOther comprehensive income (loss)\nPension and other postretirement benefit plan adjustments (net of tax expense of ($15.4), ($76.0), and ($181.0))\n41.5 246.5 576.4\nCurrency translation adjustments 99.4 (185.4) 31.4\nNet change in cash flow hedges (net of tax benefit (expense) of $5.3, $(14.3), and $3.1)\n(13.4) 38.2 (11.4)\nOther comprehensive income 127.5 99.3 596.4\nComprehensive income 1,405.5 1,018.4 1,940.7\nComprehensive loss attributable to noncontrolling interests (109.3) (13.4) (14.5)\nComprehensive income attributable to Rockwell Automation, Inc. $ 1,514.8 $ 1,031.8 $ 1,955.2\nSee Notes to Consolidated Financial Statements.\nCONSOLIDATED STATEMENT OF CASH FLOWS\n(in millions)\nYear Ended September 30,\n2023 2022 2021\nOperating activities:\nNet income $ 1,278.0 $ 919.1 $ 1,344.3\nAdjustments to arrive at cash provided by operating activities\nDepreciation 133.8 126.6 123.9\nAmortization of intangible assets 116.6 112.3 65.9\nChange in fair value of investments (279.3) 136.9 (397.4)\nShare-based compensation expense 88.3 68.1 51.7\nRetirement benefit expense 125.3 76.4 155.1\nPension contributions (25.9) (53.6) (35.8)\nDeferred income taxes (100.1) (33.6) (184.1)\nNet loss on disposition of property 0.5 0.6 0.5\nSettlement of interest rate derivatives - - (28.0)\nImpairment of goodwill 157.5 - -\nChanges in assets and liabilities, excluding effects of acquisitions and foreign currency adjustments\nReceivables (368.7) (415.6) (138.1)\nInventories (295.9) (292.8) (202.8)\nAccounts payable 70.2 172.0 184.8\nContract liabilities 106.8 102.0 104.4\nCompensation and benefits 209.1 (78.2) 174.6\nIncome taxes 104.1 (129.3) 57.2\nOther assets and liabilities 54.3 112.2 (15.2)\nCash provided by operating activities 1,374.6 823.1 1,261.0\nInvesting activities:\nCapital expenditures (160.5) (141.1) (120.3)\nAcquisition of businesses, net of cash acquired (168.4) (16.6) (2,488.5)\nPurchases of investments (27.1) (59.8) (13.6)\nProceeds from sale of investments 1,210.4 210.2 -\nOther investing activities (0.1) (0.5) (4.2)\nCash provided by (used for) investing activities 854.3 (7.8) (2,626.6)\nFinancing activities:\nNet (repayment) issuance of short-term debt (256.9) 40.8 275.9\nIssuance of short-term debt, net of issuance costs - 18.8 211.4\nIssuance of long-term debt, net of discount and issuance costs - - 1,485.6\nRepayment of short-term debt (18.8) (210.0) (2.5)\nRepayment of long-term debt (599.8) - -\nCash dividends (542.4) (519.4) (497.1)\nPurchases of treasury stock (311.5) (301.3) (299.7)\nProceeds from the exercise of stock options 88.5 57.9 154.6\nOther financing activities (34.7) (21.0) (30.4)\nCash (used for) provided by financing activities (1,675.6) (934.2) 1,297.8\nEffect of exchange rate changes on cash 19.2 (52.6) 16.8\nIncrease (decrease) in cash, cash equivalents, and restricted cash 572.5 (171.5) (51.0)\nCash, cash equivalents, and restricted cash at beginning of year 507.9 679.4 730.4\nCash, cash equivalents, and restricted cash at end of year $ 1,080.4 $ 507.9 $ 679.4\nComponents of cash, cash equivalents, and restricted cash\nCash and cash equivalents $ 1,071.8 $ 490.7 $ 662.2\nRestricted cash, current (Other current assets) 8.6 8.6 -\nRestricted cash, noncurrent (Other assets) - 8.6 17.2\nTotal cash, cash equivalents, and restricted cash $ 1,080.4 $ 507.9 $ 679.4\nSee Notes to Consolidated Financial Statements.\nCONSOLIDATED STATEMENT OF SHAREOWNERS EQUITY\n(in millions, except per share amounts)\nCommon stock Additional paid-in capital Retained earnings Accumulated other comprehensive loss Common stock in treasury, at cost Total attributable to Rockwell Automation, Inc. Noncontrolling interests Total shareowners equity\nBalance at September 30, 2020\n$ 181.4 $ 1,830.7 $ 7,139.8 $ (1,614.2) $ (6,509.9) $ 1,027.8 $ 319.0 $ 1,346.8\nNet income (loss) - - 1,358.1 - - 1,358.1 (13.8) 1,344.3\nOther comprehensive income (loss) - - - 597.1 - 597.1 (0.7) 596.4\nCommon stock issued (including share-based compensation impact) - 103.5 - - 102.7 206.2 - 206.2\nShare repurchases - - - - (301.5) (301.5) - (301.5)\nCash dividends declared (1)\n- - (497.5) - - (497.5) - (497.5)\nChange in noncontrolling interest (0.6) (0.6) - (0.6)\nBalance at September 30, 2021\n$ 181.4 $ 1,933.6 $ 8,000.4 $ (1,017.1) $ (6,708.7) $ 2,389.6 $ 304.5 $ 2,694.1\nNet income (loss) - - 932.2 - - 932.2 (13.1) 919.1\nOther comprehensive income (loss) - - - 99.6 - 99.6 (0.3) 99.3\nCommon stock issued (including share-based compensation impact) - 73.5 - - 52.6 126.1 - 126.1\nShare repurchases - - - - (301.1) (301.1) - (301.1)\nCash dividends declared (1)\n- - (520.8) - - (520.8) - (520.8)\nBalance at September 30, 2022\n$ 181.4 $ 2,007.1 $ 8,411.8 $ (917.5) $ (6,957.2) $ 2,725.6 $ 291.1 $ 3,016.7\nNet income (loss) - - 1,387.4 - - 1,387.4 (109.4) 1,278.0\nOther comprehensive income - - - 127.4 - 127.4 0.1 127.5\nCommon stock issued (including share-based compensation impact) - 95.4 - - 81.8 177.2 - 177.2\nShare repurchases - - - - (312.0) (312.0) - (312.0)\nCash dividends declared (1)\n- - (544.0) - - (544.0) - (544.0)\nBalance at September 30, 2023\n$ 181.4 $ 2,102.5 $ 9,255.2 $ (790.1) $ (7,187.4) $ 3,561.6 $ 181.8 $ 3,743.4\n(1) Cash dividends were $4.72 per share in 2023; $4.48 per share in 2022; and $4.28 per share in 2021.\nSee Notes to Consolidated Financial Statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. Basis of Presentation and Accounting Policies\nRockwell Automation, Inc. (Rockwell Automation or the Company) is the worlds largest company dedicated to industrial automation and digital transformation. We understand and simplify our customers complex production challenges and deliver the most valued solutions that combine technology and industry expertise.\nBasis of Presentation\nOur consolidated financial statements are prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts of the Company and its wholly-owned and controlled majority-owned subsidiaries. Intercompany accounts and transactions have been eliminated in consolidation. Investments in affiliates over which we do not have control but exercise significant influence are accounted for using the equity method of accounting. These affiliated companies are not material individually or in the aggregate to our financial position, results of operations, or cash flows.\nUse of Estimates\nThe preparation of consolidated financial statements in accordance with U.S. GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the consolidated financial statements and revenues and expenses during the periods reported. Actual results could differ from those estimates. We use estimates in accounting for, among other items, customer returns, rebates, and incentives; allowance for doubtful accounts; excess and obsolete inventory; share-based compensation; acquisitions, including consolidation and intangible assets; goodwill impairment; product warranty obligations; capitalization of internal-use software; retirement benefits; litigation, claims, and contingencies, including environmental and asbestos matters, conditional asset retirement obligations, and contractual indemnifications; leases; and income taxes. We account for changes to estimates and assumptions prospectively when warranted by factually-based experience.\nRevenue Recognition\nSee Note 2 for our revenue recognition policy under Accounting Standards Codification (ASC) 606.\nReturns, Rebates, and Incentives\nOur primary incentive program provides distributors with cash rebates or account credits based on agreed amounts that vary depending on the customer to whom our distributor ultimately sells the product. We also offer various other incentive programs that provide distributors and direct sale customers with cash rebates, account credits, or additional hardware and software products, solutions, and services based on meeting specified program criteria. Certain distributors are offered a right to return product, subject to contractual limitations.\nWe record accruals for customer returns, rebates, and incentives at the time of revenue recognition based primarily on historical experience. Returns are presented on the Consolidated Balance Sheet as a right of return asset and refund liability. Incentives in the form of rebates are estimated at the individual customer level and are recorded as a reduction of sales. Customer incentives for additional hardware and software products, solutions, and services to be provided are considered distinct performance obligations. As such, we allocate revenue to them based on relative standalone selling price. Until the incentive is redeemed, the revenue is recorded as a contract liability.\nTaxes on Revenue Producing Transactions\nTaxes assessed by governmental authorities on revenue producing transactions, including sales, value added, excise, and use taxes, are recorded on a net basis (excluded from revenue).\nCash and Cash Equivalents\nCash, cash equivalents, and restricted cash include time deposits, certificates of deposit, and other fixed income securities with original maturities of three months or less at the time of purchase.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nReceivables\nWe record an allowance for doubtful accounts based on customer-specific analysis and general matters such as current assessments of past due balances and economic conditions. Receivables are recorded net of an allowance for doubtful accounts of $16.8 million at September 30, 2023, and $13.1 million at September 30, 2022. The changes to our allowance for doubtful accounts during the years ended September 30, 2023 and 2022, were not material and primarily consisted of current-period provisions, write-offs charged against the allowance, recoveries collected, and foreign currency translation.\nInventories\nInventories are recorded at the lower of cost or market using the first-in, first-out (FIFO) or average cost methods. Market is determined on the basis of estimated realizable values.\nInvestments\nInvestments include time deposits, certificates of deposit, other fixed income securities, and equity securities. Investments with original maturities longer than three months at the time of purchase and less than one year from period end are classified as short-term. All other investments are classified as long-term. Fixed income securities meeting the definition of a security are accounted for as available-for-sale and recorded at fair value. Equity securities with a readily determinable fair value are recorded at fair value. Equity securities that do not have a readily determinable fair value, which we account for using the measurement alternative under U.S. GAAP, are recorded at the investment cost, less impairment, plus or minus observable price changes (in orderly transactions) of an identical or similar investment of the same issuer. All other investments are recorded at cost, which approximates fair value.\nProperty\nProperty, including internal-use software and software to provide a service (e.g. SaaS arrangements), is recorded at cost. Equipment under finance leases are stated at the present value of minimum lease payments. We calculate depreciation of property using the straight-line method over 3 to 40 years for buildings and improvements, 3 to 20 years for machinery and equipment, and 3 to 10 years for computer hardware and internal-use software. We capitalize significant renewals and enhancements and write off replaced units. Implementation costs incurred in a cloud computing arrangement that is a service contract are recorded in Other current assets and Other assets on the Consolidated Balance Sheet and are amortized over the expected service period. We expense maintenance and repairs, as well as renewals of minor amounts. Property acquired during the year that is accrued within Accounts payable or Other current liabilities at year end is considered to be a non-cash investing activity and is excluded from cash used for capital expenditures in the Consolidated Statement of Cash Flows. Capital expenditures of $42.7 million, $23.0 million, and $31.5 million were accrued within Accounts payable and Other current liabilities at September 30, 2023, 2022, and 2021, respectively.\nGoodwill and Other Intangible Assets\nGoodwill and Other intangible assets generally result from business acquisitions. We account for business acquisitions by allocating the purchase price to tangible and intangible assets acquired and liabilities assumed at their fair values; the excess of the purchase price over the allocated amount is recorded as goodwill.\nWe perform our annual evaluation of goodwill and indefinite life intangible assets for impairment as required under U.S. GAAP during the second quarter of each year, or more frequently if events or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value. Any excess in carrying value over the estimated fair value is charged to results of operations. For our annual evaluation of goodwill, we may perform a qualitative test to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount in order to determine whether it is necessary to perform a quantitative goodwill impairment test. Our reporting units for goodwill evaluation consist of the Intelligent Devices segment, the Software & Control segment, the Lifecycle Services segment (excluding Sensia), and Sensia. When performing the quantitative goodwill impairment test, we determine the fair value of each reporting unit under a combination of an income approach derived from discounted cash flows and a market multiples approach using selected comparable public companies.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nSignificant assumptions used in the income approach include: managements forecasted cash flows, including estimated future revenue growth rates and margins, discount rate, and terminal value. Forecasts of future revenue growth and margins are based on managements best estimates. Actual results and forecasts of revenue growth and margins for our Sensia reporting unit may be impacted by its concentration within the Oil & Gas industry and with its customer base. Demand for Sensia hardware and software products, solutions, and services is sensitive to industry volatility and risks, including those related to commodity prices, supply and demand dynamics, production costs, geological activity, and political activities. The discount rate is determined using a weighted average cost of capital adjusted for risk factors specific to the reporting unit, including risks associated with our above market revenue growth assumptions, historical performance, and industry-specific and economic factors. The terminal value is estimated following the common methodology of calculating the present value of estimated perpetual cash flow beyond the last projected period assuming constant discount and long-term growth rates. Significant assumptions used in the market multiples approach include selection of the comparable public companies and calculation of the appropriate market multiples.\nWe amortize all intangible assets with finite useful lives on a straight-line basis over their estimated useful lives. Useful lives assigned range from 3 to 15 years for trademarks, 8 to 20 years for customer relationships, 4 to 17 years for technology, and 3 to 30 years for other intangible assets.\nIntangible assets also include costs of on-premise software developed or purchased by our software business to be sold, leased, or otherwise marketed. Amortization of these computer software products is calculated on a product-by-product basis as the greater of (a) the unamortized cost at the beginning of the year times the ratio of the current year gross revenue for a product to the total of the current and anticipated future gross revenue for that product or (b) the straight-line amortization over the remaining estimated economic life of the product.\nImpairment of Long-Lived Assets\nWe evaluate the recoverability of the recorded amount of long-lived assets, including property, operating lease right-of-use assets, capitalized implementation costs of a cloud computing arrangement, and other intangible assets, whenever events or changes in circumstances indicate that the recorded amount of an asset may not be fully recoverable. Impairment is assessed when the undiscounted expected future cash flows derived from an asset are less than its carrying amount. If we determine that an asset is impaired, we measure the impairment to be recognized as the amount by which the recorded amount of the asset exceeds its fair value. We report assets to be disposed of at the lower of the recorded amount or fair value less cost to sell. We determine fair value using a discounted future cash flow analysis.\nDerivative Financial Instruments\nWe use derivative financial instruments in the form of foreign currency forward exchange contracts to manage certain foreign currency risks. We enter into these contracts to hedge our exposure to foreign currency exchange rate variability in the expected future cash flows associated with certain third-party and intercompany transactions denominated in foreign currencies forecasted to occur within the next two years. We also use these contracts to hedge portions of our net investments in certain non-U.S. subsidiaries against the effect of exchange rate fluctuations on the translation of foreign currency balances to the U.S. dollar. Additionally, we use derivative financial instruments in the form of interest rate swap contracts to manage our borrowing costs of certain long-term debt and use treasury locks to manage the potential change in interest rates in anticipation of issuance of fixed rate debt. We designate and account for these derivative financial instruments as hedges under U.S. GAAP.\nFurthermore, we use foreign currency forward exchange contracts that are not designated as hedges to offset transaction gains or losses associated with some of our assets and liabilities resulting from intercompany loans or other transactions with third parties that are denominated in currencies other than our entities functional currencies. It is our policy to execute such instruments with global financial institutions that we believe to be creditworthy and not to enter into derivative financial instruments for speculative purposes. Foreign currency forward exchange contracts are usually denominated in currencies of major industrial countries.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nFair Value of Financial Instruments\nWe record various financial instruments at fair value. U.S. GAAP defines fair value as the price that would be received for an asset or paid to transfer a liability (exit price) in an orderly transaction between market participants in the principal or most advantageous market for the asset or liability. U.S. GAAP also classifies the inputs used to measure fair value into the following hierarchy:\nLevel 1: Quoted prices in active markets for identical assets or liabilities.\nLevel 2: Quoted prices in active markets for similar assets or liabilities, quoted prices for identical or similar assets or liabilities in markets that are not active, or inputs other than quoted prices that are observable for the asset or liability.\nLevel 3: Unobservable inputs for the asset or liability.\nWe hold financial instruments consisting of cash and short-term debt. The fair values of our cash and short-term debt approximate their carrying amounts as reported in our Consolidated Balance Sheet due to the short-term nature of these instruments. We also hold financial instruments consisting of long-term debt, investments, and derivatives. The valuation methodologies for these financial instruments are described in Notes 7, 10, 11, and 14.\nWe also determine fair value assessments in conjunction with intangible valuations of acquisitions and our annual impairment testing of goodwill and indefinite lived intangible assets. The valuation methodologies for these assets are described in Notes 3 and 4.\nThe methods described in these Notes may produce a fair value calculation that may not be indicative of net realizable value or reflective of future fair values. Furthermore, while we believe our valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\nForeign Currency Translation\nWe translate assets and liabilities of subsidiaries operating outside of the United States with a functional currency other than the U.S. dollar into U.S. dollars using exchange rates at the end of the respective period. We translate sales, costs, and expenses at average exchange rates effective during the respective period. We report foreign currency translation adjustments as a component of Other comprehensive income (loss). Currency transaction gains and losses are included in results of operations in the period incurred.\nResearch and Development Expenses\nWe expense research and development (R&D) costs as incurred; these costs were $529.5 million in 2023, $440.9 million in 2022, and $422.5 million in 2021. We include R&D expenses in Cost of sales in the Consolidated Statement of Operations.\nIncome Taxes\nWe account for uncertain tax positions by determining whether it is more likely than not that a tax position will be sustained upon examination based on the technical merits of the position. For tax positions that meet the more likely than not recognition threshold, we determine the amount of benefit to recognize in the Consolidated Financial Statements based on our assertion of the most likely outcome resulting from an examination, including the resolution of any related appeals or litigation processes.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nEarnings Per Share\nWe present basic and diluted earnings per share (EPS) amounts. Basic EPS is calculated by dividing earnings available to common shareowners, which is income excluding the allocation to participating securities, by the weighted average number of common shares outstanding during the year, excluding restricted stock. Diluted EPS amounts are based upon the weighted average number of common and common-equivalent shares outstanding during the year. We use the treasury stock method to calculate the effect of outstanding share-based compensation awards, which requires us to compute total employee proceeds as the sum of the amount the employee must pay upon exercise of the award and the amount of unearned share-based compensation costs attributed to future services. Share-based compensation awards for which the total employee proceeds of the award exceed the average market price of the same award over the period have an antidilutive effect on EPS, and accordingly, we exclude them from the calculation. Antidilutive share-based compensation awards for the years ended September 30, 2023 (0.4 million shares), 2022 (0.4 million shares), and 2021 (0.2 million shares), were excluded from the diluted EPS calculation. U.S. GAAP requires unvested share-based payment awards that contain non-forfeitable rights to dividends or dividend equivalents, whether paid or unpaid, to be treated as participating securities and included in the computation of EPS pursuant to the two-class method. Our participating securities are composed of restricted stock and non-employee director restricted stock units.\nThe following table reconciles basic and diluted EPS amounts (in millions, except per share amounts):\n2023 2022 2021\nNet income attributable to Rockwell Automation, Inc. $ 1,387.4 $ 932.2 $ 1,358.1\nLess: Allocation to participating securities (5.9) (2.9) (2.1)\nNet income available to common shareowners $ 1,381.5 $ 929.3 $ 1,356.0\nBasic weighted average outstanding shares 114.8 115.9 116.0\nEffect of dilutive securities\nStock options 0.7 0.7 1.0\nPerformance shares 0.1 0.1 0.1\nDiluted weighted average outstanding shares 115.6 116.7 117.1\nEarnings per share:\nBasic $ 12.03 $ 8.02 $ 11.69\nDiluted $ 11.95 $ 7.97 $ 11.58\nShare-Based Compensation\nWe recognize share-based compensation expense for equity awards on a straight-line basis over the service period of the award based on the fair value of the award as of the grant date.\nProduct and Workers Compensation Liabilities\nWe record accruals for product and workers compensation claims in the period in which they are probable and reasonably estimable. Our principal self-insurance programs include product liability and workers compensation where we self-insure up to a specified dollar amount. Claims exceeding this amount up to specified limits are covered by insurance policies purchased from commercial insurers. We estimate the liability for the majority of the self-insured claims using our claims experience for the periods being valued.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nEnvironmental and Asbestos Matters\nWe record liabilities for environmental and asbestos matters in the period in which our responsibility is probable and the costs can be reasonably estimated. We make changes to the liabilities in the periods in which the estimated costs of remediation change. At third-party environmental sites where more than one potentially responsible party has been identified, we record a liability for our estimated allocable share of costs related to our involvement with the site, as well as an estimated allocable share of costs related to the involvement of insolvent or unidentified parties. If we determine that recovery from insurers or other third parties is probable and a right of set off exists, we record the liability net of the estimated recovery. If we determine that recovery from insurers or other third parties is probable but a right of set off does not exist, we record a liability for the total estimated costs of remediation and a receivable for the estimated recovery. At environmental sites where we are the sole responsible party, we record a liability for the total estimated costs of remediation. Ongoing operating and maintenance expenditures included in our environmental remediation obligations are discounted to present value over the probable future remediation period. Our remaining environmental remediation obligations are undiscounted due to subjectivity of timing and/or amount of future cash payments.\nConditional Asset Retirement Obligations\nWe record liabilities for costs related to legal obligations associated with the retirement of a tangible long-lived asset that results from the acquisition, construction, development, or the normal operation of the long-lived asset. The obligation to perform the asset retirement activity is not conditional even though the timing or method may be conditional.\nLeases\nWe have operating leases primarily for real estate, vehicles, and equipment. We have finance leases primarily for equipment. We determine if a contract is, or contains, a lease at contract inception. A right-of-use (ROU) asset and a corresponding lease liability are recognized at commencement for contracts that are, or contain, a lease with an original term greater than 12 months. ROU assets represent our right to use an underlying asset during the lease term, including periods for which renewal options are reasonably certain to be exercised, and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease expense is recognized on a straight-line basis over the lease term for leases with an original term of 12 months or less. Amortization expense of the ROU asset for operating and finance leases is recognized on a straight-line basis over the lease term and interest expense for finance leases is recognized based on the incremental borrowing rate.\nSome leasing arrangements require variable payments that are dependent on usage or may vary for other reasons, such as payments for insurance and tax payments. A portion of our real estate leases is generally subject to annual changes based upon an index. The changes based upon the index are treated as variable lease payments. The variable portion of lease payments is not included in our ROU assets or lease liabilities and is expensed when incurred. We elected to not separate lease and nonlease components of contracts for most underlying asset classes. Accordingly, all expenses associated with a lease contract are accounted for as lease expenses.\nLease liabilities are recognized at the contract commencement date based on the present value of remaining lease payments over the lease term. To calculate the lease liabilities we use our incremental borrowing rate. We determine our incremental borrowing rate at the commencement date using our unsecured borrowing rate, adjusted for collateralization and lease term. For leases denominated in a currency other than the U.S. dollar, the collateralized borrowing rate in the foreign currency is determined using the U.S. dollar and foreign currency swap spread. Long-term operating lease liabilities are presented as Operating lease liabilities and current operating lease liabilities are included in Other current liabilities in the Consolidated Balance Sheet. Long-term finance lease liabilities are presented as Long-term debt and current finance lease liabilities are included in Current portion of long-term debt in the Consolidated Balance Sheet.\nROU assets are recognized at the contract commencement date at the value of the related lease liability, adjusted for any prepayments, lease incentives received, and initial direct costs incurred. Operating lease ROU assets are presented as Operating lease right-of-use assets and finance lease ROU assets are presented as Property in the Consolidated Balance Sheet.\nLease expenses, including amortization of ROU assets, for operating and finance leases are recognized on a straight-line basis over the lease term and recorded in Cost of sales and Selling, general and administrative expenses in the Consolidated Statement of Operations. Interest expense for finance leases is recorded in Interest expense in the Consolidated Statement of Operations.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nRecently Adopted Accounting Pronouncements\nIn June 2016, the Financial Accounting Standards Board (FASB) issued a new standard that requires companies to utilize a current expected credit losses impairment (CECL) model for certain financial assets, including trade and other receivables. The CECL model requires that estimated expected credit losses, including allowance for doubtful accounts, consider a broader range of information such as economic conditions and expected changes in market conditions. We adopted the new standard as of October 1, 2020. The adoption of this standard did not have a material impact on our Consolidated Financial Statements.\nIn October 2021, the FASB issued a new standard that requires companies to apply Accounting Standards Codification (ASC) 606 to recognize and measure contract assets and contract liabilities in a business combination. We retroactively adopted the new standard as of October 1, 2021. The adoption of this standard did not have a material impact on our Consolidated Financial Statements.\nRecently Issued Accounting Pronouncements\nIn September 2022, the FASB issued a new standard, which requires the buyer in a supplier finance program to disclose information about the key terms of the program, outstanding confirmed amounts as of the end of the period, a rollforward of such amounts during each annual period, and a description of where in the financial statements outstanding amounts are presented. We will expand our disclosures when we adopt this standard in the first quarter of 2024.\nWe do not expect any other recently issued accounting pronouncements to have a material impact on our Consolidated Financial Statements and related disclosures.\n2. Revenue Recognition\nNature of Products and Services\nSubstantially all of our revenue is from contracts with customers. We recognize revenue as promised products are transferred to, or services are performed for, customers in an amount that reflects the consideration to which we expect to be entitled in exchange for those products and services. Our offerings consist of industrial automation and information products, solutions, and services.\nOur products include hardware, software, and configured-to-order products. Our solutions include custom-engineered systems and software. Our services include customer technical support and repair, asset management and optimization consulting, and training. Also included in our services is a portion of revenue related to spare parts that are managed within our services offering.\nOur operations are comprised of the Intelligent Devices segment, the Software & Control segment, and the Lifecycle Services segment. Revenue from the Intelligent Devices and Software & Control segments is predominantly comprised of product sales, which are recognized at a point in time. The Software & Control segment also contains revenue from software products, which may be recognized over time if certain criteria are met. Revenue from the Lifecycle Services segment is predominantly comprised of solutions and services, which are primarily recognized over time. See Note 19 for more information.\nIn most countries, we sell primarily through independent distributors in conjunction with our direct sales force. We sell large systems and service offerings principally through our direct sales force, though opportunities are sometimes identified through distributors.\nPerformance Obligations\nWe use executed sales agreements and purchase orders to determine the existence of a customer contract.\nFor each customer contract, we determine if the products and services promised to the customer are distinct performance obligations. A product or service is distinct if both of the following criteria are met at contract inception: (i) the customer can benefit from the product or service on its own or together with other readily available resources, and (ii) our promise to transfer the product or perform the service is separately identifiable from other promises in the contract. The fact that we regularly sell a product or service separately is an indicator that the customer can benefit from a product or service on its own or with other readily available resources.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe objective when assessing whether our promises to transfer products or perform services are distinct within the context of the contract is to determine whether the nature of the promise is to transfer each of those products or perform those services individually, or whether the promise is to transfer a combined item or items to which the promised products or services are inputs. If a promised product or service is not distinct, we combine that product or service with other promised products or services until it comprises a bundle of products or services that is distinct, which may result in accounting for all the products or services in a contract as a single performance obligation.\nFor each performance obligation in a contract, we determine whether the performance obligation is satisfied over time. A performance obligation is satisfied over time if it meets any of the following criteria: (i) the customer simultaneously receives and consumes the benefits provided by our performance as we perform, or (ii) our performance creates or enhances an asset that the customer controls as the asset is created or enhanced, or (iii) our performance does not create an asset for which we have an alternative use and we have an enforceable right to payment for performance completed to date. If one or more of these criteria are met, then we recognize revenue over time using a method that depicts performance. If none of the criteria are met, then control transfers to the customer at a point in time and we recognize revenue at that point in time.\nOur products represent standard, catalog products for which we have an alternative use, and therefore we recognize revenue at a point in time when control of the product transfers to the customer. For the majority of our products, control transfers upon shipment, though for some contracts control may transfer upon delivery. Product-type contracts are generally one year or less in length.\nRevenue in our Software & Control segment also includes revenue from perpetual and subscription software licenses under on-premise and SaaS arrangements. When on-premise software licenses are determined to be distinct performance obligations, we recognize the related revenue at a point in time when the customer is provided the right to use the license, while revenue allocated to upgrades and support are recognized over the term of the contract. To the extent that the on-premise license is not considered distinct, revenue is recognized over time over the period the related services are performed. Revenue from SaaS arrangements, which allow customers to use hosted software over the contract period without taking possession of the software, are recognized over time during the period the customer is provided the right to use the software.\nWe offer a wide variety of solutions and services to our customers, for which we recognize revenue over time or at a point in time based on the contract as well as the type of solution or service. If one or more of the three criteria above for over-time revenue recognition are met, we recognize revenue over time as cost is incurred, as work is performed, or based on time elapsed, depending on the type of customer contract. If none of these criteria are met, we recognize revenue at a point in time when control of the asset being created or enhanced transfers to the customer, typically upon delivery. More than half of our solutions and services revenue is from contracts that are one year or less in length. For certain solutions and services offerings, when we have the right to invoice our customers in an amount that corresponds to our performance completed to date, we apply the practical expedient to measure progress and recognize revenue based on the amount for which we have the right to invoice the customer.\nWhen assessing whether we have an alternative use for an asset, we consider both contractual and practical limitations. These include: (i) the level and cost of customization of the asset that is required to meet a customers needs, (ii) the activities, cost, and profit margin after any rework that would be required before the asset could be directed for another use, and (iii) the portion of the asset that could not be reworked for an alternative use.\nAt times we provide products and services free of charge to our customers as incentives when the customers purchase other products or services. These represent distinct performance obligations. As such, we allocate revenue to them based on relative standalone selling price.\nMost of our global warranties are assurance in nature and do not represent distinct performance obligations. See Note 9 for additional information and disclosures. We occasionally offer extended warranties to our customers that are considered a distinct performance obligation, to which we allocate revenue, which is recognized over the extended warranty period.\nWe account for shipping and handling activities performed after control of a product has been transferred to the customer as a fulfillment cost. As such, we have applied the practical expedient and we accrue for the costs of shipping and handling activities if revenue is recognized before contractually agreed shipping and handling activities occur.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nUnfulfilled Performance Obligations\nAs of September 30, 2023, we expect to recognize approximately $1,100 million of revenue in future periods from unfulfilled performance obligations from existing contracts with customers. We expect to recognize revenue of approximately $687 million from our remaining performance obligations over the next 12 months with the remaining balance recognized thereafter.\nWe have applied the practical expedient to exclude the value of remaining performance obligations for (i) contracts with an original term of one year or less and (ii) contracts for which we recognize revenue in proportion to the amount we have the right to invoice for services performed. The amounts above also do not include the impact of contract renewal options that are unexercised as of September 30, 2023.\nTransaction Price\nThe transaction price is the amount of consideration to which we expect to be entitled in exchange for transferring products to, or performing services for, a customer. We estimate the transaction price at contract inception, and update the estimate each reporting period for any changes in circumstances. In some cases a contract may involve variable consideration, including rebates, credits, allowances for returns, or other similar items that generally decrease the transaction price. We use historical experience to estimate variable consideration, including any constraint.\nThe transaction price (including any discounts and variable consideration) is allocated between separate products and services based on their relative standalone selling prices. The standalone selling prices are determined based on the prices at which we separately sell each good or service. For items that are not sold separately, we estimate the standalone selling price using available information such as market reference points and other observable data.\nWe have elected the practical expedient to exclude sales taxes and other similar taxes from the measurement of the transaction price.\nSignificant Payment Terms\nOur standard payment terms vary globally but do not result in a significant delay between the timing of invoice and payment. We occasionally negotiate other payment terms during the contracting process. We do not typically include significant financing components in our contracts with customers. We have elected the practical expedient to not adjust the transaction price for the period between transfer of products or performance of services and customer payment if expected to be one year or less.\nFor most of our products, we invoice at the time of shipment and we do not typically have significant contract balances. For our solutions and services as well as some of our products, timing may differ between revenue recognition and billing. Depending on the terms agreed to with the customer, we may invoice in advance of performance or we may invoice after performance. When revenue recognition exceeds billing we recognize a receivable, and when billing exceeds revenue recognition we recognize a contract liability.\nDisaggregation of Revenue\nThe following table presents our revenue disaggregation by geographic region for our three operating segments (in millions). We attribute sales to the geographic regions based on the country of destination.\nYear Ended September 30, 2023 Year Ended September 30, 2022\nIntelligent Devices Software & Control Lifecycle Services Total Intelligent Devices Software & Control Lifecycle Services Total\nNorth America $ 2,409.2 $ 1,794.8 $ 1,020.0 $ 5,224.0 $ 2,223.7 $ 1,542.2 $ 956.1 $ 4,722.0\nEurope, Middle East and Africa 829.1 528.0 513.5 1,870.6 629.3 350.4 457.9 1,437.6\nAsia Pacific 568.6 393.7 395.7 1,358.0 443.5 291.8 352.7 1,088.0\nLatin America 291.3 169.5 144.6 605.4 248.1 128.5 136.2 512.8\nTotal Company Sales $ 4,098.2 $ 2,886.0 $ 2,073.8 $ 9,058.0 $ 3,544.6 $ 2,312.9 $ 1,902.9 $ 7,760.4\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nContract Liabilities\nContract liabilities primarily relate to consideration received in advance of performance under the contract.\nBelow is a summary of our Contract liabilities balance, the portion not expected to be recognized within twelve months is included within Other liabilities in the Consolidated Balance Sheet (in millions):\nSeptember 30, 2023 September 30, 2022\nBalance as of beginning of year $ 541.3 $ 462.5\nBalance as of end of period 653.6 541.3\nThe most significant changes in our Contract liabilities balance during both the twelve months ended September 30, 2023 and 2022, were due to amounts billed, partially offset by revenue recognized on amounts billed during the period and revenue recognized that was included in the Contract liabilities balance at the beginning of the period.\nIn the twelve months ended September 30, 2023, we recognized revenue of approximately $423.9 million that was included in the Contract liabilities balance at September 30, 2022. In the twelve months ended September 30, 2022, we recognized revenue of approximately $373.1 million that was included in the Contract liabilities balance at September 30, 2021. We did not have a material amount of revenue recognized in the twelve months ended September 30, 2023 and 2022, from performance obligations satisfied or partially satisfied in previous periods.\nCosts to Obtain and Fulfill a Contract\nWe capitalize and amortize certain incremental costs to obtain and fulfill contracts. These costs primarily consist of incentives paid to sales personnel, which are considered incremental costs to obtain customer contracts. We elected the practical expedient to expense incremental costs to obtain a contract when the contract has a duration of one year or less for most classes of contracts. Our capitalized contract costs, which are included in Other assets in our Consolidated Balance Sheet, are not significant as of September 30, 2023 and 2022. There was no impairment loss in relation to capitalized costs in the period.\n3. Goodwill and Other Intangible Assets\nChanges in the carrying amount of Goodwill were (in millions):\nIntelligent Devices Software & Control Lifecycle Services Total\nBalance as of October 1, 2021 $ 543.1 $ 2,447.5 $ 635.3 $ 3,625.9\nAcquisition of businesses - - 12.1 12.1\nTranslation and other (40.1) (48.8) (25.1) (114.0)\nBalance as of September 30, 2022 $ 503.0 $ 2,398.7 $ 622.3 $ 3,524.0\nAcquisition of businesses 74.4 - 36.9 111.3\nImpairment - - (157.5) (157.5)\nTranslation and other 18.4 21.4 11.6 51.4\nBalance as of September 30, 2023 $ 595.8 $ 2,420.1 $ 513.3 $ 3,529.2\nGross carrying value of Goodwill 595.8 2,420.1 670.8 3,686.7\nAccumulated impairment losses - - (157.5) (157.5)\nGoodwill $ 595.8 $ 2,420.1 $ 513.3 $ 3,529.2\nWe performed our annual evaluation of goodwill and indefinite life intangible assets for impairment during the second quarter of fiscal 2023 and concluded that these assets were not impaired. For our annual evaluation, we performed qualitative tests for our Intelligent Devices, Software & Control, and Lifecycle Services (excluding Sensia) reporting units and a quantitative test for our Sensia reporting unit. Refer to Note 1 for additional information on our goodwill impairment evaluations.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nInterim Impairment Assessment\nSince formation in October 2019, our Sensia joint venture operations have been challenged by the global pandemic, geopolitical activities, volatility in commodity prices and supply chain dynamics. The cumulative historical growth and profitability below plan have resulted in a declining cushion between carrying value and fair value in previous impairment tests. The joint venture partners appointed a new management team in 2023 and have updated the strategy of Sensia, which included downward revisions to growth and profitability projections for 2024 and future years. Lower sales growth reflects historical performance and an updated outlook of market conditions. Lower profitability reflects an updated view of mix and volume. Based upon the update of Sensias strategy and projections in the fourth quarter, we determined that it was more likely than not that the fair value of Sensia was below its carrying value. As a result of this triggering event, we performed an interim quantitative analysis, using a combination of an income approach derived from discounted cash flows and a market multiples approach using selected comparable public companies, consistent with our annual impairment testing. As of the fourth quarter testing date, the carrying value of our Sensia reporting unit of $665.1 million was determined to be in excess of the reporting units fair value, resulting in a $157.5 million goodwill impairment charge recorded in the Consolidated Statement of Operations. Subsequent to the impairment, $160.3 million of goodwill remains within the Sensia reporting unit.\nOther intangible assets consist of (in millions):\nSeptember 30, 2023\nCarrying\nAmount Accumulated\nAmortization Net\nAmortized intangible assets\nSoftware products $ 100.4 $ 65.1 $ 35.3\nCustomer relationships 606.1 141.3 464.8\nTechnology 424.1 173.1 251.0\nTrademarks 86.3 29.3 57.0\nOther 6.0 5.4 0.6\nTotal amortized intangible assets 1,222.9 414.2 808.7\nAllen-Bradley® trademark not subject to amortization\n43.7 - 43.7\nOther intangible assets $ 1,266.6 $ 414.2 $ 852.4\nSeptember 30, 2022\nCarrying\nAmount Accumulated\nAmortization Net\nAmortized intangible assets\nSoftware products $ 97.6 $ 57.9 $ 39.7\nCustomer relationships 582.7 107.2 475.5\nTechnology 410.8 119.3 291.5\nTrademarks 70.4 19.4 51.0\nOther 6.4 5.8 0.6\nTotal amortized intangible assets 1,167.9 309.6 858.3\nAllen-Bradley® trademark not subject to amortization\n43.7 - 43.7\nOther intangible assets $ 1,211.6 $ 309.6 $ 902.0\nSoftware products represent costs of computer software to be sold, leased, or otherwise marketed. Software products amortization expense was $11.3 million in 2023, $9.4 million in 2022, and $11.9 million in 2021. Estimated total amortization expense for all amortized intangible assets is $116.2 million in 2024, $112.2 million in 2025, $110.9 million in 2026, $102.8 million in 2027, and $90.0 million in 2028.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n4. Acquisitions\nFiscal 2023 Acquisitions\nIn October 2022, we acquired CUBIC, a company that specializes in modular systems for the construction of electrical panels, headquartered in Bronderslev, Denmark. We assigned the full amount of goodwill related to this acquisition to our Intelligent Devices segment.\nIn February 2023, we acquired Knowledge Lens, a services and solutions provider headquartered in Bengaluru, India. We assigned the full amount of goodwill related to this acquisition to our Lifecycle Services segment.\nWe recorded assets acquired and liabilities assumed in connection with these acquisitions based on their estimated fair values as of the acquisition dates of October 31, 2022, and February 28, 2023, respectively. The preliminary aggregate purchase price allocation is as follows (in millions):\nPurchase Price Allocation\nAccounts receivable $ 23.8\nInventories 17.7\nProperty 27.5\nGoodwill 111.3\nOther intangible assets 54.1\nAll other assets acquired 21.0\nTotal assets acquired 255.4\nLess: Other liabilities assumed (12.6)\nLess: Deferred income taxes (56.6)\nNet assets acquired, excluding cash $ 186.2\nPurchase Consideration\nTotal purchase consideration, net of cash acquired $ 186.2\nThe measurement period for the valuation of net assets acquired ends as soon as information on the facts and circumstances that existed as of the acquisition date becomes available, but not to exceed 12 months following the acquisition date. Adjustments in purchase price allocations may require a change in the amounts allocated to net assets acquired during the periods in which the adjustments are determined.\nPro forma consolidated sales for the year ended September 30, 2023 and 2022, were approximately $9.1 billion and $7.9 billion, respectively, and the impact on earnings is not material. The preceding pro forma consolidated financial results of operations are as if the preceding fiscal 2023 acquisitions, the October 2023 acquisition of Clearpath (see Note 20), and the November 2023 acquisition of Verve (see Note 20) occurred on October 1, 2021. The pro forma information is presented for informational purposes only and is not indicative of the results of operations that would have been achieved had the transaction occurred as of that time. Acquisition-related costs recorded as expenses in the year ended September 30, 2023, were not material.\nTotal sales in 2023 from the 2023 acquisitions were $88.3 million, and the impact on earnings was not material. Total acquisition costs from the 2023 acquisitions were not material.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nFiscal 2022 Acquisitions\nIn November 2021, we acquired AVATA, a services provider for supply chain management, enterprise resource planning, and enterprise performance management solutions. We assigned the full amount of goodwill related to this acquisition to our Lifecycle Services segment.\nIn March 2022, we, through our Sensia affiliate, acquired Swinton Technology, a provider of metering supervisory systems and measurement expertise in the Oil & Gas industry. We assigned the full amount of goodwill related to this acquisition to our Lifecycle Services segment.\nPro forma consolidated sales for the year ended September 30, 2022 and 2021, were approximately $7.8 billion and $7.0 billion, respectively, and the impact on earnings is not material. The preceding pro forma consolidated financial results of operations are as if the preceding fiscal 2022 acquisitions occurred on October 1, 2020. The pro forma information is presented for informational purposes only and is not indicative of the results of operations that would have been achieved had the transaction occurred as of that time. Acquisition-related costs recorded as expenses in the year ended September 30, 2022, were not material.\nFiscal 2021 Acquisitions\nPlex acquisition\nIn August 2021, we acquired Plex Systems, a cloud-native smart manufacturing platform. Plex offers a single-instance, multi-tenant Software-as-a-Service manufacturing platform operating at scale, including advanced manufacturing execution systems, quality, and supply chain management capabilities.\nWe recorded assets acquired and liabilities assumed in connection with this acquisition based on their estimated fair values as of the acquisition date of August 31, 2021. The aggregate purchase price allocation is as follows (in millions):\nPurchase Price Allocation\nAccounts receivable $ 14.8\nAll other assets 28.3\nGoodwill 1,730.0\nIntangible assets 531.4\nTotal assets acquired 2,304.5\nLess: Contract liabilities (29.2)\nLess: Other liabilities assumed (33.4)\nLess: Deferred income taxes (36.4)\nNet assets acquired $ 2,205.5\nPurchase Consideration\nTotal purchase consideration, net of cash acquired $ 2,205.5\nIntangible assets identified include $276.4 million of customer relationships, $232.8 million of technology, and $22.2 million of trade names (approximately 12-year weighted average useful life). We assigned the full amount of goodwill and all other assets acquired to our Software & Control segment. The goodwill recorded represents intangible assets that do not qualify for separate recognition. This goodwill arises because the purchase price for Plex reflects a number of factors including the future earnings and cash flow potential of the business, the strategic fit and resulting synergies from the complementary portfolio of leading software-as-a-service applications, industry expertise, and market access. We do not expect the goodwill to be deductible for tax purposes. The intangible assets were valued using an income approach, specifically the relief from royalty method and multi-period excess earnings method. The relief from royalty method calculates value based on hypothetical payments that would be saved by owning an asset rather than licensing it. The multi-period excess earnings method is the isolation of cash flows from a single intangible asset and measures fair value by discounting them to present value. These values are considered level 3 measurements under the U.S. GAAP fair value hierarchy. The key assumption requiring the use of judgement in the valuation of the customer relationship intangible asset was the customer attrition rate of 5 percent; other assumptions included forecasted cash flows attributable to the existing customers and the discount rate. The key assumptions requiring the use of judgement in the valuation of the technology intangible asset were the royalty rate of 25 percent and the obsolescence factor estimating a phase out over 10 years; other assumptions included forecasted revenue growth rates and the discount rate.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nOther acquisitions\nIn October 2020, we acquired Oylo, a privately-held industrial cybersecurity services provider based in Barcelona, Spain. We assigned the full amount of goodwill related to this acquisition to our Lifecycle Services segment.\nIn December 2020, we acquired Fiix Inc., a privately-held, artificial intelligence enabled computerized maintenance management system (CMMS) company based in Toronto, Ontario, Canada. We assigned the full amount of goodwill related to this acquisition to our Software & Control segment.\nWe recorded assets acquired and liabilities assumed in connection with these acquisitions based on their estimated fair values as of the respective acquisition dates. The aggregate purchase price allocation for these acquisitions is as follows (in millions):\nPurchase Price Allocation\nAccounts receivable $ 6.0\nAll other assets 15.9\nGoodwill 224.8\nIntangible assets 69.6\nTotal assets acquired 316.3\nLess: Liabilities assumed (25.5)\nLess: Deferred income taxes (3.7)\nNet assets acquired $ 287.1\nPurchase Consideration\nTotal purchase consideration, net of cash acquired $ 287.1\nIntangible assets identified include $69.6 million of customer relationships, technology, and trade names (approximately 11-year weighted average useful life). We assigned $12.8 million of goodwill to our Lifecycle Services segment and $212.0 million of goodwill to our Software & Control segment, which represents intangible assets that do not qualify for separate recognition. We do not expect the goodwill to be deductible for tax purposes.\nThe total sales included in our consolidated results for all of the preceding acquisitions for the year ended September 30, 2021, were approximately $27.9 million.\nPro forma consolidated sales for the year ended September 30, 2021 and 2020, were approximately $7.2 billion and $6.5 billion, respectively, and the impact on earnings is not material. The preceding pro forma consolidated financial results of operations are as if all of preceding fiscal 2021 acquisitions occurred on October 1, 2019. The pro forma information is presented for informational purposes only and is not indicative of the results of operations that would have been achieved had the transaction occurred as of that time.\nAcquisition-related costs recorded as expenses for all of the preceding acquisitions in the year ended September 30, 2021, were not material.\n5. Inventories\nInventories consist of (in millions):\nSeptember 30,\n2023 2022\nFinished goods $ 545.9 $ 325.0\nWork in process 395.7 317.3\nRaw materials 463.3 411.9\nInventories $ 1,404.9 $ 1,054.2\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n6. Property, net\nProperty consists of (in millions):\nSeptember 30,\n2023 2022\nLand $ 4.6 $ 4.6\nBuildings and improvements 434.1 399.0\nMachinery and equipment 1,312.7 1,201.6\nInternal-use software 569.4 540.7\nConstruction in progress 191.7 142.9\nTotal 2,512.5 2,288.8\nLess: Accumulated depreciation (1,828.3) (1,702.3)\nProperty, net $ 684.2 $ 586.5\n7. Long-term and Short-term Debt\nLong-term debt consists of (in millions):\nSeptember 30,\n2023 2022\n0.35% notes, payable in August 2023\n$ - $ 600.0\n2.875% notes, payable in March 2025\n306.4 311.0\n6.70% debentures, payable in January 2028\n250.0 250.0\n3.50% notes, payable in March 2029\n425.0 425.0\n1.75% notes, payable in August 2031\n450.0 450.0\n6.25% debentures, payable in December 2037\n250.0 250.0\n4.20% notes, payable in March 2049\n575.0 575.0\n2.80% notes, payable in August 2061\n450.0 450.0\n5.20% debentures, payable in January 2098\n200.0 200.0\nUnamortized discount, capitalized lease obligations and other (34.9) (34.1)\nTotal debt 2,871.5 3,476.9\nLess: Current portion (8.6) (609.1)\nLong-term debt $ 2,862.9 $ 2,867.8\nOur Short-term debt as of September 30, 2023 and 2022, includes $23.5 million and $42.3 million, respectively, of interest-bearing loans from SLB to Sensia, due December 29, 2023. In December 2022, Sensia entered into an unsecured $75.0 million line of credit. As of September 30, 2023, included in Short-term debt was $70.0 million borrowed against the line of credit with an interest rate of 6.29 percent. Also included in Short-term debt as of September 30, 2022 was commercial paper borrowings of $317.0 million with a weighted average interest rate of 3.03 percent and a weighted average maturity period of 22 days.\nIn August 2021, we issued $1.5 billion aggregate principal amount of long-term notes in a registered public offering. The offering consisted of $600.0 million of 0.35% notes due in August 2023, $450.0 million of 1.75% notes due in August 2031, and $450.0 million of 2.80% notes due in August 2061, all issued at a discount. Net proceeds to the Company from the debt offering were $1,485.6 million. We used these net proceeds primarily to fund the acquisition of Plex. Refer to Note 4 for additional information on this acquisition.\nIn March 2019, we issued $1.0 billion aggregate principal amount of long-term notes in a registered public offering. The offering consisted of $425.0 million of 3.50% notes due in March 2029 and $575.0 million of 4.20% notes due in March 2049, both issued at a discount. Net proceeds to the Company from the debt offering were $987.6 million. We used these net proceeds primarily to repay our outstanding commercial paper, with the remaining proceeds used for general corporate purposes.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nWe entered into treasury locks to manage the potential change in interest rates in anticipation of the issuance of the $1.5 billion aggregate notes in August 2021 and the $1.0 billion of fixed rate debt in March 2019. These treasury locks were designated as and accounted for as cash flow hedges. The effective differentials paid on these treasury locks was initially recorded in Accumulated other comprehensive loss, net of tax effect. As a result of the changes in the interest rates on the treasury locks between the time we entered into the treasury locks and the time we priced and issued the notes, the Company made a net payment of $28.0 million to the counterparties from the August 2021 issuance and $35.7 million to the counterparty from the March 2019 issuance. The $28.0 million and $35.7 million net losses on the settlement of the treasury locks were recorded in Accumulated other comprehensive loss, net of tax effect, and are being amortized over the term of the corresponding notes, and recognized as an adjustment to Interest expense in the Consolidated Statement of Operations.\nOn June 29, 2022, we replaced our former $1.25 billion unsecured revolving credit facility with a new five-year $1.5 billion unsecured revolving credit facility, expiring in June 2027. We can increase the aggregate amount of this credit facility by up to $750.0 million, subject to the consent of the banks in the credit facility. We did not borrow against this credit facility or the former credit facility during the periods ended September 30, 2023, or 2022. Borrowings under this credit facility bear interest based on short-term money market rates in effect during the period the borrowings are outstanding. The terms of this credit facility contain covenants under which we agree to maintain an EBITDA-to-interest ratio of at least 3.0 to 1.0. The EBITDA-to-interest ratio is defined in the credit facility as the ratio of consolidated EBITDA (as defined in the facility) for the preceding four quarters to consolidated interest expense for the same period.\nAmong other uses, we can draw on our credit facility as a standby liquidity facility to repay our outstanding commercial paper as it matures. Under our current policy, we expect to limit our other borrowings under our credit facility, if any, to amounts that would leave enough credit available under the facility so that we could borrow, if needed, to repay all of our then outstanding commercial paper as it matures.\nSeparate short-term unsecured credit facilities of approximately $225.8 million at September 30, 2023, were available to non-U.S. subsidiaries, of which approximately $32.0 million was committed under letters of credit. Borrowings under our non-U.S. credit facilities at September 30, 2023 and 2022, were not significant. We were in compliance with financial covenants under our credit facilities at September 30, 2023 and 2022. There are no significant commitment fees or compensating balance requirements under our credit facilities.\nInterest payments were $133.2 million during 2023, $120.4 million during 2022, and $91.8 million during 2021.\nThe following table presents the carrying amounts and estimated fair values of Long-term debt in the Consolidated Balance Sheet (in millions):\nSeptember 30, 2023 September 30, 2022\nCarrying Value Fair Value Carrying Value Fair Value\nCurrent portion of long-term debt $ 8.6 $ 8.6 $ 609.1 $ 589.1\nLong-term debt 2,862.9 2,442.6 2,867.8 2,485.4\nWe base the fair value of long-term debt upon quoted market prices for the same or similar issues and therefore consider this a Level 2 fair value measurement. The fair value of long-term debt considers the terms of the debt excluding the impact of derivative and hedging activity. Refer to Note 1 for further information regarding levels in the fair value hierarchy. The carrying value of our short-term debt approximates fair value.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n8. Other Current Liabilities\nOther current liabilities consist of (in millions):\nSeptember 30,\n2023 2022\nUnrealized losses on foreign exchange contracts (Note 11) $ 10.8 $ 31.2\nProduct warranty obligations (Note 9) 18.3 16.5\nTaxes other than income taxes 56.9 65.6\nAccrued interest 18.6 18.1\nIncome taxes payable 248.6 81.1\nOperating lease liabilities 83.4 83.3\nOther 130.8 107.2\nOther current liabilities $ 567.4 $ 403.0\n9. Product Warranty Obligations\nWe record a liability for product warranty obligations at the time of sale to a customer based upon historical warranty experience. Most of our products are covered under a warranty period that runs for twelve months from either the date of sale or installation. We also record a liability for specific warranty matters when they become known and reasonably estimable.\nChanges in product warranty obligations were (in millions):\nSeptember 30,\n2023 2022\nBeginning balance $ 16.5 $ 18.0\nWarranties recorded at time of sale 14.8 14.5\nAdjustments to pre-existing warranties 2.9 (3.6)\nSettlements of warranty claims (15.9) (12.4)\nEnding balance $ 18.3 $ 16.5\n10. Investments\nOur investments consist of (in millions):\nSeptember 30,\n2023 2022\nFixed income securities $ 0.6 $ 12.6\nEquity securities (level 1) - 928.8\nEquity securities (other) 96.0 76.4\nOther 61.1 50.8\nTotal investments 157.7 1,068.6\nLess: Short-term investments (1)\n(0.6) (12.6)\nLong-term investments $ 157.1 $ 1,056.0\n(1) Short-term investments are included in Other current assets in the Consolidated Balance Sheet.\nEquity Securities\nEquity securities (level 1) consisted of shares of PTC Inc. common stock (PTC Shares). As of September 30, 2023, all PTC Shares have been sold. 8,879,717 PTC Shares were owned at September 30, 2022. The PTC Shares were classified as level 1 in the fair value hierarchy, as described in Note 1, and were recognized at fair value in the Consolidated Balance Sheet using the most recent closing price of PTC common stock quoted on Nasdaq.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nEquity securities (other) consist of various securities that do not have a readily determinable fair value, which we account for using the measurement alternative under U.S. GAAP. These securities are recorded at the investment cost, less impairment, plus or minus observable price changes (in orderly transactions) of an identical or similar investment of the same issuer in the Consolidated Balance Sheet. Observable price changes are classified as level 2 in the fair value hierarchy, as described in Note 1. The carrying values at September 30, 2023 and 2022, include cumulative upward adjustments from observed price changes of $17.5 million and $17.2 million, respectively.\nWe record gains and losses on investments within the Change in fair value of investments line in the Consolidated Statement of Operations. The gains and losses on investments we recorded for the following periods were (in millions):\n2023 2022 2021\nNet gain (loss) on equity securities (level 1) $ 281.7 $ (136.4) $ 392.3\nNet (loss) gain on equity securities (other) (1.3) 15.1 5.1\nEquity method loss on Other investments (1.1) (15.6) -\nChange in fair value of investments 279.3 (136.9) 397.4\nTotal net realized gain on equity securities 281.7 44.6 -\nTotal net unrealized (loss) gain on equity securities $ (1.3) $ (165.9) $ 397.4\nRefer to Note 1 for further information regarding levels in the fair value hierarchy. We did not have any transfers between levels of fair value measurements during the periods presented.\n11. Derivative Instruments\nWe use foreign currency forward exchange contracts and foreign currency denominated debt obligations to manage certain foreign currency risks. We also use treasury locks to manage risks associated with interest rate fluctuations. The following information explains how we use and value these types of derivative instruments and how they impact our consolidated financial statements.\nAdditional information related to the impacts of cash flow hedges on Other comprehensive income (loss) is included in Note 12.\nTypes of Derivative Instruments and Hedging Activities\nCash Flow Hedges\nWe enter into foreign currency forward exchange contracts to hedge our exposure to foreign currency exchange rate variability in the expected future cash flows associated with certain third-party and intercompany transactions denominated in foreign currencies forecasted to occur within the next two years (cash flow hedges). We report in Other comprehensive income (loss) the effective portion of the gain or loss on derivative financial instruments that we designate and that qualify as cash flow hedges. We reclassify these gains or losses into earnings in the same periods when the hedged transactions affect earnings. To the extent forward exchange contracts designated as cash flow hedges are ineffective, changes in value are recorded in earnings through the maturity date. There was no impact on earnings due to ineffective cash flow hedges. At September 30, 2023, we had a U.S. dollar-equivalent gross notional amount of $1,075.9 million of foreign currency forward exchange contracts designated as cash flow hedges. We entered into treasury locks to manage the potential change in interest rates in anticipation of the issuance of $1.5 billion and $1.0 billion of fixed rate debt in August 2021 and March 2019, respectively. Treasury locks are accounted for as cash flow hedges since they hedge the risk of an increase in treasury rates for the forecasted interest payments of an anticipated fixed-rate debt issuance.\nThe pre-tax amount of gains (losses) recorded in Other comprehensive income (loss) related to cash flow hedges that would have been recorded in the Consolidated Statement of Operations had they not been so designated was (in millions):\n2023 2022 2021\nForward exchange contracts $ 17.2 $ 70.5 $ (10.8)\nTreasury locks - - (28.0)\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe pre-tax amount of gains (losses) reclassified from Accumulated other comprehensive loss into the Consolidated Statement of Operations related to derivative forward exchange contracts designated as cash flow hedges, which offset the related gains and losses on the hedged items during the periods presented, was (in millions):\n2023 2022 2021\nSales $ 6.0 $ 0.7 $ 1.9\nCost of sales 33.4 21.8 (25.4)\nSelling, general and administrative expenses - (0.9) 1.5\nInterest expense (3.5) (3.6) (2.3)\nTotal $ 35.9 $ 18.0 $ (24.3)\nApproximately $19.4 million of pre-tax net unrealized gains on cash flow hedges as of September 30, 2023, will be reclassified into earnings during the next twelve months. We expect that these net unrealized gains will be offset when the hedged items are recognized in earnings.\nNet Investment Hedges\nWe use foreign currency forward exchange contracts and foreign currency denominated debt obligations to hedge portions of our net investments in non-U.S. subsidiaries (net investment hedges) against the effect of exchange rate fluctuations on the translation of foreign currency balances to the U.S. dollar. For all instruments that are designated as net investment hedges and meet effectiveness requirements, the net changes in value of the designated hedging instruments are recorded in Accumulated other comprehensive loss within Shareowners equity where they offset gains and losses recorded on our net investments globally. To the extent forward exchange contracts or foreign currency denominated debt designated as net investment hedges are ineffective, changes in value are recorded in earnings through the maturity date. There was no impact on earnings due to ineffective net investment hedges. At September 30, 2023 and 2022, we had no foreign currency forward exchange contracts designated as net investment hedges.\nThe pre-tax amount of losses recorded in Other comprehensive income (loss) related to net investment hedges that would have been recorded in the Consolidated Statement of Operations had they not been so designated was not material.\nDerivatives Not Designated as Hedging Instruments\nCertain of our locations have assets and liabilities denominated in currencies other than their functional currencies resulting from intercompany loans and other transactions with third parties denominated in foreign currencies. We enter into foreign currency forward exchange contracts that we do not designate as hedging instruments to offset the transaction gains or losses associated with some of these assets and liabilities. Gains and losses on derivative financial instruments for which we do not elect hedge accounting are recognized in the Consolidated Statement of Operations in each period, based on the change in the fair value of the derivative financial instruments. At September 30, 2023, we had a U.S. dollar-equivalent gross notional amount of $1,178.1 million of foreign currency forward exchange contracts not designated as hedging instruments.\nThe pre-tax amount of gains (losses) from forward exchange contracts not designated as hedging instruments recognized in the Consolidated Statement of Operations was (in millions):\n2023 2022 2021\nCost of sales $ 1.6 $ 0.5 $ (0.2)\nOther (expense) income (19.2) 38.6 (8.1)\nTotal $ (17.6) $ 39.1 $ (8.3)\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nFair Value of Derivative Instruments\nWe recognize all derivative financial instruments as either assets or liabilities at fair value in the Consolidated Balance Sheet. We value our forward exchange contracts using a market approach. We use a valuation model based on inputs including forward and spot prices for currency and interest rate curves. We did not change our valuation techniques during fiscal 2023, 2022, or 2021. It is our policy to execute such instruments with major financial institutions that we believe to be creditworthy and not to enter into derivative financial instruments for speculative purposes. We diversify our foreign currency forward exchange contracts among counterparties to minimize exposure to any one of these entities. Our foreign currency forward exchange contracts are usually denominated in currencies of major industrial countries. The U.S. dollar-equivalent gross notional amount of our forward exchange contracts totaled $2,254.0 million at September 30, 2023. Currency pairs (buy/sell) comprising the most significant contract notional values were Euro/United States dollar (USD), USD/Canadian dollar, USD/Swiss Franc, and USD/Mexican peso.\nThe fair value of our derivatives and their location in our Consolidated Balance Sheet were (in millions):\nFair Value (Level 2)\nDerivatives Designated as Hedging Instruments Balance Sheet Location September 30, 2023 September 30, 2022\nForward exchange contracts Other current assets $ 23.5 $ 52.2\nForward exchange contracts Other assets 5.6 8.0\nForward exchange contracts Other current liabilities (2.0) (10.2)\nForward exchange contracts Other liabilities (0.7) (1.0)\nTotal $ 26.4 $ 49.0\nFair Value (Level 2)\nDerivatives Not Designated as Hedging Instruments Balance Sheet Location September 30, 2023 September 30, 2022\nForward exchange contracts Other current assets $ 20.1 $ 59.9\nForward exchange contracts Other current liabilities (8.8) (21.0)\nTotal $ 11.3 $ 38.9\nRefer to Note 1 for further information regarding levels in the fair value hierarchy.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n12. Shareowners Equity\nCommon Stock\nAt September 30, 2023, the authorized stock of the Company consisted of one billion shares of common stock, par value $1.00 per share, and 25 million shares of preferred stock, without par value. At September 30, 2023, 13.5 million shares of authorized common stock were reserved for various incentive plans.\nChanges in outstanding common shares are summarized as follows (in millions):\n2023 2022 2021\nBeginning balance 115.2 116.0 116.2\nTreasury stock purchases (1.2) (1.3) (1.1)\nCommon stock issued (including share-based compensation impact) 0.8 0.5 0.9\nEnding balance 114.8 115.2 116.0\nAt September 30, 2023 and 2022, there were $1.1 million and $1.6 million, respectively, of outstanding common stock share repurchases recorded in Accounts payable.\nAccumulated Other Comprehensive Loss\nChanges in Accumulated other comprehensive loss attributable to Rockwell Automation by component were (in millions):\nPension and other postretirement benefit plan adjustments, net of tax (Note 14) Accumulated currency translation adjustments, net of tax Net unrealized (losses) gains on cash flow hedges, net of tax Total accumulated other comprehensive loss, net of tax\nBalance as of September 30, 2020 $ (1,271.2) $ (311.5) $ (31.5) $ (1,614.2)\nOther comprehensive income (loss) before reclassifications 438.9 31.4 (29.2) 441.1\nAmounts reclassified from accumulated other comprehensive loss 138.2 - 17.8 156.0\nOther comprehensive income (loss) 577.1 31.4 (11.4) 597.1\nBalance as of September 30, 2021 $ (694.1) $ (280.1) $ (42.9) $ (1,017.1)\nOther comprehensive income (loss) before reclassifications 170.7 (184.9) 51.2 37.0\nAmounts reclassified from accumulated other comprehensive loss 75.6 - (13.0) 62.6\nOther comprehensive income (loss) 246.3 (184.9) 38.2 99.6\nBalance as of September 30, 2022 $ (447.8) $ (465.0) $ (4.7) $ (917.5)\nOther comprehensive (loss) income before reclassifications (49.7) 100.1 12.8 63.2\nAmounts reclassified from accumulated other comprehensive loss 90.4 - (26.2) 64.2\nOther comprehensive income (loss) 40.7 100.1 (13.4) 127.4\nBalance as of September 30, 2023 $ (407.1) $ (364.9) $ (18.1) $ (790.1)\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe reclassifications out of Accumulated other comprehensive loss to the Consolidated Statement of Operations were (in millions):\nYear Ended September 30, Affected Line in the Consolidated Statement of Operations\n2023 2022 2021\nPension and other postretirement benefit plan adjustments (1)\nAmortization of prior service cost (credit) $ 0.1 $ (0.2) $ (4.0) Other (expense) income\nAmortization of net actuarial (gain) loss (2.1) 60.1 142.5 Other (expense) income\nSettlement and curtailment charges 123.4 38.6 39.8 Other (expense) income\n121.4 98.5 178.3 Income before income taxes\n(31.0) (22.9) (40.1) Income tax provision\n$ 90.4 $ 75.6 $ 138.2 Net income attributable to Rockwell Automation, Inc.\nNet unrealized (gains) losses on cash flow hedges\nForward exchange contracts $ (6.0) $ (0.7) $ (1.9) Sales\nForward exchange contracts (33.4) (21.8) 25.4 Cost of sales\nForward exchange contracts - 0.9 (1.5) Selling, general and administrative expenses\nTreasury locks related to 2019 and 2021 debt issuances 3.5 3.6 2.3 Interest expense\n(35.9) (18.0) 24.3 Income before income taxes\n9.7 5.0 (6.5) Income tax provision\n$ (26.2) $ (13.0) $ 17.8 Net income attributable to Rockwell Automation, Inc.\nTotal reclassifications $ 64.2 $ 62.6 $ 156.0 Net income attributable to Rockwell Automation, Inc.\n(1) These components are included in the computation of net periodic benefit costs. See Note 14 for further information.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n13. Share-Based Compensation\nDuring 2023, 2022, and 2021, we recognized $88.3 million, $68.1 million, and $51.7 million of pre-tax share-based compensation expense, respectively. The total income tax benefit related to share-based compensation expense was $14.9 million, $11.2 million, and $8.6 million during 2023, 2022, and 2021, respectively. As of September 30, 2023, total unrecognized compensation cost related to share-based compensation awards, net of estimated forfeitures, was $106.5 million, which we expect to recognize over a weighted average period of approximately 1.7 years.\nDuring 2020, we adopted, and our shareowners approved, our 2020 Long-Term Incentives Plan (2020 Plan), which replaced our 2012 Long-Term Incentives Plan, as amended (2012 Plan), and our 2003 Directors Stock Plan, as amended (Directors Plan). Our 2020 Plan authorizes us to deliver up to 13.0 million shares of our common stock upon exercise of stock options, upon grant, or in payment of stock appreciation rights, performance shares, performance units, restricted stock units, or restricted stock. Our Directors Plan authorized us to deliver up to 0.5 million shares of our common stock upon exercise of stock options, upon grant, or in payment of restricted stock units. Shares relating to awards under our 2012 Plan that terminate by expiration, forfeiture, cancellation, or otherwise without the issuance or delivery of shares or that are settled in cash in lieu of shares will be available for further awards under the 2020 Plan. Approximately 8.4 million shares under our 2020 Plan remain available for future grant or payment at September 30, 2023. We use treasury stock to deliver shares of our common stock under these plans. Our 2020 Plan does not permit share-based compensation awards to be granted after February 4, 2030.\nStock Options\nWe have granted non-qualified and incentive stock options to purchase our common stock under various incentive plans at prices equal to the fair market value of the stock on the grant dates. The exercise price for stock options granted under the plans may be paid in cash, already-owned shares of common stock, or a combination of cash and such shares. Stock options expire ten years after the grant date and vest ratably over three years.\nThe per share weighted average fair value of stock options granted during the years ended September 30, 2023, 2022, and 2021, was $77.62, $87.68, and $55.50, respectively. The total intrinsic value of stock options exercised was $69.8 million, $52.8 million, and $108.4 million during 2023, 2022, and 2021, respectively. We estimated the fair value of each stock option on the date of grant using the Black-Scholes pricing model and the following assumptions:\n2023 2022 2021\nAverage risk-free interest rate 3.78 % 0.38 % 0.38 %\nExpected dividend yield 1.82 % 1.28 % 1.73 %\nExpected volatility 34 % 31 % 31 %\nExpected term (years) 4.8 4.8 4.9\nThe average risk-free interest rate is based on U.S. Treasury security rates corresponding to the expected term in effect as of the grant date. The expected dividend yield is based on the expected annual dividend as a percentage of the market value of our common stock as of the grant date. We determined expected volatility using daily historical volatility of our stock price over the most recent period corresponding to the expected term as of the grant date. We determined the expected term of the stock options using historical data adjusted for the estimated exercise dates of unexercised options.\nA summary of stock option activity for the year ended September 30, 2023, is as follows:\nShares\n(in thousands) Wtd. Avg.\nExercise\nPrice Wtd. Avg.\nRemaining\nContractual\nTerm (years) Aggregate\nIntrinsic Value\nof In-The-Money\nOptions\n(in millions)\nOutstanding at October 1, 2022 2,246 $ 186.72\nGranted 233 259.82\nExercised (539) 165.34\nForfeited (14) 282.78\nCanceled (2) 350.76\nOutstanding at September 30, 2023 1,924 200.03 5.6 $ 172.9\nExercisable at September 30, 2023 1,554 180.80 4.9 165.4\nThe amount of options expected to vest is materially consistent with those outstanding and not yet exercisable.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nPerformance Share Awards\nCertain officers and key employees are also eligible to receive shares of our common stock in payment of performance share awards granted to them. Grantees of performance shares will be eligible to receive shares of our common stock depending upon our total shareowner return, assuming reinvestment of all dividends, relative to the performance of companies in the S&P 500 Index over a three-year period for the awards granted in fiscal 2020. The number of shares actually earned for awards granted in fiscal 2020 will range from zero percent to 200 percent of the targeted number of performance shares for the three-year performance periods and will be paid, to the extent earned, in the fiscal quarter following the end of the applicable three-year performance period. Beginning with the awards granted in fiscal 2021, the total shareowner return is measured relative to the performance of companies in the following S&P 500 Selected GICS groups: Capital Goods, Software and Services, and Technology Hardware and Equipment. The number of shares actually earned for awards granted in fiscal 2023, 2022, and 2021 will range from zero percent to 200 percent of the targeted number of performance shares for the three-year performance periods and will be paid, to the extent earned, in the fiscal quarter following the end of the applicable three-year performance period.\nA summary of performance share activity for the year ended September 30, 2023, is as follows:\nShares\n(in thousands) Wtd. Avg.\nGrant Date\nShare\nFair Value\nOutstanding at October 1, 2022 97 $ 354.29\nGranted (1)\n66 340.77\nAdjustment for performance results achieved (2)\n22 265.04\nVested and issued (48) 265.04\nForfeited (6) 381.85\nOutstanding at September 30, 2023 131 364.57\n(1) Performance shares granted assuming achievement of performance goals at target.\n(2) Adjustments were due to the number of shares vested under fiscal 2020 awards at the end of the three-year performance period ended September 30, 2022, being higher than the target number of shares.\nThe following table summarizes information about performance shares vested during the years ended September 30, 2023, 2022, and 2021:\n2023 2022 2021\nPercent payout 177 % 144 % 93 %\nShares vested (in thousands) 48 68 31\nTotal fair value of shares vested (in millions) $ 12.5 $ 23.4 $ 7.4\nFor the three-year performance period ending September 30, 2023, the payout will be 92% of the target number of shares, with a maximum of approximately 32,000 shares to be delivered in payment under the awards in December 2023.\nThe per share fair value of performance share awards granted during the years ended September 30, 2023, 2022, and 2021, was $340.77, $481.28, and $298.10, respectively, which we determined using a Monte Carlo simulation and the following assumptions:\n2023 2022 2021\nAverage risk-free interest rate 4.08 % 0.94 % 0.19 %\nExpected dividend yield 1.82 % 1.28 % 1.73 %\nExpected volatility 39 % 36 % 37 %\nThe average risk-free interest rate is based on the three-year U.S. Treasury security rate in effect as of the grant date. The expected dividend yield is based on the expected annual dividend as a percentage of the market value of our common stock as of the grant date. The expected volatilities were determined using daily historical volatility for the most recent three-year period as of the grant date.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nRestricted Stock and Restricted Stock Units\nWe grant restricted stock and restricted stock units to certain employees, and non-employee directors may elect to receive a portion of their compensation in restricted stock units. Restrictions on employee restricted stock and employee restricted stock units generally lapse over periods ranging from one to five years. Director restricted stock units generally are payable upon retirement. We value restricted stock and restricted stock units at the closing market value of our common stock on the date of grant. The weighted average fair value of restricted stock and restricted stock unit awards granted during the years ended September 30, 2023, 2022, and 2021, was $263.67, $298.44, and $265.32, respectively. The total fair value of shares vested during the years ended September 30, 2023, 2022, and 2021, was $54.4 million, $35.6 million, and $10.4 million, respectively.\nA summary of restricted stock and restricted stock unit activity for the year ended September 30, 2023, is as follows:\nShares\n(in thousands) Wtd. Avg.\nGrant Date\nShare\nFair Value\nOutstanding at October 1, 2022 448 $ 271.71\nGranted 245 263.67\nVested (198) 256.98\nForfeited (28) 279.30\nOutstanding at September 30, 2023 467 273.28\nWe also granted approximately 6,600 shares of unrestricted common stock to non-employee directors during the year ended September 30, 2023. The weighted average grant date fair value of the unrestricted stock awards granted during the years ended September 30, 2023, 2022, and 2021, was $261.56, $345.00, and $228.80, respectively.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n14. Retirement Benefits\nWe sponsor funded and unfunded pension plans and other postretirement benefit plans for our employees. The pension plans provide for monthly pension payments to eligible employees after retirement. Pension benefits for salaried employees generally are based on years of credited service and average earnings. Pension benefits for hourly employees are primarily based on specified benefit amounts and years of service. Effective July 1, 2010, we closed participation in our U.S. and Canada pension plans to employees hired after June 30, 2010. Employees hired after June 30, 2010, are instead eligible to participate in defined contribution plans. Effective October 1, 2010, we also closed participation in our U.K. pension plan to employees hired after September 30, 2010, and these employees are now eligible for a defined contribution plan. Benefits to be provided to plan participants hired before July 1, 2010, or October 1, 2010, respectively, are not affected by these changes. Our policy with respect to funding our pension obligations is to fund at a minimum the amount required by applicable laws and governmental regulations. We were not required to make contributions to satisfy minimum funding requirements in our U.S. pension plans in 2023, 2022, or 2021. We did not make voluntary contributions to our U.S. qualified pension plan in 2023, 2022, and 2021.\nWe sponsor various defined contribution savings plans that allow eligible employees to contribute a portion of their income in accordance with plan specific guidelines. We contribute to savings plans and/or will match a percentage of the employee contributions up to certain limits. The Company contributions to defined contribution plans are based on age and years of service and range from 3% to 7% of eligible compensation. However, effective from May 2020 through November 2020, we temporarily suspended the 401(k) matching contribution for all U.S. employees to address the then-current and anticipated economic conditions resulting from the global COVID-19 pandemic. Expense related to these plans was $76.9 million in 2023, $63.8 million in 2022, and $58.5 million in 2021.\nOther postretirement benefits are primarily in the form of retirement medical plans that cover certain employees in the U.S. and Canada and provide for the payment of certain medical costs of eligible employees and dependents after retirement. The postretirement benefit plan was closed to employees hired after December 31, 2004.\nNet Periodic Benefit Cost (Income)\nThe components of net periodic benefit cost (income) were (in millions):\nPension Benefits Other Postretirement Benefits\n2023 2022 2021 2023 2022 2021\nService cost $ 42.0 $ 70.9 $ 90.1 $ 0.6 $ 0.8 $ 1.2\nInterest cost 149.7 135.6 125.6 2.2 1.3 1.2\nExpected return on plan assets (190.6) (230.7) (241.3) - - -\nAmortization of prior service cost (credit) 0.1 0.6 1.4 - (0.8) (5.4)\nAmortization of net actuarial (gain) loss (2.6) 59.4 141.4 0.5 0.7 1.1\nSettlement and curtailment charges 123.4 38.6 39.8 - - -\nNet periodic benefit cost (income) $ 122.0 $ 74.4 $ 157.0 $ 3.3 $ 2.0 $ (1.9)\nThe service cost component is included in Cost of sales and Selling, general and administrative expenses in the Consolidated Statement of Operations. All other components are included in Other (expense) income in the Consolidated Statement of Operations.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nSignificant assumptions used in determining net periodic benefit cost (income) were (in weighted averages):\nPension Benefits Other Postretirement Benefits\n2023 2022 2021 2023 2022 2021\nU.S. Plans\nDiscount rate 5.65 % 3.86 % 2.90 % 5.70 % 2.50 % 2.15 %\nExpected return on plan assets 7.00 % 7.00 % 7.25 % - - -\nCompensation increase rate 3.30 % 3.40 % 3.40 % - - -\nNon-U.S. Plans\nDiscount rate 4.35 % 2.01 % 1.56 % 5.10 % 2.90 % 2.20 %\nExpected return on plan assets 4.93 % 4.59 % 4.68 % - - -\nCompensation increase rate 3.03 % 3.00 % 2.90 % - - -\nNet Benefit Obligation\nBenefit obligation, plan assets, funded status, and net liability information is summarized as follows (in millions):\nPension Benefits Other Postretirement Benefits\n2023 2022 2023 2022\nBenefit obligation at beginning of year $ 3,165.6 $ 4,751.8 $ 44.2 $ 51.5\nService cost 42.0 70.9 0.6 0.8\nInterest cost 149.7 135.6 2.2 1.3\nActuarial losses (gains) 81.1 (1,216.8) 8.7 (1.1)\nPlan amendments - 4.6 - -\nPlan participant contributions 1.8 2.2 4.2 3.8\nBenefits paid (151.1) (153.8) (13.3) (11.7)\nSettlements and curtailments (585.6) (320.4) - -\nCurrency translation and other 47.3 (108.5) (0.2) (0.4)\nBenefit obligation at end of year 2,750.8 3,165.6 46.4 44.2\nPlan assets at beginning of year 2,903.9 4,192.2 - -\nActual return on plan assets 209.7 (768.0) - -\nCompany contributions 26.6 54.3 9.1 7.9\nPlan participant contributions 1.8 2.2 4.2 3.8\nBenefits paid (151.1) (153.8) (13.3) (11.7)\nSettlements and curtailments (585.6) (312.2) - -\nCurrency translation and other 52.1 (110.8) - -\nPlan assets at end of year 2,457.4 2,903.9 - -\nFunded status of plans $ (293.4) $ (261.7) $ (46.4) $ (44.2)\nNet amount on balance sheet consists of\nOther assets $ 150.4 $ 158.8 $ - $ -\nCompensation and benefits (16.8) (15.1) (7.1) (6.4)\nRetirement benefits (427.0) (405.4) (39.3) (37.8)\nNet amount on balance sheet $ (293.4) $ (261.7) $ (46.4) $ (44.2)\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe actuarial losses recorded within the benefit obligation in 2023 were primarily the result of significant lump sum payments made using a lower discount rate than our valuation rate. The actuarial gains recorded in 2022 were primarily the result of an increase in the discount rate for the U.S. Plans, which increased from 3.10% in 2021 to 5.65% in 2022. Approximately 70 percent of our 2023 global projected benefit obligation relates to our U.S. pension plan.\nAmounts included in Accumulated other comprehensive loss, net of tax, which have not yet been recognized in net periodic benefit cost (income) are as follows (in millions):\nPension Benefits Other Postretirement Benefits\n2023 2022 2023 2022\nPrior service (credit) cost $ (153.2) $ (61.3) $ 4.7 $ 4.7\nNet actuarial loss 548.9 503.9 6.7 0.5\nTotal $ 395.7 $ 442.6 $ 11.4 $ 5.2\nDuring 2023, we recognized prior service costs (credits), settlements, and curtailments of $123.5 million ($91.9 million net of tax) and net actuarial gains of $2.1 million ($1.5 million net of tax) in pension and other postretirement net periodic benefit cost (income), which were included in Accumulated other comprehensive loss at September 30, 2022.\nThe accumulated benefit obligation for our pension plans was $2,584.6 million and $2,982.0 million at September 30, 2023 and 2022, respectively.\nInformation regarding our pension plans with projected benefit obligations in excess of the fair value of plan assets (underfunded plans) are as follows (in millions):\n2023 2022\nProjected benefit obligation $ 2,082.7 $ 2,529.0\nFair value of plan assets 1,638.9 2,108.5\nInformation regarding our pension plans with accumulated benefit obligations in excess of the fair value of plan assets (underfunded plans) are as follows (in millions):\n2023 2022\nAccumulated benefit obligation $ 1,926.2 $ 2,365.5\nFair value of plan assets 1,626.7 2,108.5\nSignificant assumptions used in determining the benefit obligations were (in weighted averages):\nPension Benefits Other Postretirement Benefits\n2023 2022 2023 2022\nU.S. Plans\nDiscount rate 6.10 % 5.65 % 6.20 % 5.70 %\nCompensation increase rate 3.60 % 3.30 % - -\nHealth care cost trend rate (1)\n- - 6.50 % 6.50 %\nNon-U.S. Plans\nDiscount rate 4.65 % 4.35 % 5.75 % 5.10 %\nCompensation increase rate 3.24 % 3.03 % - -\nHealth care cost trend rate (1)\n- - 4.50 % 4.50 %\n(1) The health care cost trend rate reflects the estimated increase in gross medical claims costs. As a result of the plan amendment adopted effective October 1, 2002, our effective per person retiree medical cost increase is zero percent beginning in 2005 for the majority of our postretirement benefit plans. For our other plans, we assume the gross health care cost trend rate will remain at 6.50% in 2024 and decrease to 5.00% in 2025 for U.S. Plans and will not change in future periods for Non-U.S. Plans.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nEstimated Future Payments\nWe expect to contribute $26.6 million related to our global pension plans and $7.3 million to our postretirement benefit plans in 2024.\nThe following benefit payments, which include employees expected future service, as applicable, are expected to be paid (in millions):\nPension Benefits Other\nPostretirement Benefits\n2024 $ 302.8 $ 7.3\n2025 210.5 6.8\n2026 213.4 6.2\n2027 226.6 5.6\n2028 222.4 5.0\n2029-2033 1,124.7 15.5\nPlan Assets\nIn determining the expected long-term rate of return on assets assumption, we consider actual returns on plan assets over the long term, adjusted for forward-looking considerations, such as inflation, interest rates, equity performance, and the active management of the plans invested assets. We also considered our current and expected mix of plan assets in setting this assumption. This resulted in the selection of the weighted average long-term rate of return on assets assumption. Our global weighted average targeted and actual asset allocations at September 30, by asset category, are:\nTarget September 30,\nAsset Category Allocations 2023 2022\nEquity securities 38% 50% 53%\nDebt securities 52% 43% 41%\nOther 10% 7% 6%\nThe investment objective for pension funds related to our defined benefit plans is to meet the plans benefit obligations, while maximizing the long-term growth of assets without undue risk. We strive to achieve this objective by investing plan assets within target allocation ranges and diversification within asset categories. Target allocation ranges are guidelines that are adjusted periodically based on ongoing monitoring by plan fiduciaries. Investment risk is controlled by rebalancing to target allocations on a periodic basis and ongoing monitoring of investment manager performance relative to the investment guidelines established for each manager.\nAs of September 30, 2023 and 2022, our pension plans do not directly own our common stock.\nIn certain countries where we operate, there are no legal requirements or financial incentives provided to companies to pre-fund pension obligations. In these instances, we typically make benefit payments directly from cash as they become due, rather than by creating a separate pension fund.\nThe valuation methodologies used for our pension plans investments measured at fair value are described as follows. There have been no changes in the methodologies used at September 30, 2023 and 2022.\nPreferred and common stock - Valued at the closing price reported on the active market on which the individual securities are traded.\nMutual funds - Valued at the closing price reported on the active market on which the individual funds are traded.\nPreferred and corporate debt - Valued at either the yields currently available on comparable securities of issuers with similar credit ratings or valued under a discounted cash flow approach that maximizes observable inputs, such as current yields of similar instruments, but includes adjustments for certain risks that may not be observable such as credit and liquidity risks.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nGovernment securities - Valued at the most recent closing price on the active market on which the individual securities are traded or, absent an active market, utilizing observable inputs such as closing prices in less frequently traded markets.\nCommon collective trusts - Valued at the net asset value (NAV) as determined by the custodian of the fund. The NAV is based on the fair value of the underlying assets owned by the fund, minus its liabilities then divided by the number of units outstanding.\nPrivate equity and alternative equity - Valued at the estimated fair value, as determined by and subject to the judgment of, the respective fund manager based on the NAV of the investment units held at year end.\nReal estate funds - Consists of the real estate funds, which provide an indirect investment into a diversified and multi-sector portfolio of property assets. Publicly-traded real estate funds are valued at the most recent closing price reported on the SIX Swiss Exchange. The remainder is valued at the estimated fair value, as determined by the respective fund manager, based on the NAV of the investment units held at year end, which is subject to judgment.\nInsurance contracts - Valued at the aggregate amount of accumulated contribution and investment income, less amounts used to make benefit payments and administrative expenses, which approximates fair value.\nOther - Consists of other fixed income investments and common collective trusts with a mix of equity and fixed income underlying assets. Other fixed income investments are valued at the most recent closing price reported in the markets in which the individual securities are traded, which may be infrequently.\nRefer to Note 1 for further information regarding levels in the fair value hierarchy.\nIn accordance with ASC Subtopic 820-10, certain investments that are measured at fair value using the NAV (or its equivalent) practical expedient have not been classified in the fair value hierarchy. The fair value amounts presented in this table are intended to permit reconciliation of the fair value hierarchy to the line items presented in the consolidated financial statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table presents our pension plans investments measured at fair value as of September 30, 2023 (in millions):\nLevel 1 Level 2 Level 3 Total\nU.S. Plans\nCash and cash equivalents $ 3.2 $ - $ - $ 3.2\nEquity securities\nMutual funds 40.5 - - 40.5\nPreferred and common stock 381.8 - - 381.8\nCommon collective trusts - 447.4 - 447.4\nFixed income securities\nPreferred and corporate debt - 387.2 - 387.2\nGovernment securities 212.3 30.2 - 242.5\nCommon collective trusts - 104.5 - 104.5\nTotal U.S. Plans investments in fair value hierarchy $ 637.8 $ 969.3 $ - 1,607.1\nU.S. Plans investments measured at NAV\nPrivate equity and alternative equity 11.7\nTotal U.S. Plans investments 1,618.8\nNon-U.S. Plans\nCash and cash equivalents $ 7.0 $ - $ - 7.0\nEquity securities\nPreferred and common stock 154.7 - - 154.7\nCommon collective trusts - 209.7 - 209.7\nFixed income securities\nPreferred and corporate debt - 30.3 - 30.3\nGovernment securities 0.8 - - 0.8\nCommon collective trusts - 294.5 - 294.5\nOther types of investments\nReal estate funds - 55.3 - 55.3\nInsurance contracts - - 65.2 65.2\nOther - - 2.4 2.4\nTotal Non-U.S. Plans investments in fair value hierarchy $ 162.5 $ 589.8 $ 67.6 819.9\nNon-U.S. Plans investments measured at NAV\nReal estate funds 18.7\nTotal Non-U.S. Plans investments 838.6\nTotal investments measured at fair value $ 2,457.4\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table presents our pension plans investments measured at fair value as of September 30, 2022 (in millions):\nLevel 1 Level 2 Level 3 Total\nU.S. Plans\nCash and cash equivalents $ 3.1 $ - $ - $ 3.1\nEquity securities\nMutual funds 53.1 - - 53.1\nPreferred and common stock 532.9 - - 532.9\nCommon collective trusts - 621.1 - 621.1\nFixed income securities\nPreferred and corporate debt - 453.1 - 453.1\nGovernment securities 224.8 41.6 - 266.4\nCommon collective trusts - 143.6 - 143.6\nTotal U.S. Plans investments in fair value hierarchy $ 813.9 $ 1,259.4 $ - 2,073.3\nU.S. Plans investments measured at NAV\nPrivate equity and alternative equity 18.0\nTotal U.S. Plans investments 2,091.3\nNon-U.S. Plans\nCash and cash equivalents $ 13.3 $ - $ - 13.3\nEquity securities\nPreferred and common stock 143.2 - - 143.2\nCommon collective trusts - 185.1 - 185.1\nFixed income securities\nPreferred and corporate debt - 39.7 - 39.7\nGovernment securities 1.3 - - 1.3\nCommon collective trusts - 291.3 - 291.3\nOther types of investments\nReal estate funds - 63.7 - 63.7\nInsurance contracts - - 54.9 54.9\nOther - - 3.8 3.8\nTotal Non-U.S. Plans investments in fair value hierarchy $ 157.8 $ 579.8 $ 58.7 796.3\nNon-U.S. Plans investments measured at NAV\nReal estate funds 16.3\nTotal Non-U.S. Plans investments 812.6\nTotal investments measured at fair value $ 2,903.9\nThe table below sets forth a summary of changes in fair market value of our pension plans Level 3 assets for the year ended September 30, 2023 (in millions):\nBalance September 30, 2022 Realized Gains (Losses) Unrealized Gains (Losses) Purchases, Sales, Issuances, and Settlements, Net Balance September 30, 2023\nNon-U.S. Plans\nInsurance contracts $ 54.9 $ - $ 9.6 $ 0.7 $ 65.2\nOther 3.8 - - (1.4) 2.4\n$ 58.7 $ - $ 9.6 $ (0.7) $ 67.6\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe table below sets forth a summary of changes in fair market value of our pension plans Level 3 assets for the year ended September 30, 2022 (in millions):\nBalance\nOctober 1, 2021 Realized Gains (Losses) Unrealized Gains (Losses) Purchases, Sales, Issuances, and Settlements, Net Balance September 30, 2022\nU.S. Plans\nInsurance contracts $ 0.9 $ - $ - $ (0.9) $ -\nNon-U.S. Plans\nInsurance contracts 106.2 - (50.9) (0.4) 54.9\nOther 4.7 - (0.7) (0.2) 3.8\n$ 111.8 $ - $ (51.6) $ (1.5) $ 58.7\n15. Other (Expense) Income\nThe components of Other (expense) income were (in millions):\n2023 2022 2021\nInterest income $ 9.7 $ 4.4 $ 1.6\nRoyalty income 13.2 10.9 10.2\nLegacy product liability and environmental charges (18.1) (15.6) (10.6)\nNon-operating pension and postretirement benefit cost (82.7) (4.7) (63.8)\nLegal settlement (Note 17) - - 70.0\nOther 6.6 3.4 (1.7)\nOther (expense) income $ (71.3) $ (1.6) $ 5.7\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n16. Income Taxes\nSelected income tax data (in millions):\n2023 2022 2021\nComponents of Income before income taxes\nUnited States $ 794.2 $ 371.3 $ 885.1\nNon-United States 814.3 702.3 641.1\nTotal $ 1,608.5 $ 1,073.6 $ 1,526.2\nComponents of Income tax provision\nCurrent\nUnited States $ 221.3 $ 71.6 $ 149.6\nNon-United States 160.6 102.9 190.7\nState and local 48.7 13.6 25.7\nTotal current 430.6 188.1 366.0\nDeferred\nUnited States (84.6) (10.7) (154.7)\nNon-United States 6.0 (13.0) (19.0)\nState and local (21.5) (9.9) (10.4)\nTotal deferred (100.1) (33.6) (184.1)\nIncome tax provision $ 330.5 $ 154.5 $ 181.9\nTotal income taxes paid $ 344.9 $ 340.2 $ 329.3\nIncome tax liabilities of $175.3 million and $233.7 million related to the U.S. transition tax under the Tax Cuts and Jobs Act of 2017 (the Tax Act) that are payable greater than 12 months from September 30, 2023 and 2022, respectively, are recorded in Other liabilities in the Consolidated Balance Sheet. Furthermore, taxes paid as a result of the transition tax was $31.1 million during the year ended September 30, 2023 and $31.2 million during each of the years ended September 30, 2022 and 2021, respectively, as included in total income taxes paid.\nEffective Tax Rate Reconciliation\nThe reconciliation between the U.S. federal statutory rate and our effective tax rate was:\n2023 2022 2021\nStatutory tax rate 21.0 % 21.0 % 21.0 %\nState and local income taxes 1.5 0.5 1.4\nNon-United States taxes (4.7) (5.4) (3.8)\nRepatriation of foreign earnings 0.9 1.1 0.9\nForeign-derived intangible income (0.6) (0.5) (2.8)\nSettlements with taxing authorities 0.3 - (1.0)\nChange in valuation allowance (1)\n4.1 (0.5) (1.7)\nShare-based compensation (0.6) (1.0) (1.1)\nResearch and development tax credit (1.3) (1.0) (0.6)\nOther (0.1) 0.2 (0.4)\nEffective income tax rate 20.5 % 14.4 % 11.9 %\n(1) During fiscal 2021, we reversed our valuation allowance against deferred tax assets associated with the change in fair value of the PTC Shares. This resulted in a decrease to the effective tax rate of 1.7% and no remaining valuation allowance related to PTC Shares, as described further in the table below. During fiscal year 2023, the effective tax rate increased by 4.1% resulting from a valuation allowance recorded on certain deferred tax assets of our Sensia joint venture and tax effects of the related goodwill impairment.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nWe operate in certain non-U.S. tax jurisdictions under government-sponsored tax incentive programs, which may be extended if certain additional requirements are met. The program, which generates the primary benefit has been extended to expire in 2032. The tax benefit attributable to these programs was $62.1 million ($0.54 per diluted share) in 2023, $58.3 million ($0.50 per diluted share) in 2022, and $61.2 million ($0.52 per diluted share) in 2021.\nDeferred Taxes\nThe tax effects of temporary differences that give rise to our net deferred income tax assets (liabilities) consists of (in millions):\n2023 2022\nDeferred income tax assets\nCompensation and benefits $ 35.0 $ 26.7\nInventory 15.5 10.4\nReturns, rebates, and incentives 75.1 61.7\nRetirement benefits 85.4 80.7\nEnvironmental remediation and other site-related costs 23.6 23.6\nShare-based compensation 22.7 21.5\nOther accruals and reserves 333.3 249.9\nNet operating loss carryforwards 60.8 85.2\nTax credit carryforwards 9.2 19.3\nCapital loss carryforwards 14.4 13.0\nOther 48.1 10.7\nSubtotal 723.1 602.7\nValuation allowance (89.1) (23.1)\nNet deferred income tax assets 634.0 579.6\nDeferred income tax liabilities\nProperty (44.1) (36.9)\nIntangible assets (144.8) (149.8)\nInvestments - (26.0)\nUnremitted earnings of foreign subsidiaries (27.2) (20.0)\nOther (1.8) (2.1)\nDeferred income tax liabilities (217.9) (234.8)\nTotal net deferred income tax assets $ 416.1 $ 344.8\nWe provide for deferred taxes on the majority of earnings of our non-U.S. subsidiaries and have done so since the enactment of the Tax Act in 2017. We do not provide for deferred taxes on a limited number of our non-U.S. subsidiaries established in jurisdictions that apply significant restrictions for repatriating cash. The amount of cumulative non-distributed earnings considered to be indefinitely reinvested outside the U.S. at September 30, 2023, is $125.8 million. It is not practicable to estimate the amount of additional taxes that may be payable upon distribution of these earnings.\nWe believe it is more likely than not that we will realize our deferred tax assets through the reduction of future taxable income, other than for the deferred tax assets reflected below.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nTax attributes and related valuation allowances at September 30, 2023 consists of (in millions):\nTax attributes and related valuation allowances Tax Benefit Amount Valuation Allowance Carryforward\nPeriod Ends\nNon-United States net operating loss carryforward $ 5.9 $ 2.5 2024 - 9/30/2030\nNon-United States net operating loss carryforward 46.1 39.3 Indefinite\nNon-United States capital loss carryforward 14.4 14.4 Indefinite\nUnited States credit carryforward 0.9 - 2030 - 2041\nUnited States net operating loss carryforward 0.1 - 2024 - 2036\nState and local net operating loss carryforward 8.7 1.0 2024 - 2040\nState tax credit carryforward 8.3 - 2024 - 2037\nSubtotal 84.4 57.2\nOther deferred tax assets 31.9 31.9 Indefinite\nTotal $ 116.3 $ 89.1\nUnrecognized Tax Benefits\nA reconciliation of our gross unrecognized tax benefits, excluding interest and penalties, is as follows (in millions):\n2023 2022 2021\nGross unrecognized tax benefits balance at beginning of year $ 3.9 $ 4.3 $ 25.5\nAdditions based on tax positions related to the current year 3.9 0.1 0.1\nAdditions based on tax positions related to prior years 3.2 - 0.4\nReductions related to settlements with taxing authorities (1.0) (0.5) (18.1)\nReductions related to lapses of statute of limitations (0.2) - (3.6)\nGross unrecognized tax benefits balance at end of year $ 9.8 $ 3.9 $ 4.3\nThe amount of gross unrecognized tax benefits that would reduce our effective tax rate if recognized was $9.8 million, $3.9 million, and $4.3 million at September 30, 2023, 2022, and 2021, respectively.\nAccrued interest and penalties related to unrecognized tax benefits were $0.9 million, $1.4 million, $1.5 million at September 30, 2023, 2022, and 2021 respectively. We recognize interest and penalties related to unrecognized tax benefits in the income tax provision. Benefits recognized in 2023, 2022, and 2021 were $0.5 million, $0.0 million, and $2.5 million, respectively.\nWe believe it is reasonably possible that the amount of gross unrecognized tax benefits could be reduced by up to $2.3 million in the next 12 months as a result of the resolution of tax matters in various global jurisdictions and the lapses of statutes of limitations. If all of the unrecognized tax benefits were recognized, the net reduction to our income tax provision, including the recognition of interest and penalties and offsetting tax assets, could be up to $3.1 million.\nWe conduct business globally and are routinely audited by the various tax jurisdictions in which we operate. We are no longer subject to U.S. federal income tax examinations for years before 2018, U.S. state and local income tax examinations for years before 2014, and non-U.S. income tax examinations for years before 2008.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n17. Commitments and Contingent Liabilities\nEnvironmental Matters\nFederal, state, and local requirements relating to the discharge of substances into the environment, the disposal of hazardous wastes, and other activities affecting the environment have and will continue to have an effect on our manufacturing operations. Thus far, compliance with environmental requirements and resolution of environmental claims have been accomplished without material effect on our business, financial condition, or results of operations.\nWe have been designated as a potentially responsible party at 14 Superfund sites, excluding sites as to which our records disclose no involvement or as to which our potential liability has been finally determined and assumed by third parties. In addition, various other lawsuits, claims, and proceedings have been asserted against us seeking remediation of alleged environmental impairments, principally at previously owned properties.\nBased on our assessment, we believe that our expenditures for environmental capital investment and remediation necessary to comply with present regulations governing environmental protection and other expenditures for the resolution of environmental claims will not have a material effect on our business, financial condition, or results of operations. We cannot assess the possible effect of compliance with future requirements. Environmental remediation cost liabilities, net of related expected recoveries, were $44.5 million and $46.0 million as of September 30, 2023 and 2022, respectively.\nConditional Asset Retirement Obligations\nWe accrue for costs related to a legal obligation associated with the retirement of a tangible long-lived asset that results from the acquisition, construction, development, or the normal operation of the long-lived asset. The obligation to perform the asset retirement activity is not conditional even though the timing or method may be conditional. Identified conditional asset retirement obligations include asbestos abatement and remediation of soil contamination beneath current and previously divested facilities and lease restoration costs. We estimate conditional asset retirement obligations using site-specific knowledge and historical industry expertise. There have been no significant changes in liabilities incurred, liabilities settled, accretion expense, or revisions in estimated cash flows for the years ended September 30, 2023, 2022, and 2021. Conditional asset retirement obligations, net of related expected recoveries, were $38.8 million and $24.6 million as of September 30, 2023 and 2022, respectively.\nOther Matters\nVarious other lawsuits, claims, and proceedings have been or may be instituted or asserted against us relating to the conduct of our business, including those pertaining to product liability, environmental, safety and health, intellectual property, employment, and contract matters. Although the outcome of litigation cannot be predicted with certainty and some lawsuits, claims, or proceedings may be disposed of unfavorably to us, we believe the disposition of matters that are pending or have been asserted will not have a material effect on our business, financial condition, or results of operations. The following outlines additional background for obligations associated with asbestos, divested businesses, and intellectual property.\nWe (including our subsidiaries) have been named as a defendant in lawsuits alleging personal injury as a result of exposure to asbestos that was used in certain components of our products many years ago, including products from divested businesses for which we have agreed to defend and indemnify claims. Currently there are lawsuits that name us as defendants, together with hundreds of other companies. But in all cases, for those claimants who do show that they worked with our products or products of divested businesses for which we are responsible, we nevertheless believe we have meritorious defenses, in substantial part due to the integrity of the products, the encapsulated nature of any asbestos-containing components, and the lack of any impairing medical condition caused by our products. We defend those cases vigorously. Historically, we have been dismissed from the vast majority of these claims with no payment to claimants.\nAdditionally, we have maintained insurance coverage that includes indemnity and defense costs, over and above self-insured retentions, for many of these claims. We believe these arrangements will provide substantial coverage for future defense and indemnity costs for these asbestos claims for many years into the future. The uncertainties of asbestos claim litigation make it difficult to predict accurately the ultimate outcome of asbestos claims. That uncertainty is increased by the possibility of adverse rulings or new legislation affecting asbestos claim litigation or the settlement process. Subject to these uncertainties and based on our experience defending asbestos claims, we do not believe these lawsuits will have a material effect on our business, financial condition, or results of operations. Asbestos liabilities, net of related insurance coverage, were $20.0 million and $14.3 million as of September 30, 2023 and 2022, respectively.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nWe have, from time to time, divested certain of our businesses. In connection with these divestitures, certain lawsuits, claims, and proceedings may be instituted or asserted against us related to the period that we owned the businesses, either because we agreed to retain certain liabilities related to these periods or because such liabilities fall upon us by operation of law. In some instances the divested business has assumed the liabilities; however, it is possible that we might be responsible to satisfy those liabilities if the divested business is unable to do so. We do not believe these liabilities will have a material effect on our business, financial condition, or results of operations.\nIn many countries we provide a limited intellectual property indemnity as part of our terms and conditions of sale and at times in other contracts with third parties. As of September 30, 2023, we were not aware of any material indemnification claims that were probable or reasonably possible of an unfavorable outcome. Historically, claims that have been made under the indemnification agreements have not had a material impact on our business, financial condition, or results of operations; however, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our business, financial condition, or results of operations in a particular period. During the first quarter of fiscal 2021, we reached a favorable settlement agreement regarding litigation of a trademark infringement and false advertising matter and received $70 million. The settlement gain is recorded in Other (expense) income in the Consolidated Statement of Operations.\n18. Leases\nWe have operating leases primarily for real estate, vehicles, and equipment. We have finance leases primarily for equipment. Our leases have remaining lease terms from less than one year to approximately 15 years.\nWe elected the package of practical expedients permitted under the transition guidance within the new standard on accounting for leases, which allows the Company to carry forward the historical assessments of whether contracts are, or contain, leases, lease classification, and initial direct costs. We also elected to not record lease ROU assets or lease liabilities for leases with an original term of 12 months or less. We elected to use the remaining lease term for purposes of calculating the incremental borrowing rate upon transition.\nThe components of lease expense were (in millions):\n2023 2022 2021\nOperating lease expense (1)\n$ 100.2 $ 103.6 $ 109.8\nVariable lease expense (2)\n18.8 16.6 15.8\nFinance lease expense\nAmortization of right-of-use assets 5.2 6.9 1.7\nInterest on lease liabilities 0.3 0.6 0.4\nTotal lease expense $ 124.5 $ 127.7 $ 127.7\n(1) Operating lease expense includes short-term lease expense, which was not material.\n(2) Variable lease expense includes sublease income, which was not material.\nSupplemental balance sheet information related to leases consists of:\n2023 2022\nWeighted average remaining lease term\nOperating leases 5.8 years 6.3 years\nFinance leases 1.6 years 3.0 years\nWeighted average discount rate\nOperating leases 3.03 % 2.07 %\nFinance leases 3.27 % 2.04 %\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nUndiscounted maturities of lease liabilities as of September 30, 2023, were (in millions):\nFinance Leases Operating Leases\n2024 $ 7.0 $ 93.5\n2025 3.4 82.9\n2026 - 64.4\n2027 - 49.1\n2028 - 35.4\nThereafter - 73.9\nTotal undiscounted lease payments $ 10.4 $ 399.2\nLess: Imputed interest (0.3) (30.5)\nTotal lease liabilities $ 10.1 $ 368.7\nAs of September 30, 2023, we have additional operating leases for facilities that have not yet commenced with undiscounted lease obligations of approximately $52.1 million. These leases will commence in fiscal 2024.\nSupplemental cash flow information related to leases consists of (in millions):\n2023 2022 2021\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows from operating leases $ 101.7 $ 102.9 $ 108.5\nOperating cash flows from finance leases 0.3 0.6 0.4\nFinancing cash flows from finance leases 5.5 8.8 1.8\nRight-of-use assets obtained in exchange for lease obligations\nOperating leases $ 93.3 $ 63.4 $ 90.6\nFinancing leases - 11.8 0.9\n19. Business Segment Information\nWe determine our operating segments based on the information used by our chief operating decision maker, our Chief Executive Officer, to allocate resources and assess performance. We organize our business into three operating segments: Intelligent Devices, Software & Control, and Lifecycle Services. This structure emphasizes our essential offerings, leverages our sharpened industry focus, and recognizes the growing importance of software in delivering value to our customers. The composition of our segments is as follows:\nIntelligent Devices\nThe Intelligent Devices operating segment combines a comprehensive portfolio of smart products that create the foundation of an agile, resilient, and sustainable production system. This comprehensive portfolio includes:\nPower Control - Low and medium voltage variable frequency drives as well as low and medium voltage motor control;\nMotion Control - Servo drives, rotary servo motors, linear actuators, and independent cart technologies offering a comprehensive portfolio of servo control technologies;\nSafety, Sensing, & Industrial Components - Safety devices, sensing devices, motor control and circuit protection devices, operator devices, signaling devices, relays, and electrical control accessories; and\nMicro Control & Distributed I/O - Micro programmable logic controllers and distributed input/output platforms.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nSoftware & Control\nThe Software & Control operating segment contains a comprehensive portfolio of production automation and production operations platforms, including hardware and software. This integrated portfolio is merging information technology (IT) and operational technology (OT), bringing the benefits of the Connected Enterprise to the production system.\nOur production automation portfolio is multi-discipline and scalable with the ability to handle applications in discrete, batch/hybrid and continuous process, drives control, motion and robotics control, machine safety and process safety. Our products include programmable automation controllers, design, visualization and simulation software, human machine interface products, industrial computers, machine safety and process safety products, industrial networks, and security products.\nOur production operations portfolio helps industrial clients to plan, execute, manage, and optimize their production leveraging industrial data and software. Our software products include manufacturing execution systems, performance, quality, supply chain management, data management, edge, analytics, and machine learning software that enables customers to improve operational productivity and meet regulatory requirements. These solutions enable enterprise visibility, reduction of unplanned downtime, and optimization of processes.\nLifecycle Services\nThe Lifecycle Services operating segment contains a complete portfolio of professionally delivered services and annually recurring managed support contracts. This comprehensive portfolio combines technology and domain expertise to help maximize customers investment and provide total lifecycle support as they innovate, design, operate, and sustain their business investments. This includes:\nconsulting services including cybersecurity and digital transformation strategy and design;\nprofessional services including global automation and information program and project management and delivery capabilities;\nconnected services including operational technology/plant network, cloud, predictive/prescriptive analytics, remote support, and managed services;\nfield services including asset management, on-site support, and safety;\nworkforce services including instructor-led and virtual training, learning, and enablement;\nindustrial automation and information solutions and custom-engineered systems that incorporate our own and third-party hardware and software products; and\nSensia Joint Venture, which exclusively serves the oil, gas, and petrochemical industry through a combination of connected products and digital automation services and solutions.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nSales and operating results of our reportable segments were (in millions):\n2023 2022 2021\nSales\nIntelligent Devices $ 4,098.2 $ 3,544.6 $ 3,311.9\nSoftware & Control 2,886.0 2,312.9 1,947.0\nLifecycle Services 2,073.8 1,902.9 1,738.5\nTotal $ 9,058.0 $ 7,760.4 $ 6,997.4\nSegment operating earnings\nIntelligent Devices $ 828.2 $ 717.6 $ 702.1\nSoftware & Control 953.2 666.7 531.0\nLifecycle Services 148.4 158.3 158.2\nTotal 1,929.8 1,542.6 1,391.3\nPurchase accounting depreciation and amortization, and impairment (264.4) (103.9) (55.1)\nCorporate and other (127.9) (104.7) (120.6)\nNon-operating pension and postretirement benefit cost (82.7) (4.7) (63.8)\nChange in fair value of investments 279.3 (136.9) 397.4\nLegal settlement - - 70.0\nInterest expense, net (125.6) (118.8) (93.0)\nIncome before income taxes $ 1,608.5 $ 1,073.6 $ 1,526.2\nAmong other considerations, we evaluate performance and allocate resources based upon segment operating earnings before purchase accounting depreciation and amortization, impairment, corporate and other, non-operating pension and postretirement benefit cost, change in fair value of investments, the $70 million legal settlement in fiscal 2021, interest expense, net, and income tax provision. Depending on the product, intersegment sales within a single legal entity are either at cost or cost plus a mark-up, which does not necessarily represent a market price. Sales between legal entities are at an appropriate transfer price. We allocate costs related to shared segment operating activities to the segments consistent with the methodology used by management to assess segment performance.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following tables summarize the identifiable assets at September 30, 2023, 2022, and 2021, and the provision for depreciation and amortization and the amount of capital expenditures for property for the years then ended, for each of the reportable segments and Corporate (in millions):\n2023 2022 2021\nIdentifiable assets\nIntelligent Devices $ 2,676.2 $ 2,070.0 $ 2,143.3\nSoftware & Control 4,240.7 3,887.6 4,000.4\nLifecycle Services 1,835.8 1,968.4 2,124.3\nCorporate 2,551.3 2,832.7 2,433.6\nTotal $ 11,304.0 $ 10,758.7 $ 10,701.6\nDepreciation and amortization\nIntelligent Devices $ 49.7 $ 45.8 $ 48.6\nSoftware & Control 55.8 47.0 49.1\nLifecycle Services 35.5 40.5 35.3\nCorporate 2.5 1.7 1.7\nTotal 143.5 135.0 134.7\nPurchase accounting depreciation and amortization 106.9 103.9 55.1\nTotal $ 250.4 $ 238.9 $ 189.8\nCapital expenditures for property\nIntelligent Devices $ 60.7 $ 45.6 $ 52.0\nSoftware & Control 40.2 29.7 30.4\nLifecycle Services 23.7 32.9 19.6\nCorporate 35.9 32.9 18.3\nTotal $ 160.5 $ 141.1 $ 120.3\nIdentifiable assets at Corporate consist principally of cash, net deferred income tax assets, prepaid pension, and property. Property shared by the segments and used in operating activities is also reported in Corporate identifiable assets and Corporate capital expenditures. Corporate identifiable assets include shared net property balances of $240.9 million, $205.8 million, and $275.8 million at September 30, 2023, 2022, and 2021, respectively, for which depreciation expense has been allocated to segment operating earnings based on the expected benefit to be realized by each segment. Corporate capital expenditures in 2023, 2022, and 2021, primarily consist of property that will be shared by our operating segments.\nWe conduct a significant portion of our business activities outside the United States. The following tables present sales and property by geographic region (in millions):\nSales Property\n2023 2022 2021 2023 2022 2021\nNorth America $ 5,224.0 $ 4,722.0 $ 4,132.8 $ 478.8 $ 430.7 $ 416.1\nEurope, Middle East and Africa 1,870.6 1,437.6 1,405.7 116.4 78.9 91.1\nAsia Pacific 1,358.0 1,088.0 1,012.2 66.2 58.6 54.8\nLatin America 605.4 512.8 446.7 22.8 18.3 19.9\nTotal $ 9,058.0 $ 7,760.4 $ 6,997.4 $ 684.2 $ 586.5 $ 581.9\nWe attribute sales to the geographic regions based on the country of destination. Sales in North America include $4,773.2 million, $4,315.5 million, and $3,740.2 million related to the U.S. in 2023, 2022, and 2021, respectively.\nIn most countries, we sell primarily through independent distributors in conjunction with our direct sales force. We sell large systems and service offerings principally through our direct sales force, though opportunities are sometimes identified through distributors. Sales to our two largest distributors in 2023, 2022, and 2021, which are attributable to all three segments, were approximately 20 percent of our total sales.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n20. Subsequent Events\nClearpath Robotics, Inc.\nOn October 2, 2023, we acquired Clearpath Robotics, Inc., (Clearpath) a company that specializes in autonomous robotics for industrial applications, headquartered in Ontario, Canada for approximately $565 million of cash and up to $50 million of contingent consideration. As of the acquisition date, we will record a preliminary purchase price allocation for the assets acquired and liabilities assumed in connection with the acquisition based on their estimated fair values as of the acquisition date. We expect to allocate a significant portion of the purchase price to goodwill and intangible assets. We will assign the full amount of goodwill to our Intelligent Devices segment. We do not expect the goodwill to be deductible for tax purposes.\nVerve Industrial Protection\nOn November 1, 2023, we acquired Verve Industrial Protection, a cybersecurity software and services company that focuses specifically on industrial environments, for a total purchase consideration, net of cash acquired, of approximately $185 million. As of the acquisition date, we will record a preliminary purchase price allocation for the assets acquired and liabilities assumed in connection with the acquisition based on their estimated fair values as of the acquisition date. We expect to allocate a significant portion of the purchase price to goodwill and intangible assets. We will assign the full amount of goodwill to our Lifecycle Services segment. We expect the goodwill to be deductible for tax purposes.\nWe have not completed our analysis of identifying and estimating the fair value of contingent consideration for the Clearpath acquisition and identifiable intangible assets acquired for both acquisitions. The measurement period for the valuation of net assets acquired ends as soon as information on the facts and circumstances that existed as of the acquisition date becomes available, but not to exceed 12 months following the acquisition date. Adjustments in purchase price allocations may require a change in the amounts allocated to net assets acquired during the periods in which the adjustments are determined.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareowners and the Board of Directors of\nRockwell Automation, Inc.\nMilwaukee, Wisconsin\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Rockwell Automation, Inc. and subsidiaries (the Company) as of September 30, 2023 and 2022, the related consolidated statements of operations, comprehensive income, cash flows, and shareowners equity for each of the three years in the period ended September 30, 2023, and the related notes and the schedule listed in the Index at Item 15 (a)(2) (collectively referred to as the financial statements). We also have audited the Companys internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America. Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nBasis for Opinions\nThe Companys management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on these financial statements and an opinion on the Companys internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nGoodwill Valuation - Sensia Reporting Unit - Refer to Note 3 to the financial statements\nCritical Audit Matter Description\nThe Company performed their annual quantitative test for goodwill impairment during the second quarter of fiscal 2023. As of the annual measurement date, the Company determined that the fair value of the Sensia reporting unit exceeded its carrying value by approximately 10 percent and, therefore, no impairment was recognized. Subsequent to the annual quantitative test for goodwill impairment, the Company identified a triggering event in the fourth quarter.\nAs a result of this triggering event in the fourth quarter, the Company performed an interim quantitative analysis on goodwill for the Sensia reporting unit using a combination of an income approach derived from discounted cash flows and a market multiples approach using selected comparable public companies, consistent with the annual impairment testing. The determination of the fair value using the income approach requires management to make significant estimates and assumptions related to the discount rate and forecasts of future revenues and Earnings Before Interest, Taxes, Depreciation, and Amortization (EBITDA) margins. The determination of fair value using the market multiples approach requires management to make significant assumptions related to the selection of the market multiple. As of the fourth quarter testing date, the Sensia reporting unit carrying value of $665.1 million was determined to be in excess of its fair value and an impairment loss of $157.5 million was recorded. Subsequent to the recording of the impairment loss, the Companys consolidated goodwill balance was $3,529.2 million as of September 30, 2023, of which $160.3 million of goodwill remains within the Sensia reporting unit. Changes in the critical assumptions outlined above could have a significant impact on the fair value of the reporting unit, the amount of any goodwill impairment charge, or both.\nWe identified the impairment evaluation of goodwill for the Sensia reporting unit as a critical audit matter because of the inherent subjectivity involved in managements estimates and assumptions related to forecasts of future revenues and EBITDA margins, and selection of the discount rate and market multiple. The audit procedures to evaluate the reasonableness of managements estimates and assumptions required a high degree of auditor judgment and an increased extent of effort, including the need to involve our fair value specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to forecasts of future revenues and EBITDA margins, and selection of the discount rate and market multiple for the Sensia reporting unit included the following for both quantitative tests, among others:\nWe tested the effectiveness of controls over managements goodwill impairment evaluation, including those over managements development of forecasts of future revenues and EBITDA margins as well as the selection of the discount rate and market multiple.\nWe evaluated the reasonableness of managements forecasts by comparing the forecasts to (1) historical results, (2) internal communications to management and those charged with governance of Sensia, and (3) forecasted information included in analyst and industry reports for the Company and its peer companies, including the impact of industry-specific and economic factors on Sensias Oil & Gas customers.\nWith the assistance of our fair value specialists, we evaluated the reasonableness of the discount rate by (1) testing the source information underlying the determination of the discount rate; (2) testing the mathematical accuracy of the calculations; and (3) developing a range of independent estimates and comparing those to the discount rate selected by management.\nWith the assistance of our fair value specialists, we evaluated the reasonableness of the selected market multiple by (1) assessing the appropriateness of the selected comparable public companies; (2) testing the source information utilized; and (3) comparing the market multiple selected by management to such companies.\n/s/ DELOITTE & TOUCHE LLP\nMilwaukee, Wisconsin\nNovember 8, 2023\nWe have served as the Companys auditor since 1967. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including the Chief Executive Officer and Chief Financial Officer, we have evaluated the effectiveness, as of September 30, 2023, of our disclosure controls and procedures, as defined in Rule 13a-15(e) and Rule 15d-15(e) under the Exchange Act. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures were effective as of September 30, 2023.\nManagements Report on Internal Control Over Financial Reporting\nWe are responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rule 13a-15(f) under the Exchange Act. Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Under the supervision and with the participation of our management, including the Chief Executive Officer and Chief Financial Officer, we evaluated the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on that evaluation, management has concluded that our internal control over financial reporting was effective as of September 30, 2023.\nThe effectiveness of our internal control over financial reporting, as of September 30, 2023, has been audited by Deloitte & Touche LLP, as stated in their report that is included on the previous page.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control Over Financial Reporting\nThere has not been any change in our internal control over financial reporting (as such term is defined in Rule 13a-15(f) under the Exchange Act) during the fiscal quarter to which this report relates that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nDuring the quarter ended September 30, 2023, no director or officer of the Company adopted or terminated a Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement, as each term is defined in Item 408 of Regulation S-K.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance\nOther than the information below, the information required by this Item 10 is incorporated by reference to the sections entitled Corporate Governance, Election of Directors, and Stock Ownership Information in the Proxy Statement.\nNo nominee for director was selected pursuant to any arrangement or understanding between the nominee and any person other than the Company pursuant to which such person is or was to be selected as a director or nominee. See also the information about executive officers of the Company under Item 4A of Part I.\nWe have adopted a code of ethics that applies to our executive officers, including the principal executive officer, principal financial officer, and principal accounting officer. A copy of our Code of Conduct is posted on our Internet site at https://www.rockwellautomation.com under the Investors link. In the event that we amend or grant any waiver from a provision of the code of ethics that applies to the principal executive officer, principal financial officer, or principal accounting officer, and that requires disclosure under applicable SEC rules, we intend to disclose such amendment or waiver and the reasons therefor on our Internet site. Item 11. Executive Compensation\nThe information required by this Item 11 is incorporated by reference to the sections entitled Executive Compensation, Election of Directors, Corporate Governance, and Compensation and Talent Management Committee Report in the Proxy Statement. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nOther than the information below, the information required by this Item 12 is incorporated by reference to the section entitled Stock Ownership Information in the Proxy Statement.\nThe following table provides information, as of September 30, 2023, about our common stock that may be issued upon the exercise of options, warrants, and rights granted to employees, consultants, or directors under all of our existing equity compensation plans.\nNumber of Securities to be issued upon Exercise of Outstanding Options, Warrants, and Rights Weighted Average Exercise Price of Outstanding Options, Warrants, and Rights Number of Securities Remaining Available for Future Issuance under Equity Compensation Plans (excluding Securities reflected in Column (a))\nPlan Category (a) (b) (c)\nEquity compensation plans approved by shareowners 2,649,246 (1)\n$ 200.03 (2)\n8,398,511 (3)\nEquity compensation plans not approved by shareowners - n/a -\nTotal 2,649,246 $ 200.03 8,398,511\n(1) Represents outstanding options, shares issuable in payment of outstanding performance shares (at maximum payout), and restricted stock units under our 2020 Long-Term Incentives Plan, 2012 Long-Term Incentives Plan, 2008 Long-Term Incentives Plan, and 2003 Directors Stock Plan.\n(2) Represents the weighted average exercise price of outstanding options and does not take into account the performance shares and restricted stock units.\n(3) Represents shares available for future issuance under our 2020 Long-Term Incentives Plan. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item 13 is incorporated by reference to the sections entitled Corporate Governance and Election of Directors in the Proxy Statement. Item 14. Principal Accountant Fees and Services\nThe information required by this Item 14 is incorporated by reference to the section entitled Audit Matters in the Proxy Statement.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a) Financial Statements, Financial Statement Schedule, and Exhibits\n(1)Financial Statements (all financial statements listed below are those of the Company and its consolidated subsidiaries)\nPage\nConsolidated Balance Sheet, September 30, 2023 and 2022 37\nConsolidated Statement of Operations, years ended September 30, 2023, 2022, and 2021 38\nConsolidated Statement of Comprehensive Income, years ended September 30, 2023, 2022, and 2021 39\nConsolidated Statement of Cash Flows, years ended September 30, 2023, 2022, and 2021 40\nConsolidated Statement of Shareowners Equity, years ended September 30, 2023, 2022, and 2021 41\nNotes to Consolidated Financial Statements 42\nReport of Independent Registered Public Accounting Firm (PCAOB ID No. 34)\n(2)Financial Statement Schedule for the years ended September 30, 2023, 2022, and 2021\nPage\nSchedule II-Valuation and Qualifying Accounts 95\nSchedules not filed herewith are omitted because of the absence of conditions under which they are required or because the information called for is shown in the consolidated financial statements or notes thereto.\n(3)Exhibits\n3-a\nRestated Certificate of Incorporation of the Company, filed as Exhibit 3 to the Companys Quarterly Report on Form 10-Q for the quarter ended March 31, 2002, is hereby incorporated by reference.\n3-b\nBy-Laws of the Company, as amended and restated effective June 8, 2016, filed as Exhibit 3.2 to the Companys Current Report on Form 8-K dated June 10, 2016, are hereby incorporated by reference.\n4-a-1\nIndenture dated as of December 1, 1996 between the Company and The Bank of New York Trust Company, N.A. (formerly JPMorgan Chase, successor to The Chase Manhattan Bank, successor to Mellon Bank, N.A.), as Trustee, filed as Exhibit 4-a to Registration Statement No. 333-43071, is hereby incorporated by reference.\n4-a-2\nForm of certificate for the Companys 6.70% Debentures due January 15, 2028, filed as Exhibit 4-b to the Companys Current Report on Form 8-K dated January 26, 1998, is hereby incorporated by reference.\n4-a-3\nForm of certificate for the Companys 5.20% Debentures due January 15, 2098, filed as Exhibit 4-c to the Companys Current Report on Form 8-K dated January 26, 1998, is hereby incorporated by reference.\n4-a-4\nForm of certificate for the Companys 6.25% Debentures due December 31, 2037, filed as Exhibit 4.2 to the Companys Current Report on Form 8-K dated December 3, 2007, is hereby incorporated by reference.\n4-a-5\nForm of certificate for the Companys 2.05% Notes due March 1, 2020, filed as Exhibit 4.1 to the Companys Current Report on Form 8-K dated February 17, 2015, is hereby incorporated by reference.\n4-a-6\nForm of certificate for the Companys 2.875% Notes due March 1, 2025, filed as Exhibit 4.2 to the Companys Current Report on Form 8-K dated February 17, 2015, is hereby incorporated by reference.\n4-a-7\nForm of certificate for the Companys 3.50% Notes due March 1, 2029, filed as Exhibit 4.1 to the Companys Current Report on Form 8-K dated March 1, 2019, is hereby incorporated by reference.\n4-a-8\nForm of certificate for the Companys 4.20% Notes due March 1, 2049, filed as Exhibit 4.2 to the Companys Current Report on Form 8-K dated March 1, 2019, is hereby incorporated by reference.\n4-a-9\nDescription of the Companys Securities filed as Exhibit 4-a-9 to the Companys Annual Report on Form 10-K for the year ended September 30, 2019, is hereby incorporated by reference.\n4-a-10\nForm of certificate for the Companys 0.35% Notes due August 15, 2023, filed as Exhibit 4.1 to the Companys Current Report on Form 8-K dated August 17, 2021, is hereby incorporated by reference.\n4-a-11\nForm of certificate for the Companys 1.75% Notes due August 15, 2031, filed as Exhibit 4.2 to the Companys Current Report on Form 8-K dated August 17, 2021, is hereby incorporated by reference.\n4-a-12\nForm of certificate for the Companys 2.80% Notes due August 15, 2061, filed as Exhibit 4.3 to the Companys Current Report on Form 8-K dated August 17, 2021, is hereby incorporated by reference.\n*10-a-1\nCopy of the Companys 2003 Directors Stock Plan, filed as Exhibit 4-d to the Companys Registration Statement on Form S-8 (No. 333-101780), is hereby incorporated by reference.\n*10-a-2\nMemorandum of Amendments to the Companys 2003 Directors Stock Plan approved and adopted by the Board of Directors of the Company on April 25, 2003, filed as Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the quarter ended June 30, 2003, is hereby incorporated by reference.\n*10-a-3\nMemorandum of Amendments to the Companys 2003 Directors Stock Plan approved and adopted by the Board of Directors of the Company on November 7, 2007, filed as Exhibit 10.3 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2007, is hereby incorporated by reference.\n*10-a-4\nMemorandum of Amendments to the Companys 2003 Directors Stock Plan approved and adopted by the Board of Directors of the Company on September 3, 2008, filed as Exhibit 10-b-16 to the Companys Annual Report on Form 10-K for the year ended September 30, 2008, is hereby incorporated by reference.\n*10-a-5\nForm of Restricted Stock Unit Agreement under Section 6 of the Companys 2003 Directors Stock Plan, as amended, filed as Exhibit 10.3 to the Companys Quarterly Report on Form 10-Q for the quarter ended March 31, 2008, is hereby incorporated by reference.\n*10-a-6\nCopy of the Companys Directors Deferred Compensation Plan approved and adopted by the Board of Directors of the Company on November 5, 2008, filed as Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2008, is hereby incorporated by reference.\n*10-a-7\nSummary of Non-Employee Director Compensation and Benefits as of October 1, 2021.\n*10-b-1\nCopy of the Companys 2012 Long-Term Incentives Plan, as amended and restated through February 2, 2016, filed as Exhibit 4-c to the Companys Registration Statement on Form S-8 (No. 333-209706), is hereby incorporated by reference.\n*10-b-2\nForm of Stock Option Agreement under the Companys 2012 Long-Term Incentives Plan for options granted to executive officers of the Company after December 5, 2012, filed as Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2012, is hereby incorporated by reference.\n*10-b-3\nForm of Restricted Stock Agreement under the Companys 2012 Long-Term Incentives Plan for shares of restricted stock awarded to executive officers of the Company after December 5, 2012, filed as Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2012 is hereby incorporated by reference.\n*10-b-4\nForm of Performance Share Agreement under the Companys 2012 Long-Term Incentives Plan for performance shares awarded to executive officers of the Company after December 5, 2012, filed as Exhibit 10.3 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2012 is hereby incorporated by reference.\n*10-b-5\nForm of Restricted Stock Agreement under the Companys 2012 Long-Term Incentives Plan for certain awards of shares of restricted stock to executive officers of the Company after October 29, 2019, filed as Exhibit 10-b-10 to the Companys Annual Report on Form 10-K for the year ended September 30, 2019, is hereby incorporated by reference.\n*10-b-6\nCopy of the Companys 2020 Long-Term Incentives Plan filed as Appendix A to the Companys Definitive Proxy Statement for the 2020 Annual Meeting of Shareowners is hereby incorporated by reference.\n*10-b-7\nForm of Restricted Stock Agreement under the Companys 2020 Long-Term Incentives Plan for certain awards of shares of restricted stock to executive officers of the Company filed as Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the quarter ended June 30, 2020, is hereby incorporated by reference.\n*10-b-8\nForm of Restricted Stock Unit Agreement under the Companys 2020 Long-Term Incentives Plan for certain awards of restricted stock units to executive officers of the Company, filed as Exhibit 10-b-13 to the Company's Annual Report on Form 10-K for the year ended September 30, 2020, is hereby incorporated by reference.\n*10-b-9\nForm of Global Restricted Stock Unit Agreement under the Companys 2020 Long-Term Incentives Plan for certain awards of restricted stock units to executive officers of the Company after December 9, 2020, filed as Exhibit 10-b-14 to the Company's Annual Report on Form 10-K for the year ended September 30, 2020, is hereby incorporated by reference.\n*10-b-10\nForm of Stock Option Agreement for U.S. Employees under the Companys 2020 Long-Term Incentives Plan for options awarded to executive officers of the Company after December 9, 2020, filed as Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2020, is hereby incorporated by reference.\n*10-b-11\nForm of Restricted Stock Unit Agreement for U.S. Employees under the Companys 2020 Long-Term Incentives Plan for restricted stock units awarded to executive officers of the Company after December 9, 2020, filed as Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2020, is hereby incorporated by reference.\n*10-b-12\nForm of Performance Share Agreement for U.S. Employees under the Companys 2020 Long-Term Incentives Plan for performance shares awarded to executive officers of the Company after December 9, 2020, filed as Exhibit 10.3 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2020, is hereby incorporated by reference.\n*10-c-1\nCopy of the Companys Deferred Compensation Plan, as amended and restated September 6, 2006, filed as Exhibit 10-f to the Companys Annual Report on Form 10-K for the year ended September 30, 2006, is hereby incorporated by reference.\n*10-c-2\nMemorandum of Proposed Amendment and Restatement of the Companys Deferred Compensation Plan approved and adopted by the Board of Directors of the Company on November 7, 2007, filed as Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2007, is hereby incorporated by reference.\n*10-d-1\nCopy of the Companys Incentive Compensation Plan effective October 1, 2020, filed as Exhibit 10-d-1 to the Company's Annual Report on Form 10-K for the year ended September 30, 2020, is hereby incorporated by reference.\n*10-d-2\nCopy of the Companys Annual Incentive Compensation Plan for Senior Executive Officers, as amended December 3, 2003, filed as Exhibit 10-i-1 to the Companys Annual Report for the year ended September 30, 2004, is hereby incorporated by reference.\n*10-e-1\nChange of Control Agreement dated as of September 30, 2022 between the Company and Blake D. Moret, filed as Exhibit 99.1 to the Companys Current Report on Form 8-K dated October 21, 2022, is hereby incorporated by reference.\n*10-e-2\nForm of Change of Control Agreement between the Company and each of Nicholas C. Gangestad, Scott A. Genereux, Rebecca W. House, Frank Kulaszewicz, and certain other officers filed as Exhibit 99.2 to the Companys Current Report on Form 8-K dated October 21, 2022, is hereby incorporated by reference.\n*10-e-3\nLetter Agreement dated September 3, 2009 between Registrant and Theodore D. Crandall, filed as Exhibit 99.2 to the Companys Current Report on Form 8-K dated September 8, 2009, is hereby incorporated by reference.\n*10-e-4\nLetter Agreement dated July 1, 2016 between Registrant and Blake D. Moret, filed as Exhibit 10.3 to the Companys Quarterly Report on Form 10-Q for the quarter ended June 30, 2016, is hereby incorporated by reference.\n*10-e-5\nLetter Agreement dated February 7, 2017 between Registrant and Patrick P. Goris, filed as Exhibit 10 to the Companys Quarterly Report on Form 10-Q for the quarter ended March 31, 2017, is hereby incorporated by reference.\n*10-e-6\nLetter Agreement dated March 1, 2021 between Registrant and Nicholas C. Gangestad\n10-g-1\nAgreement and Plan of Distribution dated as of December 6, 1996, among Rockwell International Corporation (renamed Boeing North American, Inc.), the Company (formerly named New Rockwell International Corporation), Allen-Bradley Company, Inc., Rockwell Collins, Inc., Rockwell Semiconductor Systems, Inc., Rockwell Light Vehicle Systems, Inc. and Rockwell Heavy Vehicle Systems, Inc., filed as Exhibit l0-b to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 1996, is hereby incorporated by reference.\n10-g-2\nPost-Closing Covenants Agreement dated as of December 6, 1996, among Rockwell International Corporation (renamed Boeing North American, Inc.), The Boeing Company, Boeing NA, Inc. and the Company (formerly named New Rockwell International Corporation), filed as Exhibit 10-c to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 1996, is hereby incorporated by reference.\n10-g-3\nTax Allocation Agreement dated as of December 6, 1996, among Rockwell International Corporation (renamed Boeing North American, Inc.), the Company (formerly named New Rockwell International Corporation) and The Boeing Company, filed as Exhibit 10-d to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 1996, is hereby incorporated by reference.\n10-h-l\nDistribution Agreement dated as of September 30, 1997 by and between the Company and Meritor Automotive, Inc., filed as Exhibit 2.1 to the Companys Current Report on Form 8-K dated October 10, 1997, is hereby incorporated by reference.\n10-h-2\nEmployee Matters Agreement dated as of September 30, 1997 by and between the Company and Meritor Automotive, Inc., filed as Exhibit 2.2 to the Companys Current Report on Form 8-K dated October 10, 1997, is hereby incorporated by reference.\n10-h-3\nTax Allocation Agreement dated as of September 30, 1997 by and between the Company and Meritor Automotive, Inc., filed as Exhibit 2.3 to the Companys Current Report on Form 8-K dated October 10, 1997, is hereby incorporated by reference.\n10-i-1\nDistribution Agreement dated as of June 29, 2001 by and among the Company, Rockwell Collins, Inc. and Rockwell Scientific Company LLC, filed as Exhibit 2.1 to the Companys Current Report on Form 8-K dated July 11, 2001, is hereby incorporated by reference.\n10-i-2\nEmployee Matters Agreement dated as of June 29, 2001 by and among the Company, Rockwell Collins, Inc. and Rockwell Scientific Company LLC, filed as Exhibit 2.2 to the Companys Current Report on Form 8-K dated July 11, 2001, is hereby incorporated by reference.\n10-i-3\nTax Allocation Agreement dated as of June 29, 2001 by and between the Company and Rockwell Collins, Inc., filed as Exhibit 2.3 to the Companys Current Report on Form 8-K dated July 11, 2001, is hereby incorporated by reference.\n10-j-1\n$1,500,000,000 Five-Year Credit Agreement dated as of June 29, 2022, among the Company, the Banks listed on the signature pages thereof and Bank of America, N.A., as Administrative Agent, filed as Exhibit 99 to the Companys Current Report on Form 8-K dated July 1, 2022, is hereby incorporated by reference.\n10-k\nPurchase and Sale Agreement dated as of August 24, 2005 by and between the Company and First Industrial Acquisitions, Inc., including the form of Lease Agreement attached as Exhibit I thereto, together with the First Amendment to Purchase and Sale Agreement dated as of September 30, 2005 and the Second Amendment to Purchase and Sale Agreement dated as of October 31, 2005, filed as Exhibit 10-p to the Companys Annual Report on Form 10-K for the year ended September 30, 2005, is hereby incorporated by reference.\n10-l-1\nPurchase Agreement, dated as of November 6, 2006, by and among Rockwell Automation, Inc., Rockwell Automation of Ohio, Inc., Rockwell Automation Canada Control Systems, Grupo Industrias Reliance S.A. de C.V., Rockwell Automation GmbH (formerly known as Rockwell International GmbH) and Baldor Electric Company, contained in the Companys Current Report on Form 8-K dated November 9, 2006, is hereby incorporated by reference.\n10-l-2\nFirst Amendment to Purchase Agreement dated as of January 24, 2007 by and among Rockwell Automation, Inc., Rockwell Automation of Ohio, Inc., Rockwell Automation Canada Control Systems, Grupo Industrias Reliance S.A. de C.V., Rockwell Automation GmbH and Baldor Electric Company, filed as Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q for the quarter ended March 31, 2007, is hereby incorporated by reference.\n10-m-1\nSecurities Purchase Agreement, dated June 11, 2018, between the Company and PTC Inc., filed as Exhibit 10.1 to the Companys Current Report on Form 8-K dated June 11, 2018, is hereby incorporated by reference.\n10-m-2\nRegistration Rights Agreement dated July 19, 2018, between the Company and PTC Inc., filed as Exhibit 10.1 to the Companys Current Report on Form 8-K dated as July 20, 2018, is hereby incorporated by reference.\n10-m-3\nAmendment No. 1 to the Securities Purchase Agreement, dated May 11, 2021, between the Company and PTC Inc., filed as Exhibit 10.1 to the Company's Current Report on Form 8-K dated May 13, 2021, is hereby incorporated by reference.\n10-m-4\nAgreement and Plan of Merger, dated June 24, 2021, among Plex Systems Holdings Inc., the Company, Merger Sub and the Representative, filed as Exhibit 10.1 to the Company's Current Report on Form 8-K dated June 25, 2021, is hereby incorporated by reference.\nList of Subsidiaries of the Company.\nConsent of Independent Registered Public Accounting Firm.\nPowers of Attorney authorizing certain persons to sign this Annual Report on Form 10-K on behalf of certain directors and officers of the Company.\n31.1\nCertification of Periodic Report by the Chief Executive Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934.\n31.2\nCertification of Periodic Report by the Chief Financial Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934.\n32.1\nCertification of Periodic Report by the Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification of Periodic Report by the Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nRockwell Automation, Inc. Executive Compensation Recoupment Policy.\n101 Interactive Data Files.\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n____\n_____________________\n* Management contract or compensatory plan or arrangement.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nROCKWELL AUTOMATION, INC.\nBy /s/ NICHOLAS C. GANGESTAD\nNicholas C. Gangestad\nSenior Vice President and\nChief Financial Officer\nDated: November 8, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below on the 8th day of November 2023 by the following persons on behalf of the registrant and in the capacities indicated.\nBy /s/ NICHOLAS C. GANGESTAD\nNicholas C. Gangestad\nSenior Vice President and\nChief Financial Officer\n(Principal Financial Officer)\nBy /s/ TERRY L. RIESTERER\nTerry L. Riesterer\nVice President and Controller\n(Principal Accounting Officer)\nBlake D. Moret*\nChairman of the Board, President and\nChief Executive Officer\n(Principal Executive Officer)\nand Director\nWilliam P. Gipson*\nDirector\nAlice L. Jolla*\nDirector\nSteven R. Kalmanson*\nDirector\nJames P. Keane*\nDirector\nPam Murphy*\nDirector\nDonald R. Parfet *\nDirector\nLisa A. Payne*\nDirector\nThomas W. Rosamilia*\nDirector\nRobert W. Soderbery*\nDirector\nPatricia A. Watson*\nDirector\n*By /s/ REBECCA W. HOUSE\nRebecca W. House, Attorney-in-fact**\n**By authority of powers of attorney filed herewith\nSCHEDULE II\nROCKWELL AUTOMATION, INC.\nVALUATION AND QUALIFYING ACCOUNTS\nFor the Years Ended September 30, 2023, 2022, and 2021\n(in millions)\nAdditions\nBalance at Beginning\nof Year Charged to\nCosts and\nExpenses Charged to\nOther\nAccounts Deductions (2)\nBalance at\nEnd of\nYear\nDescription\nYear ended September 30, 2023\nAllowance for doubtful accounts (1)\n$ 13.1 $ 8.5 $ 0.2 $ 5.0 $ 16.8\nValuation allowance for deferred tax assets (3)\n23.1 66.4 1.5 1.9 89.1\nYear ended September 30, 2022\nAllowance for doubtful accounts (1)\n$ 13.2 $ 4.7 $ - $ 4.8 $ 13.1\nValuation allowance for deferred tax assets 32.6 3.4 1.1 14.0 23.1\nYear ended September 30, 2021\nAllowance for doubtful accounts (1)\n$ 15.2 $ 3.1 $ 0.4 $ 5.5 $ 13.2\nValuation allowance for deferred tax assets 58.0 5.4 1.5 32.3 32.6\n(1) Includes allowances for current and other long-term receivables.\n(2) Consists of amounts written off for the allowance for doubtful accounts and adjustments resulting from our ability to utilize foreign tax credits, capital losses, or net operating loss carryforwards for which a valuation allowance had previously been recorded.\n(3) Additions charged to costs and expenses includes $30.2 million attributable to non-controlling interests.\nINDEX TO EXHIBITS*\nExhibit No. Exhibit\nList of Subsidiaries of the Company.\nConsent of Independent Registered Public Accounting Firm.\nPowers of Attorney authorizing certain persons to sign this Annual Report on Form 10-K on behalf of certain directors and officers of the Company.\n31.1\nCertification of Periodic Report by the Chief Executive Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934.\n31.2\nCertification of Periodic Report by the Chief Financial Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934.\n32.1\nCertification of Periodic Report by the Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification of Periodic Report by the Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nRockwell Automation, Inc. Executive Compensation Recoupment Policy.\n101 Interactive Data Files.\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n* See Part IV, Item 15(a)(3) for exhibits incorporated by reference."
}