{
    "cik": "1032220",
    "company": "MAXIMUS, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-11-16",
    "period_of_report": "2023-09-30",
    "sic": "7389",
    "state_of_inc": "VA",
    "state_location": "VA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1032220/0001032220-23-000096-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1032220/000103222023000096/mms-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1032220/0001032220-23-000096.txt",
    "filename": "1032220_10K_2023_0001032220-23-000096.htm",
    "content": "Item 1. Business\nGeneral\nMaximus, under its mission of Moving People Forward, helps millions of people access the vital government services they need. With over 45 years of experience working with local, state, federal, and international government clients, we proudly design, develop, and deliver innovative and impactful programs that change lives. We are driven to strengthen communities and improve the lives of those we serve.\nWe create value to our customers through our ability to translate health and human services public policy into operating models that achieve outcomes for governments at scale. Our work covers a broad array of services, including the operation of large health insurance eligibility and enrollment programs; clinical services, including assessments, appeals, and independent medical reviews; and technology services. These services benefit from a market with increasing demographic demand, constrained government budgets, and an increased focus on technology. We have also shown the ability to move quickly, most notably with the swift establishment of public health and safety initiatives during the recent COVID-19 pandemic, such as vaccine information hotlines and unemployment insurance services. Our organic growth through increased contract scope and entry into new markets has been supplemented by strategic acquisitions. Most notably, our recent acquisitions of VES Group, Inc. (\"VES\"), a leading provider of medical disability examinations (\"MDE\") to the United States (\"U.S.\") Department of Veterans Affairs (\"VA\"); the Federal business of Attain, LLC (\"Attain\"), a provider of technology consulting and systems integration services; and a service contract with the U.S. Department of Education, rebranded as \"Aidvantage,\" have supplemented our organic growth and allowed expansion into new markets.\nIn fiscal year 2022, we introduced our refreshed three-to-five-year strategic plan, which we believe will further expand our business. Having moved past the impacts of the COVID-19 pandemic, we believe we are in a strong position to capitalize on organic growth opportunities in our core business, as reflected in the following three pillars of our refreshed strategy.\nCustomer Services, Digitally Enabled. Elevate the customer experience to achieve higher levels of satisfaction, performance, and outcomes through intelligent automation and cognitive computing.\nFuture of Health. Help governments reach the rising demand for health services by growing our clinical capabilities to improve the health of people and their communities.\nAdvanced Technologies for Modernization. Further our credibility as a technology leader, enabling the transformation of government programs to be resilient, dynamic, integrated, and equitable.\nMore information on how each of our business segments align with the execution of our strategy is provided below. Across all segments, there is a common focus on optimizing processes and simplifying our structure. We also continue to focus on our people - the foundation of our strategy. Our commitment, as an employer of choice, is to continue to prioritize attracting, retaining, developing, and empowering employees as a central part of our plan for achieving future growth. More information on our human resource priorities is included below.\nOur Business Segments\nWe operate our business through three segments: U.S. Federal Services, U.S. Services, and Outside the U.S. We operate in the United States and worldwide.\nFor the year ended September 30, 2023, approximately 48% of our revenue was derived from U.S. federal government agencies, 37% from U.S. state government agencies, 14% from foreign government agencies, and the balance from other sources, including local municipalities and commercial customers.\nFor more information on our segment presentation and geographic distribution of our business, including comparative revenue, gross profit, operating income, identifiable assets, and related financial information for the 2023, 2022, and 2021 fiscal years, see \"Note 3. Business Segments\" within Item 8 of this Annual Report on Form 10-K.\nU.S. Federal Services Segment\nOur U.S. Federal Services Segment generated 49% of our total revenue in fiscal year 2023.\nOur U.S. Federal Services Segment delivers end-to-end solutions that help various U.S. federal government agencies better deliver on their mission, including program operations and management, clinical services, and technology solutions. This segment also includes appeals and assessments services, system and application development, Information Technology (\"IT\") modernization, and maintenance services. Certain state-based assessments and appeals work that is part of the segment's heritage continues to be managed within this segment. Under Technology Consulting Services (\"TCS\"), the segment executes on its digital strategy to deliver technology solutions that advance agency missions, including the challenge to modernize, provide better customer experience, and drive process efficiencies. The segment continues to expand its clinical solutions through VES, which manages the clinical evaluation process for U.S. veterans and service members on behalf of the VA.\nProgram Operations. Program operations include business process services (\"BPS\"), eligibility and enrollment, outreach, and other services for federal health and human services programs. In fiscal year 2022, our contract with the Centers for Medicare and Medicaid to support the Contact Center Operations was renewed. This contract supports the federal marketplace under the Affordable Care Act (\"ACA\") and serves as the primary support engagement center for Medicare, also known as 1-800-MEDICARE. The contract serves the U.S. population through twelve customer contact centers handling general inquiries for the marketplace and general and claims-based Medicare inquiries.\nIn October 2021, we acquired the Navient student loan contract, rebranded as Aidvantage. We are an independent and conflict-free provider, as we will not provide loan origination, consolidation, or collection services. We view student loan servicing as an opportunity to apply our insights, expertise, and quality-driven approach through support for Federal Student Aid (\"FSA\") and student borrowers. Our focus is solely on supporting the student borrowers on behalf of FSA. Aidvantage is an extension of long-standing work supporting student loan management and is in line with our core business.\nThe manner in which we provide these services varies from contract to contract but may include a mix of contact centers, mail-room operations, and mobile and website media.\nClinical Services. In line with our strategic focus for the future, the segment continues to expand its clinical solutions, most notably through VES, which manages the clinical evaluation process for U.S. veterans and service members on behalf of the VA.\nA leading provider of MDEs, VES brings a deep and long-standing relationship with the VA, as well as a team of experienced clinicians focused on serving veterans. While our independent clinical assessments business has been growing at the state level (through our previous acquisition of Ascend Management Innovations, LLC in 2016 and subsequent organic growth), VES' expertise provides a platform of scale for the first time at the U.S. federal government level. We believe that near-term growth should also be realized as a result of the Promise to Address Comprehensive Toxics Act of 2022 (\"PACT\") Act, which was passed by the U.S. Congress in August 2022. The PACT Act expands certain conditions under which veterans should presumptively qualify for benefits and would result in increases in MDE volumes. We expect to realize and deliver on higher volumes related to the PACT Act that began in fiscal year 2023 and should continue into fiscal 2024.\nThe independent health and disability assessments and appeals portion of our business is a growing part of our overall portfolio, lending further credibility to our organic growth efforts with other Federal departments and in non-Federal markets.\nTechnology Solutions. Also aligned with our strategic focus, and benefiting from the Attain platform, the TCS division executes on its digital strategy to deliver technology solutions that advance agency missions, including the challenge to modernize, provide better customer experience, and drive process efficiencies. The TCS division is comprised of experts who helped successfully pioneer the first large-scale implementation of a cloud-computing solution for a federal department. TCS's core capabilities build further upon our cloud-based solutions and include:\nApplication development & modernization: Modernize, develop, and deliver solutions utilizing automation, agile, and development, security, and operations (DevSecOps) practices.\nEnterprise Business Solutions: Integrate and manage disparate business processes and systems.\nAdvanced Analytics & Emerging Technologies: Provide technology services to leverage and integrate the latest technologies for AI/ML, automation, and high-performance computing.\nCybersecurity: Deliver full spectrum cybersecurity services, including cyber engineering and operations, digital forensics, and incident response.\nInfrastructure and Engineering: Deploy solutions that leverage cloud-hosted and on-premise designs to optimize costs.\nTCS has also built digital qualifications in the market. The division utilizes AI and machine learning to build bespoke data models, providing predictive analytics to maximize process efficiency, as well as identify systemic process issues that can be isolated and prioritized for troubleshooting. End-to-end automation of software development and business processes achieves speed, efficiency, and error reduction, as well as advanced tool capabilities resulting in greater operational efficiency, enhanced customer experiences, and increased return on investment. Finally, high-performance computing clusters support mission requirements for data mining, scientific modeling, advanced analytics, research, and machine learning.\nThe segment contains performance-based contracts where revenue is earned based upon participant numbers or other transaction-based measures, such as the number and type of assessments or appeals processed. Many contracts in this segment earn their revenue on a cost-plus or time-and-materials basis, which typically carry lower levels of risk and lower levels of profit margin as compared to performance-based contracts. The segment may experience fluctuations as a result of volume variations or program maturity, with contracts recording lower revenue and profitability during program startup. Contracts with government clients often contain \"termination without cause\" provisions. Such contractual language generally allows the government to terminate a contract at any time and enables us to recover only our costs incurred or committed and settlement expenses and profit, if any, on the work completed prior to termination.\nOur primary competitors in the U.S. Federal Services Segment are Serco, General Dynamics Information Technology, Amentum, Cognosante, and Conduent. Within the technology sector, our primary competitors are IBM, Oracle, Leidos, Accenture, Deloitte, Booz Allen Hamilton, and other federal contractors.\nU.S. Services Segment\nOur U.S. Services Segment generated 37% of our total revenue in fiscal year 2023.\nOur U.S. Services Segment provides a variety of BPS, such as program administration, assessments, and related consulting work for U.S. state and local government programs. These services support a variety of programs, including the ACA, Medicaid, the Children's Health Insurance Program (\"CHIP\"), Temporary Assistance to Needy Families (\"TANF\"), and child support programs. Over the last three years, many programs in this segment have been operating with depressed margins resulting from the pause in Medicaid redeterminations. The depressed margins have resulted from reduced operating leverage in the segment as costs cannot scale down at the same rate to meet lower demand due to the requirements to fulfill other obligations on these contracts. With the resumption of redeterminations, we expect a full period of volumes in 2024 coming back into these programs, enabling our operating leverage to recover.\nProgram Operations. Program operations include our comprehensive program administration services for government health benefit programs. The services we provide vary from program to program but may include:\nProgram eligibility support and enrollment services to help beneficiaries make the best choice for their health insurance coverage to improve their access to healthcare;\nCentralized multilingual customer contact centers and multichannel, digital self-service options for simplified enrollment to better serve citizens' needs;\nApplication assistance and independent health plan choice counseling to beneficiaries; and\nBeneficiary outreach, education, eligibility assistance, enrollment, and redeterminations services. In programs such as Medicaid, Maximus does not make the final determination of eligibility.\nWe also provide some specialized services, including substance abuse, diversion program support, and administration of subsidized telephony services. During the COVID-19 pandemic, we provided support in contact tracing.\nAs a leading supplier in many of the health program administration markets that we serve, we are the largest provider of Medicaid eligibility support and enrollment services and state-based health insurance exchange operations.\nClinical Services. Clinical services include our independent appeals and person-centered assessment services, primarily under Medicaid Long-Term Care. The growth of our clinical services demonstrates successful execution of our continued strategy and focus on clinical services. These services help governments engage with program recipients while at the same time helping them improve the efficiency, cost-effectiveness, quality, and accountability of their health and disability benefits programs. These include person-centered independent disability, long-term sick, and other health assessments, including those related to long-term services and supports such as Preadmission Screening and Resident Reviews (\"PASRR\") and Independent Developmental Disability (\"IDD\") assessments. We are a leading provider of such services in the U.S. In addition, we provide connected wellness services which promote healthy living habits among participants.\nEmployment Services. Employment services cover a number of attributes, including eligibility support, case management, job-readiness preparation, job search and employer outreach, job retention and career advancement, and selected educational and training services, including vocational training. Maximus also supports unemployment insurance programs, a market which largely began in response to the COVID-19 pandemic. Children services include full and specialized child support case management services, including collection of child-support funds, through customer contact center operations and program and systems consulting services.\nTechnology Solutions. Technology solutions offer assistance with system planning, implementation oversight, and the construction and maintenance of client systems to allow processing of transactions. We also provide system implementation project management services to state and local clients. Consistent with our overall corporate strategy, technology solutions in our U.S. Services Segment is an area of focus for growth.\nThe rest of the segment's revenue is from specialized consulting services. These services include business process assessment and design, quality assurance processes, including independent verification and validation services as well as policy and procedure reviews, and audit preparation and compliance, including grant and proposal reviews. The segment also includes a tax credit service, which assists commercial customers in claiming workforce and location-based tax benefits.\nPayment for our services varies from contract to contract based upon factors such as the priorities of the customer and their willingness to share risks and rewards. Some contracts are performed on a cost-plus basis, where we receive revenue based on the hours and costs incurred and typically operate at lower margins. Most contracts include a level of performance-based compensation, a fixed fee, or a mixture of both, with fees being based upon call volumes, populations served, or appeals processed. Our employment services contracts typically have outcome-based payments in an effort to incentivize providers to ensure that we help job seekers find long-term, sustained employment and achieve economic independence.\nThe segment may experience seasonality due to transaction-based work, such as program open enrollment periods. Other fluctuations may arise from changes in programs directed by our clients and activity related to contract life cycles. Contracts with government clients often contain \"termination without cause\" provisions. Such contractual language generally allows the government to terminate a contract at any time and enables us to recover only our costs incurred or committed and settlement expenses and profit, if any, on the work completed prior to termination.\nA small number of large states comprise a significant share of this segment's revenue. In addition, even though the majority of our direct clients are state governments, a significant amount of our revenue is ultimately funded via the U.S. federal government in the form of cost-sharing arrangements with the states, as is the case with Medicaid.\nOur primary competitors are government in-sourced operations. External competitors include Conduent, Automated Health Systems, Faneuil, KePro, MTX Group, and Deloitte. In some services, we compete against specialized private companies and nonprofit organizations such as The Salvation Army and Goodwill Industries. We are one of the largest providers of Medicaid and CHIP administrative programs and operate many of the state-based health insurance exchanges.\nOutside the U.S. Segment\nOur Outside the U.S. Segment generated 14% of our total revenue in fiscal year 2023.\nOur Outside the U.S. Segment provides BPS for international governments, transforming the lives of people around the world. Helping people find employment, access vital support, and remain healthy, these services include health and disability assessments, program administration for employment services, wellbeing solutions, and other job seeker-related services. We support programs and deliver services in the United Kingdom (\"U.K.\"), including the Health Assessment Advisory Service (\"HAAS\") and the recently awarded replacement contract to start in 2024, Functional Assessment Services (FAS), and Restart; Australia, including Workforce Australia and employment support and job seeker services worldwide.\nWe are currently reshaping this segment in a thoughtful manner to align with the broader Maximus strategy of pursuing digitally-enabled customer services, clinical capabilities to meet rising demand for health services, and advanced technologies for modernization which is in-demand by government customers worldwide. Recent financial performance of the segment has not met expectations due, in part, to increased volatility from employment services programs dependent on fluctuating macroeconomic conditions. During fiscal year 2023, we divested a small commercial practice in the U.K. and our business in Sweden. During the first quarter of fiscal year 2024, we divested our businesses in Italy and Singapore, as well as our Canadian employment services business.\nEmployment Services. Comprehensive employment services help vulnerable individuals transition from government assistance programs to sustainable employment and economic independence. These services cover a number of attributes, including eligibility determination, case management, job-readiness preparation and work capability assessments, job search and employer outreach, job retention and career advancement, and selected educational and training services. Payment terms are typically focused on achieving employment outcomes.\nClinical Services. Clinical services includes appeals and assessments work. On these contracts, we are typically reimbursed for each transaction. The HAAS contract is a hybrid contract with cost-plus elements coupled with a number of incentives and penalties to achieve the programmatic outcomes defined by the government in order to ensure quality and timeliness of service. Maximus carries out these assessments on behalf of the Department for Work and Pensions (\"DWP\"), and the DWP makes the final decision on the level of benefit.\nThe balance of the segment provides program administration and some specialized services.\nSeasonality is not significant to this segment. Contracts with government clients often contain \"termination without cause\" provisions. Such contractual language generally allows the government to terminate a contract at any time and enables us to recover only our costs incurred or committed and settlement expenses and profit, if any, on the work completed prior to termination.\nOur primary competitors in this segment include Atos, Capita, Serco, Staffline, Shaw Trust, Ingeus, Sarina Russo, Advanced Personnel Management, IBM, Telus-Health, NTT Data, Pacific Blue Cross, Sawaeed, Takamol, and other specialized private companies and nonprofit organizations. Although the basis for competition varies from contract to contract, we believe that typical contracts are awarded based upon a mix of comprehensive solutions and prices. In some cases, clients award points for past performance tied to program outcomes.\nEconomic and Market Environments\nIn all the markets and locations in which we operate, we are seeing consistent themes that drive our long-term strategy.\nInvestment in Technology. Many federal agencies must address the maintenance of legacy IT systems, and the pressing need for IT infrastructure modernization continues to grow. Legacy processes and systems are fundamental to government operations, yet they are expensive to operate in an environment that requires online agility and rapid response to new demands, requirements, and global challenges. We are delivering and supporting the priorities set by the Federal Chief Information Officer: cybersecurity, IT modernization, and customer service and customer experience. By aligning our priorities with the U.S. federal government, we believe that we are well-positioned to meet agency change and to provide enterprise-wide solutions and strategies, both in the U.S. and elsewhere.\nHelping Governments. We believe that effectively managing healthcare costs, as well as improving quality and access to healthcare, is a major policy priority for governments. This was particularly evident in the federal government's Public Health Emergency, which increased Medicaid funding to states that allowed ongoing eligibility of benefits.\nPresident Biden has indicated that his healthcare platform will use the foundation of the ACA to expand access, lower costs, and simplify the process for individuals and families. We believe the current market environment for our services positions us to benefit from continued demand across all of our geographies in service areas such as operations program management and independent health and benefit assessments. Overall, we expect the underlying demand for our services to increase over the next several years.\nDecentralization. The U.S. federal government recently clarified federal regulations that now allow states the flexibility to use contractors to help agencies provide services. We anticipate future changes to this operating model as states evaluate options such as replacing staff, retaining contractors, and implementing technology. We believe that these changes to funding and government mechanics allow state and local authorities enhanced flexibility to shape their benefit programs.\nUnemployment. As different geographies emerge from the COVID-19 pandemic, we are cautiously optimistic that new opportunities for expanded employment services programs will materialize. Given our deep experience, strong financial condition, and trusted brand reputation, we believe we are well-positioned with unique competitive advantages to meet an anticipated expanded need for our services and pent-up demand to help governments provide their citizens employment opportunities. Furthermore, these services have historically benefited from increased caseloads in employment services programs during past economic downturns and recoveries.\nCompetitive Advantages\nSome of the competitive advantages that allow us to capitalize on various market opportunities are as follows:\nSubject matter, clinical, and digital expertise. Our workforce includes many individuals who possess substantial subject matter expertise in areas critical to the successful design, implementation, administration, and operation of government health and human services programs. We also employ a diverse set of experts, including a wide network of clinicians and an experienced team of digital technologists. Many of our employees worked for governments in management positions and can offer insights into how we can best provide valuable, practical, and effective services to our clients.\nDigital engagement, analytics, and automation solutions to enhance government programs. Participants in government programs expect the same types of digital engagement they rely upon when interacting with consumer-oriented businesses. We believe our clients value our ability to infuse digital, such as mobile applications, omnichannel solutions, and digital media, into our BPS solutions to make it easier for beneficiaries to engage with government programs. Analytics enable us to optimize our operations and provide our clients with improved outcomes through greater insight into the populations we serve. Process automation incorporated into our BPS solutions increases the efficiency and quality of the programs we operate.\nFlexibility and scalability. We are experienced in launching large-scale complex operations under compressed time frames. We offer clients the flexibility and scalability to deliver the people, processes, and technology to complete short- and long-term contractual assignments in an efficient and cost-effective manner.\nFinancial strength. Our business provides us with robust cash flows from operations as a result of our profitability and our management of customer receivables. In the event that we have significant cash outlays at the commencement of projects or where delays in payments result in short-term working capital needs, we may borrow up to $600 million through a credit agreement with JPMorgan Chase Bank N.A. (the \"Credit Agreement\"), subject to standard covenants. We have the ability to borrow under the Credit Agreement in all of the principal currencies in which we operate. We believe we have strong, constructive relationships with the lenders on the Credit Agreement. We believe our financial strength provides reassurance to government agencies that we will be able to establish and maintain the services they need to operate high-profile public health and human services programs.\nFocused portfolio of services. We are one of the largest publicly traded companies that provide a portfolio of BPS almost exclusively to government customers. Our government program expertise and proven ability to deliver defined, measurable outcomes differentiate us from other firms and nonprofit organizations, including large consulting firms that serve multiple industries and lack the focus necessary to manage the complexities of serving government efficiently.\nEstablished presence outside the United States. Governments outside the U.S. are seeking to improve government-sponsored health and human services programs, manage increasing caseloads, and contain costs. We have an established international presence, focused on delivering cost-effective welfare-to-work and health benefits services to program participants on behalf of governments.\nExpertise in competitive bidding. Government agencies typically award contracts through a comprehensive, complex, and competitive request for proposals (\"RFP\") and bidding process. Although the bidding criteria varies from contract to contract, typical contracts are awarded based on a mix of technical solution and price. In some cases, governments award points for past performance tied to program outcomes. With more than 40 years of experience in responding to RFPs, we believe we have the necessary experience to navigate government procurement processes and to assess and allocate the appropriate resources necessary for successful project completion in accordance with contractual terms.\nBarriers to entry. The market for providing our services to government agencies is competitive and subject to rapid change. However, given the specialized nature of our services, market entry can be difficult for new or inexperienced firms. The complex nature of competitive bidding, qualifying criteria related to past performance, the required investment in subject-matter expertise, repeatable processes and support infrastructure, and the need to achieve specific program outcomes create barriers to entry for potential new competitors unfamiliar with the nature of government procurement. In some areas of our business, notably contracts with the U.S. federal government, there are requirements for bidders seeking contracts to be pre-approved on registered contract vehicles, further limiting the pool of competitors.\nHuman Resources\nWe move people forward. Our strength lies within our people - connectors, innovators, and problem solvers - united by a shared purpose and championing our customers mission to deliver results. Cultivating a culture that thrives on individual contributions and embracing diversity, we attract and retain a future-ready, diverse workforce through opportunities for career advancement and ensuring that each employee can unlock their true potential. How we work is as important as what we accomplish, and we are dedicated to helping our people explore, learn, and grow to deliver on our business strategy and commitments to shareholders and customers. We propel our entire organization toward a future where technology, innovation, and human connection intersect to drive lasting change. Our culture, values, and unwavering commitment to our people define who we are, and they guide us in making a meaningful impact on the lives of those we serve.\nAs of September 30, 2023, we had approximately 39,600 employees and 12,400 contingent workers, consisting of 15,800 employees in our U.S. Federal Services Segment, 14,700 employees in the U.S. Services Segment, 7,600 employees in the Outside the U.S. Services Segment, and 1,500 corporate administrative employees.\nTalent Acquisition\nOur success depends in large part on our ability to attract talent globally to meet the needs of our customers and comply with our contracts. This makes our hiring efforts significant and extensive, and as a result, our talent acquisition team focuses on finding top, diverse talent quickly. We believe our culture values individual skills, experiences, and differences that allow Maximus to deliver robust and innovative approaches to solving some of our communities' most challenging needs. Our recruiting programs focus on identifying and evaluating talent through practices that welcome a diverse workforce, including people with disabilities, language barriers, and those from varying socioeconomic backgrounds.\nWe continue to invest in our employees through a variety of benefits and overall program enhancements. Our teams continue to adapt to the recruiting, hiring, and training needs of our customers in both remote and onsite settings to ensure continuity of vital services.\nTalent Development\nWe value ongoing development and continuous learning, and we strive to support and provide learning opportunities to all Maximus employees. Maximus supports enterprise-wide professional development by offering a variety of instructor-led and self-paced learning programs for diverse audiences ranging from individual contributors to frontline supervisors and executive leadership. Additionally, our project training teams manage customized programs supporting contract requirements, customer service, local leadership development, and employee engagement. We also provide online role-based and skill-based learning tools to many of our employees.\nTotal Rewards\nAs part of our compensation philosophy, we offer and maintain market-competitive total rewards programs for our employees to attract and retain superior talent. In addition to competitive base wages, additional programs include incentive bonus opportunities, restricted stock units, performance stock units, company-matched 401(k) Plan, healthcare and insurance benefits, health savings and flexible spending accounts, paid time off, family leave, family care resources, flexible work schedules, employee assistance programs, and supplemental programs to support our employees physical, mental, and financial well-being.\nDuring fiscal year 2023, we made significant improvements to the employee value proposition in the U.S., introducing a preferred provider organization plan with lower deductibles for all employees, and further lowering the deductible for our most populated service contract medical plan to make healthcare more accessible for our mission-critical employees. We also made great strides in closing the gender and ethnicity pay gap, instituting an annual review to identify and close any new or persistent unsubstantiated differences in pay between our employees. We improved the hourly wage in fiscal year 2023 to at least $16.20 an hour for approximately 90% of our U.S. population.\nDiversity and Inclusion\nWe assist some of the most vulnerable individuals and families who experience vulnerability, marginalization, and social exclusion each day. Diversity, equity, and inclusion are central to our company identity. We are proud to contribute to and positively impact our communities by treating every person we serve and each other with dignity and respect. We assert that an equitable and inclusive environment with diverse teams produces creative solutions, innovative products and services, and attracts and retains key talent. We are focused on building and sustaining a diverse, equitable, and inclusive culture through a variety of initiatives, including implementing international and strategic hiring, internal development, and promotion and retention practices.\nIn 2023, we successfully sourced and hired more than 1,700 persons with disabilities in the U.S. who have self-disclosed this information. 76% of our U.S. hires were People of Color, and over 77% of our total U.S. hires were women. We continue to refine our focus on recruiting a wide array of talented employees, including from under-represented and historically excluded groups and military veterans at all levels of the organization, to better reflect the populations we serve.\nEmployee Engagement\nOur employees are essential, and their well-being is paramount. Engaged employees stay longer, provide a better consumer experience, and influence other employees. To better understand employee morale, satisfaction, and engagement, we administer an annual Global Employee Engagement survey. We utilize the anonymous feedback to provide an exceptional employee experience and engaging culture where our values of Respect, Compassion, Innovation, Accountability, Collaboration, and Customer Focus are lived out. Aggregated results are dispersed throughout the organization to ensure all levels of management understand employee sentiment. Maximus empowers employee leaders alongside an organizational action committee to review the responses and create action plans to improve our culture and performance.\nRunning our Business Ethically and with Integrity\nOur commitment to conduct our business ethically and with integrity extends to our responsibility to respect human rights as guided by international human rights principles. It is our duty to conduct our business through responsible workplace practices as described in the Maximus Human Rights Principles, available at maximus.com.\nWe strive to be champions for an inclusive and collaborative culture that is free from discrimination and harassment, where everyone is treated with respect and dignity. Our expectation is that Maximus and its employees always conduct business according to the highest standards of ethics and performance and in compliance with all applicable laws.\nMaximus has a confidential, third-party-operated, 24/7 reporting ethics hotline. Violations of our ethics standards and policies are taken seriously and include remediation processes and disciplinary action, as applicable. Any director, officer, or employee may anonymously report suspected violations of the Maximus Standards for Business Conduct and Ethics, Company policies, or applicable laws and regulations.\nThe ethics hotline is a comprehensive and confidential reporting tool to assist management and employees in working together to address any type of misconduct in the workplace. Maximus is committed to an environment where open, honest communications are the expectation, not the exception. We want employees to feel comfortable in approaching a supervisor or anyone in management in instances where they believe violations of policies or standards have occurred. By creating open channels of communication, we aim to promote a positive work environment.\nEmployees understand our commitment to act with integrity, which is summarized in our Standards for Business Conduct and Ethics, which includes the confidential ethics hotline contact information and is available at maximus.com.\nCybersecurity\nOur government clients maintain the role as data owners and regulate access to and use of their data through extensive federal, state, and international privacy and data security laws requiring certain privacy protections and security safeguards. Our Information Security Office is led by the Chief Information Security Officer to provide oversight over the Company's security obligations, as well as a Privacy Office under the Chief Privacy Officer to provide oversight over our privacy obligations within these contracts. The Board of Directors Technology Committee provides oversight with respect to our global information technology, including, but not limited to, strategic investments, cybersecurity, and protection of data assets. Maximus uses various technological and procedural security measures in order to protect confidential or protected information from loss, misuse, alteration, or destruction. We have documented Information Security and Privacy policies to address data protection. We regularly provide information security and privacy awareness training to our employees.\nEnvironment\nThe Board of Directors' Nominating and Governance Committee has oversight responsibility for Environmental, Social, and Governance (\"ESG\") matters, which includes climate-related risks and opportunities.\nMany of our customers are requesting that their providers adopt and disclose their climate policies and principles and are using these in procurement decisions. These requirements vary between customers and are constantly evolving, often with limited notice. Such policies and principles may be subjective, and the manner of scoring our performance against our competitors may vary between bids. The inclusion of these additional criteria, in addition to price and quality of service, may provide opportunities for us, but may also count against us in competitive bids if our real or perceived performance against climate and environmental requirements is deemed unsatisfactory.\nIn addition, our operations are subject to various local, state, federal, and international environmental laws and regulations. Given the nature of our business, we do not currently anticipate that the costs of complying with, or the liabilities associated with, environmental laws and regulations will materially affect us. However, we cannot ensure that we will not incur material costs or liabilities in the future.\nGovernment Regulations\nOur business is heavily regulated. In the U.S., we must adhere to local, state, and federal laws and regulations. Within the U.S. Federal Services Segment, we must also comply with the Federal Acquisition Regulations (\"FAR\"), which regulates the procurement, award, administration, and performance of U.S. government contracts. Outside the U.S., we must also comply with local laws and regulations as determined by geography, as well as U.S. government laws. Adherence includes human rights protections, environmental regulation, and contract specifications. Our government clients have strict policies, procedures, and requirements in the procurement process, as well as regulations governing contract pricing and reimbursable costs.\nCommunity Involvement\nWe aim to give back to the communities where we live and work and believe that this commitment helps in our efforts to attract and retain employees. We offer employees the opportunity to give back through the Maximus Foundation. The Foundation focuses our grant giving to carefully selected partners who have the expertise and capability to enhance our communities and the quality of life of the people we serve. We provide financial support for nonprofit organizations and charities that share our commitment in helping disadvantaged populations and underserved communities.\nOther Information\nMaximus, Inc. is a Virginia corporation founded in 1975.\nOur principal executive offices are located at 1600 Tysons Boulevard, McLean, Virginia, 22102. Our telephone number is 703-251-8500.\nOur website address is maximus.com. We make our website available for informational purposes only. It should not be relied upon for investment purposes, nor is it incorporated by reference into this Annual Report on Form 10-K.\nWe make our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and the proxy statement for our annual shareholders' meeting, as well as any amendments to those reports, available free of charge through our website as soon as reasonably practical after we file that material with, or furnish it to, the Securities and Exchange Commission (\"SEC\"). Our SEC filings may be accessed through the Investor Relations page of our website. These materials, as well as similar materials for other SEC registrants, may be obtained directly from the SEC through its website at sec.gov. Item 1A. Risk Factors\nOur operations are subject to many risks that could adversely affect our future financial condition, results of operations, and cash flows, and, therefore, the market value of our securities. The risks described below highlight some of the factors that have affected and, in the future, could affect our operations. Additional risks we do not yet know of or that we currently think are immaterial may also affect our business operations. If any of the events or circumstances described in the following risks actually occurs, our business, financial condition, or results of operations could be materially adversely affected.\nRisks Pertaining to the Performance of Our Business\nIf we fail to satisfy our contractual obligations or to meet performance standards, our contracts may be terminated, and we may incur significant costs or liabilities, including actual or liquidated damages and penalties, which could adversely impact our operating results, financial condition, cash flows, and our ability to compete for future contracts.\nOur contracts may be terminated due to our failure to satisfy our contractual obligations or to meet performance standards and often require us to indemnify customers for their damages. In addition, some of our contracts contain substantial liquidated damages provisions and financial penalties related to performance failures. Although we have errors and omissions insurance, the policy coverage and limits may not be adequate to provide protection against all potential liabilities. Further, for certain contracts, we may post significant performance bonds or issue letters of credit to secure our performance, indemnification, and other obligations. If a claim is made against a performance bond or letter of credit, we may be required to reimburse the issuer for the amount of the claim. Consequently, as a result of the above matters, we may incur significant costs or liabilities, including penalties, which could adversely impact our operating results, cash flows, financial condition, and our ability to compete for future contracts. We may also incur impairment costs on assets related to these contracts.\nIf we fail to accurately estimate the factors upon which we base our contract pricing, we may generate less profit than expected or incur losses on those contracts.\nDuring fiscal year 2023, we derived approximately 49% of our revenue from performance-based contracts and 15% from fixed-price contracts. For performance-based contracts, we receive our fee on a per-transaction basis or upon meeting specified milestones. These contracts include workforce services contracts in which we receive a payment based on a participant maintaining employment for a specified time period. For fixed-price contracts, we receive our fee based on services provided. Those services might include operating a Medicaid enrollment center pursuant to specified standards, designing and implementing information systems or applications, or delivering a planning document under a consulting arrangement. To earn a profit on these contracts, we must accurately estimate the likely volume of work that will occur, costs, and resource requirements involved, and assess the probability of completing individual transactions or milestones within the contracted time period. If our estimates prove to be inaccurate, we may not achieve the level of profit we expected, or we may incur a net loss on a contract.\nOur growth initiatives could adversely affect our profitability.\nWe may encounter start-up challenges, new compliance requirements, unforeseen costs, and other risks as we enter new markets, including managing our ramp-up, recruiting and retaining appropriately experienced and qualified employees, managing customer expectations, and appropriately budgeting and pricing new work. If we are unable to manage the risks of operating in these new markets, our reputation and profitability could be adversely affected.\nWe may incur significant costs before receiving related contract payments, which could result in an increased use of cash and risk of impairment charges.\nFrom time to time, when we are awarded a contract, we incur significant expenses before we receive any contract payments. These expenses include leasing and outfitting office space, purchasing office equipment, developing internal-use software, and hiring personnel. In other situations, contract terms provide for billing upon achievement of specified project milestones. As a result, in these situations, we are required to expend significant sums of money before receiving related contract payments. In addition, payments due to us from government agencies may be delayed due to billing cycles or as a result of failures by the government to approve governmental budgets in a timely manner. In addition to these factors, poor execution on project start-ups could impact us by increasing our use of cash.\nIn certain circumstances, we may defer recognition of costs incurred at the inception of a contract. That deferral assumes we will be able to recover these costs over the life of the contract. To the extent that a project does not perform as anticipated, these deferred costs may not be considered recoverable, resulting in an impairment charge.\nOur business could be materially and adversely impacted by pandemics, similar to the recent COVID-19 outbreak.\nWe face various risks related to health epidemics, pandemics, and similar outbreaks. The COVID-19 pandemic negatively impacted worldwide economic activity and resulted in travel and work restrictions, commercial disruptions, and affected companies' operations around the world. We were affected by the COVID-19 pandemic, including operational disruptions and changes in working practices. If significant portions of our workforce are unable to work effectively, including because of illness, quarantines, government actions, facility closures, or other restrictions in connection with an outbreak, our operations will likely be adversely impacted. If our operations are materially restricted, we may be unable to perform fully on our contracts, and our costs may increase significantly. These cost increases may not be fully recoverable or adequately covered by insurance.\nWe face competition from a variety of organizations, many of which have substantially greater financial resources than we do; we may be unable to compete successfully with these organizations.\nWe face competition from a number of different organizations depending upon the market and geographic location in which we are competing. Some of our most significant competitors are included in Item 1 of this Annual Report on Form 10-K.\nMany of these companies are international in scope, larger than us, and have greater financial resources, name recognition, and larger technical staff. Substantial resources could enable certain competitors to initiate severe price cuts or take other measures in an effort to gain market share. In addition, we may be unable to compete for the limited number of large contracts because we may not be able to meet a Request For Proposal's (\"RFP\") requirement to obtain and post a large performance bond. Also, in some geographic areas, we face competition from smaller firms with established reputations and political relationships. There can be no assurance that we will be able to compete successfully against our existing or any new competitors.\nWe use third parties to assist us in providing services to our customers, and these third parties may not perform as expected.\nFrom time to time, we engage subcontractors, teaming partners, or other third parties to provide our customers with a single-source solution. While we believe that we perform appropriate due diligence on our subcontractors and teaming partners, we cannot guarantee that those parties will comply with the terms set forth in their agreements or remain financially sound. We may have disputes with our subcontractors, teaming partners, or other third parties arising from the quality and timeliness of their work, customer concerns about them, or other matters. Subcontractor or teaming partner performance deficiencies could result in a customer terminating our contract for default. We may be exposed to liability, and we and our clients may be adversely affected if a subcontractor or teaming partner fails to meet its contractual obligations.\nRisks Pertaining to Data and Data Security\nOur development and use of emerging artificial intelligence (AI) and machine learning (ML) technologies creates unique risks requiring use case-specific governance. If we fail to establish and maintain sufficient oversight, we face increased risk of negative outcomes which could expose us to legal liability, financial loss, and reputational damage.\nApplicable laws and regulations, both existing and forthcoming, often focus on AI/ML use when that technology is used to influence outcomes or make inferences about individuals, groups, or communities. These new and emerging technologies require use-case-specific governance, with oversight that adequately addresses AI/ML-specific areas of concern, such as transparency, explainability, fairness, harmful bias mitigation, and unique third-party privacy and security risks. If we fail to establish and maintain sufficient oversight, which evolves at the rapid pace with which AI/ML technology is changing, we could be subject to sanctions under the relevant laws, breach of contract claims, contract termination, class action, or individual lawsuits from affected parties, negative press articles, reputational damage, and a loss of confidence from our government clients, all of which could adversely affect our existing business, future opportunities, and financial condition.\nOur systems and networks are and have been subject to cybersecurity breaches.\nWe are a trusted provider to government and other clients of critical health and human services that rely heavily upon technology systems, software, and networks to receive, input, maintain, and communicate participant and client data. The risk of a security breach, system disruption, ransom-ware attack, or similar cyber-attack or intrusion, including by computer hackers, cyber terrorists, or foreign governments, is persistent and substantial as the volume, intensity, and sophistication of attempted attacks, intrusions and threats from around the world increase daily. If our systems or networks are compromised, we could be adversely affected by losing confidential or protected information of program participants and clients or by facing a demand for ransom to prevent disclosure of or to restore access to such information. The loss, theft, or improper disclosure of that information could subject us to sanctions under the relevant laws, breach of contract claims, contract termination, class action, or individual lawsuits from affected parties, negative press articles, reputational damage, and a loss of confidence from our government clients, all of which could adversely affect our existing business, future opportunities, and financial condition. Additionally, if our internal networks were compromised, we could suffer the loss of proprietary, trade secret, or confidential technical and financial data. That could make us less competitive in the marketplace and adversely affect our existing business, future opportunities, and financial condition.\nWe have experienced cybersecurity incidents in the past that were immaterial, and in the third quarter of fiscal year 2023, we experienced a material cybersecurity incident as the personal information of a significant number of individuals was accessed by an unauthorized third party by exploiting a zero-day vulnerability in a file transfer application used by many organizations, including us. We have recorded expenses in connection with the investigation and remediation activities related to this incident, but we are unable to predict other potential liabilities or consequences that may arise from this incident. Despite our preventative and remediation efforts, we may continue to experience cybersecurity incidents in the future.\nMany of our projects handle protected health information or other forms of confidential personal information, the loss or disclosure of which has adversely affected, and in the future, could further adversely affect, our business, results of operations, and reputation.\nAs a provider of services under government health and human services programs, we often receive, maintain, and transmit protected health information or other types of confidential personal information. That information may be regulated by the Health Insurance Portability and Accountability Act (\"HIPAA\") as amended by the Health Information Technology for Economic and Clinical Health Act of 2009 (\"HITECH\"), Internal Revenue Service regulations, the European Union General Data Protection Regulation (\"GDPR\"), or similar U.S. or foreign laws. The loss, theft, or improper use or disclosure of that information could subject us to sanctions under the relevant laws, breach of contract claims, class action or individual lawsuits from affected parties, negative press articles, and a loss of confidence from our government clients, all of which could adversely affect our existing business, future opportunities, and financial condition.\nFor instance, as a result of the cybersecurity incident described above, several class actions and lawsuits have been filed. The resolution of these matters may result in damages, costs, fines or penalties, which may adversely affect our existing business, future opportunities, and financial condition.\nRisks Pertaining to Our Client Relationships\nWe obtain most of our business through competitive bidding in response to government RFPs. We may not be awarded contracts through this process at the same level in the future as in the past, and contracts we are awarded may not be profitable.\nSubstantially all of our customers are government agencies. To market our services to government customers, we are often required to respond to government RFPs, which may result in contract awards on a competitive basis. To do so effectively, we must accurately estimate our cost structure for providing the required services, the time required to establish operations, and likely terms of the proposals submitted by competitors. We must also assemble and submit a large volume of information within an RFP's rigid timetable. Our ability to respond successfully to RFPs will greatly impact our business. There is no assurance that we will continue to obtain contracts in response to government RFPs, and our proposals may not result in profitable contracts. In addition, competitors may protest contracts awarded to us through the RFP process that may cause the award to be delayed, overturned, or require the customer to reinitiate the RFP process.\nEven where we are an incumbent, our ability to secure continued work or work at similar margins may be affected by competitive rebids or contract changes and cancellations. If we do not win certain recompetes, this may adversely affect our revenues and profitability, potentially resulting in impairment of goodwill and other intangible assets. Although it is difficult to track all the reasons for changes in our contracts, we believe that this contract erosion has typically affected approximately 7% to 10% of our business annually, with the erosion largely being replaced by new or expanded work elsewhere.\nOur business could be adversely affected by future legislative or government budgetary and spending changes.\nThe market for our services depends largely on domestic and international legislative programs and the budgetary capability to support programs, including the continuance of existing programs. Many of our contracts are not fully funded at inception and rely upon future appropriations of funds. Accordingly, a failure to receive additional anticipated funding may result in early termination of a contract. In addition, many of our contracts include clauses that allow clients to unilaterally modify or terminate contracts with little or no recompense.\nChanges in state or federal government initiatives or in the level of government spending due to budgetary or deficit considerations may have a significant impact on our future financial performance. For example, regulatory steps taken in response to the COVID-19 pandemic in the United States affected the level of work on many of our contracts.\nSimilarly, increased or changed spending on defense, security, or anti-terrorism threats may impact the level of demand or funding for the health and human services programs that we operate. Many state programs in the United States, such as Medicaid, are federally mandated and fully or partially funded by the U.S. Federal Government. Changes to those programs, such as program eligibility, benefits, or the level of federal funding, including a government shutdown, could reduce the level of demand for our services, which could materially adversely impact our future financial performance.\nGovernment entities have in the past terminated and may, in the future, terminate their contracts with us earlier than we expect, which may result in revenue shortfalls and unrecovered costs.\nMany of our government contracts contain base periods of one or more years, as well as option periods covering more than half of the contract's potential duration. Government agencies do not have to exercise these option periods, and they may elect not to exercise them for budgetary, performance, or any other reason. Our contracts also typically contain provisions permitting a government customer to terminate the contract on short notice, with or without cause. Termination without cause provisions generally allow the government to terminate a contract at any time and enable us to recover only our costs incurred or committed and settlement expenses and profit, if any, on the work completed prior to termination. We may or may not be able to recover all the costs incurred during the start-up phase of a terminated contract. The unexpected termination of significant contracts could result in significant revenue shortfalls. If revenue shortfalls occur and are not offset by corresponding reductions in expenses, our business could be adversely affected. We cannot anticipate if, when, or to what extent a customer might terminate their contracts with us.\nIf we fail to establish and maintain important relationships with government entities and agencies, our ability to successfully bid under RFPs may be adversely affected.\nTo facilitate our ability to prepare bids in response to RFPs, we rely in part on establishing and maintaining relationships with officials of various government entities and agencies. These relationships enable us to provide informal input and advice to government entities and agencies prior to the development of an RFP. We also engage marketing consultants, including lobbyists, to establish and maintain relationships with elected officials and appointed members of government agencies. The effectiveness of these consultants may be reduced or eliminated if a significant political change occurs. In that circumstance, we may be unable to successfully manage our relationships with government entities and agencies and with elected officials and appointees. Any failure to maintain positive relationships with government entities and agencies may adversely affect our ability to successfully bid in response to RFPs.\nOur customers may limit or prohibit the outsourcing of certain programs or may refuse to grant consents and/or waivers necessary to permit contractors, such as us, to perform certain elements of government programs.\nGovernments could limit or prohibit private contractors like us from operating or performing elements of certain programs. Within the U.S., state or local governments could be required to operate such programs with government employees as a condition of receiving federal funding. Moreover, under current law, in order to privatize certain functions of government programs, the U.S. federal government must grant consent and/or waiver to the petitioning state or local agency. If the U.S. federal government does not grant a necessary consent or waiver, the state or local agency will be unable to outsource that function to a private entity, such as us. This situation could eliminate or reduce the value of an existing contract.\nWe rely on key contracts with state, local, and federal governments for a significant portion of our revenue. A substantial reduction in those contracts would materially adversely affect our operating results.\nIn fiscal year 2023, approximately 48% of our total revenue was derived from the U.S. federal government, and approximately 37% of our total revenue was derived from contracts with state and local government agencies. Any significant disruption or deterioration in our relationship with federal, state, and local governments and a corresponding reduction in these contracts would significantly reduce our revenue and could substantially harm our business.\nOur contracts typically run for a fixed number of years and may be extended for an additional specified number of years if the contracting entity or its agent elects to do so. When these contracts expire, they may be opened for bidding by competing bidders, and there is no guarantee that the contracts will be renewed or extended. Our clients may elect to open bidding processes up earlier than anticipated, resulting in increased competition prior to the anticipated end of contracts.\nOur reputation and relationships with our clients are key factors in maintaining our business. Negative press reports or publicity, regardless of accuracy, could harm our reputation. If our reputation is negatively affected, our clients may decrease or cease business with us. In addition, we are subject to various reviews, audits, and investigations to verify our compliance with the terms of our contracts, as well as compliance with applicable laws and regulations. Any adverse review, audit, or investigation could result in, among other things, cancellation of contracts; refunding of amounts that have been paid pursuant to contracts; imposition of fines, penalties, and other sanctions; loss of rights to participate on various programs; loss of licenses; lowered quality ratings; or changes to the way we do business. In addition, under government procurement regulations and practices, a negative determination from a government audit could result in a contractor being fined, debarred, and/or suspended from being able to bid on, or be awarded new government contracts for a period of time.\nWithin our U.S. Federal business, our ability to participate in many competitive bids in response to government RFPs is dependent on our Government-Wide Acquisition Contracts (\"GWACs\"), the most commonly used process by which agencies of the federal government purchase goods and services. Eligibility to remain on a GWAC changes over time. If we are unsuccessful and not awarded GWAC contracts, this would have a negative impact on future opportunities.\nA GWAC is a pre-competed, multiple-award, indefinite-delivery, indefinite-quantity (\"IDIQ\") contract that agencies can use to buy total IT solutions. All IDIQs, including GWACs, are regulated by the FAR, which sets forth rules and regulations that must be followed by federal agencies and providers of goods and services to the government in the procurement process. For instance, in 2018, Maximus Federal was named a recipient of the U.S. General Services Administration's (\"GSA\") Alliant 2 GWAC. Alliant 2 is an unrestricted, IDIQ, multi-vendor award with a contract ceiling of $50 billion. If we are unable to adapt to changing eligibility requirements for strategic GWAC competitions, we would risk losing access to related contracts and awards.\nRisks Related to our Acquisitions\nWe may experience difficulties in integrating our operations with those of acquired businesses and realizing the expected benefits of these acquisitions.\nOur growth strategy includes a program to identify and execute acquisitions to enable long-term, sustainable, organic growth by continuing to expand the business, enhance our clinical and digital capabilities, and extend into new market areas. Although we anticipate that acquisitions will create long-term shareholder value, this expectation is based on assumptions about our acquisitions and preliminary estimates of their performance, which may change materially. The benefits of acquisitions depend, in part, on our ability to successfully integrate the acquired businesses and realize the anticipated benefits, including business opportunities and growth prospects from combining our businesses. We may not achieve these objectives within the anticipated time frame or may never realize these benefits, and the value of our common stock may be harmed. Integration of acquired businesses may result in material challenges, including, without limitation:\nOur management might have its attention diverted from ongoing business concerns while trying to integrate these operations, and we could experience performance shortfalls within our existing or acquired businesses as a result of the devotion of management's attention to integration efforts.\nThe integration process could take longer than anticipated and could result in the loss of key employees, the disruption of each company's ongoing businesses, tax costs or inefficiencies, or inconsistencies in standards, controls, information technology systems, compliance requirements, procedures, and policies, any of which could materially adversely affect our ability to maintain relationships with customers, employees, or other third parties, or our ability to achieve the anticipated benefits of the transactions, and could harm our financial performance.\nWe could encounter unanticipated issues in integrating information technology, communications, and other systems that could harm our financial performance.\nIf we are unable to successfully or timely integrate our operations with those of our acquisitions, we may incur unanticipated liabilities and be unable to realize the revenue growth, synergies, and other anticipated benefits, and our business, results of operations, and financial condition could be materially adversely affected.\nIn connection with our acquisitions, we may be required to take write-downs, write-offs, restructuring, impairment, or other charges that could negatively affect our business, assets, liabilities, prospects, outlook, financial condition, and results of operations.\nAlthough we conduct due diligence on our acquisitions, this diligence may not reveal all material issues that may be present, nor does it preclude factors outside of our control from arising later. We have also purchased representations and warranties insurance policies in connection with certain acquisitions, but there is no assurance that those policies will cover any losses we might experience from breaches of the sellers' representations and warranties or otherwise arising from the acquisitions. Even if our due diligence successfully identifies certain risks, unexpected risks may arise, and previously known risks may materialize in a manner not consistent with our preliminary risk analysis.\nWe are required to identify the fair value of assets acquired, such as customer relationships and technology, using estimates that are based upon factors such as expected future operations and the manner in which we will utilize these assets, which may be inaccurate or may change post-acquisition. In addition, we have recorded $1.78 billion of goodwill at September 30, 2023. This balance represents the difference between the amount paid for acquisitions and the identifiable assets acquired. Goodwill is allocated to reporting units, consistent with our segments, and is regularly reviewed to ensure that the value of those segments exceeds the carrying value of the assets held, including goodwill. If the carrying value of our assets, including goodwill, exceeds their fair value, we may be required to take write-offs, write-downs, restructuring, impairment, or other charges that could negatively affect business, assets, liabilities, prospects, outlook, financial condition, and results of operations.\nRisks Pertaining to Legal Compliance\nWe are subject to review and audit by governments at their sole discretion and, if any improprieties are found, we may be required to refund revenue we have received or forego anticipated revenue, which could have a material adverse impact on our revenue and our ability to bid in response to RFPs.\nWe are subject to audits, investigations, and reviews relating to compliance with the laws and regulations that govern our role as a contractor to agencies and departments of the U.S. federal government, state, local, and foreign governments, and otherwise in connection with performing services in countries outside of the United States. Adverse findings could lead to criminal, civil, or administrative proceedings, and we could be faced with penalties, fines, suspension, or debarment. Adverse findings could also have a material adverse effect on us because of our reliance on government contracts. We are subject to periodic audits by U.S., federal, state, local, and foreign governments for taxes. We are also involved in various claims, arbitrations, and lawsuits arising in the normal conduct of our business, including but not limited to bid protests, employment matters, contractual disputes, and charges before administrative agencies.\nWe may be subject to fines, penalties, and other sanctions if we fail to comply with laws governing our business.\nOur business operates within a variety of complex regulatory environments, including but not limited to the FAR, Federal Cost Accounting Standards, the Truth in Negotiations Act, the Fair Debt Collection Practices Act (and similar national, state, and foreign laws), the Foreign Corrupt Practices Act, the United Kingdom Bribery Act, as well as the regulations governing Medicaid and Medicare and accounting standards. If a government audit finds improper or illegal activities by us or we otherwise determine that these activities have occurred, we may be subject to civil and criminal penalties and administrative sanctions, including termination of contracts, forfeiture of profits, suspension of payments, fines, and suspension or disqualification from doing business with the government. Any such determination could adversely impact our ability to bid in response to RFPs in one or more jurisdictions. Further, as a government contractor subject to the types of regulatory schemes described above, we are subject to an increased risk of investigations, criminal prosecution, civil fraud, whistleblower lawsuits, and other legal actions and liabilities to which other private sector companies are not, the result of which could have a material adverse effect on our operating results, cash flows, and financial condition.\nAdverse judgments or settlements in legal disputes could harm our operating results, cash flows, and financial condition.\nFrom time to time, we are subject to a variety of lawsuits and other claims. These may include lawsuits and claims related to contracts, subcontracts, securities compliance, employment and wage claims, and compliance with Medicaid and Medicare regulations, as well as laws governing student loans and child support enforcement. Adverse judgments or settlements in some or all of these legal disputes may result in significant monetary damages or injunctive relief. In addition, litigation and other legal claims are subject to inherent uncertainties, and management's view of these matters may change in the future. Those uncertainties include, but are not limited to, costs of litigation, unpredictable court or jury decisions, and the differing laws and attitudes regarding damage awards among the states and countries in which we operate.\nWe may be precluded from bidding and performing certain work due to other work we currently perform.\nVarious laws and regulations prohibit companies from performing work for government agencies that might be viewed as an actual or apparent conflict of interest. These laws limit our ability to pursue and perform certain types of work. For example, some of our businesses assist government agencies in developing RFPs for various government programs. In those situations, the divisions involved in operating such programs would likely be precluded from bidding on those RFPs. Similarly, regulations governing the independence of Medicaid enrollment brokers and Medicare appeal providers prevent us from providing services to other organizations such as health plans and providers.\nWe may face liabilities arising from divested or discontinued businesses.\nWe have divested a number of businesses. The transaction documents for those divestitures typically contain a variety of representations, warranties, and indemnification obligations. We could face indemnification claims and liabilities from alleged breaches of representations or warranties.\nRisks Pertaining to our Human Resources\nWe may lose executive officers and senior managers on whom we rely to generate business and execute projects successfully.\nThe ability of our executive officers and our senior managers to generate business and execute projects effectively is important to our success. The loss of an executive officer or senior manager, including those who joined us through acquisitions, could impair our ability to secure and manage engagements, which could harm our business, prospects, financial condition, results of operations, and cash flows.\nWe may be unable to attract and retain sufficient qualified personnel to sustain our business.\nOur delivery of services is labor-intensive. When we are awarded a government contract, we must quickly hire project leaders and operational staff. Some larger projects have required us to hire and train thousands of operational staff in a short time period. That effort can be especially challenging in geographic areas with low unemployment rates. The additional operational staff also creates a concurrent demand for increased administrative personnel. Our success requires that we attract, develop, motivate, and retain:\nexperienced and innovative executive officers globally;\nsenior managers who have successfully managed or designed government services programs; and\ninformation technology professionals who have designed or implemented complex information technology projects within and outside the U.S.\nInnovative, experienced, and technically proficient individuals are in great demand and are likely to remain a limited resource. There can be no assurance that we will be able to continue to attract and retain desirable executive officers, senior managers, and management personnel. Our inability to hire sufficient personnel on a timely basis or the loss of significant numbers of executive officers and senior managers could adversely affect our business.\nUnions may oppose outsourcing of government programs to outside vendors such as us, which could limit our market opportunities and could impact us adversely. In addition, our unionized workers outside the United States could disrupt our operations, and our non-unionized workers could attempt to unionize, which could disrupt our operations and impose higher costs on us.\nOur success depends in part on our ability to win profitable contracts to administer and manage programs often previously administered by government employees. Many government employees, however, belong to labor unions with considerable financial resources and lobbying networks. Further, unions that have historically not represented government employees may seek to unionize our workforce. Unions have in the past applied, and are likely to continue to apply, political pressure on legislators and other officials responsible for outsourced government programs.\nUnion activity in the United States has seen a resurgence in recent years. Maximus has been the subject of union-initiated press reports and walk-outs, work disruptions and other actions designed to promote union membership. Non-unionized workers at several of our U.S. locations initiate organizing efforts from time to time to unionize. Even if unsuccessful, such organizing efforts could be disruptive to our business operations and can result in adverse publicity.\nThe potential for adverse media coverage as the unions seek to discredit Maximus through their network may have a negative effect on the willingness of government agencies to outsource or cause them to seek contract terms that could impact us adversely. A successful union organizing effort at one or more of our locations could substantially increase our\ncosts and result in our inability to successfully recompete for existing business.\nOutside the United States, we currently operate outsourced programs with unionized employees in the U.K, and in the past we have operated programs with unionized employees in Canada. We experienced opposition from unions in Canada, which objected to the outsourcing of government programs. Our unionized workers outside the United States could declare a strike or could bargain in a manner that could adversely affect our performance and financial results.\nGeneral Risk Factors\nA number of factors may cause our cash flows and results of operations to vary from quarter to quarter.\nFactors that may cause our cash flows and results of operations to vary from quarter to quarter include:\nthe commencement of new contracts;\ncaseloads and other factors where revenue is derived on transactional volume on contracts;\nthe levels of revenue earned and profitability of fixed-price and performance-based contracts;\nexpenses related to certain contracts which may be incurred in periods prior to revenue being recognized;\nincreasing rates of inflation, which may increase our costs of labor and other goods and services;\nthe commencement, completion, or termination of contracts during any particular quarter;\nthe schedules of government agencies for awarding contracts;\ngovernment budgetary delays or shortfalls;\nthe timing of change orders being signed;\nthe terms of awarded contracts; and\npotential acquisitions.\nChanges in the volume of activity and the number of contracts commenced, completed, or terminated during any quarter may cause significant variations in our cash flows and results of operations because a large amount of our expenses are fixed.\nOur profitability may be constrained by the effects of inflation.\nDemand for talent in certain elements of our business can be highly competitive. To the extent actual wage inflation exceeds our estimates or we are not able to incorporate wage increases in our contracts that cover the actual wage inflation we experience, our operations and financial results may be adversely affected. Our portfolio includes fixed-price, performance-based, and cost-plus contracts for which employment requirements are contract-specific, and have varying impacts to financial results.\nIn cost-plus contracts, we work with our customer to come to agreement for wage increases to meet the current demand and hiring needs, which generally does not impact profitability of these contracts. For fixed-price and performance-based contracts, large and/or sudden changes to the labor market may require us to hire talent at wage levels higher than budgeted, which can adversely impact results on what are often multi-year contracts. For example, our fixed-price and performance-based contracts typically include labor escalators but varying market conditions could require wage increases exceeding the priced escalators, which would adversely impact margins. This is one of many factors that may impact profitability on multi-year fixed-price and performance-based contracts. As contracts reach re-procurement milestones, we may have the ability to adjust our pricing to current and/or future expected market conditions.\nOur indebtedness could adversely affect our business and our ability to meet our obligations.\nAt September 30, 2023, we owed $1.3 billion under our credit facilities. At September 30, 2023, our effective interest rate was 5.97%, compared to 4.69% at September 30, 2022. Our credit facilities are subject to variable rates that expose us to interest rate risk. When interest rates increase, our debt service obligations on the variable rate indebtedness increase even though the amount borrowed remains the same.\nOur indebtedness contains financial or other covenants that limit our operational flexibility in a number of other ways, including:\ncausing us to be less able to take advantage of business opportunities, such as other acquisition opportunities, and to react to changes in market or industry conditions;\nincreasing our vulnerability to adverse economic, industry, or competitive developments;\naffecting our ability to pay or refinance debts as they become due during adverse economic, financial market, and industry conditions;\nrequiring us to use a larger portion of cash flow for debt service, reducing funds available for other purposes;\ndecreasing our profitability and/or cash flow;\ncausing us to be disadvantaged compared to competitors with less leverage; and\nlimiting our ability to borrow additional funds in the future to fund working capital, capital expenditures, and other general corporate purposes.\nApproximately half of our long-term debt is held at variable interest rates. During fiscal year 2023, interest rates have increased and may continue to increase or remain at levels higher than in the past. Higher interest rates have a detrimental effect on our profits and cash flows, as well as reducing the amount of cash we have available for servicing of debt or other transactions.\nIn fiscal year 2023, we amended our credit facilities to switch the benchmark rate from the London Interbank Offering Rate (LIBOR) to the Secured Overnight Financing Rate (SOFR). SOFR is a relatively new reference rate, has a very limited history, and is based on short-term repurchase agreements backed by Treasury securities. Changes in SOFR can be volatile and difficult to predict, and there can be no assurance that SOFR will perform similarly to the way LIBOR would have performed at any time. As a result, the amount of interest we may pay on our credit facilities is difficult to predict.\nWe are subject to the risks of doing business internationally.\nFor the year ended September 30, 2023, 14% of our revenue was driven from jurisdictions outside the U.S. As a result, a significant portion of our business operations are subject to foreign financial, tax, and business risks which could arise in the event of:\nforeign currency exchange fluctuations;\nunexpected increases in tax rates or changes in U.S. or foreign tax laws;\nnon-compliance with international laws and regulations, such as data privacy, employment regulations, and trade barriers;\nnon-compliance with U.S. laws affecting the activities of U.S. companies in international locations, including the Foreign Corrupt Practices Act;\nthe absence in some jurisdictions of effective laws to protect our intellectual property rights;\nnew regulatory requirements or changes in local laws that materially affect the demand for our services or directly affect our foreign operations;\nlocal economic and political conditions, including severe or protracted recessions in foreign economies and inflation risk;\nthe length of payment cycles and potential difficulties in collecting accounts receivable;\ndifficulty managing and communicating with teams outside the U.S.;\nunusual or unexpected monetary exchange controls, price controls, or restrictions on transfers of cash; or\ncivil disturbance, terrorism, or other catastrophic events that reduce business activity in other parts of the world.\nThese factors may lead to decreased revenues and profits, which could adversely affect our business, financial condition, and results of operations.\nInaccurate, misleading, or negative media coverage could adversely affect our reputation and our ability to bid for government contracts.\nBecause of the public nature of many of our business lines, the media frequently focuses their attention on our contracts with government agencies. If the media coverage is negative, it could influence government officials to slow the pace of outsourcing government services, which could reduce the number of RFPs. The media also focus their attention on the activities of political consultants engaged by us, and we may be tainted by adverse media coverage about their activities, even when those activities are unrelated to our business. Moreover, inaccurate, misleading, or negative media coverage about us could harm our reputation and, accordingly, our ability to bid for and win government contracts.\nOur Articles of Incorporation and bylaws include provisions that may have anti-takeover effects.\nOur Articles of Incorporation and bylaws include provisions that may delay, deter, or prevent a takeover attempt that shareholders might consider desirable. For example, our Articles of Incorporation provide that our shareholders may not take any action in writing without a meeting. This prohibition could impede or discourage an attempt to obtain control of us by requiring that any corporate actions initiated by shareholders be adopted only at properly called shareholder meetings. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nAs of September 30, 2023, we leased approximately 176 offices in the U.S., totaling approximately 3.8 million square feet. In nine countries outside the U.S., we leased approximately 333 offices, totaling approximately 0.8 million square feet. The lease terms vary from month-to-month to ten-year leases and are generally entered into at market rates. In the event that a property is used for our services in the U.S., we typically negotiate clauses to allow termination of the lease if the service contract is terminated by our customer. Such clauses are not standard in foreign leases.\nWe believe that our properties are maintained in good operating condition and are suitable and adequate for our purposes. Item 3. Legal Proceedings\nRefer to our disclosures included in \"Note 15. Commitments and Contingencies\" included in Item 8 of this Annual Report on Form 10-K. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded on the New York Stock Exchange, or NYSE, under the symbol \"MMS.\"\nHolders of Record\nAs of October 27, 2023, there were 32 holders of record of our outstanding common stock. The number of holders of record is not representative of the number of beneficial owners due to the fact that many shares are held by depositories, brokers, or nominees. We estimate there are approximately 164,000 beneficial owners of our common stock.\nDividend Policy\nDuring the first fiscal quarter of 2024, we declared a quarterly dividend of $0.30 per share of Maximus common stock. Our quarterly dividends during fiscal years 2023, 2022, and 2021 were $0.28 per share, respectively.\nWe intend to continue paying regular cash dividends, although there is no assurance as to future dividends. Future cash dividends, if any, will be paid at the discretion of our Board of Directors and will depend, among other things, upon our future operating results, capital requirements and surplus, general financial condition, contractual restrictions, and other factors our Board of Directors may deem relevant.\nIssuer Purchases of Equity Securities\nIn March 2020, the Board of Directors authorized the purchase, at management's discretion, of up to $200 million of our common stock. We made no purchases of common stock in fiscal year 2023, and $50.6 million remained available for stock purchases as of September 30, 2023.\nStock Performance Graph\nThe following graph compares the cumulative total shareholder return on our common stock for the five-year period from September 30, 2018, to September 30, 2023, with the cumulative total returns for the S&P MidCap 400 Index and the S&P MidCap 400 Value Index. Both S&P indices are utilized in outstanding market-based equity awards issued by Maximus. In addition, we compared the cumulative total shareholder return of a peer group to our common stock's performance. This peer group is based upon the companies with similar revenue by end market. This peer group is comprised of Booz Allen Hamilton Holding Corp., CACI International Inc., Conduent, Inc., ICF International, Inc., Leidos, Inc., and Science Applications International Corporation (SAIC).\nThis graph assumes the investment of $100 on September 30, 2018, in our common stock, the S&P MidCap 400 Index, the S&P MidCap 400 Value Index, and our peer group, weighted by market capitalization, and assumes dividends are reinvested.\nNotes:\nThe lines represent index levels derived from compounded daily returns that include all dividends.\nThe indexes are reweighted daily, using the market capitalization on the previous trading day.\nIf the monthly interval, based on the fiscal year-end, is not a trading day, the preceding trading day is used.\nThe index level for all series was set to $100.00 on September 30, 2018. Item 6. [Reserved] Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThis Management's Discussion and Analysis of Financial Condition and Results of Operations should be read together with the Company's audited consolidated financial statements and the related notes thereto for the fiscal years ended September 30, 2023, 2022, and 2021, included in Item 8. Financial Statements and Supplementary Data.\nThe discussion below contains management's comments on our business strategy and outlook, and such discussions contain forward-looking statements. These forward-looking statements reflect the expectations, beliefs, plans, and objectives of management about future financial performance and assumptions underlying management's judgment concerning the matters discussed, and accordingly involve estimates, assumptions, judgments, and uncertainties. Our actual results could differ materially from those discussed in the forward-looking statements, and the discussion below is not necessarily indicative of future results. Factors that could cause or contribute to any differences include but are not limited to, those discussed below and elsewhere in this Annual Report on Form 10-K, particularly in Item 1A. Risk Factors and in \"Special Note Regarding Forward-Looking Statements.\"\nA discussion comparing our results of operations, backlog, and liquidity and capital resources between fiscal years 2022 and 2021 can be found in our Annual Report on Form 10-K for the year ended September 30, 2022, which we filed with the Securities and Exchange Commission on November 22, 2022.\nBusiness Overview\nFor an overview of our business, including our business segments and discussion of the services we provide, see Item 1. Business of this Annual Report on Form 10-K.\nFinancial Overview\nA number of factors have affected our fiscal year 2023 results, the most significant of which we have listed below. More detail on these changes is presented below within our \"Results of Operations\" section.\nOur operations within the United States received the benefit of contract growth, including a return to redetermination activity. As redetermination activity resumed during the year, this provided a benefit to both revenue and profit as volumes increased to match our resources.\nOur Selling, General and Administrative (\"SG&A\") cost base has expanded with the growth of the business, including investments in our workforce and business infrastructure. In addition, we recorded $29.3 million as the estimated costs for the investigation and remediation of a cybersecurity incident, $0.9 million related to the disposal of two businesses in fiscal year 2023, and $2.9 million of charges relating to sales completed in October 2023.\nThe cost of our debt has increased year-over-year as interest rates have risen.\nThe strength of the United States Dollar over the other currencies in which we do business has tempered our results in our Outside the U.S. Segment.\nResults of Operations\nThe following table sets forth, for the fiscal years indicated, information derived from our statements of operations. In preparing our discussion and analysis of these results, we focused on the comparison between fiscal years 2023 and 2022.\nTable MD&A 1: Consolidated Results of Operations\nFor the Year Ended September 30,\n2023 2022\n(dollars in thousands, except per share data)\nRevenue $ 4,904,728 $ 4,631,018\nCost of revenue 3,876,120 3,691,208\nGross profit 1,028,608 939,810\nGross profit percentage 21.0 % 20.3 %\nSelling, general, and administrative expenses 639,223 534,493\nSelling, general, and administrative expenses as a percentage of revenue 13.0 % 11.5 %\nAmortization of intangible assets 94,591 90,465\nGain on sale of land and building - 11,046\nOperating income 294,794 325,898\nOperating margin 6.0 % 7.0 %\nInterest expense 84,138 45,965\nOther expense, net 363 2,835\nIncome before income taxes 210,293 277,098\nProvision for income taxes 48,501 73,270\nEffective tax rate 23.1 % 26.4 %\nNet income $ 161,792 $ 203,828\nEarnings per share:\nBasic $ 2.65 $ 3.30\nDiluted $ 2.63 $ 3.29\nOur business segments have different factors driving revenue fluctuations and profitability. The sections that follow cover these segments in greater detail. Our revenue reflects fees earned for services provided. Cost of revenue consists of direct costs related to labor and related overhead, subcontractor labor, outside vendors, rent, and other direct costs. The largest component of cost of revenue, approximately two-thirds, is labor, including subcontracted labor.\nTable MD&A 2: Changes in Revenue, Cost of Revenue, and Gross Profit for the Year Ended September 30, 2023\nRevenue Cost of Revenue Gross Profit\nDollars % Change Dollars % Change Dollars % Change\n(dollars in thousands)\nFiscal year 2022 $ 4,631,018 $ 3,691,208 $ 939,810\nOrganic effect 326,745 7.1 % 235,859 6.4 % 90,886 9.7 %\nDisposal of businesses (22,050) (0.5) % (22,799) (0.6) % 749 0.1 %\nAcquired growth 4,179 0.1 % 2,297 0.1 % 1,882 0.2 %\nCurrency effect compared to the prior period (35,164) (0.8) % (30,445) (0.8) % (4,719) (0.5) %\nFiscal year 2023 $ 4,904,728 5.9 % $ 3,876,120 5.0 % $ 1,028,608 9.4 %\nSelling, general, and administrative expenses\nOur SG&A expenses consist of indirect costs related to general management, marketing, and administration. It is primarily composed of labor costs. These costs may be incurred at a segment level, for dedicated resources that are not client-facing, or at a corporate level. Corporate costs are allocated to segments on a consistent and rational basis. Fluctuations in our SG&A are primarily driven by changes in our administrative cost base, which is not directly driven by changes in our revenue. As part of our work for the U.S. federal government and many states, we allocate these costs using a methodology driven by the U.S. Federal Cost Accounting Standards.\nOur SG&A expenses have expanded through our growth, as well as investments made in our workforce and infrastructure. In addition, our SG&A includes charges which are not directly connected to our day-to-day operations.\nOur costs for the year ended September 30, 2023, include a $29.3 million expense incurred in the second half of the year for our best estimate of the investigation and remediation costs of a previously disclosed cybersecurity incident. As previously disclosed, the Company believes that the personal information of a significant number of individuals was accessed by an unauthorized third party by exploiting a zero-day vulnerability in a file transfer application used by the Company for internal and external file sharing purposes. We have provided notices to individuals whose personal information, including social security numbers, protected health information, and/or other personal information, may have been included in the impacted files.\nWe include costs related to our acquisitions within SG&A. For the year ended September 30, 2023, we increased anticipated consideration for our Aidvantage business, which we acquired in fiscal year 2022, for consideration based upon future performance.\nOur SG&A expense for the year ended September 30, 2023 also includes losses of $0.9 million relating to the sale of two small businesses and $2.9 million related to assets in businesses that were sold subsequent to year end.\nInterest expense\nInterest expense for fiscal year 2023 and 2022 increased from $46.0 million to $84.1 million. This increase is principally due to market rate increases.\nOur effective interest rate was 5.97% at September 30, 2023, compared to 4.69% at September 30, 2022, and 2.05% at September 30, 2021. We have mitigated our risk by fixing interest rates on $650 million of our debt and our near-term capital allocation plan continues to prioritize reducing our debt using our free cash flow. At our current debt balances, a 100 basis point change in SOFR would result in an increased annual interest expense of $6.1 million.\nIncome taxes\nOur effective income tax rate for the year ended September 30, 2023 and September 30, 2022, was 23.1% and 26.4 %, respectively. The decrease in tax rate was primarily driven by higher tax credits and stock vesting benefits in the US, as well as a mix of jurisdictions where we recorded profit. For fiscal year 2024, we expect the effective tax rate to be between 24.5% and 25.5%.\nU.S. Federal Services Segment\nOur U.S. Federal Services Segment delivers end-to-end solutions that help various U.S. federal government agencies better deliver on their mission, including program operations and management, clinical services, and technology solutions. This segment also includes appeals and assessments services, system and application development, Information Technology (\"IT\") modernization, and maintenance services. Certain state-based assessments and appeals work that is part of the segment's heritage continues to be managed within this segment. Under Technology Consulting Services (\"TCS\"), the segment executes on its digital strategy to deliver technology solutions that advance agency missions, including the challenge to modernize, provide better customer experience, and drive process efficiencies. The segment continues to expand its clinical solutions through VES, which manages the clinical evaluation process for U.S. veterans and service members on behalf of the VA.\nTable MD&A 3: U.S. Federal Services Segment - Financial Results\nFor the Year Ended September 30,\n2023 2022\n(dollars in thousands)\nRevenue $ 2,403,606 $ 2,259,744\nCost of revenue 1,845,720 1,740,304\nGross profit 557,886 519,440\nSelling, general, and administrative expenses 308,197 284,509\nOperating income 249,689 234,931\nGross profit percentage 23.2 % 23.0 %\nOperating margin percentage 10.4 % 10.4 %\nOur results for the year ended September 30, 2023, received revenue growth from Aidvantage and the increased volume on the VA medical disability examination (\"MDE\") contracts. Profitability improvements from the VA MDE contracts were partially offset by our need to ramp up staffing for these contracts during the early part of the year in anticipation of the current higher volumes.\nWe anticipate that the growth in fiscal year 2023 will continue into fiscal year 2024, continuing to receive the benefit of new and expanded work on the VA MDE contracts. Operating margins are expected to range between 11% and 12% as the volume of work in the VA MDE contracts and the Aidvantage student loan business rises to meet our staffing levels.\nAlthough a shutdown by the U.S. federal government may create challenges for our business, particularly if payments are delayed, we believe that a significant majority of our work is considered \"essential\" by the government and would be expected to have minimal disruption.\nU.S. Services Segment\nOur U.S. Services Segment provides a variety of BPS, such as program administration, assessments, and related consulting work for U.S. state and local government programs. These services support a variety of programs, including the ACA, Medicaid, the Children's Health Insurance Program (\"CHIP\"), Temporary Assistance to Needy Families (\"TANF\"), and child support programs. Over the last three years, many programs in this segment have been operating with depressed margins resulting from the pause in Medicaid redeterminations. The depressed margins have resulted from reduced operating leverage in the segment as costs cannot scale down at the same rate to meet lower demand due to requirements to fulfill other obligations on these contracts. With the resumption of redeterminations, we expect a full period of volumes in 2024 coming back into these programs, enabling our operating leverage to recover.\nTable MD&A 4: U.S. Services Segment - Financial Results\nFor the Year Ended September 30,\n2023 2022\n(dollars in thousands)\nRevenue $ 1,812,069 $ 1,607,612\nCost of revenue 1,434,528 1,264,608\nGross profit 377,541 343,004\nSelling, general, and administrative expenses 194,991 160,902\nOperating income 182,550 182,102\nGross profit percentage 20.8 % 21.3 %\nOperating margin percentage 10.1 % 11.3 %\nOur revenue and cost of revenue for the year ended September 30, 2023, increased 12.7% and 13.4%, respectively, compared to fiscal year 2022. All movement was organic.\nThis segment received the benefit of the return of Medicaid eligibility redetermination work towards the latter half of the year; this work had previously been suspended or reduced during the COVID-19 pandemic. This resumed work, as well as new work and the conversion of short-term arrangements into long-term contracts, boosted profit margins in the latter half of the year.\nWe believe our redetermination work will continue to resume in fiscal year 2024, offsetting losses of the final pieces of COVID-19 pandemic revenue, which we recorded in early fiscal year 2023. We expect our full-year profit margin to be approximately 11% as the level of work performed moves up to match our base staffing levels.\nOutside the U.S. Segment\nOur Outside the U.S. Segment provides BPS for international governments, transforming the lives of people around the world. Helping people find employment, access vital support, and remain healthy, these services include health and disability assessments, program administration for employment services, wellbeing solutions, and other job seeker-related services. We support programs and deliver services in the United Kingdom, including the Health Assessment Advisory Service (\"HAAS\") and the recently awarded replacement contract to start in 2024, Functional Assessment Services (FAS), and Restart; Australia, including Workforce Australia and employment support and job seeker services worldwide.\nTable MD&A 5: Outside the U.S. Segment - Financial Results\nFor the Year Ended September 30,\n2023 2022\n(dollars in thousands)\nRevenue $ 689,053 $ 763,662\nCost of revenue 595,872 686,296\nGross profit 93,181 77,366\nSelling, general, and administrative expenses 102,311 92,536\nOperating loss (9,130) (15,170)\nGross profit percentage 13.5 % 10.1 %\nOperating margin percentage (1.3) % (2.0) %\nTable MD&A 6: Outside the U.S. Segment - Changes in Revenue, Cost of Revenue and Gross Profit\nRevenue Cost of Revenue Gross Profit\nAmount % Change Amount % Change Amount % Change\n(dollars in thousands)\nBalance for fiscal year 2022 $ 763,662 $ 686,296 $ 77,366\nOrganic effect (21,574) (2.8) % (39,477) (5.8) % 17,903 23.1 %\nDisposal of businesses (22,050) (2.9) % (22,799) (3.3) % 749 1.0 %\nAcquired growth 4,179 0.5 % 2,297 0.3 % 1,882 2.4 %\nCurrency effect compared to the prior period (35,164) (4.6) % (30,445) (4.4) % (4,719) (6.1) %\nBalance for fiscal year 2023 $ 689,053 (9.8) % $ 595,872 (13.2) % $ 93,181 20.4 %\nOur results for fiscal year 2023 were tempered by challenges within our welfare-to-work services, both at the macroeconomic level, where markets with low unemployment reduce the demand for our services, and at a contract level, where the reduction in scope of our Australian contract has reduced both revenue and profitability.\nIn March 2023, we sold a small commercial practice in the United Kingdom and our employment operations in Sweden. Prospectively, we anticipate this will marginally improve our profit margins.\nThis segment also experienced declines in revenue and cost from currency movements, with the major currencies in which we do business declining year-over-year against the United States Dollar.\nMuch of our revenue growth stems from our employment services contracts, where we are paid based upon our ability to place individuals in long-term sustained employment. We recognize revenue over our period of performance, using estimates of our ability to place people in work and the time that this will take. Our estimates are based upon historical performance, where appropriate and available, and are constantly updated. This may result in volatility within revenue as changes in estimates of future performance impact the revenue recognized in any period.\nWe are continuing our efforts to improve the performance of this segment. Subsequent to September 30, 2023, we sold our businesses in Italy and Singapore, as well as part of our business in Canada. These businesses had provided approximately $28 million of revenue and a gross loss of $3 million in fiscal year 2023. With these disposals, we anticipate that this segment will break even at an operating margin level in fiscal year 2024. As we establish our plans for fiscal year 2024 and beyond, the actions we consider may result in additional charges, including impairment of assets.\nBacklog\nBacklog represents estimated future revenue from:\nexisting signed contracts;\ncontracts that have been awarded but not yet signed; and\nunexercised priced contract options.\nAs of September 30, 2023, we estimate that we had approximately $20.7 billion in backlog.\nTable MD&A 7: Backlog by Segment\nAs of September 30,\n2023 2022\n(in millions)\nU.S. Federal Services $ 13,800 $ 13,168\nU.S. Services 4,851 5,205\nOutside the U.S. 2,089 1,441\nBacklog $ 20,740 $ 19,814\nAt September 30, 2023, the average weighted remaining life of the contracts in our backlog was approximately 5.92 years, including option periods.\nIncreases in backlog result from the award of new contracts and the extension or renewal of existing contracts. Reductions in backlog come from fulfilling contracts or the early termination of contracts, which our experience shows to be a rare occurrence. See \"Risk Factors\" in Item 1A of this Annual Report. The backlog associated with our performance-based contracts is an estimate based upon management's experience of caseloads and similar transaction volume, which is subject to revision based upon the latest information available. Additionally, backlog estimates may be affected by foreign currency fluctuations.\nWe believe that comparisons of backlog period-to-period are difficult. We also believe that it is difficult to predict future revenue solely based on analysis of backlog. The actual timing of revenue from projects included in backlog will vary. We also may experience periods in which there is a greater concentration of rebids, resulting in a comparatively reduced backlog balance until subsequent award or extension on those contracts.\nThe longevity of these contracts assists management in predicting revenue, operating income, and cash flows for the purposes of business planning. We expect approximately 24% of the backlog balance to be realized as revenue in fiscal year 2024. Our standard forecasting process includes analyzing new work pipelines and submitted responses to requests for proposals (\"RFPs\") when predicting future revenue, operating income, and cash flows.\nLiquidity and Capital Resources\nOur primary sources of liquidity are cash on hand, cash from operations, and availability under our revolving credit facilities. As of September 30, 2023, we had $65.4 million in cash and cash equivalents. We believe that our current cash position, access to our revolvers, and cash flow generated from operations should be not only sufficient for our operating requirements but also to enable us to fund required long-term debt repayments, dividends, and any share purchases we might choose to make. We believe we have access to sufficient funds to manage through a potential shutdown of the U.S. federal government. See \"Note 8. Debt and Derivatives\" to the Consolidated Financial Statements for a more detailed discussion of our debt financing arrangements.\nDuring fiscal year 2023, we entered into a number of debt-related transactions.\nWe entered into additional interest rate swaps to bring the total balance of our credit facility subject to fixed rates to $650 million. This allows us greater opportunity to predict and manage our interest payments.\nWe amended both our debt and the corresponding interest rate swaps to use interest rates based upon the Secured Overnight Financing Rate (\"SOFR\"), replacing the previous LIBOR basis.\nAs part of the transition to SOFR, we redeemed some of our Term Loan B debt.\nWe have included the following table showing our debt balances as of September 30, 2023, and their effective interest rates.\nTable MD&A 8: Debt Balances and Interest Rates as of September 30, 2023\nSeptember 30, 2023\nCarrying value Effective cash interest rate Interest rate basis\n(dollars in thousands)\nTerm Loan A - Unhedged $ 259,375 6.92 % Term SOFR reset monthly plus margin. (1)\nTerm Loan A - Hedged through May 2026 500,000 3.81 % Fixed rate of 2.31% plus margin. (1)\nTerm Loan A - Hedged through September 2024 150,000 5.98 % Fixed rate of 4.48% plus margin. (1)\nTerm Loan B 344,934 7.42 % Term SOFR (variable reset) plus 2% margin.\nDebt held by international subsidiaries 3,220 6.08 % Floating rate, reset quarterly.\nDebt Principal $ 1,257,529\n(1) Applicable margin ranges between 1% and 2%, based on our leverage ratio.\nOur effective cash interest rate reflects the drivers of our cash interest payments as of September 30, 2023, which can change based upon the reset of the rates. Including the amortization of the upfront payments, our effective interest rate as of September 30, 2023 is 5.97%.\nThe below table summarizes our change in cash, cash equivalents, and restricted cash.\nTable MD&A 9: Net Change in Cash and Cash Equivalents and Restricted Cash\nFor the Year Ended September 30,\n2023 2022\n(in thousands)\nOperating activities:\nNet cash provided by operating activities $ 314,340 $ 289,839\nNet cash used in investing activities (80,963) (54,009)\nNet cash used in financing activities (250,798) (248,271)\nEffect of foreign exchange rates on cash and cash equivalents and restricted cash 2,717 (7,334)\nNet change in cash and cash equivalents and restricted cash $ (14,704) $ (19,775)\nNet Cash Provided By Operating Activities\nNet cash provided by operating activities increased by $24.5 million in fiscal year 2023 compared to fiscal year 2022.\nAlthough our net income declined year-over-year, our operating cash flows received the benefit from favorable timing of vendor payments. This benefit was partially offset by higher interest payments, with a cash outflow of $81.1 million in fiscal year 2023 compared to $43.1 million in the comparative period.\nBoth years have received the benefit of faster cash collections. Our Days Sales Outstanding (\"DSO\") improved from September 30, 2021, when it was 68 days, through September 30, 2022 (62 days) and September 30, 2023 (60 days).\nNet Cash Used In Investing Activities\nInvesting activities in fiscal year 2023 included ongoing capital investment in fixed assets and software. We received payments for the sales of our Swedish business and for our sale of a small commercial practice in the United Kingdom.\nNet Cash Used In Financing Activities\nThe principal drivers of financing cash flows are the Credit Agreement, our equity transactions, and restricted cash flows where we hold funds on behalf of customers or vendors.\nDuring both fiscal years 2023 and 2022, we utilized our operating cash inflows to pay down debt and pay our dividends. In fiscal year 2022, we also used funds to purchase Maximus common stock.\nIn fiscal year 2022, we received the benefit from our Receivables Purchase Agreement (\"RPA\"), under which we can sell certain US-originated accounts receivable balances. Prior to September 30, 2022, we sold a customer invoice for $60.4 million. Although we sold these receivables, we maintained administrative responsibilities over cash collection. Having sold the invoice, the customer payment was received on September 30, 2022, and was treated as restricted cash before being remitted to Wells Fargo in October 2022. This resulted in a large financing cash inflow in fiscal year 2022, and a corresponding outflow in fiscal year 2023.\nCash in Foreign Locations\nWe have no requirement to remit funds from our foreign locations to the United States. We will continue to explore opportunities to remit additional funds, taking into consideration the working capital requirements and relevant tax rules in each jurisdiction. When we are unable to remit funds back without incurring a penalty, we will consider these funds indefinitely reinvested until such time as these restrictions are changed. As a result, we do not record U.S. deferred income taxes on any funds held in foreign jurisdictions. We have not attempted to calculate our potential liability from any transfer of these funds, as any such transaction might include tax planning strategies that we have not fully explored. Accordingly, it is not possible to estimate the potential tax obligations if we were to remit all of our funds from foreign locations to the United States.\nFree Cash Flow (Non-GAAP)\nTable MD&A 10: Free Cash Flow (Non-GAAP)\nFor the Year Ended September 30,\n2023 2022\n(in thousands)\nNet cash provided by operating activities $ 314,340 $ 289,839\nPurchases of property and equipment and capitalized software (90,695) (56,145)\nFree cash flow (Non-GAAP) $ 223,645 $ 233,694\nMaterial Cash Requirements from Contractual Obligations\nCredit Facilities\nOur principal debt agreement is with JPMorgan Chase Bank N.A. (the \"Credit Agreement\"). At September 30, 2023, we owed $1.25 billion under the Credit Agreement, with access to an additional $600.0 million through a revolving credit facility. Mandatory repayments are required under this agreement through May 2028, when the agreement ends, and must be renegotiated or the funds repaid.\nThe Credit Agreement contains a number of covenants with which we are expected to comply. Failure to meet these requirements would result in a need to renegotiate the agreement or a requirement to repay our outstanding debt in full. There are two financial covenants, both defined in the Credit Agreement.\nOur Consolidated Net Total Leverage Ratio means, for any twelve-month period, the ratio of our Funded Debt, offset by up to $75 million of unrestricted cash (Consolidated Total Leverage), against our Consolidated EBITDA (as defined by the Credit Agreement). To comply with our Credit Agreement, this ratio cannot exceed 4.00:1.00 at the end of each quarter, with a step up to 4.50:1.00 under certain circumstances. This ratio also determines both our interest rate and the charge we pay on the unused component of our revolving credit facility, with the charge increasing as the leverage ratio increases.\nOur Consolidated Net Interest Coverage Ratio means, for any twelve-month period, the ratio of our Consolidated EBITDA against our Consolidated Net Interest Expense as defined by the Credit Agreement. To comply with our Credit Agreement, this ratio cannot be less than 3.00:1.00 at the end of each quarter.\nConsolidated EBITDA also drives certain permissions within the Credit Agreement, such as the level of investment we are entitled to make without seeking additional approval from our lenders.\nOur Credit Agreement defines Consolidated EBITDA, as well as other components of the calculations above. The definition of Consolidated EBITDA requires us to include adjustments not typically included within EBITDA, including unusual, non-recurring expenses, certain non-cash adjustments, the pro forma effects of acquisitions and disposals, and estimated synergies from acquisitions. As a result, Consolidated EBITDA as defined by the Credit Agreement may not be comparable to EBITDA or related or similarly-titled measures presented by other companies.\nWe have summarized below the components of our two financial ratio calculations, including the components of Consolidated EBITDA as defined by the Credit Agreement, which are included within our financial statements. At September 30, 2023, we were in compliance with all applicable covenants of our Credit Agreement. We do not believe that these covenants represent a significant restriction in our ability to operate our business or to pay our dividends.\nTable MD&A 11: Reconciliation of Net Income to Consolidated EBITDA as defined by our Credit Agreement\nFor the Year Ended September 30,\n2023 2022\n(in thousands)\nNet income $ 161,792 $ 203,828\nAdjustments:\nInterest expense 84,138 45,965\nOther expense, net 363 2,835\nProvision for income taxes 48,501 73,270\nAmortization of intangibles 94,591 90,465\nStock compensation expense 29,522 30,476\nAcquisition-related expenses 575 332\nGain on sale of land and building - (11,046)\nLoss on sale of businesses 883 -\nDepreciation and amortization of property, equipment, and capitalized software 54,725 42,330\nPro forma and other adjustments permitted by our Credit Agreement 69,892 30,032\nConsolidated EBITDA (as defined by our Credit Agreement) $ 544,982 $ 508,487\nTable MD&A 12: Consolidated Net Total Leverage Ratio\nFor the Year Ended September 30,\n2023 2022\n(in thousands, except ratio data)\nFunded Debt (as defined by our Credit Agreement) $ 1,257,529 $ 1,366,314\nCash and cash equivalents up to $75 million 65,405 40,658\nConsolidated Net Total Leverage (as defined by our Credit Agreement) $ 1,192,124 $ 1,325,656\nConsolidated Net Total Leverage Ratio (as defined by our Credit Agreement) 2.19 2.61\nTable MD&A 13: Consolidated Net Interest Coverage Ratio\nFor the Year Ended September 30,\n2023 2022\n(in thousands, except ratio data)\nConsolidated EBITDA (as defined by our Credit Agreement) $ 544,982 $ 508,487\nInterest expense 84,138 45,965\nComponents of other income/expense, net allowed in ratio calculation 2,684 (118)\nConsolidated Net Interest Expense (as defined by our Credit Agreement) $ 86,822 $ 45,847\nConsolidated Net Interest Coverage Ratio (as defined by our Credit Agreement) 6.28 11.09\nLeases\nAs of September 30, 2023, we reported current and long-term operating lease liabilities of $49.9 million and $129.4 million, respectively. These balances represent our contractual obligation to make future payments on our leases, discounted to reflect our cost of borrowing. The majority of these leases are for real estate. In the event that we vacate a location, we may be obligated to continue making lease payments. Where possible, we mitigate this risk by including clauses allowing for the termination of lease agreements if the contract the location covers is terminated by our customer. See \"Note 10. Leases\" to the Consolidated Financial Statements for information regarding our leases, including obligations by fiscal year.\nDeferred compensation plan\nAs of September 30, 2023, we reported liabilities of $46.4 million related to our deferred compensation plan. These balances are due to our employees based upon elections they make at the time of deferring their funds. The timing of these payments may change based upon factors, including termination of our employment arrangement with a participant. We maintain a rabbi trust to fund this liability.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the U.S. requires us to make estimates and judgments that affect the amounts reported. We consider the accounting policies below to be the most important to our financial position and results of operations either because of the significance of the financial statement item or because of the need to use significant judgment in recording the balance. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities. Actual results could differ from those estimates. Our significant accounting policies are summarized in \"Note 2. Significant Accounting Policies\" of the Consolidated Financial Statements included in Item 8 in this Annual Report on Form 10-K.\nRevenue Recognition\nAlthough much of our revenue is recognized concurrently with billing or with the passage of time, some of our revenue requires us to make estimates. These estimates are reviewed quarterly, with any changes being recorded as a cumulative catch-up.\nSome of our performance-based contract revenue is recognized based upon future milestones defined in each contract. This is the case in many of our employment services contracts in the Outside the U.S. Segment, where we are paid as individuals attain employment milestones, which may take many months to achieve. We recognize revenue over the period of performance. Our estimates vary from contract to contract but may include the number of participants within a portfolio reaching employment milestones and the service delivery periods for participants reaching the employment milestone.\nWe estimate the total variable fees we will receive using the expected value method. We recognize the fees over the expected period of performance. At each reporting period, we update our estimates of the variable fees to represent the circumstances present at the end of the reporting period. We are required to constrain our estimates to the extent that it is probable that there will not be a significant reversal of cumulative revenue when the uncertainty is resolved. We do not\nhave a history of significant constraints on these contracts.\nDuring the year ended September 30, 2023, we recognized revenue from these performance-based fees of $120.6 million. At September 30, 2023, we recorded $53.9 million of these estimated outcome fees as unbilled receivables, which will be billed and then collected when we reach the targets we anticipate.\nBusiness Combinations and Goodwill\nOur balance sheet as of September 30, 2023, includes $1.78 billion of goodwill and $703.6 million of net intangible assets. These assets are created through business acquisitions, and their creation and maintenance requires certain critical estimates.\nDuring an acquisition, we are required to estimate the fair value of all acquired tangible and intangible assets, as well as liabilities assumed, in order to allocate the purchase price. For many assets acquired and liabilities assumed, the calculation of fair value requires little judgment as balances may be readily convertible to cash receipts or cash payments, or there may be an active market against which to measure value. For the valuation of intangible assets, significant judgment is necessary in identifying and valuing such assets. This valuation will also involve identifying the useful economic life of this asset. Our estimates of these fair values and useful economic lives are based upon assumptions we believe to be reasonable and, where appropriate, include assistance from third-party appraisal firms. The accounting for our acquisitions included determining the fair value of intangible assets representing customer relationships, the VES provider network, and technology. In making our determination of the fair value of these assets, we utilized estimates, the most significant of which were forecasts related to future revenues and profit margins. These assumptions relate to the future performance of the acquired business, are forward-looking, and could be affected by future economic and market conditions. The asset values and asset lives determined at acquisition may change based upon circumstances such as contract terminations or changes in strategy. When this occurs, we may need to accelerate our amortization charges. These assets are also subject to impairment if events indicate that the carrying value of the assets may not be recoverable. For example, our intangible asset balance includes customer relationship assets which, if the customer relationship ends, would require evaluation of the remaining asset life and asset value.\nThe excess purchase price over the identified net assets is considered to be goodwill. Goodwill is recorded at the reporting unit level. The identification of our reporting units requires judgment based upon the manner in which our business is operated and the services performed. Our reporting units are consistent with our segments. Where we have acquisitions that provide services to more than one segment or where the acquisition provides benefits across all of our segments, we use judgment to allocate the goodwill balance based upon the relative value we anticipate that each segment will realize.\nGoodwill is not amortized but is subject to impairment testing on an annual basis, or more frequently if impairment indicators arise. Impairment testing is performed at the reporting unit level. This process requires judgment in assessing the fair value of these reporting units. We performed the annual impairment test using the qualitative assessment as of July 1, 2023, and concluded that the fair value of each of the reporting units were greater than the carrying amounts.\nContingencies\nFrom time to time, we are involved in legal proceedings, including contract and employment claims, in the ordinary course of business. We assess the likelihood of any adverse judgments or outcomes to these contingencies, as well as potential ranges of probable losses, and establish reserves accordingly. The amount of reserves required may change in future periods due to new developments or changes in approach to a matter, such as a change in settlement strategy.\nWe are also subject to audits by our government clients on many of our contracts based upon measures such as costs incurred or transactions processed. These audits may take place several years after a contract has been completed. We maintain reserves where we believe a loss is probable and are able to estimate any potential liability that is updated as audits are completed.\nNon-GAAP and Other Measures\nWe utilize non-GAAP measures where we believe it will assist users of our financial statements in understanding our business. The presentation of these measures is meant to complement, but not replace, other financial measures in this document. The presentation of non-GAAP numbers is not meant to be considered in isolation, nor as an alternative to revenue growth, net cash provided by operating activities, operating income, net income, or earnings per share as measures of performance or liquidity. These non-GAAP measures, as determined and presented by us, may not be comparable to related or similarly titled measures presented by other companies.\nIn fiscal year 2023, 14% of our revenue was generated outside the U.S. We believe that users of our financial statements wish to understand the performance of our foreign operations using a methodology that excludes the effect of year-over-year exchange rate fluctuations. To calculate year-over-year currency movement, we determine the current fiscal year's results for all foreign businesses using the exchange rates in the prior fiscal year.\nIn recent years, we have made a number of acquisitions. We believe users of our financial statements wish to evaluate the performance of our operations, excluding changes that have arisen due to businesses acquired or disposed of. We identify acquired revenue and cost of revenue by showing these results for periods for which no comparative results exist within our financial statements. We identify revenue and cost of revenue that has been disposed of in a similar manner. This information is supplemented by our calculations of organic growth. To calculate organic growth, we compare current fiscal year results, excluding transactions from acquisitions or disposals, to our prior fiscal year results.\nOur recent acquisitions have resulted in significant intangible assets, which are amortized over their estimated useful lives. We believe users of our financial statements wish to understand the performance of the business by using a methodology that excludes the amortization of our intangible assets. During fiscal year 2023, we have also incurred losses on sales of businesses and taken an impairment charge on a business sold in early fiscal year 2024. We believe that providing supplemental measures that exclude the impact of the items detailed below is useful to investors in evaluating our core operations and results in relation to past periods. Accordingly, we have calculated our operating income, net income, and diluted earnings per share, excluding the effect of the amortization of intangible assets and divestiture-related charges. We have included a table showing our reconciliation of these income measures to their corresponding GAAP measures.\nTable MD&A 14: Non-GAAP Adjusted Results - Operating Income, Net Income, and Diluted Earnings per Share\nFor the Year Ended September 30,\n2023 2022\n(dollars in thousands, except per share data)\nOperating income $ 294,794 $ 325,898\nAdd back: Amortization of intangible assets 94,591 90,465\nAdd back: Divestiture-related charges 3,751 -\nAdjusted operating income excluding amortization of intangible assets and divestiture-related charges (Non-GAAP) $ 393,136 $ 416,363\nAdjusted operating income margin excluding amortization of intangible assets and divestiture-related charges (Non-GAAP) 8.0 % 9.0 %\nNet income $ 161,792 $ 203,828\nAdd back: Amortization of intangible assets, net of tax 69,714 66,786\nAdd back: Divestiture-related charges 3,751 -\nAdjusted net income excluding amortization of intangible assets and divestiture-related charges (Non-GAAP) $ 235,257 $ 270,614\nDiluted earnings per share $ 2.63 $ 3.29\nAdd back: Effect of amortization of intangible assets on diluted earnings per share 1.14 1.08\nAdd back: Effect of divestiture-related charges on diluted earnings per share 0.06 -\nAdjusted diluted earnings per share excluding amortization of intangible assets and divestiture-related charges (Non-GAAP) $ 3.83 $ 4.37\nIn order to sustain our net cash provided by operating activities, we regularly refresh our fixed assets and technology. We believe that users of our financial statements wish to understand the cash flows that directly correspond with our operations and the investments we must make in those operations using a methodology that combines net cash provided by operating activities and capital expenditures. We provide free cash flow to complement our consolidated statements of cash flows. Free cash flow shows the effects of our operations and replacement capital expenditures and excludes the cash flow effects of acquisitions, purchases of our common stock, dividend payments, and other financing transactions. We have provided a reconciliation of net cash provided by operating activities to free cash flow in \"Liquidity and Capital Resources.\"\nTo sustain our operations, our principal source of financing comes from receiving payments from our customers. We believe that users of our financial statements wish to evaluate our efficiency in converting revenue into cash receipts. Accordingly, we provide DSO, which we calculate by dividing billed and unbilled receivable balances at the end of each quarter by revenue per day for the period. Revenue per day for a quarter is determined by dividing total revenue by 91 days. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nIn the normal course of business, we are exposed to financial risks such as changes in interest rates, foreign currency exchange rates, and counterparty risk. We do not enter into financial instruments for trading purposes.\nForeign Currency Risk\nAs of September 30, 2023, we held net assets denominated in currencies other than the U.S. Dollar of $210.4 million. Of this balance, we had net monetary assets of $91.7 million and cash and cash equivalents of $31.1 million. We consider monetary assets to be those which hold a fair value close to their book value and which represent a recent cash outflow or which will become a cash inflow or outflow within a short period of time. These assets and liabilities are typically cash, billed, billable, and unbilled accounts receivable, current prepaid expenses, operating lease right-of-use assets, accounts payable, accrued compensation, deferred revenue, lease liabilities, and debt.\nA hypothetical 10% favorable or unfavorable exchange rate movement across currencies would have the following incremental effects on our comprehensive income and our cash flow statement.\nTable 7A.1: Exposure to Currency Risk\nAs of September 30,\n2023 2022\n(in thousands)\nChange in comprehensive income attributable to Maximus $ 21,036 $ 15,657\nChange in net monetary assets $ 9,171 $ 6,127\nChange in cash and cash equivalents $ 3,113 $ 3,867\nWhere possible, we mitigate our foreign currency risks. Our operations typically incur costs and cash outflows in the same currency as their revenue. We identify surplus funds in foreign locations and place them in entities with the U.S. Dollar as their functional currency.\nInterest Rate Risk\nOur principal exposure to interest rates relates to our debt. At September 30, 2023, we owed a gross balance of $1.26 billion associated with debt in the United States and in foreign locations.\nOur principal debt agreement incurs interest based upon a fixed rate, applicable spread, and a market rate. The market rate is based upon the Secured Overseas Funding Rate (\"SOFR\"). A rise in interest rates would increase our interest expense, and a reduction in interest rates would decrease our interest expense. We mitigate this risk through interest rate swaps. At September 30, 2023, $650.0 million of our debt-carrying value was hedged with-fixed interest rate swaps.\nWe based the following sensitivity calculation on the SOFR rate of 5.3% in accordance with the most recent measurement date specified in our Credit Agreement. A 100 basis point change in interest rates would have the following impact of net income:\nTable 7A.2: Exposure to Interest Rate Risk\nAs of September 30,\n2023 2022\n(in thousands)\n100 basis point increase impact on net income $ (6,075) $ (10,633)\n100 basis point decrease impact on net income $ 6,075 $ 10,633\nCounterparty Risk\nWe are exposed to credit losses in the event of nonperformance by the counterparties to our derivative instrument. Our counterparty has investment-grade credit ratings; accordingly, we anticipate that the counterparty will be able to fully satisfy their obligations under the contracts. Our agreement outlines the conditions upon which we or the counterparty are required to post collateral. As of September 30, 2023, we had no collateral posted with our counterparty related to the derivatives. Item 8. Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Maximus, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Maximus, Inc. (the Company) as of September 30, 2023 and 2022, the related consolidated statements of operations, comprehensive income, changes in shareholders' equity, and cash flows for each of the three years in the period ended September 30, 2023, and the related notes (collectively referred to as the \"consolidated financial statements\"). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated November 16, 2023, expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue recognition - Measuring Variable Consideration in Certain Performance-based Revenue Contracts\nDescription of the Matter\nAs described in Note 2 and Note 4 to the consolidated financial statements, in certain performance-based contracts, the Company recognizes revenue based on future milestones defined in each contract. Revenue recognition for certain of these contracts involves estimation of variable consideration utilizing managements judgments about performance related to future outcomes. Significant changes in these estimates could have a material effect on the Companys results of operations. During the year ended September 30, 2023, approximately $120.6 million of revenue was recorded on contracts that included an estimate related to contract performance for future outcomes.\nAuditing the Company's measurement of variable consideration for these performance-based contracts requires judgment because the calculation involves estimates of future milestones. This estimate reflects managements estimates of the number of participants within a portfolio reaching employment milestones and the service delivery period for participants reaching the employment milestones.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Companys process to calculate variable consideration, including determining the underlying assumptions about the number of participants within a portfolio reaching employment milestones and the service delivery period for participants reaching the employment milestones.\nTo test the variable consideration, our audit procedures included, among others, evaluating the significant judgments and the completeness and accuracy of the underlying data used in managements calculation of variable consideration. For example, we tested managements estimate of the number of participants within a portfolio reaching employment milestones by comparing the amounts estimated to historical results, inclusive of changes to the current period environment, and performing sensitivity analyses to evaluate the changes in variable consideration that could result from changes in the Companys significant assumptions.\n/s/ Ernst & Young LLP\nWe have served as the Company's auditor since 1996.\nTysons, Virginia\nNovember 16, 2023\nMaximus, Inc.\nConsolidated Statements of Operations\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands, except per share amounts)\nRevenue $ 4,904,728 $ 4,631,018 $ 4,254,485\nCost of revenue 3,876,120 3,691,208 3,307,510\nGross profit 1,028,608 939,810 946,975\nSelling, general, and administrative expenses 639,223 534,493 494,088\nAmortization of intangible assets 94,591 90,465 44,357\nGain on sale of land and building - 11,046 -\nOperating income 294,794 325,898 408,530\nInterest expense 84,138 45,965 14,744\nOther expense, net 363 2,835 10,105\nIncome before income taxes 210,293 277,098 383,681\nProvision for income taxes 48,501 73,270 92,481\nNet income $ 161,792 $ 203,828 $ 291,200\nEarnings per share:\nBasic $ 2.65 $ 3.30 $ 4.69\nDiluted $ 2.63 $ 3.29 $ 4.67\nWeighted average shares outstanding:\nBasic 61,125 61,774 62,072\nDiluted 61,450 61,969 62,365\nDividends declared per share $ 1.12 $ 1.12 $ 1.12\nSee accompanying notes to consolidated financial statements.\nMaximus, Inc.\nConsolidated Statements of Comprehensive Income\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nNet income $ 161,792 $ 203,828 $ 291,200\nOther comprehensive income, net of tax:\nForeign currency translation adjustments 6,625 (17,504) 3,033\nNet gains/(losses) on cash flow hedge, net of tax effect of $(103), $8,368, and $(107), respectively\n(279) 23,451 (303)\nOther comprehensive income 6,346 5,947 2,730\nComprehensive income $ 168,138 $ 209,775 $ 293,930\nSee accompanying notes to consolidated financial statements.\nMaximus, Inc.\nConsolidated Balance Sheets\nAs of September 30,\n2023 2022\n(in thousands)\nAssets:\nCash and cash equivalents $ 65,405 $ 40,658\nAccounts receivable, net 826,873 807,110\nIncome taxes receivable 16,556 2,158\nPrepaid expenses and other current assets 146,632 182,387\nTotal current assets 1,055,466 1,032,313\nProperty and equipment, net 38,831 52,258\nCapitalized software, net 107,811 58,740\nOperating lease right-of-use assets 163,929 132,885\nGoodwill 1,779,215 1,779,415\nIntangible assets, net 703,648 804,904\nDeferred contract costs, net 45,372 47,732\nDeferred compensation plan assets 42,919 37,050\nDeferred income taxes 2,459 4,970\nOther assets 46,147 42,447\nTotal assets $ 3,985,797 $ 3,992,714\nLiabilities and Shareholders' Equity:\nLiabilities:\nAccounts payable and accrued liabilities $ 282,081 $ 264,553\nAccrued compensation and benefits 194,251 178,199\nDeferred revenue, current portion 60,477 87,146\nIncome taxes payable 451 718\nLong-term debt, current portion 86,844 63,458\nOperating lease liabilities, current portion 49,852 63,999\nOther current liabilities 49,058 116,374\nTotal current liabilities 723,014 774,447\nDeferred revenue, non-current portion 38,849 21,414\nDeferred income taxes 203,898 206,099\nLong-term debt, non-current portion 1,163,149 1,292,483\nDeferred compensation plan liabilities, non-current portion 46,432 40,210\nOperating lease liabilities, non-current portion 129,367 86,175\nOther liabilities 13,253 22,515\nTotal liabilities 2,317,962 2,443,343\nCommitments and contingencies (Note 15)\nShareholders' equity:\nCommon stock, no par value; 100,000 shares authorized; 60,998 and 60,774 shares issued and outstanding as of September 30, 2023 and 2022, respectively\n577,898 557,978\nAccumulated other comprehensive loss (27,615) (33,961)\nRetained earnings 1,117,552 1,025,354\nTotal shareholders' equity 1,667,835 1,549,371\nTotal liabilities and shareholders' equity $ 3,985,797 $ 3,992,714\nSee accompanying notes to consolidated financial statements.\nMaximus, Inc.\nConsolidated Statements of Cash Flows\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nCash flows from operating activities:\nNet income $ 161,792 $ 203,828 $ 291,200\nAdjustments to reconcile net income to cash flows from operations:\nDepreciation and amortization of property, equipment and capitalized software 54,725 42,330 46,361\nAmortization of intangible assets 94,591 90,465 44,357\nAmortization of debt issuance costs and debt discount 2,837 3,012 9,374\nGain on sale of land and building - (11,046) -\nDeferred income taxes 1,552 10,204 (6,577)\nStock compensation expense 29,522 30,476 28,554\nLoss on sale of businesses 883 - -\nChange in assets and liabilities, net of effects of business combinations and disposals:\nAccounts receivable (23,401) 14,132 38,578\nPrepaid expenses and other current assets 859 (6,745) (16,726)\nDeferred contract costs 2,688 (12,056) (15,426)\nAccounts payable and accrued liabilities 17,729 (32,722) 26,904\nAccrued compensation and benefits 12,650 3,288 18,112\nDeferred revenue (12,123) (19,342) 53,652\nIncome taxes (16,958) (13,510) (2,733)\nOperating lease right-of-use assets and liabilities (2,035) (1,112) 5,314\nOther assets and liabilities (10,971) (11,363) (3,622)\nNet cash provided by operating activities 314,340 289,839 517,322\nCash flows from investing activities:\nPurchases of property and equipment and capitalized software (90,695) (56,145) (36,565)\nAcquisitions of businesses, net of cash acquired - (14,295) (1,798,915)\nProceeds from the sale of businesses 9,732 - -\nProceeds from the sale of land and building - 16,431 -\nNet cash used in investing activities (80,963) (54,009) (1,835,480)\nCash flows from financing activities:\nCash dividends paid to Maximus shareholders (68,073) (68,716) (68,838)\nPurchases of Maximus common stock - (96,119) (3,363)\nTax withholding related to RSU vesting (8,475) (9,673) (9,818)\nPayments for contingent consideration (9,431) (1,369) -\nPayments for debt financing costs - - (23,213)\nProceeds from borrowings 844,299 615,000 2,318,129\nPrincipal payments for debt (952,974) (770,658) (824,483)\nCash-collateralized escrow liabilities (56,144) 83,264 -\nOther - - (2,721)\nNet cash (used in)/provided by financing activities (250,798) (248,271) 1,385,693\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash 2,717 (7,334) 474\nNet change in cash, cash equivalents, and restricted cash (14,704) (19,775) 68,009\nCash, cash equivalents and restricted cash, beginning of period 136,795 156,570 88,561\nCash, cash equivalents and restricted cash, end of period $ 122,091 $ 136,795 $ 156,570\nSee accompanying notes to consolidated financial statements.\nMaximus, Inc.\nConsolidated Statements of Changes in Shareholders' Equity\nCommon Stock Accumulated\nOther\nComprehensive\nLoss Retained\nEarnings Total\nEquity\nShares Amount\n(in thousands)\nBalance as of September 30, 2020 61,504 $ 513,959 $ (42,638) $ 770,498 $ 1,241,819\nNet income - - - 291,200 291,200\nForeign currency translation - - 3,033 - 3,033\nCash flow hedge, net of tax - - (303) - (303)\nCash dividends - - - (68,838) (68,838)\nDividends on RSUs - 1,671 - (1,671) -\nPurchases of Maximus common stock (52) - - (3,363) (3,363)\nStock compensation expense - 28,554 - - 28,554\nTax withholding related to RSU vesting - (11,773) - - (11,773)\nRSUs vested 502 - - - -\nBalance at September 30, 2021 61,954 532,411 (39,908) 987,826 1,480,329\nNet income - - - 203,828 203,828\nForeign currency translation - - (17,504) - (17,504)\nCash flow hedge, net of tax - - 23,451 - 23,451\nCash dividends - - - (68,716) (68,716)\nDividends on RSUs - 1,465 - (1,465) -\nPurchases of Maximus common stock (1,407) - - (96,119) (96,119)\nStock compensation expense - 30,476 - - 30,476\nTax withholding related to RSU vesting - (6,374) - - (6,374)\nRSUs vested 227 - - - -\nBalance as of September 30, 2022 60,774 557,978 (33,961) 1,025,354 1,549,371\nNet income - - - 161,792 161,792\nForeign currency translation - - 6,625 - 6,625\nCash flow hedge, net of tax - - (279) - (279)\nCash dividends - - - (68,073) (68,073)\nDividends on RSUs - 1,521 - (1,521) -\nStock compensation expense - 29,522 - - 29,522\nTax withholding related to RSU vesting - (11,123) - - (11,123)\nRSUs vested 224 - - - -\nBalance as of September 30, 2023 60,998 $ 577,898 $ (27,615) $ 1,117,552 $ 1,667,835\nSee accompanying notes to consolidated financial statements.\nMaximus, Inc.\nNotes to the Consolidated Financial Statements\n1. ORGANIZATION\nMaximus, a Virginia corporation established in 1975, is a leading provider of government services worldwide. Under our mission of Moving People Forward, we help millions of people access the vital government services they need. With over 45 years of experience working with local, state, federal, and international government clients, we proudly design, develop, and deliver innovative and impactful programs that change lives. We are driven to strengthen communities and improve the lives of those we serve. We are a proud partner to government agencies in the United States and worldwide.\n2. SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying consolidated financial statements, including the notes, include the accounts of the Company and its wholly-owned subsidiaries, and have been prepared in accordance with accounting principles generally accepted in the United States, or U.S. GAAP, and the rules and regulations of the U.S. Securities and Exchange Commission (\"SEC\"). All intercompany balances and transactions have been eliminated in consolidation.\nOur fiscal year ends on September 30 and unless otherwise noted, references to fiscal year or fiscal are for fiscal years ended September 30. The accompanying consolidated financial statements present our financial position as of September 30, 2023, and 2022 and our results of operations for fiscal years 2023, 2022, and 2021.\nUse of Estimates\nThe preparation of these financial statements, in conformity with U.S. GAAP, requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent liabilities, and the reported amounts of revenue and expenses. At each reporting period end, we make estimates, including those related to revenue recognition and cost estimation on certain contracts, the realizability of long-lived assets, and amounts related to income taxes, certain accrued liabilities, and contingencies and litigation.\nOur balance sheet includes a number of long-lived assets, including property and equipment, capitalized software, operating lease right-of-use assets, deferred contract costs, and intangible assets. These assets are depreciated or amortized over their estimated useful economic lives but are subject to impairment if events indicate that the carrying amounts may not be recoverable.\nAs disclosed in \"Note 4. Revenue Recognition,\" some of our performance-based contract revenue is recognized based upon future milestones defined in each contract. This is the case in many of our employment services contracts in the Outside the U.S. Segment, where we are paid as individuals attain employment milestones, which may take many months to achieve. We recognize revenue over the period of performance. Our estimates vary from contract to contract but may include the number of participants within a portfolio reaching employment milestones and the service delivery periods for participants reaching the employment milestone.\nAs disclosed in \"Note 6. Business Combinations and Divestitures\", we acquired several businesses. For assets acquired and liabilities assumed, we are required to identify and recognize these balances at their fair value as of the date of acquisition.\nIn May 2021, we acquired VES Group, Inc. As part of the acquisition, we allocated a valuation of $27 million to certain technology assets used by the business, which we elected to amortize over twelve years, which was our best estimate of asset life at that time. In fiscal year 2023, we have taken the opportunity to improve our technology portfolio, including the development of technology, that will eventually replace much of the acquired technology. Accordingly, we have revised the asset life on the existing technology, assuming the assets will cease being used by September 2026. This change in estimated useful life will result in additional annual amortization expense of $3.8 million per year. In fiscal year 2023, this change reduced our diluted earnings per share by approximately $0.04.\nWe are required to evaluate our long-lived assets used in operations when events and circumstances indicate that the valuation of the assets exceeds their fair value.\nOur capitalized software balance includes $23 million related to technology for new services within our U.S. Services Segment. During the fourth quarter of fiscal year 2023, we evaluated whether these assets were impaired by comparing the carrying value of the assets to our anticipated future cash flows. At this time, our probability-weighted undiscounted cash flows continue to show that we will recover the cost of our assets through our contract pipeline. It is possible that changes in our estimates of future cash flows or unbudgeted costs related to these capitalized software assets may change in the near term and result in the need to write these assets down to fair value.\nDuring the first quarter of fiscal year 2024, we completed the sale of some of our international businesses. In the course of the sale process, we noted that the carrying value of the assets being disposed of would exceed the sale price. As a result, we recorded an impairment charge of $2.9 million at September 30, 2023. This charge was spread across various long-lived assets, including fixed assets and lease right-of-use assets.\nCash and Cash Equivalents\nWe consider all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents.\nRestricted cash represents funds that are held in our bank accounts but which are precluded from use for general business needs through contractual requirements. These requirements typically include serving as collateral bonds and letters of credit or where we hold funds on behalf of clients. We report our restricted cash balances within \"Prepaid expenses and other current assets\" on our balance sheet.\nRevenue Recognition\nWe recognize revenue as, or when, we satisfy performance obligations under a contract. We account for a contract when the parties approve the contract and are committed to perform on it, the rights of each party and the payment terms are identified, the contract has commercial substance, and it is probable that we will collect substantially all of the consideration. A performance obligation is a promise in a contract to transfer a distinct good or service, or a series of distinct goods or services, to a customer. The transaction price of a contract must be allocated to each performance obligation and recognized as the performance obligation is satisfied.\nAlthough our services may have many components, these components are not necessarily distinct performance obligations as they may be interdependent on or interrelated to each other. Where our contracts contain more than one performance obligation, we allocate the contract's transaction price to each performance obligation using our best estimate of the standalone selling price of each component. This method will vary from contract to contract. Where available, we utilize standalone selling prices of similar components. If this information is unavailable, we utilize a suitable metric to allocate selling price, such as costs incurred.\nIn most cases, we view our performance obligations as promises to transfer a series of distinct services to our customer that are substantially the same and which have the same pattern of service. We recognize revenue over the performance period as a customer receives the benefits of our services. This continuous transfer of control is supported by the unilateral right of many of our customers to terminate contracts for convenience, without having to provide justification for this decision. Where we are reimbursed on a cost-plus basis, we recognize revenue based upon our costs incurred to date; where we are reimbursed on a fixed price basis, we recognize revenue based upon an appropriate output measure that may be time elapsed or another measure within the contract. When we have variable fees, such as revenue related to the volume of work or award fees, we allocate that revenue to the distinct periods of service to which they relate. In estimating our variable fees, we are required to constrain our estimates to the extent that it is probable that there will not be a significant reversal of cumulative revenue when the uncertainty is resolved.\nOther performance obligations are satisfied at a point in time, rather than over time. We recognize revenue only when the customer received control over the goods provided. Revenue recognition on these performance obligations does not require a significant level of judgment or estimation.\nWhere we have contract modifications, these are reviewed to determine whether they should be accounted for as part of the original performance obligation or as a separate contract. Where the modification changes the scope or price and the additional performance obligations are at their standalone selling price, these services are considered a separate contract. Where there is a modification, and the additional performance obligations are not at their standalone selling price, we consider whether those performance obligations are distinct from those already delivered. If services are distinct from those already provided, the contract is accounted for prospectively, as though the original contract had been terminated and a new arrangement entered into. Where the modification includes goods or services that are not distinct from those already provided, we record a cumulative adjustment to revenue based upon a remeasurement of progress towards the complete satisfaction of performance obligations not yet fully delivered.\nAccounts Receivable-Billed, Billable, and Unbilled and Deferred Revenue\nBilled receivables are balances where an invoice has been prepared and issued and is collectible under standard contract terms. Many of our clients require invoices to be prepared on a monthly basis. Where we anticipate that an invoice will be issued within a short period of time and where the funds are considered collectible within standard contract terms, we include this balance as billable accounts receivable.\nBoth billed and billable balances are recorded at their face amount less an allowance for credit losses over the contractual payment terms of the receivable. We periodically reassess these amounts by analyzing reasonably available information as of the balance sheet date, including the length of time that the receivable has been outstanding, historical bad debts and aging trends, and other general and contract-specific factors.\nWe present billed, billable, and unbilled receivables as one component on our consolidated balance sheets. Our deferred revenue is presented as a separate item on our consolidated balance sheet, broken out by current and long-term portion. Unbilled receivables and deferred revenue represent timing differences between when amounts are billed or billable and when revenue has been recognized or has occurred as of period end. The timing of these billings is generally driven by the contractual terms, which may have billing milestones that are different from revenue recognition milestones. Our unbilled receivables balance includes retainage balances, where customers may hold back payment for work performed for a period of time to allow opportunities to evaluate the quality of our performance. The balance also includes estimated fees where performance outcomes are anticipated but have not yet been achieved. Our unbilled receivable balance is recorded at fair value - the value that we expect to invoice for the services performed once the objective criteria laid out by the contract have been met.\nWe defer revenue where we receive up-front funds to establish the infrastructure needed for a long-term contract.\nCredit Risk\nCredit risk has not historically been significant to our business due to the nature of our customers. 48% of our revenue is from the U.S. federal government, and much of our Outside the U.S. segment is from national governments. Many of our U.S. state government agency programs receive significant federal funding. We believe that the credit risk associated with our receivables is limited due to the creditworthiness of our customers.\nBusiness Combinations and Goodwill\nThe purchase price of an acquired business is allocated to tangible assets, separately identifiable intangible assets acquired and liabilities assumed based upon their respective fair values. Any excess balance is recorded as goodwill. Costs incurred directly related to an acquisition, including legal, accounting, and valuation services, are expensed as incurred.\nGoodwill is not amortized but is subject to impairment testing on an annual basis, or more frequently if impairment indicators arise. Impairment testing is performed at the reporting unit level. A reporting unit is the operating segment, or a business one level below that operating segment (the component level) if discrete financial information is prepared and reviewed regularly by segment management. However, components are aggregated if they have similar economic characteristics. We have the option to assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, including goodwill. If we conclude that such an impairment is not more-likely-than-not in all cases, no additional quantitative analysis is required. If such an impairment is more-likely-than-not, or if we choose to bypass this qualitative assessment, a quantitative evaluation is performed by comparing the fair value of the relevant reporting unit to the carrying value, including goodwill, of the reporting unit. If the fair value of the reporting unit exceeds the carrying value, no impairment loss is recognized. However, if the carrying value of the reporting unit exceeds the fair value, the goodwill of the reporting unit is determined to be impaired.\nOur reporting units are consistent with our operating segments, U.S. Federal Services, U.S. Services, and Outside the U.S. We perform our annual impairment test as of July 1 of each year. We performed the annual impairment test using the qualitative assessment as of July 1, 2023, and concluded that the fair value of each of the reporting units was greater than the carrying amounts.\nIntangible Assets\nAll of our intangible assets are acquired through business combinations. They are separately identified and recorded at fair value upon acquisition.\nWe use judgment in identifying, valuing, and assigning a useful economic life to assets as they are acquired. The judgments required vary with the type of asset but may include projections of future results, estimated costs to recreate or replace assets, the cost of utilizing other, similar assets provided by a third party, and an appropriate cost of capital. Where appropriate, we utilize the services of a third-party specialist to assist us in these valuations. We amortize our intangible assets over their estimated useful lives on a straight-line basis. We believe this reflects the manner in which the value from our customer relationships, technology, and other assets is realized by the business.\nProperty and Equipment\nProperty and equipment are recorded at cost. Depreciation is recorded over the assets' respective useful economic lives using the straight-line method, which are not to exceed seven years. Leasehold improvements are amortized over the shorter of their useful life or the remaining term of the lease. Repairs and maintenance costs are expensed as incurred.\nCapitalized Software\nAll of our capitalized software represents development costs for software that is intended for our internal use. Direct costs of time and materials incurred for the development of application software for internal use are capitalized and amortized using the straight-line method over the estimated useful life of the software, ranging from three to ten years. Costs incurred for upgrades and enhancements that do not result in additional functionality are expensed as incurred.\nDeferred Contract Costs\nDeferred contract costs consist of contractually recoverable costs to fulfill services related to long-term service contracts. These costs include direct and incremental costs incurred prior to the commencement of providing service to our customer. These costs are expensed over the period the services are provided using the straight-line method.\nIncome Taxes\nDeferred tax liabilities and assets are determined based on the difference between the financial statement and tax basis of assets and liabilities and are measured by applying enacted tax rates and laws for the taxable years in which those differences are expected to reverse. In addition, a valuation allowance is recorded if it is believed more likely than not that a deferred tax asset will not be fully realized.\nWe recognize the financial statement benefit of a tax position only after determining that the relevant tax authority would \"more likely than not\" sustain the position following an audit. For tax positions meeting the \"more likely than not\" threshold, the amount recognized in the financial statements is the largest benefit that has a greater than 50 percent likelihood of being realized upon ultimate settlement with the relevant tax authority.\nForeign Currency\nFor all foreign operations, the functional currency is the local currency. The assets and liabilities of foreign operations are translated into U.S. Dollars at period-end exchange rates, and revenue and expenses are translated at average exchange rates for the year. The resulting cumulative translation adjustment is included in accumulated other comprehensive loss on our consolidated balance sheets. Gains and losses from foreign currency transactions are included in \"other expense, net\" on our consolidated statements of operations.\nContingencies\nLiabilities for loss contingencies arising from claims, assessments, litigation, fines and penalties, and other sources are recorded when it is probable that a liability has been incurred and the amount of the assessment and/or remediation can be reasonably estimated. Where claims are reasonably possible, we disclose a potential liability.\nFair Value Measurements\nU.S. GAAP provides a framework for measuring fair value, establishes a fair value hierarchy of the valuation techniques used to measure the fair value, and requires certain disclosures relating to fair value measurements. Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between marketplace participants.\nThe three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value, is as follows:\nLevel 1 - Observable inputs such as quoted prices (unadjusted) in active markets for identical assets or liabilities that we have the ability to access;\nLevel 2 - Inputs, other than the quoted market prices included in Level 1, which are observable for the asset or liability, either directly or indirectly; and\nLevel 3 - Unobservable inputs for the asset or liability, which is typically based on an entity's own assumptions when there is little, if any, related market data available.\nWe evaluate assets and liabilities subject to fair value measurements on a recurring and non-recurring basis to determine the appropriate level to classify them for each reporting period. This determination requires significant judgments to be made.\nWe hold investments in a Rabbi Trust on behalf of our deferred compensation plan. These assets are recorded on our consolidated balance sheets at fair value under the heading of \"Deferred compensation plan assets.\" These assets have quoted prices in active markets (Level 1). See \"Note 16. Employee Benefit Plans and Deferred Compensation\" for further details.\nWe use derivative instruments to manage interest rate exposure. All derivative instruments are recorded on the balance sheet at fair value. The valuation is calculated based on observable inputs (Level 2). See \"Note 8. Debt and Derivatives\" for further details.\nWe record contingent consideration payments related to acquisitions that may be paid in the future. The related liabilities are recorded on our consolidated balance sheets at estimated fair value under the heading \"Other liabilities\" and updated on a quarterly basis as an acquisition-related expense or benefit. The valuation of this liability is derived from internal estimates of future performance and not from inputs that are observable (Level 3). See \"Note 6. Business Combinations and Divestitures\" for further details.\nLeases\nWe enter into contractual arrangements primarily for the use of real estate facilities, information technology equipment, and certain other equipment. These arrangements contain a lease when we control the underlying asset and have the right to obtain substantially all of the economic benefits or outputs from the asset. Where contracts include both lease and non-lease components, we do not separate the non-lease components in our accounting. The majority of our leases are operating leases.\nAt the inception of a lease, we recognize a liability for future minimum lease payments based upon the present value of those payments.\nIn identifying our future minimum lease payments, we do not include variable lease costs, such as those for maintenance or utilities. These are recorded as lease expenses in the period in which they are incurred.\nIn identifying future lease payments, we do not include short-term leases, identified as those with an initial term of twelve months or less.\nLease options are included within our lease liability only where it is reasonably certain that we will utilize those periods of the lease and incur the related costs.\nIn calculating the fair value of our lease liability, we utilize an estimate of our collateralized incremental borrowing rate. This estimate is based upon publicly available information adjusted for company, country, and lease-specific factors. The weighted average incremental borrowing rate utilized as of September 30, 2023, was 5.5%.\nOver the course of a lease, the lease liability is reduced as scheduled lease payments are made and increased as the implied interest charges are added.\nOur right-of-use asset is based upon the lease liability at the contract inception but is adjusted over the life of the lease by lease prepayments, additional costs, or lease incentives. The right-of-use asset is amortized on a straight-line basis over the lease term, offset by the interest accretion recorded on the lease liability.\nLease expense is recorded within our consolidated statements of operations based upon the nature of the assets. Where assets are used to directly serve our customers, such as facilities dedicated to customer contracts, lease costs are recorded in \"cost of revenue.\" Facilities and assets that serve management and support functions are expensed through \"selling, general, and administrative expenses.\"\nStock Compensation Plan\nWe grant both restricted stock units (\"RSUs\") and performance stock units (\"PSUs\") to eligible participants under our 2021 Omnibus Incentive Plan, which was approved by the Board of Directors and the Company's shareholders.\nThe fair value of each RSU is equal to the market price of our common stock at the date of the grant, which is expensed ratably over the vesting period. The RSUs granted vest ratably over one to five years, in each case from the grant date. All individuals who are granted RSUs also receive dividend-equivalent payments in the form of additional RSUs. However, until the shares are issued, they have no voting rights and may not be bought or sold. In the event that an award is forfeited, the dividend-equivalent payments received by the holder with respect to that award are also forfeited. We estimate our stock award forfeitures as we expense each award.\nWe issue PSUs with targets based upon profit metrics. These PSUs vest in full at the end of a three-year period. The fair value of each award is based upon the market price of the common stock on the day of the grant, and expense is recorded based upon our estimate of how much of the award will vest over the three years of the award.\nWe issue PSUs with a target based upon total shareholder return. These PSUs vest in full after three years. The fair value of each award is based upon an assessment performed at the grant date and is expensed over the life of the award regardless of whether the targets are reached.\nCertain executive awards include a retirement provision whereby such awards fully vest upon an employee's retirement. We recognize total compensation expense of the awards for eligible participants ratably over the shorter of the vesting period or the employees' retirement eligibility date.\nDerivative Instruments\nWe use interest rate swap contracts to lock a portion of the variability of the interest payments on long-term debt. We have elected to designate these derivative instruments as cash flow hedges. The effective portion of changes in the fair value of the derivative is recorded to accumulated other comprehensive income and is reclassified to earnings, through \"Interest expense\", when the underlying forecasted transaction affects earnings. Cash flows from derivative instruments are included in net cash provided by operating activities in the consolidated statements of cash flows. We reassess the effectiveness of the hedges on a quarterly basis.\n3. BUSINESS SEGMENTS\nWe conduct our operations through three business segments: U.S. Federal Services, U.S. Services, and Outside the U.S.\nU.S. Federal Services\nOur U.S. Federal Services Segment delivers end-to-end solutions that help various U.S. federal government agencies better deliver on their mission, including program operations and management, clinical services, and technology solutions. This segment also includes appeals and assessments services, system and application development, Information Technology (\"IT\") modernization, and maintenance services. Certain state-based assessments and appeals work that is part of the segment's heritage continues to be managed within this segment. Under Technology Consulting Services (\"TCS\"), the segment executes on its digital strategy to deliver technology solutions that advance agency missions, including the challenge to modernize, provide better customer experience, and drive process efficiencies. The segment continues to expand its clinical solutions through VES, which manages the clinical evaluation process for U.S. veterans and service members on behalf of the VA.\nU.S. Services\nOur U.S. Services Segment provides a variety of BPS, such as program administration, assessments, and related consulting work for U.S. state and local government programs. These services support a variety of programs, including the ACA, Medicaid, the Children's Health Insurance Program (\"CHIP\"), Temporary Assistance to Needy Families (\"TANF\"), and child support programs. Over the last three years, many programs in this segment have been operating with depressed margins resulting from the pause in Medicaid redeterminations. The depressed margins have resulted from reduced operating leverage in the segment as costs cannot scale down at the same rate to meet lower demand due to requirements to fulfill other obligations on these contracts. With the resumption of redeterminations, we expect a full period of volumes in 2024 coming back into these programs, enabling our operating leverage to recover.\nOutside the U.S.\nOur Outside the U.S. Segment provides BPS for international governments, transforming the lives of people around the world. Helping people find employment, access vital support, and remain healthy, these services include health and disability assessments, program administration for employment services, wellbeing solutions, and other job seeker-related services. We support programs and deliver services in the United Kingdom, including the Health Assessment Advisory Service (\"HAAS\") and the recently awarded replacement contract to start in 2024, Functional Assessment Services (FAS), and Restart; Australia, including Workforce Australia and employment support and job seeker services worldwide.\nTable 3.1: Results of Operation by Business Segment\nFor the Year Ended September 30,\n2023 2022 2021\nAmount % (1) Amount % (1) Amount % (1)\n(dollars in thousands)\nRevenue:\nU.S. Federal Services $ 2,403,606 $ 2,259,744 $ 1,893,284\nU.S. Services 1,812,069 1,607,612 1,662,110\nOutside the U.S. 689,053 763,662 699,091\nRevenue $ 4,904,728 $ 4,631,018 $ 4,254,485\nGross profit:\nU.S. Federal Services $ 557,886 23.2 % $ 519,440 23.0 % $ 432,551 22.8 %\nU.S. Services 377,541 20.8 % 343,004 21.3 % 408,050 24.6 %\nOutside the U.S. 93,181 13.5 % 77,366 10.1 % 106,374 15.2 %\nGross profit $ 1,028,608 21.0 % $ 939,810 20.3 % $ 946,975 22.3 %\nSelling, general, and administrative expenses:\nU.S. Federal Services $ 308,197 12.8 % $ 284,509 12.6 % $ 243,485 12.9 %\nU.S. Services 194,991 10.8 % 160,902 10.0 % 153,609 9.2 %\nOutside the U.S. 102,311 14.8 % 92,536 12.1 % 86,248 12.3 %\nDivestiture related charges (2) 3,751 NM - NM - NM\nOther (4) 29,973 NM (3,454) NM 10,746 NM\nSelling, general, and administrative expenses $ 639,223 13.0 % $ 534,493 11.5 % $ 494,088 11.6 %\nOperating income/(loss):\nU.S. Federal Services $ 249,689 10.4 % $ 234,931 10.4 % $ 189,066 10.0 %\nU.S. Services 182,550 10.1 % 182,102 11.3 % 254,441 15.3 %\nOutside the U.S. (9,130) (1.3) % (15,170) (2.0) % 20,126 2.9 %\nAmortization of intangible assets (94,591) NM (90,465) NM (44,357) NM\nDivestiture related charges (2) (3,751) NM - NM - NM\nGain on sale of land and building (3) - NM 11,046 NM - NM\nOther (4) (29,973) NM 3,454 NM (10,746) NM\nOperating income $ 294,794 6.0 % $ 325,898 7.0 % $ 408,530 9.6 %\nDepreciation and amortization:\nU.S. Federal Services $ 18,336 0.8 % $ 12,332 0.5 % $ 12,986 0.7 %\nU.S. Services 22,674 1.3 % 16,528 1.0 % 20,350 1.2 %\nOutside the U.S. 13,715 2.0 % 13,470 1.8 % 13,025 1.9 %\nDepreciation and amortization $ 54,725 1.1 % $ 42,330 0.9 % $ 46,361 1.1 %\n(1)Percentage of respective segment revenue. Percentages not considered meaningful are marked \"NM.\"\n(2)During fiscal year 2023, we sold a small commercial practice in the United Kingdom and our employment operations business in Sweden, both subsidiaries within our Outside the U.S. Segment, resulting in a loss of $0.9 million. In addition, we recorded impairment losses of $2.9 million on businesses sold subsequent to fiscal year end. Refer to \"Note 6. Business Combinations and Divestitures\" and \"Note 17. Subsequent Events\" for more details.\n(3)During fiscal year 2022, we sold the land and building that held our corporate headquarters, resulting in a gain on sale of $11.0 million.\n(4)Other includes credits and costs that are not allocated to a particular segment. For the fiscal year 2023, these charges include $29.3 million related to the costs of a previously disclosed cybersecurity incident. Other charges include direct costs of acquisitions. These costs are excluded from measuring each segment's operating performance.\nTable 3.2: Assets by Segment\nAs of September 30,\n2023 2022\n(in thousands)\nU.S. Federal Services $ 2,716,367 $ 2,858,662\nU.S. Services 780,737 736,970\nOutside the U.S. 278,289 277,016\nCorporate 210,404 120,066\nAssets $ 3,985,797 $ 3,992,714\nOur long-lived assets consist of property and equipment, capitalized software costs, operating lease right-of-use assets, and deferred compensation plan assets.\nTable 3.3: Long-Lived Assets by Geography\nAs of September 30,\n2023 2022\n(in thousands)\nUnited States $ 313,830 $ 238,523\nOutside the US 39,660 42,410\nTotal $ 353,490 $ 280,933\n4. REVENUE RECOGNITION\nWe recognize revenue as, or when, we satisfy performance obligations under a contract. The majority of our contracts have performance obligations that are satisfied over time. In most cases, we view our performance obligations as promises to transfer a series of distinct services to our customers that are substantially the same and which have the same pattern of service. We recognize revenue over the performance period as a customer receives the benefits of our services.\nDisaggregation of Revenue\nIn addition to our segment reporting, we disaggregate our revenues by service, contract type, customer type, and geography. Our operating segments represent the manner in which our Chief Executive Officer reviews our financial results, which is further discussed in \"Note 3. Business Segments.\"\nTable 4.1: Revenue by Service Type\nFor the Year Ended September 30,\n2023 % 2022 % 2021 %\n(dollars in thousands)\nProgram Operations $ 2,607,263 53.2 % $ 2,596,801 56.1 % $ 2,755,820 64.8 %\nClinical Services 1,486,040 30.3 % 1,176,081 25.4 % 699,424 16.4 %\nEmployment & Other 520,981 10.6 % 551,755 11.9 % 463,695 10.9 %\nTechnology Solutions 290,444 5.9 % 306,381 6.6 % 335,546 7.9 %\nTotal revenue $ 4,904,728 $ 4,631,018 $ 4,254,485\nTable 4.2: Revenue by Contract Type\nFor the Year Ended September 30,\n2023 % 2022 % 2021 %\n(dollars in thousands)\nPerformance-based $ 2,425,597 49.5 % $ 2,091,608 45.2 % $ 1,416,562 33.3 %\nCost-plus 1,238,574 25.3 % 1,248,759 27.0 % 1,237,995 29.1 %\nFixed price 717,167 14.6 % 627,402 13.5 % 553,645 13.0 %\nTime and materials 523,390 10.7 % 663,249 14.3 % 1,046,283 24.6 %\nTotal revenue $ 4,904,728 $ 4,631,018 $ 4,254,485\nTable 4.3: Revenue by Customer Type\nFor the Year Ended September 30,\n2023 % 2022 % 2021 %\n(dollars in thousands)\nU. S. federal government agencies $ 2,344,863 47.8 % $ 2,189,303 47.3 % $ 1,805,131 42.4 %\nU.S. state government agencies 1,800,814 36.7 % 1,605,457 34.7 % 1,654,555 38.9 %\nInternational government agencies 663,044 13.5 % 722,192 15.6 % 663,180 15.6 %\nOther, including local municipalities and commercial customers 96,007 2.0 % 114,066 2.5 % 131,619 3.1 %\nTotal revenue $ 4,904,728 $ 4,631,018 $ 4,254,485\nContract balances\nDifferences in timing between revenue recognition and cash collection result in contract assets and contract liabilities. We classify these assets as accounts receivable - billed and billable and unbilled receivables; the liabilities are classified as deferred revenue.\nIn many contracts, we bill our customers on a monthly basis shortly after the month end for work performed in that month, and such balances are considered collectible and are included within accounts receivable, net.\nExceptions to this pattern will arise for various reasons, including those listed below.\nUnder cost-plus contracts, we are typically required to estimate a contract's share of our general and administrative expenses. This share is based upon estimates of total costs, which may vary over time. We typically invoice our customers at an agreed provisional billing rate which may differ from actual rates incurred. If our actual rates are higher than the provisional billing rates, an asset is recorded for this variance; if the provisional billing rates are higher than our actual rates, we record a liability.\nCertain contracts include retainage balances, whereby revenue is earned, but some portion of cash payments are held back by the customer for a period of time, typically to allow the customer to confirm the objective criteria laid out by the contract have been met. This balance is classified as accounts receivable - unbilled until restrictions on billing are lifted. As of September 30, 2023 and 2022, $20.7 million and $13.1 million, respectively, of our unbilled receivables related to amounts pursuant to contractual retainage provisions.\nIn certain contracts, we may receive funds from our customers prior to performing operations. These funds are typically referred to as \"set-up costs\" and reflect the need for us to make investments in infrastructure prior to providing a service. This investment in infrastructure is not a performance obligation that is distinct from the service that is subsequently provided and, as a result, revenue is not recognized based upon the establishment of this infrastructure but rather over the course of the contractual relationship. The funds are initially recorded as deferred revenue and recognized over the term of the contract. Other contracts may not include set-up fees but will provide higher fees in earlier periods of the contract. The premium on these fees is deferred.\nSome of our contracts, notably our employment services contracts in the Outside the U.S. Segment, include payments for desired outcomes, such as job placement and job retention, and these outcome payments occur over several months. We are required to estimate these outcome fees ahead of their realization and recognize this estimated fee over the period of delivery.\nDuring the year ended September 30, 2023, we recognized revenue of $81.5 million included in our deferred revenue balances at September 30, 2022. During the year ended September 30, 2022, we recognized revenue of $103.2 million included in our deferred revenue balances at September 30, 2021.\nContract estimates\nWe are required to use estimates in recognizing revenue from some of our contracts.\nSome of our performance-based contract revenue is recognized based upon future milestones defined in each contract. This is the case in many of our employment services contracts in the Outside the U.S. Segment, where we are paid as individuals attain employment milestones, which may take many months to achieve. We recognize revenue over the period of performance. Our estimates vary from contract to contract but may include the number of participants within a portfolio reaching employment milestones and the service delivery periods for participants reaching the employment milestone.\nWe estimate the total variable fees we will receive using the expected value method. We recognize the fees over the expected period of performance. At each reporting period, we update our estimates of the variable fees to represent the circumstances present at the end of the reporting period. We are required to constrain our estimates to the extent that it is probable that there will not be a significant reversal of cumulative revenue when the uncertainty is resolved. We do not have a history of significant constraints on these contracts.\nDuring the fiscal years ended September 30, 2023 and 2022, we recognized revenue from these performance-based fees of $120.6 million and $142.4 million, respectively. At September 30, 2023 and 2022, we recorded $53.9 million and $55.4 million, respectively, of these estimated outcome fees, which will be collected only when we reach anticipated targets. This balance is included on our consolidated balance sheets within the related contract accounts.\nTable 4.4: Effect of Changes in Contract Estimates\nFor the Year Ended September 30,\n2023 2022\n(in thousands, except per share data)\nBenefit to/(reduction of) revenue recognized due to changes in contract estimates $ (13,346) $ (2,500)\nBenefit to/(reduction of) diluted earnings per share recognized due to changes in contract estimates $ (0.16) $ (0.03)\nRemaining performance obligations\nAs of September 30, 2023, we had approximately $300 million of remaining performance obligations. We anticipate that we will recognize revenue on approximately 70% of this balance within the next 12 months. This balance excludes contracts with an original duration of twelve months or less, including contracts with a penalty-free termination for convenience clause and any variable consideration that is allocated entirely to future performance obligations, including variable transaction fees or fees tied directly to costs incurred.\n5. EARNINGS PER SHARE\nTable 5: Weighted Average Number of Shares - Earnings Per Share\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nBasic weighted average shares outstanding 61,125 61,774 62,072\nDilutive effect of unvested RSUs and PSUs 325 195 293\nDenominator for diluted earnings per share 61,450 61,969 62,365\nThe diluted earnings per share calculation for the year ended September 30, 2023, 2022, and 2021 excludes approximately 231,000, 444,000, and 55,000 unvested anti-dilutive restricted stock units, respectively.\n6. BUSINESS COMBINATIONS AND DIVESTITURES\nVES Group, Inc. (VES)\nOn May 28, 2021, we acquired 100% of VES for a purchase price of $1.37 billion (the \"VES Acquisition\"). VES was integrated into our U.S. Federal Services Segment. The VES Acquisition supports our ongoing strategic priority of expansion into the U.S. Federal market and accelerates our clinical evolution to meet long-term demand for BPS with a clinical dimension. We have completed our valuation of all acquired assets and liabilities assumed.\nTable 6.1: VES Valuation\nAllocation of Assets and Liabilities\n(in thousands)\nConsideration paid:\nCash consideration, net of cash acquired 1,370,631\nAssets acquired:\nAccounts receivable - billed, billable and unbilled $ 44,078\nPrepaid expenses and other current assets 7,955\nProperty and equipment, net 8,021\nOperating lease right-of-use assets 18,898\nIntangible assets 664,000\nOther assets 7,166\nTotal identifiable assets acquired 750,118\nLiabilities assumed:\nAccounts payable and accrued compensation 43,986\nOperating lease liabilities 18,898\nIncome taxes payable, current 5,673\nDeferred income taxes 171,023\nOther long-term liabilities 12,270\nTotal identifiable liabilities assumed 251,850\nNet identifiable assets acquired 498,268\nGoodwill 872,363\nNet assets acquired $ 1,370,631\nGoodwill represents the value of the assembled workforce and the enhanced knowledge, capabilities, and qualifications held by the business. This goodwill balance is not deductible for tax purposes.\nOur evaluation of the intangible assets acquired with VES identified three assets. The assets were valued using methods that required a number of estimates and, accordingly, they are considered Level 3 measurements within the Accounting Standard Codification No. 820 (ASC 820) fair value methodology.\nCustomer relationships represent the value of the existing contractual relationships with the United States Federal Government. These were valued using the excess earnings method, which required us to utilize estimated future revenues and earnings from contracts and an appropriate rate of return.\nVES maintains a provider network of third-party providers that assist in the performance of their clinical services. This network was valued using the cost method and income approach, which included both the cost of recreating such a network and the profits foregone during the time that would be required to recreate the network and an appropriate rate of return.\nVES maintains proprietary technology that interacted with U.S. federal government systems, facilitated the transmission of examination data, and supported the performance of the contracts. We valued the technology using a relief-from-royalty method, which required us to estimate future revenues and an arm's length royalty rate that a third-party provider might use to supply this service and an appropriate rate of return.\nTable 6.2: VES Intangible Asset Values and Useful Lives\nEstimated Fair Value\n(in thousands)\nCustomer contracts and relationships $ 580,000\nProvider network 57,000\nTechnology-based intangible assets 27,000\nTotal intangible assets $ 664,000\nThese assets were assumed to have a 12 year useful economic life. During fiscal year 2023, we have taken the opportunity to improve our technology portfolio and have elected to develop assets to replace those acquired. Accordingly, we have revised the estimated useful economic life of the technology-based intangible assets, assuming they will be used until September 2026. This change in useful economic life will result in an additional annual expense of $3.8 million.\nAt acquisition, we established a tax liability of $12.3 million for uncertain tax positions within VES, partially offset by another indemnification asset of $7.2 million. Since the acquisition, we have resolved a number of uncertain tax positions and, therefore, at September 30, 2023, we retain an estimated indemnification asset of $0.8 million, backed up by an escrow account.\nThe Federal division of Attain, LLC (\"Attain\")\nOn March 1, 2021, we acquired 100% of Attain for a cash purchase price of $419.1 million. This business was integrated into our U.S. Federal Services Segment and is expected to strengthen our position to further design, develop, and deliver more innovative, impactful solutions and drive automation of processes to improve citizen engagement and the delivery of critical federal programs, as well as expand our presence in the U.S. Federal market. We utilized borrowings on the credit facility we had in place at the time, as well as cash on our balance sheet to fund the acquisition.\nTable 6.3: Attain Valuation\nAllocation of Assets and Liabilities\n(in thousands)\nConsideration paid:\nCash consideration paid, net of cash acquired $ 419,097\nAssets acquired:\nAccounts receivable - billed, billable and unbilled 39,375\nPrepaid expenses and other current assets 926\nOperating lease right-of-use assets 24,960\nIntangible assets 105,000\nOther assets 74\nTotal identifiable assets acquired 170,335\nLiabilities assumed:\nAccounts payable and other liabilities 28,863\nOperating lease liabilities, less current portion 26,401\nTotal identifiable liabilities assumed 55,264\nNet identifiable assets acquired 115,071\nGoodwill 304,026\nNet assets acquired $ 419,097\nGoodwill represents the value of the assembled workforce and the enhanced knowledge, capabilities, and qualifications held by the business. This goodwill balance is expected to be deductible for tax purposes.\nThe intangible assets acquired represent customer relationships. We estimated this balance using the excess earnings method (which is a Level 3 measurement within the ASC 820 fair value hierarchy) and used a number of estimates, including expected future revenue and earnings from the acquired business and an appropriate expected rate of return. We have assumed a useful economic life of 10 years, representing our expectation of the period over which we will receive the benefit.\nAidvantage\nOn October 6, 2021, we completed the acquisition of the student loan servicing business from Navient, rebranded as Aidvantage. This business is a part of our U.S. Federal Services Segment and supplements our existing portfolio of services to the U.S. Department of Education.\nThe purchase price consideration is contingent upon future volumes, with a maximum payment of $65.0 million. The final payment is uncertain as there are a number of potential outcomes. We estimated the fair value of this liability, based upon a probability-weighted assessment of the potential outcomes, of $18.5 million. We update this liability each quarter as changes are made to our estimate of fair value. These changes are recorded through our statement of operations. If our obligation is less than anticipated, this will result in a benefit to our earnings. The obligation may be higher, either because the number of student loans we are servicing increases or if the contractual relationship we have acquired is extended beyond its current anticipated end date. In that instance, we would record an expense to earnings, which we would anticipate being offset by additional benefits from the contract. However, the timing of the adjustment to the obligation and the anticipated financial benefits would be unlikely to be consistent. Since the acquisition, we have made payments of $10.8 million and retain an estimated obligation of $7.5 million.\nWe recorded a single intangible asset related to the customer contract and relationship of $16.7 million, which we are amortizing over 27 months. The goodwill balance, representing the difference between the identifiable assets acquired and the estimated obligation, represents the assembled workforce, as well as the knowledge base acquired.\nOther acquisitions\nStirling Institute of Australia Pty Ltd (\"Stirling\")\nOn June 1, 2022, we acquired 100% of the share capital of Stirling for an estimated purchase price of $4.1 million (A$5.7 million Australian Dollars). Stirling provides vocational training to Australians seeking to improve their knowledge and qualifications. We acquired this business to complement our existing employment services. The business was integrated into our Outside the U.S. Segment. We recorded goodwill and intangible assets of $2.3 million and $1.8 million, respectively, related to the acquisition.\nBZ Bodies Limited (\"BZB\")\nOn January 31, 2022, we acquired 100% of the share capital of BZB for a purchase price of $2.5 million (£1.9 million British Pounds), which includes an estimate of contingent consideration payable upon future performance. BZB provides weight management services for adults, children, and vulnerable groups in the United Kingdom. We acquired this business to complement our services within the United Kingdom. The business was integrated into our Outside the U.S. Segment. We recorded goodwill and intangible assets of $1.4 million and $1.3 million, respectively, related to the acquisition.\nConnect Assist Holdings Limited (\"Connect Assist\")\nOn September 14, 2021, we acquired 100% of the share capital of Connect Assist Holdings Limited (\"Connect Assist\") for a purchase price of $20.8 million (£15.5 million British Pounds). We acquired this business to improve our contact center services and qualifications within the United Kingdom. The business was integrated into our Outside the U.S. Segment. We recorded goodwill and intangible assets of $11.1 million and $7.7 million, respectively, related to the acquisition.\nDivestitures\nOn March 6, 2023, we sold a small commercial practice in the United Kingdom, part of our Outside the U.S. Segment, resulting in a pre-tax loss of $0.6 million. The cash consideration will be received in installments. These installment payments are unconditional.\nOn March 30, 2023, we sold our Swedish subsidiary, which is part of our Outside the U.S. Segment, for cash consideration of $0.4 million, resulting in a small loss.\n7. GOODWILL AND INTANGIBLE ASSETS\nTable 7.1: Changes in Goodwill by Segment\nU.S. Federal Services U.S. Services Outside the U.S. Total\n(in thousands)\nBalance as of September 30, 2021 $ 1,549,921 $ 164,472 $ 60,013 $ 1,774,406\nAcquisitions 9,942 - 3,739 13,681\nForeign currency translation - - (8,672) (8,672)\nBalance as of September 30, 2022 1,559,863 164,472 55,080 1,779,415\nDivestitures - - (3,172) (3,172)\nForeign currency translation - - 2,972 2,972\nBalance as of September 30, 2023 $ 1,559,863 $ 164,472 $ 54,880 $ 1,779,215\nThere were no impairment charges to our goodwill for the years ended September 30, 2023, 2022, and 2021.\nTable 7.2: Details of Intangible Assets, Net\nAs of September 30,\n2023 2022\nCost Accumulated\nAmortization Intangible\nAssets, Net Cost Accumulated\nAmortization Intangible\nAssets, Net\n(in thousands)\nCustomer contracts and relationships $ 891,511 $ 251,868 $ 639,643 $ 905,285 $ 175,349 $ 729,936\nVES Provider network 57,000 11,083 45,917 57,000 6,333 50,667\nTechnology-based intangible assets 31,572 13,484 18,088 31,984 7,683 24,301\nTrademarks and trade names 4,471 4,471 - 4,466 4,466 -\nTotal $ 984,554 $ 280,906 $ 703,648 $ 998,735 $ 193,831 $ 804,904\nTable 7.3: Details of Weighted Average Remaining Lives\nAs of September 30, 2023\nCustomer contracts and relationships 8.9 years\nVES Provider network 9.7 years\nTechnology-based intangible assets 3.0 years\nWeighted Average Remaining Life 8.8 years\nTable 7.4: Details of Future Amortization Expense of Intangible Assets, Net\nAs of September 30, 2023\n(in thousands)\nYear ended September 30, 2024 $ 87,877\nYear ended September 30, 2025 85,828\nYear ended September 30, 2026 85,211\nYear ended September 30, 2027 79,164\nYear ended September 30, 2028 78,928\nThereafter 286,640\nTotal $ 703,648\n8. DEBT AND DERIVATIVES\nTable 8.1: Details of Debt\nAs of September 30,\n2023 2022\n(in thousands)\nTerm Loan A, due 2026 $ 909,375 $ 971,250\nTerm Loan B, due 2028 344,934 395,000\nSubsidiary loan agreements 3,220 64\nFunded Debt 1,257,529 1,366,314\nLess: Unamortized debt-issuance costs and discounts (7,536) (10,373)\nTotal debt 1,249,993 1,355,941\nLess: Current portion of long-term debt (86,844) (63,458)\nLong-term debt $ 1,163,149 $ 1,292,483\nOur principal debt agreement is with JPMorgan Chase Bank, N.A., as Administrative Agent (\"Credit Agreement\"), comprising of the following:\nA term loan A facility (\"Term Loan A\"), initially comprising $1.1 billion, which matures on May 28, 2026;\nA term loan B facility (\"Term Loan B\"), initially comprising $400 million, which matures May 28, 2028;\nA $600 million revolving credit facility (\"Revolver\"), which matures May 28, 2026.\nSince December 2022, the interest rates applicable to loans under the Credit Agreement are floating rates based upon the Secured Overnight Financing Rate (\"SOFR\") plus a margin. Term Loan A and the Revolver margins range between 1% and 2%, based upon our leverage ratio. Term Loan B is set to SOFR plus 2.00%, subject to a SOFR floor of 0.50%. Prior to December 2022, our Credit Agreement utilized the London Interbank Offered Rate as the basis for floating rates. As of September 30, 2023, the annual effective interest rate, including the original issue discount and amortization of debt issuance costs, was 5.97%.\nThe Credit Agreement provides for an annual commitment fee payable on funds not borrowed or utilized for letters of credit. This charge is based upon our leverage and varies between 0.125% and 0.30%. Commitment fees are recorded as interest expense on the consolidated statements of operations.\nThe Credit Agreement is available for general corporate purposes, including the funding of working capital, capital expenditures, and possible future acquisitions. In addition to borrowings, it allows us to continue to issue letters of credit when necessary.\nUnder the terms of the Credit Agreement, the Company is required to comply with certain covenants, the terms of which are customary and include a Consolidated Net Total Leverage Ratio and a Consolidated Net Interest Coverage Ratio. The Consolidated Net Total Leverage Ratio is calculated as total outstanding debt less the lower of (a) unrestricted cash or (b) $75.0 million divided by Consolidated EBITDA (as defined by the Credit Agreement). With certain exceptions, the covenant requires the Consolidated Net Total Leverage Ratio to be less than 4.00, calculated over the previous twelve months. The Consolidated Net Interest Coverage Ratio is calculated as Consolidated EBITDA divided by Consolidated Net Interest Expense over the previous twelve months, all defined by the Credit Agreement. The covenant requires a Consolidated Net Interest Coverage Ratio of 3.00 or greater. As of September 30, 2023, the Company calculated a Consolidated Net Total Leverage Ratio of 2.19 and Consolidated Net Interest Coverage Ratio of 6.28. The Company was in compliance with all applicable covenants under the Credit Agreement as of September 30, 2023. We do not believe that the covenants represent a significant restriction to our ability to successfully operate the business or to pay our dividends.\nCosts incurred in establishing the Credit Agreement have been reported as a reduction to the gross debt balance and will be amortized over the respective lives of the arrangements.\nIn addition to the corporate Credit Agreement, we hold smaller credit facilities in Australia, Canada, and the United Kingdom. These allow our businesses to borrow to meet any short-term working capital needs.\nTable 8.2: Details of Future Minimum Principal Payments Due\nAmount Due\n(in thousands)\nYear ended September 30, 2024 $ 89,205\nYear ended September 30, 2025 92,860\nYear ended September 30, 2026 740,985\nYear ended September 30, 2027 3,485\nYear ended September 30, 2028 330,994\nTotal Payments $ 1,257,529\nInterest Rate Derivative Instrument\nWe utilize derivatives to reduce our variable interest rate risk. At September 30, 2023, we held the following interest rate swap agreements:\nAn agreement for a notional amount of $500.0 million, which hedges the floating rate of our Term Loan A debt to a fixed amount of 2.31%. This agreement expires in May 2026;\nAn agreement for a notional amount of $150.0 million, which hedges the floating rate on the next $150 million of our Term Loan A debt to a fixed amount of 4.38%. This agreement expires in September 2024.\nThe balance of the debt pays interest based upon an index. The floating interest rate on these instruments was converted from LIBOR to SOFR in December 2022, concurrent with our debt agreements. In converting our debt and interest-rate swaps, we utilized the practical expedients allowed under ASU No. 2020-04 Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting, which allowed us to treat these amendments as though the modification was not substantial.\nThe Company elected to designate these interest rate swaps as cash flow hedges for accounting purposes.\nAs of September 30, 2023 and 2022, we had assets of $31.0 million and $31.4 million, respectively, which were recorded in \"other assets\" on our Consolidated Balance Sheet. As these derivatives are considered effective, all gains and losses are reflected within \"accumulated other comprehensive income\" (\"AOCI\") in the Consolidated Statements of Comprehensive Income.\nTable 8.3: Gains/(Losses) on Derivatives\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nGain/(loss) recognized in AOCI on derivatives, net of tax $ 8,558 $ 23,004 $ (811)\nAmounts reclassified to earnings from accumulated other comprehensive income (8,837) 447 508\nNet current period other comprehensive income $ (279) $ 23,451 $ (303)\nCounterparty Risk\nThe Company is exposed to credit losses in the event of nonperformance by the counterparty to our derivative instrument. Our counterparty has investment-grade credit ratings; accordingly, we anticipate that the counterparty will be able to fully satisfy its obligations under the contracts. Our agreements outline the conditions upon which it or the counterparty are required to post collateral. As of September 30, 2023 and 2022, there was no collateral posted with the Company's counterparty related to the derivatives.\n9. FAIR VALUE MEASUREMENTS\nThe following assets and liabilities are recorded at fair value on a recurring basis.\nWe hold mutual fund assets within a Rabbi Trust to cover liabilities in our deferred compensation plan. These assets have prices quoted within active markets and, accordingly, are classified as level 1 within the fair value hierarchy.\nWe have interest rate swap agreements serving to reduce our interest rate risk on our debt. These agreements can be valued using observable data and, accordingly, are classified as level 2 within the fair value hierarchy.\nWe anticipate paying additional consideration for certain acquisitions based upon the subsequent performance of the businesses acquired. This liability is based upon our internal assumptions over revenues, margins, volumes, and contract terms. Accordingly, these inputs are not observable and are classified as level 3 within the fair value hierarchy.\nTable 9.1: Fair Value Measurements\nAs of September 30, 2023\nLevel 1 Level 2 Level 3 Balance\n(in thousands)\nAssets:\nDeferred compensation assets - Rabbi Trust $ 26,445 $ - $ - $ 26,445\nInterest rate swaps - $650 million notional value\n- 31,027 - 31,027\nTotal assets $ 26,445 $ 31,027 $ - $ 57,472\nLiabilities:\nContingent consideration $ - $ - $ 9,903 $ 9,903\nTotal liabilities $ - $ - $ 9,903 $ 9,903\nThe following table presents a reconciliation of the contingent consideration, which is measured and recorded at fair value on a recurring basis using Level 3 inputs:\nTable 9.2: Fair Value Measurement Using Significant Unobservable Inputs (Level 3)\nContingent Consideration\n(in thousands)\nBalance as of September 30, 2022 $ 16,236\nAdjustments to fair value recorded in the current year\n2,873\nCash payments (9,431)\nForeign currency translation 225\nBalance as of September 30, 2023 $ 9,903\nThe fair values of receivables, prepaid assets, other assets, accounts payable, accrued costs, and other current liabilities approximate the carrying values as a result of the short-term nature of these instruments. The carrying value of our debt is consistent with the fair value as the stated interest rates in the agreements are consistent with the current market rates used in notes with similar terms in the markets (Level 2 inputs).\nOther long-lived assets are reviewed when events indicate they may no longer be able to recover their value. Assets that we cease using or which do not appear able to generate sufficient future cash flows to support their values are reviewed and, where necessary, their value is written down. In this instance, the expense is reported in the same place where future expenses were anticipated to be recorded. For example, a fixed asset impairment would be recorded in depreciation expense. All the non-recurring fair values are considered Level 3, as the inputs are not observable and based on internal assumptions. During the year ended September 30, 2023, we recorded impairment charges of $9.5 million. For the year ended September 30, 2021, we recorded impairment charges of $12.5 million. We did not record impairment charges in the year ended September 30, 2022. These impairment charges were on our long-lived assets within our U.S. Services and Outside the U.S. Services Segments and relate to assets on underperforming contracts.\n10. LEASES\nTable 10.1: Details of Lease Costs\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nOperating lease cost $ 76,630 $ 90,423 $ 111,246\nShort-term lease cost 7,729 11,642 7,044\nVariable lease cost 12,417 12,032 11,124\nTotal operating lease costs $ 96,776 $ 114,097 $ 129,414\nTable 10.2: Future Minimum Lease Payments Under Non-cancelable Operating Leases\nOffice Space Equipment Total\n(in thousands)\nYear ended September 30, 2024 $ 57,829 $ 490 $ 58,319\nYear ended September 30, 2025 52,637 242 52,879\nYear ended September 30, 2026 34,667 30 34,697\nYear ended September 30, 2027 28,043 9 28,052\nYear ended September 30, 2028 20,640 5 20,645\nThereafter 6,193 - 6,193\nTotal minimum lease payments 200,009 776 200,785\nLess: Imputed interest (21,483) (83) (21,566)\nTotal lease liabilities $ 178,526 $ 693 $ 179,219\nOur weighted average remaining lease term as of September 30, 2023, is 3.9 years.\nFor the years ended September 30, 2023, 2022, and 2021, we made cash payments of $77.6 million, $86.5 million, and $96.9 million for amounts included in our lease liabilities, respectively. New or amended leases resulted in additional right-of-use assets of $109.4 million, $43.5 million, and $60.2 million for the same periods, respectively.\n11. INCOME TAXES\nTable 11.1: Components of Provision for Income Taxes\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nCurrent provision/(benefit):\nFederal $ 34,033 $ 45,042 $ 62,062\nState and local 12,332 15,371 20,077\nForeign 584 2,653 16,919\nTotal current provision for income taxes 46,949 63,066 99,058\nDeferred tax expense/(benefit):\nFederal (1,495) 7,107 (2,527)\nState and local (673) 2,130 (590)\nForeign 3,720 967 (3,460)\nTotal deferred tax expense/(benefit) 1,552 10,204 (6,577)\nProvision for income taxes $ 48,501 $ 73,270 $ 92,481\nTable 11.2: Components of Income before Provision for Income Taxes by Country\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nDomestic $ 198,115 $ 274,641 $ 339,647\nForeign 12,178 2,457 44,034\nIncome before provision for income taxes $ 210,293 $ 277,098 $ 383,681\nTable 11.3: Reconciliation of Tax Expense at Statutory Rate to Actual Tax Expense\nFor the Year Ended September 30,\n2023 2022 2021\n(dollars in thousands)\nTax expense at statutory rate $ 44,162 $ 58,190 $ 80,573\nIncrease/(decrease) due to:\nState income taxes, net of federal benefit 11,501 14,244 18,350\nForeign taxation rate differentials (590) (709) 4,212\nNon-deductible expenses 2,889 882 2,254\nGlobal intangible low taxed income 2,274 - -\nValuation allowance - foreign jurisdictions 2,010 4,875 2,285\nTax credits (6,645) (5,239) (5,072)\nExcess tax expense/(benefits) from stock-based compensation (1,399) 1,143 (6,008)\nOther (5,701) (116) (4,113)\nIncome tax expense $ 48,501 $ 73,270 $ 92,481\nU.S. Federal Statutory tax rate 21.0 % 21.0 % 21.0 %\nEffective tax rate 23.1 % 26.4 % 24.1 %\nTable 11.4: Components of Deferred Tax Assets and Liabilities\nAs of September 30,\n2023 2022\n(in thousands)\nDeferred tax assets/(liabilities):\nCosts deductible in future periods $ 37,036 $ 36,604\nDeferred revenue 8,712 7,273\nStock compensation 6,212 4,918\nCapital loss carryforward 2,391 2,391\nNet operating loss carryforwards 33,278 6,666\nAmortization of goodwill and intangibles (189,316) (198,903)\nCapitalized software (28,246) (15,445)\nAccounts receivable - unbilled (7,963) (12,087)\nProperty and equipment (3,437) (2,577)\nPrepaid expenses (10,906) (11,522)\nFinancial instruments (8,158) (8,261)\nValuation allowance (34,643) (8,075)\nOther (6,399) (2,111)\nNet deferred tax liability $ (201,439) $ (201,129)\nOur deferred tax assets and liabilities are held in various national and international jurisdictions that do not allow right of offset. Accordingly, our presentation of deferred taxes on our consolidated balance sheets is split between jurisdictions that show a net deferred tax asset and a net deferred tax liability.\nTable 11.5: Deferred Tax Assets and Liabilities By Jurisdiction Positions\nAs of September 30,\n2023 2022\n(in thousands)\nTotal of tax jurisdictions with net deferred tax assets $ 2,459 $ 4,970\nTotal of tax jurisdictions with net deferred tax liabilities (203,898) (206,099)\nNet deferred tax liabilities $ (201,439) $ (201,129)\nWe consider our foreign earnings in excess of the earnings subject to the one-time transition tax to be indefinitely reinvested outside of the U.S. in accordance with the relevant accounting guidance for income taxes. Accordingly, no U.S. deferred taxes were recorded with respect to such earnings. As of September 30, 2023, our foreign subsidiaries held approximately $31.1 million of cash and cash equivalents in either U.S. Dollars or local currencies.\nThe provision for income taxes includes all provision to return adjustments included in the year recognized in the financial statements.\nThe tax loss on the sale of a small commercial practice in the United Kingdom and our Swedish subsidiary increased both the net operating loss carryforwards as well as the valuation allowance. In both cases, the losses are able to be carried forward indefinitely.\nWe account for uncertain tax positions by recognizing the financial statement effects of a tax position only when, based upon the technical merits, it is \"more-likely-than-not\" that the position will be sustained upon examination. The total amount of unrecognized tax benefits that, if recognized, would affect our annual effective income tax rate was $4.9 million and $7.3 million at September 30, 2023 and 2022, respectively.\nWe report interest and penalties as a component of income tax expense. In the year ended September 30, 2021, we recognized interest expense relating to unrecognized tax benefits of $0.1 million, with no comparative amounts for the years ended September 30, 2023 and 2022.\nWe recognize and present uncertain tax positions on a gross basis (i.e., without regard to likely offsets for deferred tax assets, deductions, and/or credits that would result from payment of uncertain tax amounts).\nTable 11.6: Reconciliation of the Beginning and Ending Amounts of Potential Tax Benefits\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nBalance at beginning of year $ 8,676 $ 12,642 $ 1,798\nAdditions for acquired unrecognized tax benefits - - 11,244\nDecreases for lapse of statute of limitations (2,051) (1,412) -\nDecreases for settlements with taxing authorities (692) (4,785) -\nIncreases for tax positions taken in current year 300 2,231 300\nDecreases for tax positions taken in current year - - (700)\nBalance at end of year $ 6,233 $ 8,676 $ 12,642\nWe file income tax returns in the U.S. federal jurisdiction and in various state and foreign jurisdictions. We are no longer subject to federal income tax examinations for years before 2020 and to state and local income tax examinations by tax authorities for years before 2018. In international jurisdictions, similar rules apply to filed income tax returns, although the tax examination limitations and requirements may vary. We are no longer subject to audit by tax authorities for foreign jurisdictions for years prior to 2019.\n12. EQUITY\nStock Compensation\nWe grant restricted stock units (\"RSUs\") and performance stock units (\"PSUs\") to eligible participants under our 2021 Omnibus Incentive Plan, which was approved by the Board of Directors and the Company's shareholders. The RSUs granted to employees vest ratably over three to five years and one year for members of the board of directors, in each case from the grant date. PSU vesting is subject to the achievement of certain performance and market conditions, and the number of PSUs earned could vary from 0% to 200% of the number of PSUs awarded. The PSUs will vest at the end of a three-year performance period. We issue new shares to satisfy our obligations under these plans. The fair value of each RSU and PSU is calculated at the date of the grant.\nTable 12: Restricted Stock Units and Performance Based Stock Units\nRestricted Stock Units Performance Stock Units Total Weighted Average Grant Date Fair Value\nNon-vested outstanding units as of September 30, 2022 552,643 188,315 740,958 $ 77.08\nGranted 353,687 140,693 494,380 70.38\nVested (337,684) (61,791) (399,475) 71.87\nForfeited (87,512) (96,459) (183,971) 76.13\nNon-vested outstanding units as of September 30, 2023 481,134 170,758 651,892 $ 75.46\nIn addition to the non-vested shares, as part of individual elections made in the deferred compensation plan, certain directors and employees held approximately 286,000 vested but not issued awards as of September 30, 2023. These vested unissued units are included in outstanding shares for basic and diluted earnings per share but are not reported as issued and outstanding in the Consolidated Balance Sheets and Consolidated Statements of Changes in Shareholders' Equity.\nAs of September 30, 2023, the intrinsic value of RSUs and PSUs expected to vest was $48.7 million.\nFor the years ended September 30, 2023, 2022, and 2021, we recognized share-based compensation expenses of $29.5 million, $30.5 million, and $28.6 million, respectively. The income tax benefit recorded on these charges for the same years was $8.1 million, $6.9 million, and $13.5 million, respectively. The expenses related to share-based compensation awards are recorded in selling and administrative expenses. As of September 30, 2023, there was $42.1 million of total estimated unrecognized compensation cost related to non-vested RSUs and PSUs. This cost is expected to be recognized over four years.\nThe weighted-average grant-date fair value of RSUs granted in years ended September 30, 2022 and 2021, was $79.75 and $76.80, respectively. The total fair value of RSUs vested during the years ended September 30, 2023, 2022, and 2021, was $29.8 million, $23.5 million, and $28.9 million, respectively.\nStock Repurchase Programs\nUnder a resolution adopted in March 2020, the Board of Directors authorized the purchase, at management's discretion, of up to $200.0 million of our common stock. During the years ended September 30, 2022 and 2021, we purchased 1.4 million and 0.1 million common shares at a cost of $96.1 million and $3.4 million, respectively. We made no purchases during fiscal year 2023. As of September 30, 2023, $50.6 million remained available for future stock purchases.\n13. CASH AND CASH EQUIVALENTS AND RESTRICTED CASH\nTable 13.1: Details of Cash and Cash Equivalents and Restricted Cash\nAs of September 30,\n2023 2022\n(in thousands)\nCash and cash equivalents $ 65,405 $ 40,658\nRestricted cash 56,686 96,137\nCash, cash equivalents, and restricted cash $ 122,091 $ 136,795\nRestricted cash is recorded within \"Prepaid expenses and other current assets\" on the Consolidated Balance Sheets. At September 30, 2022, this balance includes $60.7 million of funds received from a customer which had previously been sold under our Receivables Purchase Agreement; this is offset by a corresponding liability in \"Other current liabilities.\" No similar arrangements existed at September 30, 2023. The remaining balance includes funds held in trust on behalf of certain clients, offset with a corresponding liability in \"Other current liabilities\" and certain collateral obligations on contracts.\nTable 13.2: Supplemental Disclosures of Cash Flow Information\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nInterest payments $ 81,098 $ 43,094 $ 14,539\nIncome tax payments $ 61,050 $ 76,038 $ 99,899\n14. OTHER BALANCE SHEET COMPONENTS\nAccounts Receivable, Net\nTable 14.1: Details of Accounts Receivable, Net\nAs of September 30,\n2023 2022\n(in thousands)\nBilled and billable receivables $ 692,707 $ 723,979\nUnbilled receivables 137,885 91,404\nAllowance for credit losses (3,719) (8,273)\nAccounts receivable, net $ 826,873 $ 807,110\nTable 14.2: Changes in Allowance for Credit Losses\nFor the Year Ended September 30,\n2023 2022 2021\n(in thousands)\nBalance at beginning of period $ 8,273 $ 8,044 $ 6,051\nProvision for estimated credit losses 7,097 6,799 11,038\nWrite-offs, net of recoveries (11,651) (6,570) (9,045)\nBalance at end of period $ 3,719 $ 8,273 $ 8,044\nOn September 21, 2022, we entered into a Receivables Purchase Agreement with Wells Fargo Bank N.A., under which we may sell certain US-originated accounts receivable balances up to a maximum amount of $200.0 million. In return for these sales, we receive a cash payment equal to the face value of the receivables less a financing charge.\nWe account for these transfers as sales. We have no retained interest in the transferred receivables other than administrative responsibilities, and Wells Fargo has no recourse for any credit risk. We estimate that the implicit servicing fees for an arrangement of this size and type would be immaterial.\nFor the years ended September 30, 2023 and 2022, the fair value of accounts receivables transferred to Wells Fargo and derecognized from our balance sheet was $450.4 million and $74.2 million, respectively. In exchange for these sales, we received cash of $447.7 million and $73.9 million for the same periods, respectively. The balance, representing a loss on sale from these transfers, is included within our selling, general, and administrative expenses. We have recorded these transactions within our operating cash flows.\nProperty and Equipment, Net\nTable 14.3: Details of Property and Equipment, Net\nAs of September 30,\n2023 2022\n(in thousands)\nOffice furniture and equipment $ 134,910 $ 209,258\nLeasehold improvements 78,520 78,727\nProperty and equipment, at cost 213,430 287,985\nAccumulated depreciation (174,599) (235,727)\nProperty and equipment, net $ 38,831 $ 52,258\nDepreciation expense for the years ended September 30, 2023, 2022, and 2021, was $28.4 million, $28.3 million, and $34.1 million, respectively. This expense was recorded within \"cost of revenue\" and \"selling, general, and administrative expenses\" on our consolidated statements of operations.\nIn August 2022, we sold the land and buildings that held our corporate headquarters, resulting in a gain on sale of $11.0 million.\nCapitalized Software Costs, Net\nCapitalized software is recorded at cost and includes purchased, internally-developed, and externally-developed software used in our operations. Amortization expense is provided using the straight-line method over the estimated useful lives of the software.\nA summary of activities related to capitalized software costs is shown below:\nTable 14.4: Details of Capitalized Software, Net\nAs of September 30,\n2023 2022\n(in thousands)\nCapitalized software $ 195,813 $ 161,353\nAccumulated amortization (88,002) (102,613)\nCapitalized software, net $ 107,811 $ 58,740\nAmortization expense related to capitalized software for the years ended September 30, 2023, 2022, and 2021 was $26.3 million, $14.1 million, and $12.3 million, respectively. The majority of this amortization was recorded within our \"cost of revenue\" and \"selling, general, and administrative expenses\" on our consolidated statements of operations.\nDeferred Contract Costs, Net\nDeferred contract costs consist of contractually recoverable costs to fulfill related to long-term service contracts. These costs include direct and incremental costs incurred prior to the commencement of providing service to our customer. These costs are expensed over the period the services are provided using the straight-line method.\nA summary of activities related to deferred contract costs is shown below:\nTable 14.5: Details of Deferred Contracts Costs, Net\nAs of September 30,\n2023 2022\n(in thousands)\nDeferred contract costs $ 77,597 $ 76,498\nAccumulated amortization (32,225) (28,766)\nTotal deferred contract costs, net $ 45,372 $ 47,732\nAmortization expense related to deferred contract costs for the years ended September 30, 2023, 2022, and 2021 was $12.7 million, $8.9 million, and $13.6 million, respectively. These amounts were recorded within our \"cost of revenue\" on our consolidated statements of operations.\nAccumulated Other Comprehensive Income\nAll amounts recorded in accumulated other comprehensive loss are related to our foreign currency translations and interest rate swap, net of tax. The following table shows changes in accumulated other comprehensive loss.\nTable 14.6: Details of Changes in Accumulated Other Comprehensive Loss by Category\nForeign currency translation adjustment Net unrealized (loss)/gain on derivatives, net of tax Total\n(in thousands)\nBalance as of September 30, 2020 $ (42,638) $ - $ (42,638)\nOther comprehensive income/(loss) before reclassifications 3,033 (811) 2,222\nAmounts reclassified from accumulated other comprehensive income/(loss) - 508 508\nNet current period other comprehensive income/(loss) 3,033 (303) 2,730\nBalance as of September 30, 2021 (39,605) (303) (39,908)\nOther comprehensive income/(loss) before reclassifications (17,504) 23,004 5,500\nAmounts reclassified from accumulated other comprehensive income/(loss) - 447 447\nNet current period other comprehensive income/(loss) (17,504) 23,451 5,947\nBalance as of September 30, 2022 (57,109) 23,148 (33,961)\nOther comprehensive income/(loss) before reclassifications 6,509 8,558 15,067\nAmounts reclassified from accumulated other comprehensive income/(loss) 116 (8,837) (8,721)\nNet current period other comprehensive income/(loss) 6,625 (279) 6,346\nBalance as of September 30, 2023 $ (50,484) $ 22,869 $ (27,615)\n15. COMMITMENTS AND CONTINGENCIES\nLitigation\nWe are subject to audits, investigations, and reviews relating to compliance with the laws and regulations that govern our role as a contractor to agencies and departments of federal, state, local, and foreign governments. Adverse findings could lead to criminal, civil, or administrative proceedings, and we could be faced with penalties, fines, suspension, or debarment. Adverse findings could also have a material adverse effect on us because of our reliance on government contracts. We are subject to periodic audits by federal, state, local, and foreign governments for taxes. We are also involved in various claims, arbitrations, and lawsuits arising in the normal conduct of our business. These include but are not limited to bid protests, employment matters, contractual disputes, and charges before administrative agencies. Although we can give no assurance, based upon our evaluation and taking into account the advice of legal counsel, we do not believe that the outcome of any existing matter would likely have a material adverse effect on our consolidated financial position, results of operations, or cash flows.\nWe evaluate, on a regular basis, developments in our litigation matters and establish or make adjustments to our accruals as appropriate. A liability is accrued if a loss is probable and the amount of such loss can be reasonably estimated. If the risk of loss is probable, but the amount cannot be reasonably estimated, or the risk of loss is only reasonably possible, a\npotential liability will be disclosed but not accrued. Due to the inherent uncertainty in the outcome of litigation, our estimates and assessments may prove to be incomplete or inaccurate and could be impacted by unanticipated events and circumstances, adverse outcomes, or other future determinations.\nMOVEit Cybersecurity Incident Litigation\nAs the Company has previously disclosed, on May 31, 2023, Progress Software Corporation, the developer of MOVEit (MOVEit), a file transfer application used by many organizations to transfer data, announced a critical zero-day vulnerability in the application that allowed unauthorized third parties to access its customers MOVEit environments. Maximus uses MOVEit for internal and external file sharing purposes, including to share data with government customers related to Maximus's services in support of certain government programs. Based on its review of the impacted files to date, the Company has provided notices to individuals whose personal information, including social security numbers, protected health information, and/or other personal information, may have been included in the impacted files.\nOn August 1, 2023, a purported class action was filed against Maximus Federal Services, Inc. (a wholly-owned subsidiary of Maximus, Inc.) in the U.S. District Court for the Eastern District of Virginia arising out of the MOVEit cybersecurity incident - Bishop v. Maximus Federal Services, Case No. 1:23-cv-01019 (U.S. Dist. Ct. E. D. VA). The plaintiff, who purports to represent a nationwide class of individuals, alleges, among other things, that the Companys negligence resulted in the compromise of the plaintiffs personally identifiable information and protected health information.\nSince August 1, 2023, approximately nine additional cases arising out of the MOVEit cybersecurity incident have been filed in federal courts against Maximus, Inc. and its subsidiaries. These cases each allege substantially similar allegations on behalf of putative nationwide classes and on behalf of various putative state subclasses.\nOn October 4, 2023, the United States Judicial Panel on Multidistrict Litigation (JPML) granted a Motion to Transfer that created a Multidistrict Litigation (MDL) in the District of Massachusetts for all cases in federal court related to the MOVEit cybersecurity incident, including cases filed against Maximus and other defendants, including Progress Software Corporation, the creator of MOVEit. All of the cases against Maximus, Inc. and its subsidiaries in federal courts outside of the District of Massachusetts that are related to the MOVEit cybersecurity incident have now been transferred to the MDL under the caption In re: MOVEit Customer Data Security Breach Litigation. The plaintiffs in Bishop and the other cases against the company in the MDL seek damages to be proved at trial. The Company is not able to determine or predict the ultimate outcome of these proceedings or reasonably provide an estimate or range of the possible outcome or loss, if any.\nOn September 6, 2023, an individual action was filed in state court in the Florida Circuit Court for the 7th Judicial Circuit, Volusia County: Taylor v. Maximus Federal Services, Case No. 2023-12349 (Fla. Cir. Ct., 7th Jud. Cir., Volusia Cnty.), also arising out of the MOVEit cybersecurity incident. The plaintiff alleges, among other things, that the Companys negligence resulted in the compromise of the plaintiffs personally identifiable information and protected health information. Since September 6, 2023, approximately six additional individual actions have been filed against Maximus, Inc. and its subsidiaries in Florida state courts. These actions all raise substantially similar allegations and legal claims. The plaintiffs in these individual actions seek damages to be proved at trial. The Company is not able to determine or predict the ultimate outcome of these proceedings or reasonably provide an estimate or range of the possible outcome or loss, if any.\nOn October 27, 2023, a purported class action was filed in state court in Marion Superior Court in Marion County, Indiana, against Maximus Health Services, Inc. (a wholly owned subsidiary of Maximus, Inc.): Solis Garcia v. Maximus Health Services, Inc., Case No. 49D12-2310-CT-042115 (Ind. Super. Ct., Marion Cnty.), again arising out of the MOVEit cybersecurity incident. The plaintiff, who purports to represent a class comprised of Indiana residents, alleges, among other things that the Companys negligence resulted in the compromise of the plaintiffs personally identifiable information and protected health information. The plaintiff seeks damages to be proved at trial. The Company is not able to determine or predict the ultimate outcome of any of these proceedings or reasonably provide an estimate or range of the possible outcome or loss, if any.\nThe Company is not able to determine or predict the ultimate outcome of any of these proceedings or reasonably provide an estimate or range of the possible outcome or loss, if any.\nCensus Project - Civil Investigation Demand (CID)\nIn 2021, Maximus received a CID from the U.S. Department of Justice (DOJ) pursuant to the False Claims Act seeking records pertaining to the Census project. The CID requested the production of documents related to the Companys compliance with telephone call quality assurance scoring and reporting requirements. The Company is cooperating with the DOJ in its investigation and providing responses and information on an ongoing basis. The Company recorded an accrual of $3.4 million for the year ended September 30, 2023. While it is reasonably possible that losses exceeding the amount accrued may be incurred, it is not possible at this time to estimate the additional possible loss in excess of the amount already accrued.\nPerformance Bonds\nCertain contracts require us to provide a surety bond as a guarantee of performance. As of September 30, 2023, we had performance bond commitments totaling $39.4 million. These bonds are typically renewed annually and remain in place until the contractual obligations are satisfied. Although the triggering events vary from contract to contract, in general, we would only be liable for the amount of these guarantees in the event of default in our performance of our obligations under each contract, the probability of which we believe is remote.\n16. EMPLOYEE BENEFIT PLANS AND DEFERRED COMPENSATION\nDefined Contribution Plan\nWe have 401(k) plans for the benefit of employees who meet certain eligibility requirements. The plans provide for a company match, specified company contributions and discretionary company contributions. For the years ended September 30, 2023, 2022, and 2021, we contributed $34.1 million, $28.0 million, and $17.3 million to the 401(k) plans, respectively. Outside the U.S., we have a number of defined contribution pension plans and other employee benefit plans. For the years ended September 30, 2023, 2022, and 2021, we contributed $19.8 million, $23.7 million, and $22.8 million to these plans, respectively.\nDeferred Compensation Plan\nWe also have a deferred compensation plan, which is a non-qualified plan available to a restricted number of highly compensated employees. The plan enables participants to defer compensation for tax purposes. These deferred employee contributions are held within a Rabbi Trust with investments directed by the respective employees. The assets of the Rabbi Trust are available to satisfy the claims of general creditors in the event of bankruptcy. The assets of the plan are sufficient to meet 86% of the liabilities as of September 30, 2023. The assets within the Rabbi Trust include $26.4 million invested in mutual funds that have quoted prices in active markets. These assets, as well as the related employee liabilities, are recorded at fair value, with changes in fair value being recorded in the consolidated statements of operations. Refer to \"Note 9. Fair Value Measurements\" for more details.\n17. SUBSEQUENT EVENTS\nOn October 6, 2023, our Board of Directors declared a quarterly cash dividend of $0.30 for each share of our common stock outstanding. The dividend is payable on November 30, 2023, to shareholders of record on November 15, 2023. Based upon the number of shares outstanding, we anticipate a cash payment of approximately $18.3 million.\nSubsequent to year end, we completed the sale of our businesses in Singapore and Italy, as well as our employment services business in Canada. A small loss will be recorded in the first quarter of fiscal year 2024. In connection with the sale, we recorded an impairment charge of $2.9 million at September 30, 2023. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our principal executive officer and principal financial officer, has evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Securities Exchange Act of 1934 (Exchange Act)) as of the end of the period covered by this Annual Report on Form 10-K. Based on this evaluation, our principal executive officer and principal financial officer concluded that our disclosure controls and procedures are effective and designed to ensure that the information required to be disclosed in our reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified by the Securities and Exchange Commission's (SEC) rules and forms and that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer as appropriate, to allow timely decisions regarding required disclosure.\nManagement's Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of published financial statements in accordance with generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of our internal control over financial reporting as of September 30, 2023. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in the Internal Control-Integrated Framework (2013). Based on our assessment, we believe that as of September 30, 2023, our internal control over financial reporting was effective based on those criteria.\nThe attestation report concerning the effectiveness of our internal control over financial reporting as of September 30, 2023, issued by Ernst & Young LLP, the independent registered public accounting firm who also audited our consolidated financial statements, is included following this Item 9A.\nChanges in Internal Control Over Financial Reporting\nThere was no change in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) identified in connection with the evaluation of our internal control that occurred during our fourth fiscal quarter of 2023 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Maximus, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Maximus, Inc.'s internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control -Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Maximus, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the 2023 consolidated financial statements of the Company and our report dated November 16, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company's management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management's Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company's internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nTysons, Virginia\nNovember 16, 2023 Item 9B. Other Information\n(a)None.\n(b)During the three months ended September 30, 2023, no director or officer of the Company adopted or terminated a Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement, as each term is defined in Item 408(a) of Regulation S-K.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot Applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item is herein incorporated by reference to the Company's definitive proxy statement relating to the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission within 120 days after September 30, 2023. Item 11. Executive Compensation\nThe information required by this item is herein incorporated by reference to the Company's definitive proxy statement relating to the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission within 120 days after September 30, 2023. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation with Respect to Securities Authorized for Issuance Under Equity Compensation Plans\nThe following table sets forth as of September 30, 2023, information with respect to (a) number of securities to be issued upon exercise of outstanding options, warrants, and rights, (b) the weighted average exercise price of outstanding options, warrants, and rights and (c) the number of securities remaining available for future issuance under our existing equity incentive plan. All shares under our existing equity incentive plan may be issued in the form of restricted stock, performance shares, stock appreciation rights, stock units, or other stock-based awards.\n(a) (b) (c)\nNumber of Securities\nto be Issued\nUpon Exercise of\nOutstanding Options,\nWarrants and Rights Weighted Average\nExercise Price of\nOutstanding Options,\nWarrants and Rights Number of Securities\nRemaining Available\nfor Future Issuance\nunder Equity\nCompensation Plans\n(Excluding Securities\nin Column (a))\nEquity compensation plans/arrangements approved by the shareholders 767,176 $ - 2,333,002\nEquity compensation plans/arrangements not approved by the shareholders - - -\nTotal 767,176 $ - 2,333,002\nAll other information required by this item is herein incorporated by reference to the Company's definitive proxy statement relating to the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission within 120 days after September 30, 2023. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is herein incorporated by reference to the Company's definitive proxy statement relating to the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission within 120 days after September 30, 2023. Item 14. Principal Accountant Fees and Services\nThe information required by this item is herein incorporated by reference to the Company's definitive proxy statement relating to the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission within 120 days after September 30, 2023.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a)Documents filed as a part of the report:\n(1)Financial Statements. The Company's financial statements are included in Item 8. Financial Statements and Supplementary Data.\n(2)Financial Statement Schedules. All schedules are omitted since they are not applicable, not required, or the information required to be set forth herein is included in the Consolidated Financial Statements or notes thereto.\n(3)Exhibits. The exhibits listed in the Exhibit Index immediately below are filed as part of this Annual Report on Form 10-K, or are incorporated by reference herein.\n(b)Exhibits. See Item 15(a)(3) above.\n(c)Financial Statement Schedules. See Item 15(a)(2) above.\nIncorporated by Reference Herein\nExhibit\nNo. Description of Exhibit Form/\nSchedule File No. Date Filed Exhibit No.\n2.1 Λ Stock Purchase Agreement dated as of April 20, 2021 by and among VES Group, Inc., each of the parties identified as a \"Shareholder\" on the signature pages thereto, George C. Turek, in his capacity as Shareholder Representative as set forth therein, Maximus Federal Services, Inc., and Maximus, Inc.\n8-K 1-12997 April 26, 2021 2.1\n3.1 Amended and Restated Articles of Incorporation of the Company.\n10-Q 1-12997 August 14, 1997 3.1\n3.2 Articles of Amendment of Amended and Restated Articles of Incorporation.\n10-Q 1-12997 August 14, 2000\n3.3 Articles of Amendment of Amended and Restated Articles of Incorporation.\n10-Q 1-12997 May 10, 2013 3(i)\n3.4 Articles of Amendment of Amended and Restated Articles of Incorporation.\n10-Q 1-12997 May 7, 2020 3.1\n3.5 Amended and Restated Bylaws of the Company.\n8-K 1-12997 March 15, 2023 3.2\n4.1 Specimen Common Stock Certificate.\n10-Q 1-12997 August 14, 1997 4.1\n4.2 Description of Securities.\n10-K 1-12997 November 19, 2020 4.2\n10.1 Ù Form of Indemnification Agreement by and between the Company and each of the directors of the Company.\nS-1 333-21611 February 12, 1997 10.10\n10.2 Ù Executive Employment, Non-Compete and Confidentiality Agreement between Bruce L. Caswell and Maximus, Inc.\n8-K 1-12997 January 16, 2018 10.1\n10.3 Ù Amended and Restated Income Continuity Program.\n10-K 1-12997 November 16, 2015 10.6\n10.4 Ù Deferred Compensation Plan, as amended.\n8-K 1-12997 November 27, 2007 10.3\n10.5 Ù 2011 Equity Incentive Plan.\n14A 1-12997 January 27, 2012 B\n10.6 Ù First Amendment to 2011 Equity Incentive Plan.\n8-K 1-12997 December 21, 2015 10.1\n10.7 Ù 1997 Equity Incentive Plan, as amended.\nS-8 333-136400 August 8, 2006 4.3\nÙ Denotes management compensatory plan or arrangement\nv Filed herewith.\nΦ Furnished herewith\nΛ Schedules and similar attachments omitted pursuant to Item 601(b)(2) of Regulation S-K. The Company agrees to furnish a copy of omitted schedules to the Securities and Exchange Commission upon request.\nΩ Schedules omitted pursuant to Item 601(a)(5) of Regulation S-K. The Company agrees to furnish a copy of any omitted schedules to the Securities and Exchange Commission upon request.\nIncorporated by Reference Herein\nExhibit\nNo. Description of Exhibit Form/\nSchedule File No. Date Filed Exhibit No.\n10.8 Ù First Amendment to the 1997 Equity Incentive Plan, as amended.\n8-K 1-12997 November 27, 2007 10.2\n10.9 Ù 1997 Equity Incentive Plan-Restricted Stock Units-Terms and Conditions.\n8-K 1-12997 June 23, 2006 10.1\n10.10 Ù 2017 Equity Incentive Plan.\nS-8 333-217657 May 4, 2017 4.5\n10.11 Ù 2021 Omnibus Incentive Plan.\n14A 1-12997 January 27, 2021 A\n10.12 Ùv Form of Restricted Stock Unit (RSU) Agreement under Maximus Inc. 2021 Omnibus Incentive Plan.\n10.13 Ùv Form of Performance-Based Restricted Stock Unit (PSU) Agreement under Maximus Inc. 2021 Omnibus Incentive Plan.\n10.14 Ω Amendment No. 3 to Credit Agreement by and between the Company, JPMorgan Chase Bank, N.A., as administrative agent and the lenders.\n10-Q 1-12997 February 9, 2023 10.1\n10.15 Ù Separation, Confidentiality, and Non-Competition Agreement between Maximus, Inc. and Richard J. Nadeau.\n8-K 1-12997 July 23, 2021 10.1\n10.16 Ù Separation, Confidentiality, and Non-Competition Agreement between Maximus, Inc. and Thomas D. Romeo.\n8-K 1-12997 July 23, 2021 10.3\n21.1 v List of Subsidiaries of the Company.\n23.1 v Consent of Independent Registered Public Accounting Firm.\n31.1 v Certification of Chief Executive Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n31.2 v Certification of Chief Financial Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n32.1 Φ Certification of Chief Executive Officer pursuant to Section 906 of Sarbanes-Oxley Act of 2002.\n32.2 Φ Certification of Chief Financial Officer pursuant to Section 906 of Sarbanes-Oxley Act of 2002.\n101.INS v XBRL Instance Document.\n101.SCH v XBRL Taxonomy Extension Schema Document.\n101.CAL v XBRL Taxonomy Calculation Linkbase Document.\n101.DEF v XBRL Taxonomy Definition Linkbase Document.\n101.LAB v XBRL Taxonomy Label Linkbase Document.\n101.PRE v XBRL Taxonomy Presentation Linkbase Document.\n104 v Cover Page Interactive Data File. (formatted as Inline XBRL tags and contained in Exhibit 101)\nÙ Denotes management compensatory plan or arrangement\nv Filed herewith.\nΦ Furnished herewith\nΛ Schedules and similar attachments omitted pursuant to Item 601(b)(2) of Regulation S-K. The Company agrees to furnish a copy of omitted schedules to the Securities and Exchange Commission upon request.\nΩ Schedules omitted pursuant to Item 601(a)(5) of Regulation S-K. The Company agrees to furnish a copy of any omitted schedules to the Securities and Exchange Commission upon request.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMaximus, Inc.\n/s/ Bruce L. Caswell November 16, 2023\nBy: Bruce L. Caswell\nPresident and Chief Executive Officer\n(Principal Executive Officer)\n/s/ David W. Mutryn November 16, 2023\nBy: David W. Mutryn\nChief Financial Officer\n(Principal Financial Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the Registrant and in the capacities and on the dates included.\nName Title Date\n/s/ Bruce L. Caswell President and Chief Executive Officer (Principal Executive Officer) and Director November 16, 2023\nBruce L. Caswell\n/s/ David W. Mutryn Chief Financial Officer (Principal Financial Officer) November 16, 2023\nDavid W. Mutryn\n/s/ Theresa Golinvaux Corporate Controller (Principal Accounting Officer) November 16, 2023\nTheresa Golinvaux\n/s/ John J. Haley Chair of the Board of Directors November 16, 2023\nJohn J Haley\n/s/ Anne K. Altman Vice Chair of the Board of Directors November 16, 2023\nAnne K. Altman\n/s/ Richard A. Montoni Vice Chair of the Board of Directors November 16, 2023\nRichard A. Montoni\n/s/ Jan D. Madsen Director November 16, 2023\nJan D. Madsen\n/s/ Gayathri Rajan Director November 16, 2023\nGayathri Rajan\n/s/ Raymond B. Ruddy Director November 16, 2023\nRaymond B. Ruddy\n/s/ Michael J. Warren Director November 16, 2023\nMichael J. Warren"
}