{
    "cik": "103595",
    "company": "VILLAGE SUPER MARKET INC",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-07-30",
    "sic": "5411",
    "state_of_inc": "NJ",
    "state_location": "NJ",
    "fiscal_year_end": "0727",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/103595/0000103595-22-000019-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/103595/000010359522000019/vlgea-20220730.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/103595/0000103595-22-000019.txt",
    "filename": "103595_10K_2022_0000103595-22-000019.htm",
    "content": "ITEM 1A. RISK FACTORS\nNot applicable. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2. PROPERTIES\nAs of July 30, 2022, Village owns the sites of seven of its supermarkets (containing 467,000 square feet of total space), all of which are freestanding stores, except the Egg Harbor store, which is part of a shopping center, and the micro-fulfillment center in southern New Jersey. The Company owns all trade fixtures and equipment in its stores and several other properties including a shopping center and parcels of vacant land, which are available as locations for possible future stores or other development. The remaining 31 stores (containing 1,573,000 square feet of total space), the central commissary and the corporate headquarters are leased, with initial lease terms generally ranging from 20 to 30 years, usually with renewal options. Twenty-three of these leased stores are located in shopping centers or city storefronts and the remaining eight are freestanding stores. Most of the Companys leases contain renewal options at increased rents of five years each at the Companys sole discretion. These options enable Village to retain the use of facilities in desirable operating areas. Each renewal option is evaluated when recognizing the lease right-of-use assets and liabilities, and the Company utilizes the lease term for which it is reasonably certain to use the underlying asset. Leases with an initial term of 12 months or less are not recorded on the balance sheet. The Company is obligated under all leases to pay for real estate taxes, utilities and liability insurance, and under certain leases to pay additional amounts based on maintenance and a percentage of sales in excess of stipulated amounts. The Company accounts for rent holidays, escalating rent provisions, and construction allowances on a straight-line basis over the term of the lease.\nAs of July 30, 2022, finance lease right-of-use assets of $11,859 are included in property, equipment and fixtures, net in the Company's consolidated balance sheet.\nThe annual rental payment, including finance leases, for all of the Company's leased facilities for the year ended July 30, 2022 was approximately $38,419. For additional information on lease obligations, see Note 7 to the consolidated financial statements.\nOn April 28, 2022 the Company entered into a partnership agreement for a 30% interest in the development of a retail center in Old Bridge, New Jersey, which includes a Village replacement store with future lease obligations of $9,280. Village will fund its share of project costs estimated to be $15,000 to $20,000 over the two to three year life of the project. As of July 30, 2022, Village has invested $5,010 into the real estate partnership, which is accounted for as an equity method investment included in Investments in Real Estate Partnerships on the Consolidated Balance Sheet.\nVillage is a limited partner in two additional partnerships, one of which owns a shopping center in which one of our leased stores is located. The Company is also a general partner in a partnership that is a lessor of one of the Company's freestanding stores.\nOn October 13, 2021, Village completed the acquisition of the Galloway store shopping center for $9,800. ITEM 3. LEGAL PROCEEDINGS\nThe Company is involved in other litigation incidental to the normal course of business. Company management is of the opinion that the ultimate resolution of these legal proceedings should not have a material adverse effect on the consolidated financial position, results of operations or liquidity of the Company. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\n(All dollar amounts are in thousands, except per share data).\nStock Price and Dividend Information\nThe Class A common stock of Village Super Market, Inc. is traded on the NASDAQ Global Select Market under the symbol VLGEA. The table below sets forth the high and low last reported sales price for the fiscal quarter indicated.\n2022 High Low\n4th Quarter $24.25 $22.13\n3rd Quarter $24.76 $22.21\n2nd Quarter $23.64 $21.26\n1st Quarter $22.87 $21.43\n2021 High Low\n4th Quarter $25.46 $22.55\n3rd Quarter $26.19 $21.07\n2nd Quarter $23.89 $21.56\n1st Quarter $26.41 $23.19\nAs of October 13, 2022, there were approximately 266 holders of record of Class A common stock.\nDuring fiscal 2022, Village paid cash dividends of $13,041. Dividends in fiscal 2022 consist of $1.00 per Class A common share and $.65 per Class B common share.\nDuring fiscal 2021, Village paid cash dividends of $13,050. Dividends in fiscal 2021 consist of $1.00 per Class A common share and $.65 per Class B common share. ITEM 6. SELECTED FINANCIAL DATA\nSelected Financial Data\n(Dollars in thousands, except per share data and per square foot data).\nFiscal 2021 contains 53 weeks, with the additional week included in the fourth quarter. All other fiscal years contain 52 weeks.\nFor year July 30, 2022 July 31, 2021 July 25, 2020 July 27, 2019 July 28,\nSales $ 2,061,084 $ 2,030,330 $ 1,804,594 $ 1,643,502 $ 1,612,015\nNet income 26,830 (1) 19,994 (2) 24,939 (3) 25,539 (4) 25,080 (5)\nNet income as a % of sales 1.30 % 0.98 % 1.38 % 1.55 % 1.56 %\nNet income per share:\nClass A common stock:\nBasic $ 2.06 $ 1.53 $ 1.93 $ 1.98 $ 1.95\nDiluted 1.84 1.37 1.72 1.77 1.74\nClass B common stock:\nBasic 1.34 1.00 1.25 1.29 1.27\nDiluted 1.34 1.00 1.25 1.29 1.27\nCash dividends per share:\nClass A 1.00 1.00 1.00 1.00 1.00\nClass B 0.65 0.65 0.65 0.65 0.65\nAt year-end\nTotal assets (6) $ 924,448 $ 889,004 $ 915,546 $ 502,289 $ 481,590\nLong-term debt (6) 374,035 370,078 396,181 47,725 48,186\nWorking capital 79,796 44,023 34,522 56,307 89,201\nShareholders equity 372,109 341,473 332,320 318,672 303,145\nBook value per share 25.64 23.48 22.84 22.15 21.08\nOther data\nSame store sales trend (7) 4.1 % 2.3 % 5.3 % (0.5) % 0.2 %\nTotal square feet 2,040,000 2,026,000 2,091,000 1,804,000 1,770,000\nAverage total sq. ft. per store 54,000 55,000 55,000 55,000 59,000\nSelling square feet 1,488,000 1,481,000 1,529,000 1,401,000 1,384,000\nSales per average square foot of selling space (8) $ 1,390 $ 1,349 $ 1,275 $ 1,186 $ 1,188\nNumber of stores 38 37 38 33 30\nSales per average number of stores (8) $ 55,635 $ 52,713 $ 53,284 $ 54,715 $ 55,450\nCapital expenditures and acquisitions $ 43,270 $ 25,233 $ 54,495 $ 27,988 $ 35,464\n(1) Includes pension settlement charges of $8,556 (net of tax) including the result of the termination of the Village Super Market, Inc. Employees Retirement Plan, and a $342 (net of tax) gain on the sale of an equity investment.\n(2) Includes a $2,802 (net of tax) gain on the sale of the leasehold interest in a non-supermarket related parking lot lease obtained as part of the Fairway acquisition, a gain on the sale of a pharmacy prescription list related to the Silver Spring store, net of store closing costs of $276 (net of tax), non-cash impairment charges for the Fairway trade name and the long lived assets for one Gourmet Garage store of $2,010 (net of tax), pension settlement charges of $409 (net of tax) and estimated net income of $417 due to the fiscal year including a 53rd week.\n(3) Includes a $1,911 (net of tax) gain for Superstorm Sandy insurance proceeds received, an $854 (net of tax) gain on the sale of pharmacy prescription lists related to three store pharmacies closed in March 2020, a $2,512 incremental benefit from a federal net operating loss carryback at a rate higher than the current statutory tax rate, a $1,423 (net of tax) gain arising from the breakup of Villages initial stalking horse bid under the January 20, 2020 Fairway Asset Purchase Agreement, transaction costs incurred for the Fairway acquisition of $1,888 (net of tax), amortization of acquisition related inventory step-up of $355 (net of tax), a non-cash pension charge related to the termination of a company-sponsored pension plan and other pension settlement charges of $1,160 (net of tax), pre-opening costs related to the Stroudsburg, Pennsylvania replacement store of $891 (net of tax) and store closure costs and charges to write off the lease asset and related obligations for the old Stroudsburg store of $557 (net of tax).\n(4) Includes a $290 (net of tax) gain for Superstorm Sandy insurance proceeds received, a tax benefit of $777 related to the favorable settlement of a tax audit with the New Jersey Division of Taxation and a non-cash pension charge related to pension settlement charges of $308 (net of tax).\n(5) Includes a $3,300 reduction in deferred tax expense as a result of the Tax Cuts and Jobs Act, an $822 (net of tax) non-recurring credit accrued related to multi-employer pension benefits, $877 (net of tax) in non-recurring assessments from Wakefern and $695 (net of tax) in pre-opening costs related to the Bronx, New York City store.\n(6) On July 28, 2019, the Company adopted ASU 2016-02, Leases. The adoption of the standard resulted in the recognition of operating lease assets and operating lease liabilities, included in long-term debt of $99,415 and $111,139, respectively, as of the date of adoption.\n(7) New stores and replacement stores are included in same store sales in the quarter after the store has been in operation for four full quarters. Store renovations and expansions are included in same store sales immediately. The change in same store sales in fiscal 2021 excludes the impact of the 53rd week in fiscal 2021 and fiscal 2022 excludes the impact of the 53rd week in fiscal 2021.\n(8) Amounts for the year ended July 30, 2022 exclude the results of the Gourmet Garage store opened in the West Village in Manhattan on April 29, 2022. Amounts for the year ended July 25, 2020 exclude the results of the Fairway stores acquired on May 14, 2020. Amounts for the year ended July 27, 2019 exclude the results of the Gourmet Garage stores acquired on June 24, 2019. Amounts for the year ended July 28, 2018 exclude results of the store opened in the Bronx, New York on June 28, 2018.\nUnaudited Quarterly Financial Data\n(Dollars in thousands except per share amounts).\nFirst\nQuarter Second\nQuarter Third\nQuarter Fourth\nQuarter Fiscal\nYear\nSales $ 494,211 $ 537,408 $ 501,962 $ 527,503 $ 2,061,084\nGross profit 140,180 149,611 141,591 148,285 579,667\nNet income (loss) 7,328 10,129 (3,231) 12,603 26,830\nNet income per share:\nClass A common stock:\nBasic 0.56 0.78 (0.25) 0.97 2.06\nDiluted 0.50 0.69 (0.22) 0.87 1.84\nClass B common stock:\nBasic 0.37 0.50 (0.16) 0.63 1.34\nDiluted 0.37 0.50 (0.16) 0.63 1.34\nSales $ 490,136 $ 522,818 $ 481,093 $ 536,283 $ 2,030,330\nGross profit 137,963 141,845 133,422 151,814 565,044\nNet income 3,360 4,555 2,574 9,500 19,994\nNet income per share:\nClass A common stock:\nBasic 0.26 0.35 0.20 0.73 1.53\nDiluted 0.23 0.31 0.18 0.65 1.37\nClass B common stock:\nBasic 0.17 0.23 0.13 0.47 1.00\nDiluted 0.17 0.23 0.13 0.47 1.00 ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n(Dollars in thousands, except per share and per square foot data).\nOVERVIEW\nVillage Super Market operates a chain of 34 supermarkets in New Jersey (26), New York (6), Maryland (1) and Pennsylvania (1) under the ShopRite and Fairway banners and four Gourmet Garage specialty markets in New York City. On April 29, 2022, Village opened a 14,600 sq. ft. Gourmet Garage in the West Village in Manhattan, NYC. On February 22, 2021, Village closed the ShopRite store located in Silver Spring, Maryland. Despite continued investment in marketing and promotional programs, the store was unable to generate sales at a level sufficient to maintain profitability, resulting in its closure. The impacts associated with this closure were not material to the consolidated financial statements.\nVillage is the second largest member of Wakefern Food Corporation (Wakefern), the nations largest retailer-owned food cooperative and owner of the ShopRite, Fairway and Gourmet Garage names. This ownership interest in Wakefern provides Village with many of the economies of scale in purchasing, distribution, advanced retail technology, marketing and advertising associated with larger chains.\nThe Companys stores, seven of which are owned, average 54,000 total square feet. These larger store sizes enable the Company to offer a wide variety of national branded and locally sourced food products, including grocery, meat, produce, dairy, deli, seafood, prepared foods, bakery and frozen foods as well as non-food product offerings, including health and beauty care, general merchandise, liquor and 21 in-store pharmacies. Most product departments include high-quality, competitively priced own-brand offerings under the Wholesome Pantry, Bowl & Basket, Paperbird and Fairway brands. Our Fairway\nMarkets offer a one-stop destination shopping experience with an emphasis on fresh, unique, and high quality offerings paired with an expansive variety of natural, organic, specialty and gourmet products. Our Gourmet Garage specialty markets offer organic produce, signature soups and prepared foods, high-quality meat and seafood, charcuterie and gourmet cheeses, artisan baked bread and pastries, chef-prepared meals to go and pantry staples.\nOnline grocery ordering for in-store pick up or home delivery is available in all of our ShopRite stores through shoprite.com, the ShopRite app or through third party service providers. Additionally, the ShopRite Order Express app enables customers to pre-order deli, catering, specialty occasion cakes and other items. Online ordering for home delivery is available in all Fairway and Gourmet Garage stores through third party service providers.\nThe supermarket industry is highly competitive and characterized by narrow profit margins. The Company competes directly with multiple retail formats, both in-store and online, including national, regional and local supermarket chains as well as warehouse clubs, supercenters, drug stores, discount general merchandise stores, fast food chains, restaurants, dollar stores and convenience stores. The Company competes by providing a superior customer service experience, competitive pricing and a broad range of consistently available quality products. The ShopRite Price Plus customer loyalty program enables Village to offer continuity programs, focus on target marketing initiatives and to offer discounts and attach digital coupons directly to a customer's Price Plus card.\nTo promote production efficiency, product quality and consistency, the Company operates a centralized commissary supplying certain products in deli, bakery, prepared foods and other perishable product categories to all stores. Production costs, including materials, labor and overhead, are included in Cost of sales.\nWe consider a variety of indicators to evaluate our performance, such as same store sales; percentage of total sales by department (mix); shrink; departmental gross profit percentage; sales per labor hour; units per labor hour; and hourly labor rates.\nThe Company utilizes a 52 - 53 week fiscal year, ending on the last Saturday in the month of July. Fiscal 2022 contains 52 weeks and fiscal 2021 contains 53 weeks.\nNON-GAAP MEASURES\nThe accompanying Consolidated Financial Statements, including the related notes, are presented in accordance with generally accepted accounting principles (\"GAAP\"). We provide non-GAAP measures, including Adjusted net income and Adjusted operating and administrative expenses as management believes these supplemental measures are useful to investors and analysts. These non-GAAP financial measures should not be reviewed in isolation or considered as a substitute for our financial results as reported in accordance with GAAP, nor as an alternative to net income, operating and administrative expense or any other GAAP measure of performance. Adjusted net income and Adjusted operating and administrative expense are useful to investors because they provide supplemental measures that exclude the financial impact of certain items that affect period-to-period comparability. Management and the Board of Directors use these measures as they provide greater transparency in assessing ongoing operating performance on a period-to-period basis. Other companies may have different definitions of Non-GAAP Measures and provide for different adjustments, and comparability to the Company's results of operations may be impacted by such differences. The Company's presentation of Non-GAAP Measures should not be construed as an implication that its future results will be unaffected by unusual or non-recurring items.\nThe following tables reconciles Net income to Adjusted net income and Operating and administrative expenses to Adjusted operating and administrative expenses:\n52 Weeks Ended 53 Weeks Ended\nJuly 30,\n2022 July 31,\nNet Income $ 26,830 $ 19,994\nAdjustments to Operating Expenses:\nGain on sale of assets (1) (494) (4,768)\nPension termination and settlement charges 12,341 587\nStore closure costs (2) - 325\nOther Adjustments:\nImpairment of assets (3) - 2,900\nIncome from 53-week fiscal year (4) - (602)\nAdjustments to Income Taxes:\nTax impact of adjustments to operating expenses (3,633) 478\nAdjusted net income $ 35,044 $ 18,914\nOperating and administrative expenses $ 507,597 $ 498,786\nAdjustments to operating and administrative expenses (11,847) 3,856\nAdjusted operating and administrative expenses $ 495,750 $ 502,642\nAdjusted operating and administrative expenses as a % of sales 24.05 % 24.76 %\n(1) Fiscal 2022 includes a $494 gain on the sale of an equity investment and fiscal 2021 includes a $4,044 gain on the sale of the leasehold interest in a non-supermarket related parking lot obtained as part of the Fairway acquisition and a $724 gain on the sale of the pharmacy prescription list related to the Silver Spring, Maryland store.\n(2) Fiscal 2021 includes costs associated with the closure of the Silver Spring, Maryland store on February 22, 2021.\n(3) Fiscal 2021 includes non-cash impairment charges for the Fairway trade name of $2,386 and the long-lived assets for one Gourmet Garage store of $514.\n(4) Fiscal 2021 is a 53-week fiscal year, with the additional week included in the fourth quarter.\nRESULTS OF OPERATIONS\nThe following table sets forth the components of the consolidated statements of operations of the Company as a percentage of sales:\nJuly 30, 2022 July 31, 2021\nSales 100.00 % 100.00 %\nCost of sales 71.88 % 72.17 %\nGross profit 28.12 % 27.83 %\nOperating and administrative expense 24.63 % 24.57 %\nDepreciation and amortization 1.61 % 1.69 %\nImpairment of assets - % 0.14 %\nOperating income 1.88 % 1.43 %\nInterest expense (0.19) % (0.19) %\nInterest income 0.20 % 0.18 %\nIncome before income taxes 1.89 % 1.42 %\nIncome taxes 0.59 % 0.44 %\nNet income 1.30 % 0.98 %\nSALES\nSales were $2,061,084 in fiscal 2022, an increase of $30,754, or 1.5% from fiscal 2021. Fiscal 2021 contains 53 weeks, with the additional week included in the fourth quarter. Excluding the impact of the 53rd week, sales increased 3.5% due primarily to an increase in same store sales of 4.1% and the opening of a Gourmet Garage in the West Village in Manhattan, NY on April 29, 2022, partially offset by the closure of the Silver Spring, Maryland store in February 2021. Same store sales increased due primarily to increased sales in New York City stores, higher transaction counts, inflation and continued growth in SNAP benefit redemptions.\nNew stores and replacement stores are included in same store sales in the quarter after the store has been in operation for four full quarters. Store renovations and expansions are included in same store sales immediately.\nGROSS PROFIT\nGross profit as a percentage of sales increased to 28.12% in fiscal 2022 compared to 27.83% in fiscal 2021 due primarily to increased departmental gross margin percentages (.57%) and a favorable change in product mix (.10%), partially offset by higher LIFO charges (.16%), decreased patronage dividends and rebates received from Wakefern (.09%) and higher promotional spending (.14%). Department gross margins increased due primarily to pricing initiatives and improvements in commissary operations.\nOPERATING AND ADMINISTRATIVE EXPENSE\nOperating and administrative expense as a percentage of sales increased to 24.63% in fiscal 2022 compared to 24.57% in fiscal 2021. Adjusted operating and administrative expense as a percentage of sales decreased to 24.05% in fiscal 2022 compared to 24.76% in fiscal 2021 due primarily to lower labor costs and fringe benefits (.61%) and less advertising spending (.10%), partially offset by increased external fees and transportation costs associated with digital sales (.08%). Labor costs decreased due to productivity initiatives, labor shortages and sales leverage partially offset by minimum wage and demand driven pay rate increases.\nDEPRECIATION AND AMORTIZATION\nDepreciation and amortization expense was $33,122 and $34,195 in fiscal 2022 and 2021, respectively. Depreciation and amortization expense decreased due primarily to the closure of the Silver Spring, Maryland ShopRite in February 2021 and the timing of capital expenditures.\nIMPAIRMENT OF ASSETS\nImpairment of assets in fiscal 2021 included non-cash charges related to the Fairway trade name of $2,386 (see note 1 to the consolidated financial statements) and the long-lived assets for one Gourmet Garage store of $514.\nINTEREST EXPENSE\nInterest expense was $3,907 and $3,943 in fiscal 2022 and 2021, respectively.\nINTEREST INCOME\nInterest income was $4,023 and $3,633 in fiscal 2022 and 2021, respectively. Interest income increased in fiscal 2022 compared to fiscal 2021 due primarily to higher interest rates and larger amounts invested in variable rate notes receivable from Wakefern and demand deposits invested at Wakefern.\nINCOME TAXES\nThe Companys effective income tax rate was 31.3% and 30.7% in fiscal 2022 and 2021, respectively. The increase in the effective tax rate in fiscal 2022 is due primarily to increased state taxable income in higher tax rate jurisdictions.\nNET INCOME\nNet income was $26,830 in fiscal 2022 compared to $19,994 in fiscal 2021. Adjusted net income was $35,044 in fiscal 2022 compared to $18,914 in fiscal 2021. Adjusted net income increased 85% compared to the prior year due primarily to the 4.1% increase in same store sales and improvements in gross profit and operating and administrative expense margins.\nCRITICAL ACCOUNTING POLICIES\nCritical accounting policies are those accounting policies that management believes are important to the portrayal of the Companys financial condition and results of operations. These policies require managements most difficult, subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain.\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nIMPAIRMENT\nThe Company reviews the carrying values of its long-lived assets, such as property, equipment and fixtures and operating lease assets on an individual store basis for possible impairment whenever events or changes in circumstances indicate that the carrying amount of assets may not be recoverable. Factors considered by the Company that could result in an impairment triggering event include a current period operating or cash flow loss, underperformance of a store relative to historical or expected operating results, and significant negative industry or economic trends. If an impairment triggering event is identified, the Company analyzes the undiscounted estimated future net cash flows from asset groups at the store level to determine if the carrying value of such assets are recoverable from their respective cash flows. If impairment is indicated, it is measured by comparing the fair value of the long-lived asset groups to their carrying value.\nGoodwill and indefinite-lived intangible assets are tested at the end of each fiscal year, or more frequently if circumstances dictate, for impairment. The Company utilizes valuation techniques, such as earnings multiples, in addition to the Companys market capitalization, to assess goodwill for impairment. Calculating the fair value of a reporting unit requires the use of estimates. Management believes the fair value of Villages one reporting unit exceeds its carrying value at July 30, 2022. Should the Companys carrying value of its one reporting unit exceed its fair value, the amount of any resulting goodwill impairment may be material to the Companys financial position and results of operations. The fair value of indefinite-lived intangible assets are estimated based on the discounted cash flow model using the relief from royalty method.\nManhattan store sales have been impacted by less residential, commuter and tourist traffic during the COVID-19 pandemic. Due to uncertainty regarding the duration and extent of the impact of the COVID-19 pandemic on Manhattan, the Company recognized an impairment charge related to the Fairway trade name of $2,386 for year ended July 31, 2021.\nPATRONAGE DIVIDENDS\nAs a stockholder of Wakefern, Village earns a share of Wakeferns earnings, which are distributed as a patronage dividend. This dividend is based on a distribution of substantially all of Wakeferns operating profits for its fiscal year (which ends on or about September 30) in proportion to the dollar volume of purchases by each member from Wakefern during that fiscal year. Patronage dividends are recorded as a reduction of cost of sales as merchandise is sold. Village accrues estimated patronage dividends due from Wakefern quarterly based on an estimate of the annual Wakefern patronage dividend and an estimate of Villages share of this annual dividend based on Villages estimated proportional share of the dollar volume of business transacted with Wakefern that year. The patronage dividend receivable based on these estimates was $12,239 and $11,860 at July 30, 2022 and July 31, 2021, respectively.\nPENSION PLANS\nThe determination of the Companys obligation and expense for Company-sponsored pension plans is dependent, in part, on Villages selection of assumptions used by actuaries in calculating those amounts. These assumptions are described in Note 9 to the consolidated financial statements and include, among others, the discount rate, the expected long-term rate of return on plan assets and the rate of increase in compensation costs. Actual results that differ from the Companys assumptions are accumulated and amortized over future periods and, therefore, generally affect recognized expense in future periods. While management believes that its assumptions are appropriate, significant differences in actual experience or significant changes in the Companys assumptions may materially affect cash flows, pension obligations and future expense.\nThe objective of the discount rate assumption is to reflect the rate at which the Companys pension obligations could be effectively settled based on the expected timing and amounts of benefits payable to participants under the plans. Our methodology for selecting the discount rate as of July 30, 2022 was to match the plans' cash flows to that of a yield curve on high-quality fixed-income investments. Based on this method, we utilized a weighted-average discount rate of 3.77% at July 30,\n2022 compared to 2.44% at July 31, 2021. Changes in the discount rate and updated assumptions on mortality tables and improvement scales resulted in a net decrease in the projected benefit obligation by approximately $2,017 at July 30, 2022. Village evaluated the expected increase in compensation costs of 4.50% and concluded no changes in this assumption was necessary in estimating pension plan obligations and expense. The Company utilizes a liability-driven investment (\"LDI\") strategy. A LDI strategy focuses on maintaining a close to fully-funded status over the long-term with minimal funded status risk. This is achieved by investing more of the plan assets in fixed income instruments to more closely match the duration of the plan liability. The investment allocation to fixed income instruments will increase as each plans' funded status increases. Based on the Companys LDI strategy, the Company assumed a weighted-average assumed long-term rate of return on plan assets of 5.25% in fiscal 2022.\nSensitivity to changes in the major assumptions used in the calculation of the Companys pension plans is as follows:\nPercentage\npoint change Projected benefit\nobligation\ndecrease\n(increase) Expense\ndecrease\n(increase)\nDiscount rate + / - 1.0 % $ 665 $ (795) $ 32 $ (78)\nExpected return on assets + / - 1.0 % $ - - $ 29 $ (29)\nIn April 2022, the Company terminated the Village Super Market, Inc. Employees Retirement Plan. Prior to termination, the Company made a $1,485 contribution to fully fund the plan. Plan assets were liquidated to fund lump sum distributions to participants of $37,289 and purchase annuity contracts totaling $14,930 with an insurance company for all participants who did not elect a lump sum distribution. No benefit obligation or plan assets related to the Village Super Market, Inc. Employees Retirement Plan remain as of July 30, 2022. The Company recognized a $12,296 pre-tax settlement charge as a result of the termination, including a $10,856 non-cash charge for unrecognized losses within accumulated other comprehensive loss as of the termination date. Village made no contributions to the remaining plans in fiscal 2022 and no contributions were made in fiscal 2021 to Company-sponsored pension plans. Contributions to the remaining plans are expected to be immaterial in fiscal 2023.\nRECENTLY ISSUED ACCOUNTING STANDARDS\nFor the disclosure related to recently issued accounting standards, see Note 1 to the consolidated financial statements.\nLIQUIDITY and CAPITAL RESOURCES\nCASH FLOWS\nNet cash provided by operating activities was $79,625 in fiscal 2022 compared to $52,692 in fiscal 2021. The change in cash flows from operating activities in fiscal 2022 was primarily due to changes in working capital and higher net income adjusted for non-cash items including depreciation and amortization, share-based compensation, deferred taxes, pension settlement charges, the provision to value inventories at LIFO, impairment charges and the gain on sale of property, equipment and fixtures. Working capital changes, including other assets and other liabilities, increased net cash provided by operating activities by $7,081 in fiscal 2022 compared a decrease in net cash provided by operating activities of $1,587 in fiscal 2021.\nDuring fiscal 2022, Village used cash to fund capital expenditures of $43,270, dividends of $13,041, principal payments of long-term debt of $8,299, an investment in a real estate partnership for the development of a retail center in Old Bridge, New Jersey of $5,010 and additional investments of $2,489 in notes receivable from Wakefern. Proceeds on the sale of assets of $4,352 are primarily related to the sale of a leasehold interest in a non-supermarket related parking lot obtained as part of the Fairway acquisition. Capital expenditures primarily include costs associated with the purchase of the Galloway store shopping center, the purchase of land in central New Jersey for a potential replacement store and other development, the new Gourmet Garage store in the West Village of New York City, continued expansion of self-checkout, and various merchandising, technology, equipment and facility upgrades.\nDuring fiscal 2021, Village used cash to fund capital expenditures of $25,233, dividends of $13,050, principal payments of long-term debt of $8,414 and additional investments of $2,287 in notes receivable from Wakefern. Capital expenditures include one major remodel, continued expansion of online order fulfillment and self-checkout, and various merchandising, technology, equipment and facility upgrades.\nLIQUIDITY and DEBT\nWorking capital was $79,796 and $44,023 at July 30, 2022 and July 31, 2021, respectively. Working capital ratios at the same dates were 1.50 and 1.29 to one, respectively. The increase in working capital in fiscal 2022 compared to fiscal 2021 is due primarily to $28,627 in notes receivable from Wakefern that have been reclassified to current assets as they matured on August 15, 2022. The Companys working capital needs are reduced, since inventories are generally sold by the time payments to Wakefern and other suppliers are due.\nWe have budgeted $70,000 for capital expenditures in fiscal 2023. Planned expenditures include costs for construction of three replacement stores scheduled to open in fiscal 2024, two major remodels, including the conversion of the Pelham, NY store from the Fairway to the ShopRite banner, the purchase of the Vineland store shopping center, several smaller store remodels and merchandising initiatives, installation of electronic shelf labels in six stores, continued expansion of self-checkout, and various technology, equipment and facility upgrades. The Companys primary sources of liquidity in fiscal 2023 are expected to be cash and cash equivalents on hand at July 30, 2022 and operating cash flow generated in fiscal 2023.\nOn April 28, 2022 the Company entered into a partnership agreement for a 30% interest in the development of a retail center in Old Bridge, New Jersey, which includes a Village replacement store with future lease obligations of $9,280. Village will fund its share of project costs estimated to be $15,000 to $20,000 over the two to three year life of the project. As of July 30, 2022, Village has invested $5,010 into the real estate partnership, which is accounted for as an equity method investment included in Investments in Real Estate Partnerships on the Consolidated Balance Sheet.\nAt July 30, 2022, the Company held variable rate notes receivable due from Wakefern of $28,627 that earn interest at the prime rate plus 1.25% and matured on August 15, 2022 and $29,157 that earn interest at the prime rate plus .75% and mature on February 15, 2024. The Company invested $28,850 of the proceeds received from the notes that matured on August 15, 2022 in variable rate notes receivable from Wakefern that earn interest at the prime rate plus .50% and mature on August 15, 2027. On September 28, 2022, the Company invested an additional $30,000 in variable rate notes receivable from Wakefern that earn interest at the prime rate plus .50% and mature on September 28, 2027. Wakefern has the right to prepay these notes at any time. Under certain conditions, the Company can require Wakefern to prepay the notes, although interest earned since inception would be reduced as if it was earned based on overnight money market rates as paid by Wakefern on demand deposits.\nAt July 30, 2022, Village had demand deposits invested at Wakefern in the amount of $110,739. These deposits earn overnight money market rates.\nCredit Facility\nOn January 28, 2022, the Company entered into an amended and restated credit agreement of the Companys $150,500 credit facility (the Credit Facility) with Wells Fargo National Bank, National Association (Wells Fargo). The notable changes from the previous agreement include: (1) Modification of the reference rate from the London Interbank Offered Rate (\"LIBOR\") to the Secured Overnight Financing Rate (\"SOFR\") as a result of the expected cessation of LIBOR, (2) The execution of a fifteen-year $7,350 secured term loan to finance the acquisition of the Galloway shopping center and (3) Modification of the definition of Total Adjusted Debt for the purpose of determining the maximum adjusted debt to EBITDAR ratio financial covenant. Among other things, the Credit Facility provides for:\nAn unsecured revolving line of credit providing a maximum amount available for borrowing of $75,000. Indebtedness under this agreement bears interest at the applicable SOFR plus 1.10% and expires on May 6, 2025.\nAn unsecured $25,500 term loan issued on May 12, 2020, repayable in equal monthly installments based on a seven-year amortization schedule through May 4, 2027 and bearing interest at the applicable SOFR plus 1.46%. Prior to the January 28, 2022 amendment to the credit facility, interest accrued on the unsecured term loan at the applicable LIBOR plus 1.35%. An interest rate swap with notional amounts equal to the term loan fixed the base LIBOR at .41%, resulting in a fixed effective rate of 1.76%. In February 2022, the Company executed an amendment and restatement of the interest rate swap that fixes the base SOFR at .26% per annum through May 4, 2027, resulting in a fixed effective interest rate of 1.72% on the term loan.\nA secured $50,000 term loan issued on September 1, 2020 repayable in equal monthly installments based on a fifteen-year amortization schedule through September 1, 2035 and bearing interest at the applicable SOFR plus 1.61%. Prior\nto the January 28, 2022 amendment to the credit facility, interest accrued on the secured term loan at the applicable LIBOR plus 1.50%. An interest rate swap with notional amounts equal to the term loan fixed the base LIBOR at .69%, resulting in a fixed effective rate of 2.19%. In February 2022, the Company executed an amendment and restatement of the interest rate swap related to the term loan that fixes the base SOFR at .57% per annum through September 1, 2035, resulting in a fixed effective interest rate of 2.18% on the term loan. The term loan is secured by real properties of Village Super Market, Inc. and its subsidiaries, including the sites of three Village stores.\nA secured $7,350 term loan issued on January 28, 2022 repayable in equal monthly installments based on a fifteen-year amortization schedule through January 28, 2037 and bearing interest at the applicable SOFR plus 1.50%. Additionally, Village executed an interest rate swap for a notional amount equal to the term loan amount that fixes the base SOFR at 1.41% per annum, resulting in a fixed effective interest rate of 2.91% on the term loan. The term loan is secured by the Galloway store shopping center acquired in the first quarter of fiscal 2022.\nOn September 1, 2022, the Company amended the Credit Facility due to the execution of a seven year $10,000 unsecured term loan. The unsecured term loan is repayable in equal monthly installments based on a seven year amortization schedule through September 4, 2029 and bears interest at the applicable SOFR plus 1.35%. Village also executed an interest rate swap for a notional amount equal to the term loan amount that fixes the base SOFR at 2.95%, resulting in a fixed effective rate of 4.30%. This loan qualified for an interest rate subsidy program with Wakefern on financing related to certain capital expenditure projects. Net of the subsidy, the Company will pay interest at a fixed effective rate of 2.30%.\nThe principal purpose of the Credit Facility is to finance general corporate and working capital requirements, Villages acquisition of certain Fairway assets, the purchase of the Galloway store shopping center and certain capital expenditure projects. The Credit Facility also provides for up to $25,000 of letters of credit ($7,336 outstanding at July 30, 2022), which secure obligations for store leases and construction performance guarantees to municipalities. The Credit Facility contains covenants that, among other conditions, require a minimum tangible net worth, a minimum fixed charge coverage ratio and a maximum adjusted debt to EBITDAR ratio. The Company was in compliance with all covenants of the credit agreement at July 30, 2022. As of July 30, 2022, $67,664 remained available under the unsecured revolving line of credit.\nDuring fiscal 2022, Village paid cash dividends of $13,041. Dividends in fiscal 2022 consist of $1.00 per Class A common share and $.65 per Class B common share.\nDuring fiscal 2021, Village paid cash dividends of $13,050. Dividends in fiscal 2021 consist of $1.00 per Class A common share and $.65 per Class B common share.\nOUTLOOK\nThis annual report contains certain forward-looking statements about Villages future performance. These statements are based on managements assumptions and beliefs in light of information currently available. Such statements relate to, for example: economic conditions; uninsured losses; expected pension plan contributions; projected capital expenditures; expected dividend payments; cash flow requirements; inflation expectations; public health conditions; and legal matters; and are indicated by words such as will, expect, should, intend, anticipates, believes and similar words or phrases. The Company cautions the reader that there is no assurance that actual results or business conditions will not differ materially from the results expressed, suggested or implied by such forward-looking statements. The Company undertakes no obligation to update forward-looking statements to reflect developments or information obtained after the date hereof.\nWe expect the increase in same store sales to range from 1.0% to 3.0% in fiscal 2023.\nWe have budgeted $70,000 for capital expenditures in fiscal 2023. Planned expenditures include costs for construction of three replacement stores scheduled to open in fiscal 2024, two major remodels, including the conversion of the Pelham, NY store from the Fairway to the ShopRite banner, the purchase of the Vineland store shopping center, several smaller store remodels and merchandising initiatives, installation of electronic shelf labels in six stores, continued expansion of self-checkout, and various technology, equipment and facility upgrades.\nThe Boards current intention is to continue to pay quarterly dividends in 2023 at the most recent rate of $.25 per Class A and $.1625 per Class B share.\nWe believe cash and cash equivalents on hand, operating cash flow and the Company's Credit Facility will be adequate to meet anticipated requirements for working capital, capital expenditures and debt payments for the foreseeable future.\nWe expect our effective income tax rate in fiscal 2023 to be in the range of 31.0% - 32.0%.\nVarious uncertainties and other factors could cause actual results to differ from the forward-looking statements contained in this report. These include:\nThe COVID-19 pandemic created significant volatility and uncertainty in our business since the first outbreak in our trade area in March 2020. Its continuing impact and the impact of new virus variants and the measures taken in response could adversely impact our business, financial condition and results of operations. We continue to monitor and adjust the safety measures we have implemented since the beginning of the pandemic. Our business may be affected by uncertain or changing economic and market conditions arising in connection with and in response to the COVID-19 pandemic, including labor shortages, inflation, disruptions to supply chains, higher operating and/or compliance costs, changes in customer trends and consumer demand, changes in federal, state and local laws, regulations and community response measures, the form and impact of economic stimulus, our customers access to and the continued availability of government benefit programs through the Supplemental Nutrition Assistance Program (\"SNAP\") and general overall economic instability. It is unclear whether and to what extent sales, consumer behavior, general economic and business activity will return to pre-pandemic levels and its impact on our business. Furthermore, the impact of the COVID-19 health crisis may exacerbate other risks and uncertainties included herein, which could have a material effect on the Company.\nThe Fairway acquisition involves a number of risks, uncertainties and challenges, including under-performance relative to our expectations, additional capital requirements, unforeseen expenses or delays, imprecise assumptions or our inability to achieve projected cost savings or other synergies, competitive factors in the marketplace and difficulties integrating the business, including merging company cultures, cultivating brand strategy, expansion of food production and conforming the acquired company's technology, standards, processes, procedures and controls. Sales and operating profits have underperformed in Manhattan due primarily to less residential, commuter and tourist traffic during the COVID-19 pandemic. Many of these potential circumstances are outside of our control and any of them could result in an adverse impact on our results of operations, financial condition and cash flows and the diversion of management time and resources.\nThe supermarket business is highly competitive and characterized by narrow profit margins. Results of operations may be materially adversely impacted by competitive pricing and promotional programs, industry consolidation and competitor store openings. Village competes directly with multiple retail formats both in-store and online, including national, regional and local supermarket chains as well as warehouse clubs, supercenters, drug stores, discount general merchandise stores, fast food chains, restaurants, dollar stores and convenience stores. Some of these competitors have greater financial resources, lower merchandise acquisition costs and lower operating expenses than we do.\nThe Companys stores are concentrated in New Jersey, New York, Pennsylvania and Maryland. We are vulnerable to economic downturns in these states in addition to those that may affect the country as a whole. Economic conditions such as inflation, deflation, interest rate fluctuations, movements in energy costs, social programs, minimum wage legislation, unemployment rates, disturbances due to social unrest and changing demographics may adversely affect our sales and profits.\nVillage purchases substantially all of its merchandise from Wakefern. In addition, Wakefern provides the Company with support services in numerous areas including advertising, workers' compensation, liability and property insurance, supplies, certain equipment purchasing, coupon processing, certain financial accounting applications, retail technology support, and other store services. Further, Village receives patronage dividends and other product incentives from Wakefern and also has demand deposits and notes receivable due from Wakefern.\nAny material change in Wakeferns method of operation or a termination or material modification of Villages relationship with Wakefern could have an adverse impact on the conduct of the Companys business and could involve additional expense for Village. The failure of any Wakefern member to fulfill its obligations to Wakefern or a members insolvency or withdrawal from Wakefern could result in increased costs to the Company. Additionally, an adverse change in Wakeferns results of operations could have an adverse effect on Villages results of operations.\nApproximately 88% of our employees are covered by collective bargaining agreements. Any work stoppages could have an adverse impact on our financial results. If we are unable to control health care and pension costs provided for in the collective bargaining agreements, we may experience increased operating costs.\nThe Company could be adversely affected if consumers lose confidence in the safety and quality of the food supply chain. The real or perceived sale of contaminated food products by us could result in a loss of consumer confidence and product liability claims, which could have a material adverse effect on our sales and operations.\nCertain of the multi-employer plans to which we contribute are underfunded. As a result, we expect that contributions to these plans may increase. Additionally, the benefit levels and related items will be issues in the negotiation of our collective bargaining agreements. Under current law, an employer that withdraws or partially withdraws from a multi-employer pension plan may incur a withdrawal liability to the plan, which represents the portion of the plans underfunding that is allocable to the withdrawing employer under very complex actuarial and allocation rules. The failure of a withdrawing employer to fund these obligations can impact remaining employers. The amount of any increase or decrease in our required contributions to these multi-employer pension plans will depend upon the outcome of collective bargaining, actions taken by trustees who manage the plans, government regulations, withdrawals by other participating employers and the actual return on assets held in the plans, among other factors.\nThe Company uses a combination of insurance and self-insurance to provide for potential liability for workers compensation, automobile, general liability, property, director and officers liability, and certain employee health care benefits. Any projection of losses is subject to a high degree of variability. Changes in legal claims, trends and interpretations, variability in inflation rates, changes in the nature and method of claims settlement, benefit level changes due to changes in applicable laws, and insolvency of insurance carriers could all affect our financial condition, results of operations, or cash flows.\nOur long-lived assets, primarily store property, equipment and fixtures, are subject to periodic testing for impairment. Failure of our asset groups to achieve sufficient levels of cash flow could result in impairment charges on long-lived assets.\nOur goodwill and indefinite-lived intangible assets are tested at the end of each fiscal year, or more frequently if circumstances dictate, for impairment. Failure of acquired businesses to achieve their forecasted expectations could result in impairment charges to goodwill and indefinite-lived intangible assets.\nOur effective tax rate may be impacted by the results of tax examinations and changes in tax laws.\nWakefern provides all members of the cooperative with information system support that enables us to effectively manage our business data, customer transactions, ordering, communications and other business processes. These information systems are subject to damage or interruption from power outages, computer or telecommunications failures, computer viruses and related malicious software, catastrophic weather events, or human error. Any material interruption of our or Wakeferns information systems could have a material adverse impact on our results of operations.\nDue to the nature of our business, personal information about our customers, vendors and associates is received and stored in these information systems. In addition, confidential information is transmitted through our online business at shoprite.com and through the ShopRite app. Unauthorized parties may attempt to access information stored in or to sabotage or disrupt these systems. Wakefern and the Company maintain substantial security measures to prevent and detect unauthorized access to such information, including utilizing third-party service providers for monitoring our networks, security reviews, and other functions. It is possible that computer hackers, cyber terrorists and others may be able to defeat the security measures in place at the Company, Wakefern or those of third-party service providers.\nAny breach of these security measures and loss of confidential information, which could be undetected for a period of time, could damage our reputation with customers, vendors and associates, cause Wakefern and Village to incur significant costs to protect any customers, vendors and associates whose personal data was compromised, cause us to make changes to our information systems and could result in government enforcement actions and litigation against Wakefern and/or Village from outside parties. Any such breach could have a material adverse impact on our operations, consolidated financial condition, results of operations, and liquidity if the related costs to Wakefern and Village are not covered or are in excess of carried insurance policies. In addition, a security breach could require Wakefern and Village to devote significant management resources to address problems created by the security breach and restore our reputation.\nRELATED PARTY TRANSACTIONS\nThe Company holds an investment in Wakefern, its principal supplier. Village purchases substantially all of its merchandise from Wakefern in accordance with the Wakefern Stockholder Agreement. As part of this agreement, Village is required to purchase certain amounts of Wakefern common stock. At July 30, 2022, the Companys indebtedness to Wakefern for the outstanding amount of this stock subscription was $3,095. The maximum per store investment is currently $975. Wakefern distributes as a patronage dividend to each member a share of its earnings in proportion to the dollar volume of purchases by the member from Wakefern during the year. Wakefern provides the Company with support services in numerous areas including advertising, supplies, workers' compensation, liability and property insurance, technology support and other store services. Additional information is provided in Note 3 to the consolidated financial statements.\nAt July 30, 2022, the Company held variable rate notes receivable due from Wakefern of $28,627 that earn interest at the prime rate plus 1.25% and matured on August 15, 2022 and $29,157 that earn interest at the prime rate plus .75% and mature on February 15, 2024. The Company invested $28,850 of the proceeds received from the notes that matured on August 15, 2022 in variable rate notes receivable from Wakefern that earn interest at the prime rate plus .50% and mature on August 15, 2027. On September 28, 2022, the Company invested an additional $30,000 in variable rate notes receivable from Wakefern that earn interest at the prime rate plus .50% and mature on September 28, 2027. Wakefern has the right to prepay these notes at any time. Under certain conditions, the Company can require Wakefern to prepay the notes, although interest earned since inception would be reduced as if it was earned based on overnight money market rates as paid by Wakefern on demand deposits.\nAt July 30, 2022, Village had demand deposits invested at Wakefern in the amount of $110,739. These deposits earn overnight money market rates.\nThe Company subleases the Galloway and Vineland stores from Wakefern under sublease agreements which provided for combined annual rents of $959 and $1,355 during fiscal 2022 and 2021, respectively, and has related aggregate lease obligations of $607 at July 30, 2022. Both leases contain normal periodic rent increases and options to extend the lease. On October 13, 2021, Village completed the acquisition of the Galloway store shopping center for $9,800.\nThe Company leases a supermarket from a realty firm 30% owned by certain officers of Village. The Company paid rent to related parties under this lease of $735 and $704 in fiscal 2022 and 2021, respectively, and has a related lease obligation of $2,545 at July 30, 2022. This lease expires in fiscal 2026 with options to extend at increasing annual rents.\nThe Company has ownership interests in four real estate partnerships. Village paid aggregate rents to two of these partnerships for leased stores of $1,556 and $1,579 in fiscal 2022 and 2021, respectively, and has aggregate lease obligations of $12,340 at July 30, 2022 related to these leases.  ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nVILLAGE SUPER MARKET, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In thousands)\nJuly 30,\n2022 July 31,\nASSETS\nCurrent Assets\nCash and cash equivalents $ 134,832 $ 116,314\nMerchandise inventories 44,190 42,633\nPatronage dividend receivable 12,239 11,860\nNotes receivable from Wakefern 28,627 -\nIncome taxes receivable 631 5,111\nOther current assets 17,446 20,398\nTotal current assets 237,965 196,316\nProperty, equipment and fixtures, net 265,333 256,154\nOperating lease assets 293,295 289,461\nNotes receivable from Wakefern 29,157 55,295\nInvestment in Wakefern 33,004 33,004\nInvestments in Real Estate Partnerships 7,162 1,970\nGoodwill 24,190 24,190\nOther assets 34,342 32,614\nTotal assets $ 924,448 $ 889,004\nLIABILITIES and SHAREHOLDERS EQUITY\nCurrent Liabilities\nOperating lease obligations $ 20,351 $ 21,627\nFinance lease obligations 596 531\nNotes payable to Wakefern 1,134 632\nCurrent portion of debt 7,466 6,976\nAccounts payable to Wakefern 77,037 70,792\nAccounts payable and accrued expenses 24,266 25,098\nAccrued wages and benefits 27,221 25,036\nIncome taxes payable 98 1,601\nTotal current liabilities 158,169 152,293\nLong-term debt\nOperating lease obligations 284,300 278,135\nFinance lease obligations 21,510 22,325\nNotes payable to Wakefern 1,961 2,791\nLong-term debt 66,264 66,827\nTotal long-term debt 374,035 370,078\nPension liabilities 4,569 10,182\nOther liabilities 15,566 14,978\nCommitments and Contingencies (Notes 3, 4, 5, 6, 7, 9 and 10)\nShareholders' Equity\nPreferred stock, no par value: Authorized 10,000 shares, none issued\n- -\nClass A common stock, no par value: Authorized 20,000 shares; issued 10,971 shares at July 30, 2022 and 10,978 shares at July 31, 2021\n72,891 70,594\nClass B common stock, no par value: Authorized 20,000 shares; issued and outstanding 4,294 shares at July 30, 2022 and July 31, 2021\n697 697\nRetained earnings 306,974 293,185\nAccumulated other comprehensive income (loss) 6,135 (9,064)\nLess treasury stock, Class A, at cost: 752 shares at July 30, 2022 and 726 shares at July 31, 2021\n(14,588) (13,939)\nTotal shareholders equity 372,109 341,473\nTotal liabilities and shareholders' equity $ 924,448 $ 889,004\nSee notes to consolidated financial statements.\nVILLAGE SUPER MARKET, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands, except per share amounts)\nYears ended\nJuly 30,\n2022 July 31,\n(52 Weeks) (53 Weeks)\nSales $ 2,061,084 $ 2,030,330\nCost of sales 1,481,417 1,465,286\nGross profit 579,667 565,044\nOperating and administrative expense 507,597 498,786\nDepreciation and amortization 33,122 34,195\nImpairment of assets - 2,900\nOperating income 38,948 29,163\nInterest expense (3,907) (3,943)\nInterest income 4,023 3,633\nIncome before income taxes 39,064 28,853\nIncome taxes 12,234 8,859\nNet income $ 26,830 $ 19,994\nNet income per share:\nClass A common stock:\nBasic $ 2.06 $ 1.53\nDiluted $ 1.84 $ 1.37\nClass B common stock:\nBasic $ 1.34 $ 1.00\nDiluted $ 1.34 $ 1.00\nSee notes to consolidated financial statements.\nVILLAGE SUPER MARKET, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\nYears ended\nJuly 30,\n2022 July 31,\n(52 Weeks) (53 Weeks)\nNet income $ 26,830 $ 19,994\nOther comprehensive income (loss):\nUnrealized gain on interest rate swaps, net of tax (1) 3,398 1,428\nAmortization of pension actuarial loss, net of tax (2) 233 409\nPension remeasurement, net of tax (3) 3,012 (2,559)\nPension settlement loss, net of tax (4) 8,556 409\nTotal other comprehensive income (loss) 15,199 (313)\nComprehensive income $ 42,029 $ 19,681\n(1)Amounts are net of tax of $1,505 and $604 for 2022 and 2021, respectively.\n(2)Amounts are net of tax of $102 and $179 for 2022 and 2021, respectively. All amounts are reclassified from accumulated other comprehensive loss to operating and administrative expense.\n(3)Amounts are net of tax of $1,349 and $1,484 for 2022 and 2021, respectively.\n(4)Amounts are net of tax of $3,785 and $178 for 2022 and 2021, respectively. All amounts are reclassified from accumulated other comprehensive loss to operating and administrative expense.\nSee notes to consolidated financial statements.\nVILLAGE SUPER MARKET, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\n(In thousands)\nYears ended July 30, 2022 and July 31, 2021\nAccumulated\nOther\nComprehensive\nIncome (Loss) Total\nShareholders'\nEquity\nClass A\nCommon Stock Class B\nCommon Stock Treasury Stock\nClass A\nShares Issued Amount Shares Issued Amount Retained Earnings Shares Amount\nBalance, July 25, 2020 10,985 $ 68,072 4,294 $ 697 $ 286,241 $ (8,751) 726 $ (13,939) $ 332,320\nNet income - - - - 19,994 - - - 19,994\nOther comprehensive loss, net of tax of $523\n- - - - - (313) - - (313)\nDividends - - - - (13,050) - - - (13,050)\nRestricted shares forfeited (15) (71) - - - - - - (71)\nShare-based compensation expense 8 2,593 - - - - - - 2,593\nBalance, July 31, 2021 10,978 $ 70,594 4,294 $ 697 $ 293,185 $ (9,064) 726 $ (13,939) $ 341,473\nNet income - - - - 26,830 - - - 26,830\nOther comprehensive income, net of tax of $6,741\n- - - - - 15,199 - - 15,199\nDividends - - - - (13,041) - - - (13,041)\nTreasury stock purchases - - - - - - 26 (649) (649)\nRestricted shares forfeited (16) (198) - - - - - - (198)\nShare-based compensation expense 9 2,495 - - - - - - 2,495\nBalance, July 30, 2022 10,971 $ 72,891 4,294 $ 697 $ 306,974 $ 6,135 752 $ (14,588) $ 372,109\nSee notes to consolidated financial statements.\nVILLAGE SUPER MARKET, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nYears ended\nJuly 30, 2022 July 31, 2021\n(52 Weeks) (53 Weeks)\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet income $ 26,830 $ 19,994\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 34,705 35,701\nNon-cash share-based compensation 2,297 2,522\nNon-cash pension settlement charges 10,856 587\nDeferred taxes (5,093) (2,542)\nProvision to value inventories at LIFO 3,295 220\nImpairment of assets - 2,900\nGain on sale of assets (346) (5,103)\nChanges in assets and liabilities:\nMerchandise inventories (4,852) (718)\nPatronage dividend receivable (379) (656)\nAccounts payable to Wakefern 6,550 (10,645)\nAccounts payable and accrued expenses (1,759) (3,741)\nAccrued wages and benefits 2,185 1,387\nIncome taxes receivable / payable 2,976 9,291\nOther assets and liabilities 2,360 3,495\nNet cash provided by operating activities 79,625 52,692\nCASH FLOWS FROM INVESTING ACTIVITIES\nCapital expenditures (43,270) (25,233)\nProceeds from the sale of assets 4,352 1,147\nInvestment in notes receivable from Wakefern (2,489) (2,287)\nInvestment in real estate partnerships (5,010) -\nNet cash used in investing activities (46,417) (26,373)\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from issuance of long-term debt 7,350 50,000\nPrincipal payments of long-term debt (8,299) (8,414)\nPayments on revolving line of credit - (50,000)\nDebt issuance costs (51) (222)\nDividends (13,041) (13,050)\nTreasury stock purchases, including shares surrendered for withholding taxes (649) -\nNet cash used in financing activities (14,690) (21,686)\nNET INCREASE IN CASH AND CASH EQUIVALENTS 18,518 4,633\nCASH AND CASH EQUIVALENTS, BEGINNING OF YEAR 116,314 111,681\nCASH AND CASH EQUIVALENTS, END OF YEAR $ 134,832 $ 116,314\nSUPPLEMENTAL DISCLOSURES OF CASH PAYMENTS MADE FOR:\nInterest $ 3,907 $ 3,943\nIncome taxes 20,685 1,475\nNONCASH SUPPLEMENTAL DISCLOSURES:\nInvestment in Wakefern and increase in notes payable to Wakefern $ - $ 2,872\nCapital expenditures included in accounts payable and accrued expenses 3,784 3,162\nSee notes to consolidated financial statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(All amounts are in thousands, except per share data).\nNOTE 1 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nNature of operations\nVillage Super Market, Inc. (the Company or Village) operates a chain of 34 supermarkets under the ShopRite and Fairway names in New Jersey, Maryland, New York and eastern Pennsylvania and four specialty markets under the Gourmet Garage name in New York City. The Company is a member of Wakefern Food Corporation (\"Wakefern\"), the nation's largest retailer-owned food cooperative and owner of the ShopRite, Fairway and Gourmet Garage names. This relationship provides Village many of the economies of scale in purchasing, distribution, store and own branded products, advanced retail technology, marketing and advertising associated with chains of greater size and geographic coverage.\nPrinciples of consolidation\nThe consolidated financial statements include the accounts of Village Super Market, Inc. and its subsidiaries, which are wholly owned. Intercompany balances and transactions have been eliminated.\nFiscal year\nThe Company and its subsidiaries utilize a 52-53 week fiscal year ending on the last Saturday in the month of July. Fiscal 2022 contains 52 weeks and fiscal 2021 contains 53 weeks.\nUse of estimates\nIn conformity with U.S. generally accepted accounting principles, management of the Company has made a number of estimates and assumptions relating to the reporting of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Some of the more significant estimates are patronage dividends, pension accounting assumptions, accounting for contingencies, accounting for derivative instruments and hedging activities, and the impairment of long-lived assets, goodwill and indefinite-lived intangible assets. Actual results could differ from those estimates.\nIndustry segment\nThe Company consists of one operating segment, the retail sale of food and nonfood products.\nRevenue recognition\nRevenue is recognized at the point of sale to the customer, including Pharmacy sales. Digital channel sales are recognized either upon pickup in-store or upon delivery to the customer, including any related service revenues. Sales tax is excluded from revenue.\nDiscounts provided to customers through store coupons and loyalty programs are recognized as a reduction of sales as products are sold. Discounts provided to customers by vendors are not recognized as a reduction in sales. Rather, the Company records a receivable from the vendor for the difference in sales price and payment received from the customer.\nThe Company does not recognize revenue when it sells gift cards redeemable at Wakefern member stores. Payment collected from customers for sale of these gift cards is passed on to Wakefern as they can be redeemed at other locations, including those operated by Wakefern or other Wakefern members. Revenue is recognized and a receivable from Wakefern is recorded when a customer redeems these gift cards to purchase products or services.\nDisaggregated Revenues\nThe following table presents the Company's sales by product categories during each of the periods indicated:\nYears Ended\nJuly 30, 2022 July 31, 2021\nAmount % Amount %\nCenter Store (1) $ 1,229,336 59.7 % $ 1,218,550 60.6 %\nFresh (2) 757,383 36.7 % 736,657 35.7 %\nPharmacy 67,780 3.3 % 67,048 3.3 %\nOther (3) 6,585 0.3 % 8,075 0.4 %\nTotal Sales $ 2,061,084 100.0 % $ 2,030,330 100.0 %\n(1) Consists primarily of grocery, dairy, frozen, health and beauty care, general merchandise and liquor.\n(2) Consists primarily of produce, meat, deli, seafood, bakery, prepared foods and floral.\n(3) Consists primarily of sales related to other income streams, including service fees related to digital sales, gift card and lottery commissions and wholesale sales.\nCost of sales\nCost of sales consists of costs of inventory, inbound freight charges, and production costs at the Company's centralized commissary, including materials, labor and overhead.\nThe Company receives vendor allowances and rebates, including the patronage dividend and amounts received as a pass through from Wakefern, related to the Companys buying and merchandising activities. Vendor allowances and rebates are recognized as a reduction in cost of sales when the related merchandise is sold or when the required contractual terms are completed.\nShipping and handling costs associated with the Companys digital sales are included in operating and administrative expense.\nOperating and administrative expense\nOperating and administrative expenses consists primarily of store and corporate costs, including employee salaries, wages, company-sponsored and multi-employer health and welfare, pension, and defined contribution benefits, supplies, advertising, utilities, facility repairs and maintenance, rent, occupancy costs and administrative expenses.\nCash and cash equivalents\nThe Company considers all highly liquid investments purchased with a maturity of three months or less to be cash equivalents. Included in cash and cash equivalents are proceeds due from credit and debit card transactions, which typically settle within five business days, of $11,653 and $10,638 at July 30, 2022 and July 31, 2021, respectively. Included in cash and cash equivalents at July 30, 2022 and July 31, 2021 are $110,739 and $86,670, respectively, of demand deposits invested at Wakefern at overnight money market rates.\nMerchandise inventories\nApproximately 61% of merchandise inventories are stated at the lower of LIFO (last-in, first-out) cost or market. If the FIFO (first-in, first-out) method had been used, inventories would have been $18,616 and $15,321 higher than reported in fiscal 2022 and 2021, respectively. All other inventories are stated at the lower of FIFO cost or market.\nProperty, equipment and fixtures\nProperty, equipment and fixtures are recorded at cost. Interest cost incurred to finance construction is capitalized as part of the cost of the asset. Maintenance and repairs are expensed as incurred.\nDepreciation is provided on a straight-line basis over estimated useful lives of thirty years for buildings, ten years for store fixtures and equipment, and three years for computer equipment, shopping carts and vehicles. Leasehold improvements are amortized over the shorter of the related lease terms or the estimated useful lives of the related assets.\nWhen assets are sold or retired, their cost and accumulated depreciation are removed from the accounts, and any gain or loss is reflected in the consolidated financial statements.\nInvestments\nThe Companys investments in its principal supplier, Wakefern, and a Wakefern affiliate, Insure-Rite, Ltd., are stated at cost (see Note 3). Village evaluates its investments in Wakefern and Insure-Rite, Ltd. for impairment through consideration of previous, current and projected levels of profit of those entities.\nThe Companys 20%-50% investments in certain real estate partnerships are accounted for under the equity method. One of these partnerships is a variable interest entity which does not require consolidation as Village is not the primary beneficiary (see Note 7).\nStore opening and closing costs\nAll store opening costs are expensed as incurred. The Company records a liability for the future minimum lease payments and related costs for closed stores from the date of closure to the end of the remaining lease term, net of estimated cost recoveries that may be achieved through subletting, discounted using a risk-adjusted interest rate.\nLeases\nThe Company determines if an arrangement is a lease at inception, and recognizes a finance and operating lease liability and asset for all leases with terms of more than 12 months at the lease commencement date. Finance and operating lease liabilities represent the present value of minimum lease payments not yet paid. For purposes of measuring the present value of its fixed payment obligations for a given lease, the Company uses its incremental borrowing rate as the discount rate implicit within its leases is generally not determinable. The Company's incremental borrowing rate reflects the rate it would pay to borrow on a secured basis, and incorporates the term and economic environment of the lease. Each renewal option is evaluated when recognizing the lease right-of-use assets and liabilities, and the Company utilizes the lease term for which it is reasonably certain to use the underlying asset. The Company is obligated under all leases to pay for real estate taxes, utilities and liability insurance, and under certain leases to pay additional amounts based on maintenance and a percentage of sales in excess of stipulated amounts. The Company accounts for rent holidays, escalating rent provisions, and construction allowances related to operating leases in rent expense on a straight-line basis over the term of the lease. Finance lease payments are charged to interest expense and depreciation and amortization expense over the lease term. Additional information on leases is provided in Note 7.\nAdvertising\nAdvertising costs are expensed as incurred. Advertising expense was $10,320 and $12,268 in fiscal 2022 and 2021, respectively.\nIncome taxes\nDeferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in operations in the period that includes the enactment date.\nThe Company recognizes a tax benefit for uncertain tax positions if it is more likely than not that the position is sustainable, based on its technical merits. The tax benefit of a qualifying position is the largest amount of tax benefit that is greater than 50% likely of being realized upon effective settlement with a taxing authority having full knowledge of all relevant information.\nDerivative Instruments and Hedging Activities\nThe Company records all derivatives on the balance sheet at fair value. Derivatives designated and qualifying as a hedge of the exposure to variability in expected future cash flows are considered cash flow hedges. The Company records changes in the fair value of its interest rate swap contracts to Accumulated other comprehensive income (loss), net of taxes, as the Company has elected to designate its swaps as cash flow hedges and apply hedge accounting when the hedging relationship has satisfied the criteria necessary to apply hedge accounting. Additional information on derivative and hedging activities is provided in Note 5.\nFair value\nFair value is defined as the exit price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. Fair value is a market-based measurement that should be determined using assumptions that market participants would use in pricing an asset or liability. The fair value guidance establishes a three-level hierarchy to prioritize the inputs used in measuring fair value. Level 1 inputs are quoted prices (unadjusted) in active markets for identical assets or liabilities that the Company has the ability to access at the measurement date. Level 2 inputs are inputs other than quoted prices within Level 1 that are observable for the asset or liability, either directly or indirectly, such as quoted prices for similar assets or liabilities in active markets observable at commonly quoted intervals. Level 3 inputs are unobservable inputs for the asset or liability.\nCash and cash equivalents, patronage dividend receivable, income taxes receivable/payable, accounts payable and accrued expenses are reflected in the consolidated financial statements at carrying value, which approximates fair value because of the short-term maturity of these instruments. The carrying values of the Companys notes receivable from Wakefern approximate their fair value as interest is earned at variable market rates. As the Companys investment in Wakefern can only be sold to Wakefern at amounts that approximate the Companys cost, it is not practicable to estimate the fair value of such investment.\nLong-lived assets\nThe Company reviews the carrying values of its long-lived assets, such as property, equipment and fixtures and operating lease assets on an individual store basis for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. Factors considered by the Company that could result in an impairment triggering event include a current period operating or cash flow loss, underperformance of a store relative to historical or expected operating results, and significant negative industry or economic trends. If an impairment triggering event is identified, the Company analyzes the undiscounted estimated future net cash flows from asset groups at the store level to determine if the carrying value of such assets are recoverable from their respective cash flows. If impairment is indicated, it is measured by comparing the fair value of the long-lived asset groups to their carrying value. For the year ended July 31, 2021 the Company recorded an impairment of long-lived assets for one Gourmet Garage store of $514.\nGoodwill and indefinite-lived intangible assets\nGoodwill and indefinite-lived intangible assets are tested at the end of each fiscal year, or more frequently if circumstances dictate, for impairment. The Company's indefinite-lived intangible assets balance of $13,299 as of July 30, 2022 and July 31, 2021 are related to the Fairway and Gourmet Garage trade names. An impairment loss is recognized to the extent that the carrying amount of goodwill and indefinite-lived intangible assets exceeds its implied fair value. Village considers earnings multiples and other valuation techniques to measure fair value of goodwill at the reporting unit level, in addition to the value of the Companys stock. The fair value of trade names are estimated based on the discounted cash flow model using the relief from royalty method. For the year ended July 31, 2021 the Company recorded an impairment of the Fairway trade name of $2,386.\nNet income per share\nThe Company has two classes of common stock. Class A common stock is entitled to cash dividends as declared 54% greater than those paid on Class B common stock. Shares of Class B common stock are convertible on a share-for-share basis for Class A common stock at any time.\nThe Company utilizes the two-class method of computing and presenting net income per share. The two-class method is an earnings allocation formula that calculates basic and diluted net income per share for each class of common stock separately based on dividends declared and participation rights in undistributed earnings. Under the two-class method, Class A common stock is assumed to receive a 54% greater participation in undistributed earnings than Class B common stock, in accordance with the classes' respective dividend rights. Unvested share-based payment awards that contain nonforfeitable rights to dividends are treated as participating securities and therefore included in computing net income per share using the two-class method.\nDiluted net income per share for Class A common stock is calculated utilizing the if-converted method, which assumes the conversion of all shares of Class B common stock to Class A common stock on a share-for-share basis, as this method is more dilutive than the two-class method. Diluted net income per share for Class B common stock does not assume conversion of Class B common stock to shares of Class A common stock.\nThe table below reconciles Net income to Net income available to Class A and Class B shareholders:\nYears ended\nJuly 30,\n2022 July 31,\n2021 July 25, 2020\n(52 Weeks) (53 Weeks) (53 Weeks)\nNet income $ 26,830 $ 19,994\nDistributed and allocated undistributed Net (loss) income to unvested restricted shareholders\n777 626\nNet income income available to Class A and Class B shareholders\n$ 26,053 $ 19,368\nThe tables below reconcile the numerators and denominators of basic and diluted net income per share for all periods presented.\n2022 2021\nClass A Class B Class A Class B\nNumerator:\nNet income allocated, basic $ 20,311 $ 5,742 $ 15,095 $ 4,273\nConversion of Class B to Class A shares 5,742 - 4,273 -\nNet income allocated, diluted $ 26,053 $ 5,742 $ 19,368 $ 4,273\nDenominator:\nWeighted average shares outstanding, basic 9,869 4,294 9,853 4,294\nConversion of Class B to Class A shares 4,294 - 4,294 -\nWeighted average shares outstanding, diluted 14,163 4,294 14,147 4,294\nNet income per share is as follows:\n2022 2021\nClass A Class B Class A Class B\nBasic $ 2.06 $ 1.34 $ 1.53 $ 1.00\nDiluted $ 1.84 $ 1.34 $ 1.37 $ 1.00\nOutstanding stock options to purchase Class A shares of 97 and 102 were excluded from the calculation of diluted net income per share at July 30, 2022 and July 31, 2021, respectively, as a result of their anti-dilutive effect. In addition, 359 and 392 non-vested restricted Class A shares, which are considered participating securities, and their allocated net income were excluded from the diluted net income per share calculation at July 30, 2022 and July 31, 2021, respectively, due to their anti-dilutive effect.\nShare-based compensation\nAll share-based payments to employees are recognized in the financial statements as compensation costs based on the fair market value on the date of the grant.\nBenefit plans\nThe Company recognizes the funded status of its Company sponsored retirement plans on the consolidated balance sheet. Actuarial gains or losses, curtailments, prior service costs or credits, and transition obligations not previously recognized are recorded as a component of Accumulated other comprehensive income (loss). The Company uses July 31 as the measurement date for these plans.\nThe Company also contributes to several multi-employer pension plans under the terms of collective bargaining agreements that cover certain union-represented employees. Pension expense for these plans is recognized as contributions are made.\nRecently issued accounting standards\nThe Company monitors accounting standards recently issued by the FASB to assess their impact on the consolidated financial statements, if any. There were no recently issued accounting standards that will have a material impact on our consolidated financial statements.\nNOTE 2 - PROPERTY, EQUIPMENT and FIXTURES\nProperty, equipment and fixtures are comprised as follows:\nJuly 30,\n2022 July 31,\nLand and buildings $ 129,103 $ 105,325\nStore fixtures and equipment 341,924 329,454\nLeasehold improvements 183,188 178,062\nLeased property under finance leases 25,211 25,211\nConstruction in progress 8,054 5,535\nVehicles 2,746 3,494\nTotal property, equipment and fixtures 690,226 647,081\nAccumulated depreciation (411,541) (378,522)\nAccumulated amortization of property under finance leases (13,352) (12,405)\nProperty, equipment and fixtures, net $ 265,333 $ 256,154\nAmortization of leased property under finance leases is included in depreciation and amortization expense.\nNOTE 3 - RELATED PARTY INFORMATION - WAKEFERN\nThe Companys ownership interest in its principal supplier, Wakefern, which is operated on a cooperative basis for its stockholder members, is 12.5% of the outstanding shares of Wakefern at July 30, 2022. The investment is stated at cost and is pledged as collateral for any obligations to Wakefern. In addition, all obligations to Wakefern are personally guaranteed by certain shareholders of Village.\nThe Company is obligated to purchase 85% of its primary merchandise requirements from Wakefern until ten years from the date that stockholders representing 75% of Wakefern sales notify Wakefern that those stockholders request that the Wakefern Stockholder Agreement be terminated. If this purchase obligation is not met, Village is required to pay Wakeferns profit contribution shortfall attributable to this failure. Similar payments are due if Wakefern loses volume by reason of the sale of Company stores or a merger with another entity. Village fulfilled the above obligation in fiscal 2022 and 2021. The Company also has an investment of approximately 9.4% in Insure-Rite, Ltd., a Wakefern affiliated company, which provides Village with workers' compensation, liability and property insurance coverage.\nWakefern has increased from time to time the required investment in its common stock for each supermarket owned by a member, with the exact amount per store computed based on the amount of each stores purchases from Wakefern. At July 30, 2022, the Companys indebtedness to Wakefern for the outstanding amount of these stock subscriptions was $3,095. Installment payments are due as follows: 2023 - $1,134; 2024 - $522; 2025 - $512; 2026 - $511; 2027 - $372; and $44 thereafter. The maximum per store investment remained $975 in fiscal 2022. Village receives additional shares of common stock to the extent paid for at the end of each fiscal year (which ends on or about September 30) of Wakefern calculated at the then book value per share. The payments, together with any stock issued thereunder, at the option of Wakefern, may be null and void and all payments on this subscription shall become the property of Wakefern in the event the Company does not complete the payment of this subscription in a timely manner.\nVillage purchases substantially all of its merchandise from Wakefern. As a stockholder of Wakefern, Village earns a share of Wakeferns earnings, which are distributed as a patronage dividend. This dividend is based on a distribution of substantially all of Wakeferns operating profits for its fiscal year in proportion to the dollar volume of purchases by each member from Wakefern during that fiscal year. Patronage dividends are recorded as a reduction of cost of sales as merchandise is sold. Village accrues estimated patronage dividends due from Wakefern quarterly based on an estimate of the annual Wakefern patronage dividend and an estimate of Villages share of this annual dividend based on Villages estimated proportional share of the dollar volume of business transacted with Wakefern that year. Patronage dividends and other vendor allowances and rebates amounted to $39,038 and $43,003 in fiscal 2022 and 2021, respectively.\nWakefern provides the Company with support services in numerous areas including advertising, workers' compensation, liability and property insurance, supplies, certain equipment purchasing, coupon processing, certain financial accounting applications, retail technology support, and other store services. Village incurred charges of $47,877 and $47,462 from Wakefern in fiscal 2022 and 2021, respectively, for non-merchandise products and services, which are reflected in operating and administrative expense in the consolidated statements of operations. Additionally, the Company has certain related party leases (see Note 7) with Wakefern.\nAt July 30, 2022, the Company held variable rate notes receivable due from Wakefern of $28,627 that earn interest at the prime rate plus 1.25% and matured on August 15, 2022 and $29,157 that earn interest at the prime rate plus .75% and mature on February 15, 2024. The Company invested $28,850 of the proceeds received from the notes that matured on August 15, 2022 in variable rate notes receivable from Wakefern that earn interest at the prime rate plus .50% and mature on August 15, 2027. On September 28, 2022, the Company invested an additional $30,000 in variable rate notes receivable from Wakefern that earn interest at the prime rate plus .50% and mature on September 28, 2027. Wakefern has the right to prepay these notes at any time. Under certain conditions, the Company can require Wakefern to prepay the notes, although interest earned since inception would be reduced as if it was earned based on overnight money market rates as paid by Wakefern on demand deposits.\nAt July 30, 2022, the Company had demand deposits invested at Wakefern in the amount of $110,739. These deposits earn overnight money market rates.\nInterest income earned on investments with Wakefern was $3,953 and $3,522 in fiscal 2022 and 2021, respectively.\nNOTE 4 - DEBT\nLong-term debt consists of:\nJuly 30,\n2022 July 31,\nSecured term loan $ 50,796 $ - $ 47,025\nUnsecured term loan 17,507 21,104\nNew Market Tax Credit Financing 5,427 5,674\nTotal debt, excluding obligations under leases 73,730 73,803\nLess current portion 7,466 6,976\nTotal long-term debt, excluding obligations under leases $ 66,264 $ 66,827\nCredit Facility\nOn January 28, 2022, the Company entered into an amended and restated credit agreement of the Companys $150,500 credit facility (the Credit Facility) with Wells Fargo National Bank, National Association (Wells Fargo). The notable changes from the previous agreement include: (1) Modification of the reference rate from the London Interbank Offered Rate (\"LIBOR\") to the Secured Overnight Financing Rate (\"SOFR\") as a result of the expected cessation of LIBOR, (2) The execution of a fifteen-year $7,350 secured term loan to finance the acquisition of the Galloway store shopping center and (3) Modification of the definition of Total Adjusted Debt for the purpose of determining the maximum adjusted debt to EBITDAR ratio financial covenant, as defined in the Credit Facility. Among other things, the Credit Facility provides for:\nAn unsecured revolving line of credit providing a maximum amount available for borrowing of $75,000. Indebtedness under this agreement bears interest at the applicable SOFR plus 1.10% and expires on May 6, 2025.\nAn unsecured $25,500 term loan issued on May 12, 2020, repayable in equal monthly installments based on a seven-year amortization schedule through May 4, 2027 and bearing interest at the applicable SOFR plus 1.46%. Prior to the January 28, 2022 amendment to the credit facility, interest accrued on the unsecured term loan at the applicable LIBOR plus 1.35%. An interest rate swap with notional amounts equal to the term loan fixed the base LIBOR at .41%, resulting in a fixed effective rate of 1.76%. In February 2022, the Company executed an amendment and restatement of the interest rate swap that changes the reference rate to SOFR and fixes the base SOFR at .26% per annum through May 4, 2027, resulting in a fixed effective interest rate of 1.72% on the term loan.\nA secured $50,000 term loan issued on September 1, 2020 repayable in equal monthly installments based on a fifteen-year amortization schedule through September 1, 2035 and bearing interest at the applicable SOFR plus 1.61%. Prior to the January 28, 2022 amendment to the credit facility, interest accrued on the secured term loan at the applicable LIBOR plus 1.50%. An interest rate swap with notional amounts equal to the term loan fixed the base LIBOR at .69%, resulting in a fixed effective rate of 2.19%. In February 2022, the Company executed an amendment and restatement of the interest rate swap related to the term loan that changes the reference rate to SOFR and fixes the base SOFR at .57% per annum through September 1, 2035, resulting in a fixed effective interest rate of 2.18% on the term loan. The term loan is secured by real properties of Village Super Market, Inc. and its subsidiaries, including the sites of three Village stores.\nA secured $7,350 term loan issued on January 28, 2022 repayable in equal monthly installments based on a fifteen-year amortization schedule through January 28, 2037 and bearing interest at the applicable SOFR plus 1.50%. Additionally, Village executed an interest rate swap for a notional amount equal to the term loan amount that fixes the base SOFR at 1.41% per annum, resulting in a fixed effective interest rate of 2.91% on the term loan. The term loan is secured by the Galloway store shopping center acquired in the first quarter of fiscal 2022.\nThe principal purpose of the Credit Facility is to finance general corporate and working capital requirements, Villages acquisition of certain Fairway assets, the purchase of the Galloway store shopping center and certain capital expenditure projects. The Credit Facility also provides for up to $25,000 of letters of credit ($7,336 outstanding at July 30, 2022), which secure obligations for store leases and construction performance guarantees to municipalities. The Credit Facility contains covenants that, among other conditions, require a minimum tangible net worth, a minimum fixed charge coverage ratio and a maximum adjusted debt to EBITDAR ratio. The Company was in compliance with all covenants of the credit agreement at July 30, 2022.\nThe carrying values of the Companys long-term debt related to the Company's Credit Facility approximate their fair value as interest is charged at variable market rates. The estimated fair values of the Company's long-term debt are based on Level 2 inputs.\nNew Markets Tax Credit\nOn December 29, 2017, the Company entered into a financing transaction with Wells Fargo Community Investment Holdings, LLC (Wells Fargo) under a qualified New Markets Tax Credit (NMTC) program related to the construction of a new store in the Bronx, New York. The NMTC program was provided for in the Community Renewal Tax Relief Act of 2000 (the Act) and is intended to induce capital investment in qualified lower income communities. The Act permits taxpayers to claim credits against their Federal income taxes for up to 39% of qualified investments in the equity of community development entities\n(CDEs). CDEs are privately managed investment institutions that are certified to make qualified low-income community investments.\nIn connection with the financing, the Company loaned $4,835 to VSM Investment Fund, LLC (the \"Investment Fund\") at an interest rate of 1.403% per year and with a maturity date of December 31, 2044. Repayments on the loan commence in March 2025. Wells Fargo contributed $2,375 to the Investment Fund and, by virtue of such contribution, is entitled to substantially all of the tax benefits derived from the NMTC. The Investment Fund is a wholly owned subsidiary of Wells Fargo. The loan to the Investment Fund is recorded in other assets in the consolidated balance sheets.\nThe Investment Fund then contributed the proceeds to a CDE, which, in turn, loaned combined funds of $6,563, net of debt issuance costs, to Village Super Market of NY, LLC, a wholly-owned subsidiary of the Company, at an interest rate of 1.000% per year with a maturity date of December 31, 2051. These loans are secured by the leasehold improvements and equipment related to the construction of the Bronx store. Repayment of the loans commences in March 2025. The proceeds of the loans from the CDE were used to partially fund the construction of the Bronx store. The Notes payable related to New Markets Tax Credit, net of debt issuance costs, are recorded in long-term debt in the consolidated balance sheets.\nThe NMTC is subject to 100% recapture for a period of seven years. The Company is required to be in compliance with various regulations and contractual provisions that apply to the New Markets Tax Credit arrangement. Noncompliance could result in Wells Fargo's projected tax benefits not being realized and, therefore, require the Company to indemnify Wells Fargo for any loss or recapture of NMTCs. The Company does not anticipate any credit recapture will be required in connection with this financing arrangement. The transaction includes a put/call provision whereby the Company may be obligated or entitled to repurchase Wells Fargo's interest in the Investment Fund. The value attributed to the put/call is de minimis. We believe that Wells Fargo will exercise the put option in December 2024, at the end of the recapture period, that will result in a net benefit to the Company of $1,728. The Company is recognizing the net benefit over the seven-year compliance period in operating and administrative expense.\nNOTE 5 - DERIVATIVES AND HEDGING ACTIVITIES\nThe Company is exposed to interest rate risk arising from fluctuations in LIBOR and SOFR related to the Companys Credit Facility. The Company manages exposure to this risk and the variability of related cash flows primarily by the use of derivative financial instruments, specifically, interest rate swaps.\nThe Companys objectives in using interest rate swaps are to add stability to interest expense and to manage its exposure to interest rate movements. Interest rate swaps designated as cash flow hedges involve the receipt of variable amounts from a counterparty in exchange for the Company making fixed-rate payments over the life of the agreements without exchange of the underlying notional amount.\nAs of July 30, 2022, the Company had four interest rate swaps with an aggregate initial notional value of $92,850 to hedge the variable cash flows associated with variable-rate loans under the Company's Credit Facility. The interest rate swaps were executed for risk management and are not held for trading purposes. The objective of the interest rate swaps is to hedge the variability of cash flows resulting from fluctuations in the reference rate. The swaps replaced the applicable reference rate with fixed interest rates and payments are settled monthly when payments are made on the variable-rate loans. The Company's derivatives qualify and have been designated as cash flow hedges of interest rate risk. The gain or loss on the derivative is recorded in Accumulated other comprehensive income (loss) and subsequently reclassified into interest expense in the same period during which the hedged transaction affects earnings. Amounts reported in Accumulated other comprehensive income (loss) related to derivatives will be reclassified to interest expense as interest payments are made on the variable-rate loans. The Company reclassified $262 and $328 during the fiscal years ended July 30, 2022 and July 31, 2021, respectively, from Accumulated other comprehensive income (loss) to Interest expense.\nIn March 2020 and January 2021, the FASB issued ASU 2020-04, \"Facilitation of the Effects of Reference Rate Reform on Financial Reporting\" and ASU 2021-01, \"Reference Rate Reform: Scope\", respectively. These standards provide temporary optional expedients and exceptions for the application of GAAP to certain contract modifications, hedging relationships, and other arrangements that are expected to be impacted by the global transition away from certain reference rates, such as LIBOR. The guidance was effective upon issuance and, once adopted, may be applied prospectively to contract modifications and hedging relationships through December 31, 2022. In fiscal 2022, the Company elected to apply the hedge accounting expedients related to probability and the assessments of effectiveness for future LIBOR-indexed cash flows to assume that the index upon which future hedged transactions will be based matches the index on the corresponding derivatives. Additionally, we elected to apply expedients related to the modification of hedged transactions related to reference rate reform. Application\nof these expedients preserves the presentation of derivatives consistent with past presentation. The adoption of this portion of the ASU did not have a material impact to our consolidated financial statements.\nIn connection with the modification of the reference rate from LIBOR to SOFR in the Amended and Restated Credit Facility, in February 2022, the Company executed the amendment and restatement of two interest rate swaps (see note 4). The modified rates did not have a material impact to the consolidated financial statements.\nThe notional value of the interest rate swaps were $78,642 as of July 30, 2022. The fair value of interest rate swaps are included in the following captions on the consolidated balance sheets at July 30, 2022 and July 31, 2021:\nJuly 30,\n2022 July 31,\nOther assets 6,020 1,111\nThe fair values of the Companys interest rate swaps are based on Level 2 inputs, including the present value of estimated future cash flows based on market expectations of the yield curve on variable interest rates.\nNOTE 6 - INCOME TAXES\nThe components of the provision for income taxes are:\n2022 2021\nFederal:\nCurrent $ 10,766 $ 7,172\nDeferred (3,547) (2,037)\nState:\nCurrent 6,561 4,229\nDeferred (1,546) (505)\n$ 12,234 $ 8,859\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Significant components of the Companys deferred tax assets and liabilities are as follows:\nJuly 30,\n2022 July 31,\nDeferred tax assets:\nLease liabilities $ 100,275 $ 106,615\nCompensation related costs 3,618 4,377\nPension costs 1,536 3,248\nOther 710 552\nTotal deferred tax assets 106,139 114,792\nDeferred tax liabilities:\nTax over book depreciation 20,859 22,653\nLease assets 92,375 98,994\nPatronage dividend receivable 3,950 4,162\nInvestment in partnerships 1,164 1,162\nOther 2,206 611\nTotal deferred tax liabilities 120,554 127,582\nNet deferred tax liability $ (14,415) $ (12,790)\nDeferred income tax assets (liabilities) are included in the following captions on the consolidated balance sheets at July 30, 2022 and July 31, 2021:\nJuly 30,\n2022 July 31,\nOther assets 515 1,642\nOther liabilities (14,930) (14,432)\nA valuation allowance is provided when it is more likely than not that some portion of the deferred tax assets will not be realized. In managements opinion, in view of the Companys previous, current and projected taxable income and reversal of deferred tax liabilities, such tax assets will more likely than not be fully realized. Accordingly, no valuation allowance was deemed to be required at July 30, 2022 and July 31, 2021.\nThe effective income tax rate differs from the statutory federal income tax rate as follows:\n2022 2021\nStatutory federal income tax rate 21.0 % 21.0 %\nState income taxes, net of federal tax benefit 10.1 % 10.3 %\nOther 0.2 % (0.6) %\nEffective income tax rate 31.3 % 30.7 %\nThe Company is not currently under audit by any tax authorities, but is open to examination with varying statutes of limitations, generally ranging from three to four years.\nNOTE 7 - LEASES\nDescription of leasing arrangements\nThe Company leases 31 retail stores, as well as a commissary, the corporate headquarters and equipment at July 30, 2022. The majority of initial lease terms range from 20 to 30 years. Most of the Companys leases contain renewal options at increased rents of five years each at the Companys sole discretion. These options enable Village to retain the use of facilities in desirable operating areas.\nThe composition of total lease cost is as follows:\nYears ended\nConsolidated Statement of Operations Classification July 30,\n2022 July 31,\nOperating lease cost Operating and administrative expense $ 36,909 $ 37,677\nFinance lease cost\nAmortization of leased assets Depreciation and amortization 947 947\nInterest on lease liabilities Interest expense 1,939 2,000\nVariable lease cost Operating and administrative expense 20,483 19,479\nTotal lease cost $ 60,278 $ 60,103\nAs of July 30, 2022 and July 31, 2021, finance lease right-of-use assets of $11,859 and $12,806, respectively, are included in property, equipment and fixtures, net in the Company's consolidated balance sheet. Maturities of operating and finance lease liabilities, including options to extend lease terms that are reasonably certain of being exercised. The Company's lease liabilities mature as follows as of July 30, 2022:\nOperating leases Finance leases Total\n2023 $ 32,455 $ 2,470 $ 34,925\n2024 34,272 2,689 36,961\n2025 33,206 2,820 36,026\n2026 32,495 2,893 35,388\n2027 31,809 2,893 34,702\nThereafter 233,521 23,294 256,815\nTotal lease payments 397,758 37,059 434,817\nLess amount representing interest 93,107 14,953 108,060\nPresent value of lease liabilities $ 304,651 $ 22,106 $ 326,757\nThe Company has approximately $18,948 of future payment obligations related to lease agreements that have not yet commenced but have been executed as of July 30, 2022.\nAs of July 30, 2022, the Company's lease terms and discount rates are as follows:\nJuly 30,\n2022 July 31,\nWeighted-average remaining lease term (years)\nOperating leases 13.1 12.5\nFinance leases 13.4 14.4\nWeighted-average discount rate\nOperating leases 4.1 % 3.9 %\nFinance leases 8.5 % 8.5 %\nSupplemental cash flow information related to leases is as follows:\n2022 2021\nCash paid for amounts in the measurement of lease liabilities\nOperating cash flows from operating leases $ 35,730 $ 34,768\nOperating cash flows from finance leases 1,939 2,000\nFinancing cash flows from finance leases 750 689\nRelated party leases\nThe Company leases a supermarket from a realty firm 30% owned by certain officers of Village. The Company paid rent to related parties under this lease of $735 and $704 in fiscal 2022 and 2021, respectively, and has a related lease obligation of $2,545 at July 30, 2022. This lease expires in fiscal 2026 with options to extend at increasing annual rent.\nThe Company has ownership interests in four real estate partnerships. Village paid aggregate rents to two of these partnerships for leased stores of $1,556 and $1,579 in fiscal 2022 and 2021, respectively, and has related aggregate lease obligations of $12,340 at July 30, 2022.\nOne of these partnerships is a variable interest entity, which is not consolidated as Village is not the primary beneficiary. This partnership owns one property, a stand-alone supermarket leased to the Company since 1974. Village is a general partner entitled to 33% of the partnership's profits and losses.\nThe Company subleases the Galloway and Vineland stores from Wakefern under sublease agreements which provided for combined annual rents of $959 and $1,355 in fiscal 2022 and 2021, respectively, and has related aggregate lease obligations of $607 at July 30, 2022. Both leases contain normal periodic rent increases and options to extend the lease. On October 13, 2021, Village completed the acquisition of the Galloway store shopping center for $9,800.\nNOTE 8 - SHAREHOLDERS EQUITY\nThe Company has two classes of common stock. Class A common stock is entitled to one vote per share and to cash dividends as declared 54% greater than those paid on Class B common stock. Class B common stock is entitled to 10 votes per share. Class A and Class B common stock share equally on a per share basis in any distributions in liquidation. Shares of Class B common stock are convertible on a share-for-share basis for Class A common stock at any time. Class B common stock is not transferable except to another holder of Class B common stock or by will or under the laws of intestacy or pursuant to a resolution of the Board of Directors of the Company approving the transfer. As a result of this voting structure, the holders of the Class B common stock control greater than 50% of the total voting power of the shareholders of the Company and control the election of the Board of Directors.\nThe Company has authorized 10,000 shares of preferred stock. No shares have been issued. The Board of Directors is authorized to designate series, preferences, powers and participation of any preferred stock issued.\nThe Company maintains share repurchase programs that comply with Rule 10b5-1 under the Securities Exchange Act of 1934. Repurchases of Village Class A common stock may be made from time to time through a variety of methods, including open market purchases and other negotiated transactions. In September 2019, the Company's Board of Directors authorized an incremental $5,000 share repurchase program, supplementing the existing authorization. The Company made open market purchases totaling $2,482 under this repurchase program in fiscal 2021 and an additional $1,907 in shares of Class A Common Stock were surrendered in satisfaction of withholding taxes in connection with the vesting of restricted shares in fiscal 2021. The Company's share repurchase program had $3,203 remaining at July 30, 2022 and July 31, 2021. In fiscal 2022, the Company purchased 23 shares totaling $561 from the Village Super Market, Inc. Employees' Retirement Plan related to the termination and related liquidation of the plan's assets (see note 9).\nVillage has two share-based compensation plans, which are described below. The compensation cost charged against income for these plans was $2,297 and $2,522 in fiscal 2022 and 2021, respectively. Total income tax benefit recognized in the consolidated statements of operations for share-based compensation arrangements was $532 and $633 in fiscal 2022 and 2021, respectively.\nOn December 16, 2016, the shareholders of the Company approved the Village Super Market, Inc. 2016 Stock Plan (the 2016 Plan) under which awards of incentive and non-qualified stock options and restricted stock may be made. There are 1,200 shares of Class A common stock authorized for issuance to employees and directors under the 2016 Plan. Terms and conditions\nof awards are determined by the Board of Directors. Restricted stock awards primarily cliff vest three years from the date of grant. There are 1,090 shares remaining for future grants under the 2016 Plan.\nThe following table summarizes option activity under all plans for the following years:\n2022 2021\nShares Weighted-average\nexercise price Shares Weighted-average\nexercise price\nOutstanding at beginning of year 102 $ 28.98 156 $ 28.43\nExercised - - - -\nForfeited (5) 28.83 (54) 27.40\nExpired - $ - - $ -\nOutstanding at end of year 97 $ 28.98 102 $ 28.98\nOptions exercisable at end of year 97 $ 28.98 102 $ 28.98\nAs of July 30, 2022, the weighted-average remaining contractual term of options outstanding and options exercisable was 1.7 years. As of July 30, 2022, the aggregate intrinsic value was $0 for both options outstanding and options exercisable. The fair value of each option award is estimated on the date of grant using the Black-Scholes Option Pricing Model. The Company uses historical data for similar groups of employees in order to estimate the expected life of options granted. Expected volatility is based on the historical volatility of the Companys stock for a period of years corresponding to the expected life of the option. The risk-free interest rate is based on the U.S. Treasury yield curve at the time of grant for securities with a maturity period similar to the expected life of the option.\nThe following table summarizes restricted stock activity under all plans for the following years:\n2022 2021\nShares Weighted-average\ngrant date\nfair value Shares Weighted-average\ngrant date\nfair value\nNonvested at beginning of year 392 $ 19.55 413 $ 19.40\nGranted 9 21.52 8 25.06\nVested (26) 21.92 (14) 18.98\nForfeited (16) 20.21 (15) 18.98\nNonvested at end of year 359 $ 19.40 392 $ 19.55\nThe total fair value of restricted shares vested during fiscal 2022 and 2021 was $588 and $363, respectively.\nAs of July 30, 2022, there was $1,603 of total unrecognized compensation costs related to nonvested restricted stock granted under the above plans. That cost is expected to be recognized over a weighted-average period of 0.6 years.\nThe Company declared and paid cash dividends on common stock as follows:\n2022 2021\nPer share:\nClass A common stock $ 1.00 $ 1.00\nClass B common stock 0.65 0.65\nAggregate:\nClass A common stock $ 10,250 $ 10,259\nClass B common stock 2,791 2,791\n$ 13,041 $ 13,050\nNOTE 9 - PENSION PLANS\nCompany-Sponsored Pension Plans\nThe Company sponsored three defined benefit pension plans. Two of the plans are tax-qualified plans, one covering members of a union, which is frozen and participants no longer earn service credit, and the other covering nonunion associates, which was terminated in fiscal 2022. Benefits under the union plan are based on a fixed amount for each year of service, and benefits under the nonunion plan are based upon percentages of annual compensation. Funding for these plans is based on an analysis of the specific requirements and an evaluation of the assets and liabilities of each plan. The third plan is an unfunded, nonqualified plan providing supplemental pension benefits to certain executives.\nNet periodic pension cost for the plans include the following components:\n2022 2021\nService cost $ 187 $ 216\nInterest cost on projected benefit obligation 1,306 1,689\nExpected return on plan assets (1,258) (1,932)\nLoss on settlement 12,341 587\nAmortization of gains and losses 335 588\nNet periodic pension cost $ 12,911 $ 1,148\nIn April 2022, the Company terminated the Village Super Market, Inc. Employees Retirement Plan. Prior to termination, the Company made a $1,485 contribution to fully fund the plan. Plan assets were liquidated to fund lump sum distributions to participants of $37,289 and purchase annuity contracts totaling $14,930 with an insurance company for all participants who did not elect a lump sum distribution. No benefit obligation or plan assets related to the Village Super Market, Inc. Employees Retirement Plan remain as of July 30, 2022. The Company recognized a $12,296 pre-tax settlement charge as a result of the termination, including a $10,856 non-cash charge for unrecognized losses within accumulated other comprehensive loss as of the termination date.\nAdditionally, the Company recognized a settlement loss of $45 and $587 in fiscal 2022 and 2021, respectively, for plans where benefits paid exceeded the sum of the service cost and interest cost components of net periodic pension cost.\nThe changes in benefit obligations and the reconciliation of the funded status of the Companys plans to the consolidated balance sheets were as follows:\n2022 2021\nChanges in Benefit Obligation:\nBenefit obligation at beginning of year $ 73,229 $ 76,849\nService cost 187 216\nInterest cost 1,306 1,689\nBenefits paid (676) (796)\nSettlement (54,742) (2,563)\nActuarial loss (11,791) (2,166)\nBenefit obligation at end of year $ 7,513 $ 73,229\nChanges in Plan Assets:\nFair value of plan assets at beginning of year $ 63,047 $ 70,683\nActual return on plan assets (6,170) (4,277)\nEmployer contributions 1,485 -\nBenefits paid (676) (796)\nSettlements paid (54,742) (2,563)\nFair value of plan assets at end of year 2,944 63,047\nFunded status at end of year $ 4,569 $ 10,182\nAmounts recognized in the consolidated balance sheets:\nPension liabilities 4,569 10,182\nAccumulated other comprehensive loss (income), net of income taxes (1,962) 9,833\nAmounts included in Accumulated other comprehensive income (loss) (pre-tax):\nNet actuarial loss $ (2,872) $ 14,167\nThe Company expects approximately $557 of the net actuarial gain, excluding the impact of any potential plan settlements, to be recognized as a component of net periodic benefit costs in fiscal 2023.\nThe accumulated benefit obligations of the plans were $7,513 and $71,931 at July 30, 2022 and July 31, 2021, respectively. The following information is presented for those plans with an accumulated benefit obligation in excess of plan assets:\n2022 2021\nProjected benefit obligation $ 7,513 $ 73,229\nAccumulated benefit obligation 7,513 71,931\nFair value of plan assets 2,944 63,047\nWeighted average assumptions used to determine benefit obligations and net periodic pension cost for the Companys defined benefit plans were as follows:\n2022 2021\nAssumed discount rate - net periodic pension cost 2.44 % 2.26 %\nAssumed discount rate - benefit obligation 3.77 % 2.44 %\nAssumed rate of increase in compensation levels 4.50 % 4.50 %\nExpected rate of return on plan assets 5.25 % 3.36 %\nInvestments in the pension trusts are overseen by the trustees of the plans, who are officers of Village. The Company utilizes a liability-driven investment (\"LDI\") strategy. A LDI strategy focuses on maintaining a close to fully-funded status over the long-term with minimal funded status risk. This is achieved by investing more of the plan assets in fixed income instruments to more closely match the duration of the plan liability. The investment allocation to fixed income instruments will increase as each plans' funded status increases. The target allocations for plan assets are 30-50% equity securities, 50-70% fixed income securities and 0-10% cash. Asset allocations are reviewed periodically and appropriate rebalancing is performed.\nEquity securities include investments in large-cap, small-cap and mid-cap companies located both in and outside the United States. Fixed income securities include U.S. treasuries, mortgage-backed securities and corporate bonds of companies from diversified industries. Investments in securities are made through mutual funds. In addition, the terminated Village Super Market, Inc. Employees Retirement Plan plan held Class A common stock of Village in the amount of $512 at July 31, 2021.\nRisk management is accomplished through diversification across asset classes and fund strategies, multiple investment portfolios and investment guidelines. The plans do not allow for investments in derivative instruments.\nThe fair value of the pension assets were as follows:\nJuly 30, 2022 July 31, 2021\nAsset Category Assets Measured at NAV Total Level 1 Assets Measured at NAV Total\nCash $ - $ - $ 83 $ - $ 83\nEquity securities:\nCompany stock - - 512 - 512\nMutual/Collective Trust Funds -\nU.S. (1) 915 915 - 1,174 1,174\nMutual/Collective Trust Funds - International (1) 301 301 - 387 387\nFixed income securities:\nMutual/Collective Trust Funds - Fixed Income (1) 1,728 1,728 - 60,891 60,891\nTotal $ 2,944 $ 2,944 $ 595 $ 62,452 $ 63,047\n(1)Includes pools of investments that are measured at fair value using the Net Asset Value (NAV) per share (or its equivalent) practical expedient. The NAV is based on the underlying net assets owned by the fund and the relative interest of each participating investor in the fair value of the underlying assets. The underlying investments are classified as either level 1 or 2 of the fair value hierarchy.\nBased on actuarial assumptions, estimated future defined benefit payments, which may be significantly impacted by participant elections related to retirement dates and forms of payment, are as follows:\nFiscal Year\n2023 $ 170\n2024 180\n2025 160\n2026 190\n2027 6,080\n2028 - 2031 930\nThe Company expects contributions to its defined benefit pension plans to be immaterial in fiscal 2023.\nMulti-Employer Plans\nThe Company contributes to three multi-employer pension plans under collective bargaining agreements covering union-represented employees. These plans provide benefits to participants that are generally based on a fixed amount for each year of service. Based on the most recent information available, certain of these multi-employer plans are underfunded. The amount of any increase or decrease in Villages required contributions to these multi-employer pension plans will depend upon the outcome of collective bargaining, actions taken by trustees who manage the plans, government regulations and the actual return on assets held in the plans, among other factors.\nThe risks of participating in multi-employer pension plans are different from the risks of participating in single-employer pension plans in the following respects:\nAssets contributed to a multi-employer plan by one employer may be used to provide benefits to employees of other participating employers.\nIf a participating employer stops contributing to the plan, the unfunded obligations of the plan allocable to such withdrawing employer may be borne by the remaining participating employers.\nIf the Company stops participating in some of its multi-employer pension plans, the Company may be required to pay those plans an amount based on its allocable share of the underfunded status of the plan, referred to as a withdrawal liability.\nThe Companys participation in these plans is outlined in the following tables. The EIN / Pension Plan Number column provides the Employer Identification Number (EIN) and the three-digit pension plan number. The most recent Pension Protection Act Zone Status available in 2021 and 2020 is for the plans year-end at December 31, 2021 and December 31, 2020, respectively, unless otherwise noted. Among other factors, generally, plans in the red zone are less than 65 percent funded, plans in the yellow zone are between 65 and 80 percent funded and plans in the green zone are at least 80 percent funded. The FIP/RP Status Pending / Implemented column indicates plans for which a funding improvement plan (FIP) or a rehabilitation plan (RP) is either pending or has been implemented.\nPension Protection Act Zone Status FIP/RP Status\nPending\n/ Implemented Contributions for the\nyear ended (5) Expiration\ndate of\nCollective-\nBargaining\nAgreement\nPension Fund\nEIN / Pension Plan Number\n2021 2020 July 30,\n2022 July 31,\n2021 Surcharge\nImposed (6)\nPension Plan of Local 464A (1) 22-6051600-001 Green Green N/A $ 808 $ 874 N/A August 2025\nUFCW Local 1262 & Employers Pension Fund (2), (4) 22-6074414-001 Red Red Implemented 2,745 2,721 No October 2023\nUFCW Regional Pension Plan (3), (4) 16-6062287-074 Red Red Implemented $ 1,288 $ 1,260 No June 2024\nTotal Contributions $ 4,841 $ 4,855\n(1)The information for this fund was obtained from the Form 5500 filed for the plans year-end at December 31, 2021 and December 31, 2020.\n(2)The information for this fund was obtained from the Form 5500 filed for the plans year-end at December 31, 2020 and December 31, 2019.\n(3)The information for this fund was obtained from the Form 5500 filed for the plans year-end at September 30, 2021 and September 30, 2020.\n(4)This plan has elected to utilize special amortization provisions provided under the Preservation of Access to Care for Medicare Beneficiaries and Pension Relief Act of 2010. There were no changes to the plans zone status as a result of this election.\n(5)The Companys contributions represent more than 5% of the total contributions received by each applicable pension fund for all periods presented.\n(6)Under the Pension Protection Act, a surcharge may be imposed when employers make contributions under a collective bargaining agreement that is not in compliance with a rehabilitation plan. As of July 30, 2022, the collective bargaining agreements under which the Company was making contributions were in compliance with rehabilitation plans adopted by each applicable pension fund.\nOther Multi-Employer Benefit Plans\nThe Company also contributes to various other multi-employer benefit plans that provide health and welfare benefits to active and retired participants. Total contributions made by the Company to these other multi-employer benefit plans were $32,847 and $33,270 in fiscal 2022 and 2021, respectively.\nDefined Contribution Plans\nThe Company sponsors a 401(k) savings plan for certain eligible associates. Company contributions under that plan, which are based on specified percentages of associate contributions, were $2,054 and $1,791 in fiscal 2022 and 2021, respectively. The Company also contributes to union sponsored defined contribution plans for certain eligible associates. Company contributions under these plans were $2,944 and $3,296 in fiscal 2022 and 2021, respectively.\nNOTE 10 - COMMITMENTS and CONTINGENCIES\nApproximately 88% of our employees are covered by collective bargaining agreements. Contracts with the Companys seven unions have or will expire between October 2023 and December 2026. None of our associates are represented by unions whose contracts have already expired or expire within one year. Any work stoppages could have an adverse impact on our financial results.\nThe Company is involved in other litigation incidental to the normal course of business. Company management is of the opinion that the ultimate resolution of these legal proceedings should not have a material adverse effect on the consolidated financial position, results of operations or liquidity of the Company.\nNOTE 11 - SUBSEQUENT EVENT\nOn September 1, 2022, the Company amended the Credit Facility due to the execution of a seven year $10,000 unsecured term loan. The unsecured term loan is repayable in equal monthly installments based on a seven year amortization schedule through September 4, 2029 and bears interest at the applicable SOFR plus 1.35%. Village also executed an interest rate swap for a notional amount equal to the term loan amount that fixes the base SOFR at 2.95%, resulting in a fixed effective rate of 4.30%. This loan qualified for an interest rate subsidy program with Wakefern on financing related to certain capital expenditure projects. Net of the subsidy, the Company will pay interest at a fixed effective rate of 2.30%.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nVillage Super Market, Inc.:\nOpinions on the Consolidated Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Village Super Market, Inc. and subsidiaries (the Company) as of July 30, 2022 and July 31, 2021, the related consolidated statements of operations, comprehensive income, shareholders equity, and cash flows for the years then ended, and the related notes (collectively, the consolidated financial statements). We also have audited the Companys internal control over financial reporting as of July 30, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of July 30, 2022 and July 31, 2021, and the results of its operations and its cash flows for the years then ended, in conformity with U.S. generally accepted accounting principles. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of July 30, 2022 based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nBasis for Opinions\nThe Companys management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys consolidated financial statements and an opinion on the Companys internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAssessment of indicators of impairment of long-lived assets\nAs discussed in Note 1 to the consolidated financial statements, the Company reviews its long-lived assets, such as property, equipment and fixtures and operating lease assets, for events or changes in circumstances that might indicate the carrying amount of an asset group may not be recoverable. The Companys judgment regarding the identification of impairment indicators is based, in part, on operational performance at the store level. Factors considered by the Company that could result in an impairment triggering event include a current period operating or cash flow loss, underperformance of a store relative to historical or expected operating results, and significant negative industry or economic trends. At July 30, 2022, the Company had property, equipment and fixtures, net and operating lease assets of $265,333 thousand and $293,295 thousand, respectively.\nWe identified the assessment of impairment triggering events related to long-lived assets as a critical audit matter. A high degree of auditor judgment was required to evaluate the Companys assessment of whether any of the following were indicators of impairment: (1) stores with current period operating or cash flow losses, (2) underperforming stores based on current period operating or cash flow results relative to their respective historical and expected results, and (3) negative industry or economic trends.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the Companys long-lived asset impairment process. This included a control related to the Companys assessment of impairment triggering events. We assessed the Companys identification and evaluation of potential impairment triggering events by:\ninspecting operating results and cash flows by store to identify stores with current period losses\ncomparing actual operating and cash flow results to historical results, expected results, industry and economic trends, and to the net book value of store assets for a selection of stores\nreading board of directors meeting minutes and available industry information.\n/s/ KPMG LLP\nWe have served as the Companys auditor since 1987.\nShort Hills, New Jersey\nOctober 13, 2022 ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nAs required by Rule 13a-15 of the Exchange Act, the Company carried out an evaluation of the effectiveness of the design and operation of the Companys disclosure controls and procedures at the end of the period covered by this report. This evaluation was carried out under the supervision, and with the participation, of the Companys management, including the Companys Chief Executive Officer along with the Companys Chief Financial Officer. Based upon that evaluation, the Companys Chief Executive Officer, along with the Companys Chief Financial Officer, concluded that the Companys disclosure controls and procedures are effective.\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in Company reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in Company reports filed under the Exchange Act is accumulated and communicated to management, including the Companys Chief Executive Officer and Chief Financial Officer as appropriate, to allow timely decisions regarding required disclosure.\nMANAGEMENTS REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. With the participation of the Chief Executive Officer and Chief Financial Officer, our management conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework and criteria established in Internal Control - Integrated Framework (2013), issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our management has concluded that the Companys internal control over financial reporting was effective as of July 30, 2022.\nThe Companys independent registered public accounting firm has audited the accompanying consolidated financial statements and the Companys internal control over financial reporting, as stated in their report, which is included in Item 8 of this Form 10-K.\nRobert P. Sumas John L. Van Orden\nChief Executive Officer Chief Financial Officer\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING\nThere have been no changes in the Companys internal control over financial reporting during the fourth quarter of fiscal 2022 that have materially affected, or are reasonably likely to materially affect, the Companys internal controls over financial reporting.\nPART III  ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item 10 is incorporated by reference from the Company's definitive Proxy Statement to be filed on or before November 1, 2022, in connection with its Annual Meeting scheduled to be held on December 16, 2022. ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this Item 11 is incorporated by reference from the Company's definitive Proxy Statement to be filed on or before November 1, 2022, in connection with its Annual Meeting scheduled to be held on December 16, 2022. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information in the table below is as of July 30, 2022. All data relates to the Village Super Market, Inc. 2010 and 2016 Stock Plans as described in Item 8 of this Form 10-K.\nPlan category Number of\nsecurities to\nbe issued\nupon exercise\nof outstanding\noptions Weighted-average\nexercise price\nof outstanding\noptions Number of\nsecurities\nremaining available\nfor future\nissuance\nunder equity\ncompensation\nplans (excluding\nsecurities reflected\nin column (a))\n(a) (b) (c)\nEquity compensation plans approved by security holders 97,000 $ 28.98 1,089,593\nEquity compensation plans not approved by security holders - - -\nAdditional information required by this Item 12 is incorporated by reference from the Company's definitive Proxy Statement to be filed on or before November 1, 2022, in connection with its annual meeting scheduled to be held on December 16, 2022. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item 13 is incorporated by reference from the Company's definitive Proxy Statement to be filed on or before November 1, 2022, in connection with its annual meeting scheduled to be held on December 16, 2022. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this Item 14 is incorporated by reference from the Companys definitive Proxy Statement to be filed on or before November 1, 2022, in connection with its annual meeting scheduled to be held on December 16, 2022.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENTS SCHEDULES\n(a)(1) Financial Statements:\nConsolidated Balance Sheets - July 30, 2022 and July 31, 2021\nConsolidated Statements of Operations - years ended July 30, 2022 and July 31, 2021\nConsolidated Statements of Comprehensive Income - years ended July 30, 2022 and July 31, 2021\nConsolidated Statements of Shareholders' Equity - years ended July 30, 2022 and July 31, 2021\nConsolidated Statements of Cash Flows - years ended July 30, 2022 and July 31, 2021\nNotes to consolidated financial statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 185)\n(a)(2) Financial Statement Schedules:\nAll schedules are omitted because they are not applicable, or not required, or because the required information is included in the consolidated financial statements or the notes hereto.\n(a)(3) Exhibits\n3.1 Certificate of Incorporation*\n3.2 By-laws*\n4.1 Credit Agreement dated May 6, 2020*\n4.2 First Amendment to Credit Agreement dated September 1, 2020*\n4.3 Amended and Restated Credit Agreement dated January 28, 2022*\n4.4 First Amendment to Amended and Restated Credit Agreement dated September 1, 2022\n4.5 Revolving Credit Note dated May 6, 2020*\n4.6 Revolving Amended and Restated Revolving Credit Note dated September 1, 2020*\n4.7 Joinder to Revolving Amended and Restated Revolving Credit Note dated September 1, 2020*\n4.8 Term Loan Note dated May 12, 2020*\n4.9 Joinder to Term Loan Note dated May 12, 2020*\n4.10 Converted Term Loan Note dated September 1, 2020*\n4.11 Joinder to Converted Term Loan Note dated September 1, 2020*\n4.12 Term Loan Note dated January 28, 2022*\n4.13 Term Loan Note dated September 1, 2022\n10.1 Wakefern By-Laws*\n10.2 Stockholders Agreement dated February 20, 1992 between the Company and Wakefern Food Corp.*\n10.7 Supplemental Executive Retirement Plan*\n10.8 2004 Stock Plan*\n10.9 2010 Stock Plan*\n10.10 2016 Stock Plan*\n10.11 42-Month Adjustable Rate Promissory Note*\n10.12 42-Month Adjustable Rate Promissory Note*\n10.13 60-Month Adjustable Rate Promissory Note*\n10.14 60-Month Adjustable Rate Promissory Note*\n10.15 60-Month Adjustable Rate Promissory Note*\n10.16 60-Month Adjustable Rate Promissory Note*\n10.17 60-Month Adjustable Rate Promissory Note*\n10.18 60-Month Adjustable Rate Promissory Note dated August 15, 2022\n10.19 60-Month Adjustable Rate Promissory Note dated August 15, 2022\n10.20 60-Month Adjustable Rate Promissory Note dated August 15, 2022\n10.21 60-Month Adjustable Rate Promissory Note dated September 28, 2022\n10.22 60-Month Adjustable Rate Promissory Note dated September 28, 2022\n10.23 60-Month Adjustable Rate Promissory Note dated September 28, 2022\n10.24 60-Month Adjustable Rate Promissory Note dated September 28, 2022\n10.25 60-Month Adjustable Rate Promissory Note dated September 28, 2022\n10.26 60-Month Adjustable Rate Promissory Note dated September 28, 2022\n14 Code of Ethics*\n21 Subsidiaries of Registrant\n23 Consent of Consent of Consent of KPMG LLP\n31.1 Certification\n31.2 Certification\n32.1 Certification (furnished, not filed)\n32.2 Certification (furnished, not filed)\n101 INS XBRL Instance Document*\n101 SCH XBRL Schema Document*\n101 CAL XBRL Calculation Linkbase Document*\n101 DEF XBRL Definition Linkbase Document*\n101 LAB XBRL Labels Linkbase Document*\n101 PRE XBRL Presentation Linkbase Document*\nThe XBRL related information in Exhibit 101 shall not be deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to liability of that section and shall not be incorporated by reference into any filing or other document pursuant to the Securities Act of 1933, as amended, except as shall be expressly set forth by specific reference in such filing or document.\n* The following exhibits are incorporated by reference from the following previous filings:\nForm 10-Q filed on March 10, 2022: 4.3, 4.7, 4.9, 4.11, 4.12\nForm 8-K filed on May 13, 2020: 4.1, 4.5, 4.8\nForm 8-K filed on September 8, 2020: 4.2, 4.6, 4.10\nForm 10-K for 2017: 3.1, 10.2, 10.15, 10.16, 10.17, 14\nDEF 14A Proxy Statement filed October 31, 2016: 10.10\nForm 10-K for 2014: 10.7\nForm 10-Q for April 2014: 10.11, 10.12, 10.13, 10.14\nForm 10-Q for April 2013: 10.1\nDEF 14A Proxy Statement filed November 1, 2010: 10.9\nForm 10-K for 2004: 3.2\nDEF 14A proxy statement filed October 25, 2004: 10.8\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nVILLAGE SUPER MARKET, INC.\nBy: /s/ Robert P. Sumas /s/ John Van Orden\nRobert P. Sumas John Van Orden\nChief Executive Officer Chief Financial Officer\nDate: October 13, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on dates indicated:\n/s/ Robert P. Sumas /s/ Kevin Begley\nRobert P. Sumas, Director Kevin Begley, Director\nOctober 13, 2022 October 13, 2022\n/s/ William Sumas /s/ Steven Crystal\nWilliam Sumas, Director Steven Crystal, Director\nOctober 13, 2022 October 13, 2022\n/s/ John P. Sumas /s/ Stephen Rooney\nJohn P. Sumas, Director Stephen Rooney, Director\nOctober 13, 2022 October 13, 2022\n/s/ John J. Sumas /s/ John L. Van Orden\nJohn J. Sumas, Director John L. Van Orden, Chief Financial Officer\nOctober 13, 2022 October 13, 2022\n/s/ Nicholas J. Sumas /s/ Luigi Perri\nNicholas J. Sumas, Director Luigi Perri, Controller (Principal Accounting Officer)\nOctober 13, 2022 October 13, 2022"
}