{
    "cik": "1045942",
    "company": "Track Group, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-20",
    "period_of_report": "2023-09-30",
    "sic": "3669",
    "state_of_inc": "DE",
    "state_location": "IL",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1045942/0001437749-23-034962-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1045942/000143774923034962/trkg20230930_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1045942/0001437749-23-034962.txt",
    "filename": "1045942_10K_2023_0001437749-23-034962.htm",
    "content": "Item 1. Business\nTrack Group, Inc., (the Company, we, us, and our), a Delaware corporation since 2016 and previously incorporated in 1995 as a Utah corporation, has its principal place of business at 200 E. 5th Avenue Suite 100, Naperville, Illinois 60563. Our telephone number is (877) 260-2010. We maintain a corporate website at www.trackgrp.com. Our common stock, par value $0.0001 per share (Common Stock), is currently listed for quotation on the OTCQB Venture Markets (OTCQB) under the symbol TRCK. Unless specified otherwise, as used in this Annual Report, references to Track Group, Inc. include the Company and its subsidiaries: Track Group Americas, Inc., a Utah corporation; Track Group - Puerto Rico, Inc., a Puerto Rico corporation; Emerge Monitoring, Inc., a Florida corporation; Emerge Monitoring II LLC, a Florida limited liability company; Integrated Monitoring Systems, LLC, a Colorado limited liability company; Track Group Chile S.p.A, a corporation formed under the laws of the Republic of Chile; Track Group Analytics Limited, a corporation formed under the laws of Canada; and Track Group International Ltd., a company formed under the laws of Israel (collectively, the Subsidiaries).\nCompany Background\nThe Company designs, manufactures, and markets location tracking devices and develops and sells a variety of related software, services, accessories, networking solutions, and monitoring applications. Our products and services include a full-range of one-piece GPS tracking devices, a device-agnostic operating system, a portfolio of software applications including smartphone, alcohol and predictive analytics, and a variety of accessory, service and support offerings. Our products and services are currently available worldwide and are sold through our direct sales force, as well as through value-added resellers. The Company sells to government customers on federal, state and local levels in the U.S. and to members of the Ministry of Justice (MOJ) internationally. Track Groups device-agnostic platform and expanded portfolio of integrated and complimentary monitoring-related services help reduce risk and make the administration of justice better, faster, and less expensive for taxpayers.\nBusiness Strategy\nWe are committed to helping our customers improve offender rehabilitation and re-socialization outcomes through our innovative hardware, software and services. We treat our business as a service business. Although we still manufacture patented tracking technology, we see the physical goods as only a small part of the integrated offender monitoring solutions we provide. Accordingly, rather than receiving a payment just for a piece of manufactured equipment, the Company receives a recurring stream of revenue for ongoing device agnostic subscription contracts. As part of our strategy, we continue to expand our device-agnostic platform to not only collect, but also store, analyze, assess and correlate location data for both accountability and auditing reasons, as well as to use for predictive analytics and assessment of effective and emerging techniques in criminal behavior and rehabilitation. We believe a high-quality customer experience along with knowledgeable salespeople who can convey the value of our products and services greatly enhances our ability to attract and retain customers. Therefore, our strategy also includes building and expanding our own direct sales force and our third-party distribution network to effectively reach more customers and provide them with a world-class sales and post-sales support experience. In addition, we are developing related-service offerings to address adjacent market opportunities in both the public and private sectors. We believe continual investment in research and development (R&D), including smartphone applications and other monitoring services is critical to the development and sale of innovative technologies and integrated solutions today and in the future.\nRecent Developments\nOn April 26, 2023, the Company and Conrent entered into an amendment to the facility agreement (the Amendment) originally executed by and between the parties on December 30, 2013 and amended multiple times (the Amended Facility Agreement). The latest Amendment: (i) extended the maturity date from July 1, 2024, to July 1, 2027; (ii) amended the applicable interest rate resulting in an escalating interest rate as follows: 4% through June 30, 2024, 5% through June 30, 2025, 5.5% through June 30, 2026, and 6% through the maturity date and (iii) removed section 7.3 Change of Control of the Amended Facility Agreement. In return, the Company agreed to pay certain fees to Conrent.\nProducts and Services\nDevices\nReliAlert®XC4\nReliAlert®XC4 is our flagship GPS device, which is among the safest and most reliable monitoring devices ever made. It is the only one-piece GPS device with patented 3-way voice communication to assist intervention efforts, now on the LTE network with increased battery life. This device includes on-board processing, secondary location technology, a 95db siren, embedded RF technology, anti-tampering capabilities, increased battery life and sleep mode.\nReliAlert®XC3\nAdvanced features enable agencies to effectively track offender movements and communicate directly with offenders in real-time, through a patented, on-board two/three-way voice communication technology. This device includes an enhanced GPS antenna and GPS module for higher sensitivity GPS, enhanced voice audio quality, increased battery performance of 50+ hours, 3G cellular capabilities, improved tamper sensory and durability enhancements.\nOperating System Software\nIntelliTrack\nIntelliTrack is a secure state of the art device-agnostic platform that provides the foundation for seamlessly and securely connecting devices, delivering trusted data to the cloud, with views of current or historical tracking provided by Google Maps® for use with predictive analytics.\nTrackerPAL®\nTrackerPAL® is a secure, cloud-based monitoring system that gives customers the ability to not only collect, but also store, analyze, assess and correlate offender data for both accountability and auditing reasons, as well as to use with predictive analytics applications and assess criminal behavior and rehabilitation opportunities.\nApplication Software\nIntelliTrack Mobile\nA mobile application of the IntelliTrack software is available for Android and iOS devices.\nTrackerPAL® Mobile\nA mobile application of the TrackerPAL® software is available for Android and iOS devices.\nData Analytics\nOur data analytics services help facilitate the discovery and communication of meaningful patterns in diverse location and behavioral data that helps agencies reduce risks and improve decision making. Our analytics applications use various combinations of statistical analysis procedures, data and text mining, and predictive modeling to proactively analyze information on community-released offenders to discover hidden relationships and patterns in their behaviors and to predict future outcomes.\nReal-Time Alcohol Monitoring\nBACtrack is the worlds first smartphone-based remote alcohol monitoring system. The award-winning BACtrack Mobile integrates a smartphone app and police-grade breathalyzer branded for the Company to bring blood-alcohol content (BAC) wirelessly to a mobile device. We can quickly and easily estimate an enrollees BAC and track the results over time. The smartphone monitoring application allows supervisors to send scheduled or random notifications to enrollees to take BAC tests, providing photo/location-verified and time stamped results. It also includes an onboard calendar, reminding an enrollee of court dates, testing dates, medications to take, mandatory events to attend, and other matters.\nEmpower\nOur Empower Smartphone Application provides victim and survivor support by creating a mobile geo-zone around a survivor of domestic abuse and communicates with the offenders tracking device - providing an early-warning notification to the survivor if he or she is in proximity of the offender or group of offenders.\nSocrates\nSocrates 360 is a multipurpose platform offering a wide range of content and services to people as they return to the community. The user-centric customizable capabilities include educational courses, health and wellbeing advice, secure video conferencing, access to local services, event scheduling, appointment reminders, and check-ins based on the individuals needs.\nAccessories\nSecureCuff®\nThe SecureCuff® is a patented, optional accessory available exclusively for ReliAlert® and is the only uncuttable strap in the industry specifically made for high-risk offenders. SecureCuff® has encased, hardened steel bands that provide extreme cut-resistance and includes the same fiber-optic technology as the standard strap for tampering notification.\nRF Beacon™\nThe RF Beacon™ is a completely self-contained, short-range transmitting station that provides a Radio Frequency (RF) signal communicating with assigned offender GPS devices to increase the ability to maintain critical offender location information and provide agencies with an effective way to more accurately tether an offender to a specific location.\nProduct Support and Services\nMonitoring Centers\nOur monitoring centers provide live 24/7/365 monitoring of all alarms generated from our devices, as well as customer and technical support. Our monitoring center operators play a vital role, and as such, are staffed with highly trained, bilingual individuals. These operators act as an extension of agency resources receiving alarms, communicating and intervening with offenders regarding violations and interacting with supervision staff, all pursuant to agency-established protocols. The facilities have redundant power sources, battery backup and triple redundancy in voice, data and IP. We have assisted in the establishment of monitoring centers for customers and local partners in the United States, Chile and other global locations.\nCustomer Care\nWe offer a range of support options for our customers. These include assistance that is built into software products, printed and electronic product manuals, in-person training, online support including comprehensive product information, as well as technical assistance.\nResearch and Development Program\nDuring the fiscal year ended September 30, 2023 (Fiscal 2023), we incurred research and development expenses of $2,735,060, as compared to $2,432,448 recognized during the fiscal year ended September 30, 2022 (Fiscal 2022). The $302,612 increase in research and development was largely due to higher wages and payroll taxes of $298,846. The Company has now significantly enhanced its technology platform to improve the efficiency of its software, firmware, user interface, and automation and invested considerable time in developing a new device expected to be completed in calendar 2024. As a result of these improvements, $1,020,604 and $865,263 was capitalized as developed technology, in accordance with the accounting guidance for internal-use software, during Fiscal 2023 and Fiscal 2022, respectively.\nCompetition\nThe markets for our products and services are highly competitive and we are confronted by aggressive competition in all areas of our business. These markets are characterized by frequent product introductions and technological advances. Our competitors selling tracking devices have aggressively cut prices and lowered their product margins to gain or maintain market share. Our financial condition and operating results could be adversely affected by these and other industry-wide downward pressures on gross margins. Principal competitive factors important to us include price, product features, relative price/performance, product quality and reliability, design innovation, a strong software ecosystem, service and support, and corporate reputation.\nOur specific competitors vary from market to market and we compete against other international, national and regional companies, some of whom use local partners that may have more knowledge of the local markets and the government decision-making process. Some of our competitors are owned by large public companies with broader resources, while others are backed by private equity firms with large funds, or in some cases, work as part of a consortium with extensive international experience. We expect competition in these markets to intensify as competitors attempt to imitate some of the features of our products and applications within their own products or, alternatively, collaborate with third-party providers to offer solutions that are more competitive than those they currently offer.\nCompetitive Strengths\nRelationships with High-Quality Government Customers. We have developed strong relationships with federal, state and county customers within the United States and with Ministries of Justice internationally and managed to bring in new, sizable customers in the past year.\nIndustry Leading Analytics Software. Our software remains a leader with fully functioning, revenue-generating analytics on the market today, specifically designed for the offender monitoring market. State departments of corrections, county probation agencies and sheriffs offices have utilized this solution for multiple years.\nDevice Agnostic Software Platform. Our software platform is device agnostic and currently accommodates offender monitoring with new products that we introduce, integrates with case management software utilized by sheriff, probation and pre-trial departments, and supports devices manufactured by competitors.\nSmartphone Monitoring Pioneers in Criminal Justice. Todays prison system incarcerates too many individuals who pose little threat to public safety, at far too great a cost. They serve their sentences in overcrowded, outdated institutions that expose them to hardened criminals. Upon release, their opportunities and lives have changed forever. Now, low-risk offender populations can serve their sentences virtually, holding jobs and taking care of family members, yet still feeling the weight of their punishment while seeing a clear path to avoiding trouble in the future. Further, taxpayers gain a clear cost advantage. To date, we have developed apps targeting alcohol monitoring, domestic violence and our core monitoring platform.\nExperienced Senior Management Team. Our top executives have extensive experience in both the offender monitoring marketplace and their specific fields of expertise, whether that be sales, customer care and/or technology. We also benefit from a diverse and experienced Board of Directors.\nRecurring Revenue. Our revenue is generated in large part by long-term customer contracts based on the size of the offender monitoring program throughout each month, which creates a predictable, recurring revenue stream.\nExtensive Product Suite. We have a large variety of products that appeal to a broad range of government customers and greatly enhance our ability to attract and retain clients. These products include different GPS devices, alcohol monitoring devices and applications, and new smartphone applications including those that address adjacent market opportunities in both the public and private sectors and analytics software.\nNational Footprint with International Presence. We operate in approximately 40 states (including Washington DC and Puerto Rico) as well as select international locations, including Chile, and Saudi Arabia and Bahamas. Our presence both within the United States and abroad better positions us to compete for new and expiring government contracts.\nSources and Availability of Raw Materials\nWe use various suppliers and contract manufacturers to supply parts and components for the manufacture and support of our product lines. Although our intention is to establish at least two sources of supply for materials whenever possible, for certain components we have sole or limited source supply arrangements. We may not be able to procure these components from alternative sources at acceptable prices and quality within a reasonable time, or at all; therefore, the risk of loss or interruption of such arrangements could impact our ability to deliver certain products on a timely basis.\nThe industry in which the Company operates continues to be impacted by the global semiconductor shortage initially caused by the slowdown of many chip makers and logistics companies due to COVID-19. However, the issues have lessened significantly and the Company has been able to purchase most components within reasonable lead times. See Item 1A. Risk Factors\nOur business is subject to significant risks. You should carefully consider the risks described below and the other information in this Annual Report, including our financial statements and related notes, before you decide to invest in our Common Stock. If any of the following risks or uncertainties actually occur, our business, results of operations or financial condition could be materially harmed, the trading price of our Common Stock could decline and you could lose all or part of your investment. The risks and uncertainties described below are those that we currently believe may materially affect us; however, they may not be the only ones that we face. Additional risks and uncertainties of which we are unaware or currently deem immaterial may also become important factors that may harm our business. Except as required by law, we undertake no obligations to update any risk factors.\nRisks Related to Our Business, Operations and Industry\nWe face risks related to our substantial indebtedness, including risk related to the repayment of our indebtedness.\nAs of September 30, 2023, excluding deferred financing costs, we had $43,247,660 of indebtedness outstanding, of which $322,915 becomes due and payable within the next 12 months, $60,745 matures in 2025, $0 matures in 2026 and $42,864,000 matures in 2027. We have $438,165 of interest accrued at September 30, 2023 related to our outstanding indebtedness. Our significant indebtedness could adversely affect our ability to raise additional capital to fund our operations, make interest payments as they come due, limit our ability to react to changes in the economy or our industry, and prevent us from meeting our obligations under our outstanding debt instruments. See Recent Developments and Note 7 to the Consolidated Financial Statements.\nOur high degree of leverage could have adverse consequences to us, including:\n●\nmaking it more difficult for us to make payments on our debt;\n●\nincreasing our vulnerability to general economic and industry conditions;\n●\nrequiring a substantial portion of cash flow from operations to be dedicated to the payment of principal and interest on our debt, thereby reducing our ability to use our cash flow to fund our operations, capital expenditures, and future business opportunities;\n●\nrestricting us from making strategic acquisitions or causing us to make non-strategic divestitures;\n●\nlimiting our ability to obtain additional financing for working capital, capital expenditures, product development, debt service requirements, acquisitions, and general corporate or other purposes; and\n●\nlimiting our ability to adjust to changing market conditions and placing us at a competitive disadvantage compared to our competitors who may be less highly leveraged.\nWe may not be able to generate sufficient cash to service all of our indebtedness and may be forced to take other actions to satisfy our obligations under our indebtedness, which may not be successful.\nOur ability to make scheduled payments or to refinance our debt obligations depends on our financial condition and operating performance, which are subject to prevailing economic and competitive conditions and to certain financial, business and other factors beyond our control. While we are currently reviewing all options regarding our indebtedness, no assurances can be given that we will be successful in refinancing, extending or restructuring the debt, and we cannot assure you that we will maintain a level of cash flows sufficient to permit us to pay the principal, premium, if any, and interest on our indebtedness.\nIf our cash flows and capital resources are insufficient to fund our debt service obligations, we may be forced to reduce or delay investments and capital expenditures, sell assets, seek additional capital, or restructure or refinance our indebtedness.\nThese alternative measures may not be successful and may not permit us to meet our scheduled debt service obligations. In the absence of such operating results and resources, we could face substantial liquidity difficulties and might be required to dispose of material assets or operations to meet our debt service and other obligations. We may not be able to consummate those dispositions or the proceeds that we realize from them may not be adequate to meet the debt service obligations then due.\nThere is no certainty that the market will continue to accept or expand the use of our products and services.\nOur targeted markets may be slow to, or may never, expand the use of our products or services. Governmental organizations may not use our products unless they determine, based on experience, advertising or other factors, that our products are a preferable alternative to other available methods of tracking or incarceration. In addition, decisions to adopt new tracking devices can be influenced by government administrators, regulatory factors, and other factors largely outside of our control. No assurance can be given that key decision-makers will continue to accept or expand the use of our products, and if they do not, it could have a material adverse effect on our business, financial condition and results of operations.\nBudgetary issues faced by government agencies could adversely impact our future revenue.\nOur revenue is primarily derived from contracts with state, local and county government agencies in the United States and governments of Caribbean and Latin American nations. Many of these government agencies are experiencing budget deficits and may continue to do so. As a result, we may experience delays in payment on customer invoices, the amount spent by our current clients on equipment and services that we supply may be reduced or grow at rates slower than anticipated, and it may be more difficult to attract additional government clients. In light of the recent hurricanes, and the destruction sustained by many Caribbean countries, this is of increasing risk. Furthermore, the industry has experienced a general decline in average daily lease rates for GPS tracking devices. As a result of these factors, our ability to maintain or increase our revenue may be negatively affected.\nWe rely on significant suppliers for key products and cellular access. If we do not renew these agreements when they expire, we may not continue to have access to these suppliers products or services at favorable prices or in volumes as we have in the past, which could adversely affect our results of operations or financial condition.\nWe have entered into agreements with several national providers for cellular services. We also currently rely on a single source for the large majority of the manufacturing of our devices. If any of these significant suppliers were to cease providing products or services to us, we would be required to seek alternative sources. No assurances can be given that alternate sources could be located or that the delay or additional expense associated with locating alternative sources for these products or services would not materially and adversely affect our business and financial condition.\nOur research, development, marketing and export activities are subject to government regulations. The cost of compliance or the failure to comply with these regulations could adversely affect our business, results of operations and financial condition.\nThere can be no assurance that changes in the legal or regulatory framework or other subsequent developments will not result in limitation, suspension or revocation of regulatory approvals granted to us. Any such events, were they to occur, could have a material adverse effect on our business, financial condition and results of operations. We are required to comply with regulations for manufacturing and export practices, which mandate procedures for extensive control and documentation of product design, control and validation of the manufacturing process and overall product quality. If we, our management, or our third-party manufacturers fail to comply with applicable regulations regarding these manufacturing practices, we could be subject to a number of sanctions, including fines, injunctions, civil penalties, delays, suspensions or withdrawals of market approval, seizures or recalls of product, operating restrictions and in some cases, criminal prosecutions.\nWe face intense competition, including competition from entities that are more established and may have greater financial resources than we do, which may make it difficult for us to establish and maintain a viable market presence.\nOur current and expected markets are rapidly changing. Although we believe our technology has advantages over competing systems, there can be no assurance that those advantages are significant. Many of our competitors have products or techniques approved or in development and operate large, well-funded research and development programs in the field. Moreover, competitors may be in the process of developing technology that could be developed more quickly or ultimately be more effective than our products. There can be no assurance that our competitors will not develop more effective or more affordable products or achieve earlier patent protection or product commercialization.\nWe are dependent upon certain customers, the loss of which may adversely affect our results of operations and business condition.\nDuring Fiscal 2023, our two top customers accounted for an aggregate of 31% of total sales. See Note 2 to the Consolidated Financial Statements. In the event any of our top customers were to terminate their agreements with the Company, our results of operations and financial condition may be adversely affected.\nOur business plan is subject to the risks of technological uncertainty, which may result in our products failing to be competitive or readily accepted by our target markets.\nThere can be no assurance that our research and development efforts will be successful. In addition, the technology that we integrate or that we may expect to integrate with our product and service offerings is rapidly changing and developing. We face risks associated with the possibility that our technology may not function as intended and the possible obsolescence of our technology and the risks of delay in the further development of our own technologies. Cellular coverage is not uniform throughout our current and targeted markets. GPS technology depends upon line-of-sight access to satellite signals used to locate the user, which, under some circumstances, may limit the effectiveness of GPS tracking. In addition, the telecommunications industry continually updates its networks and technology which then requires the Company to update its devices to ensure compatibility with the new networks as is happening with the phase out of 3G cellular networks in the US.\nWe face risks of litigation and regulatory investigation and actions in connection with our operations.\nLawsuits, including regulatory actions, may seek recovery of large, indeterminate amounts or otherwise limit our operations, and their existence and magnitude may remain unknown for substantial periods of time. Relevant authorities in the markets in which we operate may investigate us in the future. These investigations may result in significant penalties in multiple jurisdictions, and we may become involved in disputes with private parties seeking compensation for damages resulting from the relevant violations. Such legal liability or regulatory action could have a material adverse effect on our business, results of operations, financial condition, cash flows, reputation and credibility. In addition, our business activities are subject to various governmental regulations in countries where we operate, which include investment approvals, export regulations, tariffs, antitrust, anti-bribery, intellectual property, consumer and business taxation, foreign trade, exchange controls, and environmental and recycling requirements. These regulations limit, and other new or amended regulations may further limit, our business activities or increase operating costs. In addition, the enforcement of such regulations, including the imposition of fines or surcharges for violation of such regulations, may adversely affect our results of operations, financial condition, cash flows, reputation and credibility.\nOur products are subject to the risks and uncertainties associated with the protection of intellectual property and related proprietary rights.\nWe believe that our success depends in part on our ability to obtain and enforce patents, maintain trade secrets and operate without infringing on the proprietary rights of others, both in the United States and in other countries. Our inability to obtain or to maintain patents on our key products could adversely affect our business. We currently own 21 patents issued and have filed and may file additional patent applications in the United States and in key foreign jurisdictions relating to our technologies, improvements to those technologies, and for specific products we may develop. There can be no assurance that patents will issue on any of these applications or that, if issued, any patents will not be challenged, invalidated or circumvented. The enforcement of patent rights can be uncertain and involves complex legal and factual questions. The scope and enforceability of patent claims are not systematically predictable with absolute accuracy. The strength of our own patent rights depends, in part, upon the breadth and scope of protection provided by the patent and the validity of our patents, if any.\nOur success will also depend, in part, on our ability to avoid infringing the patent rights of others. We must also avoid any material breach of technology licenses we may enter into with respect to our new products and services. Existing patent and license rights may require us to alter the designs of our products or processes, obtain licenses or cease certain activities. If patents have been issued to others that contain competitive or conflicting claims and such claims are ultimately determined to be valid and superior to our own, we may be required to obtain licenses to those patents or to develop or obtain alternative technology. If any licenses are required, there can be no assurance given that we will be able to obtain any necessary licenses on commercially favorable terms, if at all. Any breach of an existing license or failure to obtain a license to any technology that may be necessary in order to commercialize our products may have a material adverse impact on our business, results of operations and financial condition.\nWe also rely on trade secrets laws to protect portions of our technology for which patent protection has not yet been pursued or is not believed to be appropriate or obtainable. These laws may protect us against the unlawful or unpermitted disclosure of any information of a confidential and proprietary nature, including but not limited to our know-how, trade secrets, methods of operation, names and information relating to vendors or suppliers, and customer names and addresses. We seek to protect this un-patentable and unpatented proprietary technology and processes, in addition to other confidential and proprietary information in part, by entering into confidentiality agreements with employees, collaborative partners, consultants, and certain contractors. There can be no assurance that these agreements will not be breached, that we will have adequate remedies for any breach, or that our trade secrets and other confidential and proprietary information will not otherwise become known or be independently discovered or reverse-engineered by competitors.\nWe conduct business internationally with a variety of sovereign governments.\nOur business is subject to a variety of regulations and political interests that could affect the timing of payment for services and the duration of our contracts. We face the risk of systems interruptions and capacity constraints, possibly resulting in adverse publicity, revenue loss and erosion of customer trust. The satisfactory performance, reliability and availability of our network infrastructure are critical to our reputation and our ability to attract and retain customers and to maintain adequate customer service levels. In addition, because our customers in these foreign jurisdictions are sovereign governments or governmental departments or agencies, it may be difficult for us to enforce our agreements with them in the event of a breach of those agreements, including, but not limited to, the failure to pay for services rendered or to complete projects that we have commenced.\nWeakened global economic conditions may adversely affect our industry, business and results of operations.\nThe rate at which our customers purchase new or enhanced services depends on several factors, including general economic conditions in the US and abroad. These factors include overall business and consumer demand for a variety of goods and services, credit availability, interest rates, inflation rates, corporate profitability, equity and foreign exchange markets, the number of bankruptcies, and overall uncertainty with respect to the economy. The trends and volatility of these economic factors will determine the stability and predictability of economic and market conditions. These conditions will affect the rate of information technology and government spending and could adversely affect our customers ability or willingness to purchase our services, delay prospective customers purchasing decisions, reduce the value or duration of their contracts or affect renewal rates, all of which could adversely affect our operating results.\nOur business is subject to risks arising from epidemic diseases, such as the recent global outbreak of the COVID-19 coronavirus.\nThe COVID-19 pandemic has impacted worldwide economic activity. A pandemic, including COVID-19 or another public health epidemic, poses the risk that we or our employees, contractors, suppliers, and other partners may be prevented from conducting business activities for an indefinite period of time, including shutdowns that may be requested or mandated by governmental authorities. While it is not possible at this time to estimate the impact that COVID-19 had, or could have, on our business, the COVID-19 pandemic and mitigation measures have had and may continue to have an adverse impact on global economic conditions which could have an adverse effect on our business and financial condition, including impairing our ability to raise capital when needed. In addition, for a period of time we were under a shelter-in-place mandate which may be reinstated at the discretion of state or local authorities and many of our clients worldwide may be similarly impacted.\nClimate change, and related legislative and regulatory responses to climate change, may adversely impact our business.\nThere is increasing concern that a gradual rise in global average temperatures due to increased concentration of carbon dioxide and other greenhouse gases in the atmosphere will cause significant changes in weather patterns around the globe, an increase in the frequency, severity, and duration of extreme weather conditions and natural disasters, and water scarcity and poor water quality. These events could adversely impact the delivery of raw materials required for our products, disrupt the operation of our supply chain and the productivity of our contract manufacturers, increase our production costs, impose capacity restraints and impact the purchases of our products and services. These events could also compound adverse economic conditions and impact consumer confidence and governmental budgets. As a result, the effects of climate change could have a long-term adverse impact on our business and results of operations. In many countries, governmental bodies are enacting new or additional legislation and regulations to reduce or mitigate the potential impacts of climate change. If we, our suppliers, or our contract manufacturers are required to comply with these laws and regulations, or if we choose to take voluntary steps to reduce or mitigate our impact on climate change, we may experience increased costs for energy, production, transportation, and raw materials, increased capital expenditures, or increased insurance premiums and deductibles, which could adversely impact our operations. Inconsistency of legislation and regulations among jurisdictions may also affect the costs of compliance with such laws and regulations. Any assessment of the potential impact of future climate change legislation, regulations or industry standards, as well as any international treaties and accords, is uncertain given the wide scope of potential regulatory change in the countries in which we operate.\nOur results of operations can be adversely affected by labor shortages, turnover and labor cost increases.\nLabor is a component of operating our business. A number of factors may adversely affect the labor force available to us or increase labor costs from time to time, including high employment levels, federal unemployment subsidies, and other government regulations. Although we have not experienced any material disruptions due to labor shortages to date, we have observed an overall tightening and increasingly competitive labor market. A sustained labor shortage or increased turnover rates within our employee base, could lead to increased costs, such as increased overtime to meet demand and increased wage rates to attract and retain employees, and could negatively affect our ability to complete our construction projects according to the required schedule or otherwise efficiently operate our business. If we are unable to hire and retain employees capable of performing at a high level, or if mitigation measures we may take to respond to a decrease in labor availability, such as overtime and third-party outsourcing, have unintended negative effects, our business could be adversely affected.\nAdditionally, our operations are subject to a variety of federal, state and local employment-related laws and regulations, including, but not limited to, the U.S. Fair Labor Standards Act, which governs such matters as minimum wages, the Family Medical Leave Act, overtime pay, compensable time, recordkeeping and other working conditions, Title VII of the Civil Rights Act, the Employee Retirement Income Security Act, the Americans with Disabilities Act, the National Labor Relations Act, regulations of the Equal Employment Opportunity Commission, regulations of the Office of Civil Rights, regulations of the Department of Labor, regulations of state attorneys general, federal and state wage and hour laws, and a variety of similar laws enacted by the federal and state governments that govern these and other employment-related matters. As our employees are located in a number of states, compliance with these evolving federal, state and local laws and regulations, including increases in federal or state minimum wage laws, could substantially increase our cost of doing business while failure to do so could subject us to fines and lawsuits.\nAn overall labor shortage, lack of skilled labor, increased turnover or labor inflation, increase in federal or state minimum wages, or increase in general labor costs, caused by prolonged COVID-19 or as a result of general macroeconomic factors, could have a material adverse impact on our operations, results of operations, liquidity or cash flows.\nThe global semiconductor shortage could impact the Companys future results.\nThe industry in which the Company operates, as well as many other industries (automotive, consumer products and medical devices), have been impacted by the global semiconductor shortage initially caused by the slowdown of many chip makers and logistics companies due to COVID-19. However, the issues have lessened significantly and the Company has been able to purchase most components within reasonable lead times.\nWe may experience temporary service interruptions for a variety of reasons, including telecommunications or power failures, fire, water damage, vandalism, civil unrest, computer bugs or viruses, malicious cyber-attacks or hardware failures.\nAny service interruption that results in the unavailability of our system or reduces its capacity could result in real or perceived public safety issues that may affect customer confidence in our services. Historically, we have experienced temporary interruptions of telecommunications or power outages, which were eventually mitigated, although our customer in Puerto Rico was again disrupted by another strong storm (Hurricane Fiona) which hit the island in September 2022. Such instances may result in the slowdown or loss of customer accounts or similar problems if they occur again in the future. Given rapidly changing technologies, we are not certain that we will be able to adapt the use of our services to permit, upgrade, and expand our systems or to integrate smoothly with new technologies. Network and information systems and other technologies are critical to our business activities. Network and information systems-related events, including those caused by us, our service providers or by third parties, such as computer hacking, cyber-attacks, computer viruses, or other destructive or disruptive software, process breakdowns, denial of service attacks, malicious social engineering or other malicious activities, or any combination of the foregoing could result in a degradation or disruption of our services. These types of events could result in a loss of customers and large expenditures to repair or replace the damaged properties, networks or information systems or to protect them from similar events.\nWe currently have one independent director sitting on our Board of Directors.\nOur Board of Directors is currently comprised of two members, one of which would not be considered independent under the rules of the Nasdaq Capital Market and the OTC Markets. Additionally, we no longer maintain separate audit, compensation or nominating and governance committees, the duties of which are fulfilled by our entire Board of Directors. The rules of the OTC Markets require that companies whose securities are listed for quotation on the OTCQB maintain certain public float percentages and a minimum bid price for the Companys shares. In the event that we fail to meet these standards, our Common Stock would no longer be eligible for quotation on the OTCQB, resulting in the quotation of our Common Stock on an alternative market, such as the OTC Pink Open Market. Such change may affect the number and type of investors eligible to purchase our Common Stock. As a result, the price of our Common Stock may be adversely affected.\nRisks Related to Acquisitions\nThe success of our business depends on achieving our strategic objectives, including acquisitions, dispositions and restructurings.\nOur acquisitions, as well as potential restructuring actions, may not achieve expected returns and other benefits as a result of various factors, including integration and collaboration challenges, such as personnel and technology. In addition, we may not achieve anticipated cost savings from restructuring actions, which could result in lower operating margins. If we decide to sell assets or a business, we may encounter difficulty in finding buyers or alternative exit strategies on acceptable terms in a timely manner, which could delay the accomplishment of our strategic objectives. After reaching an agreement with a buyer or seller for the acquisition or disposition of a business, we are subject to satisfaction of pre-closing conditions as well as to necessary regulatory and governmental approvals on acceptable terms, which may prevent us from completing the transaction.\nWe may not be able to grow successfully through our recent acquisitions or through future acquisitions, we may not successfully manage future growth, and we may not be able to effectively integrate businesses that we may acquire.\nWe plan to continue to grow organically as well as through strategic acquisitions of other businesses. In order to complete acquisitions, we would expect to require additional debt and/or equity financing, which may increase our interest expense, leverage, and the number of shares of our Common Stock or other securities outstanding. Businesses that we acquire may not perform as expected. Future revenue, profits and cash flows of an acquired business may not materialize due to the failure or inability to capture expected synergies, increased competition, regulatory issues, changes in market conditions, or other factors beyond our control. In addition, we may not be successful in integrating these acquisitions into our existing operations. Competition for acquisition opportunities may escalate, increasing our cost of making further acquisitions or causing us to refrain from making additional acquisitions. Additional risks related to acquisitions include, but are not limited to:\n●\nthe potential disruption of our existing business;\n●\nentering new markets or industries in which we have limited prior experience;\n●\ndifficulties integrating and retaining key management, sales, research and development, production and other personnel or diversion of management attention from ongoing business concerns to integration matters;\n●\ndifficulties integrating or expanding information technology systems and other business processes or administrative infrastructures to accommodate the acquired businesses;\n●\ncomplexities associated with managing the combined businesses due to multiple physical locations;\n●\nrisks associated with integrating financial reporting and internal control systems; and\n●\nwhether any necessary additional debt or equity financing will be available on terms acceptable to us, or at all, and the impact of such financing on our operating performance and results of operations.\nRisks Related to International Operations\nWe are exposed to fluctuations in currency exchange rates.\nOur financial results are reported in U.S. dollars, but operations are conducted internationally. Currency exchange rates have, and may continue to have, a significant impact on our operating results. We utilize limited hedging techniques to minimize our exposure. As a result, an investment in our Common Stock may expose stockholders to fluctuations in exchange rates.\nThe dollar cost of our operations internationally could increase as a result of increases or decreases in the rate of inflation or devaluation of the local currency in relation to the dollar, which may harm our results of operations.\nThe dollar cost of our international operations is expected to be influenced by any increase in inflation that is not offset by the devaluation of the local currency in relation to the dollar. As a result, we are exposed to the risk that foreign currencies will appreciate in relation to the dollar. We cannot predict whether the foreign currencies will appreciate or depreciate against the dollar in the future.\nInternational political, economic and military instability may impede our ability to execute our plan of operations.\nPolitical, economic and military conditions, both domestic and abroad, may affect our business. We cannot predict whether or in what manner these problems may occur. Acts of random terrorism periodically occur, which could affect our operations or personnel. Ongoing or revived hostilities or other factors could harm our operations and could impede our ability to execute our plan of operations. Natural disasters, such as the hurricanes in the Caribbean or Florida, could render our affected customers financially unable to continue making payments or using our services. Moreover, in order to effectively compete in certain foreign jurisdictions, it is frequently necessary or required to establish joint ventures, strategic alliances or marketing arrangements with local operators, partners or agents. Reliance on local operators, partners or agents could expose us to the risk of being unable to control the scope or quality of our overseas services or products. In addition, our business insurance may not cover losses that may occur as a result of events associated with the security situation. Any losses or damages incurred by us could have a material adverse effect on our business and financial condition.\nRisks Related to Our Common Stock\nCertain individuals and groups own or control a significant number of our outstanding shares.\nCertain groups or persons, and in particular ETS Limited, who owned approximately 41% of our issued and outstanding Common Stock as of December 1, 2023, beneficially own a substantial number of shares of our outstanding Common Stock or securities and debt instruments. As a result, these persons have the ability, acting as a group, to influence substantially our affairs and business, including the election of our directors and subject to certain limitations, of fundamental corporate transactions. This concentration of ownership may also have the effect of delaying or preventing a change of control or making other transactions more difficult or impossible without their support. In addition, these equity holders may have an interest in pursuing acquisitions, divestitures, financing or other transactions that, in their judgment, could enhance their equity investments, even though such transactions may involve significant risk to us or our other stockholders. Additionally, they may make investments in businesses that directly or indirectly compete with us, or may pursue acquisition opportunities that may be complementary to our business and as a result, those acquisition opportunities may not be available to us.\nSales by certain of our stockholders of a substantial number of shares of our Common Stock in the public market could adversely affect the market price of our Common Stock.\nA large number of outstanding shares of our Common Stock are held by several of our principal stockholders. If any of these principal stockholders were to decide to sell large amounts of Common Stock over a short period of time, such sales could cause the market price of our Common Stock to decline.\nA decline in the price of our Common Stock could affect our ability to raise additional working capital and adversely impact our operations and would severely dilute existing or future investors if we were to raise funds at lower prices.\nA prolonged decline in the price of our Common Stock could result in a reduction of our ability to raise capital. Because our operations have been financed in part through the sale of equity securities, a decline in the price of our Common Stock could be especially detrimental to our continued operations. Any reduction in our ability to raise equity capital in the future would force us to reallocate funds from other planned uses and would have a significant negative effect on our business plans and operations, including our ability to develop new products and continue our current operations. If our stock price declines, there can be no assurance that we can raise additional capital or generate funds from operations sufficient to meet our obligations. We believe the following factors could cause the market price of our Common Stock to fluctuate widely:\n●\nactual or anticipated variations in our interim or annual results;\n●\nannouncements of new services, products, acquisitions or strategic relationships within the industry;\n●\nchanges in accounting treatments or principles;\n●\nchanges in earnings estimates by securities analysts and in analyst recommendations; and\n●\ngeneral political, economic, regulatory and market conditions.\nAny failure to meet these expectations, even if minor, could materially adversely affect the market price of our Common Stock.\nIf we issue additional shares of Common Stock in the future, it will result in the dilution of our existing stockholders.\nOur Certificate of Incorporation authorizes the issuance of 30,000,000 shares of Common Stock. Our Board of Directors has the authority to issue additional shares of Common Stock up to the authorized capital stated in the Certificate of Incorporation. The issuance of any such shares of Common Stock will result in a reduction in value of our outstanding Common Stock. If we do issue any such additional shares of Common Stock, such issuance also will cause a reduction in the proportionate ownership and voting power of all other stockholders. Further, any such issuance may result in a change of control of the Company.\nOur Board of Directors may authorize the issuance of preferred stock and designate rights and preferences that will dilute the ownership and voting interests of existing stockholders without their approval.\nOur Certificate of Incorporation authorizes us to issue up to 20,000,000 shares of preferred stock, par value $0.0001 per share (Preferred Stock), of which 1,200,000 shares have been designated as Series A Convertible Preferred Stock (Series A Preferred). Our Board of Directors is authorized to designate, and to determine the rights and preferences of any series or class of Preferred Stock, and may designate additional shares of Preferred Stock in the future. The Board of Directors may, without stockholder approval, issue shares of Preferred Stock with dividend, liquidation, conversion, voting or other rights which are senior to our Common Stock or which could adversely affect the voting power or other rights of the existing holders of outstanding shares of Preferred Stock or Common Stock. Additionally, the issuance of Preferred Stock may have the effect of decreasing the market price of the Common Stock and reduce the likelihood that holders of Common Stock will receive dividend payments and payments upon liquidation. The issuance of shares of Preferred Stock may also adversely affect an acquisition or change in control of the Company. As of December 1, 2023, there were no outstanding shares of Series A Preferred issued and outstanding.\nTrading of our Common Stock may be volatile and sporadic, which could depress the market price of our Common Stock and make it difficult for our stockholders to resell their shares.\nThere is currently a limited market for our Common Stock and the volume of our Common Stock traded on any day may vary significantly from one day to the other. Our Common Stock is quoted on the OTCQB. Trading in stock quoted on the OTCQB can be volatile, and characterized by wide fluctuations in trading prices, due to many factors that may have little to do with the issuers operations, results or business prospects. The availability of buyers and sellers represented by this volatility could lead to a market price for our Common Stock that is unrelated to operating performance. Moreover, trading of securities quoted on the OTCQB can be more volatile than the trading of securities listed on a stock exchange like NASDAQ or NYSE.  Item 2. Properties\nOur headquarters is approximately 5,600 square feet of commercial office space located at 200 E. 5th Avenue Suite 100, Naperville, Illinois. The lease for this office space began on September 1, 2017 and expired on August 31, 2022, at which time the lease was extended for another five years. Base rent and common area maintenance payments are approximately $11,000 per month.\nWe lease commercial office space in Indianapolis, Indiana of approximately 5,751 square feet. This lease began on September 1, 2018 and terminated on August 31, 2022. The Company leased the same property for the period September 1, 2022 through August 31, 2024. Base rent and common area maintenance payments are approximately $8,000 per month.\nThe operations of Track Group Analytics Limited were conducted in approximately 1,157 square feet of office space in Bedford, Nova Scotia, Canada. The lease for this office space began on July 1, 2020 and terminated on June 30, 2022 with monthly lease payments of approximately $2,000. Track Group Analytics is now paying approximately $500 per month to use a co-working business center on a month-to-month basis.\nAt September 30, 2023, the operations of Track Group Chile S.p.A. were conducted in approximately 2,200 square feet of commercial office space and storage facilities located in Santiago, Chile with base rent and common area maintenance payments of approximately $4,100 per month. The lease for this space is scheduled to end on September 30, 2024 and contains an automatic annual renewal.\nWe lease commercial office space in Sandy, Utah of approximately 1,500 square feet. The lease for this office space began on September 1, 2017 and expired on August 31, 2018. We are currently leasing this property on a month-to-month basis. Lease payments are $1,500 per month. Item 3. Legal Proceedings\nThe Company is, from time to time, involved in various legal proceedings incidental to the conduct of our business. Historically, the outcome of nearly all such legal proceedings has not, in the aggregate, had a material adverse effect on our business, financial condition, results of operations or liquidity. Other than as set forth below, there are no additional pending or threatened legal proceedings at this time.\nSecureAlert, Inc. v. Federal Government of Mexico (Department of the Interior). On March 24, 2017, SecureAlert Inc. (a predecessor entity to Track Group, Inc. or the Company) filed a complaint before the Federal Administrative Tribunal, asserting the failure by defendants to pay claimant amounts agreed to, and due under, the Pluri Annual Contract for the Rendering of Monitoring Services of Internees, through Electric Bracelets, in the Islas Marias Penitentiary Complex dated July 15, 2011. Although preliminary rulings have been unfavorable to the Company, the Companys counsel continues to review its remaining claims which are upwards of $4.0 million. Based upon the fee arrangement the Company has with its counsel, we anticipate the future liabilities attributable to legal expense will be minimal.\nCommonwealth of Puerto Rico, through its Trustees v. International Surveillance Services Corporation. On January 23, 2020, the Company was served with a summons for an Adversary Action pending against International Surveillance Services Corporation (ISS), a subsidiary of the Company, now known as Track Group - Puerto Rico Inc., in the United States District Court for the District of Puerto Rico seeking to recover allegedly fraudulent transfers and to disallow claims pursuant to United States Bankruptcy and Puerto Rican law. The allegations stem from payments made to ISS between 2014 and 2017, which the Company believes were properly made in accordance with a contract between ISS and the government of Puerto Rico, through the Oficina de Servicios con Antelacion a Juicio, originally signed in 2011. The Company is confident that all payments it received were earned and due under applicable law and produced documentation supporting its position in an informal document exchange with the Commonwealth on July 6, 2020. At this time, the case remains stayed by Court order. The Company remains confident in its position and no accrual for a potential loss has been made, after consultation with legal counsel.\nJeffrey Mohamed Abed v. Track Group, Inc., et al. On June 7, 2021, Jeffrey Mohamed Abed filed a complaint seeking unspecified damages in the Superior Court of the State of California, alleging strict products liability, negligence and breach of implied warranty premised upon injuries sustained by Abed who was involved in an automobile accident while wearing a GPS tracking device of the Company. The Company was served on October 15, 2021 and subsequently filed its Answer and Affirmative Defenses and issued discovery. On July 17, 2023, the action was consolidated with a related case brought by Plaintiff against other motorists involved in the automobile accident. The Company disputes Abeds claims and will defend the case vigorously. The Company remains confident in its position and no accrual for a potential loss has been made, after consultation with legal counsel.\nTrack Group Chile SpA. v. Republic of Chile. On January 24, 2022, Track Group Chile SpA. initiated a judicial action in the Court of Justice of Chile to settle a contract dispute with the Republic of Chile. The Company asserts that it has complied with its contractual obligations and that any delays in so doing were not attributable to the Company. The Company remains confident in its position and no accrual for a potential loss has been made, after consultation with legal counsel.\nJesus Valle Gonzalez, et al. v. Track Group-Puerto Rico, et al. On May 9, 2022, Plaintiff Jesus Valle Gonzalez filed a complaint in the Court of First Instance, San Juan Superior Court, Commonwealth of Puerto Rico against the Company, and associated parties alleging the death of his mother on June 8, 2016 was a result of the gross negligence of all the defendants. This claim follows a similar claim made against the Company in June 2017 by different relatives of the deceased which was settled on September 5, 2018. Plaintiff in this matter asserts his claim now having reached the age of majority and is requesting damages of $1.5 million. On August 22, 2023, the Superior Court dismissed the Plaintiffs case for lack of jurisdiction.\nMichael Matthews v. Track Group, Inc., et al. On December 13, 2022, Plaintiff Michael Matthews filed a complaint in the Circuit Court of Cook County, Illinois, amended on July 23, 2023, against the Company and other defendants alleging wrongful arrest and incarceration and a deprivation of his rights following his purportedly erroneous violation of home monitoring program requirements. The Company disputes the allegations of the complaint, has retained counsel, and intends to vigorously defend the case. Based on the preliminary stage of the proceedings and after consultation with legal counsel, no accrual for a potential loss has been made.\nPART II  Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur Common Stock is traded on the OTCQB under the symbol TRCK. The following table sets forth the range of high and low sales prices of our Common Stock as reported on the OTCQB for the periods indicated.\nFiscal Year Ended September 30, 2023\nHigh\nLow\nFirst Quarter ended December 31, 2022\n$ 0.66\n$ 0.30\nSecond Quarter ended March 31, 2023\n$ 1.25\n$ 0.34\nThird Quarter ended June 30, 2023\n$ 0.70\n$ 0.25\nFourth Quarter ended September 30, 2023\n$ 0.85\n$ 0.18\nFiscal Year Ended September 30, 2022\nHigh\nLow\nFirst Quarter ended December 31, 2021\n$ 3.00\n$ 1.76\nSecond Quarter ended March 31, 2022\n$ 2.48\n$ 0.71\nThird Quarter ended June 30, 2022\n$ 3.30\n$ 0.70\nFourth Quarter ended September 30, 2022\n$ 0.99\n$ 0.34\nHolders\nAs of December 1, 2023, we had 161 holders of record of our Common Stock and 11,863,758 shares of Common Stock outstanding. We also have outstanding options and warrants for the purchase of 4,688 shares of Common Stock.\nDividends\nSince incorporation, we have not declared any cash dividends on our Common Stock. We do not anticipate declaring cash dividends on our Common Stock for the foreseeable future.\nDilution\nThe Board of Directors determines when, under what conditions and at what prices to issue shares of Company stock. In addition, a significant number of shares of Common Stock are reserved for issuance upon exercise of outstanding options and warrants.\nThe issuance of any shares of Common Stock for any reason will result in dilution of the equity and voting interests of existing stockholders.\nTransfer Agent and Registrar\nThe transfer agent and registrar for our Common Stock is Equiniti Trust Company, LLC, which is located at 48 Wall Street, Floor 23, New York, NY 10005.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe 2022 Stock Incentive Plan\nAt the annual meeting of stockholders on April 13, 2022, our stockholders approved the 2022 Omnibus Equity Incentive Plan (the 2022 Plan), previously approved by the Companys Board. The 2022 Plan provides for the grant of incentive options and nonqualified options, restricted stock, stock appreciation rights, performance shares, performance stock units, dividend equivalents, stock payments, deferred stock, restricted stock units, other stock-based awards and performance-based awards to employees and certain non-employees who provide services to the Company in lieu of cash. A total of 500,000 shares are authorized for issuance pursuant to awards granted under the 2022 Plan. The 2022 Plan supersedes and replaces the Companys 2012 Equity Compensation Plan (the 2012 Plan).\nThe 2012 Stock Incentive Plan\nThe 2022 Plan supersedes and replaces the 2012 Plan. As of June 30, 2020, the Board suspended further awards under the 2012 Plan. Any awards outstanding under the 2012 Plan will remain subject to the 2012 Plan. All shares of Common Stock remaining authorized and available for issuance under the 2012 Plan and any shares subject to outstanding awards under the 2012 Plan that subsequently expire, terminate, or are surrendered or forfeited for any reason without issuance of shares will automatically become available for issuance under our 2022 Plan.\nThere were no issuances of restricted shares in Fiscal 2023.\nOn April 13, 2022, the Company issued 285,000 restricted shares of Common Stock to members of its executive team pursuant to the 2022 Plan valued at $370,500. The Company recorded expense of $207,547 for the year ended September 30, 2022 in connection with the grant.\nAs of September 30, 2023, there were 215,000 shares of Common Stock remaining available for issuance under the 2022 Plan as well as 27,218 available under the 2012 plan.\nThe following table includes information as of September 30, 2023 for our equity compensation plans:\nPlan category\nNumber of\nsecurities to be\nissued upon\nexercise of\noutstanding\noptions, warrants\nand rights\n(a)\nWeighted-\naverage\nexercise price\nof\noutstanding\noptions,\nwarrants\nand rights\nNumber of\nsecurities remaining\navailable for future\nissuance under\nequity\ncompensation plans\n(excluding securities\nreflected in first\ncolumn)\n(b)\nEquity compensation plans approved by shareholders\n4,688\n$ 1.24\n242,218\nEquity compensation plan not approved by shareholders\n-\n-\n-\nTotal\n4,688\n$ 1.24\n242,218\n(a)\nConsists of shares of our Common Stock issuable upon exercise of outstanding options issued under the Companys 2012 Plan and the 2022 Plan.\n(b)\nConsists of 215,000 shares of our Common Stock reserved for future issuance under the 2022 Plan and 27,218 shares of our Common Stock reserved for future issuance under the 2012 Plan.\nRecent Sales of Unregistered Securities\nNo securities were issued without registration under the Securities Act during Fiscal 2023, nor were any securities issued subsequent to September 30, 2023, that were not reported in our Quarterly Reports on Form 10-Q and in our Current Reports on Form 8-K filed with the Securities and Exchange Commission.  Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThis Managements Discussion and Analysis of Financial Condition and Results of Operations contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act) and Section 27A of the Securities Act of 1933, as amended (the Securities Act). All statements contained in this Annual Report on Form 10-K (this Annual Report) other than statements of historical fact are forward-looking statements. When used in this Annual Report or elsewhere by management from time to time, the words believe, anticipate, intend, plan, estimate, expect, may, will, should, seeks and similar expressions are forward-looking statements. Such forward-looking statements are based on current expectations, but the absence of these words does not necessarily mean that a statement is not forward-looking. Forward-looking statements are not guarantees of future performance and involve risks and uncertainties. Actual events or results may differ materially from those discussed in the forward-looking statements as a result of various factors. For a more detailed discussion of such forward-looking statements and the potential risks and uncertainties that may impact upon their accuracy, see Item 1A entitled Risk Factors in Part I of this Annual Report and the Overview and Liquidity and Capital Resources sections of this Item 7 Managements Discussion and Analysis of Financial Condition and Results of Operations. These forward-looking statements reflect our view only as of the date of this Annual Report. Except as required by law, we undertake no obligations to update any forward-looking statements. Accordingly, you should also carefully consider the factors set forth in other reports or documents that we file from time to time with the Securities and Exchange Commission (SEC).\nThe following Managements Discussion and Analysis of Financial Condition and Results of Operations (this MD&A) is intended to help the reader better understand Track Group, our operations and our present business environment. Our fiscal year ends on September 30 of each year. Reference to Fiscal 2023 refers to the year ended September 30, 2023, and reference to Fiscal 2022 refers to the year ended September 30, 2022 (Fiscal 2023 and Fiscal 2022 are collectively Fiscal Years 2023 and 2022). This MD&A is provided as a supplement to and should be read in conjunction with our consolidated financial statements for Fiscal Years 2023 and 2022, and the accompanying notes thereto contained in this Annual Report. This introduction summarizes MD&A, which includes the following sections:\n●\nOverview - a general description of our business and the markets in which we operate; our objectives; our areas of focus; and challenges and risks of our business.\n●\nResults of Operations - an analysis of our consolidated results of operations for the last two fiscal years presented in our consolidated financial statements.\n●\nLiquidity and Capital Resources - an analysis of cash flows; off-balance sheet arrangements and aggregate contractual obligations; and the impact of inflation and changing prices.\n●\nOff-Balance Sheet Arrangements\n●\nCritical Accounting Policies - a discussion of accounting policies that require critical judgments and estimates.\nWe intend for this discussion to provide the reader with information that will assist in understanding our financial statements, the changes in certain key items in those financial statements from year to year, and the primary factors that accounted for those changes, as well as how certain accounting principles affect our financial statements.\nOverview\nOur core business is based on the leasing of patented tracking and monitoring solutions to federal, state and local law enforcement agencies, both in the U.S. and abroad, for the electronic monitoring of offenders and offering unique data analytics services on a platform-as-a-service (PaaS) business model. Currently, we deploy offender-based management services that combine patented GPS tracking technologies, full-time 24/7/365 global monitoring capabilities, case management, and proprietary data analytics. We offer customizable tracking solutions that leverage real-time tracking data, best practices monitoring, and analytics capabilities to create complete, end-to-end tracking solutions.\nResults of Operations\nContinuing Operations - Fiscal 2023 Compared to Fiscal 2022\nRevenue\nDuring Fiscal 2023, we had revenue of $34,475,865 compared to revenue of $36,968,499 for Fiscal 2022, a decrease of $2,492,634, or approximately 7%. Of this revenue, $33,503,687 and $35,768,090 were from monitoring and other related services revenue during Fiscal 2023 and Fiscal 2022, respectively, representing a decrease of $2,264,403 or approximately 6%. The decrease in revenue from clients in Illinois, California, Canada, Mississippi was due to a reduction in people assigned to monitoring in those locations. This decline was partially offset by revenue increases for clients in Louisiana, Philadelphia, Nevada and Chile who experienced increases in the number of people assigned to monitoring. These increases and reductions from all of these locations represent typical fluctuations which occur daily. The Companys partner in the Bahamas contributed a small amount of revenue in Fiscal 2022 which went away in Fiscal 2023 as the government elected to work with a different local partner.\nProduct and other revenue for Fiscal 2023 decreased to $972,178 from $1,200,409 in the same period in 2022, a decrease of $228,231 or approximately 19%. The decrease in product and other revenue was largely due to lower international product sales, principally in Saudi Arabia and lower IntelliTrack installation and training. We continue to largely focus on recurring subscription-based opportunities as opposed to equipment sales.\nThe industry in which the Company operates, as well as many other industries (automotive, consumer products and medical devices), have been impacted by the global semiconductor shortage. The availability of semiconductor parts has continued to improve in Fiscal 2023; however, long lead times remain with certain parts.\nCost of Revenue\nDuring Fiscal 2023, cost of revenue totaled $19,178,790 compared to cost of revenue during Fiscal 2022 of $19,615,543, a decrease of $436,753, or approximately 2%. The decrease in cost of revenue was largely the result of lower communication costs of $493,436, lower monitoring center costs of $356,156, lower commission costs of $120,093 and lower product sales costs of $96,558. These decreases were offset by higher device maintenance costs related to regreasing some outstanding devices of $622,987.\nDepreciation and amortization included in cost of revenue for Fiscal Years 2023 and 2022, totaled $3,263,490 and $3,237,970, respectively, an increase of $25,520, or approximately 1%. These costs represent the depreciation of ReliAlert® and other monitoring devices, as well as the amortization of monitoring software and certain royalty agreements. The increase in depreciation and amortization costs is largely due to an increase in device depreciation expense of $158,676, offset by a decrease in amortization of $133,156 for the discontinued products, Shadow and InTouch. Amortization of a patent related to GPS and satellite tracking are also included in depreciation and amortization. Devices are depreciated over either a three- or five-year useful life. Monitoring software is amortized over a seven-year life. Royalty agreements are being amortized over a ten-year useful life. The Company believes these lives are appropriate due to changes in electronic monitoring technology and the corresponding potential for obsolescence. Management periodically assesses the useful life of the devices for appropriateness.\nGross Profit and Margin\nDuring Fiscal 2023, gross profit totaled $15,297,075, resulting in a 44% gross margin, compared to $17,352,956, or a 47% gross margin, during Fiscal 2022. The decrease in absolute gross profit of $2,055,881 is due to a decrease in revenue of $2,492,634, higher device repair costs and nominally higher depreciation and amortization costs, partially offset by lower monitoring center costs, lower communication costs, lower commission costs and lower product sales costs.\nGeneral and Administrative Expense\nDuring Fiscal 2023, our general and administrative expense totaled $10,275,695, compared to $12,462,931 for Fiscal 2022. The decrease of $2,187,236, or approximately 18%, in general and administrative cost resulted largely from the impairment of intangible assets of $1,728,961 associated with the discontinuance of two product lines in Fiscal 2022, lower Board of Director fees of $153,257, and lower legal and professional fees of $909,499, partially offset by higher outside service costs of $124,218, higher payroll expense of $257,037 and higher bad debt of $183,550.\nSelling and Marketing Expense\nFor Fiscal 2023, our selling and marketing expense was $2,842,661 compared to $2,993,749 for Fiscal 2022. The decrease of $151,088 or approximately 5% resulted largely from lower wages and related payroll taxes of $115,972 and lower outside services of $79,415, partially offset by higher travel and entertainment costs of $77,895.\nResearch and Development Expense\nDuring Fiscal 2023, we incurred research and development expense of $2,735,060 compared to those costs recognized during Fiscal 2022 totaling $2,432,448, an increase of $302,612 or approximately 12%. The increase was largely due to increased payroll and related tax expense of $298,846. The capitalization of developed technology, in accordance with the accounting guidance for internal-use software, was $865,263 during Fiscal 2022 and increased to $1,020,604 or 40% in Fiscal 2023 due to technology projects currently in development.\nDepreciation and Amortization Expense\nWe maintain a significant portion of our tangible and intangible assets that are amortized or depreciated. During Fiscal 2023, depreciation and amortization included in operating expense totaled $987,472 compared to $1,563,729 for Fiscal 2022. This decrease of $576,257, or approximately 37%, was largely due to intangible assets that were fully amortized or fully impaired in Fiscal 2022.\nOther Income (Expense)\nDuring Fiscal 2023, total other expense was $1,219,845 compared to $4,406,973 during Fiscal 2022, a decrease of $3,187,128 or approximately 72%. The decrease in Fiscal 2023 was primarily due to positive currency exchange rate movements and a legal settlement of $1,600,000 in third quarter 2022 offset principally by the forgiveness of an accrued expense by a significant vendor of $633,471 in Fiscal 2022.\nIncome taxes\nDuring Fiscal 2023, income tax expense totaled $627,850 compared to $883,488 during Fiscal 2022. Tax expense in both fiscal years are income taxes largely related to a foreign jurisdiction.\nNet Income (Loss) Attributable to Common Stockholders\nWe had a net loss attributable to common stockholders for Fiscal 2023 totaling ($3,391,508), or ($0.30) and ($0.30) per basic and diluted common share, respectively, compared to net loss of ($7,390,362), or ($0.64) and ($0.64) per basic and diluted common share, respectively, for Fiscal 2022. This decrease in net loss is largely due to lower general and administrative expense, lower selling and marketing expense, lower depreciation and amortization, lower other expense and lower tax expense, partially offset by lower gross profit and higher research and development expense.\nLiquidity and Capital Resources\nThe company believes that its existing cash and its future cash flow from operations will be sufficient to meet the cash requirements of its existing business for the foreseeable future.\nOn December 21, 2020, Conrent and the Company signed an amendment to the Amended Facility Agreement which extended the maturity date of the Amended Facility Agreement to July 1, 2024 (Amended Facility), capitalized the accrued and unpaid interest, increasing the outstanding principal amount and reduced the interest rate of the Amended Facility from 8% to 4%. On April 26, 2023, the Company and Conrent entered into another amendment to the facility agreement (the Amendment) originally executed by and between the parties on December 30, 2013 and amended multiple times (the Amended Facility Agreement). The latest Amendment: (i) extended the maturity date from July 1, 2024, to July 1, 2027; (ii) amended the applicable interest rate resulting in an escalating interest rate as follows: 4% through June 30, 2024, 5% through June 30, 2025, 5.5% through June 30, 2026, and 6% through the maturity date and (iii) removed section 7.3 Change of Control of the Amended Facility Agreement. In return, the Company agreed to pay total fees of EUR 225,000 in five annual installments to Conrent. As of September 30, 2023, $42,864,000 of principal and $438,165 of interest was owed to Conrent.\nOn January 6, 2021, the Company borrowed 70,443,375 Chilean Pesos (CLP) ($101,186USD) from HP Financial Services Chile Limitada. To facilitate the Loan, the Company entered into a Note Payable Agreement with HP Financial Services Chile Limitada as lender. The loan was used to purchase PABX (private automatic branch exchange phone equipment) for the construction of the Gendarmeria de Chile monitoring centers in Santiago and Puerto Montt, Chile. The loan bears an interest rate of 6.56% per annum, payable monthly with principal beginning February 2021 and a maturity date of February 6, 2024.\nOn January 12, 2021, the Company borrowed 347,198,500CLP ($482,965USD), net of 2,801,500CLP fees ($3,897USD), from Banco Santander. To facilitate the Loan, the Company entered into a Note Payable Agreement with Banco Santander as lender. The loan was used to comply with the construction of Gendarmeria de Chile monitoring center in Santiago, Chile and remodel a temporary monitoring center. The loan bears an interest rate of 5.04% per annum, payable monthly with principal beginning February 2021 and a maturity of May 11, 2024. The Company also paid 19,607,843CLP ($27,275USD) in broker fees which are amortized over the life of the loan.\nOn February 2, 2021, the Company borrowed 247,999,300CLP ($338,954USD), net of 2,000,700CLP fees ($2,734USD), from Banco Estado. To facilitate the Loan, the Company entered into a Note Payable Agreement with Banco Estado as lender. The loan was used for the construction of the Gendarmeria de Chile monitoring center in Santiago and computer equipment for Gendarmeria branch offices. The loan bears an interest rate of 3.50% per annum, initially having a 6-month grace period with the first payment including the 6 months of interest plus 1 month of principal on August 2, 2021, then monthly interest with principal and a maturity date of January 2, 2024. The Company also paid 14,124,294CLP ($19,304USD) in broker fees which are amortized over the life of the loan.\nOn February 4, 2021, the Company borrowed 149,794,432CLP ($205,330USD) from HP Financial Services Chile Limitada. To facilitate the Loan, the Company entered into a Note Payable Agreement with HP Financial Services Chile Limitada as lender. The loan was used to purchase computer equipment for the Gendarmeria de Chile monitoring center in Santiago, Chile. The loan bears interest at a rate of 6.61% per annum, payable monthly with principal beginning March 2021 and a maturity of March 4, 2024.\nOn February 5, 2021, the Company borrowed of 99,808,328CLP ($136,564USD), net of 210,485CLP fees ($286USD), from Banco de Chile. To facilitate the Loan, the Company entered into a Note Payable Agreement with Banco de Chile as lender. The loan was used to purchase HVAC equipment for Gendarmeria de Chile monitoring center in Santiago, Chile. The loan bears an interest rate of 2.54% per annum, payable monthly with principal beginning March 2021 and a maturity date of March 4, 2024.\nOn February 15, 2021, the Company borrowed 500,000,000CLP ($678,214USD) from Banco de Chile. To facilitate the Loan, the Company entered into a Note Payable Agreement with Banco de Chile as lender. The loan was used as working capital and to complete the construction of the Gendarmeria monitoring center in Puerto Montt, Chile. The loan bears an interest at a rate of 3.12% per annum, payable monthly with principal beginning March 2021 and a maturity of February 17, 2025. The Company also paid 28,248,588CLP ($38,317USD) in broker fees which are amortized over the life of the loan.\nNo borrowings or sales of equity securities occurred during the years ended September 30, 2023 or 2022.\nNet Cash Flows Provided by Operating Activities.\nDuring Fiscal 2023, we had cash flows from operating activities of $3,876,800, compared to cash flows from operating activities of $802,961 for Fiscal 2022, representing a $3,073,839 increase. The increase in cash from operations was largely the result of decreases in our net operating assets, mainly driven by decreases in accounts receivable, and prepaid expense, deposits and other assets.\nNet Cash Flows used in Investing Activities.\nThe Company used $4,564,202 of cash for investing activities during Fiscal 2023, compared to $3,060,280 of cash used during Fiscal 2022, an increase of $1,503,922. Cash used for investing activities was primarily related to purchases of monitoring and other equipment to complete the swap of 3G devices and meet customer demand during the year ended September 30, 2023.\nNet Cash Flows used in Financing Activities.\n$511,474 of cash was used in financing activities during Fiscal 2023, which was the result of loan principal payments on Chiles long-term debt and payment of deferred financing fees, compared to $515,500 of cash used in financing activities during Fiscal 2022. During the Fiscal Years 2023 and 2022, the Company received net proceeds of $0 from borrowings, and made principal payments of $467,323 and $494,626 on notes payable, respectively.\nLiquidity, Working Capital and Managements Plan\nAs of September 30, 2023, the Company had unrestricted cash of $4,057,195, compared to unrestricted cash of $5,311,104 as of September 30, 2022. As of September 30, 2023, we had working capital of $4,813,777, compared to working capital of $7,296,297 as of September 30, 2022. This decrease in working capital of $2,482,520 is principally due to the purchase of monitoring equipment, offset by a decrease in operating liabilities.\nOn December 21, 2020, Conrent and the Company signed an amendment to the Amended Facility Agreement which extended the maturity date of the Amended Facility Agreement to July 1, 2024 (Amended Facility), capitalized the accrued and unpaid interest, increasing the outstanding principal amount and reduced the interest rate of the Amended Facility from 8% to 4%. On April 26, 2023, the Company and Conrent entered into another amendment to the facility agreement (the Amendment) originally executed by and between the parties on December 30, 2013 and amended multiple times (the Amended Facility Agreement). The latest Amendment: (i) extended the maturity date from July 1, 2024, to July 1, 2027; (ii) amended the applicable interest rate resulting in an escalating interest rate as follows: 4% through June 30, 2024, 5% through June 30, 2025, 5.5% through June 30, 2026, and 6% through the maturity date and (iii) removed section 7.3 Change of Control of the Amended Facility Agreement. In return, the Company agreed to pay certain fees to Conrent. As of September 30, 2023, $42,864,000 of principal and $438,165 of interest was owed to Conrent. See Note 7 to the Consolidated Financial Statements.\nAs noted above, during the fiscal year ended September 30, 2021, the Company borrowed approximately $1.95 million through six notes payable to fund the construction of monitoring centers in Chile required by our new contract. These six notes mature between January 2024 to February 2025 and the principal repayments on these six notes have all commenced. No additional funds were borrowed during the years ended September 30, 2023 or 2022.\nInflation\nThe rise in inflation in Fiscal 2022 and Fiscal 2023 has adversely impacted the Companys cost of labor, materials and other operating expense, but we anticipate continued operational changes to mitigate some or all of the inflationary pressures.\nOff-Balance Sheet Financial Arrangements\nThe Company has not entered into any transactions with unconsolidated entities whereby the Company has financial guarantees, derivative instruments, or other contingent arrangements that expose the Company to material continuing risks, contingent liabilities, or any other obligation that provides financing, liquidity, market risk, or credit risk support to the Company, except as described below.\nBond guarantees\nAs of September 30, 2023, the Company has one performance bond in connection with a foreign customer totaling $1,654,134 (Performance Bonds) of which $1,157,867 is held in an interest-bearing account on behalf of the bank and is recorded in Other Assets on the Consolidated Balance Sheets. The amount held on this Performance Bond will be released after the expiration of the Performance Bond, all contract extensions have been exhausted, and the consent of the customer, but in no event before July 2024 and more likely in 2025.\nThe amounts held on two performance bonds were released in the second quarter of 2023 and the Company received $1,041,797, including interest.\nThe Company pays interest on the full amount of the Performance Bond to the financial institution providing the guarantee at 2.8% interest per annum for the Performance Bond expiring in July 2024. The Company recorded interest expense of $54,676 and $64,356 for the years ended September 30, 2023 and September 30, 2022, respectively.\nCritical Accounting Policies\nIn Note 2, Summary of Significant Accounting Policies to the audited Consolidated Financial Statements included in this Annual Report, we discuss those accounting policies we consider to be significant in determining the results of operations and our financial position.\nThe preparation of financial statements requires management to make significant estimates and judgments that affect the reported amounts of assets, liabilities, revenue, and expense. By their nature, these estimates and judgments are subject to an inherent degree of uncertainty. On an on-going basis, we evaluate our estimates, including those related to bad debts, inventories, intangible assets, warranty obligations, product liability, revenue, and income taxes. We base our estimates on historical experience and other facts and circumstances that are believed to be reasonable, and the results form the basis for making judgments about the carrying value of assets and liabilities. The actual results may differ from these estimates under different assumptions or conditions.\nWith respect to revenue recognition, impairment of long-lived assets, leases, stock-based compensation and allowance for doubtful accounts receivable, we apply critical accounting policies discussed below in the preparation of our financial statements.\nRevenue Recognition\nOur revenue is predominantly derived from two sources: (i) monitoring services, and (ii) product sales.\nMonitoring and Other Related Services\nMonitoring services include two components: (i) lease contracts pursuant to which the Company provides monitoring services and leased devices to distributors or end users and the Company retains ownership of the leased device; and (ii) monitoring services purchased by distributors or end users who have previously purchased monitoring devices and opt to use the Companys monitoring services. Monitoring revenue is recognized ratably over time, as the customer simultaneously receives and consumes the benefit of these services as they are performed. Payment due or received from the customers prior to rendering the associated services are recorded as deferred revenue.\nProduct Sales and Other\nThe Company sells devices and replacement parts to customers under certain contracts, as well as law enforcement software licenses and maintenance, and analytical software. Revenue from the sale of devices and parts is recognized upon their transfer of control to the customer, which is generally upon shipment, but may vary per contract. Payment terms are generally 30 days from invoice date. When purchasing products (such as ReliAlert® devices) from the Company, customers may, but are not required to, enter into monitoring service contracts with us. The Company recognizes revenue on monitoring services for customers that have previously purchased devices at the end of each month that monitoring services have been provided.\nMultiple Element Arrangements\nThe majority of our revenue transactions do not have multiple elements. However, on occasion, the Company may enter into revenue transactions that have multiple elements. These may include different combinations of products or services that are included in a single billable rate. These products or services are delivered over time as the customer utilizes our services. In cases where obligations in a contract are distinct and thus require separation into multiple performance obligations, revenue recognition guidance requires that contract consideration be allocated to each distinct performance obligation based on its relative standalone selling price. The value allocated to each performance obligation is then recognized as revenue when the revenue recognition criteria for each distinct promise or bundle of promises has been met. There were no multiple element arrangements for the years ended September 30, 2023 and 2022.\nOther Matters\nThe Company considers an arrangement with payment terms longer than the Companys normal terms not to be fixed or determinable. Normal payment terms for the sale of monitoring services and products are due upon receipt to 30 days. The Company sells devices and services directly to end users and to distributors. Distributors do not have general rights of return. Also, distributors may not have price protection or stock protection rights with respect to devices sold to them by us. Generally, title and risk of loss pass to the buyer upon delivery of the devices.\nShipping and handling fees charged to customers are included as part of total revenue. The related freight costs and supplies directly associated with shipping products to customers are included as a component of cost of revenue. Our revenue is predominantly derived from two sources: (i) monitoring services, and (ii) product sales.\nImpairment of Long-Lived Assets and Goodwill\nWe review our long-lived assets including goodwill and intangibles for impairment when events or changes in circumstances indicate that the book value of an asset may not be recoverable, and in the case of goodwill, at least annually. We evaluate whether events and circumstances have occurred which indicate possible impairment as of each balance sheet date. We use an equity method of the related asset or group of assets in measuring whether the assets are recoverable. If the carrying amount of an asset exceeds its market value, an impairment charge is recognized for the amount by which the carrying amount exceeds the estimated fair value of the asset. Impairment of long-lived assets is assessed at the lowest levels for which there are an identifiable fair market value that is independent of other groups of assets. See Note 13 to the Consolidated Financial Statements.\nAllowance for Doubtful Accounts and Credit Memos\nWe must make estimates of the collectability of accounts receivable. In doing so, we analyze accounts receivable and historical bad debts, customer credit-worthiness, current macroeconomic and geopolitical trends, and changes in customer payment patterns when evaluating the adequacy of the allowance for doubtful accounts.\nThe Company also maintains an allowance for estimated credit memos to be issued against current sales. Estimates of allowance for credit memos are based upon the application of a historical issuance lag period to the average credit memos issued each month.\nRecent Accounting Pronouncements\nFrom time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board (FASB) or other standard setting bodies, which are adopted by us as of the specified effective date. Unless otherwise discussed, we believe that the impact of recently issued standards that are not yet effective will not have a material impact on our financial position or results of operations upon adoption.\nAccounting for Stock-Based Compensation\nWe recognize compensation expense for stock-based awards expected to vest on a straight-line basis over the requisite service period of the award based on their grant date fair value. We estimate the fair value of stock options using a Black-Scholes option pricing model which requires us to make estimates for certain assumptions regarding risk-free interest rate, expected life of options, expected volatility of stock, and expected dividend yield of stock.\nGovernment Regulation\nOur operations are subject to various federal, state, local and international laws and regulations. We are not involved in any pending or, to our knowledge, threatened governmental proceedings, which would require curtailment of our operations because of such laws and regulations. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nOur business extends to countries outside the United States, and we intend to continue to expand our foreign operations. As a result, our revenue and results of operations are affected by fluctuations in currency exchange rates, interest rates, and other uncertainties inherent in doing business in more than one currency. In addition, our operations are exposed to risks that are associated with changes in social, political, and economic conditions in the foreign countries in which we operate, including changes in the laws and policies that govern foreign investment and the repatriation of cash to the parent company, as well as, to a lesser extent, changes in United States laws and regulations relating to foreign trade and investment.\nForeign Currency Risks\nWe had $6,383,735 and $6,095,403 in foreign currency revenue for Fiscal Years 2023 and 2022, respectively. We made and received payments in a foreign currency during the periods indicated, which resulted in a foreign exchange gain of $467,868 and foreign exchange expense of $1,619,018 in Fiscal Years 2023 and 2022, respectively. Fluctuations in the exchange loss or gain in any given period are due to the strengthening or weakening of the U.S. dollar against the Chilean Peso and Canadian dollar which have been magnified by global matters, inflation, and the government policies established to address those issues. Changes in currency exchange rates affect the relative prices at which we sell our products and purchase goods and services. Given the uncertainty of exchange rate fluctuations, we cannot estimate the effect of these fluctuations on our future business, product pricing, results of operations, or financial condition. We periodically enter into small, simple forward foreign currency exchange contracts or derivative financial instruments to mitigate the risk of repatriating funds converted from foreign currency into U.S. dollars. To the extent foreign sales become a more significant part of our business in the future, we may seek to implement additional strategies which make use of these or other instruments to minimize the effects of foreign currency exchange on our business and/or require some international customers to receive invoices and make payments in US dollars. The Company had no active foreign currency exchange contracts as of September 30, 2023. Item 8. Financial Statements and Supplementary Data\nThe Financial Statements and Supplementary Data required by this Item are set forth on the pages indicated under Item 15 below. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe have established disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) to ensure that material information relating to the Company is made known to the officers who certify our financial reports and to other members of senior management and the Board of Directors. These disclosure controls and procedures are designed to ensure that information required to be disclosed in the reports that are filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms.\nUnder the supervision and with the participation of management, including the principal executive officer and principal financial officer, an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of September 30, 2023 was completed pursuant to Rules 13a-15(b) and 15d-15(b) under the Exchange Act. Based on this evaluation, our principal executive officer and principal financial and accounting officer concluded that our disclosure controls and procedures were effective and designed to provide reasonable assurance that the information required to be disclosed is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms as of September 30, 2023.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Our internal control over financial reporting is a process designed under the supervision of our principal executive officer and principal financial officer to provide reasonable assurance regarding the reliability of financial reporting and preparation of our financial statements for external purposes in accordance with generally accepted accounting principles.\nDue to its inherent limitations, internal control over financial reporting may not prevent or detect misstatements and even when determined to be effective, can only provide reasonable, not absolute, assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to risk that controls may become inadequate as a result of changes in conditions or deterioration in the degree of compliance.\nUnder the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) issued in May 2013 and related COSO guidance. Based on our evaluation under this framework, our management concluded that our internal control over financial reporting was effective as of September 30, 2023.\nThis report does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the independent registered public accounting firm pursuant to rules of the SEC that permit the Company to provide only managements report in this Annual Report.\nChanges in Internal Control over Financial Reporting\nThere has been no change in our internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) during our fiscal year ended September 30, 2023, that has materially affected, or is reasonably likely to materially affect our internal control over financial reporting. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe Companys Board of Directors (the Board) and executive officers consist of the persons named in the table below. Each director serves for a one-year term, until his or her successor is elected and qualified, or until earlier resignation or removal. Our Bylaws provide that the authorized number of directors shall be fixed by the Board from time to time. The directors and executive officers are as follows:\nKaren Macleod\nDirector\nKarim Sehnaoui\nDirector\nDerek Cassell\nChief Executive Officer\nPeter K. Poli\nChief Financial Officer\nMatthew Swando\nChief Revenue Officer\nKaren Macleod was appointed as a director in January 2016 having previously served as the Chief Executive Officer of Arete Group LLC, a professional services firm. Ms. Macleod currently serves on the Board of Cyngn, Inc and is Chair of the Compensation Committee and additionally serves on the Board of the Lakeland Hills YMCA. Prior to Arete Group, Ms. Macleod was President of Tatum LLC, a New York-based professional services firm owned by Randstad, from 2011 to 2014, and was a co-founder of Resources Connection (NASDAQ: RECN), now known as RGP, a multinational professional services firm founded as a division of Deloitte in June 1996. Ms. Macleod served in several positions for RGP, including as a director from 1999 to 2009 and President, North America from 2004 to 2009. Prior to RGP, Ms. Macleod held several positions in the Audit Department of Deloitte from 1985 to 1994. Ms. Macleod served as a director for A-Connect (Schweiz) AG, a privately held, Swiss-based global professional services firm, from 2014 to 2016, and was a director for Overland Solutions from 2006 to 2013. She additionally served as a director on the Board of the FWA (Financial Womens Association) in New York and was a member of their Audit Committee from 2018-2021. Ms. Macleod holds a Bachelor of Science in Business/Managerial Economics from the University of California, Santa Barbara.\nMs. Macleods senior public company leadership experience along with her finance and accounting background make her a significant contributor to the Board and the strategic growth of the Company.\nKarim Sehnaoui was appointed as a director in February 2018. Mr. Sehnaoui is an entrepreneur and investment professional, who specializes in private equity, venture capital, and corporate finance. Currently Mr. Sehnaoui is Senior Executive Officer and Board Director, ADS Investment Solutions since October 3, 2021, he also serves as Chief Investment Officer of ADS Securities LLC, a position he has held since October 2018, and as a Director of ETS Limited. From 2012 to 2016, Mr. Sehnaoui taught graduate level finance courses as a visiting Assistant Professor at MSB Mediterranean School of Business in Tunisia. Prior to that, Mr. Sehnaoui spent several years in investment banking and private equity, serving as Acting Chief Investment Officer of Abu Dhabi Investment House PJSC and General Manager for Abu Dhabi Investment House S.A., and Business Development Director at Ithmaar Bank. Mr. Sehnaoui holds Bachelors and Masters degrees in Civil Engineering from McGill University in Montreal, Canada, and was a Global Leadership Fellow at the World Economic Forum in Geneva, Switzerland from 2005 to 2007.\nMr. Sehnaoui was appointed as a director in connection with ETS Limited becoming the Companys largest stockholder of record in 2018. Mr. Sehnaouis senior leadership experience, along with his private equity and venture capital background make him a valued member of the Board and a strong asset to the ongoing growth of the Company.\nDerek Cassell joined the Company in June 2014 through the strategic acquisition of Emerge Monitoring, at which time he was appointed Divisional President, Americas. Mr. Cassell was appointed to serve as our President in December 2016 and was promoted to the role of Chief Executive Officer effective January 1, 2018. From September 2008 until June 2014, Mr. Cassell served as an Executive Vice President of Emerge Monitoring, which was part of the Bankers Surety Team. Mr. Cassell has over 20 years of experience providing correctional solutions to the criminal justice industry. His previous positions include Director of Operations for ADT Correctional Services, Director of Customer Support for G4S Justice Services, and National Sales and Marketing Manager for ElmoTech Inc. He holds a Criminal Justice Degree from Henry Ford College in Dearborn Heights, Michigan.\nPeter K. Poli has served as our Chief Financial Officer since January 2017. In addition, he has served as the Chief Financial Officer and Treasurer of Emerge Monitoring, Inc., Secretary and Treasurer of Track Group - Puerto Rico, Inc., Secretary of Track Group Analytics, Limited and Manager of Emerge Monitoring LLC, all of which are subsidiaries of the Company, since May 2017. Before joining the Company, Mr. Poli served as the Chief Financial Officer of Grand Banks Yachts Limited from August 18, 2004 through December 31, 2015. In addition, he served as an Executive Director of Grand Banks Yachts from March 31, 2008 through October 28, 2015. Prior to his time with Grand Banks Yachts Limited, Mr. Poli served as the Chief Financial Officer for Acumen Fund Inc., I-Works Inc., and as Vice President and Chief Financial Officer of FTD.COM. Mr. Poli also spent nine years as an Investment Banker with Dean Witter Reynolds, Inc. and served as the CFO of a wholly-owned subsidiary of Morgan Stanley Dean Witter from 1997 to 1999. In addition, Mr. Poli served as an Independent Director of Leapnet, Inc. from 2000 to 2002. Mr. Poli earned a Bachelor of Arts in Economics and Engineering from Brown University in 1983 and an MBA from Harvard Business School in 1987.\nMatthew Swando joined Track Group in 2017 as Vice President of Global Sales continuing a 21-year career in the electronic monitoring and offender supervision market. Prior to joining Track Group, Mr. Swando was employed as a Pretrial Services Investigator for Oakland County, MI; then spent 4 years with ProTech Monitoring, Inc. employed first as a Market Analyst, and later promoted to Regional Sales Manager. In April of 2004, Mr. Swando joined BI, Inc. as a Business Development Executive and became the Western Regional Sales Manager, National Sales Manager, and later Vice President of Sales overseeing all business development activities, strategy, and staff. In 2014, Mr. Swando was promoted to Divisional Vice President overseeing all divisional operations for BI, Inc. Mr. Swando holds both a B.S. in Criminal Justice from Central Michigan University with an emphasis on alternative corrections, and an M.A. in Criminology from the University of South Florida.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934, as amended (the Exchange Act), requires our officers, directors, and persons who beneficially own more than ten percent of our common stock, par value $0.0001 per share (Common Stock) to file reports of ownership and changes in ownership with the Securities and Exchange Commission (SEC). Officers, directors, and greater-than-ten-percent stockholders are also required by the SEC to furnish us with copies of all Section 16(a) forms that they file.\nBased solely upon a review of these forms that were furnished to us, we believe that all reports required to be filed by these individuals and persons under Section 16(a) were filed during Fiscal 2023 and that such filings were timely.\nCode of Business Conduct and Ethics\nWe have established a Code of Business Conduct and Ethics (the Code) that applies to our officers, directors and employees. This Code contains general guidelines for conducting our business consistent with the highest standards of business ethics and is intended to qualify as a code of ethics within the meaning of Section 406 of the Sarbanes-Oxley Act of 2002 and the rules promulgated thereunder. A copy of our Code is available online at www.trackgrp.com. Any amendments to or waivers from a provision of our Code that apply to our principal executive officer, principal financial officer, principal accounting officer, controller or persons performing similar functions and that relates to any element of the Code will be made available to the public at the aforementioned website.\nBoard Leadership Structure\nIn addition to the CEOs leadership, the Board maintains effective independent oversight through a number of governance practices, including, open and direct communication with management, input on meeting agendas, and regular executive sessions.\nBoard Role in Risk Assessment\nManagement, in consultation with outside professionals, as applicable, identifies risks associated with the Companys operations, strategies and financial statements. Risk assessment is also performed through periodic reports received by the Board from management, counsel and the Companys independent registered public accountants relating to risk assessment and management. Our Board meets privately in executive sessions with representatives of the Companys independent registered public accountants. The Board also provides risk oversight through its periodic reviews of the financial and operational performance of the Company.\nDirector Nominations\nThe Board nominates directors for election at the annual meetings of stockholders held and appoints new directors to fill vacancies when they arise, and has the responsibility to identify, evaluate and recruit qualified candidates to the Board for such nomination or appointment.\nThe Board identifies director nominees by first considering those current members of the Board who are willing to continue service. Current members of the Board with skills and experience that are relevant to our business and who are willing to continue service are considered for re-nomination, balancing the value of continuity of service by existing members of the Board with that of obtaining a new perspective. Nominees for director are selected by a majority of the members of the Board. Although the Company does not have a formal diversity policy, in considering the suitability of director nominees, the Board considers such factors as it deems appropriate to develop a Board that is diverse in nature and comprised of experienced and seasoned advisors. Factors considered by the Board include judgment, knowledge, skill, diversity, integrity, experience with businesses and other organizations of comparable size, including experience in the software and/or technology industries, software, intellectual property, business, finance, administration or public service, the relevance of a candidates experience to our needs and experience of other Board members, experience with accounting rules and practices, the desire to balance the considerable benefit of continuity with the periodic injection of the fresh perspective provided by new members, and the extent to which a candidate would be a desirable addition to the Board and any committees of the Board.\nA stockholder who wishes to suggest a prospective nominee for the Board may notify the Secretary of the Company in writing with any supporting material the stockholder considers appropriate. Nominees suggested by stockholders are considered in the same way as nominees suggested from other sources.\nIn addition, the Companys Bylaws contain provisions that address the process by which a stockholder may nominate an individual to stand for election to the Board at the Companys annual meeting of stockholders. In order to nominate a candidate for director, a stockholder must give timely notice in writing to the Secretary of the Company and otherwise comply with the provisions of the Companys Bylaws. Information required by the Companys Bylaws to be in the notice include: the name, contact information and share ownership information for the candidate and the person making the nomination, and other information about the nominee that must be disclosed in proxy solicitations under Section 14 of the Exchange Act and its related rules and regulations. The Board may also require any proposed nominee to furnish such other information as may reasonably be required by the Board to determine the eligibility of such proposed nominee to serve as director of the Company. The recommendation should be sent to: Secretary, Track Group, Inc., 200 E. 5th Avenue, Suite 100, Naperville, Illinois 60563. You can obtain a copy of the Companys Bylaws by writing to the Secretary at this address.\nStockholder Communications\nIf you wish to communicate with the Board, you may send your communication in writing to: Secretary, Track Group, Inc., 200 E. 5th Avenue, Suite 100, Naperville, Illinois 60563. You must include your name and address in the written communication and indicate whether you are a stockholder of the Company. The Secretary will review any communication received from a stockholder, and all material and appropriate communications from stockholders will be forwarded to the appropriate director or directors or committee of the Board based on the subject matter.\nBoard Meetings\nDirectors are generally elected for a term of one year or more until the next annual meeting of stockholders and until their successors have been elected or appointed and duly qualified. Vacancies on the Board which are created by the retirement, resignation or removal of a director, may be filled by the vote of the remaining members of the Board, with such new director serving the remainder of the term or until his/her successor is elected and qualified.\nThe Board is elected by and is accountable to our stockholders. The Board establishes policy and provides strategic direction, oversight, and control. The Board met 9 times during the year ended September 30, 2023 and incumbent directors attended 100% of the aggregate number of meetings of the Board exclusive of meetings where a Director was excused from attendance based upon the subject matter of discussion.\nBoard Committees and Charters\nPrior to May 31, 2018, the Board had three standing committees which consisted of the Audit Committee, the Compensation Committee, and the Nominating and Corporate Governance Committee. Due to the resignations of certain former directors during 2018 as previously disclosed by the Company and the current size of the Board, these committees are no longer active. Instead, the full Board administers the duties of each of these committees and will likely do so for the foreseeable future.\nAudit Committee\nPrior to May 31, 2018, we had a separately designated standing Audit Committee established in accordance with Section 3(a)(58)(A) of the Exchange Act. The primary duties of the Audit Committee were to oversee (i) managements conduct related to our financial reporting process, including reviewing the financial reports and other financial information provided by the Company, and reviewing our systems of internal accounting and financial controls, (ii) our independent auditors qualifications and independence and the audit and non-audit services provided to the Company, and (iii) the engagement and performance of our independent auditors. The Audit Committee assisted the Board in providing oversight of our financial and related activities, including capital market transactions. The Audit Committee has a charter, a copy of which is available on our website at www.trackgrp.com.\nCurrently, the entire Board serves in the capacity as an Audit Committee with Ms. Macleod also serving as Committee Chair. With the exception of Mr. Sehnaoui, each member of the Audit Committee, satisfy, as determined by the full Board, the definition of independent director as established in the OTC Rules and all members are financially literate. In accordance with Section 407 of the Sarbanes-Oxley Act of 2002, the Board designated Ms. Macleod as the Audit Committees audit committee financial expert as defined by the applicable regulations promulgated by the SEC. The Audit Committee met with our Chief Financial Officer and with our independent registered public accounting firm and evaluated the responses by the Chief Financial Officer, both to the facts presented and to the judgments made by our independent registered public accounting firm.\nOur full Board reviewed and discussed the matters required by United States auditing standards required by the Public Company Accounting Oversight Board (the PCAOB) and our audited financial statements for the fiscal year ended September 30, 2023 (Fiscal 2023) with management and our independent registered public accounting firm. Our Board received the written disclosures and the letter from our independent registered public accounting firm required by applicable PCAOB standards, and our Board discussed with the independent registered public accounting firm the independent registered public accounting firm's independence.\nCompensation Committee\nWe currently do not have a compensation committee of the Board or a committee performing similar functions. It is the view of the Board that it is appropriate for us not to have such a committee because of our size and because the Board participates in the consideration of executive compensation. As such, the entire Board has the responsibility for developing and maintaining an executive compensation policy that creates a direct relationship between pay levels and corporate performance and returns to stockholders. The Board monitors the results of such policy to assure that the compensation payable to our executive officers provides overall competitive pay levels, creates proper incentives to enhance stockholder value, rewards superior performance, and is justified by the returns available to stockholders. The Board also has periodically retained outside benefit consultants to assess compensation policies and adjust as recommended.\nAdditionally, the Board administers compensation plans in a manner consistent with the terms of such plans (including, as applicable, the granting of stock options, restricted stock, stock units and other awards, the review of performance goals established before the start of the relevant plan year, and the determination of performance compared to the goals at the end of the plan year). None of our executive officers served as a director or member of the compensation committee of any entity that has one or more executive officers serving on our Board.\nNominating and Corporate Governance Committee\nWe do not have a Nominating and Corporate Governance Committee. Our Board selects individuals to stand for election as members of the Board and does not have a policy with regards to the consideration of any director candidates recommended by our stockholders. Our Board has determined that it is in the best position to evaluate our companys requirements as well as the qualifications of each candidate when it considers a nominee for a position on the Board. As such, the entire Board has the responsibility for identifying and recommending candidates to fill vacant and newly created Board positions, setting corporate governance guidelines regarding director qualifications and responsibilities, and planning for senior management succession.\nCurrently, our full Board is required to review the qualifications and backgrounds of all directors and nominees (without regard to whether a nominee has been recommended by stockholders), as well as the overall composition of the Board, and recommend director candidates to be nominated for election at the annual meeting of stockholders, or, in the case of a vacancy on the Board, elect a new director to fill such vacancy. If stockholders wish to recommend candidates directly to our Board, they may do so by communicating directly with our Secretary at the address specified on the cover of this annual report. There has not been any change to the procedures that our stockholders may recommend nominees to our Board.\nIndependent Directors\nThe Board has determined that Ms. Macleod is an independent director of the Company as defined by the rules and regulations of the OTC Markets. Ms. Macleod meets the independence standards established by the OTC Markets and the SEC. In addition, the Board has determined that of its current directors, Ms. Macleod satisfies the definition of an audit committee financial expert under SEC rules and regulations. These designations do not impose any duties, obligations or liabilities that are greater than those generally imposed as members of the Board, and the designation as an audit committee financial expert does not affect the duties, obligations or liability of any other member of the Board.\nIndemnification of Officers and Directors\nAs permitted by Delaware law, the Company will indemnify its directors and officers against expenses and liabilities they incur to defend, settle, or satisfy any civil or criminal action brought against them on account of their being or having been Company directors or officers unless, in any such action, they are adjudged to have acted with gross negligence or willful misconduct. Item 11. Executive Compensation\nThe following discussion relates to the compensation of our Named Executive Officers (as defined below).\nSummary Compensation Table\nThe following summary compensation table sets forth the compensation paid to the following persons for our fiscal years ended September 30, 2023 and 2022:\n(a)\nour principal executive officer;\n(b)\nour other two most highly compensated executive officers who were serving as executive officers at the end of Fiscal 2023 and who had total compensation exceeding $100,000; and\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)(1)\nAll Other\nCompensation\n($)(2)\nTotal\n($)\nDerek Cassell\n$ 300,000\n$ 60,000\n$ -\n$\n$ 360,100\nChief Executive Officer\n$ 300,000\n$ 350,980\n$ -\n$\n$ 651,080\nPeter Poli\n$ 275,000\n$ 27,500\n$ -\n$\n$ 302,600\nChief Financial Officer\n$ 275,000\n$ 160,230\n$ -\n$\n$ 435,330\nMatt Swando\n$ 275,000\n$ 26,407\n$ -\n$\n$ 301,507\nChief Revenue Officer\n$ 262,885\n$ 138,103\n$ 240,500\n$\n$ 641,615\n(1)\nThis column represents the grant date fair value in accordance with Financial Accounting Standards Board Accounting Standards Codification Topic 718, Compensation - Stock Compensation. These amounts do not represent the actual value that may be realized by the Named Executive Officers.\n(2)\nThis column represents the value of holiday gift cards received by employees.\nNarrative Disclosure to the Summary Compensation Table\nCassell Employment Agreement\nOn December 1, 2016, the Company entered into an employment agreement with Mr. Cassell, which was subsequently amended on February 13, 2017 (the Cassell Employment Agreement). Under the terms and conditions of the Cassell Employment Agreement, Mr. Cassell received a base salary equal to $240,000 per annum and received 60,000 unregistered restricted shares of the Companys Common Stock. One-half of these shares vested immediately upon issuance, and the remaining one-half vested on March 30, 2018. If the Company terminates Mr. Cassels employment as a result of an involuntary termination, he would receive an amount equal to 12 months base salary, plus any annual bonus deemed to be vested and earned as well as certain COBRA benefits.\nA second amendment to the Cassell Employment Agreement was approved at a Board meeting held on December 13, 2017, and such amendment was executed on January 4, 2018. Under the terms of the Cassell Agreement, as amended (the Second Cassell Amendment), effective January 1, 2018, Mr. Cassell was promoted from President to Chief Executive Officer of the Company, a position which he shall hold until December 31, 2020, unless earlier terminated or extended. Should Mr. Cassell elect to voluntarily terminate his employment with the Company, he must provide written notice of his intent to do so at least 180 days prior to terminating his employment. In addition, the Second Cassell Amendment provides: (i) an increase in Mr. Cassells base salary to $275,000 per year; (ii) an increase, to 100% of his base salary, in his annual bonus effective for bonus plan year 2018 and thereafter; (iii) the issuance of 300,000 unregistered restricted shares of the Companys Common Stock, which shall vest annually in increments of 100,000 beginning January 1, 2018; and (iv) in the event of a change of control, Mr. Cassell shall be entitled to a cash payment equal to one years salary, plus all restricted stock, warrants and options previously issued to Mr. Cassell shall become immediately vested and exercisable.\nA third amendment to the Cassell Employment Agreement was approved at a Board meeting held on December 18, 2020, and such amendment was executed on December 21, 2020 (the Third Cassell Amendment). Under the terms of the Third Cassell Amendment, effective January 1, 2021, Mr. Cassells employment was extended one year and on February 23, 2021, the Board approved an increase in Mr. Cassells base salary to $300,000 per year effective March 21, 2021. In the event of a change of control, Mr. Cassell shall be entitled to a cash payment equal to one years salary, plus all restricted stock, warrants and options previously issued to Mr. Cassell shall become immediately vested and exercisable.\nA fourth amendment to the Cassell Employment Agreement was approved at a Board meeting held on December 15, 2021 (the Fourth Cassell Amendment). Under the terms of the Fourth Cassell Amendment, Mr. Cassells employment will continue in effect until terminated by either party in accordance with the terms established under the Cassell Employment Agreement.\nPoli Employment Agreement\nOn December 12, 2016, the Company entered into a three-year employment agreement with Mr. Poli (the Poli Employment Agreement). Under the terms and conditions of the Poli Employment Agreement, Mr. Poli began receiving a base salary equal to $240,000 per annum beginning in January 2017, and received an option to purchase 100,000 shares of the Companys Common Stock at an exercise price per share equal to the closing price of the Companys Common Stock on the date approved by the Board. One-half of this option vested on January 1, 2018, and the remaining one-half vested on January 1, 2019. If the Company terminates Mr. Polis employment as a result of an involuntary termination, he would receive an amount equal to 12 months base salary, plus any annual bonus deemed to be vested and earned as well as certain COBRA benefits.\nAn amendment to the Poli Employment Agreement was approved at a Board meeting on December 13, 2017, and such amendment was executed on January 3, 2018. Pursuant to the terms of the Poli Agreement, as amended (the Poli Amendment), effective January 1, 2018, Mr. Polis employment was extended three years, and shall automatically renew for successive one-year periods thereafter unless either party provides the other with notice of its intent not to renew the Poli Agreement at least six months prior to termination. In addition, the Poli Amendment provides: (i) an increase in Mr. Polis base salary to $250,000 per year; (ii) the issuance of 150,000 unregistered restricted shares of the Companys Common Stock, which shall vest annually in increments of 50,000 beginning January 1, 2018; and (iii) in the event of a change of control, Mr. Poli shall be entitled to a cash payment equal to one years salary, plus all restricted stock, warrants and options previously issued to Mr. Poli shall become immediately vested and exercisable.\nThe Poli Amendment renewed effective January 1, 2021 and on February 23, 2021 the Board approved an increase in Mr. Polis base salary to $275,000 per year effective March 21, 2021. In the event of a change of control, Mr. Poli shall be entitled to a cash payment equal to one years salary, plus all restricted stock, warrants and options previously issued to Mr. Poli shall become immediately vested and exercisable.\nSwando Employment Agreement\nOn December 6, 2016, the Company entered into an employment agreement with Mr. Swando (the Swando Employment Agreement). Under the terms and conditions of the Swando Employment Agreement, Mr. Swando received a base salary equal to $185,000 per annum and received a one-time grant of 25,000 registered shares of the Companys Common Stock. One-half of these shares vested April 23, 2017, and the remaining one-half vested April 23, 2018. If the Company terminates Mr. Swandos employment as a result of an involuntary termination, he would receive an amount equal to 6 months base salary, plus any annual bonus deemed to be vested and earned as well as certain COBRA benefits.\nA first amendment to the Swando Employment Agreement was executed on April 23, 2018. Under the terms of the Swando Employment Agreement, as amended (the First Swando Amendment), effective April 23, 2018, (i) Mr. Swandos base annual salary was increased to $205,000, and (ii) in the event of a change of control, Mr. Swando shall be entitled to a cash payment equal to 6 months of his base annual salary, plus all restricted stock, warrants and options previously issued to Mr. Swando shall become immediately vested and exercisable, and (iii) for the purposes of any severance payment, the target bonus shall be deemed to be vested and earned.\nA second amendment to the Swando Employment Agreement was executed on January 15, 2022 (the Second Swando Amendment). Under the terms of the Second Swando Amendment, Mr. Swando was promoted to Chief Revenue Officer. Mr. Swandos base salary was increased to $275,000 per calendar year, and Mr. Swandos bonus target level was set at fifty percent of his new base salary. Additionally, in the event of a change of control, Mr. Swando shall be entitled to a cash payment equal to one years salary, plus all restricted stock, warrants and options previously issued to Mr. Swando shall become immediately vested and exercisable. Subject to the approval of the Companys proposed 2022 Omnibus Equity Incentive Plan (the Plan) by the Board of Directors and the Companys stockholders, Mr. Swando shall be entitled to a one-time grant of 185,000 share of common stock of the Company, subject to the terms and conditions of the Plan as approved.\nOutstanding Equity Awards at September 30, 2023\nThe following table provides information regarding unvested shares underlying RSUs held by our Named Executive Officers as of September 30, 2023:\nOption Awards\nStock Awards\nName\nGrant Date\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nExercisable\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nUnexercisable\nOption\nExercise\nPrice\nOption\nExpiration\nDate\nNumber\nof\nShares\nof\nStock\nThat\nHave\nNot\nVested (#)\n(1)\nMarket\nValue\nof Shares of\nStock That\nHave Not\nVested ($)\n(1)\nEquity\nIncentive\nPlan Awards:\nNumber\nof Unearned\nShares,\nUnits or Other\nRights\nThat Have Not\nVested (#)\nEquity Incentive\nPlan\nAwards: Market\nor Payout\nValue of\nUnearned\nShares,\nUnits or Other\nRights\nThat Have Not\nVested ($)\nMatthew Swando\n4/13/2022\n61,667 (1)\n30,217\n-\n-\n(1)\nRepresents grant of 185,000 shares of restricted stock, which shares were vested one-third on October 13, 2022, one-third vested on April 13, 2023, and the remaining 61,667 vested on October 13, 2023. The market value is computed based on the closing market price of our Common Stock on September 30, 2023 of $0.49 per share.\nDirector Compensation\nDuring the fiscal year ended September 30, 2023, each of our non-employee directors received $25,000 per quarter for serving on the Board, which fees were payable in cash. The members of the Board are also eligible for reimbursement of their expenses incurred in attending Board meetings in accordance with our policies.\nThe following table sets forth the compensation awarded to, earned by, or paid to each non-employee director having served during the fiscal year ended September 30, 2023:\nStock Awards\n($)\nWarrant Awards\n($)\nCash\n($)\nTotal Fees Earned\n($)\nGuy Dubois (1)\n$ -\n$ -\n$ 25,000\n$ 25,000\nKaren Macleod\n$ -\n$ -\n$ 100,000\n$ 100,000\nKarim Sehnaoui\n$ -\n$ -\n$ 100,000\n$ 100,000\n(1)\nMr. Dubois served as a member of the Board of Directors during Fiscal 2023 until his resignation as a director of the Company and as Chair of the Board, effective December 31, 2022.\nDirector Warrants\nThe following table lists the warrants to purchase shares of Common Stock held by each of our non-employee directors as of December 1, 2023, all of which were granted in connection with their services as directors:\nName\nGrant Date\nExpiration Date\nExercise\nprice\nNumber of\nWarrants\nCompensation Expense\nGuy Dubois (1)\n1/2/2014\n12/31/2023\n$ 1.24\n2,344\n$ 12,014\n(1)\nMr. Dubois served as a member of the Board of Directors during Fiscal 2023 until his resignation as a director of the Company and as Chair of the Board, effective December 31, 2022.\nCompensation Risks Assessment\nAs required by rules adopted by the SEC, management has assessed our compensation policies and practices with respect to all employees to determine whether risks arising from those policies and practices are reasonably likely to have a material adverse effect on us. In doing so, management considered various features and elements of the compensation policies and practices that discourage excessive or unnecessary risk taking. As a result of the assessment, we have determined that our compensation policies and practices do not create risks that are reasonably likely to have material adverse effects. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners\nThe following table presents information regarding beneficial ownership as of December 1, 2023 (the Table Date), of our Common Stock by (i) each stockholder known to us to be the beneficial owner of more than five percent of our Common Stock; (ii) each of our Named Executive Officers serving as of the Table Date; (iii) each of our directors serving as of the Table Date; and (iv) all of our executive officers and directors as a group.\nWe have determined beneficial ownership in accordance with the rules of the SEC. Except as indicated by the footnotes below, we believe, based on the information furnished to us, that the persons and entities named in the table below have sole voting and dispositive power with respect to all securities they beneficially own. As of the Table Date, the applicable percentage ownership is based on 11,863,758 shares of our Common Stock issued and outstanding.\nCommon Stock\nShares\n%\nName and Address of Beneficial Owner (1)\n5% Beneficial Owners:\nETS Limited (2)\n4,706,579\n39.7 %\nConrent Invest S.A., Compartment Track-PPN (3)\n1,815,697\n15.3 %\nCRC Founders Fund, LP (4)\n691,691\n5.8 %\nDirectors and Named Executive Officers:\nKaren Macleod (5)\n73,744\n0.6 %\nKarim Sehnaoui (6)\n14,021\n0.1 %\nDerek Cassell (7)\n317,209\n2.7 %\nPeter Poli (8)\n187,241\n1.6 %\nMatt Swando (9)\n205,340\n1.7 %\nAll directors and executive officers as a group (5 persons)\n1,263,886\n10.7 %\n(1)\nExcept as otherwise indicated, the business address for these beneficial owners is c/o the Company, 200 E. 5th Avenue, Suite 100, Naperville, Illinois 60563.\n(2)\nThe business address of ETS Limited, a wholly owned subsidiary of ADS Securites LLC, is c/o Mourant Ozannes Corporate Services (Cayman) Limited, 94 Solaris Avenue, Camana Bay, PO Box 1348, Grand Cayman KY1-1108, Cayman Islands. As controlling shareholder of ADS Holding LLC, the controlling shareholder of ADS Securities, LLC, Mahmood Ebraheem Al Mahmood may be deemed to have beneficial ownership over the shares reported herein. Information is based on Amendment No. 4 to Schedule 13D filed by ADS Securities LLC on July 1, 2022.\n(3)\nIncludes 75,000 shares held directly by Conrent Invest S.A. (Conrent). Holding information is based on Schedule 13D/A filed on July 17, 2023. The business address of each of Conrent is 2, Rue des Gaulois, L-1618 Luxembourg (Luxembourg). Information is based on Amendment No. 1 to Schedule 13D filed by Conrent on July 17, 2023.\n(4)\nDenver J. Smith is the Lead Manager for the CRC Founders Fund, LP, an investment partnership, and has the shared power to vote and dispose of the shares held by the CRC Founders Fund, LP. The business address of CRC Founders Fund, LP is 1040 S Gaylord Street, Suite 25, Denver, CO, 80209. Information is based on the Schedule 13G filed by CRC Founders Fund, LP on June 22, 2023.\n(5)\nHoldings include 73,744 shares of Common Stock owned of record.\n(6)\nHoldings include 14,021 shares of Common Stock owned of record.\n(7)\nHoldings include 317,209 shares of Common Stock owned of record.\n(8)\nHoldings include 187,241 shares of Common Stock owned of record.\n(9)\nHoldings include 205,340 shares of Common Stock owned of record. Item 13. Certain Relationships and Related Transactions, and Director Independence\nETS Limited is currently the beneficial owner of 4,706,579 shares of the Company's Common Stock (Track Group Shares) held by ADS Securities LLC (ADS) under an agreement dated September 28, 2017 pursuant to which ADS transferred all of the Track Group Shares to ETS Limited in exchange for all of the outstanding shares of ETS Limited. A Director of ETS Limited was elected to the Company's Board of Directors on February 7, 2018.\nOn September 8, 2020, the Company received a letter from ADS informing the Company that ADS had been assigned the right to payment under that certain Loan Facility dated September 14, 2015, by and between Sapinda Asia Limited and the Company (the Sapinda Loan Agreement). On September 30, 2020, the Company and ADS settled the outstanding amount due under the Sapinda Loan Agreement for $2.7 million. The Company recorded a gain of approximately $0.7 million during the fiscal year ended September 30, 2020. Item 14. Principal Accounting Fees and Services\nDuring the years ended September 30, 2023 and 2022, Eide Bailly, LLP (Eide Bailly) served as our independent registered public accounting firm. The following table presents approximate aggregate fees and other expenses for professional services rendered by Eide Bailly, our independent registered public accounting firm, for the audit of the Companys annual financial statements for the years ended September 30, 2023 and 2022 and fees and other expenses for other services rendered during those periods.\nAudit Fees (1)\n$ 226,150\n$ 192,135\nAudit-Related Fees (2)\n$ -\n$ -\nTax Fees (3)\n$ 37,214\n$ 44,220\nAll Other Fees (4)\n$ 21,050\n$ 20,080\nTotal\n$ 284,414\n$ 256,435\n(1)\nAudit services in 2023 and 2022 consisted of the audit of our annual consolidated financial statements, and other services related to filings and registration statements filed by us and our subsidiaries, and other pertinent matters including reviews of interim financial statements from our quarterly reports. Eide Bailly has served as our independent registered public accounting firm since September 24, 2013.\n(2)\nThere were no audit-related fees for the years ended September 30, 2023 and 2022.\n(3)\nFor permissible professional services related to income tax return preparation and compliance.\n(4)\nAll other fees are related to the audit of the 401(k) financial statements and an S-8 registration in 2022.\nAudit Committee Pre-Approval Policies and Procedures\nPrior to May 31, 2018, our former Audit Committee had, and subsequent to such date our entire Board of Directors has, established pre-approval policies and procedures, pursuant to which the Audit Committee approved the foregoing audit and permissible non-audit services provided by Eide Bailly in the fiscal year ended September 30, 2018, and the full Board approved the foregoing audit and permissible non-audit services provided by Eide Bailly in the fiscal year ended September 30, 2023 (Fiscal 2023). Such procedures govern the ways in which the Audit Committee pre-approved, and the full Board of Directors now pre-approves, audit and various categories of non-audit services that the auditor provides to the Company. Services that have not received pre-approval must receive specific approval of the full Board for Fiscal 2023.\nAuditor Independence\nOur Audit Committee and the full Board of Directors considered that the work done for us in Fiscal 2023 and Fiscal 2022, respectively, by Eide Bailly was compatible with maintaining Eide Baillys independence.\nReport of the Audit Committee of the Board of Directors\nDate: December 20, 2023\nThe full Board of Directors of Track Group, Inc. (the Board), serving in the capacity of the Companys Audit Committee, has reviewed and discussed with management and Eide Bailly, LLP, our independent registered public accounting firm, the audited consolidated financial statements in the Track Group, Inc. Annual Report on Form 10-K for the year ended September 30, 2023. The Board has also discussed with Eide Bailly, LLP those matters required to be discussed by the applicable requirements of the Public Company Accounting Oversight Board (PCAOB).\nEide Bailly, LLP also provided the Board with the written disclosures and the letter required by the applicable requirements of the PCAOB regarding the independent auditors communication with the Board concerning independence. The Board has discussed with the registered public accounting firm their independence from our Company.\nBased on its discussions with management and the registered public accounting firm, and its review of the representations and information provided by management and the registered public accounting firm, including as set forth above, the Board determined that the audited financial statements should be included in our Annual Report on Form 10-K for the year ended September 30, 2023.\nRespectfully Submitted,\nKaren Macleod, Committee Chair\nKarim Sehnaoui\nThe information contained above under the caption Report of the Audit Committee of the Board of Directors shall not be deemed to be soliciting material or to be filed with the SEC, nor shall such information be incorporated by reference into any future filing under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended, except to the extent that we specifically incorporate it by reference into such filing.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a) The following documents are filed as part of this report:\n1. Financial Statements\nReport of Eide Bailly LLP\nConsolidated Balance Sheets\nConsolidated Statements of Operations and Comprehensive Income (Loss)\nConsolidated Statements of Stockholders Equity (Deficit)\nConsolidated Statements of Cash Flows\nNotes to the Consolidated Financial Statements\n2. Financial Statement Schedules.\n3. Exhibits. The following exhibits are filed herewith or are incorporated by reference to exhibits previously filed with the Commission:\nIncorporated by Reference\nExhibit\nNumber\nExhibit\nDescription\nFiled\nHerewith\nForm\nFiling\nDate\n3(i)(1)\nArticles of Transfer of Track Group, Inc., a Utah corporation, dated August 5, 2016\nExhibit 3(i)(3) to the Companys Current Report on Form 8-K\nAugust 9, 2016\n3(i)(2)\nCertificate of Conversion Converting Track Group, Inc., a Utah corporation, to Track Group, Inc., a Delaware corporation, dated August 5, 2016\nExhibit 3(i)(4) to the Companys Quarterly Report on Form 10-Q\nAugust 9, 2016\n3(i)(3)\nCertificate of Incorporation of Track Group, Inc., a Delaware corporation, dated August 6, 2016\nExhibit 3(i)(5) to the Companys Quarterly Report on Form 10-Q\nAugust 9, 2016\n3(1)(4)\nCertificate of Designation of the Relative Rights and Preferences of the Series A Convertible Preferred Stock, dated October 12, 2017\nExhibit 3.1 to the Companys Current Report on Form 8-K\nOctober 13, 2017\n3(ii)(2)\nBylaws of Track Group, Inc., a Delaware corporation\nExhibit 3(ii)(2) to the Companys Quarterly Report on Form 10-Q\nAugust 9, 2016\n10.1\n2012 Equity Incentive Award Plan\nAppendix II to the Companys Definitive Proxy Statement on Schedule 14A filed on October 25, 2011, amended in accordance with the Companys Definitive Proxy Statement on Schedule 14A filed on April 9, 2015\n10.2\nAmended and Restated Facility Agreement, dated June 30, 2015, by and between Track Group, Inc. and Conrent Invest S.A, acting on behalf of its compartment Safety 2, dated June 30, 2015\nExhibit 10.1 to the Companys Current Report on Form 8-K\nJuly 15, 2015\n10.4\nLoan Agreement, by and between Conrent Invest S.A., acting with respect to its Compartment Safety III, and Track Group, Inc., dated May 1, 2016\nExhibit 10.9 to the Companys Quarterly Report on Form 10-Q\nMay 9, 2016\n10.5\nEmployment agreement, by and between Track Group Inc. and Peter Poli, dated December 12, 2016\nExhibit 10.1 to the Companys Current Report on Form 8-K\nDecember 16, 2016\n10.6\nEmployment Agreement by and between Track Group, Inc. and Derek Cassell dated, December 1, 2016\nExhibit 10.1 to the Companys Quarterly Report on Form 10-Q\nFebruary 14, 2017\n10.7\nServices Agreement, dated December 7, 2016\nExhibit 10.2 to the Companys Quarterly Report on Form 10-Q\nFebruary 14, 2017\n10.8\nAmendment No. 1 to Employment Agreement by and between Track Group Inc. and Derek Cassell, dated February 13, 2017\nExhibit 10.3 to the Companys Quarterly Report on Form 10-Q\nFebruary 14, 2017\n10.9\nAmendment No. 1 to Employment Agreement by and between Track Group, Inc. and Peter K. Poli dated, January 3, 2018\nExhibit 10.1 to the Companys Current Report on Form 8-K\nJanuary 5, 2018\n10.10\nAmendment No. 2 to Employment Agreement by and between Track Group Inc. and Derek Cassell, dated January 3, 2018\nExhibit 10.2 the Companys Current Report on Form 8-K\nJanuary 5, 2018\n10.11\nMonitoring Services Agreement by and between Track Group, Inc. and Marion County Community Corrections Agency, dated December 18, 2017\nExhibit 10.1 to the Companys Quarterly Report on Form 10-Q\nFebruary 8, 2018\n10.12\nMonitoring Services Agreement by and between Track Group, Inc. and Gendarmeria of Chile, the Republic of Chiles uniformed prison service, dated July 29, 2020\nExhibit 10.1 to the Companys Current Report on Form 8-K\nAugust 17, 2020\n10.13\nAmendment Agreement by and between Track Group, Inc. and Conrent Invest S.A., dated July 19, 2018\nExhibit 10.1 to the Companys Current Report on Form 8-K\nJuly 19, 2018\n10.14\nAmendment Agreement by and between Track Group, Inc. and Conrent Invest S.A., dated February 24, 2019\nExhibit 10.1 to the Companys Current Report on Form 8-K\nFebruary 28, 2019\n10.15\nAmendment Agreement by and between Track Group, Inc. and Conrent Invest S.A., dated January 10, 2020\nExhibit 10.1 to the Companys Current Report on Form 8-K\nJanuary 15, 2020\n10.17\nMonitoring Services Agreement between Track Group, Inc. and Gendarmeria de Chile, the Republic of Chiles uniform prison service, dated July 29, 2020\nExhibit 10.1 to the Companys Current Report on Form 8-K\nAugust 17, 2020\n10.18\nAmendment No. 3 to Employment Agreement between Track Group, Inc. and Derek Cassell, dated December 1, 2016\nExhibit 10.19 to the Companys Annual Report on Form 10-K\nDecember 23, 2020\n10.19\nAmendment to Facility Agreement by and between Track Group, Inc. and Conrent Invest S.A., acting on behalf of its compartment, Safety 2, dated December 21, 2020\nExhibit 10.1 to the Companys Current Report on Form 8-K\nDecember 23, 2020\n10.20\nAmendment No. 4 to the Executive Employment Agreement between Track Group, Inc. and Derek Cassell Dated December 15, 2021 (incorporated by reference to Exhibit 10.19 to our Annual Report on Form 10-K, filed).\nExhibit 10.19 to the Companys Annual Report on Form 10-K\nDecember 16, 2021\n10.21\nEmployment Agreement by and Between Track Group Inc. and Matthew Swando dated December 6, 2016.\nExhibit 10.1 to the Companys Quarterly Report on Form 10-Q\nFebruary 10, 2022\n10.22\nAmendment No. 1 to Employment Agreement by and Between Track Group Inc. and Matthew Swando dated April 23, 2018.\nExhibit 10.2 to the Companys Quarterly Report on Form 10-Q\nFebruary 10, 2022\n10.23\nAmendment No.2 to Employment Agreement by and Between Track Group Inc. and Matthew Swando dated January 15, 2022.\nExhibit 10.3 to the Companys Quarterly Report on Form 10-Q\nFebruary 10, 2022\n10.24\n2022 Omnibus Equity Incentive Plan (incorporated by reference to Annex A to our Definitive Proxy Statement on Schedule 14A, filed).\nAnnex A to the Companys Definitive Proxy Statement on Schedule 14A\nFebruary 24, 2022\n10.25\nSettlement Agreement and Mutual Release entered into by the Company, Eli Sabag, Sapinda Asia Limited and Lars Windhorst, dated June 10, 2022\nExhibit 10.1 to the Companys Current Report on Form 8-K\nJune 14, 2022\n10.26\nAmendment to Facility Agreement by and between Track Group, Inc. and Conrent Invest S.A., acting on behalf of its compartment, Safety 2, dated April 26, 2023.\nExhibit 10.1 to the Companys Current Report on Form 8-K\nApril 27, 2023\n14.1\nCode of Business Conduct & Ethics (incorporated by reference to our Annual Report on Form 10-K, filed).\nExhibit 14.1 to the Companys Annual Report on Form 10-K\nDecember 19, 2017\nSubsidiaries of the Registrant (incorporated by reference to Amendment No. 1 to our Annual Report on Form 10-K, filed).\nExhibit 21 to the Companys Annual Report on Form 10-K\nJanuary 28, 2019\n31(i)\nCertification of Chief Executive Officer under Section 302 of Sarbanes-Oxley Act of 2002 (filed herewith).\nX\n31(ii)\nCertification of Chief Financial Officer under Section 302 of Sarbanes-Oxley Act of 2002 (filed herewith).\nX\nCertifications under Section 906 of the Sarbanes-Oxley Act of 2002 (18 U.S.C. Section 1350) (filed herewith).\nX\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nX\nCover Page Interactive Data File (embedded within the Inline XBRL Document and included in Exhibit 101)\nX\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTrack Group, Inc.\nDate: December 20, 2023\nBy:\n/s/ Derek Cassell\nDerek Cassell\nChief Executive Officer (Principal Executive Officer)\nDate: December 20, 2023\nBy:\n/s/ Peter K. Poli\nPeter K. Poli\nChief Financial Officer (Principal Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Karen Macleod\nDirector\nDecember 20, 2023\nKaren Macleod\n/s/ Karim Sehnaoui\nDirector\nDecember 20, 2023\nKarim Sehnaoui\nIndex to Consolidated Financial Statements\nPage\nReport of Eide Bailly LLP (PCAOB ID Number 286)\nConsolidated Balance Sheets as of September 30, 2023 and 2022\nConsolidated Statements of Operations and Comprehensive Income (Loss) for the fiscal years ended September 30, 2023 and 2022\nConsolidated Statements of Stockholders Equity (Deficit) for the fiscal years ended September 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the fiscal years ended September 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors\nTrack Group, Inc.\nNaperville, IL\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Track Group, Inc. as of September 30, 2023 and 2022, and the related consolidated statements of operations and comprehensive income (loss), stockholders equity/(deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of Track Group, Inc. as of September 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to Track Group, Inc. in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Track Group, Inc. is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risk of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRecoverability of Goodwill\nAs discussed in Notes 2 and 13 to the consolidated financial statements, the Companys balance of goodwill was $7,851,466. The determination of the recoverability of goodwill requires management to make significant assumptions and complex judgments related to fair value of the goodwill. On an annual basis and at interim periods when circumstances require, management tests the recoverability of the Companys goodwill.\nWe identified the recoverability of goodwill as a critical audit matter. Auditing these complex judgments and assumptions involves especially challenging auditor judgment due to the nature and extent of audit evidence and effort required to address these matters, including the extent of specialized skill or knowledge needed.\nThe primary procedures we performed to address this critical audit matter included:\n●\nEvaluating managements analysis relating to their identification of reporting units, which is the unit of accounting for which goodwill is assigned and tested for impairment.\n●\nGaining an understanding of managements processes, controls and methodology for determining and developing the fair value estimate, including evaluating the appropriateness of the income approach and market approach used to develop the fair value estimate.\n●\nTesting the completeness, accuracy and relevance of the underlying data used in these fair value approaches.\n●\nEvaluating the significant assumptions used by management in the Companys income approach, including the amount and timing of cash flows throughout the forecasted period, the scheduled depreciation expense and capital expenditures necessary to sustain the business.\n●\nEvaluating whether the assumptions used by management were reasonable by considering (i) the past performance of the Company, (ii) the consistency of these assumptions with third-party industry and economic date, and (iii) whether these assumptions were consistent with evidence obtained in other areas of the audit.\n●\nUtilizing a valuation specialist to assist in testing the Companys fair value determination.\n/s/ Eide Bailly LLP\nWe have served as Track Group, Inc.s auditor since 2013. Hansen, Barnett and Maxwell, P.C., who joined Eide Bailly LLP in 2013, had served as the Companys auditor since 2005.\nDenver, Colorado\nDecember 20, 2023\nTRACK GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nAS OF SEPTEMBER 30, 2023 AND 2022\nSeptember 30,\nSeptember 30,\nAssets\nCurrent assets:\nCash\n$ 4,057,195\n$ 5,311,104\nAccounts receivable, net of allowances of $178,095 and $102,570, respectively\n4,536,916\n6,236,555\nPrepaid expense and deposits\n610,440\n769,006\nInventory, net of reserves of $3,772 and $0, respectively\n1,286,194\n1,053,245\nOther current assets\n-\n284,426\nTotal current assets\n10,490,745\n13,654,336\nProperty and equipment, net of accumulated depreciation of $1,920,850 and $1,829,588, respectively\n115,808\n170,329\nMonitoring equipment, net of accumulated depreciation of $6,348,695 and $5,950,639, respectively\n5,187,092\n3,624,101\nIntangible assets, net of accumulated amortization of $17,430,846 and $14,804,269, respectively\n14,157,294\n15,661,417\nGoodwill\n7,851,466\n8,061,002\nOther assets\n2,442,154\n3,509,655\nTotal assets\n$ 40,244,559\n$ 44,680,840\nLiabilities and Stockholders Equity (Deficit)\nCurrent liabilities:\nAccounts payable\n$ 2,796,712\n$ 2,858,915\nAccrued liabilities\n2,571,839\n3,042,443\nCurrent portion of long-term debt\n308,417\n456,681\nTotal current liabilities\n5,676,968\n6,358,039\nLong-term debt, net of current portion\n42,801,165\n42,979,243\nLong-term liabilities\n259,359\n398,285\nTotal liabilities\n48,737,492\n49,735,567\nCommitments and contingencies (Note 12)\nStockholders equity (deficit):\nCommon stock, $0.0001 par value: 30,000,000 shares authorized; 11,863,758 and 11,863,758 shares outstanding, respectively\n1,186\n1,186\nSeries A Convertible Preferred stock, $0.0001 par value: 1,200,000 shares authorized; 0 shares outstanding\n-\n-\nPaid in capital\n302,597,115\n302,437,593\nAccumulated deficit\n(309,610,397\n)\n(306,218,889\n)\nAccumulated other comprehensive loss\n(1,480,837\n)\n(1,274,617\n)\nTotal equity (deficit)\n(8,492,933\n)\n(5,054,727\n)\nTotal liabilities and stockholders equity (deficit)\n$ 40,244,559\n$ 44,680,840\nThe accompanying notes are an integral part of the financial statements.\nTRACK GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME/(LOSS)\nFOR THE FISCAL YEARS ENDED SEPTEMBER 30, 2023 AND 2022\nRevenue:\nMonitoring and other related services\n$ 33,503,687\n$ 35,768,090\nProduct sales and other\n972,178\n1,200,409\nTotal revenue\n34,475,865\n36,968,499\nCost of revenue:\nMonitoring, products and other related services\n15,915,300\n16,377,573\nDepreciation and amortization\n3,263,490\n3,237,970\nTotal cost of revenue\n19,178,790\n19,615,543\nGross profit\n15,297,075\n17,352,956\nOperating expense:\nGeneral & administrative\n10,275,695\n12,462,931\nSelling & marketing\n2,842,661\n2,993,749\nResearch & development\n2,735,060\n2,432,448\nDepreciation & amortization\n987,472\n1,563,729\nTotal operating expense\n16,840,888\n19,452,857\nOperating income (loss)\n(1,543,813\n)\n(2,099,901\n)\nOther income (expense):\nInterest income\n272,775\n162,975\nInterest expense\n(1,960,488\n)\n(1,991,302\n)\nCurrency exchange rate gain (loss)\n467,868\n(1,619,018\n)\nOther income/(expense), net\n-\n(959,628\n)\nTotal other income (expense)\n(1,219,845\n)\n(4,406,973\n)\nNet income (loss) before income taxes\n(2,763,658\n)\n(6,506,874\n)\nIncome tax expense\n627,850\n883,488\nNet income (loss) attributable to common stockholders\n(3,391,508\n)\n(7,390,362\n)\nForeign currency translation adjustments\n(206,220\n)\n(220,268\n)\nComprehensive income (loss)\n$ (3,597,728\n)\n$ (7,610,630\n)\nNet income (loss) per share - basic:\nNet income (loss) per common share\n$ (0.30\n)\n$ (0.64\n)\nWeighted average common shares outstanding\n11,863,758\n11,634,449\nNet income (loss) per share - diluted:\nNet income (loss) per common share\n$ (0.30\n)\n$ (0.64\n)\nWeighted average common shares outstanding\n11,863,758\n11,634,449\nThe accompanying notes are an integral part of the financial statements.\nTRACK GROUP, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY/(DEFICIT)\nFOR THE FISCAL YEARS ENDED SEPTEMBER 30, 2023 AND 2022\nCommon Stock\nPaid-in\nAccumulated\nComprehensive\nShares\nAmount\nCapital\nDeficit\nLoss\nTotal\nBalance as of October 1, 2022\n11,863,758\n$ 1,186\n$ 302,437,593\n$ (306,218,889\n)\n$ (1,274,617\n)\n$ (5,054,727\n)\nStock-based compensation\n-\n-\n159,522\n-\n-\n159,522\nForeign currency translation adjustments\n-\n-\n-\n-\n(206,220\n)\n(206,220\n)\nNet loss\n-\n-\n-\n(3,391,508\n)\n-\n(3,391,508\n)\nBalance as of September 30, 2023\n11,863,758\n$ 1,186\n$ 302,597,115\n$ (309,610,397\n)\n$ (1,480,837\n)\n$ (8,492,933\n)\nCommon Stock\nPaid-in\nAccumulated\nComprehensive\nShares\nAmount\nCapital\nDeficit\nLoss\nTotal\nBalance as of October 1, 2021\n11,524,978\n$ 1,152\n$ 302,250,954\n$ (298,828,527\n)\n$ (1,054,349\n)\n$ 2,369,230\nStock-based compensation\n-\n-\n207,547\n-\n-\n207,547\nIssuance of Common Stock to employees for services\n285,000\n(29\n)\n-\n-\n-\nForeign currency translation adjustments\n-\n-\n-\n-\n(220,268\n)\n(220,268\n)\nIssuance of Common Stock for options/warrants exercised\n53,780\n(5\n)\n-\n-\n-\nCash received for options/warrants exercised\n-\n-\n10,570\n-\n-\n10,570\nTax withheld on issuance of Common Stock for options/warrants exercised\n-\n-\n(31,444 )\n-\n-\n(31,444 )\nNet loss\n-\n-\n-\n(7,390,362\n)\n-\n(7,390,362\n)\nBalance as of September 30, 2022\n11,863,758\n$ 1,186\n$ 302,437,593\n$ (306,218,889\n)\n$ (1,274,617\n)\n$ (5,054,727\n)\nThe accompanying notes are an integral part of the financial statements.\nTRACK GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFOR THE FISCAL YEARS ENDED SEPTEMBER 30, 2023 AND 2022\nCash flows from operating activities:\nNet loss\n$ (3,391,508\n)\n$ (7,390,362\n)\nAdjustments to reconcile net loss to net cash provided by operating activities:\nBad debt expense/(recovery)\n4,250,962\n4,801,699\n(Recovery of)/Bad debt expense\n166,737\n(16,814\n)\nSales allowance\n23,065\n-\nStock-based compensation\n159,522\n207,547\nLoss on monitoring equipment included in cost of sales\n305,300\n280,783\nAmortization of debt issuance costs\n152,663\n137,540\nAmortization of monitoring center assets included in cost of revenue\n572,135\n494,001\nImpairment of intangible assets and loss from disposal of fixed assets\n-\n1,729,658\nIncome on forgiveness of expense/debt\n-\n(633,471\n)\nForeign currency exchange (gain)/loss\n(467,868\n)\n1,619,018\nChange in assets and liabilities:\nAccounts receivable, net\n1,509,837\n693,752\nInventories\n(234,262\n)\n(748,035\n)\nPrepaid expense, deposits and other assets\n1,376,822\n284,048\nAccounts payable and accrued expense\n(546,605\n)\n(656,403\n)\nNet cash provided by operating activities\n3,876,800\n802,961\nCash flow from investing activities:\nPurchase of property and equipment\n(40,083\n)\n(117,177\n)\nCapitalized software\n(1,020,604\n)\n(865,263\n)\nPurchase of monitoring equipment and parts\n(3,503,515\n)\n(2,077,840\n)\nNet cash used in investing activities\n(4,564,202\n)\n(3,060,280\n)\nCash flow from financing activities:\nPayment of deferred financing fees\n(44,151\n)\n-\nPrincipal payments on long-term debt\n(467,323\n)\n(494,626\n)\nEmployee tax withholdings related to net share settlement of equity-based awards\n-\n(31,444\n)\nProceeds from exercise of employee stock options\n-\n10,570\nNet cash used in financing activities\n(511,474\n)\n(515,500\n)\nEffect of exchange rate changes on cash\n(55,033\n)\n(337,239\n)\nNet decrease in cash\n(1,253,909\n)\n(3,110,058\n)\nCash, beginning of year\n5,311,104\n8,421,162\nCash, end of year\n$ 4,057,195\n$ 5,311,104\nCash paid for interest\n$ 1,894,972\n$ 1,870,204\nCash paid for taxes\n$ 670,231\n$ 212,268\nThe accompanying notes are an integral part of the financial statements.\nTRACK GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(1)\nOrganization and Nature of Operations\nGeneral\nThe Companys business is based on the leasing of patented tracking and monitoring solutions to federal, state and local law enforcement agencies, both in the U.S. and abroad, for the electronic monitoring of offenders and offering unique data analytics services on a platform-as-a-service (PaaS) business model. Currently, the Company deploys offender-based management services that combine patented GPS tracking technologies, full-time 24/7/365 global monitoring capabilities, case management, and proprietary data analytics. The Company offers customizable tracking solutions that leverage real-time tracking data, best-practices monitoring, and analytics capabilities to create complete, end-to-end tracking solutions.\nBusiness Condition. As of September 30, 2023 and 2022, the Company had an accumulated deficit of $309,610,397 and $306,218,889, respectively. The Company incurred a net loss of 3,391,508 and $7,390,362 for the years ended September 30, 2023 and 2022, respectively. On April 27, 2023, the Company announced a three-year extension of its $42.9 million debt to July 1, 2027 (See Note 7). The Company also has six notes payable maturing between January 2, 2024 and February 17, 2025 related to the construction of two monitoring centers for a contract in Chile, with outstanding balances due for the six notes totaling $365,983, net of deferred financing fees, at September 30, 2023 (See Note 7). The Companys ability to return to profitable operations is dependent upon generating a level of revenue adequate to support its cost structure, which it was close to achieving on an operating basis in the fiscal year ended September 30, 2022, excluding the approximate $1.7 million asset impairment and was close to achieving in the fiscal year ended September 30, 2023. Management has evaluated the significance of these conditions, as well as the recent change in the maturity date, and has determined that the Company can meet its operating obligations for a reasonable period. The Company expects to fund operations using cash on hand and through operational cash flows through the upcoming twelve months.\n(2)\nSummary of Significant Accounting Policies\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of Track Group, Inc. and its active wholly-owned subsidiaries, Track Group Analytics Limited, Track Group Americas, Inc., Track Group International LTD., and Track Group - Chile SpA. All significant inter-company transactions have been eliminated in consolidation.\nUse of Estimates in the Preparation of Financial Statements\nThe preparation of consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities as of the date of the financial statements and the reported amounts of revenue and expense during the period presented. Actual results could differ from those estimates. Estimates and assumptions are reviewed periodically and the effects of revisions are reflected in the consolidated financial statements in the period they are determined to be necessary. Significant estimates made in the accompanying consolidated financial statements include, but are not limited to, allowances for doubtful accounts and certain assumptions related to the recoverability of intangible assets and Goodwill.\nBusiness Combinations\nBusiness combinations are accounted for under the provisions of ASC 805-10, Business Combinations (ASC 805-10), which requires that the purchase method of accounting be used for all business combinations. Assets acquired and liabilities assumed at the date of acquisition are recorded at their respective fair values. ASC 805-10 also specifies criteria that intangible assets acquired in a business combination must meet to be recognized and reported apart from goodwill. Acquisition-related expense is recognized separately from the business combinations and are expensed as incurred. If the business combination provides for contingent consideration, the contingent consideration is recorded at its probable fair value at the acquisition date. Any changes in fair value after the acquisition date are accounted for as measurement-period adjustments if they pertain to additional information about facts and circumstances that existed at the acquisition date and that the Company obtained during the measurement period. Changes in fair value of contingent consideration resulting from events after the acquisition date, such as performance measures, are recognized in earnings.\nGoodwill represents costs in excess of purchase price over the fair value of the assets of businesses acquired, including other identifiable intangible assets.\nForeign Currency Translation\nThe Chilean Peso, New Israeli Shekel and the Canadian Dollar are used as functional currencies of the operating subsidiaries: (i) Track Group Chile SpA; (ii) Track Group International Ltd.; and (iii) Track Group Analytics Limited, respectively. The balance sheets of all subsidiaries have been converted into United States Dollars (USD) at the exchange rate prevailing at September 30, 2023. Their respective statements of operations have been translated into USD using the average exchange rates prevailing during the periods of each statement. The corresponding translation adjustments are part of accumulated other comprehensive income and are shown as part of stockholders equity.\nOther Intangible Assets\nOther intangible assets principally consist of patents, royalty purchase agreements, developed technology acquired, trade name, and capitalized software development costs. The Company accounts for other intangible assets in accordance with generally accepted accounting principles and does not amortize intangible assets with indefinite lives. Intangible assets with finite useful lives are amortized over their respective estimated useful lives, which range from three to twenty years. Intangible assets are reviewed for impairment annually or more frequently whenever events or changes in circumstances indicate possible impairment. See Note 13.\nFair Value of Financial Instruments\nThe carrying amounts reported in the accompanying consolidated financial statements for accounts receivable, other assets, accounts payable, accrued liabilities and debt obligations approximate fair values because of the immediate or short-term maturities of these financial instruments. The carrying amounts of our debt obligations approximate fair value as the interest rates approximate market interest rates.\nConcentration of Revenue & Credit Risk\nIn the normal course of business, the Company provides credit terms to its customers and requires no collateral. Accordingly, the Company performs credit evaluations of our customers' financial condition.\nThe Company had sales to entities, two of which each represent 10% or more of our gross revenue, as follows for the years ended September 30, 2023 and 2022.\n%\n%\nCustomer A\n$ 6,730,687\n%\n$ 6,095,403\n%\nCustomer B\n3,804,951\n%\n4,871,073\n%\nNo other customer represented more than 10% of the Companys total revenue for the fiscal years ended September 30, 2023 or 2022.\nConcentration of credit risk associated with the Companys total and outstanding accounts receivable as of September 30, 2023 and 2022, respectively, are shown in the table below:\n%\n%\nCustomer A\n$ 490,848\n%\n$ 1,346,854\n%\nCustomer B\n303,777\n%\n714,399\n%\nCustomer C\n630,494\n%\n675,725\n%\nCustomer D\n465,320\n%\n310,723\n%\nCash Equivalents\nCash equivalents consist of investments with original maturities to the Company of three months or less. The Company has cash in bank accounts that, at times, may exceed federally insured limits. The Company has not experienced any losses in such accounts. The Company had $3,715,850 and $3,037,903 of cash deposits in excess of federally insured limits as of September 30, 2023 and 2022, respectively.\nAccounts Receivable\nAccounts receivable, which is made up of trade receivables for monitoring and other related services, are carried at original invoice amount less an estimate made for doubtful receivables based on a review of all outstanding amounts on a monthly basis. The allowance is estimated by management based on certain assumptions and variables, including the customers financial condition, age of the customers receivables and changes in payment histories. Trade receivables are written off when deemed uncollectible. Recoveries of trade receivables previously written off are recorded when cash is received. A trade receivable is considered to be past due if any portion of the receivable balance has not been received by the Company within its normal terms. Interest income is not recorded on trade receivables that are past due, unless that interest is collected. For the fiscal years ended September 30, 2023 and September 30 2022, the Company wrote-off accounts receivables of $127,527 and $201,469, respectively. The Company also maintains an allowance for credit memos for estimated credit memos to be issued against current sales. Estimates of allowance for credit memos are based upon the application of a historical issuance lag period to the average credit memos issued each month. For the fiscal years ended September 30, 2023 and September 30 2022, the reserve for credit memos was $23,065 and $0 respectively.\nPrepaid Expense and Other\nPrepaid assets and other is comprised largely of performance bond deposits, tax deposits, vendor deposits and other prepaid supplier expenses. We generally expect deposits to be returned to the Company as cash within 12 months after the Companys contractual obligation has been completed and prepaid expenses to be allocated over the commitment.\nInventory\nInventory is valued at the lower of the cost or net realizable value. Cost is determined using the first-in/first-out method. Net realizable value is determined based on the item selling price. Inventory is periodically reviewed in order to identify obsolete or damaged items or impaired values.\nInventory consists of parts used for minor repairs of ReliAlert™, and other tracking devices as well as completed circuit boards used to manufacture new devices and components used to manufacture circuit boards. Completed and shipped ReliAlert™ and other tracking devices are reflected in Monitoring Equipment. As of September 30, 2023 and 2022, inventory consisted of the following:\nMonitoring equipment component boards inventory\n$ 1,289,966\n$ 1,053,245\nReserve for damaged or obsolete inventory\n(3,772\n)\n-\nTotal inventory, net of reserves\n$ 1,286,194\n$ 1,053,245\nThe Company uses a third-party fulfillment service provider. As a result of this service, the Companys employees do not actively assemble new products or repair a significant amount of monitoring equipment shipped directly from suppliers. Purchases of monitoring equipment are recognized directly. Management believes this process reduces maintenance and fulfillment costs associated with inventory and monitoring equipment. Management reviews inventory regularly to identify damaged or obsolete inventory and reserves for potential losses. The Company recorded charges of $3,772 and $0 during the years ended September 30, 2023 and 2022, respectively, for inventory that was obsolete, lost or damaged. Obsolete, lost and damaged items are expensed in Monitoring, products & other related services in the Consolidated Statement of Operations.\nProperty and Equipment\nProperty and equipment are stated at cost, less accumulated depreciation. Depreciation is determined using the straight-line method over the estimated useful lives of the assets, typically three to seven years. Leasehold improvements are depreciated over the shorter of the estimated useful life of the asset or the term of the lease. Expenditures for maintenance and repairs are expensed while renewals and improvements are capitalized.\nProperty and equipment consisted of the following as of September 30, 2023 and 2022, respectively:\nEquipment, software and tooling\n$ 1,427,522\n$ 1,399,288\nAutomobiles\n4,460\n4,187\nLeasehold improvements\n382,122\n380,586\nFurniture and fixtures\n222,554\n215,856\nTotal property and equipment before accumulated depreciation\n2,036,658\n1,999,917\nAccumulated depreciation\n(1,920,850\n)\n(1,829,588\n)\nProperty and equipment, net of accumulated depreciation\n$ 115,808\n$ 170,329\nProperty and equipment to be disposed of is reported at the lower of the carrying amount or fair value, less the estimated costs to sell and any gains or losses are included in the results of operations. During the fiscal years ended September 30, 2023 and September 30, 2022, the Company disposed of $8,669 and $794,555 fixed assets, respectively. Internally developed software costs related to the Companys monitoring platform are recorded as intangible assets on the Consolidated Balance Sheet.\nDepreciation expense recognized for property and equipment for the fiscal years ended September 30, 2023 and 2022 was $95,099 and $144,054, respectively. Depreciation expense for property and equipment is recognized in operating expense in the Consolidated Statements of Operations.\nMonitoring Equipment\nThe Company leases monitoring equipment to agencies for offender tracking under contractual service agreements. The monitoring equipment is depreciated using the straight-line method over an estimated useful life of between one and three years for customer tablets and three to five years for monitoring devices. Monitoring equipment as of September 30, 2023 and 2022 is as follows:\nMonitoring equipment\n$ 11,535,787\n$ 9,574,740\nLess: accumulated depreciation\n(6,348,695\n)\n(5,950,639\n)\nMonitoring equipment, net of accumulated depreciation\n$ 5,187,092\n$ 3,624,101\nDepreciation expense for the fiscal years ended September 30, 2023 and 2022 was $1,539,234 and $1,380,558, respectively. This expense was classified as a cost of revenue in the Consolidated Statements of Operations.\nDuring the fiscal years ended September 30, 2023 and 2022, the Company recorded charges of $305,300 and $280,783, respectively, for devices that were lost, stolen or damaged. Lost, stolen and damaged items are expensed in Monitoring, product and other related services in the Consolidated Statements of Operations.\nImpairment of Long-Lived Assets and Goodwill\nThe Company reviews long-lived assets for impairment when events or changes in circumstances indicate that the book value of an asset may not be recoverable, and in the case of goodwill, at least annually. The Company evaluates whether events and circumstances have occurred which indicate possible impairment as of each balance sheet date. If the carrying amount of an asset exceeds its fair value, an impairment charge is recognized for the amount by which the carrying amount exceeds the estimated fair value of the asset. Impairment of long-lived assets is assessed at the lowest levels for which there is an identifiable fair value that is independent of other groups of assets. See Note 13.\nRevenue Recognition\nOur revenue is predominantly derived from two sources: (i) monitoring services, and (ii) product sales.\nMonitoring and Other Related Services\nMonitoring services include two components: (i) lease contracts pursuant to which the Company provides monitoring services and leased devices to distributors or end users and the Company retains ownership of the leased device; and (ii) monitoring services purchased by distributors or end users who have previously purchased monitoring devices and opt to use the Companys monitoring services. The rates for leased devices and monitoring services are considered to be stated at their individual stand-alone selling prices. The Company recognizes revenue on leased devices and monitoring services at the end of each month the services have been provided and payment terms are 30 days from invoice date. In those circumstances in which the Company receives payment in advance, the Company records these payments as deferred revenue.\nProduct Sales and Other\nThe Company sells devices and replacement parts to customers under certain contracts, as well as law enforcement software licenses and maintenance, and analytical software. Revenue transactions associated with the sale of devices and replacement parts comprise a single performance obligation. We satisfy the performance obligation when the Company has transferred control of the product to the customer and they receive substantially all of the benefits. Transfer of control passes to customers upon shipment or upon receipt depending on the country of the sale and the agreement with the customer. The transaction price is determined based upon the invoiced sales price and payment terms for the transaction depends on the agreement with the customer and payment is generally required within 60 days or less of shipment. The Company recognizes revenue from other services as the customer receives services and the Company has the right to payment. When purchasing products (such as ReliAlert™ devices) from the Company, customers may, but are not required to, enter into monitoring service contracts with us. The Company recognizes revenue on monitoring services for customers that have previously purchased devices at the end of each month that monitoring services have been provided.\nMultiple Element Arrangements\nThe majority of our revenue transactions do not have multiple elements. However, on occasion, the Company may enter into revenue transactions that have multiple elements. These may include different combinations of products or services that are included in a single billable rate. These products or services are delivered over time as the customer utilizes our services. In cases where obligations in a contract are distinct and thus require separation into multiple performance obligations, revenue recognition guidance requires that contract consideration be allocated to each distinct performance obligation based on its relative standalone selling price. The value allocated to each performance obligation is then recognized as revenue when the revenue recognition criteria for each distinct promise or bundle of promises has been met. There were no multiple element arrangements for the years ended September 30, 2023 and 2022.\nOther Matters\nThe Company considers an arrangement with payment terms longer than the Companys normal terms not to be fixed or determinable. Normal payment terms for the sale of monitoring services and products are due upon receipt to 30 days. The Company sells devices and services directly to end users and to distributors. Distributors do not have general rights of return. Also, distributors have no price protection or stock protection rights with respect to devices sold to them by us. Generally, title and risk of loss pass to the buyer upon delivery of the devices.\nShipping and handling fees charged to customers are included as part of total revenue. The related freight costs and supplies directly associated with shipping products to customers are included as a component of cost of revenue.\nResearch and Development Costs\nThe Company expenses research and development costs as incurred.\nDuring the fiscal year ended September 30, 2023 and September 30, 2022, the Company incurred research and development expense of $2,735,060 and $2,432,448, respectively.\nAdvertising Costs\nThe Company expenses advertising costs as incurred. Advertising expense for the fiscal years ended September 30, 2023 and 2022 was $13,707 and $14,037, respectively.\nStock-Based Compensation\nThe Company recognizes compensation expense for stock-based awards expected to vest on a straight-line basis over the requisite service period of the award based on their grant date fair value. The fair value of stock options is estimated using a Black-Scholes option pricing model, which requires management to make estimates for certain assumptions regarding risk-free interest rate, expected life of options, expected volatility of stock and expected dividend yield of stock. Outstanding restricted stock units are amortized over the vesting period. We recorded $159,522 and $207,547 of expense related to these awards for fiscal years ended September 30, 2023 and 2022, respectively.\nIncome Taxes\nThe Company recognizes deferred income tax assets or liabilities for the expected future tax consequences of events that have been recognized in the financial statements or income tax returns. Deferred income tax assets or liabilities are determined based upon the difference between the financial statement and tax bases of assets and liabilities using enacted tax rates expected to apply when the differences are expected to be settled or realized. Deferred income tax assets are reviewed periodically for recoverability and valuation allowances are provided as necessary.\nThe tax effects from uncertain tax positions can be recognized in the financial statements, provided the position is more likely than not to be sustained on audit, based on the technical merits of the position. We recognize the financial statement benefits of a tax position only after determining that the relevant tax authority would more likely than not sustain the position following an audit. For tax positions meeting the more-likely-than-not threshold, the amount recognized in the financial statements is the largest benefit that has a greater than 50 percent likelihood of being realized, upon ultimate settlement with the relevant tax authority. The Company applied the foregoing accounting standard to all of our tax positions for which the statute of limitations remained open as of the date of the accompanying consolidated financial statements.\nThe Company's policy is to recognize interest and penalties related to income tax issues as components of other noninterest expense. As of September 30, 2023 and September 30, 2022, we did not record a liability for uncertain tax positions.\nNet Income (Loss) Per Common Share\nBasic net income (loss) per common share (Basic EPS) is computed by dividing net income (loss) available to common stockholders by the weighted average number of common shares outstanding during the period.\nDiluted net income (loss) per common share (Diluted EPS) is computed by dividing net income (loss) attributable to common stockholders by the sum of the weighted-average number of common shares outstanding and the weighted-average dilutive common share equivalents outstanding. The computation of Diluted EPS does not assume exercise or conversion of securities that would have an anti-dilutive effect.\nCommon share equivalents consist of shares issuable upon the exercise of options and warrants to purchase shares of the Companys Common Stock, par value $0.0001 per share (Common Stock). As of September 30, 2023, none of the outstanding common share equivalents were included in the computation of diluted net income per common share as their effect would be anti-dilutive. The Common Stock equivalents outstanding as of September 30, 2023 and 2022 (excluding 25,352 options that expired unexercised on October 14, 2022) consisted of the following:\nIssuable Common Stock options and warrants\n4,688\n160,881\nTotal Common Stock equivalents\n4,688\n160,881\nAt September 30, 2023 and 2022, all stock options and warrants had exercise prices that were above the market price of $0.49 per share and $0.51, respectively and have not been included in the diluted earnings per share calculations.\nRecent Accounting Pronouncements\nRecently Adopted Accounting Standards\nFrom time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board (FASB) or other standard setting bodies, which are adopted by the Company as of the specified effective date. The Company considers the applicability and impact of all Accounting Standards Updates (ASUs) issued by the Financial Accounting Standards Board. ASUs not listed below were assessed and determined to be either not applicable or are expected to have minimal impact on the Company's Consolidated Financial Statements.\nRecently Issued Accounting Standards\nIn January 2017, the FASB issued Accounting Standards Update (ASU) 2017-04, Intangibles - Goodwill and Other: Simplifying the Test for Goodwill Impairment (ASU 2017-04). ASU 2017-04 simplifies the subsequent measurement of goodwill by removing the second step of the two-step impairment test. The amendment requires an entity to perform its annual or interim goodwill impairment test by comparing the fair value of a reporting unit with the carrying amount. An entity still has the option to perform the qualitative assessment for a reporting unit to determine if the quantitative impairment test is necessary. ASU 2017-04 became effective for accelerated filing companies for annual periods or any interim goodwill impairment tests in fiscal years beginning after December 15, 2019 and all other entities should adopt the amendments in ASU 2017-04 for its annual or any interim goodwill impairment tests in fiscal years beginning after December 15, 2022. The amendment should be applied on a prospective basis. Early adoption is permitted for interim or annual goodwill impairment tests performed on testing dates after January 1, 2017. The Company will adopt ASU 2017-04 in the fiscal year 2024. The Company has determined this adoption will not have a significant impact on its consolidated financial position, results of operations, or cash flows.\nIn June 2016, the FASB issued ASU 2016-13, Measurement of Credit Losses on Financial Instruments (ASU 2016-13). ASU 2016-13 adds a current expected credit loss (CECL) impairment model to GAAP that is based on expected losses rather than incurred losses. Modified retrospective adoption is required with any cumulative-effect adjustment recorded to retained earnings as of the beginning of the period of adoption. ASU 2016-13 became effective for fiscal years beginning after December 15, 2019, excluding smaller reporting entities, which will be effective for fiscal years beginning after December 15, 2022. The Company will adopt ASU 2016-13 in fiscal year 2024. The Company does not expect the application of the CECL impairment model to have a significant impact on our allowance for uncollectible amounts for accounts receivable.\n(3)\nRevenue Recognition\nMonitoring and Other Related Services. Monitoring services include two components: (i) lease contracts pursuant to which the Company provides monitoring services and lease devices to distributors or end users and the Company retains ownership of the leased device; and (ii) monitoring services purchased by distributors or end users who have previously purchased monitoring devices and opt to use the Companys monitoring services. Sales of devices and leased GPS devices are required to use the Companys monitoring service and both the GPS leased devices and monitoring services are accounted for as a single performance obligation. Monitoring revenue is recognized ratably over time, as the customer simultaneously receives and consumes the benefit of these services as they are performed. Payment due or received from the customers prior to rendering the associated services are recorded as deferred revenue.\nThe balance of accounts receivable at September 30, 2023 of $4,536,916 includes an unbilled balance of $490,848. The balance of accounts receivable at September 30, 2022 of $6,236,555 includes an unbilled balance of $777,514, and the balance of accounts receivable at October 1, 2021 of $7,163,615 includes an unbilled balance of $420,697. The balance of the deferred revenue at September 30, 2023, September 30, 2022 and October 1, 2021 was $431, $3,299, and $22,500 respectively, and were included in accrued liabilities on the Consolidated Balance Sheets. The Company recognized $12,928 and $120,958 of deferred revenue in the fiscal years ended September 30, 2023 and September 30, 2022, respectively.\nProduct Sales and Other. The Company sells devices and replacement parts to customers under certain contracts, as well as law enforcement software licenses and maintenance, and analytical software. Revenue from the sale of devices and parts is recognized upon their transfer of control to the customer, which is generally upon delivery. Delivery is considered complete at either the time of shipment or arrival at destination, based on the agreed upon terms within the contract. Payment terms are generally 30 days from the invoice date.\nMultiple Element Arrangements. The majority of our revenue transactions do not have multiple elements. However, on occasion, the Company may enter revenue transactions that have multiple elements. These may include different combinations of products or services that are included in a single billable rate. These products or services are delivered over time as the customer utilizes our services. In cases where obligations in a contract are distinct and thus require separation into multiple performance obligations, revenue recognition guidance requires that contract consideration be allocated to each distinct performance obligation based on its relative standalone selling price. The value allocated to each performance obligation is then recognized as revenue when the revenue recognition criteria for each distinct promise or bundle of promises has been met. There were no multiple element arrangements for the years ended September 30, 2023 and 2022.\nThe standalone selling price for each performance obligation is an amount that depicts the amount of consideration to which the entity expects to be entitled in exchange for transferring the good or service. When there is only one performance obligation associated with a contract, the entire sale value is attributed to that obligation. When a contract contains multiple performance obligations the transaction value is first allocated using the observable price, which is generally a list price, net of applicable discount, or the price used to sell in similar circumstances. In circumstances when a selling price is not directly observable, the Company will estimate the standalone selling price using information available to us.\nThe following tables present the Companys revenue disaggregated by geography, based on managements assessment of available data:\nYear Ended September 30, 2023\nYear Ended September 30, 2022\nTotal\nRevenue\n% of Total\nRevenue\nTotal\nRevenue\n% of Total\nRevenue\nUnited States\n$ 24,295,601\n%\n$ 26,427,402\n%\nLatin America\n9,370,160\n%\n9,389,482\n%\nOther\n810,104\n%\n1,151,615\n%\nTotal\n$ 34,475,865\n%\n$ 36,968,499\n%\nThe above table includes total revenue for the Company, of which monitoring and other related services is the majority (approximately 97% for fiscal years ended September 30, 2023 and 2022) of the Companys revenue. Latin America includes Bahamas, Chile, Mexico, Puerto Rico and the U.S. Virgin Islands. Other includes Canada, New Zealand, Saudi Arabia, South Africa, the United Kingdom and Vietnam.\n(4)\nOther Assets\nAs of September 30, 2023 and September 30, 2022, respectively, the balance of other assets was $2,442,154 and $3,509,655, respectively. Other assets at September 30, 2023 are comprised largely of cash used as collateral for Performance Bonds as well as contractually required monitoring center and other equipment, right of use assets, lease deposits and other long-term assets. The Company anticipates these performance bonds will be reimbursed to the Company upon completion of its contracts with the customer. See Note 12.\nThe Company was contractually obligated to construct and equip two monitoring centers for an international customer, as well as supply equipment for the customers satellite locations, which have been owned by the customer since construction was completed. The monitoring center equipment is amortized using the straight-line method over the contract period between 32 and 40 months. Monitoring center equipment as of September 30, 2023 and 2022, was as follows:\nSeptember 30,\nSeptember 30,\nMonitoring center equipment\n$ 1,619,278\n$ 1,520,115\nLess: accumulated amortization\n(1,088,825\n)\n(524,178\n)\nMonitoring center equipment, net of accumulated amortization\n$ 530,453\n$ 995,937\nThe Santiago and Puerto Montt monitoring centers amortization is recorded in Monitoring, products and other related service costs on the Condensed Consolidated Statements of Operations. Amortization of costs related to the Santiago and Puerto Montt monitoring centers for the twelve-months ended September 30, 2023 and 2022 were $572,135 and $494,001, respectively. The Company recorded revenue from the customer based on a contractually agreed upon unit per day amount during the contract period. See Note 7 for details of the borrowings related to the monitoring centers construction and equipment.\n(5)\nAccrued Liabilities\nAccrued liabilities consisted of the following as of September 30, 2023 and 2022:\nSeptember 30,\nSeptember 30,\nAccrued payroll, taxes and employee benefits\n$ 1,116,036\n$ 1,412,055\nDeferred revenue\n3,299\nAccrued taxes - foreign and domestic\n260,697\n371,293\nAccrued other expense\n108,476\n123,752\nAccrued legal and other professional costs\n80,210\n57,905\nAccrued costs of revenue\n410,726\n352,060\nRight of use liability\n143,846\n177,431\nDeferred financing fees\n-\n88,685\nAccrued interest\n451,417\n455,963\nTotal accrued liabilities\n$ 2,571,839\n$ 3,042,443\n(6)\nRelated Parties\nETS Limited is currently the beneficial owner of 4,706,579 shares of the Company's Common Stock (the Track Group Shares) held by ADS Securities LLC (ADS) under an agreement dated September 28, 2017, pursuant to which ADS transferred all the Track Group Shares to ETS Limited in exchange for all the outstanding shares of ETS Limited. A Director of ETS Limited was elected to the Company's current Board of Directors (the Board) on February 7, 2018 and is still serving on the Board in his current capacity as a senior executive at ADS.\n(7)\nDebt Obligations\nDebt obligations, net of debt issuance costs, as of September 30, 2023 and 2022 consisted of the following:\nSeptember 30,\nSeptember 30,\nThe unsecured loan (the Amended Facility Agreement) from Conrent Invest S.A. (Conrent) whereby, as of March 1, 2021, the Company had borrowed $42,864,000, bearing interest at a rate of 4% per annum, payable in arrears annually beginning July 1, 2021, with all principal and accrued and unpaid interest due on July 1, 2024. On April 26, 2023, the Company and Conrent entered into an amendment to the facility agreement, which extended the maturity date from July 1, 2024 to July 1, 2027. Interest payments are scheduled to be made on June 30 and December 31 each year. Unamortized issuance costs at September 30, 2023 are $120,401. As of September 30, 2023, $42,864,000 of principal and $438,165 of interest was owed to Conrent. The Company paid Conrent interest of $1,738,373 for the year ended September 30, 2023.\n$ 42,743,599\n$ 42,653,649\nThe unsecured Note Payable Agreement with HP Financial Services Chile Limitada bearing interest at a rate of 6.56% per annum, with a maturity date of February 6, 2024.\n11,435\n35,335\nThe unsecured Note Payable Agreement with Banco Santander, net of unamortized issuance costs $4,837, bearing interest at a rate of 5.04% per annum, with a maturity date of May 11, 2024.\n77,670\n177,463\nThe unsecured Note Payable Agreement with Banco Estado, net of unamortized issuance costs of $1,976, bearing interest at a rate of 3.50% per annum, with a maturity date of January 2, 2024.\n36,773\n135,521\nThe unsecured Note Payable Agreement with HP Financial Services Chile Limitada bearing interest at a rate of 6.61% per annum, with a maturity date of March 4, 2024.\n29,118\n79,375\nThe unsecured Note Payable Agreement with Banco de Chile, net of unamortized issuance costs of $57, bearing interest at a rate of 2.54% per annum, with a maturity date of March 4, 2024.\n18,440\n51,278\nThe unsecured Note Payable Agreement with Banco de Chile, net of unamortized issuance costs of $10,807, bearing interest at a rate of 3.12% per annum, with a maturity date of February 17, 2025.\n192,547\n303,303\nTotal debt obligations\n43,109,582\n43,435,924\nLess: current portion\n(308,417\n)\n(456,681\n)\nLong-term debt, less current portion\n$ 42,801,165\n$ 42,979,243\nOn December 21, 2020, Conrent and the Company signed an amendment to the Amended Facility Agreement which extended the maturity date of the Amended Facility Agreement to July 1, 2024 (Amended Facility), capitalized the accrued and unpaid interest increasing the outstanding principal amount and reduced the interest rate of the Amended Facility from 8% to 4%. On April 26, 2023, the Company and Conrent entered into another amendment to the facility agreement (the Amendment) originally executed by and between the parties on December 30, 2013 and amended multiple times (the Amended Facility Agreement). The latest Amendment: (i) extended the maturity date from July 1, 2024, to July 1, 2027; (ii) amended the applicable interest rate resulting in an escalating interest rate as follows: 4% through June 30, 2024, 5% through June 30, 2025, 5.5% through June 30, 2026, and 6% through the maturity date and (iii) removed section 7.3 Change of Control of the Amended Facility Agreement. In return, the Company agreed to pay certain fees to Conrent. As of September 30, 2023, $42,864,000 of principal and $438,165 of interest was owed to Conrent.\nOn January 6, 2021, the Company borrowed 70,443,375 Chilean Pesos (CLP) ($101,186USD) from HP Financial Services Chile Limitada (the HP Note 1). To facilitate the HP Note 1, the Company entered into a Note Payable Agreement with HP Financial Services Chile Limitada as the lender. The HP Note 1 was used to purchase PABX (private automatic branch exchange phone equipment) for the construction of the Gendarmeria de Chile monitoring centers in Santiago and Puerto Montt, Chile (the Santiago Monitoring Center and Puerto Montt Monitoring Center, respectively). The HP Note 1 bears an interest rate of 6.56% per annum, payable monthly with principal beginning February 2021, and a maturity date of February 6, 2024.\nOn January 12, 2021, the Company borrowed 347,198,500CLP ($482,965USD), net of 2,801,500CLP fees ($3,897USD), from Banco Santander (the Banco Santander Note). To facilitate the Banco Santander Note, the Company entered into a Note Payable Agreement with Banco Santander as the lender. The Banco Santander Note was used for the construction of the Santiago Monitoring Center and remodeling a temporary monitoring center. The Banco Santander Note bears interest at a rate of 5.04% per annum, payable monthly with principal beginning February 2021, and a maturity of May 11, 2024. The Company also paid 19,607,843CLP ($27,275USD) in broker fees which are amortized over the life of the loan.\nOn February 2, 2021, the Company borrowed 247,999,300CLP ($338,954USD), net of 2,000,700CLP fees ($2,734USD), from Banco Estado (the Banco Estado Note). To facilitate the Banco Estado Note, the Company entered into a Note Payable Agreement with Banco Estado as the lender. The Banco Estado Note was used for the construction of the Santiago Monitoring Center and computer equipment for Gendarmeria branch offices. The Banco Estado Note bears interest at a rate of 3.50% per annum, initially having a 6-month grace period with the first payment including the 6 months of interest plus 1 month of principal on August 2, 2021, then monthly interest with principal, and a maturity date of January 2, 2024. The Company also paid 14,124,294CLP ($19,304USD) in broker fees which are amortized over the life of the loan.\nOn February 4, 2021, the Company borrowed 149,794,432CLP ($205,330USD) from HP Financial Services Chile Limitada (the HP Note 2). To facilitate the HP Note 2, the Company entered into a Note Payable Agreement with HP Financial Services Chile Limitada as the lender. The HP Note 2 was used to purchase computer equipment for the Santiago Monitoring Center. The HP Note 2 bears interest at a rate of 6.61% per annum, payable monthly with principal beginning March 2021, and a maturity of March 4, 2024.\nOn February 5, 2021, the Company borrowed 99,808,328CLP ($136,564USD), net of 210,485CLP fees ($286USD), from Banco de Chile (the Banco de Chile Note 1). To facilitate the Banco de Chile Note, the Company entered into a Note Payable Agreement with Banco de Chile as the lender. The Banco de Chile Note was used to purchase HVAC equipment for the Santiago Monitoring Center. The Banco de Chile Note bears interest at a rate of 2.54% per annum, payable monthly with principal beginning March 2021, and a maturity date of March 4, 2024.\nOn February 15, 2021, the Company borrowed 500,000,000CLP ($678,214USD) from Banco de Chile (the Banco de Chile Note 2). To facilitate the Banco de Chile Note 2, the Company entered into a Note Payable Agreement with Banco de Chile as the lender. The Banco de Chile Note 2 was used as working capital and to complete the construction of the Puerto Montt Monitoring Center. The Banco de Chile Note 2 bears interest at a rate of 3.12% per annum, payable monthly with principal beginning March 2021, and a maturity of February 17, 2025. The Company also paid 28,248,588CLP ($38,317USD) in broker fees which are amortized over the life of the loan.\nThe following table summarizes our future maturities of debt obligations, net of the amortization of debt discounts as of September 30, 2023:\nTwelve months ended September 30:\nTotal\n$ 322,915\n60,745\n-\n42,864,000\nTotal\n43,247,660\nIssuance costs\n(138,078\n)\nDebt obligations, net of unamortized issuance costs\n$ 43,109,582\n(8)\nPreferred Stock\nThe Companys Certificate of Incorporation authorizes it to issue up to 20,000,000 shares of preferred stock, $0.0001 par value per share (Preferred Stock), of which 1,200,000 shares have been designated as Series A Convertible Preferred Stock (Series A Preferred). The Companys Board of Directors has the authority to amend its Certificate of Incorporation, without further stockholder approval, to designate and determine, in whole or in part, the preferences, limitations and relative rights of the preferred stock before any issuance of the Preferred Stock and to create additional series of Preferred Stock.\nSeries A Convertible Preferred Stock\nOn October 12, 2017, the Company filed a Certificate of Designation of the Relative Rights and Preferences (Certificate of Designation) with the Delaware Division of Corporations, designating 1,200,000 shares of the Companys preferred stock as Series A Preferred. Shares of Series A Preferred rank senior to the Companys Common Stock, and all other classes and series of equity securities of the Company that by their terms do not rank senior to the Series A Preferred.\nExcept with respect to transactions upon which holders of the Series A Preferred are entitled to vote separately as a class under the terms of the Certificate of Designation, the Series A Preferred has no voting rights. The shares of Common Stock into which the Series A Preferred is convertible shall, upon issuance, have all of the same voting rights as other issued and outstanding shares of our Common Stock.\nThe Series A Preferred has no separate dividend rights; however, whenever the Board declares a dividend on the Companys Common Stock, if ever, each holder of record of a share of Series A Preferred shall be entitled to receive an amount equal to such dividend declared on one share of Common Stock multiplied by the number of shares of Common Stock into which such share of Series A Preferred could be converted on the Record Date.\nEach share of Series A Preferred has a Liquidation Preference of $35.00 per share, and is convertible, at the holders option, into ten shares of the Companys Common Stock, subject to adjustments as set forth in the Certificate of Designation, at any time beginning five hundred and forty days after the date of issuance.\nAs of September 30, 2023, there were no shares of Series A Preferred issued and outstanding.\n(9)\nCommon Stock\nCommon Stock Issuances\nThe Company is authorized to issue up to 30,000,000 shares of Common Stock, $0.0001 par value per share.\nThere were no issuances of Common Stock in fiscal year 2023.\nOn December 28, 2021, a member of the Board of Directors received 7,283 shares of Common Stock by exercising 7,283 options.\nOn December 30, 2021, a member of the Board of Directors received 9,191 shares of Common Stock by exercising 9,191 options.\nOn April 14, 2022, a member of the Board of Directors received an after-tax total of 37,306 shares of Common Stock by exercising 64,665 and 8,868 warrants, through a net exercise provision of the Common Stock Purchase Warrant Agreement and the payment of taxes.\nOn April 13, 2022, a member of management received an award of 185,000 shares of Common Stock based on a Restricted Stock Agreement.\nOn April 13, 2022, another employee received an award of 100,000 shares of Common Stock based on a Restricted Stock Agreement.\n(10)\nStock Options and Warrants\nStock Incentive Plan\nAt the annual meeting of stockholders on April 13, 2022, our stockholders approved the 2022 Omnibus Equity Incentive Plan (the 2022 Plan), previously approved by the Companys Board. The 2022 Plan provides for the grant of incentive options and nonqualified options, restricted stock, stock appreciation rights, performance shares, performance stock units, dividend equivalents, stock payments, deferred stock, restricted stock units, other stock-based awards and performance-based awards to employees and certain non-employees who provide services to the Company in lieu of cash. A total of 500,000 shares are authorized for issuance pursuant to awards granted under the 2022 Plan.\nThe 2022 Plan supersedes and replaces the Companys 2012 Equity Compensation Plan (the 2012 Plan). As of June 30, 2020, the Board suspended further awards under the 2012 Plan. Any awards outstanding under the 2012 Plan will remain subject to the 2012 Plan. All shares of Common Stock remaining authorized and available for issuance under the 2012 Plan and any shares subject to outstanding awards under the 2012 Plan that subsequently expire, terminate, or are surrendered or forfeited for any reason without issuance of shares will automatically become available for issuance under our 2022 Plan.\nThere were no issuances of restricted shares in fiscal year 2023.\nOn April 13, 2022, the Company issued 285,000 restricted shares, at a grant date value of $1.30, to members of its executive team from the 2022 Plan with a total value of $370,500. The restricted shares are amortized over the vesting period. One-third of the restricted shares vested on the grant date and one-third of the restricted shares vested on October 13, 2022 and October 13, 2023, respectively.\nThe Company recorded expense of $159,522 and $207,547 during the fiscal years ended September 30, 2023 and 2022, respectively. As of September 30, 2023 there were 215,000 shares of Common Stock available for issuance under the 2022 Plan.\nAll Options and Warrants\nThe fair value of each stock option and warrant grant is estimated on the date of grant using the Black-Scholes option-pricing model. During the fiscal years ended September 30, 2023 and 2022, the Company granted no options and warrants to purchase shares of Common Stock under the 2022 Plan or under the 2012 Plan. The Company recorded no expense for the fiscal years ended September 30, 2023 and 2022, respectively, related to the issuance and vesting of outstanding stock options and warrants.\nAll options and warrants have vested and are exercisable at September 30, 2023 and no future issuances are expected.\nAs of September 30, 2023, no compensation expense associated with unvested stock options and warrants issued previously to members of the Board of Directors will be recognized over the next year.\nA summary of the compensation-based options and warrants activity for the fiscal years ended September 30, 2023 and 2022 is presented below:\nShares\nUnder\nOption\nWeighted\nAverage\nExercise\nPrice\nWeighted\nAverage\nRemaining\nContractual\nLife (years)\nAggregate\nIntrinsic\nValue\nOutstanding as of September 30, 2021\n457,075\n$ 1.74\n1.04\n$ 779,977\nGranted\n-\n-\n-\n-\nExpired\n(196,097\n)\n(2.41\n)\n-\n-\nExercised\n(100,097\n)\n(1.23\n)\n-\n-\nOutstanding as of September 30, 2022\n160,881\n$ 1.24\n0.60\n$ -\nGranted\n-\n-\n-\n-\nExpired\n(156,193 )\n(1.24 )\n-\n-\nExercised\n-\n-\n-\n-\nOutstanding as of September 30, 2023\n4,688\n$ 1.24\n0.25\n$ -\nExercisable as of September 30, 2023\n4,688\n$ 1.24\n0.25\n$ -\nThe aggregate intrinsic value is calculated as the difference between the exercise price of the underlying awards and the closing stock price of $0.49 of the Companys common stock on September 30, 2023.\n(11)\nIncome Taxes\nThe Company recognizes deferred income tax assets or liabilities for the expected future tax consequences of events that have been recognized in the financial statements or income tax returns. Deferred income tax assets or liabilities are determined based upon the difference between the financial statement and tax bases of assets and liabilities using enacted tax rates expected to apply when the differences are expected to be settled or realized. Deferred income tax assets are reviewed periodically for recoverability and valuation allowances are provided as necessary. Interest and penalties related to income tax liabilities, when incurred, are classified in interest expense and income tax provision, respectively. Deferred tax liabilities are recorded in Accrued liabilities on the Consolidated Balance Sheets.\nFor the fiscal years ended September 30, 2023 and 2022, the Company incurred no net losses for income tax purposes. The amount and ultimate realization of the benefits from the net operating losses is dependent, in part, upon the tax laws in effect, our future earnings, and other future events, the effects of which cannot be determined. The Company has established a valuation allowance for all deferred income tax assets not offset by deferred income tax liabilities due to the uncertainty of their realization. Accordingly, there is no benefit for income taxes in the accompanying statements of operations.\nAt September 30, 2023, the Company had net carryforwards available to offset future taxable income of approximately $163,702,643, $4,590,967 of which expires during the year ended September 30, 2023. The utilization of the net loss carryforwards is dependent upon the tax laws in effect at the time the net operating loss carryforwards can be utilized. The Internal Revenue Code contains provisions that likely could reduce or limit the availability and utilization of these net operating loss carryforwards. An ownership change generally affects the rate at which NOLs and potentially other deferred tax assets are permitted to offset future taxable income. Since the Company maintains a full valuation allowance on all U.S. and state deferred tax assets, the impact of prior year ownership changes on the future realizability of U.S. and state deferred tax assets did not result in an impact to the provision for income taxes for the year ended September 30, 2023, or on net deferred tax asset as of September 30, 2022. In the past, ownership changes of the Company resulted in a Sec. 382 limitation on the future realizability of U.S. state NOLs. Since the Company maintains a full valuation allowance on all U.S. and state deferred tax assets, the impact of the Sec. 382 limitation did not result in an impact to the provision for income taxes for the year ended September 30, 2023, or on net deferred assets as of September 30, 2023.\nThe Company files income tax returns in the U.S. federal jurisdiction and various state and foreign jurisdictions. The tax provision for the year ended September 30, 2023 was due primarily to taxes on the income of a foreign-based subsidiary and U.S. state and local income taxes.\nThe deferred income tax assets (liabilities) were comprised of the following for the periods indicated:\nFiscal Years Ended\nSeptember 30,\nNet loss carryforwards\n$ 33,396,062\n$ 34,261,003\nAccruals and reserves\n(44,816\n)\n723,617\nSeverance indemnity reserve\n98,735\n76,918\nContributions\n3,911\n2,478\nDepreciation and amortization\n(378,920 )\n(219,722\n)\nStock-based compensation\n93,031\n109,397\nInterest Expense Carryforward\n397,566\n-\nValuation allowance\n(33,661,255\n)\n(35,182,109\n)\nTotal\n$ (95,686\n)\n$ (228,418\n)\nReconciliations between the benefit for income taxes at the federal statutory income tax rate and the Company's benefit for income taxes for the years ended September 30, 2023 and 2022 are as follows:\nFiscal Years Ended\nSeptember 30,\nFederal income tax benefit at statutory rate\n$ (169,121\n)\n$ (78,091\n)\nState income tax benefit, net of federal income tax effect\n(31,811\n)\n42,086\nEffect of foreign income taxes\n548,851\n679,605\nReturn to Provision\n(33,604\n)\n(4,473\n)\nWithholding Taxes\n79,000\n147,109\nDeferred only adjustment\n1,740,896\n471,609\nGain on deductible expenses\n14,493\n487,442\nChange in valuation allowance\n(1,520,854\n)\n(861,799\n)\nProvision for income taxes\n$ 627,850\n$ 883,488\nThe Companys open tax years for federal and state income tax returns are for the tax years ended September 30, 2018 through September 30, 2023. The Company was examined by the Internal Revenue Service for fiscal years ended September 30, 2018 and September 30, 2017. The examinations were closed as of November 29, 2021, with no additional tax assessment.\n(12)\nCommitments and Contingencies\nLegal Matters\nThe Company is, from time to time, involved in various legal proceedings incidental to the conduct of our business. Historically, the outcome of nearly all such legal proceedings has not, in the aggregate, had a material adverse effect on our business, financial condition, results of operations or liquidity. Other than as set forth below, there are no additional pending or threatened legal proceedings at this time.\nSecureAlert, Inc. v. Federal Government of Mexico (Department of the Interior). On March 24, 2017, SecureAlert Inc. (a predecessor entity to Track Group, Inc. or the Company) filed a complaint before the Federal Administrative Tribunal, asserting the failure by defendants to pay claimant amounts agreed to, and due under, the Pluri Annual Contract for the Rendering of Monitoring Services of Internees, through Electric Bracelets, in the Islas Marias Penitentiary Complex dated July 15, 2011. Although preliminary rulings have been unfavorable to the Company, the Companys counsel continues to review its remaining claims which are upwards of $4.0 million. Based upon the fee arrangement the Company has with its counsel, we anticipate the future liabilities attributable to legal expense will be minimal.\nCommonwealth of Puerto Rico, through its Trustees v. International Surveillance Services Corporation. On January 23, 2020, the Company was served with a summons for an Adversary Action pending against International Surveillance Services Corporation (ISS), a subsidiary of the Company, now known as Track Group - Puerto Rico Inc., in the United States District Court for the District of Puerto Rico seeking to recover allegedly fraudulent transfers and to disallow claims pursuant to United States Bankruptcy and Puerto Rican law. The allegations stem from payments made to ISS between 2014 and 2017, which the Company believes were properly made in accordance with a contract between ISS and the government of Puerto Rico, through the Oficina de Servicios con Antelacion a Juicio, originally signed in 2011. The Company is confident that all payments it received were earned and due under applicable law and produced documentation supporting its position in an informal document exchange with the Commonwealth on July 6, 2020. At this time, the case remains stayed by Court order. The Company remains confident in its position and no accrual for a potential loss has been made, after consultation with legal counsel.\nJeffrey Mohamed Abed v. Track Group, Inc., et al. On June 7, 2021, Jeffrey Mohamed Abed filed a complaint seeking unspecified damages in the Superior Court of the State of California, alleging strict products liability, negligence and breach of implied warranty premised upon injuries sustained by Abed who was involved in an automobile accident while wearing a GPS tracking device of the Company. The Company was served on October 15, 2021 and subsequently filed its Answer and Affirmative Defenses and issued discovery. On July 17, 2023, the action was consolidated with a related case brought by Plaintiff against other motorists involved in the automobile accident. The Company disputes Abeds claims and will defend the case vigorously. The Company remains confident in its position and no accrual for a potential loss has been made, after consultation with legal counsel.\nTrack Group Chile SpA. v. Republic of Chile. On January 24, 2022, Track Group Chile SpA. initiated a judicial action in the Court of Justice of Chile to settle a contract dispute with the Republic of Chile. The Company asserts that it has complied with its contractual obligations and that any delays in so doing were not attributable to the Company. The Company remains confident in its position and no accrual for a potential loss has been made, after consultation with legal counsel.\nJesus Valle Gonzalez, et al. v. Track Group-Puerto Rico, et al. On May 9, 2022, Plaintiff Jesus Valle Gonzalez filed a complaint in the Court of First Instance, San Juan Superior Court, Commonwealth of Puerto Rico against the Company, and associated parties alleging the death of his mother on June 8, 2016 was a result of the gross negligence of all the defendants. This claim follows a similar claim made against the Company in June 2017 by different relatives of the deceased which was settled on September 5, 2018. Plaintiff in this matter asserts his claim now having reached the age of majority and is requesting damages of $1.5 million. On August 22, 2023, the Superior Court dismissed the Plaintiffs case for lack of jurisdiction.\nMichael Matthews v. Track Group, Inc., et al. On December 13, 2022, Plaintiff Michael Matthews filed a complaint in the Circuit Court of Cook County, Illinois, amended on July 23, 2023, against the Company and other defendants alleging wrongful arrest and incarceration and a deprivation of his rights following his purportedly erroneous violation of home monitoring program requirements. The Company disputes the allegations of the complaint, has retained counsel, and intends to vigorously defend the case. Based on the preliminary stage of the proceedings and after consultation with legal counsel, no accrual for a potential loss has been made.\nLeases\nLeases as Lessor\nMonitoring Equipment and Other Related Services\nThe Company leases monitoring equipment and provides monitoring services to its customers with contract terms varying from month-to-month to several years and each daily contract price varies. Devices supplied to customers are not serial number unique and a single device may be used by multiple customers over its useful life. If a leased device is returned for repair, it will likely be replaced with a different device from a different customer or possibly a new device.\nThe Companys tracking devices are considered operating leases under ASC 842 as transfer of control of the asset does not occur at the end of the lease, a single device is not specific to a customer and devices may be used by multiple customers throughout their life cycle. Due to the movement of devices from customer to customer, relatively few long-term contracts, the measurement of the equipment life and the present value of the equipments fair values would not be a measurement to qualify the devices as sales-type leases.\nOperating lease and monitoring revenue associated with the Companys monitoring equipment as of September 30, 2023 and 2022, respectively, are shown in the table below:\nMonitoring equipment operating revenue\n$ 28,106,916\n$ 29,867,266\nThe Company cannot accurately estimate 5-years of future minimum lease receipts for its devices leased to customers because none of its customers make any contractual commitment regarding the number of active devices utilized in any given year and those quantities of active devices vary significantly for every customer each and every day.\nLeases as Lessee\nThe following table shows right of use assets and lease liabilities for real estate and equipment, with the associated financial statement line items as of September 30, 2023 and 2022.\nSeptember 30, 2023\nSeptember 30, 2022\nOperating\nlease\nasset\nOperating\nlease\nliability\nOperating\nlease\nasset\nOperating\nlease\nliability\nOther assets\n$ 403,205\n$ -\n$ 575,716\n$ -\nAccrued liabilities\n-\n143,846\n-\n177,431\nLong-term liabilities\n-\n259,359\n-\n398,285\nThe following table summarizes the supplemental cash flow information for the year ended September 30, 2023 and 2022:\nSeptember 30,\nSeptember 30,\nCash paid for noncancelable operating leases included in operating cash flows\n$ 284,897\n$ 272,921\nRight of use assets obtained in exchange for operating lease liabilities:\n$ 5,459\n$ 626,047\nThe future minimum lease payments under noncancelable operating leases with terms greater than one year as of September 30, 2023 are:\nOperating\n\t\t\tLeases\nFrom October 2023 to September 2024\n$ 157,632\nFrom October 2023 to September 2025\n92,492\nFrom October 2024 to September 2026\n94,273\nFrom October 2025 to September 2027\n87,585\nFrom October 2026 to September 2028\nThereafter\n-\nUndiscounted Cash Flow\n432,755\nLess: imputed interest\n(29,550\n)\nTotal\n$ 403,205\nReconciliation to lease liabilities:\nLease liabilities - current\n$\n143,846\nLease liabilities - long-term\n259,359\nTotal Lease Liabilities\n$\n403,205\nThe weighted-average remaining lease term and discount rate related to the Companys lease liabilities as of September 30, 2023 were 3.44 years and 4%, respectively. The Companys lease discount rates are generally based on the estimates of its incremental borrowing rate as the discount rates implicit in the Companys leases cannot be readily determined.\nPerformance Bonds\nAs of September 30, 2023, the Company has one performance bond in connection with a foreign customer totaling $1,654,134 (Performance Bond) of which $1,157,867 is held in an interest-bearing account on behalf of the bank and is recorded in Other Assets on the Consolidated Balance Sheets. The amount held on this Performance Bond will be released after the expiration of the Performance Bond, all contract extensions have been exhausted, and the consent of the customer, but in no event before July 2024 and more likely in 2025.\nThe amounts held on two performance bonds were released in the second quarter of 2023 and the Company received $1,041,797, including interest.\nThe Company pays interest on the full amount of the Performance Bond to the financial institution providing the guarantee at 2.8% interest per annum for the Performance Bond expiring in July 2024. The Company recorded interest expenses of $54,676 and $56,343 for the years ended September 30, 2023 and September 30, 2022, respectively.\n(13)\nIntangible Assets\nThe following table summarizes the activity of intangible assets for the years ended September 30, 2023 and 2022, respectively:\nSeptember 30, 2023\nSeptember 30, 2022\nGross\nAccumulated\nAmortization\nNet\nGross\nAccumulated\nAmortization\nNet\nPatent & royalty agreements\n$ 21,120,565\n$ (14,358,431\n)\n$ 6,762,134\n$ 21,120,565\n$ (13,027,465\n)\n$ 8,093,100\nDeveloped technology\n10,328,125\n(2,933,499\n)\n7,394,626\n9,206,006\n(1,649,563\n)\n7,556,443\nTrade name\n139,450\n(138,916\n)\n139,115\n(127,241\n)\n11,874\nTotal intangible assets\n$ 31,588,140\n$ (17,430,846\n)\n$ 14,157,294\n$ 30,465,686\n$ (14,804,269\n)\n$ 15,661,417\nThe intangible assets summarized above were purchased or developed on various dates from July 2011 through September 30, 2023. The assets have useful lives ranging from three to twenty years. Amortization expense for the years ended September 30, 2023 and 2022 was $2,616,629 and $3,277,088, respectively. Amortization expense included in cost of revenue in the Consolidated Statements of Operations for the years ended September 30, 2023 and 2022 was $1,724,256 and $1,857,413, respectively. Amortization expense included in operating expense in the Consolidated Statements of Operations for the years ended September 30, 2023 and 2022 was $892,373 and $1,419,675, respectively. The Company wrote-off fully amortized intangible assets at September 30, 2023 and September 30, 2022 of $0 and $1,860,000, respectively. In the fourth quarter of fiscal year 2022, based on future sales trends, operating margins and capital expenditures, the Company made a decision to discontinue the Shadow and InTouch products. This resulted in a developed technology impairment charge of $0 and $1,728,961 for the years ended September 30, 2023 and 2022, respectively, and is recorded in general and administrative expense on the Consolidated Statements of Operations.\nThe following table summarizes the future maturities of amortization of intangible assets as of September 30, 2023:\nFiscal Year\nAmortization\nSTOP\nRoyalty\n2,240,653\n187,500\n2,418,908\n-\n2,418,908\n-\n2,418,908\n-\nThereafter\n4,472,417\n-\nTotal\n$ 13,969,794\n$ 187,500\nGoodwill - In accordance with accounting principles generally accepted in the United States of America, we do not amortize goodwill. These principles require the Company to periodically perform tests for goodwill impairment, at least annually, or sooner if evidence of possible impairment arises. We evaluated the goodwill for impairment as of September 30, 2023. Based on the evaluation made, the Company concluded that no impairment of goodwill was necessary.\nGoodwill, as of September 30, consisted of the following:\nSeptember 30,\nBalance - beginning of year\n$ 8,061,002\n$ 8,519,998\nEffect of foreign currency translation on goodwill\n(209,536 )\n(458,996\n)\nBalance - end of year\n$ 7,851,466\n$ 8,061,002\n(14)\nSubsequent Events\nIn accordance with the Subsequent Events Topic of the FASB ASC 855, we have evaluated subsequent events, through the filing date and noted that no additional subsequent events have occurred that are reasonably likely to impact the financial statements."
}