{
    "cik": "1048268",
    "company": "IES Holdings, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-06",
    "period_of_report": "2022-09-30",
    "sic": "1731",
    "state_of_inc": "DE",
    "state_location": "TX",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1048268/0001048268-22-000099-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1048268/000104826822000099/iesc-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1048268/0001048268-22-000099.txt",
    "filename": "1048268_10K_2022_0001048268-22-000099.htm",
    "content": "Item 1. Business\nOVERVIEW\nIES Holdings, Inc. designs and installs integrated electrical and technology systems and provides infrastructure products and services to a variety of end markets, including data centers, residential housing and commercial and industrial facilities. Our operations are organized into four business segments, based upon the nature of our services:\nCommunications - Nationwide provider of technology infrastructure services, including the design, build, and maintenance of the communications infrastructure within data centers for co-location and managed hosting customers, for both large corporations and independent businesses.\nResidential - Regional provider of electrical installation services for single-family housing and multi-family apartment complexes, as well as heating, ventilation and air conditioning (HVAC) and plumbing installation services in certain markets.\nInfrastructure Solutions - Provider of electro-mechanical solutions for industrial operations, including apparatus repair and custom-engineered products, such as generator enclosures used in data centers and other industrial applications.\nCommercial & Industrial - Provider of electrical and mechanical design, construction, and maintenance services to the commercial and industrial markets in various regional markets and nationwide in certain areas of expertise, such as the power infrastructure market and data centers.\nWhile sharing common goals and values, each of the Companys segments manages its own day-to-day operations. Our corporate office is focused on significant capital allocation decisions, investment activities and selection of segment leadership. The corporate office also assists with strategic and operational improvement initiatives, talent development, sharing of best practices across the organization and the establishment and monitoring of risk management practices within our segments.\nIES Holdings, Inc. is a Delaware corporation established in 1997 and headquartered in Houston, Texas, with an executive office in Greenwich, Connecticut.\nCORPORATE STRATEGY\nWe seek to create shareholder value by growing our business through increasing our market share, geographic and market expansion and adding to our capabilities, as well as improving operating margins and generating free cash flow, by investing in our existing businesses and completing acquisitions. We primarily seek to acquire businesses that strategically complement our existing business segments. In addition, we may seek to acquire or invest in stand-alone platform companies based in North America. In evaluating potential acquisition candidates, we seek to invest in businesses with, among other characteristics:\nproven management with a willingness to continue post-acquisition;\nlow technological and/or product obsolescence risk;\nestablished market position and sustainable competitive advantages; and\nstrong cash flow characteristics.\nWe believe that acquisitions provide an opportunity to expand into new or related services, products, end markets or geographic areas and diversify our revenue and profit streams. While we may use acquisitions to build our presence in the industries we serve, we will also consider potential acquisitions in other industries, which could result in changes in our operations from those historically conducted by us.\nOPERATING SEGMENTS\nThe Companys reportable segments consist of the consolidated business segments identified above, which offer different services and are managed separately. The table below describes the percentage of our total revenues attributable to each of our four segments over\neach of the last three years (percentage columns may not add due to rounding):\nYear Ended September 30,\n2022 2021 2020\n$ % $ % $ %\n(Dollars in thousands, Percentage of revenues)\nCommunications $ 559,777 25.8 % $ 445,968 29.0 % $ 395,141 33.2 %\nResidential 1,131,414 52.2 % 687,347 44.7 % 411,790 34.6 %\nInfrastructure Solutions 167,113 7.7 % 146,980 9.6 % 128,379 10.8 %\nCommercial & Industrial 308,504 14.2 % 256,198 16.7 % 255,546 21.5 %\nTotal Consolidated $ 2,166,808 100.0 % $ 1,536,493 100.0 % $ 1,190,856 100.0 %\nFor additional financial information by segment, see Note 11, Operating Segments in the notes to our Consolidated Financial Statements.\nCommunications\nBusiness Description\nOriginally established in 1984, our Communications segment is a leading provider of network infrastructure solutions for data centers and other mission critical environments. Our services include the design, installation and maintenance of network infrastructure for leading and recognizable global technology, social networking and e-commerce brands, including many Fortune 100 and 500 corporations. We serve a variety of industries and end markets, including data centers for co-location and managed hosting customers; corporate, educational, financial, hospitality and healthcare buildings; e-commerce distribution centers; and high-tech manufacturing facilities. We also provide the design and installation of audio/visual, telephone, fire, wireless access and intrusion alarm systems, as well as design/build, service and maintenance of data network systems. We perform services across the United States from our 19 offices, which includes the segment headquarters located in Tempe, Arizona, and also provide dedicated onsite teams at our customers sites.\nIndustry Overview\nOur Communications segment is driven by demand for computing and storage resources as a result of technology advancements and obsolescence and changes in data consumption patterns. Demand in the data center market remains strong, and we continue to provide structured cabling services for applications such as data centers, distribution centers, and high-tech manufacturing facilities. Additionally, we are continuing to expand our offerings in this market to broaden our customer base. Demand has also been strong for our audio-visual and other building technology offerings. At September 30, 2022, our Communications business has a record level of backlog. However, if customers in our end markets reduce their capital budgets due to economic, technological or other factors, this could result in a decrease in activity for our Communications segment.\nSales and Marketing\nOur sales strategy relies on a concentrated business development effort, with centralized marketing programs and direct end-customer communications and relationships. Due to the mission critical nature of the facilities we service, our end-customers significantly rely upon our past performance record, technical expertise and specialized knowledge. A significant portion of our Communications business volume is generated from long-term, repeat customers, some of whom use IES as a preferred provider for major projects.\nOur long-term strategy is to improve our position as a preferred solutions and services provider to large national corporations and strategic local companies. Key elements of our long-term strategy include continued investment in our employees technical expertise and expansion of our on-site maintenance and recurring revenue model, as well as opportunistic acquisitions of businesses that serve our markets, consistent with our stated corporate strategy.\nCompetition\nOur competition consists of both large national or regional competitors and small, privately owned contractors who generally have limited access to capital. We compete on quality of service and/or price and seek to emphasize our financial capabilities and long history of delivering high quality solutions to our customers.\nSeasonality and Quarterly Fluctuations\nThe effects of seasonality on our Communications business are not significant, as work generally is performed inside structures protected from the weather. Our service and maintenance business is also generally not affected by seasonality. However, communications infrastructure spending has historically been highly cyclical. Our volume of business may be adversely affected by declines in projects resulting from adverse regional or national economic conditions. Quarterly results may also be materially affected by the timing of new construction projects. Accordingly, operating results for any fiscal period are not necessarily indicative of results that may be achieved for any subsequent fiscal period.\nResidential\nBusiness Description\nOriginally established in 1973, our Residential segment is a leading provider of electrical installation services for single-family housing and multi-family apartment complexes, as well as HVAC and plumbing installation services in certain markets, and cable television installations for residential and light commercial applications. The Residential segment also provides services for the installation of residential solar power, both for new construction and existing residences. The Residential segment is made up of 77 total locations, which include the segment headquarters in Houston, Texas. These locations geographically cover the Sun-Belt, Western, Mid-Atlantic and Northeastern regions of the United States.\nIndustry Overview\nOur Residential business is closely correlated to the single and multi-family housing market. Although demand for both single-family and multi-family housing has increased in recent years, due to economic, technological or other factors, there can be no assurance that overall construction and demand will continue to increase in the future. Entering fiscal 2023, we expect continued revenue growth in our multi-family business as our strong backlog is expected to offset much of he expected impact of demand weakness in the single-family market, where we typically do not enter into long-term contracts.\nSales and Marketing\nDemand for our Residential services is highly dependent on the number of single-family and multi-family home starts in the markets we serve. Although we operate in multiple states, the majority of our single-family revenues are derived from services provided in Texas and Florida. The Texas market also remains an important part of our multi-family business; however, the majority of our multi-family revenue is earned across the Mid-Atlantic and Southeast. Our sales efforts include a variety of strategies, including a concentrated focus on national and regional homebuilders and multi-family developers and a local sales strategy for single and multi-family housing projects. Our cable and solar revenues are typically generated through third parties specializing in these industries who select us as a preferred provider of installation services. A significant portion of our Residential business volume is generated from long-term, repeat customers, some of whom use IES as a preferred provider for major projects.\nOur long-term strategy is to continue to be a leading provider of electrical services to the residential market, and to continue to expand our offerings of plumbing and HVAC services. The key elements of our long-term strategy include a continued focus on maintaining a low and variable cost structure and cash generation, allowing us to effectively scale according to the housing cycle, and to opportunistically increase our market share.\nCompetition\nOur competition primarily consists of small, privately owned contractors who generally have limited access to capital. We believe that we have a competitive advantage over these smaller competitors due to our key employees long-standing customer relationships, our financial capabilities, our employee training program, and our local market knowledge and competitive pricing. There are few barriers to entry for electrical contracting services in the residential markets.\nSeasonality and Quarterly Fluctuations\nResults of operations from our Residential segment can be seasonal, depending on weather trends, with typically higher revenues generated during spring and summer and lower revenues during fall and winter. In addition, the construction industry has historically been highly cyclical. Our volume of business may be adversely affected by declines in multi-family occupancy rates as well as single-family housing starts within our operational footprint. Quarterly results may also be materially affected by the timing of new construction projects. Accordingly, operating results for any fiscal period are not necessarily indicative of results that may be achieved for any subsequent fiscal period.\nInfrastructure Solutions\nBusiness Description\nOur Infrastructure Solutions segment provides electro-mechanical solutions for industrial operations to domestic and international customers. Our Custom Power Solutions business includes the manufacture of custom commercial and industrial generator enclosures and the manufacture of custom-engineered power distribution equipment, including metal enclosed bus duct solutions used in power distribution. Our Industrial Services business includes the maintenance and repair of alternating current (AC) and direct current (DC) electric motors and generators, as well as power generating and distribution equipment; the manufacture, re-manufacture, and repair of industrial lifting magnets; and maintenance and repair of railroad main and auxiliary generators, main alternators, and traction motors.\nThis segment serves the steel, railroad, marine, petrochemical, pipeline, pulp and paper, wind energy, mining, automotive, power generation, scrap yards, data center, and utility industries. Our Infrastructure Solutions segment is comprised of 13 locations in Alabama, Georgia, Illinois, Indiana, Ohio, Oklahoma and West Virginia, and is headquartered in Massillon, Ohio.\nIndustry Overview\nGiven the diverse end-markets of Infrastructure Solutions customers, we are subject to many economic trends. In general, demand for our services has been driven by growth in industries, such as data centers, in-house maintenance departments continuing to outsource maintenance and repair work, output levels and equipment utilization at heavy industrial facilities, railroad companies and mass transit authorities capital investments and repair needs, investment in the United States aging energy and industrial infrastructure, demand for critical power applications that have high power demands and require dependable power supplies, the need for electrical or pipeline infrastructure improvements and the overall health of the economy.\nSales and Marketing\nOur sales efforts are primarily driven by personnel based at our operating locations, as well as independent sales representatives. Our custom-engineered power distribution, bus system and generator enclosure products and services are principally sold in partnership with an original equipment manufacturer (OEM) or to an engineering, procurement and construction firm on behalf of the end-user. Regarding our apparatus repair services, the majority of our customers are located within a 200-mile radius of our facilities, and we believe that the locations of our facilities allow us to rapidly address and respond to the needs of our customers. Our long-term strategy is to be a leader in custom-engineered metal enclosed bus systems and generator enclosures and the preferred solutions provider of outsourced electro-mechanical services, repairs, and manufacturing to our select markets.\nCompetition\nOur competition ranges from small, single location service centers to large, multi-national companies. Our Custom Power Solutions business competes with domestic and international manufacturers and distributors. We believe that we have a competitive advantage due to our specific product offerings, geographic proximity to customer sites, and our ability to design high quality products to meet each customer's unique requirements. Our Industrial Services business competes with small, specialized manufacturing and repair shops, a limited number of other multi-location providers of electric motor repair, engineering and maintenance services, and various OEMs. Participants in this industry compete primarily on the basis of capabilities, service, quality, timeliness and price. We believe that we have a competitive advantage due to our breadth of capabilities, focus on quality, technical support, customer service, and financial resources.\nSeasonality and Quarterly Fluctuations\nInfrastructure Solutions revenues from its custom-engineered bus systems and generator enclosures are affected by the timing of customers' capital spending projects. Revenues from industrial services may be affected by the timing of scheduled outages at its industrial customers facilities and by weather conditions with respect to projects conducted outdoors, but the effects of seasonality on revenues in its industrial services business are not significant. Infrastructure Solutions quarterly results may fluctuate, and the results of one fiscal quarter may not be representative of the results of any other quarter or of the full fiscal year.\nCommercial & Industrial\nBusiness Description\nOur Commercial & Industrial segment provides electrical and mechanical design, service, and construction services to commercial and industrial markets. Our construction services range from the initial planning and procurement to installation and start-up and are offered to a variety of new and remodel construction projects, ranging from the construction of office buildings and industrial facilities to transmission and distribution projects. Our design services range from budget assistance to providing design-build and LEED (Leadership in Energy & Environmental Design) solutions to our end customers. Our maintenance and emergency services include critical plant shutdown, troubleshooting, emergency testing, preventative maintenance, and constant presence. We also provide\nmechanical services such as maintenance agreements, installation, or replacement of mechanical equipment for commercial and industrial facilities.\nThis segment provides services for a variety of project types, including office buildings, manufacturing facilities, data centers, chemical plants, refineries, wind farms, solar facilities, municipal infrastructure and health care facilities. The Commercial & Industrial segment consists of 19 locations, which includes the segment headquarters in Houston, Texas. Geographically, these locations cover Texas, Nebraska, Oregon, Wisconsin, and the Southeast and Mid-Atlantic regions.\nIndustry Overview\nGiven the diverse end markets of our Commercial & Industrial customers, which include both commercial buildings, such as offices, healthcare facilities and schools, and industrial projects, such as power, agricultural and food processing, and heavy manufacturing facilities, we are subject to many trends within the construction industry. In general, demand for our Commercial & Industrial services is driven by construction and renovation activity levels, economic growth, and availability of bank or other financing. Due to economic, technological or other factors, there can be no assurance that construction and demand will increase.\nSales and Marketing\nOur sales focus varies by location, but is primarily based upon regional and local relationships and a demonstrated expertise in certain areas, such as heavy industrial, design-build, agricultural, or transmission and distribution. Our maintenance and certain renovation and upgrade work tends to be either recurring or experience lower sensitivity to economic cycles, or both. A significant portion of our larger projects is awarded from long-term, repeat customers. From time to time, we are contracted on projects with completion times extending beyond one year or over several years, which are generally more complex and difficult to estimate.\nCompetition\nThe electrical and mechanical contracting services industry is generally highly competitive and includes a number of regional or small privately-held local firms. Traditionally, competitors in certain parts of this market have faced few barriers to entry. Therefore, we seek to pursue projects where our access to capital and expertise provide a competitive advantage.\nIndustry expertise, project size, location and past performance determine our bidding strategy, the level of involvement from competitors and our level of success in bidding for new work. Our primary advantages vary by location and market, but mostly are based upon local individual relationships with key customers or a demonstrated industry expertise. Additionally, due to the size of many of our projects, our financial resources help us compete effectively against local competitors.\nSeasonality and Quarterly Fluctuations\nThe effects of seasonality on our Commercial & Industrial business are not significant, as most of our work generally is performed inside structures protected from the weather. However, we do perform some work outdoors, which can be affected by the weather. Most of our service and maintenance business is also generally not affected by seasonality. However, the construction industry has historically been highly cyclical. Our volume of business may be adversely affected by declines in construction projects resulting from adverse regional or national economic conditions. Quarterly results may also be materially affected by the timing of new construction projects. Accordingly, operating results for any fiscal period are not necessarily indicative of results that may be achieved for any subsequent fiscal period.\nSOURCES OF SUPPLY\nThe raw materials and components we use within our segments include, but are not limited to, electrical fixtures and system components, copper, aluminum, raw steel, and certain plastics. These raw materials and components are generally available from a variety of domestic suppliers at competitive prices. Delivery times are typically short for most raw materials and standard components, but during periods of peak demand, may extend to one month or more. However, during fiscal 2021 and 2022, supply chain interruptions became increasingly common, primarily as a result of the COVID-19 pandemic and its aftermath. Although supply of most raw materials has begun to normalize, we continue to experience delays in sourcing certain components. Such delays may lead to project inefficiencies resulting from schedule extensions. We are also exposed to increases in the prices of certain commodities. Our strategy to reduce commodity cost exposure includes early buying of commodities for particular projects or general inventory, as well as including escalation and escape provisions in project bids, quotes and contracts wherever possible. However, such protections are not included in every contract or project, and in such cases, we may not be fully reimbursed for increases in commodity prices by our customers and may be exposed to commodity price volatility on longer-term projects where we have prepaid for commodities.\nRISK MANAGEMENT\nThe primary risks in our existing operations include project bidding and management, bodily injury, property and environmental damage, and construction defects. We monitor project bidding and management practices at various levels within the Company. We maintain automobile, general liability and construction defect insurance for third-party health, bodily injury and property damage, as well as pollution coverage and workers compensation coverage, which we consider appropriate to insure against these risks. Our third-party insurance is subject to deductibles for which we establish reserves. In light of these risks, we are also committed to a strong safety and environmental compliance culture. We have a robust safety program, and seek to maintain standardized safety and environmental policies and procedures. We are also subject to cyber security and information theft risks in our operations, which we seek to manage through a cyber and information security program, training and insurance coverage. Given the dynamic and evolving nature of cyber threats, we cannot be assured that we are protected against all such threats.\nIn the electrical contracting industry, our ability to post surety bonds provides us with an advantage over competitors that are smaller or have fewer financial resources. We believe that the strength of our balance sheet, as well as a good relationship with our bonding providers, enhances our ability to obtain adequate financing and surety bonds, although there can be no assurance that surety bonding coverage will be available when we need it. For a further discussion of our risks, please refer to Item 1A. Risk Factors\nYou should consider carefully the risks described below, as well as the other information included in this document before making an investment decision. Our business, results of operations or financial condition could be materially and adversely affected by any of these risks, and the value of your investment may decrease due to any of these risks.\nRisks Relating to the Operations of our Business\nDemand for our services is cyclical and vulnerable to economic downturns affecting the industries we serve.\nDemand for our services has been, and will likely continue to be, cyclical in nature and vulnerable to downturns in the general economy, as well as in the construction industry and the housing market. Many of our customers depend on the availability of credit to purchase our services or electrical and mechanical products. In the past, when the general level of economic activity has been reduced from historical levels, certain of our customers have delayed or cancelled projects or capital spending, thereby reducing our revenues and profitability. General concerns about the fundamental soundness of the economy may cause customers to defer projects, even if they have credit available to them. Prolonged uncertainties in the credit market, or the return of constrained credit market conditions, including the impact of rising interest rates on the housing markets, could have adverse effects on our customers, which would adversely affect our financial condition and results of operations.\nThe highly competitive nature of our industries could affect our profitability by reducing our revenues or profit margins.\nThe industries in which we compete are highly fragmented and are generally served by many small, owner-operated private companies. There are also several large private regional companies and a small number of large public companies from which we face competition in these industries. In the future, we could also face competition from new competitors entering these markets because certain segments, such as our electrical contracting services, have a relatively low barrier for entry while other segments, such as our services and custom engineered electro-mechanical products for mission critical infrastructure, have attractive growth and profitability characteristics. Some of our competitors in certain markets may offer a greater range of services than we offer in those markets, including mechanical construction and facilities management. Competition in our markets depends on a number of factors, including price. Some of our competitors may have lower overhead cost structures and may, therefore, be able to provide services comparable to ours at lower rates than we do. If we are unable to offer our services at competitive prices or if we have to reduce our prices to remain competitive, our profitability would be impaired.\nWe generate a significant portion of our revenues under fixed price contracts. The estimates we use in placing bids and changes in commodity and labor costs could have an adverse effect on our ability to maintain our profitability.\nWe currently generate, and expect to continue to generate, a significant portion of our revenues under fixed price contracts. The cost of fuel, labor and materials, including copper wire or other commodities, may vary significantly from the costs we originally estimate. Variations from estimated contract costs along with other risks inherent in performing fixed price contracts, including our ability to successfully manage projects, may result in actual revenue and gross profits for a project differing from those we originally estimated and could result in losses on projects. Depending upon the size of a particular project, variations from estimated contract costs can have a significant impact on our operating results.\nIf the costs associated with labor and commodities, such as copper, aluminum, steel, electrical components, fuel, and certain plastics, increase due to low supply, inflation, general market conditions, supply chain disruptions and delays, or other forces, losses may be incurred. Some of our materials have been and may continue to be subject to sudden and significant price increases, and continued high demand and low supply for those resources may lead to additional price increases. We are also exposed to volatility in energy prices, particularly as they relate to fuel prices for our fleet vehicles. Depending on competitive pressures and the fixed price nature of many of our contracts, we may not be able to pass on these cost increases to our customers, which would reduce our gross profit margins and, in turn, make it more difficult for us to maintain our profitability. We have a work force of over 8,000 employees, and our labor costs may fluctuate based on availability of and demand for workers as well as other labor related risks, including risks related to collective bargaining agreements, benefits arrangements, wage and hour claims and other compensation arrangements.\nA failure to secure new contracts may adversely affect our cash flows and financial results.\nMuch of our revenue is derived from projects that are awarded through a competitive bid process. Contract bidding and negotiations are affected by a number of factors, including our own cost structure and bidding policies. Although no single customer represented more than ten percent of our consolidated revenue in fiscal 2022, we do have certain customers that are significant to our individual operating segments. It is not possible for us to predict the future level of demand for our services by these customers, and if one or more of them were to significantly delay, reduce or curtail activity, or stop accepting bids from us, it could have a material impact on our operating results. In addition, our ability to secure new contracts depends on our ability to maintain all required electrical, construction, mechanical and business licenses. If we fail to successfully transfer, renew or obtain such licenses where applicable, we may be unable to compete for new business. The failure to bid and be awarded projects, cancellations of projects or delays in project start dates could affect our ability to deploy our assets profitably. Further, when we are awarded contracts, we face additional risks that could affect whether, or when, work will begin. We could experience a decrease in profitability if we are unable to replace canceled, completed or expired contracts with new work.\nOur inability to carry out plans and strategies as expected, including our inability to identify and complete acquisitions and investments that meet our investment criteria in furtherance of our corporate strategy or the subsequent underperformance of those acquisitions and investments, may adversely impact our future growth and profitability.\nOur corporate strategy includes creating shareholder value through acquiring businesses that we believe will strategically complement our existing business segments or acquiring or investing in stand-alone platform companies based in North America. While we believe that acquisitions will provide an opportunity to expand into new or related services, products, end-markets or geographic areas and diversify our revenue and profit streams, potential acquisitions could result in changes in our operations from those historically conducted by us and introduce the requirement for new controls. Alternatively, our failure to diversify from existing markets may limit our future growth. In addition, we have made, and may continue to make, strategic investments in debt or equity securities of publicly traded and privately held companies, including early-stage companies and more established companies. We are subject to risks associated with these investments, including the inability to dispose of these investments due to lack of an active market for or contractual limitations on our ability to sell a particular investment, and the partial or complete loss of invested capital, and significant changes in the fair value of our investment portfolio could adversely impact our financial results. Further, valuations of non-marketable debt and equity investments are inherently complex due to the lack of readily available market data. Some of our past acquisitions and investments have not performed as expected, and there is no assurance that future acquisitions and investments will perform as expected or generate a positive return on investment due to factors we could not predict prior to the acquisition or due to incorrect investment assumptions.\nAcquisitions, dispositions and other strategic transactions that we may pursue could have a negative effect on our results of operations.\nWe are actively seeking to engage in acquisitions of operations, assets and investments, or to develop new types of work or processes, and we may seek to engage in dispositions of certain operations, assets or investments from time to time. If we are unable to successfully integrate newly acquired assets or operations or if we make untimely or unfavorable investments or dispositions, it could negatively impact our financial condition, results of operations and the market value of our common stock. Additionally, any future acquisition, investment or disposition may result in significant changes in the composition of our assets and liabilities, and as a result, our financial condition, results of operations and the market value of our common stock following any such acquisition, investment or disposition may be affected by factors different from those currently affecting our financial condition, results of operations and market value of our common stock.\nThe difficulties of integrating a business, assets or operations may include, among other things:\ngeographically separated organizations and possible differences in corporate cultures and management philosophies;\nsignificant demands on management resources, which may distract managements attention from day-to-day business;\ndifferences in the disclosure systems, compliance requirements, accounting systems, and accounting controls and procedures of the acquired company, which may interfere with our ability to make timely and accurate public disclosure; and\nthe demands of managing new locations, new personnel and new lines of business acquired.\nBacklog may not be realized or may not result in profits.\nCustomers often have no obligation under our contracts to assign or release work to us, and many contracts may be terminated on short notice. Reductions in backlog due to cancellation of one or more contracts by a customer or for other reasons could significantly reduce the revenue and profit we actually receive from contracts included in backlog. In the event of a project cancellation, we may be reimbursed for certain costs, but typically have no contractual right to the total revenues reflected in our backlog.\nWe may fail to adequately recover on contract change orders.\nFrom time to time, we may pursue claims against our customers to recover costs incurred on a project in excess of the original contract amount. Such additional costs may be incurred in connection with project delays caused by our customers or third parties, including other trades, or changes in project scope or specifications. While we generally negotiate with the customer for additional compensation, we may be unable to obtain, through negotiation, arbitration, litigation or otherwise, adequate compensation for the additional work performed or expenses incurred. The process of pursuing a claim may be lengthy, result in significant legal fees, and negatively impact our relationships with customers. Furthermore, we may be required to invest significant working capital to fund cost overruns while the resolution of a claim is pending, and our additional costs may not be recovered until the claim is resolved, if at all. When appropriate, we establish provisions against possible exposures, and we adjust these provisions from time to time, but our assumptions and estimates related to these exposures might prove to be inadequate or inaccurate. Unfavorable resolution of these matters can result in a reduction of revenues and profit recognized in prior periods or the recognition of a loss, which could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nWe may incur significant charges or be adversely impacted by the closure or sale of facilities or assets.\nIn the past, we incurred significant costs associated with the closure or disposition of facilities, and we expect from time to time to evaluate the need for future facility closures or dispositions of assets. If we were to elect to dispose of a substantial portion of any of our segments, facilities, or assets, the realized values of such assets could be substantially less than current book values, which would likely result in a material adverse impact on our financial results. In addition, we may have warranty claims, costs pursuant to obligations to indemnify buyers after assets are sold, or other unexpected liabilities from closed facilities beyond the closing date, and if we dispose of a segment or business, we may continue to be subject to certain prior liabilities of that business after its disposition and may not be able to negotiate for limitations on those liabilities, all of which could adversely impact our financial returns.\nThe COVID-19 pandemic has adversely impacted, and could have a future materially adverse impact on, our business, including our financial condition, cash flows and results of operations.\nThe COVID-19 pandemic and its ongoing impact on markets, the supply chain, and availability of labor has had a number of adverse impacts on our results of operations, and it continues to influence trends affecting our business. We continue to experience increased prices, longer delivery times, or limited availability for certain materials necessary for our projects, notably copper, aluminum, steel, electrical components, fuel, and certain plastics.\nThe impact of the COVID-19 pandemic or any future epidemics or pandemics on our business is difficult to predict, but adverse impacts could include the potential for job site closures or work stoppages, supply chain disruptions, delays in awarding new project bids, construction delays, reduced demand for our services, delays in our ability to collect from our customers, or illness of management or other employees.\nThe availability and cost of surety bonds affect our ability to enter into new contracts and our margins on those engagements.\nMany of our customers require us to post performance and payment bonds issued by a surety. Those bonds guarantee the customer that we will perform under the terms of a contract and that we will pay subcontractors and vendors. We obtain surety bonds from two primary surety providers; however, there is no commitment from these providers to guarantee our ability to issue bonds for projects as they are required. Our ability to access this bonding capacity is at the sole discretion of our surety providers. Accordingly, if we were to experience an interruption or reduction in our availability of bonding capacity, or if we are unable to obtain bonds at a reasonable cost, we may be unable to compete for, or work on, certain projects.\nWe are subject to risks associated with seasonality, adverse weather conditions, and climate change.\nOur business is subject to seasonal variations in operations and demand that affect the construction business, particularly in the Residential and Commercial & Industrial segments. Adverse weather conditions, including rain, heat, ice, cold or snow may not only delay our work and contribute to project inefficiency, but may negatively impact our schedules and profitability by delaying the work of other trades on a construction site. Extreme weather conditions (such as hurricanes or other storms, droughts, extreme heat or cold, wildfires and floods) may limit the availability of resources, increase our costs, damage property, disrupt our workforce, or may cause projects to be cancelled. As we have expanded our operations in coastal areas, particularly Florida, these risks have increased. To the extent climate change results in an increase in extreme weather events and adverse weather conditions, the likelihood of a negative impact on our results of operations may increase.\nDue to differing regional economic conditions, our results may fluctuate from period to period.\nOur quarterly results may also be affected by regional economic conditions that affect the construction market. In particular, a prolonged period of weak demand in the oil and gas industry or increased regulatory restrictions on the industry could dampen the housing market in certain regions, resulting in reduced demand for the services provided by our Residential segment. Infrastructure Solutions revenues from industrial services may be affected by the timing of scheduled outages or capital projects at its industrial customers facilities, by demand for design, construction and site support of data centers, and by changes in spending in public infrastructure, power and steel markets. Industrial and rail customers may also be affected by volatility in oil prices. Accordingly, our performance in any particular quarter may not be indicative of the results that can be expected for any other quarter or for the entire year.\nWe may experience difficulties in managing our billings and collections.\nOur billings under fixed price contracts in our contracting business are generally based upon achieving certain milestones and will only be accepted by the customer once we demonstrate those milestones have been met. If we are unable to demonstrate compliance with billing requests, or if we fail to issue a project billing, our likelihood of collection could be delayed or impaired, which, if experienced across several large projects, could have a material adverse effect on our results of operations. Further, some of our customers may be highly leveraged or may be subject to their own operating and regulatory risks, which may also limit their ability to pay.\nOur operations are subject to numerous physical hazards. If an accident occurs, it could result in an adverse effect on our business.\nHazards related to our industry include, but are not limited to, electrocutions, fires, injuries involving ladders, machinery-caused injuries, mechanical failures and transportation accidents. These hazards can cause personal injury and loss of life, severe damage to or destruction of property and equipment, and suspension of operations. Our insurance does not cover all types or amounts of liabilities. In addition, if our safety record were to substantially deteriorate over time, our customers could cancel our contracts or not award us future business.\nOur current insurance coverage may not be adequate, and we may not be able to obtain insurance at acceptable rates, or at all.\nWe maintain insurance coverage in part because some of our contracts require us to carry certain levels of insurance coverage, which is common in the industries in which we operate. Our third-party insurance is subject to deductibles for which we establish reserves. No assurance can be given that our insurance or our provisions for incurred claims and incurred but not reported claims will be adequate to cover all losses or liabilities we may incur in our operations; nor can we provide assurance that we will be able to maintain adequate insurance at reasonable rates.\nLitigation and claims can cause unexpected losses.\nIn all of our businesses, we are subject to potential claims and litigation, including contractual disputes, warranty claims, and claims related to our compliance with legal and regulatory requirements. We have in the past been, and may in the future be, named as a defendant in lawsuits, claims and other legal proceedings; such claims and litigation are common in the construction and electrical and mechanical maintenance businesses and may be related to contract delays, changes in the scope of work or alleged defects. There are also inherent claims and litigation risks associated with the number of people that work on construction sites and the fleet of vehicles on the road every day. In our Infrastructure Solutions businesses, we also may be subject to product liability litigation. Claims are sometimes made and lawsuits filed for amounts in excess of their value or in excess of the amounts for which they are eventually resolved. Claims and litigation normally follow a predictable course of time to resolution. However, there may be periods of time in which a disproportionate amount of our claims and litigation are concluded in the same quarter or year. If multiple matters are resolved during a given period, then the cumulative effect of these matters may be higher than the ordinary level in any one reporting period. In addition, due to the inherent uncertainties of litigation, we cannot accurately predict the ultimate outcome of any such actions or proceedings, which could result in significant expense, damage to our reputation and diversion of managements attention from our business.\nLatent defect litigation is normal for residential home builders in some parts of the country, as well as in certain areas of the commercial market. Any increases in our latent defect claims and litigation could place pressure on the profitability of the Residential and Commercial & Industrial segments of our business.\nRegulatory requirements could result in significant compliance costs and liabilities.\nWe have operations throughout the United States and are subject to multiple state and local regulations. In addition, our segments, particularly our Commercial & Industrial segment, may be subject to federal laws and requirements applicable to government contractors. Our 130 locations are located in 27 states, which exposes us to a variety of different state and local laws and regulations, particularly those pertaining to electrical contractor and other licensing requirements. These laws and regulations govern many aspects of our business, and there are often different standards and requirements in different locations. Changes in law, regulations or requirements, or a material failure to comply with any of them, could increase our costs and have other negative impacts on our business by, among other things, increasing costs, harming our reputation and, in some instances, causing us to be in violation of our contractual obligations.\nDisruptions to the proper functioning of our information technology systems or security breaches of our critical data, sensitive information or information technology systems could disrupt operations and cause increases in costs, decreases in revenues and/or harm to our reputation.\nOur Company continues to increase its dependence on information technology systems, networks, and infrastructure to conduct our day-to-day operations and manage the way we provide services to our customers. Disruptions to our information technology systems or our failure to adequately protect critical data, sensitive information, and information technology systems could materially affect our business or result in harm to our reputation. Our critical accounting, project management, estimating, and financial information systems, some of which are third-party platforms, all rely on the proper functioning and security of our information technology environment and are critical to the successful operation of our business. We also collect and retain information about our customers, stockholders, vendors, and employees, with the expectation by such third parties being that we will adequately protect such information. Although our information technology systems, networks and infrastructure are protected through our policies, procedures and physical and software safeguards, our information technology environment is still vulnerable to natural disasters, power losses, telecommunication failures, deliberate intrusions, inadvertent user misuse or error, computer viruses, malicious code, ransomware attacks, acts of terrorism and other cyber security risks, which could cause a loss of critical data, or release of sensitive information. If critical information systems fail or are otherwise unavailable, or if sensitive information is released, we could experience reputational harm, loss of customers and revenue, loss of proprietary data, regulatory actions and scrutiny, statutory penalties, and litigation.\nWe have from time to time experienced cybersecurity incidents, such as ransomware attacks or unauthorized parties gaining access to our information technology systems, and privacy incidents, such as potential exposure of data. While to date such incidents have not had a material impact on our business, there can be no assurance that future incidents would not have an adverse effect on our business or reputation. Additionally, the process of integrating the information systems of the businesses we acquire is complex and exposes us to additional risk as we might not adequately identify weaknesses in the acquired businesss information systems or information handling, privacy and security policies and protocols, which could expose us to unexpected liabilities or make our own systems and data more vulnerable to attack.\nWe may be required to conduct environmental remediation activities, which could be expensive and inhibit the growth of our business and our ability to maintain profitability, particularly in our Infrastructure Solutions business.\nWe are subject to a number of environmental laws and regulations, including those concerning the handling, treatment, storage, and disposal of hazardous materials. These laws predominantly affect our Infrastructure Solutions business but may impact our other businesses. These environmental laws generally impose liability on current and former owners and operators, transporters and generators of hazardous materials for remediation of contaminated properties. We could be held liable for such contamination created not only from our own activities but also from the historical activities of companies we have acquired, or the activities of others on properties that we own or lease. There can be no assurance that the discovery of currently unknown problems or conditions will not require substantial additional expenditures. In addition, if we do not comply with these laws and regulations, we could be subject to material administrative, civil or criminal penalties, or other substantial liabilities.\nCompliance with future changes in environmental laws and regulations, including those relating to climate change, could require significant expenditures.\nIncreasing concerns about climate change and other environmental issues may result in additional environmental regulations and restrictions, and we cannot predict the nature, scope or effect of legislation or regulatory requirements that could be imposed, or how existing or future laws or regulations will be administered or interpreted. Compliance with more stringent laws or regulations, as well as more vigorous enforcement policies of the regulatory agencies, could increase the costs of projects for us or our customers, potentially resulting in reduced profitability or a reduced demand for our services, or require us to incur substantial costs of compliance.\nThe loss of a group or several key personnel, either at the corporate or operating level, or general labor constraints could adversely affect our business.\nThe loss of key personnel or the inability to hire and retain qualified employees could have an adverse effect on our business, financial condition and results of operations. Our operations depend on the continued efforts of our executive officers, senior management and management personnel at our segments. As a service organization, relationships with significant customers can be dependent on certain employees within our organization, and our ability to meet our contractual obligations to our customers and support our growth strategy may be limited by our ability to retain and train necessary personnel. We cannot guarantee that any member of management at the corporate or operating segment level will continue in their capacity for any particular period of time, and there is significant competition in our industry for managerial personnel. We have a severance plan in place that covers certain of our senior leaders; however, this plan can neither guarantee that we will not lose key employees, nor prevent them from competing against us. If we lose a group of key personnel or even one key person at a segment, we may not be able to recruit suitable replacements at comparable salaries or at all, which could adversely affect our operations. Additionally, we generally do not maintain key man life insurance for members of our management.\nOur business is labor intensive, and many of our operations experience a high rate of employee turnover. We also may be constrained in hiring and retaining sufficient qualified employees to support our growth strategy due to general labor shortages in our industries. In addition, a lack of skilled labor or increased turnover rates within our employee base could lead to increased costs, such as increased overtime to meet demand and increased wage rates to attract and retain employees. Continued labor constraints may limit our ability to grow and may limit our profitability due to the impact of rising wages.\nRisks Relating to our Financial Results, Financing and Liquidity\nAvailability of net operating losses may be reduced by a change in ownership.\nA change in ownership, as defined by Internal Revenue Code Section 382, could reduce the availability of NOLs for federal and state income tax purposes. Should Tontine sell or otherwise dispose of all or a portion of its position in IES, a change in ownership could occur. A change in ownership could also result from the purchase of common stock by an existing or a new 5% shareholder as defined by Internal Revenue Code Section 382. As of September 30, 2022, we have approximately $61.0 million of federal NOLs that are available to use to offset future taxable income, including approximately $55.1 million resulting from net operating losses on which a deferred tax asset is not recorded. Should a change in ownership occur, all NOLs incurred prior to the change in ownership would be subject to limitation imposed by Internal Revenue Code Section 382, which would substantially reduce the amount of NOLs currently available to offset taxable income.\nWe have adopted tax positions that a taxing authority may view differently. If a taxing authority differs with our tax positions, our results may be adversely affected.\nOur effective tax rate, cash paid for taxes and the availability of our NOLs are impacted by the tax positions that we have adopted. Taxing authorities may not always agree with the positions we have taken. We have established reserves for tax positions that we have determined to be less than likely to be sustained by taxing authorities. However, there can be no assurance that our results of operations will not be adversely affected in the event that disagreement over our tax positions does arise.\nTo fund our working capital requirements, complete acquisitions and service any debt we may incur, we may require a significant amount of cash. Our ability to generate cash depends on many factors that are beyond our control.\nOur ability to continue to grow our business, including through acquisitions and the funding of working capital requirements, as well as our ability to make payments on or refinance any indebtedness we may incur, will depend on our ability to generate cash in the future. This is subject to our operational performance, as well as general economic, financial, competitive, legislative, regulatory and other factors that are beyond our control.\nWe cannot provide assurance that our business will generate sufficient cash flow from operations or asset sales or that future borrowings will be available to us under our credit facility in an amount sufficient to enable us to complete acquisitions, to service any debt we may incur or to fund our other liquidity needs. We may need to refinance our credit facility on or before maturity. We cannot provide assurance that we will be able to refinance our credit facility on commercially reasonable terms or at all. Our inability to access capital on commercially reasonable terms could have a material adverse effect on our business.\nNegative conditions in the credit and capital markets may adversely impact our ability to operate our business.\nIn the past, the level of demand from our customers for our services has been adversely impacted by slowdowns in our customers' industries as well as in the economy in general. A number of economic factors, including financing conditions for our customers' industries, have, in the past, adversely affected our customers and their ability or willingness to fund expenditures. Many of our customers depend on the availability of credit to help finance their capital and maintenance projects. At times, tightened availability of credit and changes in interest rates that affect the cost of construction financing and mortgages have negatively impacted the ability of existing and prospective customers to obtain sufficient financing and fund projects we might otherwise perform. As a result, our customers may defer such projects for an unknown, and perhaps lengthy, period. Any such deferrals would inhibit our growth and would adversely affect our results of operations.\nIn a weak economic environment, particularly in a period of restrictive credit markets, we may experience greater difficulties in collecting payments from, and negotiating change orders and/or claims with, our customers due to, among other reasons, a diminution in our ultimate customers access to the credit markets. If clients delay in paying or fail to pay a significant amount of our outstanding receivables, or we fail to successfully negotiate a significant portion of our change orders and/or claims with customers, it could have an adverse effect on our liquidity, results of operations, and financial position.\nWe have restrictions and covenants under our credit agreement and the failure to meet these covenants, including liquidity and other financial requirements, could result in a default under our credit agreement.\nWe may not be able to remain in compliance with the covenants in our credit agreement, including financial covenants which, among other things, require minimum levels of liquidity and require us to maintain a specified fixed charge coverage ratio as defined under our credit agreement. Other covenants, among other things, limit our ability to provide liens, restrict fundamental changes, limit transactions with affiliates and subsidiaries, restrict changes to our organization documents, limit asset dispositions, limit investments, limit the ability to incur debt, restrict certain payments to shareholders, limit our ability to repurchase our stock, and limit the ability to change the nature of our business. A failure to fulfill the terms and requirements of our credit agreement may result in a default under our credit agreement and acceleration of any indebtedness we may incur, as well as a default under one or more of our material agreements, any of which could have a material adverse effect on our ability to conduct our operations and our financial condition.\nOur use of percentage-of-completion accounting could result in a reduction or elimination of previously reported profits, and we may be adversely impacted by new accounting, control and operating procedures.\nA significant portion of our revenue is recognized using the percentage-of-completion method of accounting, utilizing the cost-to-cost method, which results in our recognizing contract revenues and earnings ratably over the contract term in proportion to contract costs incurred. The earnings or losses recognized on individual contracts are based on estimates of contract revenues, costs and profitability. We review our estimates of contract revenue, costs and profitability on an ongoing basis. Prior to contract completion, we may adjust our estimates on one or more occasions as a result of change orders to the original contract, collection disputes with the customer on amounts invoiced or claims against the customer for increased costs incurred by us due to customer-induced delays and other factors. Contract losses are recognized in full when determined to be probable and reasonably estimable. Although we have historically made reasonably reliable estimates of the progress towards completion of our construction contracts, the uncertainties inherent in the estimating process make it possible for actual costs to vary materially from estimates, including reductions or reversals of previously recorded revenues and profits. In addition, we may be adversely impacted by new accounting pronouncements which change our revenue recognition or other accounting practices or otherwise alter how we report our financial results, or which require that we change our control and operating procedures, which we may be unable to do in a timely manner.\nOur reported operating results could be adversely affected as a result of goodwill impairment charges.\nGAAP accounting requires that goodwill attributable to each of our reporting units be tested at least annually, or when changes in circumstance indicate the carrying value of our reporting units may not be recoverable. At September 30, 2022, we had recorded $92 million of goodwill on our Consolidated Balance Sheets. Factors that could lead to impairment of current goodwill in the future include significant adverse changes in the business climate, declines in the financial condition of our business, and actual or projected future operating results affecting the Company as a whole or affecting any particular reporting unit. On an ongoing basis, we expect to perform impairment tests at least annually as of September 30. Impairment adjustments, if any, are required to be recognized as operating expenses. We cannot assure that we will not have future impairment adjustments to our recorded goodwill.\nRisks Relating to Our Common Stock\nExistence of a controlling shareholder.\nA majority of our outstanding common stock is owned by Tontine, and Jeffrey Gendell, founder and managing member of Tontine, serves as our Chief Executive Officer and as Chairman of our Board of Directors. Tontine owns approximately 57 percent of the Companys outstanding common stock based on a Form 4 filed by Tontine with the SEC on December 3, 2021, and the Company's\nshares outstanding as of December 2, 2022. As a result, Tontine can control most of our affairs, including the election of our directors, who in turn appoint executive management and can control most actions requiring the approval of shareholders, including the adoption of amendments to our corporate charter and approval of any potential merger or sale of all or substantially all of the Company's assets or business segments or the Company itself. This control also gives Tontine the ability to bring matters to a shareholder vote that may not be in the best interest of our other shareholders or stakeholders. Additionally, Tontine is in the business of investing in companies and may, from time to time, acquire and hold interests in businesses that compete directly or indirectly with us or act as suppliers or customers of the Company. Pursuant to a resale shelf registration statement filed by the Company, Tontine has the ability to resell any or all of its registered shares from time to time in one or more offerings as long as the registration statement remains effective and the Company remains eligible to use it, as described further in the registration statement and in any prospectus supplement filed in connection with an offering pursuant to the shelf registration statement. Tontines sale of all or any portion of its shares could result in a change of control of the Company, which would trigger the change of control provisions in a number of our material agreements, including our credit agreement, bonding agreements with our sureties, and our executive severance plan, and could trigger limitations on the availability of our NOLs under Internal Revenue Code Section 382.\nOur common stock has less liquidity than many other stocks listed on the Nasdaq Global Market.\nHistorically, the trading volume of our common stock has been relatively low when compared to other companies listed on the Nasdaq Global Market or other stock exchanges. While we have experienced increased liquidity in our stock during recent years compared with historical levels, we cannot say with certainty that a more active and liquid trading market for our common stock will continue to develop. Because of this, it may be more difficult for shareholders to sell a substantial number of shares for the same price at which shareholders could sell a smaller number of shares.\nWe may issue additional shares of common stock, preferred stock or convertible securities that will dilute the percentage ownership interest of existing stockholders and may dilute the book value per share of our common stock.\nOur authorized capital includes 100,000,000 shares of common stock and 10,000,000 shares of preferred stock. As of September 30, 2022, we had 22,049,529 shares of common stock issued, 20,341,900 shares of common stock outstanding and no shares of preferred stock issued or outstanding. As of September 30, 2022, we had the ability to issue 713,058 shares of common stock, including upon the exercise of options, as future grants under our existing equity compensation plans.\nAlthough we currently do not have any intention of issuing additional common stock (other than pursuant to our equity compensation plans) or preferred stock, we may do so in the future in order to meet our capital needs. Subject to applicable Nasdaq Listing Rules, our Board of Directors generally has the authority, without action by or vote of the stockholders, to issue all or part of any authorized but unissued shares of common stock or preferred stock for any corporate purpose. We may seek additional equity capital in the future as we develop our business and expand our operations. Any issuance of additional shares of common stock, preferred stock, or convertible securities will dilute the percentage ownership interest of our stockholders and may dilute the book value per share of our common stock.\nSubstantial sales of our common stock could adversely affect our stock price.\nMost of Tontine's shares are registered for resale on a resale shelf registration statement filed by the Company with the SEC. Sales of a substantial number of shares of our common stock by holders of our common stock, including Tontine, or the perception that such sales could occur, could adversely affect the market price of our common stock by introducing a large number of shares into the market. Such sales, or the perception that such sales could occur, could cause the market price of our common stock to decline. We cannot predict whether future sales of our common stock, or the availability of our common stock for sale, will adversely affect the market price for our common stock or our ability to raise capital by offering equity securities.\nIncreasing scrutiny and changing expectations from investors and customers with respect to our environmental, social and governance practices may impose additional costs on us or expose us to reputational or other risks.\nInvestors have increased their emphasis on the environmental, social and governance (\"ESG\") practices of companies across all industries, including the environmental impact of operations and human capital management. Certain stockholders use third-party benchmarks or scores to measure a companys ESG practices and decide whether to invest in its common stock or engage with the company to require changes to its practices. In addition, our customers may evaluate our ESG practices or require that we adopt certain ESG policies as a condition of awarding contracts.\nA failure to comply with investor or customer expectations and standards, which are evolving and vary considerably, or the perception that we have not responded appropriately to the growing concern for ESG issues, could result in reputational harm to our business and could have an adverse effect on us.\nIn addition, organizations that provide ratings information to investors on ESG matters may assign unfavorable ratings to IES or our industries, which may lead to negative investor sentiment and the diversion of investment capital to other companies or industries, which could have a negative impact on our stock price and our costs of capital.\nOur bylaws designate the Court of Chancery of the State of Delaware as the sole and exclusive forum for certain types of actions and proceedings that may be initiated by our shareholders, which could increase the costs for our shareholders to bring claims, discourage our shareholders from bringing claims, or limit our shareholders ability to obtain a favorable judicial forum for disputes with us or our current or former directors, officers, employees or shareholders in such capacity.\nOur bylaws provide that, unless we consent in writing to the selection of an alternative forum, the Court of Chancery of the State of Delaware is, to the fullest extent permitted by law, the sole and exclusive forum for claims, including derivative claims that are based upon a violation of a duty by a current or former director, officer, employee or shareholder in such capacity or as to which the Delaware General Corporation Law confers jurisdiction upon the Court of Chancery. The exclusive forum provision may increase the costs for a shareholder to bring a claim or limit a shareholders ability to bring a claim in a judicial forum that the shareholder finds favorable for disputes with us or our directors, officers, employees or shareholders in such capacity, which may discourage such lawsuits against us and such persons. Alternatively, if a court were to find these provisions of our bylaws inapplicable to, or unenforceable in respect of, the claims as to which they are intended to apply, then we may incur additional costs associated with resolving such matters in other jurisdictions, which could adversely affect our business, financial position or results of operations. While the exclusive forum provision applies to state and federal law claims, our shareholders will not be deemed to have waived our compliance with, and the exclusive forum provision will not preclude or contract the scope of exclusive federal or concurrent jurisdiction for actions brought under, the federal securities laws, including the Exchange Act, or the Securities Act of 1933, as amended, and the rules and regulations promulgated thereunder.\nGeneral Risks\nOur internal controls over financial reporting and our disclosure controls and procedures may not prevent all possible errors that could occur. Internal controls over financial reporting and disclosure controls and procedures, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objective will be met.\nOn a quarterly basis, we evaluate our internal controls over financial reporting and our disclosure controls and procedures, which include a review of the objectives, design, implementation and effectiveness of the controls and the information generated for use in our periodic reports. In the course of our controls evaluation, we sought (and seek) to identify data errors, control problems and to confirm that appropriate corrective actions, including process improvements, are being undertaken. This type of evaluation is conducted on a quarterly basis so that the conclusions concerning the effectiveness of our controls can be reported in our periodic reports.\nA control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be satisfied. Internal controls over financial reporting and disclosure controls and procedures are designed to give reasonable assurance that they are effective and achieve their objectives. We cannot provide absolute assurance that all possible future control issues have been detected. These inherent limitations include the possibility that our judgments can be faulty and that isolated breakdowns can occur because of human error or mistake. The design of our system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed absolutely in achieving our stated goals under all potential future or unforeseeable conditions. Because of the inherent limitations in a cost-effective control system, misstatements due to error could occur without being detected. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nAt September 30, 2022, we maintained branch offices, warehouses, sales facilities and administrative offices at 130 locations. The majority of our facilities are leased. We lease our executive office located in Greenwich, Connecticut and our corporate office located in Houston, Texas. We believe that our properties are adequate for our current needs and that suitable additional or replacement space will be available as required. For a breakdown of our offices by segment, see Item 1. Business -Operating Segments of this Annual Report on Form 10-K. Item 3. Legal Proceedings\nFor further information regarding legal proceedings, see Note 18, Commitments and Contingencies - Legal Matters in the notes to our Consolidated Financial Statements. Item 4. Mine Safety Disclosures\nNone.\nPART II Item 5. Market for Registrants Common Equity; Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock trades on the Nasdaq Global Market under the ticker symbol IESC.\nAs of December 2, 2022, the closing market price of our common stock was $34.50 per share and there were approximately 321 holders of record.\nWe have never declared or paid dividends on our common stock. We intend to retain any future earnings and do not expect to pay cash dividends in the foreseeable future.\nStock Repurchase Program\nIn 2015, our Board of Directors authorized a stock repurchase program for the purchase from time to time of up to 1.5 million shares of the Companys common stock, and in 2019, authorized the repurchase from time to time of up to an additional 1.0 million shares of the Company's common stock under the stock repurchase program. Share purchases are made for cash in open market transactions at prevailing market prices or in privately negotiated transactions or otherwise. The timing and amount of purchases under the program are determined based upon prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. All or part of the repurchases may be implemented under a Rule 10b5-1 trading plan, which allows repurchases under pre-set terms at times when the Company might otherwise be prevented from purchasing under insider trading laws or because of self-imposed blackout periods. The program does not require the Company to purchase any specific number of shares and may be modified, suspended or reinstated at any time at the Companys discretion and without notice. During the year ended September 30, 2022, we repurchased 511,600 shares of common stock at an average price of $32.02 per share for a total aggregate purchase price of $16.4 million. The Company had 358,020 shares remaining under its stock repurchase authorization at September 30, 2022.\nIn December 2022, our Board of Directors terminated our previous share repurchase program and authorized a new $40 million share repurchase program.\nThe following table presents information with respect to purchases of common stock by the Company during the three months ended September 30, 2022:\nPeriod Total Number of Shares Purchased Average Price Paid Per Share Total Number of Shares Purchased as Part of a Publicly Announced Plan Maximum Number of Shares That May Yet Be Purchased Under the Publicly Announced Plan as of September 30, 2022\nJuly 1, 2022 - July 31, 2022 88,092 $30.86 88,092 536,639\nAugust 1, 2022 - August 31, 2022 48,939 $32.47 48,939 487,700\nSeptember 1, 2022 - September 30, 2022 129,680 $28.90 129,680 358,020\nTotal 266,711 $30.20 266,711 358,020\nFive-Year Stock Performance Graph\nThe graph below compares the cumulative five year total return provided shareholders on IES Holdings, Inc.'s common stock relative to the cumulative total returns of the Russell 2000 index and a customized peer group of four companies that includes Comfort Systems USA Inc., MYR Group Inc., Sterling Construction Company Inc. and Primoris (collectively, the \"Peer Group\"). An investment of $100 (with reinvestment of all dividends) is assumed to have been made in our common stock, in the Russell 2000 index, and in the peer group on September 30, 2017, and its relative performance is tracked through September 30, 2022.\nComparison of Five Year Cumulative Total Return*\nAmong IES Holdings, Inc., the Russell 2000 Index, and a Peer Group\n*$100 invested on 9/30/17 in stock or index, including reinvestment of dividends.\nYear Ended September 30,\n2017 2018 2019 2020 2021 2022\nIES Holdings, Inc. $ 100.00 112.72 119.02 183.64 264.10 159.65\nRussell 2000 100.00 115.24 105.00 105.40 155.66 119.08\nPeer Group 100.00 112.56 96.88 107.98 195.85 193.22  Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with our Consolidated Financial Statements and the notes thereto, set forth in Item 8.Financial Statements and Supplementary Data of this Annual Report on Form 10-K. For additional information, see Disclosure Regarding Forward Looking Statements in Part I of this Annual Report on Form 10-K.\nOVERVIEW\nExecutive Overview\nPlease refer to Item 1. Business of this Annual Report on Form 10-K for a discussion of the Companys services and corporate strategy. IES Holdings, Inc., a Delaware corporation, designs and installs integrated electrical and technology systems and provides infrastructure products and services to a variety of end markets, including data centers, residential housing, and commercial and industrial facilities. Our operations are organized into four business segments: Communications, Residential, Infrastructure Solutions and Commercial & Industrial.\nIndustry Trends\nOur performance is affected by a number of trends that drive the demand for our services. In particular, the markets in which we operate are exposed to many regional and national trends such as the demand for single and multi-family housing, the need for mission\ncritical facilities as a result of technology-driven advancements, capital spending on data centers, distribution centers, and high-tech manufacturing facilities, demand for back-up power, output levels and equipment utilization at heavy industrial facilities, demand for our rail and infrastructure services and custom engineered products, and changes in commercial, institutional, public infrastructure and electric utility spending. Over the long term, we believe that there are numerous factors that could positively drive demand and affect growth within the industries in which we operate, including (i) population growth, which will increase the need for commercial and residential facilities, (ii) aging public infrastructure, which must be replaced or repaired, (iii) an increasing demand for data storage, and (iv) increased emphasis on environmental and energy efficiency, which may lead to increased public and private spending. However, there can be no assurance that we will not experience a decrease in demand for our services due to economic, technological or other factors beyond our control, including interest rate changes, increases in the price of copper, aluminum, steel, fuel, electrical components, certain plastics, and other commodity prices and other economic factors, which may reduce the demand for housing in the regions where our Residential division operates, and may impact levels of construction. For a further discussion of the industries in which we operate, please see Item 1. Business - Operating Segments of this Annual Report on Form 10-K.\nBusiness Outlook\nWhile there are differences among the Companys segments, on an overall basis, increased demand for the Companys services and the Companys previous investment in growth initiatives and other business-specific factors discussed below resulted in aggregate year-over-year revenue growth in fiscal 2022 as compared to fiscal 2021. In addition, revenue growth during fiscal 2022 at our Residential and Infrastructure Solutions segments reflects the contribution of acquisitions completed during fiscal 2021.\nOur business segments each have their own unique set of factors influencing demand for our services, While we are entering the year with strong backlog levels in each of our business segments, we are also closely monitoring weakness in the residential construction market and, more generally, heightened uncertainty regarding the future direction of the overall economy. Based on current trends in demand for housing heading into fiscal 2023, we expect that a revenue decline in our single-family housing business, where we typically do not enter into long-term contracts, will offset, or more than offset, revenue growth from our multi-family housing and other backlog-driven businesses during the year. Nevertheless, we remain focused on monitoring costs, improving margins, and capitalizing on opportunities to expand our service lines and gain market share, as many of our markets continue to experience highly competitive margins and increasing costs. Further, we believe our strong balance sheet and flexible operating model position us to navigate challenges we may encounter in a more uncertain economy.\nTo continue to grow our business, including through acquisitions and the funding of working capital, we may require a significant amount of cash. Our ability to generate cash depends on many externally influenced factors, including demand for our services, the availability of projects at margins acceptable to us, the ultimate collectability of our receivables, our ability to borrow on our credit facility, and our ability to raise funds in the capital markets, among many other factors. We anticipate that the combination of cash on hand, cash flows from operations and available capacity under our credit facility will provide sufficient cash to enable us to meet our working capital needs, debt service requirements and capital expenditures for property and equipment through the next 12 months. We expect our capital expenditures will range from $12.0 million to $17.0 million for the year ending on September 30, 2023.\nCurrent Market and Operating Conditions\nThe Federal Reserve has raised the target federal funds rate six times since the beginning of calendar 2022 and has announced an expectation that it will continue to raise the target rate through the end of 2022 and into 2023. This has resulted in higher mortgage rates, which when combined with elevated materials and labor costs, have had a substantial impact on the affordability of housing. There continue to be several trends, such as rising household formation and population growth in our key markets, that we expect will drive long-term demand for our services in the single-family housing market. However, going into fiscal 2023, we do expect housing affordability to cause a near-term decrease in demand for our services in this market.\nThe COVID-19 pandemic and its impact on markets, the supply chain and the labor force continued to influence trends affecting our business throughout fiscal 2022. While commodity prices for some of the materials we procure recently have begun to stabilize, concerns remain around limited availability or delays in deliveries for certain materials necessary for our projects, notably copper, steel, aluminum, electronic components, and certain plastics. Reduced availability of certain materials has resulted in a continuing need to take actions such as carrying higher levels of inventory than we typically hold, or, in some cases, substituting higher-cost materials or sourcing materials from new suppliers which may offer less favorable terms or pricing than our usual suppliers. Such actions have resulted in elevated levels of working capital throughout fiscal 2022. We seek to mitigate supply chain risk by maintaining relationships with multiple vendors, and to recoup higher materials costs through adjusted pricing. However, we are not able to pass on all increased costs, and our suppliers are facing challenges in providing the materials we require. We have also experienced, and may continue to experience, workforce disruptions related to exposure to, or illness from, COVID-19, resulting in production inefficiencies and delays, higher overtime costs, and the need to outsource activities or use more expensive contract labor. An inability to procure materials in a timely manner, to complete work on schedule, and to reflect higher materials or labor costs in our pricing to customers has had, and could continue to have, a significant impact on our operating results.\nRESULTS OF OPERATIONS\nWe report our operating results across our four operating segments: Communications, Residential, Infrastructure Solutions and Commercial & Industrial. Expenses associated with our corporate office are classified separately. The following table presents selected historical results of operations of IES, as well as the results of acquired businesses from the dates acquired.\nYear Ended September 30,\n2022 2021 2020\n$ % $ % $ %\n(Dollars in thousands, Percentage of revenues)\nRevenues $ 2,166,808 100.0 % $ 1,536,493 100.0 % $ 1,190,856 100.0 %\nCost of services 1,847,878 85.3 % 1,248,495 81.3 % 962,897 80.9 %\nGross profit 318,930 14.7 % 287,998 18.7 % 227,959 19.1 %\nSelling, general and administrative expenses 262,714 12.1 % 202,251 13.2 % 170,911 14.4 %\nGoodwill impairment expense - - % - - % 6,976 0.7 %\nContingent consideration 277 - % 211 - % (11) - %\nGain on sale of assets (69) - % (47) - % - - %\nOperating income 56,008 2.6 % 85,583 5.6 % 50,083 4.2 %\nInterest and other expense, net 3,007 0.1 % 676 - % 789 0.1 %\nOperating income before income taxes 53,001 2.4 % 84,907 5.5 % 49,294 4.1 %\nProvision for income taxes 12,815 0.6 % 16,231 1.1 % 8,740 0.7 %\nNet income 40,186 1.9 % 68,676 4.5 % 40,554 3.4 %\nNet (income) loss attributable to noncontrolling interest (5,424) (0.3) % (2,018) (0.1) % 1,045 0.1 %\nNet income attributable to IES Holdings, Inc. $ 34,762 1.6 % $ 66,658 4.3 % $ 41,599 3.5 %\n2022 Compared to 2021\nConsolidated revenues for the year ended September 30, 2022, were $630.3 million higher than for the year ended September 30, 2021, an increase of 41.0%, with increases at all four of our operating segments, driven by strong demand and the contribution of businesses acquired in fiscal 2021.\nOur overall gross profit percentage decreased to 14.7% during the year ended September 30, 2022, as compared to 18.7% during the year ended September 30, 2021. Gross profit as a percentage of revenue decreased at all four of our operating segments. See further discussion below of changes in gross margin for our individual segments.\nSelling, general and administrative expenses include costs not directly associated with performing work for our customers. These costs consist primarily of compensation and benefits related to corporate, business segment and branch management (including incentive-based compensation), occupancy and utilities, training, professional services, information technology costs, consulting fees, travel and certain types of depreciation and amortization. We allocate certain corporate selling, general and administrative costs across our segments as we believe this more accurately reflects the costs associated with operating each segment.\nDuring the year ended September 30, 2022, our selling, general and administrative expenses were $262.7 million, an increase of $60.5 million, or 29.9% over the year ended September 30, 2021, driven by increased personnel costs, primarily at our Residential operating segment, in connection with its growth, and the impact of businesses acquired during fiscal 2021, including amortization of intangible assets. Selling, general and administrative expenses as a percentage of revenue decreased to 12.1% for the year ended September 30, 2022 from 13.2% for the year ended September 30, 2021, as we benefited from the increased scale of our operations.\n2021 Compared to 2020\nConsolidated revenues for the year ended September 30, 2021, were $345.6 million higher than for the year ended September 30, 2020, an increase of 29.0% with increases across all segments, driven by strong demand and the contribution of acquired businesses.\nOur overall gross profit percentage decreased to 18.7% during the year ended September 30, 2021, as compared to 19.1% during the year ended September 30, 2020. Gross profit as a percentage of revenue increased at our Infrastructure Solutions and Commercial & Industrial segments, but decreased at our Communications and Residential segments, as discussed in further detail with respect to each segment below.\nDuring the year ended September 30, 2021, our selling, general and administrative expenses were $202.3 million, an increase of $31.3 million, or 18.3% over the year ended September 30, 2020, driven by increased personnel costs at our Communications and Residential operating segments in connection with their growth, increased incentive compensation in connection with improved results at those segments, and the impact of businesses acquired during fiscal 2021. Selling, general and administrative expenses as a percentage of revenue decreased to 13.2% for the year ended September 30, 2021 from 14.4% for the year ended September 30, 2020.\nFor the year ended September 30, 2020, we recognized a non-cash goodwill impairment charge of $7.0 million relating to our Commercial & Industrial segment.\nCommunications\n2022 Compared to 2021\nYear Ended September 30,\n2022 2021\n$ % $ %\n(Dollars in thousands, Percentage of revenues)\nRevenues $ 559,777 100.0 % $ 445,968 100.0 %\nCost of services 490,959 87.7 % 361,197 81.0 %\nGross Profit 68,818 12.3 % 84,771 19.0 %\nSelling, general and administrative expenses 46,717 8.3 % 41,373 9.3 %\n(Gain)/Loss on sale of assets 12 - % (4) - %\nOperating Income 22,089 3.9 % 43,402 9.7 %\nRevenue. Our Communications segments revenues increased by $113.8 million, or 25.5%, during the year ended September 30, 2022, compared to the year ended September 30, 2021. This increase primarily resulted from increased demand from our data center customers.\nGross Profit. Our Communications segments gross profit during the year ended September 30, 2022, decreased $16.0 million, or 18.8%, as compared to the year ended September 30, 2021. Gross profit as a percentage of revenue decreased from 19.0% for the year ended September 30, 2021 to 12.3% for the year ended September 30, 2022. During fiscal 2022, we expanded our offerings to our data center customers into a new, adjacent service area; however, we had execution issues and recorded a combined loss of $19.9 million on a series of these projects for the year ended September 30, 2022. As a result of this loss, we are no longer pursuing work in this service area. As of September 30, 2022, our work on such projects was substantially complete. Our operating margins for the year ended September 30, 2022 were also negatively impacted by a shift in our mix of customers, as well as a more competitive bidding environment in the distribution center and warehouse market, which has experienced slowing activity following a period of significant pandemic-related growth. Supply chain challenges and workforce disruptions related to COVID-19 have also continued to affect project efficiency. Finally, we continue to invest in hiring and training personnel, particularly in estimating and project management, to grow the business.\nSelling, General and Administrative Expenses. Our Communications segments selling, general and administrative expenses increased $5.3 million, or 12.9% during the year ended September 30, 2022, as compared to the year ended September 30, 2021. The increase is a result of higher personnel cost in connection with the growth of our business, as well as higher wages in an increasingly competitive labor market. We also experienced a more typical level of selling expense for the year ended September 30, 2022 as compared to the year ended September 30, 2021, when travel and other activities were curtailed due to the pandemic. Selling, general and administrative expenses as a percentage of revenue in the Communications segment were 8.3% during the year ended September 30, 2022, compared to 9.3% for the year ended September 30, 2021, as we have benefited from the scale of our operations.\n2021 Compared to 2020\nYear Ended September 30,\n2021 2020\n$ % $ %\n(Dollars in thousands, Percentage of revenues)\nRevenues $ 445,968 100.0 % $ 395,141 100.0 %\nCost of services 361,197 81.0 % 317,013 80.2 %\nGross Profit 84,771 19.0 % 78,128 19.8 %\nSelling, general and administrative expenses 41,373 9.3 % 37,674 9.5 %\n(Gain)/Loss on sale of assets (4) - % 8 - %\nOperating Income 43,402 9.7 % 40,446 10.2 %\nRevenue. Our Communications segments revenues increased by $50.8 million, or 12.9%, during the year ended September 30, 2021, compared to the year ended September 30, 2020. This increase primarily resulted from increased demand from our data center and distribution center customers. Revenues in our Communications segment can vary from period to period based on the capital spending cycles of our customers.\nGross Profit. Our Communications segments gross profit during the year ended September 30, 2021, increased $6.6 million, or 8.5%, as compared to the year ended September 30, 2020. Gross profit as a percentage of revenue decreased from 19.8% for the year ended September 30, 2020 to 19.0% for the year ended September 30, 2021, as we invested in hiring and training personnel, particularly in estimating and project management, to grow the business. Additionally, during the fourth fiscal quarter of 2020, we benefited from some larger than typical efficiency gains from strong project execution.\nSelling, General and Administrative Expenses. Our Communications segments selling, general and administrative expenses increased $3.7 million, or 9.8% during the year ended September 30, 2021, as compared to the year ended September 30, 2020. The increase was a result of higher personnel cost, particularly related to continuing investment to support the growth of the business, along with higher incentive compensation expense in connection with improved profitability and cash flows. Selling, general and administrative expenses as a percentage of revenues in the Communications segment decreased from 9.5% for the year ended September 30, 2020 to 9.3% of segment revenue during the year ended September 30, 2021, as we benefited from the increased scale of our operations.\nResidential\n2022 Compared to 2021\nYear Ended September 30,\n2022 2021\n$ % $ %\n(Dollars in thousands, Percentage of revenues)\nRevenues $ 1,131,414 100.0 % $ 687,347 100.0 %\nCost of services 928,161 82.0 % 553,546 80.5 %\nGross Profit 203,253 18.0 % 133,801 19.5 %\nSelling, general and administrative expenses 144,100 12.7 % 92,761 13.5 %\nContingent consideration 277 - % 211 - %\nLoss on sale of assets 20 - % 86 - %\nOperating Income 58,856 5.2 % 40,743 5.9 %\nRevenue. Our Residential segments revenues increased by $444.1 million, or 64.6%, during the year ended September 30, 2022, as compared to the year ended September 30, 2021, reflecting a full year of revenue contribution from businesses acquired in fiscal 2021, strong demand for single-family and multi-family housing and the impact of price increases in connection with a higher cost of materials. Businesses acquired in fiscal 2021 contributed $233.1 million of the total increase for the year ended September 30, 2022 compared to the year ended September 30, 2021. Inclusive of these acquired businesses, revenue in our single-family business increased by $371.1 million for the year ended September 30, 2022, compared to the year ended September 30, 2021, while multi-family and other revenue increased by $73.0 million.\nGross Profit. During the year ended September 30, 2022, our Residential segment gross profit increased by $69.5 million, or 51.9%, as compared to the year ended September 30, 2021. The increase in gross profit was driven primarily by contributions from the businesses acquired in fiscal 2021 and higher volumes, partly offset by increased commodity prices. Gross margin as a percentage of revenue decreased to 18.0% during the year ended September 30, 2022 from 19.5% for the year ended September 30, 2021, primarily as a result of increased commodity prices and a reduction in project efficiency related to supply-chain challenges and the COVID-19 pandemic.\nSelling, General and Administrative Expenses. Our Residential segment's selling, general and administrative expenses increased by $51.3 million, or 55.3%, during the year ended September 30, 2022, compared to the year ended September 30, 2021. Selling, general and administrative expenses incurred at the businesses acquired during fiscal 2021, including amortization of intangible assets, contributed $21.3 million of the increase. The remaining increase was driven by higher personnel cost in connection with business growth, including incentive profit sharing for division management. Selling, general and administrative expenses as a percentage of revenues in the Residential segment decreased to 12.7% during the year ended September 30, 2022, from 13.5% during the year ended September 30, 2021, as we benefited from the increased scale of our operations.\n2021 Compared to 2020\nYear Ended September 30,\n2021 2020\n$ % $ %\n(Dollars in thousands, Percentage of revenues)\nRevenues $ 687,347 100.0 % $ 411,790 100.0 %\nCost of services 553,546 80.5 % 318,034 77.2 %\nGross Profit 133,801 19.5 % 93,756 22.8 %\nSelling, general and administrative expenses 92,761 13.5 % 63,668 15.5 %\nContingent consideration 211 - % - - %\nLoss on sale of assets 86 - % 2 - %\nOperating Income 40,743 5.9 % 30,086 7.3 %\nRevenue. Our Residential segments revenues increased by $275.6 million, or 66.9%, during the year ended September 30, 2021, as compared to the year ended September 30, 2020, reflecting the revenue contribution of businesses acquired in fiscal 2021, strong demand for single-family and multi-family housing and the impact of price increases in connection with a higher cost of materials. Businesses acquired in fiscal 2021 contributed $172.6 million of revenue for the year ended September 30, 2021. Inclusive of these acquired businesses, revenue in our single-family business increased by $215.3 million for the year ended September 30, 2021, compared to the year ended September 30, 2020, while multi-family and other revenue increased by $60.2 million. Excluding the impact of the businesses acquired during fiscal 2021, our Residential segment's revenues grew by 25.0% for the year ended September 30, 2021.\nGross Profit. During the year ended September 30, 2021, our Residential segment experienced a $40.0 million, or 42.7%, increase in gross profit as compared to the year ended September 30, 2020. The increase in gross profit was driven primarily by $27.9 million contributed by the businesses acquired in fiscal 2021, as well as higher volumes, partly offset by increased commodity prices. Gross margin as a percentage of revenue decreased from 22.8% for the year ended September 30, 2020 to 19.5% during the year ended September 30, 2021, primarily as a result of higher commodity prices.\nSelling, General and Administrative Expenses. Our Residential segment's selling, general and administrative expenses increased $29.1 million, or 45.7%, during the year ended September 30, 2021, compared to the year ended September 30, 2020. Selling, general and administrative expenses incurred at the businesses acquired during fiscal 2021, including amortization of intangible assets, contributed $20.1 million of the increase. The remaining increase was driven by higher personnel cost in connection with business growth, including incentive profit sharing for division management. Selling, general and administrative expenses as a percentage of revenues in the Residential segment decreased from 15.5% during the year ended September 30, 2020 to 13.5% during the year ended September 30, 2021, as we benefited from the increased scale of our operations.\nInfrastructure Solutions\n2022 Compared to 2021\nYear Ended September 30,\n2022 2021\n$ % $ %\n(Dollars in thousands, Percentage of revenues)\nRevenues $ 167,113 100.0 % $ 146,980 100.0 %\nCost of services 138,444 82.8 % 106,048 72.2 %\nGross Profit 28,669 17.2 % 40,932 27.8 %\nSelling, general and administrative expenses 25,129 15.0 % 23,966 16.3 %\nGain on sale of assets (46) - % (10) - %\nOperating Income 3,586 2.1 % 16,976 11.5 %\nRevenue. Revenues in our Infrastructure Solutions segment increased by $20.1 million, or 13.7% during the year ended September 30, 2022 compared to the year ended September 30, 2021. The increase in revenue was driven primarily by increased demand at our generator enclosure business as well as the acquisition of Wedlake Fabricating, Inc. (\"Wedlake\") during the first quarter of fiscal 2021, which contributed $16.9 million of the increase.\nGross Profit. Our Infrastructure Solutions segments gross profit for the year ended September 30, 2022, decreased by $12.3 million, as compared to the year ended September 30, 2021, reflecting the impact of supply chain disruptions on our generator enclosure business, COVID-19 related labor inefficiencies, and operating inefficiencies in connection with the relocation of the Wedlake business to a new, larger facility that expands capacity while allowing for improved workflow and process efficiency. The transition to and setup of the new facility were completed during the third quarter of fiscal 2022. Gross profit as a percent of revenue decreased to 17.2% for the year ended September 30, 2022 compared to 27.8% for the year ended September 30, 2021. Additionally, during the year ended September 30, 2021, we benefited from workers' compensation refunds received from the State of Ohio.\nSelling, General and Administrative Expenses. Our Infrastructure Solutions segments selling, general and administrative expenses during the year ended September 30, 2022, increased $1.2 million compared to the year ended September 30, 2021, primarily as a result of expenses incurred at the Wedlake business acquired during the first fiscal quarter of 2021. Selling, general and administrative expenses as a percentage of revenue decreased from 16.3% for the year ended September 30, 2021, to 15.0% for the year ended September 30, 2022.\n2021 Compared to 2020\nYear Ended September 30,\n2021 2020\n$ % $ %\n(Dollars in thousands, Percentage of revenues)\nRevenues $ 146,980 100.0 % $ 128,379 100.0 %\nCost of services 106,048 72.2 % 93,358 72.7 %\nGross Profit 40,932 27.8 % 35,021 27.3 %\nSelling, general and administrative expenses 23,966 16.3 % 20,418 15.9 %\n(Gain)/Loss on sale of assets (10) - % 35 - %\nOperating Income 16,976 11.5 % 14,568 11.3 %\nRevenue. Revenues in our Infrastructure Solutions segment increased by $18.6 million, or 14.5% during the year ended September 30, 2021 compared to the year ended September 30, 2020. Increased demand for our custom power solutions was partially offset by lower revenue from our industrial services business. The demand for our motor repair services continues to be affected by reduced demand from customers in the steel and rail industries. During the year ended September 30, 2021, the Wedlake business acquired during the first fiscal quarter 2021 contributed $7.1 million of revenue for the year ended September 30, 2021.\nGross Profit. Our Infrastructure Solutions segments gross profit for the year ended September 30, 2021, increased by $5.9 million, as compared to the year ended September 30, 2020, reflecting improved overall operational efficiencies. Gross profit as a percent of revenue increased to 27.8% for the year ended September 30, 2021 compared to 27.3% for the year ended September 30, 2020, largely as the result of those efficiencies, as management has continued to focus on procurement, engineering, and quality.\nSelling, General and Administrative Expenses. Our Infrastructure Solutions segments selling, general and administrative expenses during the year ended September 30, 2021, increased $3.5 million compared to the year ended September 30, 2020. The increase in fiscal 2021 includes $1.6 million of expenses incurred, including amortization of intangible assets, at our acquired Wedlake business. The selling, general and administrative expenses as a percentage of revenue increased from 15.9% for the year ended September 30, 2020, to 16.3% for the year ended September 30, 2021, primarily as a result of the increase in expenses, including amortization expense, related to Wedlake.\nCommercial & Industrial\n2022 Compared to 2021\nYear Ended September 30,\n2022 2021\n$ % $ %\n(Dollars in thousands, Percentage of revenues)\nRevenue $ 308,504 100.0 % $ 256,198 100.0 %\nCost of services 290,314 94.1 % 227,704 88.9 %\nGross Profit 18,190 5.9 % 28,494 11.1 %\nSelling, general and administrative expenses 30,557 9.9 % 28,172 11.0 %\nGain on sale of assets (55) - % (92) - %\nOperating Income (12,312) (4.0) % 414 0.2 %\nRevenue. Revenues in our Commercial & Industrial segment increased $52.3 million, or 20.4%, during the year ended September 30, 2022, compared to the year ended September 30, 2021. During the year ended September 30, 2022, we benefited from the start-up of projects that were delayed in fiscal 2021. While activity in this segment was curtailed earlier in the COVID-19 pandemic, many customers have returned to more typical levels of activity. However, this market remains highly competitive.\nGross Profit. Our Commercial & Industrial segments gross profit during the year ended September 30, 2022 decreased by $10.3 million, or 36.2%, as compared to the year ended September 30, 2021. During the year ended September 30, 2022, one of our Commercial & Industrial branches experienced execution issues on a large contract, resulting in significant project rework. As a result, we incurred additional expense related to this project including the accrual of estimated costs to complete the project, including demolition, purchase of replacement materials, and performance of the rework. Additionally, a second job at that same branch was affected by costs associated with a delay in receiving materials from a supplier. These two projects collectively impacted gross profit for the year ended September 30, 2022 by $16.7 million. As a result, gross profit as a percentage of revenue decreased from 11.1% for the year ended September 30, 2021, to 5.9% for the year ended September 30, 2022.\nSelling, General and Administrative Expenses. Our Commercial & Industrial segments selling, general and administrative expenses during the year ended September 30, 2022 increased $2.4 million, or 8.5%, compared to the year ended September 30, 2021. The increase was driven primarily by higher pay rates in an increasingly competitive labor market, as well as $2.3 million of reserves in connection with legal matters related to certain contractual disputes. Selling, general and administrative expenses as a percentage of revenue decreased from 11.0% for the year ended September 30, 2021 to 9.9% for the year ended September 30, 2022.\n2021 Compared to 2020\nYear Ended September 30,\n2021 2020\n$ % $ %\n(Dollars in thousands, Percentage of revenues)\nRevenues $ 256,198 100.0 % $ 255,546 100.0 %\nCost of services 227,704 88.9 % 234,492 91.8 %\nGross Profit 28,494 11.1 % 21,054 8.2 %\nSelling, general and administrative expenses 28,172 11.0 % 32,128 12.6 %\nGoodwill impairment expense - - % 6,976 2.7 %\nContingent consideration - - % (11) - %\nGain on sale of assets (92) - % (45) - %\nOperating Income (Loss) 414 0.2 % (17,994) (7.0) %\nRevenue. Revenues in our Commercial & Industrial segment increased $0.7 million, or 0.3%, during the year ended September 30, 2021, compared to the year ended September 30, 2020. The market for our Commercial & Industrial segment's services remains highly competitive, and disruptions caused by the COVID-19 pandemic resulted in some delays in the awarding of new projects and the progress of certain existing projects, as well as decreased demand for new construction in certain sectors we serve, particularly through the first six months of fiscal 2021.\nGross Profit. Our Commercial & Industrial segments gross profit during the year ended September 30, 2021 increased by $7.4 million, or 35.3%, as compared to the year ended September 30, 2020. We have improved project efficiency, enhanced our procurement process, and focused on controlling costs. As a result, gross profit as a percent of revenues increased from 8.2% for the year ended September 30, 2020, to 11.1% for the year ended September 30, 2021.\nSelling, General and Administrative Expenses. Our Commercial & Industrial segments selling, general and administrative expenses during the year ended September 30, 2021 decreased $4.0 million, or 12.3%, compared to the year ended September 30, 2020. The higher expense in fiscal 2020 primarily reflected a write-off recorded in 2020 related to a commercial dispute, as well as costs incurred in 2020 to improve our procurement process. Selling, general and administrative expenses as a percentage of revenue decreased from 12.6% for the year ended September 30, 2020 to 11.0% for the year ended September 30, 2021.\nINTEREST AND OTHER EXPENSE, NET\nYear Ended September 30,\n2022 2021 2020\n(In thousands)\nInterest expense $ 2,771 $ 764 $ 625\nDeferred financing charges 199 198 152\nTotal interest expense 2,970 962 777\nOther (income) expense, net 37 (286) 12\nTotal interest and other expense, net 3,007 676 789\nDuring the year ended September 30, 2022, we incurred interest expense of $3.0 million primarily comprised of interest expense from our revolving credit facility and fees on an average letter of credit balance of $4.5 million under our revolving credit facility and an average unused line of credit balance of $49.2 million. This compares to interest expense of $1.0 million for the year ended September 30, 2021 primarily comprised of interest expense from our revolving credit facility and fees on an average letter of credit balance of $5.7 million under our revolving credit facility and an average unused line of credit balance of $77.4 million.\nDuring the year ended September 30, 2020, we incurred interest expense of $0.8 million primarily comprised of interest expense from our revolving credit facility and fees on an average letter of credit balance of $6.9 million under our revolving credit facility and an average unused line of credit balance of $89.6 million.\nPROVISION FOR INCOME TAXES\nFor the year ended September 30, 2022, we recorded income tax expense of $12.8 million, which reflects a $0.8 million benefit related to the recognition of previously unrecognized tax benefits.\nFor the year ended September 30, 2021, we recorded income tax expense of $16.2 million, which reflects a $5.1 million benefit related to the recognition of previously unrecognized tax benefits.\nFor the year ended September 30, 2020, we recorded income tax expense of $8.7 million, which reflects a $3.2 million benefit related to the recognition of previously unrecognized tax benefits as well as a $3.3 million benefit related to the release of valuation allowance on certain state net operating loss carryforwards.\nWORKING CAPITAL\nDuring the year ended September 30, 2022, working capital exclusive of cash increased by $48.2 million from September 30, 2021, reflecting a $138.5 million increase in current assets excluding cash and a $90.3 million increase in current liabilities during the period.\nDuring the year ended September 30, 2022, our current assets exclusive of cash increased to $599.6 million, as compared to $461.1 million as of September 30, 2021. An increase in business activity drove an $84.0 million increase in trade accounts receivable. Days sales outstanding increased to 58 at September 30, 2022 from 57 at September 30, 2021. While the rate of collections may vary, our typically secured position, resulting from our ability in general to secure liens against our customers overdue receivables, offers some protection that collection will occur eventually to the extent that our security retains value. Retainage increased by $23.7 million as a result of growth in the Residential multi-family business, as well as the timing of projects in the Commercial & Industrial business. Additionally, inventory increased by $27.8 million in connection with rising commodity prices as well as growth of our business. Further, we have increased the quantity of inventory we are currently carrying to manage procurement risks. Costs and estimated earnings in excess of billings increased by $8.7 million as a result of increased levels of activity at our Communications business, as well as supply chain disruptions in our Infrastructure Solutions business.\nDuring the year ended September 30, 2022, our total current liabilities increased by $90.3 million to $401.9 million, compared to $311.6 million as of September 30, 2021, driven by increased levels of business activity, offset in part by remittance of payroll taxes deferred under the Coronavirus Aid, Relief and Economic Security Act (the \"CARES Act\").\nSurety\nMany customers, particularly in connection with new construction, require us to post performance and payment bonds issued by a surety. These bonds provide a guarantee to the customer that we will perform under the terms of our contract and that we will pay our subcontractors and vendors. If we fail to perform under the terms of our contract or to pay subcontractors and vendors, the customer may demand that the surety make payments or provide services under the bond. We must reimburse the sureties for any expenses or outlays they incur on our behalf. To date, we have not been required to make any reimbursements to our sureties for bond-related costs.\nAs is common in the surety industry, sureties issue bonds on a project-by-project basis and can decline to issue bonds at any time. We believe that our relationships with our sureties will allow us to provide surety bonds as they are required. However, current market conditions, as well as changes in our sureties' assessment of our operating and financial risk, could cause our sureties to decline to issue bonds for our work. If our sureties decline to issue bonds for our work, our alternatives would include posting other forms of collateral for project performance, such as letters of credit or cash, seeking bonding capacity from other sureties, or engaging in more projects that do not require surety bonds. In addition, if we are awarded a project for which a surety bond is required but we are unable to obtain a surety bond, the result could be a claim for damages by the customer for the costs of replacing us with another contractor.\nWe believe the bonding capacity currently provided by our sureties is adequate for our current operations and will be adequate for our operations for the foreseeable future. As of September 30, 2022, the estimated cost to complete our bonded projects was approximately $107.6 million.\nLIQUIDITY AND CAPITAL RESOURCES\nAs of September 30, 2022, we had cash and cash equivalents of $24.8 million and $63.3 million of availability under our revolving credit facility. We anticipate that the combination of cash on hand, cash flows from operations and available capacity under our revolving credit facility will provide sufficient cash to enable us to meet our working capital needs, debt service requirements and capital expenditures for property and equipment through the next twelve months. Our ability to generate cash flow is dependent on many factors, including demand for our services, the availability of projects at margins acceptable to us, the ultimate collectability of our receivables, and our ability to borrow on our revolving credit facility or raise funds in the capital markets, if needed.\nThe Revolving Credit Facility\nOn April 28, 2022, we entered into a Third Amended and Restated Credit and Security Agreement (the \"Amended Credit Agreement\"), which increased our maximum borrowing amount from $125 million to $150 million. The Amended Credit Agreement also removed the aggregate cap on our investments in certain securities and the cap on our ability to make stock repurchases, in each case subject to the satisfaction of certain liquidity requirements. All other customary affirmative, negative and financial covenants and events of default were unchanged by the amendment.\nBorrowings under the Amended Credit Agreement may not exceed a \"Borrowing Base, as defined in the Amended Credit Agreement, determined monthly based on available collateral, primarily certain accounts receivables, inventories, and equipment. Amounts outstanding bear interest at a per annum rate equal to the Daily Three Month Secured Overnight Financing Rate (\"SOFR\"), plus an interest rate margin, which is determined quarterly, based on the following thresholds:\nLevel Thresholds\nInterest Rate Margin\nI If Liquidity is less than 35% of the Maximum Revolver Amount (each as defined in the Amended Credit Agreement) at any time during the period 2.00 percentage points\nII If Liquidity is greater than or equal to 35% of the Maximum Revolver Amount at all times during the period and less than 50% of the Maximum Revolver Amount at any time during the period 1.75 percentage points\nIII If Liquidity is greater than or equal to 50% of the Maximum Revolver Amount at all times during the period 1.50 percentage points\nIn addition, we are charged monthly in arrears for (1) an unused commitment fee of 0.25% per annum, (2) a collateral monitoring fee of $5 thousand per quarter, (3) a letter of credit fee based on the then-applicable interest rate margin (4) appraisal fees, costs and expenses and (5) certain other fees and charges as specified in the Amended Credit Agreement.\nAs of September 30, 2022, we were in compliance with the financial covenants under the Amended Credit Agreement, requiring that we maintain:\na Fixed Charge Coverage Ratio (as defined in the Amended Credit Agreement), measured quarterly on a trailing\nfour-quarter basis at the end of each quarter, of at least 1.1 to 1.0; and\nminimum Liquidity of at least 10% of the Maximum Revolver Amount, or $15.0 million; with, for purposes of this covenant, at least 50% of our Liquidity comprised of Excess Availability (as defined in the Amended Credit Agreement).\nAt September 30, 2022, our Liquidity was $88.1 million, our Excess Availability was $63.3 million (or greater than 50% of minimum Liquidity), and our Fixed Charge Coverage Ratio was 1.6:1.0.\nOur Fixed Charge Coverage Ratio is calculated as follows (with capitalized terms as defined in the Amended Credit Agreement): (i) our trailing twelve month EBITDA, less Non-Financed Capital Expenditures (other than capital expenditures financed by means of an advance under the credit facility), cash taxes and all Restricted Junior Payments consisting of certain Pass-Through Tax Liabilities, divided by (ii) the sum of our cash interest (other than interest paid-in-kind, amortization of financing fees, and other non-cash interest expense) and principal debt payments (other than repayment of principal on advances under the credit facility and including cash payments with respect to capital leases), any management, consulting, monitoring, and advisory fees paid to an affiliate, and all Restricted Junior Payments (other than Pass-Through Tax Liabilities) and other cash distributions; provided, that if we make an acquisition consented to by our lenders, the components of the Fixed Charge Coverage Ratio will be calculated for such fiscal period after giving pro forma effect to the acquisition assuming that such transaction has occurred on the first day of such period (including pro forma adjustments arising out of events which are directly attributable to such acquisition, are factually supportable, and are expected to have a continuing impact, in each case to be reasonably agreed to by our lenders).\nAs defined in the Amended Credit Agreement, EBITDA is calculated as consolidated net income (or loss), less extraordinary gains, interest income, non-operating income and income tax benefits and decreases in any change in LIFO reserves, plus stock compensation expense, non-cash extraordinary losses (including, but not limited to, a non-cash impairment charge or write-down), Interest Expense, income taxes, depreciation and amortization, and increases in any change in LIFO reserves for such period, determined on a consolidated basis in accordance with GAAP.\nIf in the future our Liquidity falls below $15.0 million (or Excess Availability falls below 50% of our minimum Liquidity), our Fixed Charge Coverage Ratio is less than 1.1:1.0, or if we otherwise fail to perform or otherwise comply with certain of our covenants or other agreements under the Amended Credit Agreement, it would result in an event of default under the Amended Credit Agreement, which could result in some or all of our then-outstanding indebtedness becoming immediately due and payable.\nAt September 30, 2022, we had $4.1 million in outstanding letters of credit and $82.7 million of outstanding borrowings under our revolving credit facility.\nInvestments\nFrom time to time, the Company invests in non-controlling positions in the debt or equity securities of other businesses. Our Board of Directors has approved an investment policy that permits the Company to invest our cash in liquid and marketable securities that include equities and fixed income securities, subject to size limits on investments individually and in the aggregate. Equity securities may include unrestricted, publicly traded stock that is listed on a major exchange or a national, over-the-counter market and that is appropriate for our portfolio objectives, and fixed income securities are required to have an investment grade credit quality at the time of purchase.\nOperating Activities\nOur cash flow from operations is not only influenced by cyclicality, demand for our services, operating margins and the type of services we provide, but can also be influenced by working capital needs such as the timing of our receivable collections. Working capital needs are generally lower during our fiscal first and second quarters due to the seasonality that we experience in many regions of the country; however, a seasonal decline in working capital may be offset by needs associated with higher growth or acquisitions. Currently, our working capital needs are higher than they have been historically, as a result of growth of our business, elevated commodity prices,and the steps taken to mitigate the impact of supply chain disruptions.\nOperating activities provided net cash of $16.3 million during the year ended September 30, 2022, as compared to $37.9 million of net cash provided in the year ended September 30, 2021. The decrease in operating cash flow resulted from lower earnings and an increase in working capital, particularly due to increased trade accounts receivable and inventory during the year ended September 30, 2022 in support of the growth of the business. We also remitted $7.0 million of payroll taxes previously deferred under the CARES Act.\nOperating activities provided net cash of $37.9 million during the year ended September 30, 2021, as compared to $76.7 million of net cash provided in the year ended September 30, 2020. The decrease in operating cash flow resulted from an increase in working capital, particularly related to inventory. As commodity prices increased, we also experienced longer lead times for deliveries, and reduced availability for certain products we procure, particularly copper wire. As a result, we increased the amount of inventory carried in an effort to ensure the availability of materials to serve our customers. This increase in working capital was partly offset by higher earnings during the year ended September 30, 2021.\nInvesting Activities\nNet cash used in investing activities was $29.5 million for the year ended September 30, 2022, compared to $99.6 million of net cash used in investing activities in the year ended September 30, 2021. We used $29.3 million for capital expenditures in the year ended September 30, 2022, primarily related to the acquisition of a new operating facility for our Wedlake business, as well as an additional facility to support the growth of our Residential business in Florida. Investing activities for the year ended September 30, 2021 include $7.4 million of capital expenditures and $92.5 million for the acquisition of businesses.\nIn the year ended September 30, 2021, net cash used in investing activities was $99.6 million, as compared to $33.6 million of net cash used in investing activities in the year ended September 30, 2020. Investing activities for the year ended September 30, 2021 include $7.4 million of capital expenditures and $92.5 million for the acquisition of businesses. Investing activities for the year ended September 30, 2020 include $4.7 million of capital expenditures and $29.0 million for the acquisition of businesses.\nFinancing Activities\nNet cash provided by financing activities was $15.0 million in the year ended September 30, 2022, compared to $31.2 million in the year ended September 30, 2021. Net cash provided by financing activities for the year ended September 30, 2022 included net borrowing on our credit facility of $42.3 million, partly offset by $18.6 million used for repurchase of our common stock, including repurchases to satisfy statutory withholding requirements upon the vesting of employee stock compensation. Additionally, we distributed $7.0 million to noncontrolling interests under operating agreements in connection with certain acquisitions.\nNet cash provided by financing activities was $31.2 million in the year ended September 30, 2021, compared to $8.5 million used in the year ended September 30, 2020. For the year ended September 30, 2021, we borrowed a net $40.0 million on our revolving credit facility. In addition, we used $7.0 million to repurchase our shares under our stock repurchase program, as well as to satisfy statutory withholding requirements upon the vesting of employee stock compensation.\nCONTROLLING SHAREHOLDER\nTontine Associates, L.L.C. (\"Tontine Associates\"), together with its affiliates (collectively, \"Tontine\") is the Company's controlling stockholder, owning approximately 57 percent of the Companys outstanding common stock based on the Form 4 filed by Tontine with the SEC on December 3, 2021 and the Company's shares outstanding as of December 2, 2022. Accordingly, Tontine has the ability to exercise significant control over our affairs, including the election of directors and most actions requiring the approval of shareholders.\nWe are a party to a sublease agreement with Tontine Associates for corporate office space in Greenwich, Connecticut. The sublease extends through February 27, 2023, with monthly payments due in the amount of approximately $8 thousand. The lease has terms at market rates, and payments by the Company are at a rate consistent with that paid by Tontine Associates to its landlord.\nOn December 6, 2018, the Company entered into a Board Observer Letter Agreement (the \"Observer Agreement\") with Tontine Associates in order to assist Tontine in managing its investment in the Company. Subject to the terms and conditions set forth in the Observer Agreement, the Company granted Tontine the right, at any time that Tontine holds at least 20% of the outstanding common stock of the Company, to appoint a representative to serve as an observer to the Board (the Board Observer). The Board Observer, who shall serve at the discretion of and must be reasonably acceptable to those members of the Board who are not affiliates of Tontine, shall have no voting rights or other decision making authority. Subject to the terms and conditions set forth in the Observer Agreement, so long as Tontine has the right to appoint a Board Observer, the Board Observer will have the right to attend and participate in meetings of the Board and the committees thereof, subject to confidentiality requirements, and to receive reimbursement for reasonable out-of-pocket expenses incurred in his or her capacity as a Board Observer and such rights to coverage under the Companys directors and officers liability insurance policy as are available to directors.\nJeffrey L. Gendell was appointed Chief Executive Officer of the Company effective October 1, 2020, having served as the Company's Interim Chief Executive Officer since July 31, 2020. Mr. Gendell also serves as Chairman of the Board of Directors, a position he has held since November 2016. He is the managing member and founder of Tontine, and the brother of David B. Gendell, who has served as a member of our Board of Directors since February 2012, and who previously served as Interim Director of Operations from November 2017 to January 2019, as Vice Chairman of the Board from November 2016 to November 2017 and as Chairman of the Board from January 2015 to November 2016. David B. Gendell was an employee of Tontine from 2004 until January 2018.\nOFF-BALANCE SHEET ARRANGEMENTS AND CONTRACTUAL OBLIGATIONS\nAs is common in our industry, we have entered into certain off-balance sheet arrangements that expose us to increased risk. Our significant off-balance sheet transactions include letter of credit obligations, firm commitments for materials and surety guarantees.\nSome of our customers and vendors may require us to post letters of credit as a means of guaranteeing performance under our contracts and ensuring payment by us to subcontractors and vendors. If our customer has reasonable cause to effect payment under a letter of credit, we would be required to reimburse our creditor for the letter of credit.\nSome of the underwriters of our casualty insurance program require us to post letters of credit as collateral, as is common in the insurance industry. To date, we have not had a situation where an underwriter has had reasonable cause to effect payment under a letter of credit. At September 30, 2022, $3.9 million of our outstanding letters of credit were to collateralize our insurance programs.\nFrom time to time, we may enter into firm purchase commitments for materials such as copper wire and aluminum wire, which we expect to use in the ordinary course of business. These commitments are typically for terms of less than one year and require us to buy minimum quantities of materials at specified intervals at a fixed price over the term. As of September 30, 2022, we had commitments of $9.7 million outstanding under such agreements to purchase copper wire and other materials over the next 12 months in the ordinary course of business.\nMany of our customers require us to post performance and payment bonds issued by a surety. Those bonds guarantee the customer that we will perform under the terms of a contract and that we will pay subcontractors and vendors. In the event that we fail to perform under a contract or pay subcontractors and vendors, the customer may demand the surety to pay or perform under our bond. Our relationship with our sureties is such that we will indemnify the sureties for any expenses they incur in connection with any of the bonds they issue on our behalf and may be required to post collateral to support the bonds. To date, we have not incurred any material costs to indemnify our sureties for expenses they incurred on our behalf.\nCRITICAL ACCOUNTING POLICIES\nThe discussion and analysis of our financial condition and results of operations are based on our Consolidated Financial Statements, which have been prepared in accordance with GAAP. The preparation of our Consolidated Financial Statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities known to exist as of the date the Consolidated Financial Statements, and the reported amounts of revenues and expenses recognized during the periods presented. We review all significant estimates affecting our Consolidated Financial Statements on a recurring basis and record the effect of any necessary adjustments prior to their publication. Judgments and estimates are based on our beliefs and assumptions derived from information available at the time such judgments and estimates are made. Uncertainties with respect to such estimates and assumptions are inherent in the preparation of financial statements. There can be no assurance that actual results will not differ from those estimates.\nAccordingly, we have identified the accounting principles which we believe are most critical to our reported financial status by considering accounting policies that involve the most complex or subjective decisions or assessments. We identified our most critical accounting policies to be those related to revenue recognition, accounting for business combinations, the assessment of goodwill and asset impairment, our allowance for credit losses, the recording of our insurance liabilities and estimation of the valuation allowance for deferred tax assets, and unrecognized tax benefits. These accounting policies, as well as others, are described in Note 2, Summary of Significant Accounting Policies in the notes to our Consolidated Financial Statements and at relevant sections in this discussion and analysis.\nRevenue Recognition. We enter into contracts principally on the basis of competitive bids. We frequently negotiate the final terms and prices of those contracts with the customer. Although the terms of our contracts vary considerably, approximately 90% of our revenues are based on either a fixed price or unit price basis in which we agree to do the work for a fixed amount for the entire project (fixed price) or for units of work performed (unit price). Approximately 10% of our revenues are earned from contracts where we are paid on a time and materials basis. Our most significant cost drivers are the cost of labor and materials. These costs may vary from the costs we originally estimated. Variations from estimated contract costs along with other risks inherent in performing fixed price and unit price contracts may result in actual revenue and gross profits or interim projected revenue and gross profits for a project differing from those we originally estimated and could result in losses on projects. Depending on the size of a particular project, variations from estimated project costs could have a significant impact on our operating results for any fiscal quarter or year.\nWe complete most of our projects within one year. We frequently provide service and maintenance work under open-ended, unit price master service agreements which are renewable annually. We recognize revenue on service, time and material work when services are performed. Work performed under a construction contract generally provides that the customers accept completion of progress to date and compensate us for services rendered, measured in terms of units installed, hours expended or some other measure of progress. Revenues from construction contracts are recognized on the percentage-of-completion method. Revenues recognized on a percentage-of-completion basis, all of which are fixed price or cost plus arrangements, comprised approximately 49% of our total revenue for the year ended September 30, 2022. The percentage-of-completion method for construction contracts is measured principally by the percentage of costs incurred and accrued to date for each contract to the estimated total costs for each contract at completion. We generally consider contracts substantially complete upon departure from the work site and acceptance by the customer. Contract costs include all direct material and labor costs and those indirect costs related to contract performance, such as indirect labor, supplies, tools, repairs and depreciation costs. Changes in job performance, job conditions, estimated contract costs, profitability and final contract settlements may result in revisions to costs and income, and the effects of such revisions are recognized in the period in which the revisions are determined. Provisions for total estimated losses on uncompleted contracts are made in the period in which such losses are determined.\nWe generally do not incur significant costs related to obtaining contracts, or initial set-up or mobilization costs, prior to the start of a project. When significant pre-contract costs are incurred, they will be capitalized and amortized on a percentage of completion basis over the life of the contract.\nThe current asset Costs and estimated earnings in excess of billings represents revenues recognized in excess of amounts billed that management believes will be billed and collected within the next twelve months. The current liability Billings in excess of costs and estimated earnings represents billings in excess of revenues recognized. Costs and estimated earnings in excess of billings are amounts considered recoverable from customers based on different measures of performance, including achievement of specific milestones, completion of specified units or completion of the contract. Also included in this asset, from time to time, are claims and unapproved change orders, which include amounts that we are in the process of collecting from our customers or agencies for changes in contract specifications or design, contract change orders in dispute or unapproved as to scope and price, or other related causes of unanticipated additional contract costs. Claims and unapproved change orders are recorded at estimated realizable value when collection is probable and can be reasonably estimated. We do not recognize profits on construction costs incurred in connection with claims. Claims made by us involve negotiation and, in certain cases, litigation. Such litigation costs are expensed as incurred.\nBusiness Combinations. In accounting for business combinations, certain assumptions and estimates are employed in determining the fair value of assets acquired, evaluating the fair value of liabilities assumed, as well as in determining the allocation of goodwill to the appropriate reporting unit. These estimates may be affected by factors such as changing market conditions affecting the industries in which we operate. The most significant assumptions requiring judgment involve identifying and estimating the fair value of intangible assets and the associated useful lives for establishing amortization periods. To finalize purchase accounting for significant intangible assets and liabilities, we utilize the services of independent valuation specialists to assist in the determination of the fair value.\nValuation Allowance for Deferred Tax Assets. We regularly evaluate valuation allowances established for deferred tax assets for which future realization is uncertain. We perform this evaluation quarterly. The estimation of required valuation allowances includes estimates of future taxable income. In assessing the realizability of deferred tax assets at September 30, 2022, we concluded, based upon the assessment of positive and negative evidence, that it is more likely than not that the Company will generate sufficient taxable income within the applicable NOL carryforward periods to realize its $20.5 million of deferred tax assets. We considered the scheduled reversal of deferred tax liabilities, projected future taxable income and tax planning strategies in making this assessment.\nAn inability to generate sufficient taxable income in future periods to realize our deferred tax assets may lead to a future need for a valuation allowance and a corresponding reduction in GAAP net income. In addition, any reduction in the federal statutory tax rate in the future could also cause a reduction in the economic benefit of the NOL available to us and a corresponding charge to reduce the book value of the deferred tax asset recorded on our Consolidated Balance Sheets.\nIncome Taxes. GAAP specifies the methodology by which a company must identify, recognize, measure and disclose in its financial statements the effects of any uncertain tax return reporting positions that it has taken or expects to take. GAAP requires financial statement reporting of the expected future tax consequences of uncertain tax return reporting positions on the presumption that all relevant tax authorities possess full knowledge of those tax reporting positions, as well as all of the pertinent facts and circumstances, but it prohibits discounting of any of the related tax effects for the time value of money.\nThe evaluation of a tax position is a two-step process. The first step is the recognition process to determine if it is more likely than not that a tax position will be sustained upon examination by the appropriate taxing authority, based on the technical merits of the position. The second step is a measurement process whereby a tax position that meets the more likely than not recognition threshold is calculated to determine the amount of benefit/expense to recognize in the financial statements. The tax position is measured at the largest amount of benefit/expense that is more likely than not of being realized upon ultimate settlement.\nThe tax years ended September 30, 2019 and forward are subject to federal audit as are prior tax years, to the extent of unutilized net operating losses generated in those years.\nWe anticipate that approximately $0.2 million in liabilities for unrecognized tax benefits, including accrued interest, may be reversed in the next twelve months. This reversal is predominantly due to the expiration of the statutes of limitation for unrecognized tax benefits.\nNew Accounting Pronouncements. Recent accounting pronouncements are described in Note 2, Summary of Significant Accounting Policies - New Accounting Pronouncements in the notes to our Consolidated Financial Statements and at relevant sections in this discussion and analysis. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nManagement is actively involved in monitoring exposure to market risk and continues to develop and utilize appropriate risk management techniques. Our exposure to significant market risks includes fluctuations in labor costs and commodity prices for copper, aluminum, steel and fuel. Commodity price risks may have an impact on our results of operations due to the fixed price nature of many of our contracts. We are also exposed to interest rate risk with respect to our outstanding debt obligations on our credit facility. For additional information see Risk Factors in Item 1A of this Annual Report on Form 10-K.\nCommodity Risk\nOur exposure to significant market risks includes fluctuations in commodity prices including, but not limited to, copper, aluminum, steel, electrical components, fuel, and certain plastics. Commodity price risks may have an impact on our results of operations due to the fixed nature of many of our contracts. Over the long-term, we expect to be able to pass along a portion of these costs to our customers, as market conditions in the construction industry will allow.\nInterest Rate Risk\nFloating rate debt, where the interest rate fluctuates periodically, exposes us to short-term changes in market interest rates. All of the long-term debt outstanding under our revolving credit facility is structured on floating rate terms. We currently do not maintain any hedging contracts that would limit our exposure to variable rates of interest when we have outstanding borrowings under our revolving credit facility. The Amended Credit Agreement uses SOFR as the benchmark for establishing the interest rate charged on our borrowings. If SOFR were to increase, our interest payment obligations on any then-outstanding borrowings would increase, having a negative effect on our cash flow and financial condition. A one percentage point increase in the interest rate on our long-term debt outstanding under the credit facility of $82.7 million as of September 30, 2022 would cause a $0.8 million pre-tax annual increase in interest expense. Item 8. Financial Statements and Supplementary Data\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReports of Independent Registered Public Accounting Firm (PCAOB ID 42)\nConsolidated Balance Sheets\nConsolidated Statements of Comprehensive Income (Loss)\nConsolidated Statements of Stockholders' Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of IES Holdings, Inc. and subsidiaries\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of IES Holdings, Inc. and subsidiaries (the Company) as of September 30, 2022 and 2021, the related consolidated statements of comprehensive income (loss), stockholders' equity and cash flows for each of the three years in the period ended September 30, 2022, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2022, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated December 6, 2022 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue recognition under certain fixed-price contracts\nDescription of the Matter As described in Notes 2 and 4 to the consolidated financial statements, the Company generally recognizes revenue for fixed price contracts over time using costs incurred as a percentage of the estimated total costs at completion to determine the extent of progress of performance obligations. Revenue recognition under this method is subject to judgment as the determination of progress towards completion requires management to prepare estimates of the total project costs to complete.\nAuditing managements estimate of the progress towards completion for certain projects which are larger in size and longer in duration was complex and subjective, requiring considerable judgment to evaluate managements determination of the forecasted costs to complete, specifically as it relates to labor productivity.\nHow We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company's cost estimating process, including controls over management's review of cost estimates for significant inputs such as labor.\nOur audit procedures included, among others, evaluating the appropriate application of the Company's revenue recognition method; testing significant assumptions used to develop the estimated costs to complete; and testing the completeness and accuracy of the underlying data. To assess the reasonableness of management's estimated costs, we performed audit procedures that included, among others, agreeing the estimates to supporting documentation; conducting interviews with project personnel or attending select project review meetings; and performing sensitivity analyses or retrospective review using historical actual costs and trends.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2002\nHouston, Texas\nDecember 6, 2022\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of IES Holdings, Inc. and subsidiaries\nOpinion on Internal Control Over Financial Reporting\nWe have audited IES Holdings, Inc. and subsidiaries internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, IES Holdings, Inc. and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of September 30, 2022, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 30, 2022 and 2021, the related consolidated statements of comprehensive income (loss), stockholders equity and cash flows for each of the three years in the period ended September 30, 2022, and the related notes and our report dated December 6, 2022 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nHouston, Texas\nDecember 6, 2022\nIES HOLDINGS, INC. AND SUBSIDIARIES\nConsolidated Balance Sheets\n(In Thousands, Except Share Information)\nSeptember 30,\n2022 2021\nASSETS\nCURRENT ASSETS:\nCash and cash equivalents $ 24,848 $ 23,105\nAccounts receivable:\nTrade, net of allowance 370,726 286,707\nRetainage 65,065 41,341\nInventories 96,333 68,573\nCosts and estimated earnings in excess of billings 52,076 43,389\nPrepaid expenses and other current assets 15,350 21,065\nTotal current assets 624,398 484,180\nProperty and equipment, net 54,426 35,454\nGoodwill 92,395 92,395\nIntangible assets, net 71,936 85,619\nDeferred tax assets 20,519 19,009\nOperating right of use assets 55,890 42,916\nOther non-current assets 15,145 7,049\nTotal assets $ 934,709 $ 766,622\nLIABILITIES AND STOCKHOLDERS EQUITY\nCURRENT LIABILITIES:\nAccounts payable and accrued expenses 316,950 249,114\nBillings in excess of costs and estimated earnings 84,936 62,486\nTotal current liabilities 401,886 311,600\nLong-term debt 81,628 39,746\nOperating long-term lease liabilities 38,144 28,649\nOther non-current liabilities 22,570 16,080\nTotal liabilities 544,228 396,075\nNoncontrolling interest 29,193 24,594\nSTOCKHOLDERS EQUITY:\nPreferred stock, $0.01 par value, 10,000,000 shares authorized, none issued\nand outstanding - -\nCommon stock, $0.01 par value, 100,000,000 shares authorized; 22,049,529\nissued and 20,341,900 and 20,762,395 outstanding, respectively\n220 220\nTreasury stock, at cost, 1,707,629 and 1,287,134 shares, respectively\n(44,000) (29,300)\nAdditional paid-in capital 201,871 201,899\nRetained earnings 203,197 173,134\nTotal stockholders equity 361,288 345,953\nTotal liabilities and stockholders equity $ 934,709 $ 766,622\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nIES HOLDINGS, INC. AND SUBSIDIARIES\nConsolidated Statements of Comprehensive Income (Loss)\n(In Thousands, Except Share Information)\nYear Ended September 30,\n2022 2021 2020\nRevenues $ 2,166,808 $ 1,536,493 $ 1,190,856\nCost of services 1,847,878 1,248,495 962,897\nGross profit 318,930 287,998 227,959\nSelling, general and administrative expenses 262,714 202,251 170,911\nGoodwill impairment expense - - 6,976\nContingent consideration 277 211 (11)\nGain on sale of assets (69) (47) -\nOperating income 56,008 85,583 50,083\nInterest and other (income) expense:\nInterest expense 2,970 962 777\nOther (income) expense, net 37 (286) 12\nIncome from operations before income taxes 53,001 84,907 49,294\nProvision for income taxes 12,815 16,231 8,740\nNet income 40,186 68,676 40,554\nNet (income) loss attributable to noncontrolling interest (5,424) (2,018) 1,045\nComprehensive income attributable to IES Holdings, Inc. $ 34,762 $ 66,658 $ 41,599\nEarnings per share attributable to common stockholders of IES Holdings, Inc.:\nBasic $ 1.45 $ 3.19 $ 1.96\nDiluted $ 1.44 $ 3.15 $ 1.94\nShares used in the computation of earnings per share:\nBasic 20,667,745 20,790,307 20,795,892\nDiluted 20,894,625 21,086,432 21,092,410\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nIES HOLDINGS, INC. AND SUBSIDIARIES\nConsolidated Statements of Stockholders Equity\n(In Thousands, Except Share Information)\nCommon Stock Treasury Stock Additional Paid-In Capital Retained Earnings Total Stockholders' Equity\nShares Amount Shares Amount\nBALANCE, September 30, 2019 22,049,529 $ 220 (884,518) $ (12,483) $ 192,911 $ 65,600 $ 246,248\nIssuance of share-based compensation - - 120,197 1,708 (1,708) - -\nAcquisition of treasury stock - - (528,563) (13,808) 6,111 - (7,697)\nOptions exercised - - 5,750 84 (50) - 34\nNon-cash compensation - - - - 3,323 - 3,323\nIncrease in noncontrolling interest - - - - - (194) (194)\nNet income attributable to IES Holdings, Inc. - - - - - 41,599 41,599\nBALANCE, September 30, 2020 22,049,529 $ 220 (1,287,134) $ (24,499) $ 200,587 $ 107,005 $ 283,313\nIssuance of share-based compensation - - 140,660 2,737 (2,737) - -\nAcquisition of treasury stock - - (170,524) (7,538) 527 - (7,011)\nOptions exercised - - - - - - -\nNon-cash compensation - - - - 3,522 - 3,522\nIncrease in noncontrolling interest - - - - - (315) (315)\nCumulative effect adjustment from adoption of new accounting standard - - - - - (214) (214)\nNet income attributable to IES Holdings, Inc. - - - - - 66,658 66,658\nBALANCE, September 30, 2021 22,049,529 $ 220 (1,316,998) $ (29,300) $ 201,899 $ 173,134 $ 345,953\nIssuance of share-based compensation - - 157,167 3,638 (3,638) - -\nAcquisition of treasury stock - - (556,798) (18,556) - - (18,556)\nOptions exercised - - 9,000 218 (165) - 53\nNon-cash compensation - - - - 3,775 - 3,775\nIncrease in noncontrolling interest - - - - - (4,699) (4,699)\nNet income attributable to IES Holdings, Inc. - - - - - 34,762 34,762\nBALANCE, September 30, 2022 22,049,529 $ 220 (1,707,629) $ (44,000) $ 201,871 $ 203,197 $ 361,288\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nIES HOLDINGS, INC. AND SUBSIDIARIES\nConsolidated Statements of Cash Flows\n(In Thousands)\nYear Ended September 30,\n2022 2021 2020\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income $ 40,186 $ 68,676 $ 40,554\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nBad debt expense 3,141 1,216 1,864\nDeferred financing cost amortization 199 198 152\nDepreciation and amortization 25,468 21,914 12,508\nGain on sale of assets (69) (47) -\nNon-cash compensation expense 3,775 3,522 3,323\nGoodwill impairment expense - - 6,976\nDeferred income tax expense (benefit) (31) 11,724 5,122\nChanges in operating assets and liabilities\nAccounts receivable (87,160) (55,371) (25,389)\nInventories (27,760) (30,517) (2,822)\nCosts and estimated earnings in excess of billings (8,688) (13,451) 435\nPrepaid expenses and other current assets (18,609) (9,226) (9,355)\nOther non-current assets (3,006) 703 510\nAccounts payable and accrued expenses 67,128 30,623 20,122\nBillings in excess of costs and estimated earnings 22,450 6,746 13,967\nOther non-current liabilities (762) 1,214 8,774\nNet cash provided by operating activities 16,262 37,924 76,741\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchases of property and equipment (29,255) (7,401) (4,745)\nProceeds from sales of assets 219 295 104\nCash paid in conjunction with equity investments (500) - -\nCash paid in conjunction with business combinations or dispositions - (92,463) (28,952)\nNet cash used in investing activities (29,536) (99,569) (33,593)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nBorrowings of debt 1,924,469 1,318,530 592,768\nRepayments of debt (1,882,148) (1,278,204) (592,756)\nCash paid for finance leases (1,801) (648) (215)\nPurchase of noncontrolling interest - (1,188) -\nDistribution to noncontrolling interest (7,000) (311) (639)\nPurchase of treasury stock (18,556) (7,006) (7,697)\nIssuance of shares 53 - 34\nNet cash provided by (used in) financing activities 15,017 31,173 (8,505)\nNET INCREASE (DECREASE) IN CASH AND CASH EQUIVALENTS 1,743 (30,472) 34,643\nCASH, CASH EQUIVALENTS, beginning of period 23,105 53,577 18,934\nCASH, CASH EQUIVALENTS, end of period $ 24,848 $ 23,105 $ 53,577\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid for interest $ 3,068 $ 738 $ 782\nCash paid for income taxes (net) $ 3,953 $ 5,062 $ 323\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nIES HOLDINGS, INC.\nNotes to the Consolidated Financial Statements\n(All Amounts in Thousands Except Share Amounts)\n1. BUSINESS\nDescription of the Business\nIES Holdings, Inc. designs and installs integrated electrical and technology systems and provides infrastructure products and services to a variety of end markets, including data centers, residential housing and commercial and industrial facilities. Our operations are organized into four business segments, based upon the nature of our services:\nCommunications - Nationwide provider of technology infrastructure services, including the design, build, and maintenance of the communications infrastructure within data centers for co-location and managed hosting customers, for both large corporations and independent businesses.\nResidential - Regional provider of electrical installation services for single-family housing and multi-family apartment complexes, as well as heating, ventilation and air conditioning (HVAC) and plumbing installation services in certain markets.\nInfrastructure Solutions - Provider of electro-mechanical solutions for industrial operations, including apparatus repair and custom-engineered products such as generator enclosures used in data centers and other industrial applications.\nCommercial & Industrial - Provider of electrical and mechanical design, construction, and maintenance services to the commercial and industrial markets in various regional markets and nationwide in certain areas of expertise, such as the power infrastructure market and data centers.\nThe words IES, the Company, we, our, and us refer to IES Holdings, Inc. and, except as otherwise specified herein, to our consolidated subsidiaries.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\nThe accompanying Consolidated Financial Statements include the accounts of IES Holdings, Inc. and its consolidated subsidiaries. All significant intercompany accounts and transactions have been eliminated in consolidation.\nAsset Impairment\nDuring the fiscal years ended September 30, 2022 and 2021, the Company recorded no asset impairment charges. At September 30, 2020, we recorded an impairment charge of $6,976 to Goodwill related to our Commercial & Industrial segment. Please refer to Note 17, Goodwill and Intangible Assets for further discussion.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (GAAP) requires the use of estimates and assumptions by management in determining the reported amounts of assets and liabilities, disclosures of contingent liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Estimates are primarily used in our revenue recognition of construction in progress, fair value assumptions in accounting for business combinations and analyzing goodwill, intangible assets and long-lived asset impairments and adjustments, allowance for credit losses, stock-based compensation, reserves for legal matters, realizability of deferred tax assets, unrecognized tax benefits and self-insured claims liabilities and related reserves.\nCash and Cash Equivalents\nWe consider all highly liquid investments purchased with an original maturity of three months or less to be cash equivalents.\nInventories\nInventories consist of raw materials, work in process, finished goods, and parts and supplies held for use in the ordinary course of business. Inventory is valued at the lower of cost or net realizable value generally using the historical average cost or first-in, first-out (FIFO) method. When circumstances dictate, we write down inventory to its estimated net realizable value based on assumptions about future demand, market conditions, plans for disposal, and physical condition of the product. Where shipping and handling costs on inventory purchases are borne by us, these charges are included in inventory and charged to cost of services upon use in our projects or the providing of services.\nProperty and Equipment\nAdditions of property and equipment are recorded at cost, and depreciation is computed using the straight-line method over the estimated useful life of the related asset. Leasehold improvements are capitalized and depreciated over the lesser of the life of the lease or the estimated useful life of the asset.\nExpenditures for repairs and maintenance are charged to expense when incurred. Expenditures for major renewals and betterments, which extend the useful lives of existing property and equipment, are capitalized and depreciated. Upon retirement or disposition of property and equipment, the capitalized cost and related accumulated depreciation are removed from the accounts and any resulting gain or loss is recognized in the statements of comprehensive income in the caption (gain) loss on sale of assets.\nGoodwill\nGoodwill attributable to each reporting unit is tested for impairment either by comparing the fair value of each reporting unit with its carrying value or by a qualitative assessment. These impairment tests are required to be performed at least annually. On an ongoing basis (absent any impairment indicators), we perform an impairment test annually using a measurement date of September 30. In evaluating goodwill for impairment, we have the option to first assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is greater than its carrying value. If we determine that it is more likely than not that the carrying value of a reporting unit is greater than its fair value, then we perform an impairment test by calculating the fair value of the reporting unit and comparing this calculated fair value with the carrying value of the reporting unit.\nWe estimate the fair value of the reporting unit based on both a market approach and an income approach, using discounted estimated future cash flows. The market approach uses market multiples of enterprise value to earnings before interest, taxes, depreciation and amortization for comparable publicly traded companies. The income approach relies on significant estimates for future cash flows, projected long-term growth rates, and the weighted average cost of capital.\nIntangible Assets\nIntangible assets with definite lives are amortized over their estimated useful lives based on expected economic benefit with no residual value.\nDebt Issuance Costs\nDebt issuance costs are included as a reduction of our debt outstanding, or alternately classified within other non-current assets if we have no borrowings drawn on our credit facility at the balance sheet date, and are amortized to interest expense over the scheduled maturity of the debt. Amortization expense of debt issuance costs was $199, $198 and $152, respectively, for the years ended 2022, 2021 and 2020. Remaining unamortized capitalized debt issuance costs were $1,031 and $656 at September 30, 2022, and 2021, respectively.\nRevenue Recognition\nRevenue is recognized from a contract with a customer when: (i) it has approval and commitment from both parties, (ii) the rights of the parties are identified, (iii) payment terms are identified, (iv) the contract has commercial substance, and (v) collectability of consideration is probable. We consider the start of a project to be when the above criteria have been met and we have written authorization from the customer to proceed.\nWe recognize revenue on project contracts over time using the percentage of completion method. Project contracts generally provide that customers accept completion of progress to date and compensate us for services rendered measured in terms of units installed, hours expended or some other measure of progress. We recognize revenue on both signed contracts and change orders. A discussion of our treatment of claims and unapproved change orders is described later in this section. Percentage of completion for construction contracts is measured principally by the percentage of costs incurred and accrued to date for each contract to the estimated total cost for each contract at completion. We generally consider contracts to be substantially complete upon departure from the work site and acceptance by the customer. Contract costs include all direct material, labor and insurance costs and those indirect costs related to contract performance, such as indirect labor, supplies, tools, repairs and depreciation costs. Changes in job performance, job conditions, estimated contract costs and profitability and final contract settlements can result in change orders under which the customer agrees to pay additional contract price. Revisions can also result in claims we might make against the customer to recover additional costs that have not been resolved through change orders with the customer. We do not recognize revenue or margin based on change orders or claims if it is probable such revenue will be reversed. The amount of revenue associated with unapproved change orders and claims was immaterial for the years ended September 30, 2022, 2021 and 2020. Provisions for total estimated losses on uncompleted contracts are made in the period in which such losses are determined. The balances billed but not paid by customers\npursuant to retainage provisions in project contracts are typically due upon completion of the contracts and acceptance by the customer. Based on our experience, the retention balance at each balance sheet date will be collected within the subsequent fiscal year.\nCertain divisions in the Residential and Infrastructure Solutions segments recognize revenue as of a point-in-time at the completion of the contract (\"completed contract\") because the duration of their contracts is short in nature. We recognize revenue on completed contracts when the project is complete and billable to the customer. Provisions for estimated losses on these contracts are recorded in the period such losses are determined.\nAccounts Receivable and Allowance for Credit Losses\nAs described below under Accounting Standards Recently Adopted, we adopted the new accounting standard for measuring credit losses effective October 1, 2020. We record accounts receivable for all amounts billed and not collected and amounts for which we have an unconditional right to bill our customers. Additionally, we provide an allowance for credit losses based on historical company-specific uncollectable accounts, as well as current and expected market conditions. From time to time, we establish additional allowance for credit losses for financial asset balances with specific customers where collectability has been determined to be improbable based on specific facts and circumstances. Such allowances are established as deemed necessary in the period such determination is made. As is common in our industry, some of these receivables are in litigation or require us to exercise our contractual lien rights in order to collect. Our allowance for credit losses at September 30, 2022 and 2021 was $5,361 and $2,387, respectively.\nActivity in our allowance for credit losses consists of the following:\nYear Ended September 30,\n2022 2021\nBalance at beginning of period $ 2,387 $ 2,613\nAdditions to costs and expenses, inclusive of ASU 2016-13 adoption adjustment 3,141 1,216\nDeductions for uncollectible receivables written off, net of recoveries (167) (1,442)\nBalance at end of period $ 5,361 $ 2,387\nComprehensive Income (Loss)\nComprehensive income (loss) includes all changes in equity during a period except those resulting from investments by and distributions to stockholders.\nIncome Taxes\nWe follow the liability method of accounting for income taxes. Under this method, deferred income tax assets and liabilities are recorded for the future income tax consequences of temporary differences between the financial reporting and income tax bases of assets and liabilities, and are measured using enacted tax rates and laws.\nWe evaluate valuation allowances established for deferred tax assets for which future realization is uncertain on a quarterly basis. In assessing the realizability of deferred tax assets, we must consider whether it is more likely than not some portion, or all, of the deferred tax assets will not be realized. We consider all available evidence, both positive and negative, in determining whether a valuation allowance is required. At September 30, 2022, we concluded, based upon the assessment of positive and negative evidence, that it is more likely than not that the Company will generate sufficient taxable income within the applicable net operating loss (\"NOL\") carryforward periods to realize net deferred tax assets of $20,519. We considered the scheduled reversal of deferred tax liabilities, projected future taxable income and tax planning strategies in making this assessment. If actual future taxable income is different from these estimates, our results could be affected.\nWe record reserves for income taxes related to certain tax positions when management considers it more likely than not that additional taxes may be due in excess of amounts reflected on income tax returns filed. When recording these reserves, we assume that taxing authorities have full knowledge of the position and all relevant facts. We continually review exposure to additional tax obligations, and as further information is known or events occur, changes in tax reserves may be recorded. To the extent interest and penalties may be assessed by taxing authorities on any underpayment of income tax, such amounts have been accrued and included in the provision for income taxes.\nRisk Management\nWe retain the risk for workers compensation, employers liability, automobile liability, construction defects, general liability and employee group health claims, as well as pollution coverage, resulting from uninsured deductibles per accident or occurrence which are generally subject to annual aggregate limits. Our general liability program provides coverage for bodily injury and property damage. In many cases, we insure third parties, including general contractors, as additional insureds under our insurance policies. Losses are accrued based upon our known claims incurred and an estimate of claims incurred but not reported. Each year, we compile our historical data pertaining to the insurance experiences and actuarially develop the ultimate loss associated with our insurance programs other than pollution coverage for our Infrastructure Solutions segment. We believe that the actuarial valuation provides the best estimate of the ultimate losses to be expected under these programs.\nThe undiscounted ultimate losses of our workers compensation, auto and general liability insurance reserves at September 30, 2022 and 2021, were $5,026 and $3,266, respectively. Based on historical payment patterns, we expect payments of undiscounted ultimate\nlosses to be made as follows:\nYear Ending September 30:\n2023 $ 1,424\n2024 1,085\n2025 783\n2026 474\n2027 243\nThereafter 1,017\nTotal $ 5,026\nWe elect to discount the ultimate losses above to present value using an approximate risk-free rate over the average life of our insurance claims. For the years ended September 30, 2022 and 2021, the discount rate used was 4.1 percent and 1.0 percent, respectively. The present value of all insurance reserves for the workers compensation, auto and general liability recorded at September 30, 2022 and 2021 was $5,042 and $3,234, respectively. Our undiscounted reserves for employee group health claims at September 30, 2022 and 2021 were $2,651 and $2,553, respectively, and are anticipated to be resolved within the year ending September 30, 2023.\nWe had letters of credit totaling $3,878 outstanding at September 30, 2022 to collateralize certain of our high deductible insurance obligations.\nRealization of Long-Lived Assets\nWe evaluate the recoverability of property and equipment and other long-lived assets as facts and circumstances indicate that any of those assets might be impaired. If an evaluation is required for our assets we plan to hold and use, the estimated future undiscounted cash flows associated with the asset are compared to the assets carrying amount to determine if an impairment of such property has occurred. The effect of any impairment would be to expense the difference between the fair value of such property and its carrying value. Estimated fair values are determined based on expected future cash flows discounted at a rate we believe incorporates the time value of money, the expectations about future cash flows and an appropriate risk premium.\nFor the years ended September 30, 2022 and 2021, no indicators of impairments were identified, and no impairment charges were recorded. At September 30, 2020, we performed an asset impairment test for all long-lived assets within our Commercial & Industrial segment and determined no impairment charge was necessary.\nRisk Concentration\nFinancial instruments, which potentially subject us to concentrations of credit risk, consist principally of cash deposits and accounts receivable. Through delayed payment terms, we at times grant credit, usually without collateral, to our customers, who are generally large public companies, contractors and homebuilders throughout the United States. Consequently, we are subject to potential credit risk related to changes in business and economic factors throughout the United States, specifically within the construction, homebuilding and mission critical facility markets. However, we are entitled to payment for work performed and generally have certain lien rights in that work. Further, management believes that its contract acceptance, billing and collection policies are adequate to manage potential credit risk. We routinely maintain cash balances in financial institutions in excess of federally insured limits. We periodically assess the financial condition of these institutions where these funds are held and believe the credit risk is minimal. We maintain the majority of our cash and cash equivalents in depository bank accounts or money market mutual funds. There can be no assurance, however, that we will not be adversely affected by credit risks we face.\nNo single customer accounted for more than 10% of our consolidated revenues or accounts receivable for the years ended September 30, 2022, 2021 and 2020.\nFair Value of Financial Instruments\nOur financial instruments consist of cash and cash equivalents, accounts receivable, accounts payable, and a loan agreement. We believe that the carrying value of financial instruments approximates their fair value due to their short-term nature. The carrying value of our debt approximates fair value, as debt incurs interest at a variable rate.\nNoncontrolling Interest\nIn connection with our acquisitions of Edmonson Electric, LLC (\"Edmonson\") and Bayonet Plumbing, Heating & Air-Conditioning, LLC (\"Bayonet\") in fiscal 2021, NEXT Electric, LLC (\"NEXT\") in fiscal 2017, and STR Mechanical, LLC (\"STR\") in fiscal 2016, we acquired an 80 percent interest in each of the entities, with the remaining 20 percent interest in each such entity being retained by the respective third party sellers. The interests retained by those third party sellers are identified on our Consolidated Balance Sheets as noncontrolling interest, classified outside of permanent equity. Under the terms of each entitys operating agreement, after five years from the date of the acquisition, we may elect to purchase, or the third party seller may require us to purchase, part or all of the remaining 20 percent interest in the applicable entity. The purchase price is variable, based on a multiple of earnings as defined in the operating agreements. Therefore, this noncontrolling interest is carried at the greater of the balance determined under Accounting Standards Codification (ASC) 810 and the redemption amounts assuming the noncontrolling interests were redeemable at the balance sheet date. During the year ended September 30, 2021, we acquired the noncontrolling interest in STR for $1,188. If all of the noncontrolling interests remaining outstanding at September 30, 2022 had been redeemable at that date, the redemption amount would have been $27,204. For the year ended September 30, 2022, we recorded a decrease to Retained Earnings of $4,699 to increase the carrying amount of noncontrolling interest in NEXT and Edmonson to their redemption amounts. For the year ended September 30, 2021, we recorded a decrease to Retained Earnings of $315 to increase the carrying amount of noncontrolling interest in NEXT and STR to their redemption amounts.\nLeases\nWe enter into various contractual arrangements for the right to use facilities, vehicles and equipment. We evaluate whether each of these arrangements contains a lease and classify all identified leases as either operating or finance. If the arrangement is subsequently modified, we re-evaluate our classification. The lease term generally ranges from two to ten years for facilities and three to five years for vehicles and equipment. Our lease terms may include the exercise of renewal or termination options when it is reasonably certain these options will be exercised. Our lease agreements do not contain any material residual value guarantees or restrictive covenants.\nUpon commencement of the lease, we recognize a lease liability and corresponding right-of-use (\"ROU\") asset for all leases with an initial term greater than twelve months. Lease liabilities represent the present value of our future lease payments over the expected lease term. As most of our leases do not provide an implicit rate, we generally use our incremental borrowing rate as the discount rate in calculating the present value of the lease payments. The incremental borrowing rate is determined by identifying a synthetic credit rating for the consolidated company, where treasury functions are centrally managed, and adjusting the interest rates from associated indexes for differences in credit risk and interest rate risk. We have elected to combine the lease and nonlease components in the recognition of our lease liabilities across all classes of underlying assets. ROU assets represent our right to control the use of the leased asset during the lease and are recognized in an amount equal to the lease liability with adjustments for prepaid or accrued rent, lease incentives or unamortized initial direct costs. Costs associated with ROU assets are recognized on a straight-line basis over the term of the lease. Our lease assets are tested for impairment in the same manner as long-lived assets used in operations.\nCertain lease contracts include obligations to pay for other services, such as operations and maintenance. Where the costs of these services can be identified as fixed or fixed-in-substance, the costs are included as part of the future lease payments. If the cost is not fixed at the inception of the lease, the cost is recorded as a variable cost in the period incurred.\nAccounting Standards Recently Adopted\nIn December 2019, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standard Update No. 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. This standard simplifies the accounting for income taxes by eliminating certain exceptions to the guidance in Topic 740 related to the approach for intraperiod tax allocation, the methodology for calculating income taxes in an interim period and the recognition of deferred tax liabilities for outside basis differences. The standard also simplifies aspects of the accounting for franchise taxes and enacted changes in tax laws or rates and clarifies the accounting for transactions that result in a step-up in the tax basis of goodwill. This update is effective for fiscal years beginning after December 15, 2020 and for interim periods within that year. Early adoption is permitted. We adopted this standard on October 1, 2021 with immaterial impact on our Consolidated Financial Statements.\nIn June 2016, FASB issued Accounting Standard Update No. 2016-13, Financial Instruments - Credit Losses (ASU 2016-13), which requires companies to consider historical experiences, current market conditions and reasonable and supportable forecasts in the measurement of expected credit losses, with further clarifications made in April 2019 and May 2019 with the issuances of Accounting Standard Updates No. 2019-04 and 2019-05. This update is effective for fiscal years beginning after December 15, 2019 and for interim periods within those fiscal years. We adopted this standard on October 1, 2020, using a modified retrospective transition method through a cumulative-effect adjustment to beginning retained earnings in the period of adoption. As a result, we recorded an increase in the Allowance for Credit Losses of $284, an increase to Deferred Tax Assets of $70, and a decrease to Retained Earnings of $214.\n3. CONTROLLING SHAREHOLDER\nTontine Associates, L.L.C. (\"Tontine Associates\"), together with its affiliates (collectively, \"Tontine\") is the Company's controlling stockholder, owning approximately 57 percent of the Companys outstanding common stock based on the Form 4 filed by Tontine with the SEC on December 3, 2021 and the Company's shares outstanding as of December 2, 2022. Accordingly, Tontine has the ability to exercise significant control over our affairs, including the election of directors and most actions requiring the approval of shareholders.\nWhile Tontine is subject to certain restrictions under federal securities laws on sales of its shares as an affiliate, the Company has filed a shelf registration statement to register all of the shares of IES common stock owned by Tontine at the time of registration. As long as the shelf registration statement remains effective and the Company remains eligible to use it, Tontine has the ability to resell any or all of its registered shares from time to time in one or more offerings, as described in the shelf registration statement and in any prospectus supplement filed in connection with an offering pursuant to the shelf registration statement.\nShould Tontine, or its underlying individual owners, sell or otherwise dispose of all or a portion of its position in IES, a change in ownership of IES could occur. A change in ownership, as defined by Internal Revenue Code Section 382, could reduce the availability of the Companys net operating loss carryforwards for federal and state income tax purposes. Furthermore, a change of control would trigger the change of control provisions in a number of our material agreements, including our credit agreement, bonding agreements with our sureties and our executive severance plan.\nJeffrey L. Gendell was appointed as Chief Executive Officer of the Company effective October 1, 2020, having served as the Company's Interim Chief Executive Officer since July 31, 2020. Mr. Gendell also serves as Chairman of the Board of Directors, a position he has held since November 2016. He is the managing member and founder of Tontine, and the brother of David B. Gendell, who has served as a member of our Board of Directors since February 2012, and who previously served as Interim Director of Operations from November 2017 to January 2019, as Vice Chairman of the Board from November 2016 to November 2017 and as Chairman of the Board from January 2015 to November 2016. David B. Gendell was an employee of Tontine from 2004 until January 2018.\nThe Company is party to a sublease agreement with Tontine Associates for corporate office space in Greenwich, Connecticut. The sublease extends through February 27, 2023, with monthly payments due in the amount of approximately $8. Payments by the Company are at a rate consistent with that paid by Tontine Associates to its landlord.\nOn December 6, 2018, the Company entered into a Board Observer Letter Agreement (the \"Observer Agreement\") with Tontine Associates, in order to assist Tontine in managing its investment in the Company. Subject to the terms and conditions set forth in the Observer Agreement, the Company granted Tontine the right, at any time that Tontine holds at least 20% of the outstanding common stock of the Company, to appoint a representative to serve as an observer to the Board (the Board Observer). The Board Observer, who must be reasonably acceptable to those members of the Board who are not affiliates of Tontine, shall have no voting rights or other decision making authority. Subject to the terms and conditions set forth in the Observer Agreement, so long as Tontine has the right to appoint a Board Observer, the Board Observer will have the right to attend and participate in meetings of the Board and the\ncommittees thereof, subject to confidentiality requirements, and to receive reimbursement for reasonable out-of-pocket expenses incurred in his or her capacity as a Board Observer and such rights to coverage under the Companys directors and officers liability insurance policy as are available to the Companys directors.\n4. REVENUE RECOGNITION\nContracts\nOur revenue is derived from contracts with customers, and we determine the appropriate accounting treatment for each contract at its inception. Our contracts primarily relate to electrical and mechanical contracting services, technology infrastructure products and services, and electro-mechanical solutions for industrial operations. Revenue is earned based upon an agreed fixed price or actual costs incurred plus an agreed upon percentage.\nWe account for a contract when: (i) it has approval and commitment from both parties, (ii) the rights of the parties are identified, (iii) payment terms are identified, (iv) the contract has commercial substance, and (v) collectability of consideration is probable. We consider the start of a project to be when the above criteria have been met and we have written authorization from the customer to proceed.\nPerformance Obligations\nA performance obligation is a promise in a contract to transfer a distinct good or service to the customer. A contracts transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, the performance obligation is satisfied.\nWe recognize revenue over time for the majority of the services we perform as (i) control continuously transfers to the customer as work progresses at a project location controlled by the customer and (ii) we have the right to bill the customer as costs are incurred. Within our Infrastructure Solutions segment, we often perform work inside our own facilities, where control does not continuously transfer to the customer as work progresses. In such cases, we evaluate whether we have the right to bill the customer as costs are incurred. Such assessment involves an evaluation of contractual termination clauses. Where we have a contractual right to payment for work performed to date, we recognize revenue over time. If we do not have such a right, we recognize revenue upon completion of the contract, when control of the work transfers to the customer.\nFor fixed price arrangements, we use the percentage of completion method of accounting under which revenue recognized is measured principally by the costs incurred and accrued to date for each contract as a percentage of the estimated total cost for each contract at completion. Contract costs include all direct material, labor and indirect costs related to contract performance. Changes in job performance, job conditions, estimated contract costs and profitability and final contract settlements may result in revisions to costs and income, and the effects of these revisions are recognized in the period in which the revisions are determined. Provisions for estimated losses on uncompleted contracts are made in the period in which such losses are determined. This measurement and comparison process requires updates to the estimate of total costs to complete the contract, and these updates may include subjective assessments and judgments.\nVariable Consideration\nThe transaction price for our contracts may include variable consideration, which includes changes to transaction price for approved and unapproved change orders, claims and incentives. Change orders, claims and incentives are generally not distinct from the existing contract due to the significant integration service provided in the context of the contract and are accounted for as a modification of the existing contract and performance obligation. We estimate variable consideration for a performance obligation at the probability weighted value we expect to receive (or the most probable amount we expect to incur in the case of liquidated damages, if any), utilizing estimation methods that best predict the amount of consideration to which we will be entitled (or will be incurred in the case of liquidated damages, if any). We include variable consideration in the estimated transaction price to the extent it is probable that a significant reversal of cumulative revenue recognized will not occur or when the uncertainty associated with the variable consideration is resolved. Our estimates of variable consideration and determination of whether to include estimated amounts in transaction price are based largely on an assessment of our anticipated performance and all information (historical, current and forecasted) that is reasonably available to us. The effect of variable consideration on the transaction price of a performance obligation is recognized as an adjustment to revenue on a cumulative catch-up basis. To the extent unapproved change orders and claims reflected in transaction price (or accounted for as a reduction of the transaction price in the case of liquidated damages) are not resolved in our favor, or to the extent incentives reflected in transaction price are not earned, there could be reductions in, or reversals of, previously recognized revenue.\nDisaggregation of Revenue\nWe disaggregate our revenue from contracts with customers by activity and contract type, as these categories reflect how the nature, amount, timing and uncertainty of our revenue and cash flows are affected by economic factors. Our consolidated 2022, 2021, and 2020 revenue was derived from the following activities. See details in the following tables:\nYear Ended September 30,\n2022 2021 2020\nCommunications $ 559,777 $ 445,968 $ 395,141\nResidential\nSingle-family 825,505 454,449 239,140\nMulti-family and Other 305,909 232,898 172,650\nTotal Residential 1,131,414 687,347 411,790\nInfrastructure Solutions\nIndustrial Services 65,686 44,427 40,701\nCustom Power Solutions 101,427 102,553 87,678\nTotal Infrastructure Solutions 167,113 146,980 128,379\nCommercial & Industrial 308,504 256,198 255,546\nTotal Revenue $ 2,166,808 $ 1,536,493 $ 1,190,856\nYear Ended September 30, 2022\nCommunications Residential Infrastructure Solutions Commercial & Industrial Total\nFixed-price $ 367,513 $ 1,131,414 $ 159,994 $ 282,522 $ 1,941,443\nTime-and-material 192,264 - 7,119 25,982 225,365\nTotal revenue $ 559,777 $ 1,131,414 $ 167,113 $ 308,504 $ 2,166,808\nYear Ended September 30, 2021\nCommunications Residential Infrastructure Solutions Commercial & Industrial Total\nFixed-price $ 327,496 $ 687,347 $ 139,532 $ 243,546 $ 1,397,921\nTime-and-material 118,472 - 7,448 12,652 138,572\nTotal revenue $ 445,968 $ 687,347 $ 146,980 $ 256,198 $ 1,536,493\nYear Ended September 30, 2020\nCommunications Residential Infrastructure Solutions Commercial & Industrial Total\nFixed-price $ 309,567 $ 411,790 $ 121,922 $ 241,864 $ 1,085,143\nTime-and-material 85,574 - 6,457 13,682 105,713\nTotal revenue $ 395,141 $ 411,790 $ 128,379 $ 255,546 $ 1,190,856\nAccounts Receivable\nAccounts receivable include amounts which we have billed or have an unconditional right to bill our customers. As of September 30, 2022, accounts receivable included $19,296 of unbilled receivables for which we have an unconditional right to bill.\nContract Assets and Liabilities\nProject contracts typically provide for a schedule of billings on percentage of completion of specific tasks inherent in the fulfillment of our performance obligation(s). The schedules for such billings usually do not precisely match the schedule on which costs are incurred. As a result, contract revenue recognized in the statement of operations can and usually does differ from amounts that can be billed to the customer at any point during the contract. Amounts by which cumulative contract revenue recognized on a contract as of a given date exceeds cumulative billings and unbilled receivables to the customer under the contract are reflected as a current asset in our Consolidated Balance Sheets under the caption Costs and estimated earnings in excess of billings. Amounts by which cumulative billings to the customer under a contract as of a given date exceed cumulative contract revenue recognized are reflected as a current liability in our Consolidated Balance Sheets under the caption Billings in excess of costs and estimated earnings.\nDuring the years ended September 30, 2022 and 2021, we recognized revenue of $52,683 and $47,906 related to our contract liabilities at October 1, 2021 and 2020, respectively.\nWe did not have any impairment losses recognized on our receivables or contract assets for the years ended September 30, 2022, 2021, or 2020.\nRemaining Performance Obligations\nRemaining performance obligations represent the unrecognized revenue value of our contract commitments. New awards represent the total expected revenue value of new contract commitments undertaken during a given period, as well as additions to the scope of existing contract commitments. Our new performance obligations vary significantly each reporting period based on the timing of our major new contract commitments. At September 30, 2022, we had remaining performance obligations of $967,000. The Company expects to recognize revenue on approximately $776,897 of the remaining performance obligations over the next 12 months, with the remaining recognized thereafter.\nFor the year ended September 30, 2022, net revenue recognized from our performance obligations satisfied in previous periods was not material.\n5. PROPERTY AND EQUIPMENT\nProperty and equipment consists of the following:\nEstimated Useful Lives in Years Year Ended September 30,\n2022 2021\nLand N/A $ 4,569 $ 1,436\nBuildings and improvements 5 - 20 32,477 15,445\nMachinery and equipment 3 - 10 55,917 48,443\nInformation systems 2 - 8 8,699 8,555\nFurniture and fixtures 5 - 7 2,239 1,571\n$ 103,901 $ 75,450\nLess-Accumulated depreciation (50,014) (41,308)\nConstruction in progress 539 1,312\nProperty and equipment, net $ 54,426 $ 35,454\nDepreciation expense was $10,073, $8,090 and $6,084, respectively, for the years ended September 30, 2022, 2021 and 2020.\n6. PER SHARE INFORMATION\nBasic earnings per share is calculated as income (loss) available to common stockholders, divided by the weighted average number of common shares outstanding during the period. If the effect is dilutive, participating securities are included in the computation of basic earnings per share. Our participating securities do not have a contractual obligation to share in the losses in any given period. As a result, these participating securities will not be allocated any losses in the periods of net losses, but will be allocated income in the periods of net income using the two-class method.\nThe following table reconciles the components of the basic and diluted earnings per share for the years ended September 30, 2022, 2021 and 2020:\nYear Ended September 30,\n2022 2021 2020\nNumerator:\nNet income attributable to IES Holdings, Inc. $ 34,762 $ 66,658 $ 41,599\nIncrease in noncontrolling interest (4,695) (315) (194)\nNet income attributable to restricted shareholders of IES Holdings, Inc. (21) (56) (575)\nNet income attributable to common shareholders of IES Holdings, Inc. $ 30,046 $ 66,287 $ 40,830\nDenominator:\nWeighted average common shares outstanding - basic 20,667,745 20,790,307 20,795,892\nEffect of dilutive stock options and non-vested securities 226,880 296,125 296,518\nWeighted average common and common equivalent shares outstanding - diluted 20,894,625 21,086,432 21,092,410\nEarnings per share attributable to common shareholders of IES Holdings, Inc.:\nBasic $ 1.45 $ 3.19 $ 1.96\nDiluted $ 1.44 $ 3.15 $ 1.94\nFor the years ended September 30, 2022, 2021, and 2020, the average price of our common shares exceeded the exercise price of outstanding options; therefore, outstanding stock options were included in the computation of diluted earnings per share.\n7. DETAIL OF CERTAIN BALANCE SHEET ACCOUNTS\nAccounts payable and accrued expenses consist of the following:\nYear Ended September 30,\n2022 2021\nAccounts payable, trade $ 184,963 $ 136,967\nAccrued compensation and benefits 75,190 61,109\nAccrued insurance liabilities 7,693 5,787\nCurrent operating lease liabilities 17,319 13,973\nOther accrued expenses 31,785 31,278\n$ 316,950 $ 249,114\nOther non-current assets are comprised of the following:\nYear Ended September 30,\n2022 2021\nExecutive Savings Plan assets $ 706 $ 937\nSecurities and equity investments 2,447 10\nRight of use asset - finance leases 10,246 3,927\nOther 1,746 2,175\nTotal $ 15,145 $ 7,049\n8. DEBT\nDebt consists of the following:\nYear Ended September 30,\n2022 2021\nRevolving loan (long-term debt) $ 82,659 $ 40,339\nDebt issuance costs\n(1,031) (656)\nOther long-term debt - 63\nTotal debt $ 81,628 $ 39,746\nAt September 30, 2022, we had $82,659 of outstanding borrowings, $4,077 in outstanding letters of credit and $63,263 of availability under our revolving credit facility. All amounts outstanding under our revolving credit facility are due and payable in September 2026, upon expiration of our revolving credit facility, and all amounts described as available are available without triggering our financial covenants under the Amended Credit Agreement (as defined below).\nThe interest rate on outstanding borrowings under our revolving credit facility was 4.98% at September 30, 2022. For the years ended September 30, 2022, 2021 and 2020, we incurred interest expense of $2,970, $962 and $777, respectively.\nThe Revolving Credit Facility\nOn April 28, 2022 we entered into the Third Amended and Restated Credit and Security Agreement (the \"Amended Credit Agreement\"), which, among other things, increased the maximum borrowing amount under our revolving credit facility from $125,000 to $150,000. The Amended Credit Agreement also removed the aggregate cap on Company investments in certain securities and the cap on the Companys ability to make stock repurchases, in each case subject to the satisfaction of certain liquidity requirements. The Amended Credit Agreement, which matures on September 30, 2026, contains customary affirmative, negative and financial covenants. As of September 30, 2022, the Company was in compliance with the financial covenants under the Amended Credit Agreement, requiring that we maintain:\na Fixed Charge Coverage Ratio (as defined in the Amended Credit Agreement), measured quarterly on a trailing four-quarter basis at the end of each quarter, of at least 1.1 to 1.0; and\nminimum Liquidity of at least ten percent (10%) of the Maximum Revolver Amount, or $15,000; with, for purposes of this covenant, at least fifty percent (50%) of our Liquidity comprised of Excess Availability (as defined in the Amended Credit Agreement).\nAt September 30, 2022, our Liquidity was $88,112, our Excess Availability was $63,263 (or greater than 50% of minimum Liquidity), and our Fixed Charge Coverage Ratio was 1.6:1.0.\nIf in the future our Liquidity falls below the amount required by the Amended Credit Agreement (or Excess Availability falls below 50% of our minimum Liquidity), our Fixed Charge Coverage Ratio is less than 1.1:1.0, or if we otherwise fail to perform or otherwise comply with certain of our covenants or other agreements under the Amended Credit Agreement, it would result in an event of default under the Amended Credit Agreement, which could result in some or all of any indebtedness we may take on becoming immediately due and payable.\n9. LEASES\nWe enter into various contractual arrangements for the right to use facilities, vehicles and equipment. The lease term generally ranges from two to ten years for facilities and three to five years for vehicles and equipment. Our lease terms may include the exercise of renewal or termination options when it is reasonably certain these options will be exercised. Our lease agreements do not contain any material residual value guarantees or restrictive covenants.\nCurrent operating lease liabilities were $17,319 and $13,973, respectively, as of September 30, 2022 and 2021, and current finance lease liabilities were $2,928 and $1,033, respectively, as of September 30, 2022 and 2021. Current operating and finance lease liabilities were included in \"Accounts payable and accrued expenses\" in the Consolidated Balance Sheets as of September 30, 2022 and 2021. Non-current finance lease liabilities and finance lease right-of-use assets were included in the \"Other non-current liabilities\" and \"Other non-current assets\", respectively, in the Consolidated Balance Sheets.\nThe maturities of our lease liabilities as of September 30, 2022, are as follows:\nOperating Leases Finance Leases Total\n2022 $ 17,645 $ 3,004 $ 20,649\n2023 13,818 2,975 16,793\n2024 10,471 2,737 13,208\n2025 7,660 1,885 9,545\n2026 4,487 478 4,965\nThereafter 7,764 23 7,787\nTotal undiscounted lease payments $ 61,845 $ 11,102 $ 72,947\nLess: imputed interest 6,382 962 7,344\nPresent value of lease liabilities $ 55,463 $ 10,140 $ 65,603\nThe total future undiscounted cash flows related to lease agreements committed to but not yet commenced as of September 30, 2022, is $4,693.\nLease cost recognized in our Consolidated Statements of Comprehensive Income is summarized as follows:\nYear Ended September 30,\n2022 2021\nOperating lease cost $ 16,000 $ 13,405\nFinance lease cost\nAmortization of lease assets 1,729 634\nInterest on lease liabilities 269 119\nFinance lease cost 1,998 753\nShort-term lease cost 2,426 1,575\nVariable lease cost 1,900 1,286\nTotal lease cost $ 22,324 $ 17,019\nOther information about lease amounts recognized in our Consolidated Financial Statements is summarized as follows:\nYear Ended September 30,\n2022 2021\nOperating cash flows used for operating leases $ 20,799 $ 15,011\nOperating cash flows used for finance leases 269 119\nRight-of-use assets obtained in exchange for new operating lease liabilities 31,422 24,606\nRight-of-use assets obtained in exchange for new finance lease liabilities 7,950 2,962\nYear Ended September 30,\n2022 2021\nWeighted-average remaining lease term - operating leases 4.8 years 5.0 years\nWeighted-average remaining lease term - finance leases 3.9 years 4.2 years\nWeighted-average discount rate - operating leases 4.0 % 3.7 %\nWeighted-average discount rate - finance leases 4.7 % 4.3 %\nFor a discussion of leases with certain related parties which are included above, see Note 13, Related-Party Transactions.\nRent expense was $18,426, $14,980 and $14,073 for the years ended September 30, 2022, 2021 and 2020, respectively.\n10. INCOME TAXES\nFederal and state income tax provisions are as follows:\nYear Ended September 30,\n2022 2021 2020\nFederal:\nCurrent $ 9,401 $ 2 $ (39)\nDeferred 3 11,678 9,317\nState:\nCurrent 3,445 4,505 3,657\nDeferred (34) 46 (4,195)\nTotal provision for income taxes $ 12,815 $ 16,231 $ 8,740\nActual income tax expense differs from income tax expense computed by applying the U.S. federal statutory corporate rate to income (loss) before income taxes as follows:\nYear Ended September 30,\n2022 2021 2020\nProvision at the federal statutory rate $ 11,130 $ 17,830 $ 10,352\nIncrease resulting from:\nNon-deductible expenses 471 658 1,974\nState income taxes, net of federal deduction 2,114 3,876 2,662\nChange in valuation allowance 283 - -\nOther 427 - 261\nDecrease resulting from:\nShare-based compensation (665) (715) (75)\nChange in valuation allowance - (118) (3,334)\nContingent tax liabilities (133) (2,898) (1,313)\nComponent 2 goodwill utilization (812) (2,241) (1,787)\nOther - (161) -\nTotal provision for income taxes $ 12,815 $ 16,231 $ 8,740\nDeferred income tax provisions result from temporary differences in the recognition of income and expenses for financial reporting purposes and for income tax purposes. The income tax effects of these temporary differences, representing deferred income tax assets and liabilities, result principally from the following:\nYear Ended September 30,\n2022 2021\nDeferred income tax assets:\nAllowance for credit losses $ 1,246 $ 541\nAccrued expenses 18,645 17,134\nNet operating loss carryforward 4,542 6,445\nVarious reserves 1,318 1,285\nEquity losses in affiliate 125 210\nShare-based compensation 1,142 1,079\nCapital loss carryforward 82 1\nLease asset 12,534 9,634\nOther 4,236 2,914\nSubtotal 43,870 39,243\nLess valuation allowance 875 592\nTotal deferred income tax assets 42,995 38,651\nDeferred income tax liabilities:\nProperty and equipment 126 509\nIntangible assets 9,044 8,765\nLease liability 12,500 9,615\nOther 806 753\nTotal deferred income tax liabilities 22,476 19,642\nNet deferred income tax assets $ 20,519 $ 19,009\nIn fiscal 2022 and 2021, the valuation allowance on our deferred tax assets increased by $283 and decreased by $118, respectively, which is included in Provision (benefit) for income taxes in our Consolidated Statements of Comprehensive Income.\nAs of September 30, 2022, we had available approximately $61,034 of federal net tax operating loss carry forward for federal income tax purposes, including $55,124 from net operating losses on which no tax benefit has been recognized and has not been recorded as a deferred tax asset. This carry forward, which may provide future tax benefits, will begin to expire in 2031. As of September 30, 2022, we had available approximately $71,723 state net tax operating loss carry forwards, including $5,520 from net operating losses on which no tax benefit has been recognized and has not been recorded as a deferred tax asset. The significant majority of these carry forwards, which may provide future tax benefits, will not begin to expire until 2026. We have provided valuation allowances on all net operating losses where it is determined it is more likely than not that they will expire without being utilized.\nIn assessing the realizability of deferred tax assets at September 30, 2022, we considered whether it was more likely than not that some portion or all of the deferred tax assets will not be realized. Our realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which these temporary differences become deductible. As a result, we have recorded a net deferred tax asset of $20,519 on our Consolidated Balance Sheets. We will continue to evaluate the appropriateness of our remaining deferred tax assets and need for valuation allowances on a quarterly basis.\nGAAP requires financial statement reporting of the expected future tax consequences of uncertain tax return reporting positions on the presumption that all relevant tax authorities possess full knowledge of those tax reporting positions, as well as all of the pertinent facts and circumstances, but it prohibits discounting of any of the related tax effects for the time value of money. The evaluation of a tax position is a two-step process. The first step is the recognition process to determine if it is more likely than not that a tax position will be sustained upon examination by the appropriate taxing authority, based on the technical merits of the position. The second step is a measurement process whereby a tax position that meets the more likely than not recognition threshold is calculated to determine the amount of benefit/expense to recognize in the financial statements. The tax position is measured at the largest amount of benefit/expense that is more likely than not of being realized upon ultimate settlement.\nA reconciliation of the beginning and ending balances of unrecognized tax benefit is as follows:\nYear Ended September 30,\n2022 2021\nBalance at beginning of period $ 21,879 $ 24,861\nAdditions for position related to current year - 59\nAdditions for positions of prior years 26 20\nReduction resulting from the lapse of the applicable statutes of limitations 159 3,061\nBalance at end of period $ 21,746 $ 21,879\nAs of September 30, 2022 and 2021, $21,746 and $21,879, respectively, of unrecognized tax benefits would result in a decrease in the provision for income tax expense. We anticipate that approximately $172 in liabilities for unrecognized tax benefits, including accrued interest, primarily from net operating losses on which no tax benefit has been recognized, may be reversed in the next twelve months. The reversal is predominantly due to the expiration of the statutes of limitation for unrecognized tax benefits.\nWe had approximately $52 and $50 accrued for the payment of interest and penalties at September 30, 2022, and 2021, respectively. We recognize interest and penalties related to unrecognized tax benefits as part of the provision for income taxes.\nThe tax years ended September 30, 2019, and forward are subject to federal audit as are tax years prior to September 30, 2019, to the extent of unutilized net operating losses generated in those years. The tax years ended September 30, 2018, and forward are subject to state audits as are tax years prior to September 30, 2018, to the extent of unutilized net operating losses generated in those years.\n11. OPERATING SEGMENTS\nWe manage and measure performance of our business in four distinct operating segments: Communications, Residential, Infrastructure Solutions and Commercial & Industrial. These segments are reflective of how the Companys Chief Operating Decision Maker (CODM) reviews operating results for the purposes of allocating resources and assessing performance. The Companys CODM is its Chief Executive Officer.\nTransactions between segments, if any, are eliminated in consolidation. Our corporate office provides general and administrative services, as well as support services, to our four operating segments. Management allocates certain shared costs among segments for selling, general and administrative expenses and depreciation expense.\nSegment information for the years ended September 30, 2022, 2021 and 2020 is as follows:\nYear Ended September 30, 2022\nCommunications Residential Infrastructure Solutions Commercial & Industrial Corporate Total\nRevenues $ 559,777 $ 1,131,414 $ 167,113 $ 308,504 $ - $ 2,166,808\nCost of services 490,959 928,161 138,444 290,314 - 1,847,878\nGross profit 68,818 203,253 28,669 18,190 - 318,930\nSelling, general and administrative 46,717 144,100 25,129 30,557 16,211 262,714\nContingent consideration - 277 - - - 277\nLoss (gain) on sale of assets 12 20 (46) (55) - (69)\nIncome (loss) from operations $ 22,089 $ 58,856 $ 3,586 $ (12,312) $ (16,211) $ 56,008\nOther data:\nDepreciation and amortization expense $ 1,550 $ 15,617 $ 5,575 $ 2,561 $ 165 $ 25,468\nCapital expenditures $ 2,004 $ 10,054 $ 14,729 $ 1,890 $ 578 $ 29,255\nTotal assets $ 210,875 $ 394,757 $ 161,828 $ 114,529 $ 52,720 $ 934,709\nYear Ended September 30, 2021\nCommunications Residential Infrastructure Solutions Commercial & Industrial Corporate Total\nRevenues $ 445,968 $ 687,347 $ 146,980 $ 256,198 $ - $ 1,536,493\nCost of services 361,197 553,546 106,048 227,704 - 1,248,495\nGross profit 84,771 133,801 40,932 28,494 - 287,998\nSelling, general and administrative 41,373 92,761 23,966 28,172 15,979 202,251\nContingent consideration - 211 - - - 211\nLoss (gain) on sale of assets (4) 86 (10) (92) (27) (47)\nIncome (loss) from operations $ 43,402 $ 40,743 $ 16,976 $ 414 $ (15,952) $ 85,583\nOther data:\nDepreciation and amortization expense $ 1,394 $ 11,490 $ 6,170 $ 2,709 $ 151 $ 21,914\nCapital expenditures $ 963 $ 2,829 $ 2,067 $ 1,453 $ 89 $ 7,401\nTotal assets $ 164,699 $ 329,691 $ 137,628 $ 87,577 $ 47,027 $ 766,622\nYear Ended September 30, 2020\nCommunications Residential Infrastructure Solutions Commercial & Industrial Corporate Total\nRevenues $ 395,141 $ 411,790 $ 128,379 $ 255,546 $ - $ 1,190,856\nCost of services 317,013 318,034 93,358 234,492 - 962,897\nGross profit 78,128 93,756 35,021 21,054 - 227,959\nSelling, general and administrative 37,674 63,668 20,418 32,128 17,023 170,911\nGoodwill impairment expense - - - 6,976 - 6,976\nContingent consideration - - - (11) - (11)\nLoss (gain) on sale of assets 8 2 35 (45) - -\nIncome (loss) from operations $ 40,446 $ 30,086 $ 14,568 $ (17,994) $ (17,023) $ 50,083\nOther data:\nDepreciation and amortization expense $ 1,351 $ 2,276 $ 6,020 $ 2,768 $ 93 $ 12,508\nCapital expenditures $ 830 $ 1,459 $ 795 $ 1,362 $ 299 $ 4,745\nTotal assets $ 154,808 $ 110,998 $ 124,640 $ 68,318 $ 101,764 $ 560,528\n12. STOCKHOLDERS EQUITY\nEquity Incentive Plan\nThe Companys 2006 Equity Incentive Plan, as amended and restated (the Equity Incentive Plan), provides for grants of stock options as well as grants of stock, including restricted stock. Approximately 3.0 million shares of common stock are authorized for issuance under the Equity Incentive Plan, of which approximately 713,058 shares were available for issuance at September 30, 2022.\nWe measure and record compensation expense for all share-based payment awards based on the fair value of the awards granted at the date of grant. The fair value of restricted stock awards and phantom stock unit awards is determined based on the number of shares granted and the closing price of IESs common stock on the date of grant. For awards vesting upon achievement of a market condition, the likelihood of achieving that market condition is considered in determining the fair value of the grant, which we expense ratably over the vesting period. For awards vesting upon achievement of a performance condition, we record expense based on the grant date fair value when it becomes probable the performance condition will be achieved. Forfeitures are recorded in the period in which they occur. The resulting compensation expense is recognized on a straight-line basis over the requisite service period, which is generally the vesting period.\nStock Repurchase Program\nIn 2015, our Board authorized a stock repurchase program for the purchase from time to time of up to 1.5 million shares of the Companys common stock, in 2019, our Board authorized the repurchase from time to time of an additional 1.0 million shares of the Company's common stock under the stock repurchase program. Share purchases are made for cash in open market transactions at prevailing market prices or in privately negotiated transactions or otherwise. The timing and amount of purchases under the program are determined based upon prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. All or part of the repurchases may be implemented under a Rule 10b5-1 trading plan, which allows repurchases under predetermined terms at times when the Company might otherwise be prevented from purchasing under insider trading laws or because of self-imposed blackout periods. The program does not require the Company to purchase any specific number of shares and may be modified, suspended or reinstated at any time at the Companys discretion and without notice.\nWe repurchased 511,600 shares of our common stock during the year ended September 30, 2022, in open market transactions at an average price of $32.02 per share.\nWe repurchased 124,205 shares of our common stock during the year ended September 30, 2021, in open market transactions at an average price of $44.40 per share.\nIn December 2022, our Board of Directors terminated our previous share repurchase program and authorized a new $40,000 share repurchase program.\nTreasury Stock\nDuring the year ended September 30, 2022, we issued 157,167 shares of common stock from treasury and repurchased 45,198 shares of common stock from our employees to satisfy statutory tax withholding requirements upon the vesting of certain performance phantom stock units under the Equity Incentive Plan. We also repurchased 511,600 shares of common stock on the open market pursuant to our stock repurchase program. During the year ended September 30, 2022, we issued 9,000 unrestricted shares to satisfy the exercise of outstanding options.\nDuring the year ended September 30, 2021, we issued 140,280 shares of common stock from treasury and repurchased 32,323 shares of common stock from our employees to satisfy statutory tax withholding requirements upon the vesting of certain performance phantom stock units under the Equity Incentive Plan. We also repurchased 124,205 shares of common stock on the open market pursuant to our stock repurchase program, and 13,996 shares were forfeited by former employees and returned to treasury stock. During the year ended September 30, 2021, we issued 380 unrestricted shares of common stock from treasury to members of our Board of Directors as part of their overall compensation.\nRestricted Stock\nDuring the years ended September 30, 2022, 2021, and 2020, we recognized $137, $145, and $2,441, respectively, in compensation expense related to our restricted stock awards. During the year ended September 30, 2020, $1,100 of the compensation expense was settled with cash. At September 30, 2022, the unamortized compensation cost related to outstanding unvested restricted stock was $23.\nA summary of restricted stock awards for the years ended September 30, 2022, 2021, and 2020 is provided in the table below:\nYear Ended September 30,\n2022 2021 2020\nUnvested at beginning of year 16,757 38,936 283,195\nGranted - - 69,338\nVested (3,118) (8,183) (105,000)\nForfeited - (13,996) (208,597)\nUnvested at end of year 13,639 16,757 38,936\nThe fair value of shares vesting during the years ended September 30, 2022, 2021, and 2020 was $150, $308 and $2,984, respectively. Fair value was calculated as the number of shares vested times the market price of shares on the date of vesting. The weighted average grant date fair value of unvested restricted stock at September 30, 2022 was $21.60.\nAll the restricted shares granted under the Equity Incentive Plan (vested or unvested) participate in dividends issued to common shareholders, if any.\nDirector Phantom Stock Units\nDirector phantom stock units (Director PSUs) are primarily granted to the members of the Board of Directors as part of their overall compensation. These Director PSUs are contractual rights to receive one share of the Company's common stock and are paid via unrestricted stock grants to each director upon their departure from the Board of Directors. We record compensation expense for the full value of the grant on the date of grant. For the years ended September 30, 2022, 2021, and 2020, we recognized $386, $376, and $390, respectively, in compensation expense related to these grants.\nEmployee Phantom Stock Units\nAn employee phantom stock unit (an Employee PSU) is a contractual right to receive one share of the Companys common stock. Depending on the terms of each grant, Employee PSUs may vest upon the achievement of certain specified performance objectives and continued performance of services, or may vest based on continued performance of services through the vesting date.\nAs of September 30, 2021, the Company had outstanding Employee PSUs, which, subject to the achievement of certain performance metrics, could have resulted in the issuance of 282,942 shares of common stock. During the year ended September 30, 2022, 10,464 Employee PSUs were forfeited and 106,964 vested, and the Company granted additional Employee PSUs, which, subject to the achievement of certain performance metrics, could result in the issuance of 150,447 shares of common stock. As of September 30, 2022, a maximum of 315,961 shares of common stock may be issued under outstanding Employee PSUs.\nDuring the years ended September 30, 2022, 2021, and 2020 we recognized compensation expense of $3,251, $2,986, and $1,443, respectively, related to Employee PSUs. The vesting of these awards is subject to either the achievement of specified levels of cumulative net income before taxes (a performance condition) or specified stock price levels (a market condition) and continued performance of services, or based on continued performance of services through the vesting date alone. For stock awards where vesting depends on achievement of a performance condition, we record expense when we conclude it is probable that the performance condition will be met. At September 30, 2022, it is deemed probable that the portion of the awards that vest based on performance conditions will vest.\n13. RELATED-PARTY TRANSACTIONS\nThe Company is a party to a sublease agreement with Tontine Associates, for corporate office space in Greenwich, Connecticut. The lease was renewed in November 2019, with monthly rent of approximately $8. Payments by the Company are at a rate consistent with that paid by Tontine Associates to its landlord. See Note 3, Controlling Shareholder for additional information regarding Tontine.\n14. EMPLOYEE BENEFIT PLANS\n401(k) Plan\nIn November 1998, we established the IES Holdings, Inc. 401(k) Retirement Savings Plan. All full-time IES employees are eligible to participate on the first day of the month subsequent to completing sixty days of service and attaining age twenty-one. Participants become vested in our matching contributions following three years of service. We also maintain several subsidiary retirement savings plans. We recognized $4,494, $3,386, and $2,326 in matching expenses in fiscal years 2022, 2021, and 2020, respectively.\nExecutive Savings Plan\nUnder the Executive Deferred Compensation Plan adopted on July 1, 2004 (the Executive Savings Plan), certain employees are permitted to defer a portion (up to 75%) of their base salary and/or bonus for a plan year. The Human Resources and Compensation Committee of the Board of Directors may, in its sole discretion, credit one or more participants with an employer deferral (contribution) in such amount as the Committee may choose (Employer Contribution). The Employer Contribution, if any, may be a fixed dollar amount, a fixed percentage of the participants compensation, base salary, or bonus, or a matching amount with respect to all or part of the participants elective deferrals for such plan year, and/or any combination of the foregoing as the Committee may choose. No compensation earned during the years ended September 30, 2022, 2021, or 2020 was deferred under this plan.\nMultiemployer Pension Plan\nThe Infrastructure Solutions segment participates in a multiemployer direct benefit pension plan for employees covered under one of our collective bargaining agreements. We do not administer the plan. We do not significantly participate in this plan. As of December 31, 2021, this plan was funded at 86.51%.\n15. FAIR VALUE MEASUREMENTS\nFair value is considered the price to sell an asset, or transfer a liability, between market participants on the measurement date. Fair value measurements assume that (1) the asset or liability is exchanged in an orderly manner, (2) the exchange is in the principal market for that asset or liability, and (3) the market participants are independent, knowledgeable, able and willing to transact an exchange. Fair value accounting and reporting establishes a framework for measuring fair value by creating a hierarchy for observable independent market inputs and unobservable market assumptions and expands disclosures about fair value measurements. Judgment is required to interpret the market data used to develop fair value estimates. As such, the estimates presented herein are not necessarily indicative of the amounts that could be realized in a current exchange. The use of different market assumptions and/or estimation methods could have a material effect on the estimated fair value.\nAt September 30, 2022, financial assets and liabilities measured at fair value on a recurring basis were limited to our Executive Savings Plan, under which certain employees are permitted to defer a portion of their base salary and/or bonus for a Plan Year (as defined in the plan), equity securities held for sale, and contingent consideration liabilities related to certain of our acquisitions.\nFinancial assets and liabilities measured at fair value on a recurring basis as of September 30, 2022 and 2021, are summarized in the following tables by the type of inputs applicable to the fair value measurements:\nSeptember 30, 2022\nTotal Fair Value Quoted Prices (Level 1) Significant Unobservable (Level 3)\nExecutive savings plan assets $ 706 $ 706 $ -\nEquity securities 1,937 1,937 -\nExecutive savings plan liabilities (585) (585) -\nContingent consideration liability (4,323) - (4,323)\nSeptember 30, 2021\nTotal Fair Value Quoted Prices (Level 1) Significant Unobservable (Level 3)\nExecutive savings plan assets $ 937 $ 937 $ -\nExecutive savings plan liabilities (806) (806) -\nContingent consideration liability (4,181) - (4,181)\nIn fiscal year 2021, we entered into a contingent consideration arrangement related to the acquisition of Bayonet. At September 30, 2022, we estimated the fair value of this contingent consideration liability at $4,323. The table below presents the fair value of this obligation, which used significant unobservable inputs (Level 3).\nContingent Consideration Agreement\nFair Value at September 30, 2020 $ -\nAcquisitions (4,074)\nNet adjustments to fair value (107)\nFair Value at September 30, 2021 $ (4,181)\nNet adjustments to fair value (142)\nFair Value at September 30, 2022 $ (4,323)\nBelow is a description of the inputs used to value the assets summarized in the preceding tables:\nLevel 1 - Inputs represent unadjusted quoted prices for identical assets exchanged in active markets.\nLevel 2 - Inputs include directly or indirectly observable inputs other than Level 1 inputs such as quoted prices for similar assets exchanged in active or inactive markets; quoted prices for identical assets exchanged in inactive markets; and other inputs that are considered in fair value determinations of the assets.\nLevel 3 - Inputs include unobservable inputs used in the measurement of assets. Management is required to use its own assumptions regarding unobservable inputs because there is little, if any, market activity in the assets or related observable inputs that can be corroborated at the measurement date.\n16. INVENTORY\nInventories consist of the following components:\nSeptember 30,\n2022 2021\nRaw materials $ 12,504 $ 5,819\nWork in process 8,218 6,848\nFinished goods 2,129 1,554\nParts and supplies 73,482 54,352\nTotal inventories $ 96,333 $ 68,573\n17. GOODWILL AND INTANGIBLE ASSETS\nGoodwill\nThe following summarizes changes in the carrying value of goodwill by segment for the years ended September 30, 2022 and 2021:\nCommunications Residential Infrastructure Solutions Commercial & Industrial Total\nBalance at September 30, 2020 $ 2,816 $ 16,219 $ 34,728 $ - $ 53,763\nAcquisitions (Note 19) - 35,151 3,481 - 38,632\nBalance at September 30, 2021 2,816 51,370 38,209 - 92,395\nBalance at September 30, 2022 $ 2,816 $ 51,370 $ 38,209 $ - $ 92,395\nBased on the results of our annual goodwill impairment assessment at September 30, 2022, we concluded the fair value of each of our reporting units exceeded its book value, and therefore we recorded no impairment charges for the year ended September 30, 2022.\nWe have an accumulated impairment loss of $6,976 related to our Commercial & Industrial segment.\nIntangible Assets\nIntangible assets consist of the following:\nSeptember 30, 2022\nEstimated Useful Lives (in Years) Gross Carrying Amount Accumulated Amortization Net\nTrademarks/trade names 5 - 20 $ 15,262 $ (4,589) $ 10,673\nTechnical library 20 400 (181) 219\nCustomer relationships 6 - 15 96,699 (35,662) 61,037\nNon-competition arrangements 5 40 (33) 7\nBacklog and construction contracts 1 4,958 (4,958) -\nTotal $ 117,359 $ (45,423) $ 71,936\nSeptember 30, 2021\nEstimated Useful Lives (in Years) Gross Carrying Amount Accumulated Amortization Net\nTrademarks/trade names 5 - 20 $ 15,262 $ (2,891) $ 12,371\nTechnical library 20 400 (161) 239\nCustomer relationships 6 - 15 96,879 (24,021) 72,858\nNon-competition arrangements 5 40 (25) 15\nBacklog and construction contracts 1 4,957 (4,821) 136\nTotal $ 117,538 $ (31,919) $ 85,619\nFor the years ended September 30, 2022, 2021, and 2020, amortization expense of intangible assets was $13,666, $13,191 and $6,424, respectively. Our estimated future amortization expense for years ending September 30 is as follows:\nYear Ending September 30,\n2023 $ 13,153\n2024 12,810\n2025 12,370\n2026 12,031\n2027 8,631\nThereafter 12,941\nTotal $ 71,936\n18. COMMITMENTS AND CONTINGENCIES\nLegal Matters\nFrom time to time we are a party to various claims, lawsuits and other legal proceedings that arise in the ordinary course of business. We maintain various insurance coverages to minimize financial risk associated with these proceedings. None of these proceedings, separately or in the aggregate, are expected to have a material adverse effect on our financial position, results of operations or cash flows. With respect to all such proceedings, we record reserves when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. We expense routine legal costs related to these proceedings as they are incurred.\nOn June 22, 2021, the United States Department of Labor Wage and Hour Division (the DOL) notified IES Residential, Inc. (IESR), a wholly-owned subsidiary of the Company, that the DOL had commenced an administrative investigation of IESRs compliance with laws regulating employee wage payment. The inquiry concerned record keeping with respect to certain Arizona employees who are paid on a piece rate basis. We entered into a settlement with the DOL in November 2022 resolving this matter. Costs associated with this matter, which will not have a material impact on our results of operations, have been accrued as a liability as of September 30, 2022.\nIn the course of performing work as a subcontractor, from time to time we may be involved in projects which are the subject of contractual disputes between the general contractor and project owner, or between us and the general contractor. In such cases, payment of amounts owed to us by the general contractor may be delayed as contractual disputes are resolved through mediation, arbitration, or litigation. Such disputes may cause us to incur legal fees and other expenses to enforce our contractual rights, and we may not prevail in recovering all amounts to which we believe we are contractually entitled. At September 30, 2022, we had an aggregate $10,451 of trade accounts receivable where payment has been delayed as a result of contractual disputes. We believe that we are contractually entitled to all of these amounts, and intend to vigorously pursue recovery. However, based on uncertainty around the timing and amount of recovery, at September 30, 2022, we have recorded a reserve of $3,095 against these receivables.\nRisk Management\nWe retain the risk for workers compensation, employers liability, automobile liability, construction defects, general liability and employee group health claims, as well as pollution coverage, resulting from uninsured deductibles per accident or occurrence which are generally subject to annual aggregate limits. Our general liability program provides coverage for bodily injury and property damage. In many cases, we insure third parties, including general contractors, as additional insured parties under our insurance policies. Losses are accrued based upon our known claims incurred and an estimate of claims incurred but not reported. As a result, many of our claims are effectively self-insured. Many claims against our insurance are in the form of litigation. At September 30, 2022 and 2021, we had $7,693 and $5,787, respectively, accrued for self-insurance liabilities. We are also subject to construction defect liabilities, primarily within our Residential segment. As of September 30, 2022 and 2021, we had $17 and $8, respectively, reserved for these claims. Because the reserves are based on judgment and estimates, and involve variables that are inherently uncertain, such as the outcome of litigation and an assessment of insurance coverage, there can be no assurance that the ultimate liability will not be higher or lower than such estimates or that the timing of payments will not create liquidity issues for the Company.\nSome of the underwriters of our casualty insurance program require us to post letters of credit as collateral. This is common in the insurance industry. To date, we have not had a situation where an underwriter has had reasonable cause to effect payment under a letter of credit. At September 30, 2022 and 2021, $3,878 and $4,327, respectively, of our outstanding letters of credit was utilized to collateralize our insurance program.\nSurety\nAs of September 30, 2022, the estimated cost to complete our bonded projects was approximately $107,556. We evaluate our bonding requirements on a regular basis, including the terms offered by our sureties. We believe the bonding capacity presently provided by our current sureties is adequate for our current operations and will be adequate for our operations for the foreseeable future. Posting letters of credit in favor of our sureties reduces the borrowing availability under our revolving credit facility.\nOther Commitments and Contingencies\nSome of our customers and vendors require us to post letters of credit, or provide intercompany guarantees, as a means of guaranteeing performance under our contracts and ensuring payment by us to subcontractors and vendors. If our customer has reasonable cause to effect payment under a letter of credit, we would be required to reimburse our creditor for the letter of credit.\nFrom time to time, we may enter into firm purchase commitments for materials, such as copper or aluminum wire, which we expect to use in the ordinary course of business. These commitments are typically for terms of less than one year and require us to buy minimum quantities of materials at specific intervals at a fixed price over the term. As of September 30, 2022, we had commitments of $9,726 outstanding under agreements to purchase copper wire and other materials over the next 12 months in the ordinary course of business.\n19. BUSINESS COMBINATIONS\nWe completed no acquisitions in fiscal year 2022. We completed four acquisitions in fiscal year 2021 for total aggregate cash consideration of $92,463. In November 2020, we acquired both Wedlake Fabricating, Inc., a Tulsa, Oklahoma-based manufacturer of custom generator enclosures that are primarily used by data centers and large commercial and industrial facilities, and K.E.P. Electric, Inc., a Batavia, Ohio-based electrical contractor specializing in the design and installation of electrical systems for single-family housing and multi-family developments. In December 2020, we acquired an 80% interest in Bayonet Plumbing, Heating & Air-Conditioning, LLC, a Hudson, Florida-based provider of residential heating, ventilation and air conditioning (\"HVAC\") and plumbing installation and maintenance services. In May 2021, we acquired an 80% ownership interest in Edmonson Electric, LLC, a Land O'Lakes, Florida-based provider of residential electric, low voltage, and HVAC installation services.\nTotal aggregate cash consideration for these acquisitions was $92,463, of which $10,916 was paid into escrow pending discharge of the acquired companies' indebtedness under the Paycheck Protection Program (\"PPP\") established by the Coronavirus Aid, Relief, and Economic Security Act and implemented by the U.S. Small Business Administration. Loans made under the PPP are eligible to be forgiven if certain criteria are met. During the year ended September 30, 2021, all PPP loans were forgiven and escrow payments were distributed to the respective sellers.\nIn addition to the cash consideration, the purchase price included contingent consideration with respect to the acquisition of Bayonet of up to $4,500 due in December 2023. Amounts to be paid are contingent on earnings achieved over a three year period, and will accrue interest on the $4,500 at a rate of 3%, to be paid quarterly. This contingent liability was valued at $4,074 as of the date of the acquisition.\n20. SUBSEQUENT EVENTS\nOn October 10, 2022, we sold 100% of the membership interests of STR Mechanical, LLC and its subsidiary Technical Services II, LLC (collectively, \"STR\"). As a result, we expect to record a pre-tax gain of approximately $13,000 in the first fiscal quarter of 2023. The disposition of STR, which had operated as part of our Commercial & Industrial segment, will not have a material impact on our ongoing results of operations or financial position.\nIn December 2022, our Board of Directors terminated our previous share repurchase program and authorized a new $40,000 share repurchase program. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nChanges in Internal Control Over Financial Reporting\nThere have not been any changes in the Companys internal control over financial reporting (as such term is defined in Rules 13a-15 and 15d-15 under the Exchange Act) during the fiscal quarter ended September 30, 2022 that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting.\nDisclosure Controls and Procedures\nIn accordance with Rules 13a-15 and 15d-15 under the Exchange Act, we carried out an evaluation, under the supervision and with the participation of management, including our Chief Executive Officer and our Chief Financial Officer, of the effectiveness of our disclosure controls and procedures as of the end of the period covered by this report. Based on this evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of September 30, 2022, to provide reasonable assurance that information required to be disclosed in our reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms. Our disclosure controls and procedures include controls and procedures designed to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting\nManagement, including the Companys Chief Executive Officer and Chief Financial Officer, is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. The Companys internal control system was designed to provide reasonable assurance to the Companys Management and Directors regarding the preparation and fair presentation of published financial statements. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement conducted an evaluation of the effectiveness of internal control over financial reporting based on the Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO 2013 framework). Based on this assessment, our management determined that our disclosure controls and procedures were effective as of September 30, 2022.\nErnst & Young LLP (PCAOB No. 42), an independent registered public accounting firm that has audited the Companys financial statements as of and for the three-year period ended September 30, 2022, has issued a report on their audit of managements internal control over financial reporting, which is included herein. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required to be included in Item 10 of Part III of this Annual Report on Form 10-K is incorporated by reference from the section entitled \"Executive Officers of the Registrant\" in Part I of this Annual Report on Form 10-K and the sections entitled Security Ownership of Certain Beneficial Owners and Management, Report of the Audit Committee and Election of Directors in the Companys definitive Proxy Statement for its 2023 Annual Meeting of Stockholders (the Proxy Statement) to be filed with the SEC no later than January 28, 2023. Item 11. Executive Compensation\nThe information required to be included in Item 11 of Part III of this Annual Report on Form 10-K is incorporated by reference from the section entitled Executive Compensation in the Proxy Statement. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholders Matters\nCertain information required to be included in Item 12 of Part III of this Annual Report on Form 10-K is incorporated by reference from the section entitled Security Ownership of Certain Beneficial Owners and Management in the Proxy Statement.\nSecurities Authorized for Issuance Under Equity Plans\nThe following table provides information as of September 30, 2022 with respect to shares of our common stock that may be issued upon the exercise of options, warrants and rights granted to employees, consultants or members of the Board of Directors under the Companys existing equity compensation plans. For additional information about our equity compensation plans, see Note 12, Stockholders Equity in the notes to our Consolidated Financial Statements set forth in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\nEquity Compensation Plan Information\nPlan Category (a) Number of Securities to be Issued Upon Exercise of Outstanding Options, Warrants and Rights (b) Weighted-Average Exercise Price of Outstanding Options, Warrants and Rights (c) Number of Securities Remaining Available for Future Issuance Under Equity Compensation Plans (Excluding Securities Reflected in Column (a))\nEquity compensation plans approved by security holders 315,961 $ - 713,058 (1)\nEquity compensation plans not approved by security holders 7,000 (2) $ 6.49 -\n(1) Represents shares available for issuance under the Company's 2006 Equity Incentive Plan, as amended and restated effective February 9, 2016 (the \"Amended Plan\"). This plan provides for the granting or awarding of stock options, stock, restricted stock and other forms of equity to employees (including officers), consultants and directors of the Company. This includes 315,961 shares that may be issued pursuant to outstanding performance based phantom stock units (\"PPSUs\") based on achievement of performance metrics, where applicable, and otherwise assuming the target award is met.\n(2) Represents shares issuable upon exercise of outstanding options granted under the Companys 2006 Equity Incentive Plan (as amended and restated as of October 2007), which was in place prior to the Amended Plan. This includes 7,000 options with a weighted-average term of 3.46 years. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required to be included in Item 13 of Part III of this Annual Report on Form 10-K is incorporated by reference from the section entitled Certain Relationships and Related Person Transactions in the Proxy Statement. Item 14. Principal Accountant Fees and Services\nThe information required to be included in Item 14 of Part III of this Form 10-K is incorporated by reference from the section entitled Audit Fees in the Proxy Statement.\nPART IV Item 15. Exhibits, Financial Statement Schedules\n(a) Financial Statements and Supplementary Data, Financial Statement Schedules and Exhibits\nSee Index to Financial Statements under Item 8. Financial Statements and Supplementary Data of this Form 10-K.\n(b) Exhibits\nExhibit\nNo.\nDescription\n3.1 - Second Amended and Restated Certificate of Incorporation of IES Holdings, Inc., as amended by the Certificate of Amendment thereto, effective May 24, 2016 (composite). (Incorporated by reference to Exhibit 3.1 to the Companys Quarterly Report on Form 10-Q filed August 8, 2016)\n3.2 - Certificate of Designations of Series A Junior Participating Preferred Stock (Incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed January 28, 2013)\n3.3 - Certificate of Elimination of Series A Junior Participating Preferred Stock of IES Holdings, Inc., as filed with the Secretary of State of the State of Delaware on May 24, 2021 (Incorporated by reference to Exhibit 3.1 to the Company's Current Report on Form 8-K filed on May 24, 2021)\n3.4 - Amended and Restated Bylaws of IES Holdings, Inc., effective April 28, 2021 (Incorporated by reference to Exhibit 3.3 to the Company's Current Report on Form 8-K filed on April 30, 2021)\n4.1 - Specimen common stock certificate. (Incorporated by reference to Exhibit 4.1 to the Company's Annual Report on Form 10-K filed December 9, 2016)\n4.2 - Registration Rights Agreement, dated May 12, 2006, by and among Integrated Electrical Services, Inc. (n/k/a IES Holdings, Inc.), Tontine Capital Partners, L.P. and certain of its affiliates and Southpoint Master Fund, L.P. (Incorporated by reference to Exhibit 10.5 to the Companys Current Report on Form 8-K filed May 17, 2006)\n4.3 - First Amendment to Registration Rights Agreement, dated September 11, 2007, by and among Integrated Electrical Services, Inc. (n/k/a IES Holdings, Inc.), Tontine Capital Partners, L.P. and certain of its affiliates (Incorporated by reference to Exhibit 10.24 to the Companys Annual Report on Form 10-K filed December 14, 2012)\n4.4 - Description of Registrant's Securities (1)\n10.1 - Agreement of Indemnity, dated May 7, 2010, by Integrated Electrical Services, Inc. (n/k/a IES Holdings, Inc.) and certain of its present and future subsidiaries and affiliates and Chartis Property Casualty Company, Chartis Insurance Company of Canada, American Home Assurance Company, Commerce and Industry Insurance Company, Granite State Insurance Company, Lexington Insurance Company, National Union Fire Insurance Company of Pittsburgh, Pa., New Hampshire Insurance Company and The Insurance Company of the State of Pennsylvania and any and all of their affiliates, subsidiaries, successors and assigns. (Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed May 13, 2010)\n10.2 - Amendment No. 1 to Agreement of Indemnity, dated August 16, 2012, between Integrated Electrical Services, Inc. (n/k/a IES Holdings, Inc.) and certain of its present and future subsidiaries and affiliates and Chartis Property Casualty Company, Chartis Insurance Company of Canada, American Home Assurance Company, Commerce and Industry Insurance Company, Granite State Insurance Company, Lexington Insurance Company, National Union Fire Insurance Company of Pittsburgh, Pa., New Hampshire Insurance Company and The Insurance Company of the State of Pennsylvania, and any and all of their affiliates, subsidiaries, successors and assigns (Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed August 17, 2012)\n10.3 - Agreement of Indemnity, September 9, 2016, by IES Holdings, Inc. and certain of its present and future subsidiaries and affiliates and Everest Reinsurance Company and Everest National Insurance Company, and their affiliated, associated and subsidiary companies, successors and assigns. (Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed September 13, 2016)\n10.4 - General Agreement of Indemnity, July 14, 2017, by IES Holdings, Inc. and certain of its present and future subsidiaries and affiliates and Travelers Casualty and Surety Company of America, St. Paul Fire and Marine Insurance Company, and their affiliated, associated and subsidiary companies, successors and assigns. (Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed July 14, 2017)\n10.5 - Agreement of Indemnity, dated August 17, 2020, by IES Holdings, Inc. and certain of its current and future subsidiaries and affiliates and United States Fire Insurance Company and its affiliated, associated and subsidiary companies, successors and assigns (Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed August 20, 2020)\n10.6 - Third Amended and Restated Credit and Security Agreement, dated April 28, 2022 by and among IES Holdings, Inc., each of the other Borrowers and Guarantors named therein and Wells Fargo Bank, National Association, as Administrative Agent. (Incorporated by reference to Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q filed on April 29, 2022).\n10.7- Amendment No. 1 to Third Amended Restated Credit and Security Agreement, dated April 28, 2022 by and among IES Holdings, Inc., each of the other Borrowers and Guarantors named therein, Wells Fargo Bank, National Association, as Administrative Agent, and Fifth Third Bank, National Association (1)\n10.8 - Sublease Agreement between Tontine Associates, L.L.C. and IES Shared Services, Inc., dated March 29, 2012 (Incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q filed May 15, 2012)\n10.9 - First Amendment between Tontine Associates, L.L.C., IES Shared Services, Inc. and IES Management ROO, LP, dated as of March 31, 2016, to Sublease Agreement between Tontine Associates, L.L.C., and IES Shared Services, Inc., dated March 29, 2012. (Incorporated by reference to Exhibit 10.5 to the Companys Quarterly Report on Form 10-Q filed May 9, 2016)\n10.10 - Second Amendment, dated as of May 1, 2019, to Sublease Agreement, dated as of March 29, 2012 and amended as of March 31, 2016, between Tontine Associates, L.L.C. and IES Management ROO, LP (Incorporated by reference to Exhibit 10.12 to the Company's Quarterly Report on Form 10-Q filed May 6, 2019)\n10.11 - Third Amendment, dated as of November 5, 2019, to Sublease Agreement, dated as of March 29, 2012 and amended as of March 31, 2016 and May 1, 2019, between Tontine Associates, L.L.C. and IES Management ROO, LP (an exhibit to this agreement has been omitted pursuant to Item 601(a)(5) of Regulation S-K. A copy of the omitted exhibit will be furnished to the SEC upon request.) (Incorporated by reference to Exhibit 10.20 to the Company's Annual Report on Form 10-K filed December 6, 2019)\n10.12 - Board Observer Letter Agreement between Tontine Associates, L.L.C. and IES Holdings, Inc., dated December 6, 2018 (Incorporated by reference to Exhibit 10.17 to the Company's Annual Report on Form 10-K filed December 7, 2018)\n10.13- Term Life Insurance Plan (Incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed October 17, 2007)\n10.14 - Integrated Electrical Services, Inc. (n/k/a IES Holdings, Inc.) 2006 Equity Incentive Plan, as amended and restated through 2007 (Incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed October 17, 2007)\n10.15 - Form of Performance-Based Phantom Stock Unit Award Agreement under the Companys 2006 Equity Incentive Plan, as amended and restated through 2007 (Incorporated by reference to Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q filed February 8, 2016)\n10.16 - Integrated Electrical Services, Inc. (n/k/a IES Holdings, Inc.) Amended and Restated 2006 Equity Incentive Plan (as of February 9, 2016) (Incorporated by reference to Exhibit A to the Companys Definitive Proxy Statement filed December 28, 2015)\n10.17 - Form of Phantom Stock Unit Award under the Companys Amended and Restated 2006 Equity Incentive Plan (as of February 9, 2016) (Incorporated by reference to Exhibit 10.4 to the Companys Quarterly Report on Form 10-Q filed May 9, 2016)\n10.18 - Form of Stock Option Award Agreement under the Companys Amended and Restated 2006 Equity Incentive Plan (as of February 9, 2016) (Incorporated by reference to Exhibit 10.3 to the Companys Quarterly Report on Form 10-Q filed May 9, 2016)\n10.19 - Form of Restricted Stock Award Agreement under the Companys Amended and Restated 2006 Equity Incentive Plan (as of February 9, 2016) (Incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q filed May 9, 2016)\n10.20 - Performance-Based Phantom Stock Unit Award Agreement, dated as of June 6, 2016, by and between the Company and Mr. Santoni, under the Companys Amended and Restated 2006 Equity Incentive Plan (as of February 9, 2016) (Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed June 7, 2016)\n10.21 - Performance-Based Phantom Cash Unit Award Agreement, dated as of June 6, 2016, by and between the Company and Mr. Santoni, under the Companys Amended and Restated 2006 Equity Incentive Plan (as of February 9, 2016) (Incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed June 7, 2016)\n10.22 - Amended and Restated 2009 Deferred Compensation Plan (Incorporated by reference to Exhibit 10.34 to the Companys Annual Report on Form 10-K filed December 15, 2008)\n10.23 - Integrated Electrical Services, Inc. (n/k/a IES Holdings, Inc.) Long Term Incentive Plan, as amended and restated. (Incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed September 23, 2009)\n10.24 - IES Holdings, Inc. Executive Severance Benefit Plan, effective April 29, 2021 (Incorporated by reference to Exhibit 10.3 to the Company's Quarterly Report on Form 10-Q filed April 30, 2021)\n10.25 - Form of Phantom Stock Unit Award under the Companys Amended and Restated 2006 Equity Incentive Plan (as of February 9, 2016), dated February 6, 2019 (Incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q filed May 6, 2019)\n10.26 - IES Holdings, Inc. Short-Term Incentive Plan (Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed March, 5, 2019)\n10.27 - IES Holdings, Inc. Long-Term Incentive Plan Annual Grant Program (Incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed March, 5, 2019)\n10.28 - Form of IES Holdings, Inc. Amended and Restated 2006 Equity Incentive Plan Restricted Stock Award Agreement (Incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q filed February 4, 2020)\n10.29 - Form of IES Holdings, Inc. Amended and Restated 2006 Equity Incentive Plan Phantom Stock Unit Award Agreement (Incorporated by reference to Exhibit 10.3 to the Companys Quarterly Report on Form 10-Q filed February 4, 2020)\n10.30 - Form of Cumulative Income Restricted Stock Award Agreement under the Companys 2006 Equity Incentive Plan (as of February 9, 2016), dated March 4, 2019 (Incorporated by reference to Exhibit 10.5 to the Companys Quarterly Report on Form 10-Q filed May 6, 2019)\n10.31 - Long-Term Incentive Plan Annual Grant Program (Incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed December 6, 2019)\n10.32 - Compensation Letter between IES Holdings, Inc. and Mr. Jeffrey L. Gendell as Chief Executive Officer (Incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed October 5, 2020)\n*10.33 - Phantom Stock Unit Award Agreement dated as of December 3, 2021, by and between the Company and Matthew Simmes (Incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on December 3, 2021).\n*10.34 - Phantom Stock Unit Award Agreement dated as of December 1, 2021, by and between the Company and Jeffrey Gendell (Incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed on December 3, 2021).\n21.1 - Subsidiaries of the Registrant (1)\n23.1 - Consent of Ernst & Young LLP (1)\n31.1 - Rule 13a-14(a)/15d-14(a) Certification of Jeffrey L. Gendell, Chief Executive Officer (1)\n31.2 - Rule 13a-14(a)/15d-14(a) Certification of Tracy A. McLauchlin, Chief Financial Officer (1)\n32.1 - Section 1350 Certification of Jeffrey L. Gendell, Chief Executive Officer (2)\n32.2 - Section 1350 Certification of Tracy A. McLauchlin, Chief Financial Officer (2)\n101.INS Inline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document (1)\n101.SCH Inline XBRL Schema Document (1)\n101.LAB Inline XBRL Label Linkbase Document (1)\n101.PRE Inline XBRL Presentation Linkbase Document (1)\n101.DEF Inline XBRL Definition Linkbase Document (1)\n101.CAL Inline XBRL Calculation Linkbase Document (1)\n104 - Cover Page Interactive Data File - the cover page interactive data file does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\n* Management contracts or compensatory plans or arrangements required to be filed herewith pursuant to Item 15(a)(3) of this Annual Report on Form 10-K.\n(1) Filed herewith.\n(2) Furnished herewith.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on December 6, 2022.\nIES HOLDINGS, INC.\nBy: /s/ Jeffrey L. Gendell\nJeffrey L. Gendell\nChief Executive Officer and Chairman of the Board\nPOWER OF ATTORNEY\nKNOW ALL MEN BY THESE PRESENTS, that each of the undersigned officers and directors of IES HOLDINGS, INC. hereby constitutes and appoints Jeffrey L. Gendell and Tracy A. McLauchlin, and each of them individually, as his true and lawful attorneys-in-fact and agents, with full power of substitution, for him and on his behalf and in his name, place and stead, in any and all capacities, to sign, execute and file any or all amendments to this report, with any and all exhibits thereto, and all other documents required to be filed therewith, with the Securities and Exchange Commission or any regulatory authority, granting unto each such attorney-in-fact and agent, full power and authority to do and perform each and every act and thing requisite and necessary to be done in and about the premises in order to effectuate the same, as fully to all intents and purposes as he himself might or could do, if personally present, hereby ratifying and confirming all that said attorneys-in-fact and agents, or either of them, or their or his substitutes or substitute, may lawfully do or cause to be done by virtue hereof.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Jeffrey L. Gendell Chief Executive Officer and Chairman of the Board December 6, 2022\nJeffrey L. Gendell (Principal Executive Officer)\n/s/ Tracy A. McLauchlin\nSenior Vice President, Chief Financial Officer\nand Treasurer December 6, 2022\nTracy A. McLauchlin (Principal Financial Officer)\n/s/ Alison M. Petersen Vice President, Chief Accounting Officer December 6, 2022\nAlison M. Petersen (Principal Accounting Officer)\n/s/ Todd M. Cleveland Director December 6, 2022\nTodd M. Cleveland\n/s/ David B. Gendell\nDirector December 6, 2022\nDavid B. Gendell\n/s/ Joe D. Koshkin\nDirector December 6, 2022\nJoe D. Koshkin\n/s/ Elizabeth D. Leykum\nDirector December 6, 2022\nElizabeth D. Leykum\n/s/ Jennifer A. Baldock\nDirector December 6, 2022\nJennifer A. Baldock"
}