{
    "cik": "105132",
    "company": "WD 40 CO",
    "filing_type": "10-K",
    "filing_date": "2022-10-24",
    "period_of_report": "2022-08-31",
    "sic": "2890",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/105132/0000105132-22-000038-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/105132/000010513222000038/wdfc-20220831x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/105132/0000105132-22-000038.txt",
    "filename": "105132_10K_2022_0000105132-22-000038.htm",
    "content": "Item 1. Business\nOverview\nWD-40 Company is a global marketing organization dedicated to creating positive lasting memories by developing and selling products that solve problems in workshops, factories and homes around the world. The Company was founded in 1953 and is headquartered in San Diego, California.\nFor more than four decades, we sold only one product, WD-40® Multi-Use Product, a maintenance product which acts as a lubricant, rust preventative, penetrant and moisture displacer. Over the last several decades, we have evolved and expanded our product offerings through both research and development activities and through the acquisition of several brands worldwide. As a result, we have built a family of brands and product lines that deliver high quality performance at a good value to our end users.\nWe currently market and sell our products in more than 176 countries and territories worldwide primarily through warehouse club stores, hardware stores, automotive parts outlets, industrial distributors and suppliers, mass retail and home center stores, value retailers, grocery stores, online retailers, farm supply, sport retailers, and independent bike dealers.\nOur sales come from two product groups - maintenance products and homecare and cleaning products. Maintenance products are sold worldwide in markets throughout North, Central and South America, Asia, Australia, Europe, the Middle East and Africa. Homecare and cleaning products are sold primarily in North America, the United Kingdom (U.K.) and Australia.\nOur strategic initiatives are the areas where we will continue to focus our time, talent and resources in future periods. Our strategic initiatives include:\n(i) building a business for the future;\n(ii) attracting, developing and engaging outstanding tribe members;\n(iii) striving for operational excellence;\n(iv) growing WD-40 Multi-Use Product;\n(v) growing WD-40 Specialist product line; and\n(vi) expanding and supporting portfolio opportunities that help us grow.\nOur top priority is to build an enduring business that we will be proud to pass onto the next generation by using our purpose and values as a decision-making filter. Our desired outcome for this top strategic initiative is to further align and integrate our business decisions with Environmental, Social, and Governance (ESG) factors and considerations. We understand that we cannot achieve this without attracting, developing and engaging outstanding people, whom we refer to collectively as a tribe, that strive for operational excellence daily. The principal driver of our growth continues to be taking the blue and yellow can with the little red top, to new users in global markets. We continue to be focused and committed to innovation and renovation of our products.\nWe see innovation and renovation as important factors to the long-term growth of our brands and product lines, and intend to continue to work on future products, product lines, product packaging, and product delivery systems, as well as promotional innovations and renovations in order to expand our product portfolio to help us grow. We are also focused on expanding our current brands in existing markets with new product development. Our product development teams support new product development and current product improvement for our brands. Over the years, our research and development team has made an impact on most of our brands through our innovation activities. Key innovations for our products include, but are not limited to, WD-40 EZ-Reach® Flexible Straw, WD-40 Smart Straw®, WD-40 Trigger Pro®, WD-40 Specialist®, WD-40 BIKE®, 3-IN-ONE RVcare® and 3-IN-ONE® Professional Garage Door Lube.\nOur homecare and cleaning products, particularly those in the U.S., are considered harvest brands which continue to provide positive returns, but are becoming a smaller part of the business as sales of the maintenance products grow with the execution of our strategic initiatives. Although we have evaluated strategic alternatives for certain of our homecare and cleaning products, particularly those in the U.S., we have continued to sell products within these brands but with a reduced level of marketing investment.\nHuman Capital Resources\nOur success is the result of the engagement and commitment of our people, whom we refer to as tribe members. We believe that a tribe is a group of people who come together to feed and defend one another in order to fulfill a common purpose. Our purpose can only be achieved with the efforts of our 583 tribe members who create positive lasting memories for our stakeholders, including our end users as they work to ensure that our products solve problems in factories, workshops, and homes around the world. Our workforce is distributed globally in 15 countries, with approximately 34% in the Americas, 42% in EMEA, 15% in Asia-Pacific, and 9% corporate employees. Women make up approximately 46% of our global tribe. The average tenure of our global tribe is 8 years.\nA foundational strategic initiative is to attract, develop and engage outstanding tribe members. We believe that our ability to attract, develop, engage, and retain outstanding tribe members is the result of our inclusive, purpose-driven, learning focused and values guided culture. This strategic initiative guides our commitment to develop tribe members throughout the organization. One of the primary responsibilities of our leaders, whom we refer to as coaches, is to tailor individual development plans to support the needs of our tribe members to achieve their performance goals. We also offer various internal training programs to our tribe members and encourage attendance at external training programs that allow tribe members to grow from both a technical and leadership standpoint. As a result of the culture we have nurtured and evolved, we have increased employee engagement over time while expanding the size of our tribe to support our growing business. Our most recent biennial global employee engagement survey, which was conducted in January 2022 by an independent third-party, resulted in a very high employee engagement level of 93%.\nConsistently living our company values grants each of us the freedom and agility to make autonomous decisions yet remain aligned as we act in the best interest of all our stakeholders across the globe. Our approach to diversity and inclusion focuses on what unites us: a common purpose as a tribe. Our diverse global tribe, hired primarily within local markets, contains an array of talent and experiences, work collaboratively to solve problems and bring meaning to our work life. Our tribe is comprised of talented and dedicated members, many of whom work together with their international peers in the areas of: marketing, sales, customer service, finance and accounting, legal, information technology, human resources, supply chain and logistics, innovation, R&D, quality, and other technical fields.\nWe believe our culture is a competitive advantage, and we prioritize it as such. Understanding the views, perspectives and experiences of our end-users and tribe members is foundational in maintaining and growing the WD-40 Company brand and business. Our language, norms, artifacts, and traditions result in psychological safety, learning, and goal achievement. This includes a total rewards strategy that ensures each tribe member can sustain their well-being today and into the future.\nThe recent and ongoing global pandemic has reinforced the importance of our priority to maintain the safety, health, and well-being of every tribe member. During various stages of the COVID-19 pandemic, much of our workforce worked remotely, in accordance with public health and safety guidance. The pandemic inspired us to launch what we call Work from Where, a philosophy to support the work-life integration of our global tribe members. This Work from Where philosophy enables our coaches and tribe members to align on where work is completed.\nThe Compensation Committee of our Board of Directors provides oversight of our relevant people-management practices. Our approach to compensation attempts to align the interests of every tribe member with the creation of company value over time. We completed a study in February 2020 to examine gender pay differences to determine if there were occasions of compensation decisions not being based on job-related criteria. This study identified no biased decision-making, as any differences were explainable by job-related criteria. The next study will be completed in calendar year 2023. We will continue to conduct equitable pay studies going forward and will include results from those studies in our future ESG reports. We invite you to review our ESG\nReport (located on our Internet site at www.wd40company.com) for more information about corporate responsibility, our tribe, programs, and initiatives. Nothing on our website shall be deemed incorporated by reference into this Annual Report on Form 10-K.\nProducts\nMaintenance Products\nIncluded in our maintenance products are both multi-purpose maintenance products and specialty maintenance products. These maintenance products are sold worldwide and they provide end users with a variety of product and delivery system options.\nOur signature product is WD-40 Multi-Use Product in the blue and yellow can with the little red top. It is included within the maintenance product category and accounts for a significant majority of our sales. We have various products and product lines which we currently sell under the WD-40 Brand and they are as follows:\nWD-40 Multi-Use Product - The WD-40 Multi-Use Product is a market leader in many countries among multi-purpose maintenance products and is sold as an aerosol spray with various unique delivery systems, a non-aerosol trigger spray and in liquid-bulk form through mass retail stores, hardware stores, warehouse club stores, automotive parts outlets, online retailers and industrial distributors and suppliers. The WD-40 Multi-Use Product is sold worldwide in North, Central and South America, Asia, Australia, Europe, the Middle East and Africa. WD-40 Multi-Use Product has a wide variety of consumer uses in, for example, household, marine, automotive, construction, repair, sporting goods and gardening applications, in addition to numerous industrial applications.\nWD-40 Specialist product line - WD-40 Specialist consists of a line of professional-grade specialty maintenance products that include penetrants, degreasers, corrosion inhibitors, greases, lubricants and rust removers that are aimed at professionals and consumer enthusiasts. The WD-40 Specialist product line is sold primarily in the U.S. and many countries in Europe, as well as parts of Canada, Latin America, Australia and Asia. Within the WD-40 Specialist product line, we also sell bike-specific products across all our segments, motorbike-specific products in Europe, lawn and garden specific products in Australia, and automotive specific products in Asia.\nWe also have the following additional brands which are included within our maintenance products group:\n3-IN-ONE® - The 3-IN-ONE brand consists of multi-purpose drip oil, specialty drip oils, and spray lubricant products, as well as other specialty maintenance products. The multi-purpose drip oil is a lubricant with unique spout options that allow for precise applications to small mechanisms and assemblies, tool maintenance and threads on screws and bolts. 3-IN-ONE Oil is the market share leader among drip oils in many countries. It also has wide industrial applications in such areas as locksmithing, HVAC, marine, farming and construction. In addition to the drip oil line of products, the 3-IN-ONE brand also includes professional-grade aerosol maintenance products, such as 3-IN-ONE RVcare products, 3-IN-ONE Garage Door Lubricant and 3-IN-ONE Lock Dry Lube. The long legacy, brand awareness and high quality of the 3-IN-ONE brand and its established distribution network have enabled these products to gain international acceptance. 3-IN-ONE products are sold primarily in the U.S., Europe, Canada, Latin America and Australia.\nGT85® - The GT85 brand is a multi-purpose bike maintenance product line that consists of professional spray maintenance products and lubricants which are sold primarily in the bike market through the automotive and industrial channels in the United Kingdom. This brand was acquired by our U.K. subsidiary in September 2014 and it has helped build upon our strategy to develop new product categories for WD-40 Specialist and WD-40 BIKE.\nHomecare and Cleaning Products\nWe sell our homecare and cleaning products in certain locations worldwide and they include a portfolio of well-known brands as follows:\n2000 Flushes® - The 2000 Flushes brand is a line of long-lasting automatic toilet bowl cleaners. It includes a variety of formulas, including the Bleach and Blue plus Bleach that has a unique EPA-approved kills bacteria claim. 2000 Flushes is sold primarily in the U.S. and Canada through grocery and mass retail channels as well as through online retailers.\n‎\nSpot Shot® - The Spot Shot brand is sold as an aerosol and a liquid trigger carpet stain and odor eliminator. The brand also includes environmentally friendly products such as Spot Shot Instant Carpet Stain & Odor Eliminator and Spot Shot Pet Instant Carpet Stain & Odor Eliminator, which are non-toxic and biodegradable. Spot Shot products are sold primarily through grocery and mass retail channels, online retailers, warehouse club stores and hardware and home center stores in the U.S., Canada and the United Kingdom. Spot Shot products are sold in the U.K. under the 1001® brand name.\nCarpet Fresh® - The Carpet Fresh brand is a line of room and rug deodorizers sold as powder and aerosol quick-dry foam products. These products are sold primarily through grocery, mass, and value retail channels as well as through online retailers in the U.K. and Australia. Although Carpet Fresh brand products are also sold in the U.S., they are sold by a third-party under a licensing agreement. In the U.K., these products are sold under the 1001 brand name. In Australia, they are sold under the no vac® brand name.\n1001® - The 1001 brand includes carpet and household cleaners and rug and room deodorizers which are sold primarily through mass retail, grocery and home center stores in the U.K.\nLava®/Solvol® - The Lava and Solvol brands consist of heavy-duty hand cleaner products which are sold in bar soap and liquid form through hardware, grocery, industrial, automotive and mass retail channels as well as through online retailers. Lava is sold primarily in the U.S., while Solvol is sold exclusively in Australia.\nX-14® - The X-14 brand is a line of quality automatic toilet bowl cleaners. X-14 is sold primarily in the U.S. through grocery and mass retail channels as well as through online retailers.\nSales and Marketing\nOur sales do not reflect any significant degree of seasonality. However, it is common for our sales to fluctuate from period to period or year to year due to various factors including, but not limited to, new or lost distribution, the number of product offerings carried by a customer and the level of promotional activities and programs being run at customer locations. New or lost distribution occurs when we gain or lose customers, when we gain or lose store count for a customer or when our products are added to new locations within a store or removed from existing locations. From time to time, as part of new product offering launches, we may gain access to entirely new distribution channels. The number of product offerings refers to the number of brands and/or the number of products within each of those brands that our customers offer for sale to end user customers. The level of promotional activities and programs relates to the number of events or volumes of purchases by customers in support of off-shelf or promotional display activities. Changes in any one of these three factors or a combination of them can cause our sales levels to increase or decrease from period to period. It is also common and/or possible that we could lose distribution or product offerings and experience a decrease in promotional activities and programs in one period and subsequently regain this business in a future period. We are accustomed to such fluctuations and manage this as part of our normal business activities.\nManufacturing\nWe outsource our finished goods manufacturing directly or through our marketing distributors to various third-party manufacturers. The Company or its marketing distributors use contract manufacturers in the U.S., Canada, Mexico, Brazil, Argentina, Colombia, the U.K., Italy, Poland, Australia, China, South Korea and India. Although we have definitive minimum purchase obligations included in the contract terms with certain contract manufacturers, when such obligations have been included, they have either been immaterial or the minimum amounts have been such that they are below the volume of goods that we have historically purchased. Supply needs are communicated by us to our contract manufacturers, and we are committed to purchase the products manufactured based on orders and short-term projections, ranging from two months to six months, provided to the contract manufacturers. We also formulate and manufacture concentrate used in our WD-40 products at certain of our own facilities and at third-party contract manufacturers.\nIn addition to the commitments to purchase products from contract manufacturers described above, we may also enter into commitments with other manufacturers from time to time to purchase finished goods and components to support innovation and renovation initiatives and/or supply chain initiatives.\nSources and Availability of Components and Raw Materials\nWe rely on a limited number of third-party contract manufacturers and component suppliers, including single or sole-sourced suppliers, for certain of our raw materials, packaging, product components and other necessary supplies. Where possible and where it makes business sense, we work with secondary or multiple suppliers to qualify additional supply and, historically, we have been able to obtain adequate capacity and raw materials. However, during the COVID-19 pandemic, we have experienced certain constraints, particularly in our Americas supply chain. These challenges include general aerosol-related production capacity constraints primarily due to increased demand at third-party manufacturers along with shortages of certain other raw\nmaterials and freight services. The primary components and raw materials for most of our products include specialty chemicals and aerosol cans, which are manufactured from commodities that are subject to market price fluctuations. The availability of these components and raw materials is affected by a variety of supply and demand factors, including global market conditions, plant capacity utilization, and natural disasters. We have been experiencing input cost inflation that has impacted the cost of certain raw materials and freight services over the last couple of years. Actions that we are taking to increase prices with our customers and cost savings initiatives that are currently underway will mitigate some of these inflationary pressures. Our business results depend on the effective management and remedy of any supply disruptions. We expect these components and raw materials to continue to be readily available in the future and we have developed sourcing alternatives and risk mitigation plans. We expect some level of market constraints to persist in fiscal year 2023, as described above.\nResearch and Development\nWe recognize the importance of innovation and renovation to our long-term success and are focused on and committed to research and new product development activities, primarily in our maintenance product group. Our product development team engages in consumer research, product development, current product improvement and testing activities. The product development team also leverages its development capabilities by partnering with a network of outside resources including our current and prospective outsource suppliers. In addition, the research and development team engages in activities and product development efforts which are necessary to ensure that we meet all regulatory requirements for the formulation of our products. Our research and development team currently conducts global testing at a laboratory facility that we lease in New Jersey.\nCompetition\nThe markets for our products, particularly those related to our homecare and cleaning products, are highly competitive. Our products compete both within their own product classes as well as within product distribution channels, competing with many other products for store placement and shelf space. Competition in international markets varies by country. We are aware of many competing products, some of which sell for lower prices or are produced and marketed by companies with greater financial resources than those of our Company. We rely on the awareness of our brands among consumers, the value offered by those brands as perceived by consumers, product innovation and renovation and our multiple channel distributions as our primary strategies. New products typically encounter intense competition, which may require advertising and promotional support and activities. When or if a new product achieves consumer acceptance, ongoing advertising and promotional support may be required in order to maintain its relative market position.\nTrademarks and Patents\nWe own a number of patents, but rely primarily upon our established trademarks, brand names and marketing efforts, including advertising and sales promotions, to compete effectively. The WD-40 brand, 3-IN-ONE, Lava, Solvol, X-14, 2000 Flushes, Carpet Fresh and no vac, Spot Shot, GT85, and 1001 trademarks are registered or have pending registrations in various countries throughout the world.\nFinancial Information about Foreign and Domestic Operations\nFor detailed information about our foreign and domestic operations, including net sales by reportable segment and long-lived assets by geography, refer to Note 16 - Business Segments and Foreign Operations of the consolidated financial statements, included in Item 15 of this report.\nAccess to SEC Filings\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, are available through the Investors section of our website at www.wd40company.com. These reports can be accessed free of charge from our website as soon as reasonably practicable after we electronically file such materials with, or furnish them to, the Securities and Exchange Commission (SEC). Information contained on our website is not included as a part of, or incorporated by reference into, this report. The SEC also maintains an internet site (www.sec.gov) that contains our reports.\n‎ Item 1A. Risk Factors\nThe following risks and uncertainties, as well as other factors described elsewhere in this report or in other SEC filings by the Company, could adversely affect the Companys business, financial condition and results of operations.\nGlobal economic conditions may negatively impact our financial condition and results of operations.\nAdverse developments in the global economy or a reduction in industrial outputs, consumer spending or confidence could significantly decrease purchases of our products by our customers and end users. Consumer purchases of discretionary items, which could include our maintenance products and homecare and cleaning products, may decline during periods where disposable income is reduced or there is economic uncertainty, and this may negatively impact our financial condition and results of operations. During unfavorable or uncertain economic times, end users may also increase purchases of lower-priced or non-branded products and our competitors may increase their level of promotional activities to maintain sales volumes, both of which may negatively impact our financial condition and results of operations.\nIn addition, our sales and operating results may be affected by uncertain or changing economic and market conditions, including inflation, deflation, prolonged weak consumer demand, political instability, public health crises or other changes that may affect the principal markets, trade channels, and industrial segments in which we conduct our business. Public health crises, including epidemics or pandemics, may affect the principal markets, trade channels, and industrial segments in which we conduct our business. For example, the impact of the ongoing COVID-19 pandemic has caused a significant disruption to global financial markets and supply chains beginning in early calendar year 2020. Certain ongoing direct and indirect impacts of the pandemic have continued to affect recent periods. Supply chains at many companies globally continue to be strained due to increased competition for production line capacity, freight and logistics resources, as well as labor shortages, and shortages of certain materials. These constraints have sometimes impacted the ability of our third-party manufacturers to procure certain raw materials needed to manufacture our products and this has periodically resulted in us not being able to meet the demand for our products from customers and end-users in certain markets. In addition, global supply chain issues and other macroeconomic factors have resulted in an inflationary environment that has led to increased raw material costs and other input costs. The additional costs resulting from this inflationary environment and the constraints in our supply chain and distribution networks may continue to unfavorably impact our gross margin and operating results in future periods for as long as such constraints and challenges exist.\nThe severity and duration of the COVID-19 pandemic, as well as the current inflationary environment, remain uncertain and it is difficult to predict the extent to which these conditions will impact our financial results and operations in future periods. It is also uncertain how changes in the pandemic or inflationary conditions will impact demand from our customers and end-users. If demand from our customers and end-users decreases in future periods, this could adversely impact our financial results.\nIf economic or market conditions in certain of our key global markets deteriorate, we may experience material adverse effects on our business, financial condition and results of operations. Adverse economic and market conditions could also harm our business by negatively affecting the parties with whom we do business, including our customers, retailers, distributors and wholesalers, and third-party contract manufacturers and suppliers. These conditions could impair the ability of our customers to pay for products they have purchased from us. As a result, allowances for doubtful accounts and write-offs of accounts receivable from our customers may increase. In addition, our third-party contract manufacturers and their suppliers may experience financial difficulties or business disruptions that could negatively affect their operations and their ability to supply us with finished goods and the raw materials, packaging, and components required for our products.\nOur financial results could suffer if we are unable to implement and successfully manage our strategic initiatives or if our strategic initiatives do not achieve the intended results.\nThere is no assurance that we will be able to implement and successfully manage our strategic initiatives, including our six core strategic initiatives, or that the strategic initiatives will achieve the intended results. Our six core strategic initiatives include: (i) building a business for the future; (ii) attracting, developing and engaging outstanding tribe members; (iii) striving for operational excellence; (iv) growing WD-40 Multi-Use Product; (v) growing WD-40 Specialist product line; and (vi) expanding and supporting portfolio opportunities that help us grow. An important part of our success depends on our continuing ability to attract, engage and develop highly qualified people. Our future performance depends in significant part on maintaining high levels of employee engagement and nurturing our values and culture. We believe that our company culture is a critical driver of our success and we invest substantial time and resources in building, maintaining and evolving our culture. Any failure to preserve and evolve our culture could negatively affect our future success, including our ability to retain and recruit employees. Our success also depends on the continued service of our executive officers, key employees and other talented people. Further, our ability to successfully execute organizational changes, including succession planning and the transition of our executive officers and key employees, is critical to the continued success of our business. The unexpected loss of the services of key employees or executive officers could have a material adverse effect on our business and prospects. In addition current economic conditions have led to an unusually competitive labor market in which experienced personnel are in high demand. Since the competition for such talent\nis intense there can be no assurance that we can retain our key employees or attract, assimilate and retain employees who are fully engaged in the future. If we are unable to implement and successfully manage our strategic initiatives in accordance with our business plans, our business and financial results could be adversely affected. Moreover, we cannot be certain that the implementation of our strategic initiatives will necessarily advance our business or financial results as intended.\nIf the success and reputation of one or more of our leading brands erodes, our business, financial condition and results of operations could be negatively impacted.\nOur financial success is directly dependent on the success and reputation of our brands, particularly our WD-40 Brand. The success and reputation of our brands can suffer if marketing plans or product development and improvement initiatives, including the release of new products or innovative packaging, do not have the desired impact on the brands image or do not attract customers as intended. Our brands can also be adversely impacted due to the activities and pressures placed on them by our competitors. Further, our business, financial condition and results of operations could be negatively impacted if one of our leading brands suffers damage to its reputation due to real or perceived quality or safety issues. Quality issues, which can lead to large scale recalls of our products, can be due to items such as product contamination, regulatory non-compliance, packaging errors, incorrect ingredients or components in our product or low-quality ingredients in our products due to suppliers delivering items that do not meet our specifications. Product quality issues, which could include lower product efficacy due to formulation changes attributable to regulatory requirements, could also result in decreased customer confidence in our brands and a decline in product quality could result in product liability claims. In addition, our brand value depends on our ability to maintain a positive consumer perception of our corporate integrity and brand culture. Negative claims or publicity involving us, our products, or any of our key employees could damage our reputation and brand image, regardless of whether such claims are accurate. This risk is compounded by the increasing use of social and digital media by consumers and the speed by which information and opinions are shared. If we are unable to anticipate and respond to sudden challenges in the marketplace, trends in the market and changing consumer demands and sentiment, our financial results may be negatively impacted. Although we make every effort to prevent brand erosion and preserve our reputation and the reputation of our brands, there can be no assurance that such efforts will be successful.\nSales unit volume growth may be difficult to achieve.\nOur ability to achieve sales volume growth will depend on our ability to (i) execute certain of our strategic initiatives, (ii) drive growth in new markets by making targeted end users aware of our products and making them easier to buy, (iii) drive growth within our existing markets through innovation, renovation and enhanced merchandising and marketing of our established brands, and (iv) capture market share from our competitors. It is more difficult for us to achieve sales volume growth in developed markets where our products are widely used as compared to in developing or emerging markets where our products have been newly introduced or are not as well known by consumers. In order to protect our existing market share or capture additional market share from our competitors, we may need to increase our expenditures related to promotions and advertising or introduce and establish new products or product lines. In addition, we also periodically implement sales price increases within certain markets or for certain product lines in response to increased costs associated with components, raw materials, manufacturing and distribution. For example, we implemented significant sales price increases during fiscal year 2022 in response to the current inflationary environment that has significantly increased our cost of goods sold. Sales price increases may slow sales volume growth or create declines in volume in the short term as customers and end users adjust to sales price increases or purchase alternative products at lower prices. In addition, the continued prominence and growth of the online retail sales channel has presented both us and our customers that sell our products online with the challenge of balancing online and physical store retailing methods. As a result of the COVID-19 pandemic and changes in end-user preference, some sales are shifting more to these online retail sales channels, and this may present a challenge in our markets where we have a less developed e-commerce business. Although we are engaged in e-commerce with respect to our products, if we are not successful in expanding sales in such alternative retail channels or we experience challenges with operating in such channels, our financial condition and results of operations may be negatively impacted. In addition, a change in the strategies of our existing customers, including shelf simplification, the discontinuation of certain product offerings or the shift in shelf space to competitors products could reduce our sales and potentially offset sales volume increases achieved as a result of other sales growth initiatives. If we are unable to increase market share in our existing product lines by developing product improvements, investing adequately in our existing brands, building usage among new customers, developing, acquiring or successfully launching new products or product line extensions, or successfully penetrating emerging and developing markets and sales channels globally, we may not achieve our sales volume growth objectives.\nCost increases or cost volatility in finished goods, components, raw materials, transportation and other necessary supplies or services could harm or impact our financial condition and results of operations.\nIncreases in the cost of finished goods, which may be driven by higher costs for components, raw materials and third-party manufacturing fees, as well as increases in the cost of transportation and other necessary supplies or services may harm our financial condition and results of operations. Specialty chemicals and aerosol cans, which constitute a significant portion of the\ncosts for many of our maintenance products, have experienced significant price volatility in the past, and may continue to do so in the future. In particular, volatility in the price of oil impacts the cost of specialty chemicals, many of which are indexed to the price of regional crude oil or related refined products. Fluctuations in oil and diesel fuel prices have also historically impacted our cost of transporting our products, compounded recently by increased regulations imposed on the freight industry and additional macroeconomic factors which have resulted in increased freight costs. For example, the COVID-19 pandemic has resulted in global supply chain constraints and transportation disruptions that have led to increased competition for freight resources, higher fees charged by our third-party manufacturers, increased raw material costs and other input costs that have negatively impacted our results of operations. In addition, other macroeconomic factors have recently resulted in an inflationary environment that has compounded these impacts and led to further increases in raw material costs, manufacturing and distribution costs, and other input costs. When there are significant increases in the costs of components, raw materials, third-party manufacturing fees and other expenses, and we are not able to increase the prices of our products or achieve other cost savings to an extent that they will offset such cost increases, our gross margin and operating results will be negatively impacted.\nIn addition, if we increase our sales prices in response to increases in the cost of such raw materials, and those raw material costs later decline significantly, we may not be able to sustain our sales prices at these higher levels. As component and raw material costs are the principal contributors to the cost of goods sold for all of our products, any significant fluctuation in the costs of components and raw materials could have a material impact on the gross margins realized on our products. Sustained increases in the cost of raw materials, components, fees from our third-party contract packagers, transportation and other necessary supplies or services, or significant volatility in such costs, could have a material adverse effect on our financial condition and results of operations.\nReliance on a limited base of third-party contract manufacturers, logistics providers and suppliers of raw materials and components may result in disruption to our business and this could adversely affect our financial condition and results of operations.\nWe rely on a limited number of third-party contract manufacturers, logistics providers and suppliers, including single or sole source suppliers for certain raw materials, packaging, product components and other necessary supplies. We do not have direct control over the management or business of these third parties, except indirectly through terms negotiated in service or supply contracts. As a result, we currently face, and will continue to face, substantial risks associated with our reliance on third-party manufacturers, suppliers, and/or logistics providers, including but not limited to the following areas:\nChanges to the terms of doing business with these providers or the production capacity they allocate to our products;\nDisagreements or the inability to maintain good relationships with these providers, including the failure of these providers to be aligned with our company values;\nFinancial difficulties experienced by these providers;\nConsolidation of third-party packagers, which could result in the acquiring company not being interested in manufacturing our products;\nSignificant disruptions in the production or transportation of our products due to events having regional or global impacts on economic activity, such as the COVID-19 pandemic or extreme weather conditions; or\nSignificant disruptions in the production or transportation of our products due to competition for materials, components, labor or services from third-party vendors.\nIn addition, if we are unable to contract with third-party manufacturers or suppliers for the quantity and quality levels needed for our business, we could experience disruptions in production and our financial results could be adversely affected. In particular, the COVID-19 pandemic, extreme weather events and other macroeconomic factors have resulted in significant supply chain constraints and transportation disruptions that have periodically arisen. Some of the challenges that we have experienced include general aerosol-related production capacity constraints and competition for such capacity by other companies who utilize the same third-party manufacturers for their aerosol production. These challenges have periodically resulted in us not being able to meet the demand for our products by customers and end-users in certain markets where demand for aerosols has, for certain products, outpaced the available production capacity in the region. We have been actively working on various initiatives in partnership with our third-party manufacturers and we are also identifying and onboarding new third-party manufacturers in order to increase the capacity and resilience of our supply chain to meet strong end-user demand. When we onboard new third-party manufacturers, it comes with inherent risks and in the current economic environment, it also potentially comes with higher costs. In addition, actions we have taken to increase inventory levels of certain raw materials and finished goods, given the current challenges within supply chain and increased lead times required by suppliers, has also come with higher transportation, storage and distribution costs. We are not able to estimate the degree of the impact or the costs associated with potential future disruptions within our supply chain and distribution networks as these supply chain issues are being resolved.\n‎\nGlobal operations outside the U.S. expose us to uncertain conditions, foreign currency exchange rate risk and other risks in international markets.\nOur sales outside of the U.S. were approximately 66% of consolidated net sales in fiscal year 2022. As a result, our ability to execute our strategic initiatives will continue to face substantial risks associated with having increased global operations outside the U.S., including:\neconomic or political instability in any of our global markets;\nchallenges associated with conducting business in foreign jurisdictions, including those related to our understanding of and compliance with business laws and regulations in such foreign jurisdictions;\nincreasing tax complexity or changes in tax law associated with operating in multiple tax jurisdictions;\na dispersed employee base and requirements for compliance with varied employment regulations and labor laws, including health and safety regulations and wage and hour laws, in countries outside the U.S.;\nvarying and complex privacy laws in foreign jurisdictions; and\nthe imposition of tariffs or trade restrictions and costs, burdens and restrictions associated with other governmental actions.\nThese risks could have a significant impact on our ability to sell our products on a competitive basis in global markets outside the United States. In addition, continued developments in global political climates have introduced greater uncertainty with respect to tax policies, trade relations, tariffs and government regulations affecting trade between the U.S. and other countries. For example, on February 24, 2022, Russian forces launched significant military action against Ukraine, which has resulted in conflict and disruption in the region. In response to this action taken by Russia, the U.S. and other countries immediately imposed various economic sanctions against Russia. These geopolitical tensions have continued and it is uncertain when conditions will improve or whether additional governmental sanctions will be enacted in future periods. The direct and indirect impacts of this evolving situation and its effect on global economies in future periods are difficult to predict. We suspended selling our products to markets in Russia and Belarus beginning in March 2022, which has had an unfavorable impact on our sales. In addition, we are currently unable to sell our products in Ukraine due to the disruption in the country. As a result of this conflict, commodity markets remain subject to heightened levels of uncertainty, especially as they relate to the price of crude oil, which increased significantly in the immediate aftermath of the sanctions against Russia. Increases in crude oil prices unfavorably impact the cost of our products, as well as the cost of the transportation and distribution of our products. The duration and severity of the recent increases in the price of crude oil are highly unpredictable and may unfavorably impact our cost of goods sold for as long as these conditions exist. These developments, as well as the risks outlined above, could have a material adverse effect on our business, financial condition and results of operations.\nApproximately 49% of our revenues in fiscal year 2022 were generated in currencies other than the U.S. Dollar, which is our reporting currency. In addition, all of our foreign operating subsidiaries have functional currencies other than the U.S. Dollar and our largest subsidiary is located in the U.K. and generates significant sales in Pound Sterling and Euro. As a result, we are exposed to foreign currency exchange rate risk with respect to our sales, expenses, profits, cash and cash equivalents, other assets and liabilities denominated in currencies other than the U.S. Dollar. In particular, our financial results are negatively impacted when the foreign currencies in which our subsidiary offices operate weaken relative to the U.S. Dollar. Although we use instruments to hedge certain foreign currency risks, primarily those associated with our U.K. subsidiary and net assets denominated in non-functional currencies, we are not fully protected against foreign currency fluctuations and, therefore, our reported earnings may be affected by changes in foreign currency exchange rates. Moreover, any favorable impacts to profit margins or financial results from fluctuations in foreign currency exchange rates are likely to be unsustainable over time.\nAdditionally, our global operations outside the U.S. are subject to risks relating to appropriate compliance with legal and regulatory requirements in local jurisdictions, potential difficulties in staffing and managing local operations, potentially higher incidence of fraud or corruption, credit risk of local customers and distributors and potentially adverse tax consequences. As we further develop and grow our business operations outside the U.S., we are exposed to additional complexities and risks, particularly in China and other emerging markets. In many foreign countries, particularly in those with developing economies, business practices that are prohibited by the U.S. Foreign Corrupt Practices Act (FCPA), the U.K. Bribery Act or other applicable anti-corruption laws and regulations may be prevalent. Evolving privacy laws and regulations in Europe, the U.S. and other jurisdictions present additional risks. Any failure to comply with these laws, even if inadvertent, could result in significant penalties or otherwise harm our reputation and business. Although we have adopted policies and contract terms to mandate compliance with these laws, there can be no assurance that all of our employees, contractors and agents will comply with our requirements. Violations of these laws could be costly and disrupt our business, which could have a material adverse effect on our business, financial condition and results of operations.\n‎\nMalfunctions or implementation issues related to the critical information systems that we use for the daily operations of our business, cyberattacks and data breaches could adversely affect our ability to conduct business.\nTo conduct our business, we rely extensively on information technology systems, networks and services, many of which are managed, hosted and provided by third-party service providers. We cannot guarantee that our security measures will prevent cyberattacks resulting in breaches of our own or our third-party service providers databases and systems. Techniques used in these attacks change frequently and may be difficult to detect for periods of time. Although we have policies and procedures in place governing (i) the timely investigation of cybersecurity incidents, (ii) the timely disclosure of any related material nonpublic information resulting from a material cybersecurity incident, and (iii) the safeguarding against insider trading of directors, officers, and other corporate insiders between the period of investigation and the public disclosure of such an incident; cybersecurity incidents themselves, such as the release of sensitive data from our databases and systems, could adversely affect our business, financial condition and results of operations. The increasing number of information technology security threats and the development of more sophisticated cyberattacks, including ransomware, pose a potential risk to the security of our information technology systems and networks, as well as to the confidentiality, availability and integrity of our data. In addition, the increased use of remote work infrastructures also increases the possible cybersecurity risks. Further, such incidents could also materially increase the costs that we already incur to protect against such risks. While we maintain cyber insurance, our coverage may not be adequate for liabilities or costs actually incurred, and we cannot be certain that any insurer will not deny coverage of a future claim. We also cannot be certain that such insurance will continue to be available to us on economically reasonable terms, or at all, in future periods.\nIn addition, system failure, malfunction or loss of data that is housed in the Companys or its third-party service providers critical information systems could disrupt our ability to timely and accurately process transactions and produce key financial reports, including information on our operating results, financial position and cash flows. Our information systems could be damaged or cease to function properly due to a number of other reasons as well, including catastrophic events and power outages. Although we have certain business continuity plans in place to address such service interruptions, there is no guarantee that these business continuity plans will provide alternative processes in a timely manner. As a result, we may experience interruptions in our ability to manage our daily operations and this could adversely affect our business, financial condition and results of operations.\nThe information system that the U.S. office uses for its business operations is a market-specific application that is not widely used by other companies. This system is also used by three of our other regional offices: our Canada, Australia and Malaysia offices. The company that owns and supports this application may not be able to provide the same level of support as that of larger information systems. If the company that owns and supports this application in the U.S. were to cease its operations or were unable to provide continued support for this application, it could adversely affect our daily operations or our business, financial condition and results of operations.\nManagement determined that it is appropriate to replace this information system so we are currently in the process of implementing a new information system that will be used at all of these offices. We are currently configuring the system based on our design work to date and have been performing various stages of testing. We are also in the process of determining our implementation rollout strategy and timing for the offices transitioning to this new information system. This information system, along with other integrated software platforms, will be used to process all of the daily transactions and to produce key financial reports for all of these offices. If we encounter difficulties in completing this critical information system implementation, or if the implementation takes longer than intended, we may experience interruptions in our ability to manage our daily operations and report financial results and we may experience significant incremental costs, which could adversely affect our business, financial condition and results of operations.\nOur ability to achieve our environmental, social and governance and sustainability initiatives are subject to emerging risks and the outcomes may not achieve the anticipated benefits or align with new regulations and stakeholders expectations.\nThere has been an increasing focus from stakeholders and regulators related to environmental, social and governance (ESG) matters across all industries in recent years. ESG standard setting and stakeholder expectations continue to evolve. Criteria used to evaluate ESG practices and metrics may change rapidly in future periods, which could result in increased expectations of public companies and may cause us to undertake costly initiatives to satisfy any new requirements. Non-compliance with these emerging regulations or a failure to address stakeholder and societal expectations may result in potential cost increases, litigation, fines, penalties, production and sales restrictions, brand or reputational damage, loss of customers, failure to retain and attract talent, lower valuation and higher investor activism activities.\nThe increased attention directed towards publicly traded companies surrounding ESG matters includes the recent release of proposed rules by the SEC that would require companies to enhance and standardize disclosures related to climate change, specifically those associated with physical risks and transitional risks. Physical risks include acute risks associated with extreme weather events or chronic risks associated with gradual shifts in climate or weather. Transition risks are the risks that may arise from the adoption of climate-related regulatory policies, including those that may be necessary to achieve the national climate\ngoals in the United States and other countries, or risks associated with changing stakeholder expectations and demands. Our first strategic initiative, building a business for the future, was developed to further align and integrate our business decisions with ESG factors and considerations and we anticipate achieving compliance with current and future ESG expectations and standards, as well as ESG expectations from our stakeholders. We are expecting to publish our next ESG Report in November 2022, which will include certain ESG and sustainability objectives. However, any failure or perceived failure, whether or not valid, to pursue and fulfill our ESG initiatives and objectives or to satisfy various ESG reporting standards timely could increase the risk of litigation and this could negatively impact our financial condition and results of operations.\nGovernment laws and regulations, including environmental laws and regulations, could result in material costs or otherwise adversely affect our financial condition and results of operations.\nThe manufacturing, chemical composition, packaging, storage, distribution and labeling of our products and the manner in which our business operations are conducted must comply with an extensive array of federal, state and international laws and regulations. If we are not successful in complying with the requirements of all such regulations, we could be fined or other actions could be taken against us by the applicable governing body, including the possibility of a required product recall. Any such regulatory action could adversely affect our financial condition and results of operations. It is also possible that governments and regulatory agencies will increase regulation, including the adoption of further regulations relating to the transportation, storage or use of certain chemicals, to enhance homeland security or protect the environment and such increased regulation could negatively impact our ability to obtain raw materials, components and/or finished goods or could result in increased costs.\nSome of our products have chemical compositions that are controlled by various state, federal and international laws and regulations that are subject to change. We are required to comply with these laws and regulations and we seek to anticipate regulatory developments that could impact our ability to continue to produce and market our products. We invest in research and development to maintain product formulations that comply with such laws and regulations. There can be no assurance that we will not be required to alter the chemical composition of one or more of our products in a way that will have an adverse effect upon the products efficacy or marketability. A delay or other inability of the Company to complete product research and development and successfully reformulate our products in response to any such regulatory requirements could have a material adverse effect on our business, financial condition and results of operations.\nWe are subject to an SEC rule mandated by Section 1502 of the Dodd-Frank Wall Street Reform and Consumer Protection Act that requires management to conduct annual due diligence to determine whether certain minerals and metals, known as conflict minerals, are contained in our products and, if so, whether they originate from the Democratic Republic of Congo or adjoining countries. Although we have concluded that our current products do not contain such conflict minerals in our annual evaluations to date, if we were to conclude that these materials exist within our products in future periods, we may have difficulty verifying the origin of such materials for purposes of disclosures required by the SEC rules.\nWe are also subject to numerous environmental laws and regulations that impose various environmental controls on our business operations, including, among other things, the discharge of pollutants into the air and water, the handling, use, treatment, storage and clean-up of solid and hazardous wastes and the investigation and remediation of soil and groundwater affected by hazardous substances. Such laws and regulations may otherwise relate to various health and safety matters that impose burdens upon our operations. These laws and regulations also impose strict, retroactive and joint and several liability for the costs of, and damages resulting from, cleaning up current sites, past spills, disposals and other releases of hazardous substances. We believe that our expenditures related to environmental matters have not had, and are not currently expected to have, a material adverse effect on our financial condition, results of operations or cash flows. However, the environmental laws under which we operate are complicated, often become increasingly more stringent and may be applied retroactively. Accordingly, there can be no assurance that we will not be required to incur additional expenditures to remain in or to achieve compliance with environmental laws in the future or that any such additional expenditures will not have a material adverse effect on our business, financial condition or results of operations.\nIn addition, certain countries and other jurisdictions in which we operate have data protection laws that impose strict regulations on the Company. Non-compliance with any of these regulations may result in significant penalties being imposed on us. Many international and local governmental authorities are considering increased legislative and regulatory requirements concerning protection of personal data which may impact us and increase our costs to comply with these requirements in future periods.\nAdditional laws and regulations require that we carefully manage our supply chain for the production, distribution and sale of goods. Our failure to comply with any of these regulations or our inability to adequately predict the manner in which these local regulations are interpreted and applied to our business by the applicable enforcement agencies could have a materially adverse effect on our business, financial condition and results of operations.\n‎\nFailure to maximize or to successfully assert our intellectual property rights or infringement by the Company on the intellectual property rights of others could impact our competitiveness or otherwise adversely affect our financial condition and results of operations.\nWe rely on trademark, trade secret protection, patent and copyright laws to protect our intellectual property rights. Although we maintain a global enforcement program to protect our intellectual property rights, there can be no assurance that these intellectual property rights will be maximized or that they can be successfully asserted. If other companies or entities infringe on our intellectual property rights or take part in counterfeiting activities, they may dilute the value of our brands in the marketplace, which could diminish the value that consumers associate with our brands and harm our sales.\nThere is a risk that we will not be able to obtain and protect our own intellectual property rights or, where appropriate, license intellectual property rights necessary to support new product introductions or product lines dependent upon such licensed rights. We cannot be certain that these rights, if obtained, will not be withdrawn, invalidated, circumvented or challenged in the future, and we could incur significant costs in connection with legal actions to defend and preserve our intellectual property rights. In addition, even if such rights are obtained in the U.S., the laws of some of the other countries in which our products are or may be sold might not protect intellectual property rights to the same extent as the laws of the United States, or they may be difficult to enforce. Our failure to protect or successfully assert our intellectual property rights or failure to protect our other proprietary information could make us less competitive and this could have a material adverse effect on our business, financial condition and results of operations.\nTrade secret protection, particularly for our most valuable product formulation for the WD-40 Multi-Use Product, requires specific agreements, policies and procedures to assure the secrecy of information classified as a trade secret. If such agreements, policies and procedures are not effective enough to maintain the secrecy of our trade secrets or if chemical disclosure regulations do not allow for continued protection of essential elements of our trade secret formulations, the loss of trade secret protection could have an adverse effect on our business, financial condition or results of operations.\nIf we are found to have violated the trademark, copyright, patent or other intellectual property rights of others, such a finding could result in the need to cease the use of a trademark, trade secret, copyrighted work or patented invention in our business and an obligation to pay a substantial amount for past infringement. It could also be necessary to pay a substantial amount in the future if the holders of such rights are willing to permit us to continue to use the intellectual property rights. Either having to cease use or pay such amounts could make the Company less competitive and could have a material adverse impact on our business, financial condition and results of operations.\nOur operating results and financial performance may not meet expectations, which could adversely affect our stock price.\nWe cannot be sure that our operating results and financial performance, which include sales, net income, earnings per common share, gross margin and cash flows, will meet expectations. If our assumptions and estimates are incorrect or if we do not achieve all of our key goals or strategic initiatives, then our actual performance could vary materially from our internal expectations and those of the market. Failure to meet or exceed these expectations could cause the market price of our stock to decline. In addition, the trading market for our common stock is influenced by the research and reports that securities analysts, industry analysts and other third parties publish about us or our business. We do not have any control over these reports or analysts. If securities or industry analysts adversely change their recommendations regarding our common stock or if any of these analysts cease coverage of us in their reports, our stock price and trading volume could decline. Our operating results and financial performance may be negatively influenced by a number of factors, many of which are discussed in this Item 1A Risk Factors.\nIn addition, sales volume growth, whether due to acquisitions or internal growth, can place burdens on management resources and financial controls that, in turn, can have a negative impact on our operating results and financial condition. To some extent, we plan our expense levels in anticipation of future revenues. If actual revenues fall short of these expectations, operating results may be adversely affected by reduced operating margins or operating profits due to actual expense levels that are higher than might otherwise have been appropriate.\nWe face competition in our markets which could lead to reduced sales and profitability.\nWe encounter competition from similar and alternative products, many of which are produced and marketed by major national or multinational companies. In addition, we frequently discover products in certain markets that are counterfeit reproductions of our WD-40 products as well as products otherwise bearing an infringing trade dress. The availability of counterfeits and other infringing products, particularly in China and other emerging markets, could adversely impact our sales and potentially damage the value and reputation of our brands.\n‎\nOur products generally compete on the basis of product performance, brand recognition, price, quality or other benefits to consumers and meeting end users needs. Advertising, promotions, merchandising and packaging also have a significant impact on consumer purchasing decisions. A newly introduced consumer product, whether improved or recently developed, usually encounters intense competition requiring substantial expenditures for advertising, sales and consumer promotion. If a product gains consumer acceptance, it normally requires continued advertising, promotional support and product improvements in order to maintain its relative market position.\nSome of the competitors for our homecare and cleaning products are larger and have financial resources greater than ours. These competitors may be able to spend more aggressively on advertising and promotional activities, introduce competing products more quickly and respond more effectively to changing business and economic conditions than us.\nCompetitive activity may require us to increase our investment in marketing or reduce our sales prices and this may lead to reduced profit margins, a loss of market share or loss of distribution, each of which could have a material adverse effect on our business, financial condition and results of operations. There can be no assurance that the Company will be able to compete successfully against current and future competitors or that competitive pressures faced by us or the infringement of our products and brands will not have a material adverse effect on our business, financial condition and results of operations.\nDependence on key customers could adversely affect our business, financial condition and results of operations.\nWe sell our products through a network of domestic and international mass retail, trade supply and consumer retailers as well as through industrial distributors and suppliers. The retail industry has historically been the subject of consolidation, and as a result, the development of large chain stores has taken place. Today, the retail channel is comprised of several of these large chain stores that capture the bulk of the market share. Since many of our customers have been part of consolidations in the retail industry, these limited customers account for a large percentage of our net sales. Although we expect that a significant portion of our revenues will continue to be derived from this limited number of customers, there was no individual customer that contributed to more than 10% of our consolidated net sales in fiscal year 2022. However, changes in the strategies of our largest customers, including shelf simplification, a reduction in the number of brands they carry or a shift in shelf space to private label or competitors products, may harm our sales. The loss of, or reduction in, orders from any of our most significant customers could have a material adverse effect on our brand values, business, financial condition and results of operations. Large customers may seek price reductions, added support or promotional concessions. If we agree to such customer demands and/or requests, it could negatively impact our ability to maintain existing profit margins.\nIn addition, our business is based primarily upon individual sales orders, and we typically do not enter into long-term contracts with our customers. Accordingly, these customers could reduce their purchasing levels or cease buying products from us at any time and for any reason. We are also subject to changes in customer purchasing patterns or the level of promotional activities. These types of changes may result from changes in the manner in which customers purchase and manage inventory levels, or display and promote products within their stores. Other potential factors such as customer disputes regarding shipments, fees, merchandise condition or related matters may also impact operating results. If we cease doing business with a significant customer or if sales of our products to a significant customer materially decrease, our business, financial condition and results of operations may be harmed.\nWe may not successfully develop, introduce and/or establish new products and line extensions.\nOur future performance and growth depend, in part, on our ability to successfully develop, introduce and/or establish new products as both brand extensions and/or line extensions. We cannot be certain that we will successfully achieve those goals. We compete in several product categories where there are frequent introductions of new products and line extensions and such product introductions often require significant investment and support. Our ability to understand end user needs and preferences is key to maintaining and improving the competitiveness of our product offerings. The development and introduction of new products, as well as the renovation of current products and product lines, require substantial and effective research, development and marketing expenditures, which we may be unable to recoup if the new or renovated products do not gain widespread market acceptance. There are inherent risks associated with new product development and marketing efforts, including product development or launch delays, product performance issues during development, changing regulatory frameworks that affect the new products in development and the availability of key raw materials included in such products. These inherent risks could result in the failure of new products and product line extensions to achieve anticipated levels of market acceptance, additional costs resulting from failed product introductions and the product not being first to market. As we continue to focus on innovation and renovation of our products, our business, financial condition or results of operations could be adversely affected in the event that we are not able to effectively develop and introduce new or renovated products and line or brand extensions.\n‎\nChanges in marketing distributor relationships that are not managed successfully by us could result in a disruption in the affected markets.\nWe distribute our products throughout the world in one of two ways: the direct distribution model, in which products are sold directly by us to wholesalers and retailers in the U.S., Canada, Mexico, Australia, China, the U.K. and a number of other countries, including those throughout Europe; and the marketing distributor model, in which products are sold to marketing distributors who in turn sell to wholesalers and retailers. The marketing distributor model is generally used in countries where we do not have direct Company-owned operations. Instead, we partner with local companies who perform the sales, marketing and distribution functions. We invest time and resources into these relationships. Should our relationship with a marketing distributor change or terminate, our sales within such a marketing distributors territory could be adversely impacted until such time as a suitable replacement can be found and our key marketing strategies are implemented. There is a risk that changes in such marketing distributor relationships, including a change in key marketing distributor personnel or a transition to the direct distribution model, if not managed successfully, could result in a disruption in the affected markets and that such a disruption could have a material adverse effect on our business, financial condition and results of operations. Additionally, in some countries, local laws may require substantial payments to terminate existing marketing distributor relationships, which could also have a material adverse effect on our business, financial condition and results of operations.\nProduct liability claims and other litigation and/or regulatory action could adversely affect our sales and operating results.\nWhile we make every effort to ensure that the products we develop and market are safe for consumers and comply with all applicable regulations, the use of our products may expose us to liability claims resulting from such use and potential enforcement actions, including the risk of recall. Claims could be based on allegations that, among other things, our products are improperly labeled or that statements we make on our labels are not accurate, contain contaminants, provide inadequate instructions regarding their use or inadequate warnings concerning their use or interactions with other substances. Product liability claims could result in negative publicity that could harm our sales and operating results. We maintain product liability insurance to protect us from loss attributable to product liability claims but the extent of such loss could exceed available limits of insurance or could arise out of circumstances under which such insurance coverage would be unavailable. Other business activities may also expose us to litigation risks, including risks that may not be covered by insurance such as contract disputes. If successful claims are asserted by regulatory agencies or third parties against us for non-compliance or uninsured liabilities or liabilities in excess of applicable limits of insurance coverage, our business, financial condition and results of operations may be adversely affected. In addition, if one of our products was determined to be defective, we could be required to recall the product, which could result in adverse publicity, loss of revenues and significant expenses.\nAdditionally, our products may be associated with competitor products or other products in the same category that may be alleged to have caused harm to consumers. As a result of this association, we may be named in unwarranted legal actions. The potential costs to defend such claims may materially affect our business, financial condition and results of operations.\nResolution of income tax matters may impact our financial condition and results of operations.\nSignificant judgment is required in determining our effective income tax rate and in evaluating tax positions, particularly those related to uncertain tax positions. We provide for uncertain tax positions when such tax positions do not meet the recognition thresholds or measurement standards prescribed by the accounting standard for uncertain tax positions. Changes in uncertain tax positions or other adjustments resulting from tax audits and settlements with taxing authorities, including related interest and penalties, impact our effective tax rate. When particular tax matters arise, a number of years may elapse before such matters are audited and finally resolved. Favorable or unfavorable resolution of such matters would be recognized as a reduction to our effective tax rate in the year of resolution. Any resolution of a tax matter may require the adjustment of tax assets or tax liabilities or the use of cash in the year of resolution. For additional information on such matters, see Part IV - Item 15, Exhibits, Financial Statement Schedules Note 13 - Income Taxes, included in this report.\nChanges in tax rules may also materially affect, either adversely or favorably, our future financial results or the way management conducts its business. For example, on August 16, 2022, President Biden signed the Inflation Reduction Act (the IRA) into law. Although we do not at this time foresee this new law having a material impact on the Company, the new law is under evaluation as to how it might affect the Companys future results and decisions of management. Previously, on December 22, 2017, the Tax Cuts and Jobs Act (the Tax Act) was signed into law and became effective beginning January 1, 2018. The Tax Act significantly changed U.S. tax law and tax rates, as well as mandated the application of a one-time toll tax on unremitted foreign earnings, among other things.\nInternational tax changes that occur in locations where we operate can also materially affect future financial results or operations. For example, we have significant operations in Europe that are subject to income tax rates and laws in multiple jurisdictions. A significant portion of European income is subject to taxation in the U.K as a result of our European subsidiary being\nheadquartered in the United Kingdom. In June of 2021 an Act of Parliament received Royal Assent, changing the U.K. corporate tax rate from 19% to 25% effective on April 1, 2023 and this change may have a material impact on our future financial results.\nIn addition, we are required to make assertions on whether our foreign subsidiaries will invest their undistributed earnings indefinitely and these assertions are based on the capital needs of the foreign subsidiaries. Generally, unremitted earnings of our foreign subsidiaries are not considered to be indefinitely reinvested. However, there are exceptions regarding specific statutory remittance restrictions imposed on our China subsidiary. Costs associated with repatriating unremitted foreign earnings, including U.S. state income taxes and foreign withholding taxes, are immaterial to our consolidated financial statements. For additional information on income tax matters, see Part IV-Item 15, Exhibits, Financial Statement Schedules Note 13 - Income Taxes, included in this report.\nAlthough many impacts of the Tax Act have been favorable for us both in the near term and long term and the IRA may have a negligible effect, the Tax Act and IRA have also authorized the U.S. Department of the Treasury to issue regulations with respect to the new provisions. We cannot predict how subsequent changes in the Tax Act, and IRA, regulations, or other guidance issued under each, including conforming or non-conforming state tax rules, might affect our business, financial condition and results of operations. In addition, there can be no assurance that U.S. tax laws, including the corporate income tax rate, will not undergo significant additional changes in the future.\nOur business development activities may not be successful.\nWe may increase growth through business development activities such as acquisitions, joint ventures, licensing and/or other strategic partnerships in the U.S. and internationally. However, if we are not able to identify, acquire and successfully integrate acquired products or companies or successfully manage joint ventures or other strategic partnerships, we may not be able to maximize these opportunities. The failure to properly manage business development activities because of difficulties in the assimilation of operations and products, the diversion of managements attention from other business concerns, the loss of key employees or other factors could have a material adverse effect on our business, financial condition and results of operations. In addition, there can be no assurance that our business development activities will be profitable at their inception or that they will achieve sales levels and profitability that justify the investments made.\nFuture acquisitions, joint ventures or strategic partnerships could also result in the incurrence of debt, potentially dilutive issuances of equity securities, contingent liabilities, amortization expenses related to certain intangible assets, unanticipated regulatory complications and/or increased operating expenses, all of which could adversely affect our results of operations and financial condition. In addition, to the extent that the economic benefits associated with any of our business development activities diminish in the future, we may be required to record impairments to goodwill, intangible assets or other assets associated with such activities, which could also adversely affect our business, financial condition and results of operations.\nGoodwill and intangible assets are subject to impairment risk.\nIn accordance with the authoritative accounting guidance on goodwill and intangibles, we assess the potential impairment of our existing goodwill during the second quarter of each fiscal year and otherwise when events or changes in circumstances indicate that an impairment condition may exist. We also assess our definite-lived intangible assets for potential impairment when events and circumstances indicate that the carrying amount of the asset may not be recoverable or its estimated remaining useful life may no longer be appropriate. Indicators such as underperformance relative to historical or projected future operating results, changes in our strategy for our overall business or use of acquired assets, unexpected negative industry or economic trends, decline in our stock price for a sustained period, decreased market capitalization relative to net book values, unanticipated technological change or competitive activities, loss of key distribution, change in consumer demand, loss of key personnel and acts by governments and courts may signal that an asset has become impaired.\nThe assessment for possible impairment of our goodwill and intangible assets requires management to make judgments on a number of significant estimates and assumptions, including macroeconomic conditions, overall category growth rates, sales growth rates, cost containment and margin expansion and expense levels for advertising and promotions and general overhead, all of which must be developed from a market participant standpoint. We may be required to record a significant charge in our consolidated financial statements during the period in which any impairment of our goodwill or intangible assets is identified and this could negatively impact our financial condition and results of operations. Changes in management estimates and assumptions as they relate to valuation of goodwill and intangible assets could affect our financial condition or results of operations in the future. Our review of events and circumstances during fiscal year 2022 included consideration of the ongoing COVID-19 pandemic, the current inflationary environment, and the impact of Russian military action against Ukraine. For additional information, see Part IV - Item 15, Exhibits, Financial Statement Schedules Note 5 - Goodwill and Other Intangible Assets, included in this report.\n‎\nWe may also divest certain of our assets, businesses or brands that do not align with our strategic initiatives. Any divestiture could negatively impact our profitability as a result of losses that may result from such a sale, the loss of sales and operating income or a decrease in cash flows subsequent to the divestiture. We may also be required to recognize impairment charges as a result of a divestiture.\nWe may not have sufficient cash to service our indebtedness or to pay cash dividends.\nOur debt consists of fixed rate senior notes and a revolving credit facility. We use income from operations to make interest and principal payments required by the terms of our borrowing agreements. In addition, our borrowing agreements include covenants to maintain certain financial ratios and to comply with other financial terms, conditions and covenants. Also, we have historically paid out a large part of our earnings to stockholders in the form of regular quarterly cash dividends.\nWe may incur substantial debt in the future for general business and development activities. In addition, we may continue to use available cash balances to execute share repurchases under approved share buy-back plans. To the extent that we are required to seek additional financing to support certain of these activities, such financing may not be available in sufficient amounts or on terms acceptable to us. If we are unable to obtain such financing or to service our existing or future debt with our operating income, or if available cash balances are affected by future business performance, unstable global economic conditions, liquidity, capital needs, alternative investment opportunities or debt covenants, we could be required to reduce, suspend or eliminate our dividend payments to our stockholders. We may also elect to suspend share repurchases depending on available cash balances or concerns that we may have on future cash balances. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nAmericas\nWe own and occupy an office located in San Diego, California which houses both corporate employees and employees in our Americas segment. We also lease a regional sales office in Miami, Florida, a research and development office and laboratory in Pine Brook, New Jersey and office space in Toronto, Ontario, Canada and Monterrey, Nuevo León, Mexico.\nEMEA\nWe own and occupy an office as well as a plant facility located in Milton Keynes, United Kingdom. In addition, we lease space for our branch offices in Germany, France, Italy, Spain, Portugal and the Netherlands.\nAsia-Pacific\nWe lease office space in Epping, New South Wales, Australia; Shanghai, China; and Kuala Lumpur, Malaysia. Item 3. Legal Proceedings\nThe information required by this item is incorporated by reference to the information set forth in Item 15 of Part IV, Exhibits, Financial Statement Schedules Note 12 - Commitments and Contingencies, in the accompanying notes to the consolidated financial statements included in this report. Item 4. Mine Safety Disclosures\nNot applicable.\n‎\nPART II Item 5. Market For Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock is traded on the NASDAQ Global Select Market under the trading symbol WDFC. On October 17, 2022, the last reported sales price of our common stock on the NASDAQ Global Select Market was $173.52 per share, and there were 13,579,926 shares of common stock outstanding held by approximately 570 holders of record.\nDividends\nWe have historically paid regular quarterly cash dividends on our common stock. In December 2021, the Board of Directors declared an 8% increase in the regular quarterly cash dividend, increasing it from $0.72 per share to $0.78 per share. On October 11, 2022, our Board of Directors declared a cash dividend of $0.78 per share payable on October 31, 2022 to shareholders of record on October 21, 2022.\nOur Board of Directors presently intends to continue the payment of regular quarterly cash dividends on our common stock. Our ability to pay dividends could be affected by future business performance, liquidity, capital needs, alternative investment opportunities and debt covenants.\nPurchases of Equity Securities By the Issuer and Affiliated Purchasers\nOn April 8, 2020, we elected to suspend repurchases under our previously approved share buy-back plan, which subsequently expired on August 31, 2020. We made this election in order to preserve cash while we continued to monitor the long-term impacts of the COVID-19 pandemic. No repurchase transactions were made during fiscal year 2021.\nOn October 12, 2021, our Board of Directors approved a new share buy-back plan. Under the plan, which became effective on November 1, 2021, we are authorized to acquire up to $75.0 million of our outstanding shares through August 31, 2023. The timing and amount of repurchases are based on terms and conditions as may be acceptable to our Chief Executive Officer and Chief Financial Officer, subject to present loan covenants and in compliance with all laws and regulations applicable thereto. Item 6. Selected Financial Data\nReserved pursuant to amendments in SEC Release No. 33-10890 that eliminate the selected financial data requirements under Item 301 of Regulation S-K. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nManagements Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is designed to provide the reader of our financial statements with a narrative from the perspective of management on our financial condition, results of operations, liquidity and certain other factors that may affect future results. This MD&A includes the following sections: Overview, Highlights, Results of Operations, Performance Measures and Non-GAAP Reconciliations, Liquidity and Capital Resources, Critical Accounting Policies and Estimates, and Recently Issued Accounting Standards. The MD&A is provided as a supplement to, and should be read in conjunction with, our audited consolidated financial statements and the related notes included in Item 15 of this report.\nUse of Non-GAAP Constant Currency\nIn order to show the impact of changes in foreign currency exchange rates on our results of operations, we have included constant currency disclosures, where necessary, in the Overview and Results of Operations sections which follow. Constant currency disclosures represent the translation of our current fiscal year revenues, expenses and net income from the functional currencies of our subsidiaries to U.S. Dollars using the exchange rates in effect for the corresponding period of the prior fiscal year. Results on a constant currency basis are not in accordance with accounting principles generally accepted in the United States of America (non-GAAP) and should be considered in addition to, not as a substitute for, results prepared in accordance with GAAP. We use results on a constant currency basis as one of the measures to understand our operating results and evaluate our performance in comparison to prior periods in order to enhance the visibility of the underlying business trends, excluding the impact of translation arising from foreign currency exchange rate fluctuations. Management believes this non-GAAP financial measure provides investors with additional financial information that should be considered when assessing our underlying business performance and trends. However, reference to constant currency basis should not be considered in isolation or as a substitute for other financial measures calculated and presented in accordance with U.S. GAAP.\nOverview\nThe Company\nWD-40 Company, based in San Diego, California, is a global marketing organization dedicated to creating positive lasting memories by developing and selling products that solve problems in workshops, factories and homes around the world. We own a wide range of well-known brands that include maintenance products and homecare and cleaning products: WD-40 Multi-Use Product, WD-40 Specialist, 3-IN-ONE, GT85, X-14, 2000 Flushes, Carpet Fresh, no vac, Spot Shot, 1001, Lava and Solvol.\nOur products are sold in various locations around the world. Maintenance products are sold worldwide in markets throughout North, Central and South America, Asia, Australia, Europe, the Middle East and Africa. Homecare and cleaning products are sold primarily in North America, the United Kingdom (U.K.) and Australia. We sell our products primarily through warehouse club stores, hardware stores, automotive parts outlets, industrial distributors and suppliers, mass retail and home center stores, value retailers, grocery stores, online retailers, farm supply, sport retailers, and independent bike dealers.\nHighlights\nThe following summarizes the financial and operational highlights for our business during the fiscal year ended August 31, 2022:\nConsolidated net sales increased $30.7 million, or 6%, for fiscal year 2022 compared to the prior fiscal year. Changes in foreign currency exchange rates had an unfavorable impact of $8.3 million on consolidated net sales for fiscal year 2022. Thus, on a constant currency basis, net sales would have increased by $39.0 million, or 8%, for fiscal year 2022 compared to the prior fiscal year. This unfavorable impact from changes in foreign currency exchange rates mainly came from our EMEA segment, which accounted for 39% of our consolidated sales for the fiscal year ended August 31, 2022.\nGross profit as a percentage of net sales decreased to 49.1% for fiscal year 2022 compared to 54.0% for the prior fiscal year, primarily due to ongoing global supply chain challenges, including the increased cost of raw materials and constraints related to the ongoing COVID-19 pandemic. These ongoing challenges have resulted in increased inflation rates globally. See the Impact of COVID-19 on Our Business section which follows for details, including actions we are taking in response to these challenges.\nConsolidated net income decreased $2.9 million, or 4%, for fiscal year 2022 compared to the prior fiscal year. Changes in foreign currency exchange rates had an unfavorable impact of $0.8 million on consolidated net income for fiscal year 2022. Thus, on a constant currency basis, net income would have decreased by $2.1 million, or 3%, for fiscal year 2022 compared to the prior fiscal year.\nDiluted earnings per common share for fiscal year 2022 were $4.90 versus $5.09 in the prior fiscal year.\nOur strategic initiatives and the areas where we will continue to focus our time, talent and resources in future periods include: (i) building a business for the future; (ii) attracting, developing and engaging outstanding tribe members; (iii) striving for operational excellence; (iv) growing WD-40 Multi-Use Product; (v) growing WD-40 Specialist product line; and (vi) expanding and supporting portfolio opportunities that help us grow.\n‎\nSignificant Developments Impact of COVID-19 on Our Business\nOur financial results and operations continue to be impacted by the COVID-19 pandemic that began during our fiscal year 2020. The ongoing COVID-19 pandemic has impacted global economies, the rate of inflation, supply chains, distribution networks and consumer behavior around the world. We have experienced both favorable and unfavorable impacts to our financial results and our operations as a result of the direct and indirect effects of the COVID-19 pandemic. For example, sales have been negatively impacted at varying times in the regions in which we operate due to health and safety restrictions required by local governmental authorities; such restrictions most recently impacted our Asia-Pacific segment when COVID-19 lockdowns were in place in China sporadically during the second half of fiscal year 2022. These negative sales impacts since the start of the pandemic have been offset in certain periods by increased demand for our products, particularly in fiscal year 2021, as a result of the shift in consumer spending patterns due to increased renovation and maintenance activities. However, global supply chain issues have resulted in increased raw material costs and other input costs, higher competition for freight resources, and labor constraints within manufacturing and distribution networks. These increased costs started to negatively impact our gross margin and financial results in fiscal year 2021. This inflationary environment worsened during fiscal year 2022 resulting in lower gross margins compared to the corresponding periods of the prior fiscal year.\nSome of the increasing supply chain challenges that we have experienced include general aerosol production capacity constraints and competition for such capacity by other companies who also utilize third-party manufacturers for their aerosol production. Supply chains at many companies globally are being strained due to shortages of certain materials and this is impacting the ability of our third-party manufacturers to procure certain raw materials needed to manufacture our products. These challenges have periodically resulted in us not being able to meet the high level of demand for our products by customers and end-users in certain markets, most significantly those markets in our Americas segment where demand for aerosols has periodically outpaced the available production capacity in the region. We are continuing to actively manage periodic supply chain constraints and transportation disruptions. We have been actively working on various initiatives with our existing third-party manufacturers and we are also identifying and onboarding new third-party manufacturers, particularly in the Americas and EMEA segments. In addition, we have taken actions to increase inventory levels of certain raw materials and finished goods, given the current challenges within supply chain and increased lead times required by suppliers. As a result of these initiatives, we have begun to see increases in the capacity and flexibility of our supply chain throughout fiscal year 2022, particularly in the Americas segment. When we onboard new third-party manufacturers, it comes with inherent risks and in the current economic environment, it also potentially comes with higher costs. Although we are not able to estimate the costs or impacts associated with potential future supply chain disruptions, we believe that the changes we continue to implement as a result of the pandemic will have a positive lasting impact on our ability to better manage any future disruptions. However, some of the additional costs resulting from these recent supply chain constraints, including costs resulting from maintenance of higher inventory levels, as well as the inflationary environment that is impacting our raw material costs, are expected to unfavorably impact our cost of goods sold for as long as such conditions exist.\nTo offset these unfavorable impacts to gross margin, significant price increases have been implemented across all of our markets and geographies in fiscal year 2022 and further price increases may be implemented in certain regions in fiscal year 2023. Although we are beginning to see the favorable impacts of these price increases, it will take additional time before the full impact of these price increases is reflected in our reported results, especially those in some of our largest markets which we implemented late in the third quarter and in the fourth quarter of fiscal year 2022. However, it is possible that sales volumes may be impacted unfavorably in the short term as customers and end users adjust to increased sales prices. The severity and duration of the COVID-19 pandemic and its effects on our supply chain, changes in end-user demand and the current inflationary environment remain uncertain and it is not possible to estimate the extent to which these conditions will impact our financial results and operations in future periods.\nWe have continued to follow a variety of measures to promote the safety and security of our employees during the pandemic, support the communities in which we operate and ensure the availability and functioning of our critical infrastructure. These measures have included allowing for or requiring remote working arrangements for employees in some regions and the imposition of various travel restrictions. In addition, we continue to develop and monitor plans to support a safe working environment for our employees in the various office locations in which we operate around the world. These plans vary by region based on the evolving situations within those regions. In connection with these plans, we have put in place our Work from Where philosophy to support work-life integration, and enable management and employees to align on where work is completed.\nSee our risk factors disclosed in Part I-Item 1A, Risk Factors, for further information on risks associated with pandemics, including COVID-19.\n‎\nThe Impact of Russian Military Action in Ukraine\nOn February 24, 2022, Russian forces launched significant military action against Ukraine, which has resulted in conflict and disruption in the region. In response to this action taken by Russia, the U.S. and other countries immediately imposed various economic sanctions against Russia. These geopolitical tensions continued throughout the remainder of the fiscal year and it is uncertain when conditions will improve or whether additional governmental sanctions will be enacted in future periods. The direct and indirect impacts of this evolving situation and its effect on global economies in future periods are difficult to predict. We suspended selling our products to markets in Russia and Belarus beginning in March 2022, which had an unfavorable impact on our sales. In addition, we are currently unable to sell our products in Ukraine due to the disruption in the country. Our net sales to the regions that are directly impacted were approximately 3% of consolidated net sales for fiscal year 2021 and approximately 4% of consolidated net sales for the first half of fiscal year 2022, prior to the suspension of sales in these regions. As a result of this event that impacted the second half of our fiscal year, sales in these regions decreased 38% for the fiscal year ended August 31, 2022 compared to the prior fiscal year. We do not have facilities, third-party manufacturing partners, employees or inventory in these affected regions. Additionally, the only activities we conducted in these regions prior to the suspension of sales were through local marketing distributors. Write-offs of previously existing accounts receivable from those marketing distributors affected by the crisis have not been significant to date and are not expected to become significant in future periods.\nAs a result of this conflict, commodity markets remain subject to heightened levels of uncertainty, especially as they relate to the price of crude oil, which increased significantly in the immediate aftermath of the sanctions against Russia. Increases in crude oil prices unfavorably impact the cost of our products, as well as the cost of the transportation and distribution of our products. The length and severity of the recent increases in the price of crude oil are highly unpredictable and may unfavorably impact our cost of goods sold for as long as these conditions exist.\n‎\nResults of Operations\nFiscal Year Ended August 31, 2022 Compared to Fiscal Year Ended August 31, 2021\nOperating Items\nThe following table summarizes operating data for our consolidated operations (in thousands, except percentages and per share amounts):\nFiscal Year Ended August 31,\nChange from\n‎Prior Year\nDollars\nPercent\nNet sales:\nMaintenance products\n$\n485,326\n$\n448,817\n$\n36,509\n8%\nHomecare and cleaning products\n33,494\n39,292\n(5,798)\n(15)%\nTotal net sales\n518,820\n488,109\n30,711\n6%\nCost of products sold\n264,055\n224,370\n39,685\n18%\nGross profit\n254,765\n263,739\n(8,974)\n(3)%\nOperating expenses\n167,435\n174,898\n(7,463)\n(4)%\nIncome from operations\n$\n87,330\n$\n88,841\n$\n(1,511)\n(2)%\nNet income\n$\n67,329\n$\n70,229\n$\n(2,900)\n(4)%\nEarnings per common share - diluted\n$\n4.90\n$\n5.09\n$\n(0.19)\n(4)%\nNet Sales by Segment\nThe following table summarizes net sales by segment (in thousands, except percentages):\nFiscal Year Ended August 31,\nChange from\n‎Prior Year\nDollars\nPercent\nAmericas\n$\n240,233\n$\n214,601\n$\n25,632\n12%\nEMEA\n204,688\n208,252\n(3,564)\n(2)%\nAsia-Pacific\n73,899\n65,256\n8,643\n13%\nTotal\n$\n518,820\n$\n488,109\n$\n30,711\n6%\n‎\nAmericas Sales\nThe following table summarizes net sales by product line for the Americas segment (in thousands, except percentages):\nFiscal Year Ended August 31,\nChange from\n‎Prior Year\nDollars\nPercent\nMaintenance products\n$\n223,470\n$\n194,295\n$\n29,175\n15%\nHomecare and cleaning products\n16,763\n20,306\n(3,543)\n(17)%\nTotal\n$\n240,233\n$\n214,601\n$\n25,632\n12%\n% of consolidated net sales\n47%\n44%\nCC Net sales - non-GAAP (1)\n$\n240,190\n$\n214,601\n$\n25,589\n12%\n(1)Current fiscal year constant currency (CC) net sales translated at the foreign currency exchange rates in effect for the corresponding period of the prior fiscal year, compared to prior period actual net sales\nAmericas Sales - Fiscal Year Ended - August 31, 2022 Compared to August 31, 2021\nNet sales of maintenance products in the Americas segment increased due primarily to the following:\nU.S. sales increased $15.3 million, or 10%, due to increased sales of WD-40 Multi-Use Product and WD-40 Specialist of $7.1 million, or 6%, and $7.7 million, or 51%, respectively. The increase for WD-40 Multi-Use Product was primarily due to price increases that went into effect during the last twelve months and supply chain improvements we made during fiscal year 2022 which resulted in increased product availability. These increases were offset by lower demand, partially due to unusually high levels of renovation and maintenance activities exhibited by our end-users during the prior fiscal year 2021 in earlier stages of the COVID-19 pandemic. WD-40 Specialist sales increased primarily due to significantly higher product availability. WD-40 Specialist products are sourced at certain third-party manufacturers that were significantly impacted by global supply chain constraints in fiscal year 2021. However, adjustments we have made in our supply chain to increase the production capacity of our most significant products, including WD-40 Specialist, improved the availability of these products throughout fiscal year 2022. In addition, WD-40 Specialist also benefited from price increases we implemented over the last 12 months.\nLatin America sales increased $11.8 million, or 35%, primarily due to higher sales throughout many markets in the region, including in our direct market in Mexico. Sales were favorably impacted by price increases, increased product availability, successful promotional programs, and the continued momentum of achieving new distribution in our direct market in Mexico. In addition, sales were favorably impacted in the fourth quarter of fiscal year 2022 due to marketing distributors purchasing product in advance of additional price increases which were implemented late in fiscal year 2022.\nCanada sales increased $2.1 million, or 16%, primarily due to demand in the industrial channel in Western Canada as a result of increased activity levels of end-users in the oil industry. In addition, price increases we implemented over the last twelve months, increased promotional activities and new distribution also had a favorable impact on sales.\nNet sales of homecare and cleaning products in the Americas decreased due to the following:\nChallenges in our Americas supply chain, primarily in the U.S., resulted in decreased product availability and lower net sales for most homecare and cleaning product brands. While we have been actively working to increase the capacity and flexibility of our supply chain in recent periods, the adjustments we have made to date have been more heavily focused on our most significant products, primarily our maintenance products.\nWhile each of our homecare and cleaning products have continued to generate positive cash flows, we have experienced flat or decreased sales for many of these products in recent periods.\nFor the Americas segment, 74% of sales came from the U.S., and 26% of sales came from Canada and Latin America combined for the fiscal year ended August 31, 2022 compared to the prior fiscal year when 77% of sales came from the U.S., and 23% of sales came from Canada and Latin America combined.\n‎\nEMEA Sales\nThe following table summarizes net sales by product line for the EMEA segment (in thousands, except percentages):\nFiscal Year Ended August 31,\nChange from\n‎Prior Year\nDollars\nPercent\nMaintenance products\n$\n196,524\n$\n198,309\n$\n(1,785)\n(1)%\nHomecare and cleaning products\n8,164\n9,943\n(1,779)\n(18)%\nTotal (1)\n$\n204,688\n$\n208,252\n$\n(3,564)\n(2)%\n% of consolidated net sales\n39%\n43%\nCC Net sales - non-GAAP (2)\n$\n212,319\n$\n208,252\n$\n4,067\n2%\n(1)While our reporting currency is the U.S. Dollar, the functional currency of our U.K. subsidiary, the entity in which the EMEA results are generated, is Pound Sterling. Although the functional currency of this subsidiary is Pound Sterling, approximately 50% of its sales are generated in Euro and approximately 15% are generated in U.S. Dollar. As a result, the Pound Sterling sales and earnings for the EMEA segment can be negatively or positively impacted from period to period upon translation from these currencies depending on whether the Euro and U.S. Dollar are weakening or strengthening against the Pound Sterling.\n(2)Current fiscal year constant currency net sales translated at the foreign currency exchange rates in effect for the corresponding period of the prior fiscal year, compared to prior period actual net sales.\nEMEA Sales - Fiscal Year Ended - August 31, 2022 Compared to August 31, 2021\nNet sales decreased in the EMEA segment due to the following drivers:\nDirect Markets - EMEA (67% of net sales YTD FY2022 vs 68% YTD FY2021)\nDirect markets decreased $4.5 million, or 3%, primarily due to decreased sales in the U.K of $8.4 million, or 21%, offset by increases in our other EMEA direct markets, when combined, of $3.9 million, or 4%. Sales in our direct markets were unfavorably impacted by the weakening of the Pound Sterling, the functional currency of our U.K subsidiary, against the U.S. Dollar. On a constant currency basis, sales would have increased $1.0 million in our direct markets in fiscal year 2022 as compared to the prior fiscal year.\nDecreased sales in the U.K. direct market were primarily due to a lower level of demand, as renovation, maintenance and homecare and cleaning activities exhibited by our end-users in the U.K. during the COVID-19 pandemic resulted in particularly strong demand in fiscal year 2021. In addition, sales were unfavorably impacted by changes in foreign currency exchange rates. These decreases were partially offset by price increases we have implemented over the last twelve months. Although these price increases positively impacted sales, the overall impact was partially offset by a lower level of customer orders and promotional programs as customers adjust to these price increases.\nSales in EMEA direct markets, excluding the U.K., increased from period to period primarily due to new distribution and sales price increases, as well as successful promotional programs that occurred during fiscal year 2022. These favorable impacts were partially offset by lower demand and reduced renovation and maintenance activities exhibited by our end-users, as discussed above, as well as unfavorable impacts due to changes in foreign currency exchange rates.\nDistributor Markets - EMEA (33% of net sales YTD FY2022 vs 32% YTD FY2021)\nSales increased $0.9 million, or 1%, in EMEA markets wherein we utilize a marketing distributor model (distributor markets), in which products are sold to marketing distributors who in turn sell to wholesalers and retailers. The increase was primarily due to increased sales in India, the Middle East, Poland and the Czech Republic of $2.5 million, $1.5 million, $1.0 million, and $0.9 million, respectively. The increases in the distributor market sales were significantly offset by decreased sales in Russia and Turkey of $4.8 million and $0.9 million, respectively. The sales decrease in Russia was primarily due to the ongoing effects of the Russian military action in Ukraine. See The Impact of Russian Military Action in Ukraine described in the Significant Developments section above for further information regarding the suspension of our sales to Russian markets.\nSales were positively impacted in the distributor markets due to strong demand, new distribution and price increases we have implemented over the last twelve months.\n‎\nAsia-Pacific Sales\nThe following table summarizes net sales by product line for the Asia-Pacific segment (in thousands, except percentages):\nFiscal Year Ended August 31,\nChange from\n‎Prior Year\nDollars\nPercent\nMaintenance products\n$\n65,332\n$\n56,213\n$\n9,119\n16%\nHomecare and cleaning products\n8,567\n9,043\n(476)\n(5)%\nTotal\n$\n73,899\n$\n65,256\n$\n8,643\n13%\n% of consolidated net sales\n14%\n13%\nCC Net sales - non-GAAP (1)\n$\n74,621\n$\n65,256\n$\n9,365\n14%\n(1)Current fiscal year constant currency net sales translated at the foreign currency exchange rates in effect for the corresponding period of the prior fiscal year, compared to prior period actual net sales\nAsia-Pacific Sales - Fiscal Year Ended - August 31, 2022 Compared to August 31, 2021\nNet sales in the Asia-Pacific segment increased due to the following drivers:\nSales in the Asia distributor markets increased $5.9 million, or 23%, primarily due to the success of promotional programs and the continued easing of COVID-19 lockdown measures throughout the fiscal year, which resulted in increased demand and higher sales in most countries, as well as the timing of customer orders in response to price increases.\nSales in China increased $2.3 million, or 13%, primarily due to a higher level of promotional activities during the first half of fiscal year 2022, as well as customers purchasing product in advance of anticipated price increases. These increases in sales were partially offset by decreased sales due to COVID-19 lockdowns in Shanghai and other cities, primarily in the third quarter, that severely limited the production of our products by our third-party manufacturer located in the region. In addition, these lockdowns and the severe restrictions placed on various regions in China during certain periods in the second half of fiscal year 2022 negatively impacted logistics networks in the country.\nAustralia sales increased $0.5 million, or 2%, primarily due to the ongoing growth of the base business, increased promotional activities and price increases that went into effect in February 2022. Changes in foreign currency exchange rates had an unfavorable impact on sales in Australia. On a constant currency basis, sales in Australia would have increased $1.5 million, or 7%.\nGross Profit\nThe following general information regarding the timing and nature of our product costs is important when assessing fluctuations in our gross margin from period to period:\nThere is often a delay of one quarter or more before changes in costs of raw materials, such as specialty chemicals used in the formulation of our products, impact cost of products sold due to production and inventory life cycles;\nIn general, the timing of advertising, promotional and other discounts may cause fluctuations in gross margin from period to period. Advertising, promotional and other discounts that are given to our customers are recorded as a reduction to sales, whereas advertising and sales promotional costs associated with promotional activities that we pay to third parties are recorded as advertising and sales promotion expenses;\nIn the EMEA segment, the majority of our cost of goods sold is denominated in Pound Sterling whereas sales are generated in Pound Sterling, Euro and the U.S. Dollar. The strengthening or weakening of the Euro and U.S. Dollar against the Pound Sterling may result in foreign currency related changes to the gross margin percentage in the EMEA segment from period to period; and\nOur gross profit and gross margin may not be comparable to those of other consumer product companies, since some of these companies include all costs related to distribution of their products in cost of products sold, whereas we exclude the portion associated with amounts paid to third parties for shipment to our customers from our distribution centers and contract manufacturers and include these costs in selling, general and administrative expenses. These costs totaled $18.6 million and $16.5 million for the fiscal year ended August 31, 2022 and 2021, respectively.\n‎\nFor further information pertaining to recent trends and economic conditions affecting gross margin, please see the section titled Significant Developments.\nThe following table summarizes gross margin and gross profit (in thousands, except percentages):\nFiscal Year Ended August 31,\nChange from\n‎Prior Year\nGross profit\n$\n254,765\n$\n263,739\n$\n(8,974)\nGross margin\n49.1%\n54.0%\n(490)\nbps (1)\n(1)Basis points (bps) change in gross margin.\nGross Margin - Fiscal Year Ended - August 31, 2022 Compared to August 31, 2021\nGross margin decreased 490 bps primarily due to the following unfavorable impacts, partially offset by favorable impacts:\n(Unfavorable)/Favorable\nExplanations\n(430) bps\nHigher costs of specialty chemicals used in the formulation of our products.\n(180) bps\nHigher costs of aerosol cans.\n(110) bps\nHigher warehousing, distribution and freight costs associated with supply chain constraints as a result of the ongoing COVID-19 pandemic, the worsening inflationary environment and initiatives to increase production capacity while these constraints exist.\n(100) bps\nHigher filling fees paid to our third-party contract manufacturers, primarily in the Americas segment.\n(50) bps\nChanges in foreign currency exchange rates in the EMEA segment.\n390 bps\nSales price increases implemented in all three segments at varying times during the last 12 months.\nSelling, General and Administrative (SG&A) Expenses\nFiscal Year Ended August 31,\nChange from\n‎Prior Year\nDollars\nPercent\nSG&A expenses\n$\n138,658\n$\n145,493\n$\n(6,835)\n(5)%\n% of net sales\n26.7%\n29.8%\nSG&A Expenses - Fiscal Year Ended - August 31, 2022 Compared to August 31, 2021\nThe decrease in SG&A expenses from period to period was primarily due lower employee-related costs, which decreased $11.5 million due to lower incentive compensation accruals of $15.2 million, which were partially offset by higher salary and other employee costs of $3.7 million primarily due to increased headcount and annual compensation increases. Changes in foreign currency exchange rates from period to period also resulted in a decrease of $2.0 million in SG&A expenses. These decreases to SG&A expense were partially offset by higher travel and meeting expense, which increased $3.5 million due to the reduction in travel restrictions related to COVID-19, resulting in a higher level of travel and meetings by employees. Additionally, freight costs increased $2.5 million primarily due to carrier price increases associated with supply chain constraints and limited capacity in the global distribution networks. Miscellaneous costs also increased $0.7 million from period to period.\nWe continued our research and development investment, the majority of which is associated with our maintenance products, in support of our focus on innovation and renovation of our products. Research and development costs for the fiscal years ended August 31, 2022 and 2021 were $5.1 million and $5.6 million, respectively. Our research and development team engages in consumer research, product development, current product improvements and testing activities. This team leverages its development capabilities by collaborating with a network of outside resources including our current and prospective third-party contract manufacturers. The level and types of expenses incurred within research and development can vary from period to period depending upon the types of activities being performed.\nAdvertising and Sales Promotion (A&P) Expenses\nFiscal Year Ended August 31,\nChange from\n‎Prior Year\nDollars\nPercent\nA&P expenses\n$\n27,343\n$\n27,956\n$\n(613)\n(2)%\n% of net sales\n5.3%\n5.7%\nA&P Expenses - Fiscal Year Ended - August 31, 2022 Compared to August 31, 2021\nChanges in foreign currency exchange rates had a favorable impact of $0.6 million on advertising and sales promotion expenses from period to period. On a constant currency basis, A&P expenses would have been relatively constant.\nAs a percentage of net sales, A&P expenses may fluctuate period to period based upon the type of marketing activities we employ and the period in which the costs are incurred. Total promotional costs recorded as a reduction to sales were $28.1 million and $24.8 million for the fiscal years ended August 31, 2022 and 2021, respectively. Therefore, our total investment in A&P activities totaled $55.4 million and $52.8 million for the fiscal years ended August 31, 2022 and 2021, respectively.\nIncome from Operations by Segment\nThe following table summarizes income from operations by segment (in thousands, except percentages):\nFiscal Year Ended August 31,\nChange from\n‎Prior Year\nDollars\nPercent\nAmericas\n$\n54,198\n$\n51,591\n$\n2,607\n5%\nEMEA\n42,058\n53,003\n(10,945)\n(21)%\nAsia-Pacific\n22,590\n19,121\n3,469\n18%\nUnallocated corporate (1)\n(31,516)\n(34,874)\n3,358\n(10)%\nTotal\n$\n87,330\n$\n88,841\n$\n(1,511)\n(2)%\n(1)Unallocated corporate expenses are general corporate overhead expenses not directly attributable to any one of the business segments. These expenses are reported separate from our identified segments and are included in Selling, General and Administrative expenses on our consolidated statements of operations.\nAmericas\nAmericas Operating Income - Fiscal Year Ended - August 31, 2022 Compared to August 31, 2021\nIncome from operations for the Americas increased to $54.2 million, up $2.6 million, or 5%, primarily due to a $25.6 million increase in sales and slightly lower operating expenses, significantly offset by a lower gross margin. Gross margin for the Americas segment decreased from 52.0% to 47.3% primarily due to increases in the costs of specialty chemicals and aerosol cans. In addition, gross margin was unfavorably impacted by increased warehousing, distribution and freight costs and higher costs at our third-party manufacturers due to supply chain constraints and inflationary impacts, as well as unfavorable changes in sales mix and higher overhead costs. These unfavorable impacts to gross margin were partially offset by the favorable impacts of price increases that were implemented during the previous 12 months. Although operating expenses decreased due to lower accrued incentive compensation, these decreases were almost entirely offset by higher outbound freight costs primarily due to higher freight rates, increased headcount and salaries, and higher travel and meeting expenses. Operating income as a percentage of net sales decreased from 24.0% to 22.6% period over period.\n‎\nEMEA\nEMEA Operating Income - Fiscal Year Ended - August 31, 2022 Compared to August 31, 2021\nIncome from operations for the EMEA segment decreased to $42.1 million, down $10.9 million, or 21%, primarily due to a lower gross margin and a $3.6 million decrease in sales, partially offset by a decrease in operating expenses. Gross margin for the EMEA segment decreased from 55.6% to 49.6% primarily due to increases in the costs of specialty chemicals and aerosol cans. In addition, gross margin was also unfavorably impacted by fluctuations in exchange rates as well as increased warehousing, distribution and freight costs due to supply chain constraints and inflationary impacts. These unfavorable impacts to gross margin were partially offset by price increases that were implemented over the last twelve months. Operating expenses decreased $3.2 million primarily due to lower accrued incentive compensation, partially offset by increased headcount and salaries, higher travel and meeting expenses and higher outbound freight costs. Operating income as a percentage of net sales decreased from 25.5% to 20.5% period over period.\nAsia-Pacific\nAsia-Pacific Operating Income - Fiscal Year Ended - August 31, 2022 Compared to August 31, 2021\nIncome from operations for the Asia-Pacific segment increased to $22.6 million, up $3.5 million, or 18%, primarily due to a $8.6 million increase in sales, partially offset by a lower gross margin. Gross margin for the Asia-Pacific segment decreased from 55.8% to 53.6% primarily due to combined unfavorable impacts of increases to the cost of specialty chemicals and aerosol cans. These unfavorable impacts to gross margin were partially offset by price increases that were implemented during the previous 12 months. Operating income as a percentage of net sales increased from 29.3% to 30.6% period over period.\nNon-Operating Items\nThe following table summarizes non-operating income and expenses for our consolidated operations (in thousands):\nFiscal Year Ended August 31,\nChange\nInterest income\n$\n$\n$\nInterest expense\n$\n2,742\n$\n2,395\n$\nOther (expense) income, net\n$\n(582)\n$\n(28)\n$\n(554)\nProvision for income taxes\n$\n16,779\n$\n16,270\n$\nInterest Income\nInterest income was not significant for both the fiscal years ended August 31, 2022 and 2021.\nInterest Expense\nInterest expense increased primarily due to an increased weighted average outstanding balance on our revolving credit facility and higher interest rates related to draws on this credit facility.\nOther (Expense) Income, Net\nOther (expense) income, net was $0.6 million for the fiscal year ended 2022 and was not significant for the corresponding period of the prior fiscal year. The $0.6 million change from period to period was primarily due to net foreign currency losses during fiscal year 2022 as a result of fluctuations in the foreign currency exchange rates for both the U.S. Dollar and the Euro against the Pound Sterling.\nProvision for Income Taxes\nThe provision for income taxes was 19.9% of income before income taxes for the fiscal year ended August 31, 2022 compared to 18.8% for the prior fiscal year. The increase in the effective income tax rate from period to period was primarily due to an increase in non-deductible performance-based compensation expense.\n‎\nNet Income\nNet income was $67.3 million, or $4.90 per common share on a fully diluted basis, for fiscal year 2022 compared to $70.2 million, or $5.09 per common share on a fully diluted basis, for the prior fiscal year. Changes in foreign currency exchange rates year over year had an unfavorable impact of $0.8 million on net income for fiscal year 2022. Thus, on a constant currency basis, net income for fiscal year 2022 would have been $68.1 million.\nResults of Operations\nFiscal Year Ended August 31, 2021 Compared to Fiscal Year Ended August 31, 2020\nFor discussion related to changes in financial condition and the results of operations for fiscal year 2021 compared to fiscal year 2020, refer to Part II - Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the fiscal year ended August 31, 2021, which was filed with the SEC on October 22, 2021.\nPerformance Measures and Non-GAAP Reconciliations\nIn managing our business operations and assessing our financial performance, we supplement the information provided by our financial statements with certain non-GAAP performance measures. These performance measures are part of our current 55/30/25 business model, which includes gross margin, cost of doing business, and earnings before interest, income taxes, depreciation and amortization (EBITDA), the latter two of which are non-GAAP performance measures. Cost of doing business is defined as total operating expenses less amortization of definite-lived intangible assets, impairment charges related to intangible assets and depreciation in operating departments, and EBITDA is defined as net income before interest, income taxes, depreciation and amortization. We target our gross margin to be at or above 55% of net sales, our cost of doing business to be at 30% of net sales, and our EBITDA to be at or above 25% of net sales. Results for these performance measures may vary from period to period depending on various factors, including economic conditions and our level of investment in activities for the future such as those related to quality assurance, regulatory compliance, and intellectual property protection in order to safeguard our WD-40 brand. Our financial results and operations continue to be impacted by increased global supply chain constraints and an inflationary environment, both of which have significantly lowered our gross margin percentage over the last twelve months and moved us well below our target of 55%. Although we have been implementing strategic sales price increases across all segments at varying times in response to increased costs, it will take time before the full impact of these sales price increases are reflected in our reported results. In addition, it is difficult to determine how long these supply chain and inflationary conditions will exist and if they will worsen or improve over time. However, the targets for gross margin and these other performance measures are long-term in nature and we expect to make progress towards achieving them over time. For more detailed information pertaining to recent trends and economic conditions and the actions we are taking to respond to them, please see the section titled Significant Developments.\nThe following table summarizes the results of these performance measures:\nFiscal Year Ended August 31,\nGross margin - GAAP\n49%\n54%\n55%\nCost of doing business as a percentage of net sales - non-GAAP\n31%\n35%\n34%\nEBITDA as a percentage of net sales - non-GAAP (1)\n18%\n20%\n21%\n(1)Percentages may not aggregate to EBITDA percentage due to rounding and because amounts recorded in other income (expense), net on our consolidated statement of operations are not included as an adjustment to earnings in the EBITDA calculation.\nWe use the performance measures above to establish financial goals and to gain an understanding of our comparative performance from period to period. We believe that these measures provide our shareholders with additional insights into how we run our business. We believe these measures also provide investors with additional financial information that should be considered when assessing our underlying business performance and trends. These non-GAAP financial measures are supplemental in nature and should not be considered in isolation or as alternatives to net income, income from operations or other financial information prepared in accordance with GAAP as indicators of our performance or operations. The use of any non-GAAP measure may produce results that vary from the GAAP measure and may not be comparable to a similarly defined non-GAAP measure used by other companies.\n‎\nReconciliations of these non-GAAP financial measures to our financial statements as prepared in accordance with GAAP are as follows:\nCost of Doing Business (in thousands, except percentages):\nFiscal Year Ended August 31,\nTotal operating expenses - GAAP\n$\n167,435\n$\n174,898\n$\n145,797\nAmortization of definite-lived intangible assets\n(1,434)\n(1,449)\n(2,211)\nDepreciation (in operating departments)\n(4,369)\n(4,311)\n(4,095)\nCost of doing business - non-GAAP\n$\n161,632\n$\n169,138\n$\n139,491\nNet sales\n$\n518,820\n$\n488,109\n$\n408,498\nCost of doing business as a percentage of net sales - non-GAAP\n31%\n35%\n34%\nEBITDA (in thousands, except percentages):\nFiscal Year Ended August 31,\nNet income - GAAP\n$\n67,329\n$\n70,229\n$\n60,710\nProvision for income taxes\n16,779\n16,270\n14,805\nInterest income\n(102)\n(81)\n(93)\nInterest expense\n2,742\n2,395\n2,439\nAmortization of definite-lived\nintangible assets\n1,434\n1,449\n2,211\nDepreciation\n6,860\n5,570\n5,490\nEBITDA\n$\n95,042\n$\n95,832\n$\n85,562\nNet sales\n$\n518,820\n$\n488,109\n$\n408,498\nEBITDA as a percentage of net sales - non-GAAP\n18%\n20%\n21%\nLiquidity and Capital Resources\nOverview\nOur financial condition and liquidity remain strong. Although there continues to be uncertainty related to the ongoing and anticipated impact of the current COVID-19 pandemic on our future results, we believe our efficient business model and the steps that we have taken position us to manage our business through the situation as it continues to develop. We continue to manage all aspects of our business including, but not limited to, monitoring our liquidity, the financial health of our customers, suppliers and other third-party relationships, implementing gross margin enhancement strategies and developing new opportunities for growth\nOur principal sources of liquidity are cash generated from operations and cash currently available from our existing unsecured revolving credit facility under the Credit Agreement with Bank of America. We use proceeds of the revolving credit facility primarily for our general working capital needs. We also hold borrowings under the Note Agreement. See Note 8 - Debt for additional information on these agreements.\nWe have historically held a balance of outstanding draws on our line of credit in either U.S. Dollars in the Americas segment or in Euros and Pound Sterling in the EMEA segment. Euro and Pound Sterling denominated draws will fluctuate in U.S. Dollars from period to period due to changes in foreign currency exchange rates. We regularly convert many of our draws on our line of credit to new draws with new maturity dates and interest rates. We have the ability to refinance any draws under the line of credit with successive short-term borrowings through the September 30, 2025 maturity date of the Credit Agreement. Outstanding draws for which we have both the ability and intent to refinance with successive short-term borrowings for a period of at least twelve months are classified as long-term. As of August 31, 2022, $39.5 million of the outstanding balance under our line of credit resides in the EMEA segment and is denominated in Euros and Pound Sterling and classified long-term, whereas $38.4 million is denominated in U.S. Dollar and classified as short-term. In the United States, we held $68.4 million in fixed rate long-term borrowings as of August 31, 2022, consisting of senior notes under our Note Agreement. We paid $0.8 million in principal payments on our Series A Notes during fiscal year 2022. There were no other letters of credit outstanding or restrictions on the\namount available on our line of credit or notes. Per the terms of both the Note Agreement and the Credit Agreement, our consolidated leverage ratio cannot be greater than three and a half to one and our consolidated interest coverage ratio cannot be less than three to one. See Note 8 - Debt for additional information on these financial covenants. At August 31, 2022, we were in compliance with all material debt covenants. We continue to monitor our compliance with all debt covenants and, at the present time, we believe that the likelihood of being unable to satisfy all material covenants is remote. At August 31, 2022, we had a total of $37.8 million in cash and cash equivalents. We do not foresee any ongoing issues with repaying our borrowings and we closely monitor the use of this credit facility.\nWe believe that our future cash from domestic and international operations, together with our access to funds available under our unsecured revolving credit facility, will provide adequate resources to fund short-term and long-term operating requirements, capital expenditures, dividend payments, acquisitions, new business development activities and share repurchases. On October 12, 2021, our Board of Directors approved a new share repurchase plan. Under the plan, which became effective on November 1, 2021, we are authorized to acquire up to $75.0 million of our outstanding shares through August 31, 2023, of which $45.8 million remains available for the repurchase of common shares as of August 31, 2022.\nCash Flows\nThe following table summarizes our cash flows by category for the periods presented (in thousands):\nFiscal Year Ended August 31,\nNet cash provided by operating activities\n$\n2,604\n$\n84,714\n$\n72,664\nNet cash used in investing activities\n(7,691)\n(14,460)\n(18,945)\nNet cash used in financing activities\n(38,011)\n(40,749)\n(26,709)\nEffect of exchange rate changes on cash and cash equivalents\n(5,020)\n(6)\n2,219\nNet (decrease) increase in cash and cash equivalents\n$\n(48,118)\n$\n29,499\n$\n29,229\nOperating Activities\nNet cash provided by operating activities decreased $82.1 million to $2.6 million for fiscal year 2022. Cash flows from operating activities depend heavily on operating performance and changes in working capital. Our primary source of operating cash flows for fiscal year ended August 31, 2022 was net income of $67.3 million, which decreased $2.9 million from period to period. Changes in our working capital significantly decreased net cash provided by operating activities, primarily due to increases in inventory, most significantly in the Americas segment but also in the EMEA segment. This increase in inventory was due to actions we took to stock certain raw materials and finished goods to increase the flexibility and capacity within our supply chain, as well as the higher carrying value of inventory due to higher raw material costs and other input costs from period to period. Net cash provided by operating activities was further decreased due to higher earned incentive payouts in the first quarter of fiscal year 2022 compared to the same period of the prior fiscal year as well as lower level of earned incentive accruals from period to period. Additionally, net cash provided by operating activities decreased from period to period due to lower increases in accounts payable and accrued liabilities, as well as increases in other assets primarily due to capitalized costs related to the new cloud-based ERP system which we are currently implementing.\nInvesting Activities\nNet cash used in investing activities decreased $6.8 million to $7.7 million for fiscal year 2022, primarily due to a lower level of manufacturing-related capital expenditures within the United States and the United Kingdom. Some of this manufacturing equipment is still under construction and will be located at our third-party manufacturers in the United States and the United Kingdom once completed.\nFinancing Activities\nNet cash used in financing activities decreased $2.8 million to $38.0 million for fiscal year 2022. This change was primarily due to the resumption of treasury stock purchases in November 2021, resulting in increased treasury stock purchases of $29.2 million. In addition, increases in dividends paid to our shareholders of $3.8 million and increases in shares withheld to cover taxes on conversion of equity rewards of $0.8 million resulted in higher cash outflows from period to period. These increases in cash outflows from period to period were significantly offset by $36.4 million in higher proceeds provided by the Companys debt agreements, primarily due to $38.4 million in proceeds from our line of credit in fiscal year 2022. In fiscal year 2021, we repaid $50.0 million of borrowings outstanding under our line of credit using $52.0 million in proceeds that we received from the issuance and sale of senior notes. This net borrowing activity resulted in a $2.0 million cash inflow during fiscal year 2021 related to our debt agreements compared to the $38.4 million in net proceeds during fiscal year 2022.\nEffect of Exchange Rate Changes\nAll of our foreign subsidiaries currently operate in currencies other than the U.S. Dollar and a significant portion of our consolidated cash balance is denominated in these foreign functional currencies, particularly at our U.K. subsidiary which operates in Pound Sterling. As a result, our cash and cash equivalents balances are subject to the effects of the fluctuations in these functional currencies against the U.S. Dollar at the end of each reporting period. The net effect of exchange rate changes on cash and cash equivalents, when expressed in U.S. Dollar terms was a decrease in cash of $5.0 million in fiscal year 2022, while such changes were not significant in fiscal year 2021 and resulted in an increase in cash of $2.2 million for fiscal year 2020. These changes were primarily due to fluctuations in various foreign currency exchange rates from period to period, but the majority is related to the fluctuations in the Pound Sterling against the U.S. Dollar.\nCash Flows\nFiscal Year Ended August 31, 2021 Compared to Fiscal Year Ended August 31, 2020\nFor discussion related to changes in the consolidated statements of cash flows for fiscal year 2021 compared to fiscal year 2020, refer to Part II - Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the fiscal year ended August 31, 2021, which was filed with the SEC on October 22, 2021.\nShare Repurchase Plans\nThe information required by this item is incorporated by reference to Part IV-Item 15, Exhibits, Financial Statement Schedules Note 9 - Share Repurchase Plans, included in this report.\nDividends\nWe have historically paid regular quarterly cash dividends on our common stock. In December 2021, the Board of Directors declared an 8% increase in the regular quarterly cash dividend, increasing it from $0.72 per share to $0.78 per share. On October 11, 2022, our Board of Directors declared a cash dividend of $0.78 per share payable on October 31, 2022 to shareholders of record on October 21, 2022. Our ability to pay dividends could be affected by future business performance, liquidity, capital needs, alternative investment opportunities and loan covenants.\nContractual Obligations\nWe hold borrowings under our Note Purchase and Private Shelf Agreement with fixed repayment requirements and under a Revolving Credit Facility that has variable underlying interest rates. For additional details on these borrowings, including ability and intent assessment on our credit facility agreement with Bank of America, refer to the information set forth in Part IV-Item 15, Exhibits, Financial Statement Schedules, Note 8 - Debt.\nAdditionally, we have ongoing relationships with various third-party suppliers (contract manufacturers) that manufacture our products and third-party distribution centers which warehouse and ship our products to customers. The contract manufacturers maintain title and control of certain raw materials and components, materials utilized in finished products, and of the finished products themselves until shipment to our customers or third-party distribution centers in accordance with agreed upon shipment terms. Although we have definitive minimum purchase obligations in the contract terms with certain of our contract manufacturers, when such obligations have been included, they have either been immaterial or the minimum amounts have been such that they are well below the volume of goods that we have historically purchased. In addition, in the ordinary course of business, we communicate supply needs to our contract manufacturers based on orders and short-term projections, ranging from two to six months. We are committed to purchase the products produced by the contract manufacturers based on the projections provided. Upon the termination of contracts with contract manufacturers, we obtain certain inventory control rights and are obligated to work with the contract manufacturer to sell through all product held by or manufactured by the contract manufacturer on our behalf during the termination notification period. If any inventory remains at the contract manufacturer at the termination date, we are obligated to purchase such inventory which may include raw materials, components and finished goods. The amounts for inventory purchased under termination commitments have been immaterial.\nIn addition to the commitments to purchase products from contract manufacturers described above, we may also enter into commitments with other manufacturers to purchase finished goods and components to support innovation initiatives and/or supply chain initiatives. As of August 31, 2022, no such commitments were outstanding.\nAt August 31, 2022, the liability recorded for uncertain tax positions, excluding associated interest and penalties, was approximately $9.3 million. For additional details on our uncertain tax positions, refer to the information set forth in Part IV-Item 15, Exhibits, Financial Statement Schedules Note 13 - Income Taxes. We have estimated that up to $0.2 million of\nunrecognized tax benefits related to income tax positions may be affected by the resolution of tax examinations or expiring statutes of limitation within the next twelve months.\nCritical Accounting Policies and Estimates\nOur results of operations and financial condition, as reflected in our consolidated financial statements, have been prepared in accordance with accounting principles generally accepted in the United States of America. Preparation of financial statements requires us to make estimates and assumptions affecting the reported amounts of assets, liabilities, revenues and expenses and the disclosures of contingent assets and liabilities. We use historical experience and other relevant factors when developing estimates and assumptions and these estimates and assumptions are continually evaluated. Note 2 to our consolidated financial statements included in Item 15 of this report includes a discussion of our significant accounting policies. The accounting policies discussed below are the ones we consider to be most critical to an understanding of our consolidated financial statements because their application places the most significant demands on our judgment. Our financial results may have varied from those reported had different assumptions been used or other conditions prevailed.\nRevenue Recognition\nSales are recognized as revenue at a point in time upon transferring control of the product to the customer. This typically occurs when products are shipped or delivered, depending on when risks of loss and title have passed to the customer per the terms of the contract. For certain of our sales we must make judgments and certain assumptions in order to determine when delivery has occurred. Through an analysis of end-of-period shipments for these particular sales, we determine an average time of transit of product to our customers, and this is used to estimate the time of delivery and whether revenue should be recognized during the current reporting period for such shipments. Differences in judgments or estimates related to the lengthening or shortening of the estimated delivery time used could result in material differences in the timing of revenue recognition.\nSales are recorded net of allowances for damaged goods and other sales returns, sales incentives, trade promotions and cash discounts. We apply a five-step approach in determining the amount and timing of revenue to be recognized which includes the following: (1) identifying the contract with a customer, (2) identifying the performance obligations in the contract, (3) determining the transaction price, (4) allocating the transaction price to the performance obligations in the contract and (5) recognizing revenue when the performance obligation is satisfied.\nIn determining the transaction price, management evaluates whether the price is subject to refund or adjustment related to variable consideration to determine the net consideration to which we expect to be entitled. We record estimates of variable consideration, which primarily includes rebates/other discounts (cooperative marketing programs, volume-based discounts, shelf price reductions and allowances for shelf space, charges from customers for services they provided to us related to the sale and penalties/fines charged to us by our customers for failing to adhere to contractual obligations), coupon offers, cash discount allowances, and sales returns, as a reduction of sales in the consolidated statements of operations. These estimates are based on the expected value method considering all reasonably available information, including current and past trade promotion spending patterns, status of trade promotion activities and the interpretation of historical spending trends by customer and category, customer agreements and/or currently known factors that arise in the normal course of business. We review our assumptions and adjust these estimates accordingly on a quarterly basis. Our consolidated financial statements could be materially impacted if the actual promotion rates are different from the estimated rates. If our accrual estimates for sales incentives at August 31, 2022 were to differ by 10%, the impact on net sales would be approximately $1.0 million.\nAccounting for Income Taxes\nCurrent income tax expense is the amount of income taxes expected to be payable for the current year. A deferred income tax liability or asset is established for the expected future tax consequences resulting from the differences in financial reporting and tax bases of assets and liabilities. Based on changes in the related tax law as well as forecasted results, a valuation allowance is provided if it is more likely than not that some or all of the deferred tax assets will not be realized. In addition to valuation allowances, we provide for uncertain tax positions when such tax positions do not meet the recognition thresholds or measurement standards prescribed by the authoritative guidance on income taxes. Amounts for uncertain tax positions are adjusted in periods when new information becomes available or when positions are effectively settled. We recognize accrued interest and penalties related to uncertain tax positions as a component of income tax expense.\nWe are required to make assertions on whether our foreign subsidiaries will invest their undistributed earnings indefinitely and these assertions are based on the capital needs of the foreign subsidiaries. Generally, unremitted earnings of our foreign subsidiaries are not considered to be indefinitely reinvested. However, there is an exception regarding specific statutory remittance restrictions imposed on our China subsidiary. Costs associated with repatriating unremitted foreign earnings, including U.S. state income taxes and foreign withholding taxes, are immaterial to our consolidated financial statements. For additional\ninformation on income tax matters, see Part IV-Item 15, Exhibits, Financial Statement Schedules Note 13 - Income Taxes, included in this report.\nRecently Issued Accounting Standards\nInformation on Recently Issued Accounting Standards that could potentially impact our consolidated financial statements and related disclosures is incorporated by reference to Part IV-Item 15, Exhibits, Financial Statement Schedules Note 2 - Basis of Presentation and Summary of Significant Accounting Policies, included in this report. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nForeign Currency Risk\nWe are exposed to a variety of risks, including foreign currency exchange rate fluctuations. In the normal course of business, we employ established policies and procedures to manage our exposure to fluctuations in foreign currency values.\nAll of our international subsidiaries operate in functional currencies other than the U.S. Dollar. As a result, we are exposed to foreign currency related risk when the financial statements of our international subsidiaries are translated for consolidation purposes from functional currencies to U.S. Dollars. This foreign currency risk can affect sales, expenses and profits as well as assets and liabilities that are denominated in currencies other than the U.S. Dollar. We do not enter into any hedging activities to mitigate this foreign currency translation risk.\nOur U.K. subsidiary, whose functional currency is Pound Sterling, utilizes foreign currency forward contracts to limit our exposure to net asset balances held in non-functional currencies. We regularly monitor our foreign exchange exposures to ensure the overall effectiveness of our foreign currency hedge positions. While we engage in foreign currency hedging activity to reduce our risk, for accounting purposes, none of our foreign currency forward contracts are designated as hedges.\nCommodity Price Risk\nSpecialty chemicals and aerosol cans constitute a significant portion of the cost of many of our maintenance products. Volatility in the price of oil directly impacts the cost of specialty chemicals which are indexed to the price of crude oil. If there are significant increases in the costs of crude oil, our gross margins and operating results will be negatively impacted. We do not currently have a strategy or policy to enter into transactions to hedge crude oil price volatility, but we regularly review this policy based on market conditions and other factors.\nInterest Rate Risk\nAs of August 31, 2022, we had a $77.9 million outstanding balance on our existing $150.0 million revolving credit facility agreement with Bank of America. This $150.0 million revolving credit facility is subject to interest rate fluctuations. Under the terms of the credit facility agreement, we may borrow loans in U.S. dollars or in foreign currencies from time to time until September 30, 2025. In addition, we had $68.4 million in fixed rate borrowings consisting of senior notes under our note purchase agreements as of August 31, 2022. For additional details on our long-term borrowings as of August 31, 2022, refer to the information set forth in Part IV-Item 15, Exhibits, Financial Statement Schedules and Note 8 - Debt. Interest rates associated with this revolving credit facility are based on the following rates:\nBloomberg Short-term Bank Yield Index rate (U.S. Dollar borrowings)\nSterling Overnight Index Average Reference Rate (British Pound Sterling borrowings)\nEuro Interbank Offered Rate (Euro borrowings)\nAny significant increase in these rates could have a material effect on interest expense incurred on any borrowings outstanding under the credit facility. Item 8. Financial Statements and Supplementary Data\nOur consolidated financial statements at August 31, 2022 and 2021 and for each of the three fiscal years in the period ended August 31, 2022, and the Report of Independent Registered Public Accounting Firm, are included in Item 15 of this report.\n‎\nQuarterly Financial Data (Unaudited)\nPursuant to amendments in SEC Release No. 33-10890, we have omitted historical quarterly financial data for our business over the last two fiscal year periods as there has not been any retrospective change to the information previously reported. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nThe term disclosure controls and procedures is defined in Rules 13a-15(e) and 15d-15(e) promulgated under the Securities Exchange Act of 1934, as amended (Exchange Act). The term disclosure controls and procedures means controls and other procedures of a Company that are designed to ensure the information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a Company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the Companys management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosures. The Companys Chief Executive Officer and Chief Financial Officer have evaluated the effectiveness of the Companys disclosure controls and procedures as of August 31, 2022, the end of the period covered by this report (the Evaluation Date), and they have concluded that, as of the Evaluation Date, such controls and procedures were effective at ensuring that required information will be disclosed on a timely basis in the Companys reports filed under the Exchange Act. Although management believes the Companys existing disclosure controls and procedures are adequate to enable the Company to comply with its disclosure obligations, management continues to review and update such controls and procedures. The Company has a disclosure committee, which consists of certain members of the Companys senior management.\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, management conducted an evaluation of the effectiveness of its internal control over financial reporting based upon the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013. Based on that evaluation, management concluded that its internal control over financial reporting is effective as of August 31, 2022.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nPricewaterhouseCoopers LLP, independent registered public accounting firm, who audited and reported on the consolidated financial statements of WD-40 Company included in Item 15 of this report, has audited the effectiveness of WD-40 Companys internal control over financial reporting as of August 31, 2022, as stated in their report included in Item 15 of this report.\nChanges in Internal Control over Financial Reporting\nThere were no changes to the Companys internal control over financial reporting that occurred during the Companys most recent fiscal quarter ended August 31, 2022, that materially affected, or would be reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNone.\n‎\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nCertain information required by this item is set forth in sections under the headings Security Ownership of Certain Beneficial Owners and Management, Director Nominees, and Related Party Transactions Review and Oversight in our Proxy Statement to be filed with the Securities and Exchange Commission in connection with the 2022 Annual Meeting of Stockholders on December 13, 2022 (Proxy Statement), which information is incorporated by reference herein. Information regarding executive officers is also incorporated by reference to the Information Regarding our Executive Officers section of our Proxy Statement.\nThe Registrant has a code of ethics (as defined in Item 406 of Regulation S-K under the Exchange Act) applicable to its principal executive officer, principal financial officer, principal accounting officer or controller and persons performing similar functions. The code of ethics is represented by the Registrants Code of Conduct applicable to all employees and directors. A copy of the Code of Conduct may be found on the Registrants internet website on the Corporate Governance link from the Investors page at www.wd40company.com. Item 11. Executive Compensation\nInformation required by this item is incorporated by reference to sections of the Proxy Statement under the headings Director Compensation (and the table following such section), Compensation Committee - Compensation Committee Interlocks and Insider Participation, Compensation Discussion and Analysis, Compensation Committee Report, Executive Compensation (and the compensation tables following such section), Supplemental Death Benefit Plans and Supplemental Insurance Benefits, Change of Control Severance Agreements and CEO Pay Ratio. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nCertain information required by this item is incorporated by reference to the Proxy Statement under the heading Security Ownership of Certain Beneficial Owners and Management.\nEquity Compensation Plan Information\nThe following table provides information regarding shares of our common stock authorized for issuance under equity compensation plans as of August 31, 2022:\nNumber of securities\nremaining available for\nNumber of securities to\nfuture issuance under\nbe issued upon exercise\nWeighted-average exercise\nequity compensation plans\nof outstanding options,\nprice of outstanding options\n(excluding securities\nwarrants and rights\nwarrants and rights\nreflected in column (a))\n(a)\n(b)\n(c)\nPlan category\nEquity compensation plans\napproved by security holders\n136,937\n(1)\n$\n-\n384,859\nEquity compensation plans not\napproved by security holders\nn/a\nn/a\nn/a\n136,937\n(1)\n$\n-\n384,859\n(1) Includes 78,604 securities to be issued pursuant to outstanding restricted stock units; 37,201 securities to be issued pursuant to outstanding market share units (MSUs) based on 100% of the target number of MSU shares to be issued upon achievement of the applicable performance measure specified for such MSUs; 3,306 securities to be issued pursuant to outstanding deferred performance units (DPUs); and 17,826 securities to be issued pursuant to outstanding performance share units (PSUs) based on 100% of the maximum number of PSU shares to be issued upon achievement of the applicable performance measure specified for such PSUs.\n‎ Item 13. Certain Relationships and Related Transactions, and Director Independence\nInformation required by this item is incorporated by reference to the Proxy Statement under the headings Director Independence and Audit Committee - Related Party Transactions Review and Oversight. Item 14. Principal Accountant Fees and Services\nInformation required by this item is incorporated by reference to the Proxy Statement under the heading Ratification of Appointment of Independent Registered Public Accounting Firm.\n‎\nPART IV Item 15. Exhibits, Financial Statement Schedules\nPage\n(a)\nDocuments filed as part of this report\n(1)\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 238)\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Comprehensive Income\nConsolidated Statements of Shareholders Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\n(2) Financial statement schedules are omitted because they are not applicable or the required information is shown in the consolidated financial statements or notes thereto.\n(3) Exhibits\nExhibit\nNo.\nDescription\nArticles of Incorporation and Bylaws.\n3(a)\nCertificate of Incorporation,incorporated by reference from the Registrants Form 10-K filed October 22, 2018, Exhibit 3(a) thereto.\n3(b)\nAmended and Restated Bylaws of WD-40 Company, incorporated by reference from the Registrants Form 8-K filed August 16, 2018, Exhibit 3.1 thereto.\nMaterial Contracts.\nExecutive Compensation Plans and Arrangements (Exhibits 10(a) through 10(s) are management contracts and compensatory plans or arrangements required to be filed as exhibits pursuant to Item 15(b)).\n10(a)\nWD-40 Company 2016 Stock Incentive Plan, incorporated by reference from the Registrants Proxy Statement filed November 3, 2016, Appendix A thereto.\n10(b)\nWD-40 Directors Compensation Policy and Election Plan dated October 12, 2021, incorporated by reference from the Registrants Form 10-K filed October 22, 2021, Exhibit 10(b) thereto.\n10(c)\nForm of Indemnity Agreement between the Registrant and its executive officers and directors, incorporated by reference from the Registrants Form 10-K filed October 22, 2013, Exhibit 10(d) thereto.\n10(d)\nForm of Restricted Stock Unit Agreement for grants of Restricted Stock Units to Executive Officers in fiscal year 2020, incorporated by reference from the Registrants Form 10-K filed October 21, 2020, Exhibit 10(d) thereto.\n10(e)\nForm of Market Share Unit Award Agreement for grants of Market Share Units to Executive Officers in fiscal year 2020, incorporated by reference from the Registrants Form 10-K filed October 21, 2020, Exhibit 10(e) thereto.\n10(f)\nForm of Deferred Performance Unit Award Agreement for grants of Deferred Performance Units to Executive Officers incorporated by reference from the Registrants Form 10-K filed October 21, 2020, Exhibit 10(f) thereto.\n10(g)\nForm of Restricted Stock Unit Agreement for grants of Restricted Stock Units to Executive Officers in fiscal year 2021, incorporated by reference from the Registrants Form 10-K filed October 21, 2020, Exhibit 10(g) thereto.\n10(h)\nForm of Market Share Unit Award Agreement for grants of Market Share Units to Executive Officers in fiscal year 2021 incorporated by reference from the Registrants Form 10-K filed October 21, 2020, Exhibit 10(h) thereto.\n10(i)\nForm of Performance Share Unit Restricted Stock Award Agreement for grants of Performance Share Units to Executive Officers in fiscal year 2021, incorporated by reference from the Registrants Form 10-K filed October 21, 2020, Exhibit 10(i) thereto.\n10(j)\nForm of Restricted Stock Unit Agreement for grants of Restricted Stock Units to Executive Officers in fiscal year 2022, , incorporated by reference from the Registrants Form 10-K filed October 22, 2021, Exhibit 10(j) thereto.\n10(k)\nForm of Market Share Unit Award Agreement for grants of Market Share Units to Executive Officers in fiscal year 2022, incorporated by reference from the Registrants Form 10-K filed October 22, 2021, Exhibit 10(k) thereto.\n‎\n10(l)\nForm of Performance Share Unit Restricted Stock Award Agreement for grants of Performance Share Units to Executive Officers in fiscal year 2022, incorporated by reference from the Registrants Form 10-K filed October 22, 2021, Exhibit 10(l) thereto.\n10(m)\nTransition and Release Agreement, dated March 11, 2022, between WD-40 Company and Garry O. Ridge, incorporated by reference from the Registrants Form 8-K filed March 16, 2022, Exhibit 10.1 thereto.\n10(n)\nFY 2022 Restricted Stock Unit Award Agreement, dated March 11, 2022, between WD-40 Company and Garry O. Ridge, incorporated by reference from the Registrants Form 8-K filed March 16, 2022, Exhibit 10.2 thereto.\n10(o)\nForm of Restricted Stock Unit Agreement for grants of Restricted Stock Units to Executive Officers in fiscal year 2023.\n10(p)\nForm of Market Share Unit Award Agreement for grants of Market Share Units to Executive Officers in fiscal year 2023.\n10(q)\nForm of Performance Share Unit Restricted Stock Award Agreement for grants of Performance Share Units to Executive Officers in fiscal year 2023.\n10(r)\nWD-40 Company 2017 Performance Incentive Compensation Plan, incorporated by reference from the Registrants Proxy Statement filed November 2, 2017, Appendix A thereto.\n10(s)\nForm of WD-40 Company Supplemental Death Benefit Plan applicable to certain executive officers of the Registrant, incorporated by reference from the Registrants Form 10-K filed October 24, 2016, Exhibit 10(i) thereto.\n10(t)\nChange of Control Severance Agreement between WD-40 Company and Jay W. Rembolt dated October 16, 2008, incorporated by reference from the Registrants Form 10-K filed October 21, 2014, Exhibit 10(h) thereto.\n10(u)\nChange of Control Severance Agreement between WD-40 Company and Richard T. Clampitt dated October 15, 2014, incorporated by reference from the Registrants Form 10-K filed October 21, 2014, Exhibit 10(i) thereto.\n10(v)\nChange of Control Severance Agreement between WD-40 Company and Garry O. Ridge dated February 14, 2006, incorporated by reference from the Registrants Form 10-K filed October 23, 2017, Exhibit 10(p) thereto.\n10(w)\nChange of Control Severance Agreement between WD-40 Company and Geoffrey J. Holdsworth dated February 14, 2006, incorporated by reference from the Registrants Form 10-K filed October 23, 2017, Exhibit 10(r) thereto.\n10(x)\nChange of Control Severance Agreement between WD-40 Company and William B. Noble dated February 14, 2006, incorporated by reference from the Registrants Form 10-K filed October 23, 2017, Exhibit 10(s) thereto.\n10(y)\nChange of Control Severance Agreement between WD-40 Company and Steven Brass dated June 22, 2016, incorporated by reference from the Registrants Form 10-Q filed January 9, 2017, Exhibit 10(c) thereto.\n10(z)\nChange of Control Severance Agreement between WD-40 Company and Patricia Q. Olsem dated October 8, 2019, incorporated by reference from the Registrants Form 10-Q filed January 9, 2020, Exhibit 10(a) thereto.\n10(aa)\nChange of Control Severance Agreement between WD-40 Company and Jeffrey G. Lindeman dated December 8, 2020 incorporated by reference from the Registrant's Form 10-Q filed April 8, 2021, Exhibit 10(e) thereto.\n10(ab)\nChange of Control Severance Agreement between WD-40 Company and Phenix Q. Kiamilev dated December 13, 2021, incorporated by reference from the Registrants Form 10-Q filed April 7, 2022, Exhibit 10(b) thereto.\n10(ac)\nCredit Agreement dated March 16, 2020 among WD-40 Company and Bank of America, incorporated by reference from the Registrants Form 8-K filed March 20, 2020, Exhibit 10(a) thereto.\n10(ad)\nForm of Acknowledgement Letter Agreement dated April 8, 2020 among WD-40 Company and Bank of America, incorporated by reference from the Registrants Form 10-Q filed April 9, 2020, Exhibit 10(d) thereto.\n10(ae)\nLibor Transition Agreement dated November 29, 2021 among the Company and Bank of America, N.A., incorporated by reference from the Registrant's Form 8-K filed December 1, 2021, Exhibit 10(a) thereto.\n10(af)\nFirst Amendment to Credit Agreement dated September 30, 2020 among WD-40 Company and Bank of America, N.A., incorporated by reference from the Registrants Form 8-K filed October 6, 2020, Exhibit 10(a) thereto.\n10(ag)\nNote Purchase and Private Shelf Agreement dated November 15, 2017 among WD-40 Company and Prudential and certain Note Purchasers, incorporated by reference from the Registrants Form 8-K filed November 17, 2017, Exhibit 10(a) thereto.\n10(ah)\nFirst Amendment to Note Purchase Agreement dated February 23, 2018 among WD-40 Company and Prudential and certain Note Purchasers, incorporated by reference from the Registrants Form 8-K filed February 27, 2018, Exhibit 10(b) thereto.\n10(ai)\nSecond Amendment to Note Purchase and Private Shelf Agreement dated March 16, 2020 among WD-40 Company and Prudential and certain Note Purchasers, incorporated by reference from the Registrants Form 8-K filed March 20, 2020, Exhibit 10(b) thereto.\n10(aj)\nForm of Limited Consent Letter Agreement dated April 8, 2020 among WD-40 Company and Prudential and certain Note Purchasers, incorporated by reference from the Registrants Form 10-Q filed April 9, 2020, Exhibit 10(e) thereto.\n10(ak)\nThird Amendment to Note Purchase and Private Shelf Agreement dated September 30, 2020 among WD-40 Company and Prudential and certain Note Purchasers, incorporated by reference from the Registrants Form 8-K filed October 6, 2020, Exhibit 10(e) thereto.\n10(al)\nSeries B Senior Notes dated September 30, 2020, incorporated by reference from the Registrants Form 8-K filed October 6, 2020, Exhibit 10(f) thereto.\n10(am)\nSeries C Senior Notes dated September 30, 2020, incorporated by reference from the Registrants Form 8-K filed October 6, 2020, Exhibit 10(g) thereto.\nSubsidiaries of the Registrant.\nConsent of Independent Registered Public Accounting Firm dated October 24, 2022.\n31(a)\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31(b)\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32(a)\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32(b)\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nThe following materials from WD-40 Companys Annual report on Form 10-K for the fiscal year ended August 31, 2022 formatted in iXBRL (Inline eXtensible Business Reporting Language): (i) the Consolidated Statements of Operations, (ii) the Consolidated Statements of Comprehensive Income, (ii) the Consolidated Statements of Cash Flows, (iv) the Consolidated Balance Sheet, (v) the Consolidated Statements of Shareholders Equity, and (vi) Notes to the Consolidated Financial Statements.\nThe cover page from the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2022, formatted in iXBRL and contained in Exhibit 101.\nItem 16. Form 10-K Summary\nNot applicable.\n‎\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this annual report to be signed on its behalf by the undersigned, thereunto duly authorized.\nWD-40 COMPANY\nRegistrant\n/s/ JAY W. REMBOLT\nJAY W. REMBOLT\nVice President, Finance\nTreasurer and Chief Financial Officer\n(Principal Financial Officer)\nDate: October 24, 2022\n/s/ RAE ANN PARTLO\nRAE ANN PARTLO\nVice President and Corporate Controller\n(Principal Accounting Officer)\nDate: October 24, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\n/s/ STEVEN A. BRASS\nSTEVEN A. BRASS\nChief Executive Officer and Director\n(Principal Executive Officer)\nDate: October 24, 2022\n/s/ DANIEL T. CARTER\n/s/ GRACIELA I. MONTEAGUDO\nDANIEL T. CARTER, Director\nGRACIELA I. MONTEAGUDO, Director\nDate: October 24, 2022\nDate: October 24, 2022\n‎\n/s/ MELISSA CLAASSEN\n/s/ DAVID B. PENDARVIS\nMELISSA CLAASSEN, Director\nDAVID B. PENDARVIS, Director\nDate: October 24, 2022\nDate: October 24, 2022\n/s/ ERIC P. ETCHART\n/s/ GARRY O. RIDGE\nERIC P. ETCHART, Director\nGARRY O. RIDGE, Director\nDate: October 24, 2022\nDate: October 24, 2022\n/s/ LARA L. LEE\n/s/ GREGORY A. SANDFORT\nLARA L. LEE, Director\nGREGORY A. SANDFORT, Director\nDate: October 24, 2022\nDate: October 24, 2022\n/s/ EDWARD O. MAGEE, JR.\n/s/ ANNE G. SAUNDERS\nEDWARD O. MAGEE, JR., Director\nANNE G. SAUNDERS, Director\nDate: October 24, 2022\nDate: October 24, 2022\n/s/ TREVOR I. MIHALIK\nTREVOR I. MIHALIK, Director\nDate: October 24, 2022\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of WD-40 Company\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of WD-40 Company and its subsidiaries (the Company) as of August 31, 2022 and 2021, and the related consolidated statements of operations, of comprehensive income, of shareholders' equity and of cash flows for each of the three years in the period ended August 31, 2022, including the related notes (collectively referred to as the consolidated financial statements). We also have audited the Company's internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended August 31, 2022 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Managements Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Companys consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRebates - Certain Cooperative Marketing Program Accruals\nAs described in Notes 2 and 11 to the consolidated financial statements, sales are recorded net of allowances for damaged goods and other sales returns, sales incentives, trade promotions and cash discounts. In determining the transaction price, management evaluates whether the price is subject to refund or adjustment related to variable consideration to determine the net consideration to which the Company expects to be entitled. Management records estimates of variable consideration, which primarily includes rebates/other discounts (cooperative marketing programs, volume-based discounts, shelf price reductions and allowances for shelf space, charges from customers for services they provide to the Company related to the sale and penalties/fines charged to the Company by customers associated with failing to adhere to contractual obligations), coupon offers, cash discount allowances, and sales returns, as a reduction of sales in its consolidated statements of operations. These estimates are based on the expected value method considering all reasonably available information, including current and past trade promotion spending patterns, status of trade promotion activities, the interpretation of historical spending trends by customer and category, customer agreements and/or currently known factors that arise in the normal course of business. Management reviews its assumptions and adjusts these estimates accordingly on a quarterly basis. The Company had an $8.7 million balance in rebate/other discount liabilities as of August 31, 2022, which are included in accrued liabilities on the Companys consolidated balance sheets, and recorded approximately $32.8 million in rebates/other discounts as a reduction to sales during fiscal year 2022.\nThe principal considerations for our determination that performing procedures relating to certain cooperative marketing program accruals is a critical audit matter are (i) the significant judgment by management to estimate certain cooperative marketing program accruals, which in turn led to a high degree of auditor judgment in performing procedures to evaluate the status of trade promotion activities within certain cooperative marketing program accruals, and (ii) the high level of audit effort and subjectivity in performing procedures to evaluate the current and past trade promotion spending patterns and the status of trade promotion activities used to determine certain cooperative marketing program accruals.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the estimation of cooperative marketing program accruals, which related to controls over the current and past trade promotion spending patterns and the status of trade promotion activities used in managements estimate. These procedures also included, among others, (i) testing managements process to estimate certain cooperative marketing program accruals, including evaluating the appropriateness of the expected value method, testing the completeness, accuracy and relevance of underlying data used, including the current and past trade promotion spending patterns, and evaluating the reasonableness of the status of the trade promotion activities assumption considering the overall business environment, and (ii) evaluating the completeness of offers made to customers for potential promotional activities, which may require accrual as of period end.\n/s/ PricewaterhouseCoopers LLP\nSan Diego, California\nOctober 24, 2022\nWe have served as the Companys auditor since at least 1972. We have not been able to determine the specific year we began serving as auditor of the Company.\n‎\nWD-40 COMPANY\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except share and per share amounts)\nAugust 31,\nAugust 31,\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n37,843\n$\n85,961\nTrade and other accounts receivable, less allowance for doubtful\naccounts of $292 and $463 at August 31, 2022\nand 2021, respectively\n89,930\n89,558\nInventories\n104,101\n55,752\nOther current assets\n17,766\n9,948\nTotal current assets\n249,640\n241,219\nProperty and equipment, net\n65,977\n70,145\nGoodwill\n95,180\n95,869\nOther intangible assets, net\n5,588\n7,244\nOperating lease right-of-use assets\n7,559\n8,824\nDeferred tax assets, net\nOther assets\n9,672\n6,044\nTotal assets\n$\n434,295\n$\n430,203\nLiabilities and Shareholders' Equity\nCurrent liabilities:\nAccounts payable\n$\n32,852\n$\n33,499\nAccrued liabilities\n27,161\n25,658\nAccrued payroll and related expenses\n11,583\n25,662\nShort-term borrowings\n39,173\nIncome taxes payable\nTotal current liabilities\n110,820\n85,936\nLong-term borrowings\n107,139\n114,940\nDeferred tax liabilities, net\n10,528\n10,401\nLong-term operating lease liabilities\n5,999\n7,062\nOther long-term liabilities\n11,185\n11,482\nTotal liabilities\n245,671\n229,821\nCommitments and Contingencies (Note 12)\nShareholders' equity:\nCommon stock - authorized 36,000,000 shares, $0.001 par value;\n19,888,807 and 19,856,865 shares issued at August 31, 2022 and 2021,\nrespectively; and 13,602,346 and 13,708,966 shares outstanding at\nAugust 31, 2022 and 2021, respectively\nAdditional paid-in capital\n165,973\n163,737\nRetained earnings\n456,076\n430,735\nAccumulated other comprehensive income (loss)\n(36,209)\n(26,030)\nCommon stock held in treasury, at cost - 6,286,461 and 6,147,899\nshares at August 31, 2022 and 2021, respectively\n(397,236)\n(368,080)\nTotal shareholders' equity\n188,624\n200,382\nTotal liabilities and shareholders' equity\n$\n434,295\n$\n430,203\nSee accompanying notes to consolidated financial statements.\nWD-40 COMPANY\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands, except per share amounts)\nFiscal Year Ended August 31,\nNet sales\n$\n518,820\n$\n488,109\n$\n408,498\nCost of products sold\n264,055\n224,370\n185,481\nGross profit\n254,765\n263,739\n223,017\nOperating expenses:\nSelling, general and administrative\n138,658\n145,493\n121,980\nAdvertising and sales promotion\n27,343\n27,956\n21,606\nAmortization of definite-lived intangible assets\n1,434\n1,449\n2,211\nTotal operating expenses\n167,435\n174,898\n145,797\nIncome from operations\n87,330\n88,841\n77,220\nOther income (expense):\nInterest income\nInterest expense\n(2,742)\n(2,395)\n(2,439)\nOther (expense) income, net\n(582)\n(28)\nIncome before income taxes\n84,108\n86,499\n75,515\nProvision for income taxes\n16,779\n16,270\n14,805\nNet income\n$\n67,329\n$\n70,229\n$\n60,710\nEarnings per common share:\nBasic\n$\n4.91\n$\n5.11\n$\n4.41\nDiluted\n$\n4.90\n$\n5.09\n$\n4.40\nShares used in per share calculations:\nBasic\n13,668\n13,698\n13,691\nDiluted\n13,696\n13,733\n13,719\nSee accompanying notes to consolidated financial statements.\n‎\nWD-40 COMPANY\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\nFiscal Year Ended August 31,\nNet income\n$\n67,329\n$\n70,229\n$\n60,710\nOther comprehensive income (loss):\nForeign currency translation adjustment\n(10,179)\n2,178\n4,274\nTotal comprehensive income\n$\n57,150\n$\n72,407\n$\n64,984\nSee accompanying notes to consolidated financial statements.\nWD-40 COMPANY\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\n(In thousands, except share and per share amounts)\nAccumulated\nAdditional\nOther\nTotal\nCommon Stock\nPaid-in\nRetained\nComprehensive\nTreasury Stock\nShareholders'\nShares\nAmount\nCapital\nEarnings\nIncome (Loss)\nShares\nAmount\nEquity\nBalance at August 31, 2019\n19,773,977\n$\n$\n155,132\n$\n374,060\n$\n(32,482)\n6,055,316\n$\n(351,255)\n$\n145,475\nIssuance of common stock under share-based\ncompensation plan, net of shares withheld for taxes\n38,708\n(2,640)\n(2,640)\nStock-based compensation\n5,358\n5,358\nCash dividends ($2.62 per share)\n(36,039)\n(36,039)\nRepurchases of common stock\n92,583\n(16,825)\n(16,825)\nForeign currency translation adjustment\n4,274\n4,274\nNet income\n60,710\n60,710\nBalance at August 31, 2020\n19,812,685\n$\n$\n157,850\n$\n398,731\n$\n(28,208)\n6,147,899\n$\n(368,080)\n$\n160,313\nIssuance of common stock under share-based\ncompensation plan, net of shares withheld for taxes\n44,180\n(3,668)\n(3,668)\nStock-based compensation\n9,555\n9,555\nCash dividends ($2.78 per share)\n(38,225)\n(38,225)\nForeign currency translation adjustment\n2,178\n2,178\nNet income\n70,229\n70,229\nBalance at August 31, 2021\n19,856,865\n$\n$\n163,737\n$\n430,735\n$\n(26,030)\n6,147,899\n$\n(368,080)\n$\n200,382\nIssuance of common stock under share-based\ncompensation plan, net of shares withheld for taxes\n31,942\n(4,461)\n(4,461)\nStock-based compensation\n6,697\n6,697\nCash dividends ($3.06 per share)\n(41,988)\n(41,988)\nRepurchases of common stock\n138,562\n(29,156)\n(29,156)\nForeign currency translation adjustment\n(10,179)\n(10,179)\nNet income\n67,329\n67,329\nBalance at August 31, 2022\n19,888,807\n$\n$\n165,973\n$\n456,076\n$\n(36,209)\n6,286,461\n$\n(397,236)\n$\n188,624\nSee accompanying notes to consolidated financial statements.\nWD-40 COMPANY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nFiscal Year Ended August 31,\nOperating activities:\nNet income\n$\n67,329\n$\n70,229\n$\n60,710\nAdjustments to reconcile net income to net cash provided by\noperating activities:\nDepreciation and amortization\n8,294\n7,019\n7,701\nNet gains on sales and disposals of property and equipment\n(311)\n(249)\n(124)\nDeferred income taxes\n(1,334)\n(509)\nStock-based compensation\n6,697\n9,555\n5,358\nUnrealized foreign currency exchange losses (gains), net\n1,035\n(511)\nProvision for bad debts\nChanges in assets and liabilities:\nTrade and other accounts receivable\n(7,443)\n(6,595)\n(4,499)\nInventories\n(52,665)\n(13,774)\nOther assets\n(12,578)\n(5,343)\nOperating lease assets and liabilities, net\n(32)\nAccounts payable and accrued liabilities\n5,208\n15,485\n2,725\nAccrued payroll and related expenses\n(13,133)\n10,702\n(1,042)\nOther long-term liabilities and income taxes payable\n(536)\n(695)\nNet cash provided by operating activities\n2,604\n84,714\n72,664\nInvesting activities:\nPurchases of property and equipment\n(8,303)\n(15,059)\n(19,307)\nProceeds from sales of property and equipment\nNet cash used in investing activities\n(7,691)\n(14,460)\n(18,945)\nFinancing activities:\nTreasury stock purchases\n(29,156)\n-\n(16,825)\nDividends paid\n(41,988)\n(38,225)\n(36,039)\nProceeds from issuance of long-term senior notes\n-\n52,000\n-\nRepayments of long-term senior notes\n(800)\n(800)\n(800)\nNet proceeds (repayments) from revolving credit facility\n38,394\n(50,056)\n29,595\nShares withheld to cover taxes upon conversion of equity awards\n(4,461)\n(3,668)\n(2,640)\nNet cash used in financing activities\n(38,011)\n(40,749)\n(26,709)\nEffect of exchange rate changes on cash and cash equivalents\n(5,020)\n(6)\n2,219\nNet (decrease) increase in cash and cash equivalents\n(48,118)\n29,499\n29,229\nCash and cash equivalents at beginning of period\n85,961\n56,462\n27,233\nCash and cash equivalents at end of period\n$\n37,843\n$\n85,961\n$\n56,462\nSupplemental cash flow information:\nAccrued capital expenditures\n1,123\n1,764\nCash paid for:\nInterest\n$\n2,687\n$\n2,319\n$\n2,259\nIncome taxes, net of tax refunds received\n$\n18,345\n$\n19,254\n$\n12,569\nSee accompanying notes to consolidated financial statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1. The Company\nWD-40 Company (the Company), incorporated in Delaware and based in San Diego, California, is a global marketing organization dedicated to creating positive lasting memories by developing and selling products that solve problems in workshops, factories and homes around the world. The Company owns a wide range of well-known brands that include maintenance products and homecare and cleaning products: WD-40® Multi-Use Product, WD-40 Specialist®, 3-IN-ONE®, GT85®, X-14®, 2000 Flushes®, Carpet Fresh®, no vac®, Spot Shot®, 1001®, Lava® and Solvol®.\nThe Companys products are sold in various locations around the world. Maintenance products are sold worldwide in markets throughout North, Central and South America, Asia, Australia, Europe, the Middle East and Africa. Homecare and cleaning products are sold primarily in North America, the United Kingdom (U.K.) and Australia. The Companys products are sold primarily through warehouse club stores, hardware stores, automotive parts outlets, industrial distributors and suppliers, mass retail and home center stores, value retailers, grocery stores, online retailers, farm supply, sport retailers, and independent bike dealers.\nNote 2. Basis of Presentation and Summary of Significant Accounting Policies\nBasis of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries. All intercompany transactions and balances have been eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates.\nCOVID-19 Considerations\nThe COVID-19 pandemic has adversely impacted global economic conditions and has contributed to significant volatility in financial markets beginning in early calendar year 2020. Although the Companys current estimates consider current conditions, the inputs into certain of the Companys significant and critical accounting estimates include judgments and assumptions about the economic implications of the COVID-19 pandemic and how management expects them to change in the future, as appropriate. It is reasonably possible that actual results experienced may differ materially from the Companys estimates in future periods, which could materially affect our results of operations and financial condition.\nCash and Cash Equivalents\nCash equivalents are highly liquid investments purchased with an original maturity of three months or less.\nTrade Accounts Receivable and Allowance for Doubtful Accounts\nTrade accounts receivable are recorded at the invoiced amount and do not bear interest. The allowance for doubtful accounts is the Companys best estimate of the amount of probable credit losses in existing accounts receivable. The Company determines the allowance for doubtful accounts based on historical write-off experience and the identification of specific balances deemed uncollectible. Trade accounts receivable are charged against the allowance when the Company believes it is probable that the trade accounts receivable will not be recovered. The Company does not have any off-balance sheet credit exposure related to its customers. Allowance for doubtful accounts related to the Companys trade accounts receivable were not significant at August 31, 2022 and 2021.\n‎\nInventories\nInventories are stated at the lower of cost or net realizable value. Cost is determined primarily based on a first-in, first-out method or, for a portion of raw materials inventory, the average cost method. When necessary, the Company adjusts the carrying value of its inventory to the lower of cost or net realizable value, including any costs to sell or dispose of such inventory. Appropriate consideration is given by the Company to obsolescence, excessive inventory levels, product deterioration and other factors when evaluating net realizable value for the purposes of determining the lower of cost or net realizable value.\nIncluded in inventories are amounts for certain raw materials and components that the Company has provided to its third-party contract manufacturers but that remain unpaid to the Company as of the balance sheet date. The Companys contract manufacturers package products to the Companys specifications and, upon order from the Company, ship ready-to-sell inventory to either the Companys third-party distribution centers or directly to its customers. The Company transfers certain raw materials and components to these contract manufacturers for use in the manufacturing process. Contract manufacturers are obligated to pay the Company for these raw materials and components. Amounts receivable from the contract manufacturers as of the balance sheet date related to transfers of these raw materials and components by the Company to its contract manufacturers are generally considered product held at third-party contract manufacturers and are included in inventories in the accompanying consolidated balance sheets.\nProperty and Equipment\nProperty and equipment is stated at cost. Depreciation is computed using the straight-line method based upon estimated useful lives of ten to forty years for buildings and improvements, three to fifteen years for machinery and equipment, three to five years for vehicles, three to ten years for furniture and fixtures, three to seven years for R&D lab equipment and office equipment and three to five years for computer equipment. Depreciation expense totaled $6.9 million, $5.6 million and $5.5 million for fiscal years 2022, 2021 and 2020, respectively. These amounts include equipment depreciation expense which is recognized as cost of products sold and totaled $2.5 million in fiscal year 2022, $1.2 million in fiscal year 2021 and $1.4 million in fiscal year 2020.\nInternal-Use Software and Cloud Computing Arrangements\nThe Company capitalizes costs related to computer software obtained or developed for internal use. Software obtained for internal use has generally been enterprise-level business and finance software that the Company customizes to meet its specific operational needs. Costs incurred in the application development phase are capitalized as property and equipment in the Companys consolidated balance sheets and are depreciated using the straight-line method over their estimated useful lives.\nThe Company also enters into certain cloud-based software hosting arrangements. In evaluating whether cloud computing arrangements include an embedded internal-use software license, management considers whether the Company has the contractual right to take possession of the software during the hosting period without significant penalty and whether it is feasible to either i) run the software on the Companys hardware, or ii) contract with another party unrelated to the vendor to host the software. If management determines a cloud computing arrangement includes an embedded software license, the Company accounts for the software license element of the arrangement consistent with the acquisition of other internal-use software licenses. If a cloud computing arrangement does not include a software license, the Company accounts for the arrangement as a service contract. For such cloud computing service contracts, the Company capitalizes certain implementation costs such as the configuration, coding and customization of the software. Capitalizable cloud computing arrangement costs are generally consistent with those incurred during the application development stage for internal-use software, however, these costs are capitalized as other assets in the Companys consolidated balance sheets. The Company amortizes these capitalized cloud computing implementation costs into selling, general and administrative expenses using the straight-line method over the fixed, non-cancellable term of the associated hosting arrangement, plus any reasonably certain renewal periods.\nThe useful lives of the Companys internal-use software and capitalized cloud computing implementation costs are generally three to five years. However, the useful lives of major information system installations such as implementations of enterprise resource planning (ERP) systems are determined on an individual basis and may exceed five years depending on the estimated period of use. The Company applies the same impairment model to both internal-use software and capitalized cloud computing implementation costs.\nLeases\nThe Company leases real estate for its regional sales offices, a research and development facility, and offices located at its international subsidiaries and branch locations. In addition, the Company leases a fleet of automobiles. The Company has also identified warehouse leases within certain third-party distribution center service contracts. To determine if a contract contains a lease, the Company assesses its contracts and determines if there is an identified asset for which the Company has obtained the right to control, as defined in ASC 842. Right-of-use (ROU) assets and lease liabilities are recognized based on the present\nvalue of lease payments over the lease term with lease expense recognized over the term of the lease. As the Companys leases typically do not contain a readily determinable implicit rate, the Company determines the present value of the lease liability using its estimated secured incremental borrowing rate at the lease commencement date based on the lease term and the currency of the lease on a collateralized basis.\nLease agreements may contain rent escalation clauses, renewal or termination options, and rent holidays, amongst other features. ROU assets include amounts for scheduled rent increases. The lease term includes the non-cancelable period of the lease and options to extend or terminate the lease when it is reasonably certain the Company will exercise those options, and is reviewed in subsequent periods if a triggering event occurs. The Company has made the accounting policy election to use certain ongoing practical expedients made available by ASC 842 to: (i) not separate lease components from non-lease components for real estate - office buildings, machinery and equipment, lab equipment, office equipment, furniture and fixtures, and IT equipment; and (ii) exclude leases with an initial term of 12 months or less (short-term leases) from the consolidated balance sheets and recognize related lease payments in the consolidated statements of operations on a straight-line basis over the lease term.\nGoodwill\nGoodwill represents the excess of the purchase price over the fair value of tangible and intangible assets acquired. The carrying value of goodwill is reviewed for possible impairment in accordance with the authoritative guidance on goodwill, intangibles and other. The Company assesses possible impairments to goodwill at least annually during its second fiscal quarter and otherwise when events or changes in circumstances indicate that an impairment condition may exist. In performing the annual impairment test of its goodwill, the Company considers the fair value concepts of a market participant and the highest and best use for its intangible assets. In addition to the annual impairment test, goodwill is evaluated each reporting period to determine whether events and circumstances would more likely than not reduce the fair value of a reporting unit below its carrying value.\nWhen testing goodwill for impairment, the Company first assesses qualitative factors to determine whether it is necessary to perform a quantitative goodwill impairment test. If, after assessing qualitative factors, the Company determines it is not more likely than not that the fair value of a reporting unit is less than its carrying amount, then performing a quantitative test is unnecessary. Otherwise, a quantitative test is performed to identify the potential impairment and to measure the amount of goodwill impairment, if any. The Company also performs a quantitative assessment periodically, regardless of the results of the qualitative assessments. Any required impairment losses are recorded as a reduction in the carrying amount of the related asset and charged to results of operations. No goodwill impairments were identified by the Company during fiscal years 2022, 2021 or 2020.\nSubsequent Measurement of Long-lived Assets\nThe Companys long-lived assets consist of property and equipment and definite-lived intangible assets. Long-lived assets are depreciated or amortized, as applicable, on a straight-line basis over their estimated useful lives. The Company assesses for potential impairments to its long-lived assets when there is evidence that events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable and/or its remaining useful life may no longer be appropriate. Any required impairment loss would be measured as the amount by which the assets carrying amount exceeds its fair value, which is the amount at which the asset could be bought or sold in a current transaction between willing market participants and would be recorded as a reduction in the carrying amount of the related asset and a charge to results of operations. An impairment loss would be recognized when the sum of the expected future undiscounted net cash flows is less than the carrying amount of the asset. No impairments to its long-lived assets were identified by the Company during fiscal years 2022, 2021 or 2020.\nFair Value of Financial Instruments\nAccounting Standards Codification (ASC) 820, Fair Value Measurements and Disclosures, defines fair value as the exchange price that would be received for an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The Company categorizes its financial assets and liabilities measured at fair value into a hierarchy that categorizes fair value measurements into the following three levels based on the types of inputs used in measuring their fair value:\nLevel 1: Observable inputs such as quoted market prices in active markets for identical assets or liabilities;\nLevel 2: Observable market-based inputs or observable inputs that are corroborated by market data; and\nLevel 3: Unobservable inputs reflecting the Companys own assumptions.\nUnder fair value accounting, assets and liabilities are classified in their entirety based on the lowest level of input that is significant to the fair value measurement. As of August 31, 2022, the Company had no assets or liabilities that are measured at fair value in the financial statements on a recurring basis, with the exception of the foreign currency forward contracts, which are classified as Level 2 within the fair value hierarchy. The carrying values of cash equivalents and short-term borrowings are recorded at\ncost, which approximates their fair values, primarily due to their short-term nature. In addition, the carrying value of borrowings held under the Companys revolving credit facility approximates fair value, based on Level 2 inputs, due to the variable nature of underlying interest rates, which generally reflect market conditions. The Companys fixed rate long-term borrowings consist of senior notes and are recorded at carrying value. The Company estimates that the fair value of its senior notes, based on Level 2 inputs, was approximately $63.4 million as of August 31, 2022, which was determined based on a discounted cash flow analysis using current market interest rates for instruments with similar terms, compared to their carrying value of $68.4 million. During the fiscal years ended August 31, 2022, 2021 and 2020, the Company did not record any significant nonrecurring fair value measurements for assets or liabilities in periods subsequent to their initial recognition.\nConcentration of Credit Risk\nFinancial instruments, which potentially subject the Company to significant concentrations of credit risk, consist principally of cash and cash equivalents and trade accounts receivable. The Companys policy is to place its cash in high credit quality financial institutions, in investments that include demand deposits, term deposits and callable time deposits. The Companys trade accounts receivable are derived from customers located in North America, South America, Asia-Pacific, Europe, the Middle East, Africa and India. The Company limits its credit exposure from trade accounts receivable by performing on-going credit evaluations of customers, as well as insuring its trade accounts receivable in selected markets.\nConcentration of Supplier Risk\nThe Company relies on a limited number of suppliers, including single or sole source suppliers for certain of its raw materials, packaging, product components and other necessary supplies. Where possible and where it makes business sense, the Company works with secondary or multiple suppliers to qualify additional supply sources. Historically, the Company has been able to obtain adequate supplies of these materials which are used in the production of its maintenance products and homecare and cleaning products in a timely manner from existing sources and has been able to access adequate production capacity at its third-party manufacturers. However, during the COVID-19 pandemic, the Company has experienced challenges within its supply chain. These challenges include general aerosol production capacity constraints primarily due to increased demand at the third-party manufacturers that the Company utilizes as well as shortages of certain raw materials and increased costs.\nInsurance Coverage\nThe Company carries insurance policies to cover insurable risks such as property damage, business interruption, product liability, cyber liability, workers compensation and other risks, with coverage and other terms that it believes to be adequate and appropriate. These policies may be subject to applicable deductible or retention amounts, coverage limitations and exclusions. The Company does not maintain self-insurance with respect to its material risks; therefore, the Company has not provided for self-insurance reserves as of August 31, 2022 and 2021.\nRevenue Recognition\nThe Company recognizes revenue related to the sale of products when it satisfies a performance obligation in an amount reflecting the consideration to which it expects to be entitled. Sales are recorded net of allowances for damaged goods and other sales returns, sales incentives, trade promotions and cash discounts. The Company applies a five-step approach in determining the amount and timing of revenue to be recognized which includes the following: (1) identifying the contract with a customer, (2) identifying the performance obligations in the contract, (3) determining the transaction price, (4) allocating the transaction price to the performance obligations in the contract and (5) recognizing revenue when the performance obligation is satisfied.\nIn determining the transaction price, the Company evaluates whether the price is subject to refund or adjustment related to variable consideration to determine the net consideration to which the Company expects to be entitled. The Company records estimates of variable consideration, which primarily includes rebates/other discounts (cooperative marketing programs, volume-based discounts, shelf price reductions and allowances for shelf space, charges from customers for services they provided to us related to the sale and penalties/fines charged to us by customers associated with failing to adhere to contractual obligations), coupon offers, cash discount allowances, and sales returns, as a reduction of sales in its consolidated statements of operations. These estimates are based on the expected value method considering all reasonably available information, including current and past trade promotion spending patterns, status of trade promotion activities, the interpretation of historical spending trends by customer and category, customer agreements and/or currently known factors that arise in the normal course of business. The Company reviews its assumptions and adjusts these estimates accordingly on a quarterly basis.\n‎\nCost of Products Sold\nCost of products sold primarily includes the cost of products manufactured on the Companys behalf by its third-party contract manufacturers, net of volume and other rebates. Cost of products sold also includes the costs to manufacture WD-40 concentrate, which is done at the Companys own facilities or at third-party contract manufacturers. When the concentrate is manufactured by the Company, cost of products sold includes direct labor, direct materials and supplies; in-bound freight costs related to purchased raw materials and finished product; and depreciation of machinery and equipment used in the manufacturing process. In addition, cost of products sold includes fees charged to the Company by its third-party distribution centers to warehouse and administer finished products once they are received from the Companys third-party contract manufacturers.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses include costs related to selling the Companys products, such as the cost of the sales force and broker commissions; shipping and handling costs paid to third-party companies to distribute finished goods from the Companys third-party contract manufacturers and distribution centers to its customers; other general and administrative costs related to the Companys business such as general overhead, legal and accounting fees, insurance, and depreciation; and employee-related and various other costs to support marketing, human resources, finance, supply chain, information technology and research and development activities.\nShipping and Handling Costs\nShipping and handling costs associated with the movement of finished goods from third-party contract manufacturers to the Companys third-party distribution centers and from one third-party distribution center to another are capitalized in the cost of inventory and subsequently included in cost of sales when the sale to the customer is recognized in the statement of operations. Shipping and handling costs associated with out-bound transportation are included in selling, general and administrative expenses and are recorded at the time of shipment of product to the Companys customers. Out-bound shipping and handling costs were $18.6 million, $16.5 million and $12.9 million for fiscal years 2022, 2021 and 2020, respectively.\nAdvertising and Sales Promotion Expenses\nAdvertising and sales promotion expenses are expensed as incurred. Advertising and sales promotion expenses include costs associated with promotional activities that the Company pays to third parties, which include costs for advertising (television, print media and internet), administration of coupon programs, consumer promotions, product demonstrations, public relations, agency costs, package design expenses and market research costs as well as market and sales data analyses. Advertising and sales promotion expenses also include product samples which are given to customers and are initiated by the Company and costs associated with shared marketing fund programs that the Company has in place with its marketing distributor customers. Total advertising and sales promotion expenses were $27.3 million, $28.0 million and $21.6 million for fiscal years 2022, 2021 and 2020, respectively.\nResearch and Development\nThe Company is involved in research and development efforts that include the ongoing development or innovation of new products and the improvement, extension or renovation of existing products or product lines. All research and development costs are expensed as incurred and are included in selling, general and administrative expenses. Research and development expenses were $5.1 million, $5.6 million and $6.0 million in fiscal years 2022, 2021 and 2020, respectively. These expenses include costs associated with general research and development activities, as well as those associated with internal staff, overhead, design testing, market research and consultants.\nIncome Taxes\nCurrent income tax expense is the amount of income taxes expected to be payable for the current year. A deferred income tax liability or asset is established for the expected future tax consequences resulting from the differences in financial reporting and tax basis of assets and liabilities. A valuation allowance is provided if it is more likely than not that some or all of the deferred tax assets will not be realized. In addition to valuation allowances, the Company provides for uncertain tax positions when such tax positions do not meet the recognition thresholds or measurement standards prescribed by the authoritative guidance on income taxes. Amounts for uncertain tax positions are adjusted in periods when new information becomes available or when positions are effectively settled. The Company recognizes accrued interest and penalties related to uncertain tax positions as a component of income tax expense.\nThe Company is required to make assertions on whether its foreign subsidiaries will invest their undistributed earnings indefinitely and these assertions are based on the capital needs of the foreign subsidiaries. Generally, unremitted earnings of the\nCompanys foreign subsidiaries are not considered to be indefinitely reinvested. However, there is an exception regarding specific statutory remittance restrictions imposed on the Companys China subsidiary. Costs associated with repatriating unremitted foreign earnings, including U.S. state income taxes and foreign withholding taxes, are immaterial to the Companys consolidated financial statements. For additional information on income tax matters, see Part IV-Item 15, Exhibits, Financial Statement Schedules Note 13 - Income Taxes, included in this report.\nForeign Currency\nThe Company translates the assets and liabilities of its foreign subsidiaries into U.S. Dollars at current rates of exchange in effect at the end of the reporting period. Income and expense items are translated at rates that approximate the rates in effect at the transaction date. Gains and losses from translation are included in accumulated other comprehensive income or loss. Gains or losses resulting from foreign currency transactions (transactions denominated in a currency other than the entitys functional currency) are included as other income in the Companys consolidated statements of operations. The Company had $1.1 million and $0.3 million in net losses, and $0.4 million of net gains in foreign currency transactions in fiscal years 2022, 2021 and 2020, respectively.\nIn the normal course of business, the Company employs established policies and procedures to manage its exposure to fluctuations in foreign currency exchange rates. The Company utilizes foreign currency forward contracts to limit its exposure to net asset balances held in non-functional currencies, primarily at its U.K. subsidiary. The Company regularly monitors its foreign currency exchange rate exposures to ensure the overall effectiveness of its foreign currency hedge positions. While the Company engages in foreign currency hedging activity to reduce its risk, for accounting purposes, none of its foreign currency forward contracts are designated as hedges.\nForeign currency forward contracts are carried at fair value, with net realized and unrealized gains and losses recognized in other income (expense), net in the Companys consolidated statements of operations. Cash flows from settlements of foreign currency forward contracts are included in operating activities in the consolidated statements of cash flows. Foreign currency forward contracts in an asset position at the end of the reporting period are included in other current assets, while foreign currency forward contracts in a liability position at the end of the reporting period are included in accrued liabilities in the Companys consolidated balance sheets. At August 31, 2022, the Company had a notional amount of $5.8 million outstanding in foreign currency forward contracts, which matured in September 2022. Unrealized net gains and losses related to foreign currency forward contracts were not significant at August 31, 2022 or 2021. Realized net losses related to foreign currency forward contracts were not significant for the fiscal years ended August 31, 2022 and 2021. Both unrealized and realized net gains and losses are recorded in other income on the Companys consolidated statements of operations.\nEarnings per Common Share\nUnvested share-based payment awards that contain nonforfeitable rights to dividends or dividend equivalents, whether paid or unpaid, are participating securities that are required to be included in the computation of earnings per common share pursuant to the two-class method. Accordingly, the Companys outstanding unvested, if any, and outstanding vested stock-based equity awards that provide such nonforfeitable rights to dividend equivalents are included as participating securities in the calculation of earnings per common share (EPS) pursuant to the two-class method.\nThe Company calculates EPS using the two-class method, which provides for an allocation of net income between common stock and other participating securities based on their respective participation rights to share in dividends. Basic EPS is calculated by dividing net income available to common shareholders for the period by the weighted-average number of common shares outstanding during the period. Net income available to common shareholders for the period includes dividends paid to common shareholders during the period plus a proportionate share of undistributed net income allocable to common shareholders for the period; the proportionate share of undistributed net income allocable to common shareholders for the period is based on the proportionate share of total weighted-average common shares and participating securities outstanding during the period.\nDiluted EPS is calculated by dividing net income available to common shareholders for the period by the weighted-average number of common shares outstanding during the period increased by the weighted-average number of potentially dilutive common shares (dilutive securities) that were outstanding during the period if the effect is dilutive. Dilutive securities are comprised of various types of stock-based equity awards granted under the Companys prior and current equity incentive plans.\nStock-based Compensation\nThe Company accounts for stock-based equity awards exchanged for employee and non-employee director services in accordance with the authoritative guidance for share-based payments. Stock-based equity awards are measured at the estimated grant date fair value and expensed on a straight-line basis, net of forfeitures recognized as they occur, over the requisite service period. The requisite service period of employee awards generally ranges from about one to three years, although awards of certain employees\nmay have shorter requisite service periods as a result of retirement, death and disability provisions. Director awards vest immediately at the grant date. Compensation expense related to the Companys stock-based equity awards is recorded as selling, general and administrative expenses in the Companys consolidated statements of operations.\nThe Company does not currently grant stock options. The fair values of restricted stock unit awards and performance share unit awards are based on the fair value of the Companys common stock on the date that such awards are granted. The fair value of market share unit awards is determined using a Monte Carlo simulation model. For the performance share unit awards, the Company adjusts the compensation expense over the service period based upon the expected achievement level of the applicable performance condition. As the grant date fair value of market share unit awards reflects the probabilities of the actual number of such awards expected to vest, compensation expense for such awards is not adjusted based on the expected achievement level of the applicable performance condition. The Company records any excess tax benefits or deficiencies from settlements of its stock-based equity awards within the provision for income taxes on the Companys consolidated statements of operations in the reporting periods in which the settlement of the equity awards occur.\nSegment Information\nThe Company discloses certain information about its business segments, which are determined consistent with the way the Companys Chief Operating Decision Maker organizes and evaluates financial information internally for making operating decisions and assessing performance. In addition, the Chief Operating Decision Maker assesses and measures revenue based on product groups.\nRecently Adopted Accounting Standards\nIn December 2019, the FASB issued ASU No. 2019-12, Simplifying the Accounting for Income Taxes under ASC 740, which simplifies the accounting for income taxes by removing certain exceptions to the general principles in Topic 740 and amended existing guidance to improve consistent application. This guidance is effective for fiscal years beginning after December 15, 2020, including interim periods within that fiscal year. The Company adopted this new guidance on September 1, 2021, and the adoption of this guidance did not have a material impact on its consolidated financial statements and related disclosures\nNote 3. Inventories\nInventories consisted of the following (in thousands):\nAugust 31,\nAugust 31,\nProduct held at third-party contract manufacturers\n$\n7,915\n$\n9,036\nRaw materials and components\n13,952\n8,981\nWork-in-process\nFinished goods\n81,353\n36,933\nTotal\n$\n104,101\n$\n55,752\n‎\nNote 4. Property and Equipment and Capitalized Cloud-Based Software Implementation Costs\nProperty and equipment, net, consisted of the following (in thousands):\nAugust 31,\nAugust 31,\nMachinery, equipment and vehicles\n$\n44,533\n$\n22,504\nBuildings and improvements\n27,958\n29,697\nComputer and office equipment\n5,757\n5,742\nInternal-use software\n9,591\n10,559\nFurniture and fixtures\n2,669\n2,794\nCapital in progress\n10,135\n31,016\nLand\n4,240\n4,406\nSubtotal\n104,883\n106,718\nLess: accumulated depreciation and amortization\n(38,906)\n(36,573)\nTotal\n$\n65,977\n$\n70,145\nAt August 31, 2021, capital in progress on the Companys consolidated balance sheets included $30.3 million associated with capital costs related to proprietary machinery and equipment for the Companys next generation of delivery systems for its WD-40 Smart Straw® products. During fiscal year 2022, $22.1 million of this machinery and equipment was placed in service and thus the Company reclassified these amounts from capital in progress to machinery, equipment and vehicles.\nAs of August 31, 2022 and 2021, the Companys consolidated balance sheets included $6.5 million and $2.6 million, respectively, of capitalized cloud-based implementation costs recorded as other assets within the Companys consolidated balance sheets. Accumulated amortization associated with these assets were $0.5 million as of August 31, 2022, and were not significant as of August 31, 2021. Amortization expense associated with these assets were not significant during the fiscal years 2022 or 2021.\nNote 5. Goodwill and Other Intangible Assets\nGoodwill\nThe following table summarizes the changes in the carrying amounts of goodwill by segment (in thousands):\nAmericas\nEMEA\nAsia-Pacific\nTotal\nBalance as of August 31, 2020\n$\n85,461\n9,060\n1,210\n95,731\nTranslation adjustments\n(1)\nBalance as of August 31, 2021\n85,476\n9,184\n1,209\n95,869\nTranslation adjustments\n(74)\n(615)\n-\n(689)\nBalance as of August 31, 2022\n$\n85,402\n$\n8,569\n$\n1,209\n$\n95,180\nDuring the second quarter of fiscal year 2022, the Company performed its annual goodwill impairment test. The annual goodwill impairment test was performed at the reporting unit level as of the Companys most recent goodwill impairment testing date, December 1, 2021. During the fiscal year 2022 annual goodwill impairment test, the Company performed a qualitative assessment of each reporting unit to determine whether it was more likely than not that the fair value of a reporting unit was less than its carrying amount. In performing this qualitative assessment, the Company assessed relevant events and circumstances that may impact the fair value and the carrying amount of each of its reporting units. Factors that were considered included, but were not limited to, the following: (1) macroeconomic conditions, including the impacts of the COVID-19 pandemic; (2) industry and market conditions; (3) historical financial performance and expected financial performance; (4) other entity specific events, such as changes in management or key personnel; and (5) events affecting the Companys reporting units, such as a change in the composition of net assets or any expected dispositions. Based on the results of this qualitative assessment, the Company determined that the estimated fair value of each of the Companys reporting units exceeded their respective carrying values so significantly that an impairment charge to the Companys goodwill balances is remote and, thus, a quantitative analysis was not required. The Company also concluded that there were no indicators of impairment identified as a result of the Companys review of events and circumstances related to its goodwill subsequent to December 1, 2021 through August 31, 2022. As a result, the Company concluded that no impairment of its goodwill existed as of August 31, 2022.To date, there have been no impairment losses identified and recorded related to the Companys goodwill.\n‎\nDefinite-lived Intangible Assets\nThe Companys definite-lived intangible assets, which include the Spot Shot, Carpet Fresh, 1001, EZ REACH and GT85 trade names, are included in other intangible assets, net in the Companys consolidated balance sheets. The following table summarizes the definite-lived intangible assets and the related accumulated amortization (in thousands):\nAugust 31,\nAugust 31,\nGross carrying amount\n$\n35,166\n$\n36,657\nAccumulated amortization\n(29,578)\n(29,413)\nNet carrying amount\n$\n5,588\n$\n7,244\nThere has been no impairment charge for the period ended August 31, 2022 and there were no indicators of impairment identified as a result of the Companys review of events and circumstances related to its existing definite-lived intangible assets. The Companys review of events and circumstances included consideration of the ongoing COVID-19 pandemic.\nChanges in the carrying amounts of definite-lived intangible assets by segment are summarized below (in thousands):\nAmericas\nEMEA\nAsia-Pacific\nTotal\nBalance as of August 31, 2020\n$\n6,553\n2,080\n-\n$\n8,633\nAmortization expense\n(1,058)\n(391)\n-\n(1,449)\nTranslation adjustments\n-\n-\nBalance as of August 31, 2021\n5,495\n1,749\n-\n7,244\nAmortization expense\n(1,058)\n(376)\n-\n(1,434)\nTranslation adjustments\n-\n(222)\n-\n(222)\nBalance as of August 31, 2022\n$\n4,437\n$\n1,151\n$\n-\n$\n5,588\nThe estimated amortization expense for the Companys definite-lived intangible assets is not significant in any future individual fiscal year.\n‎\nNote 6. Leases\nThe Company leases real estate for its regional sales offices, a research and development facility, and offices located at its international subsidiaries and branch locations. In addition, the Company leases an automobile fleet in the United States. The Company has also identified warehouse leases within certain third-party distribution center service contracts. All other leases are insignificant to the Companys consolidated financial statements. To determine if a contract contains a lease, the Company assesses its contracts and determines if there is an identified asset for which the Company has obtained the right to control, as defined in ASC 842.\nThe Company records right-of-use assets and lease liabilities on its consolidated balance sheets for leases with an expected term greater than one year. The lease term includes the committed lease term, also taking into account early termination and renewal options that management is reasonably certain to exercise. For leases that do not have a readily determinable implicit rate, the Company uses its estimated secured incremental borrowing rate based on the information available at the lease commencement date to determine the present value of lease payments. The Companys estimated secured incremental borrowing rate is determined using a portfolio approach based on the rate of interest the Company would have to pay to borrow an amount equal to the lease payments on a collateralized basis over a similar term. The Company uses the unsecured borrowing rate and risk-adjusts that rate to approximate a collateralized rate in the currency of the lease. As of August 31, 2021 and 2022, finance leases were not significant and all leases recorded on the Companys consolidated balances sheets were operating leases. Residual value guarantees, restrictions, covenants, sublease income, net gains or losses from sale and leaseback transactions, and transactions with related parties associated with leases are also not significant. The Company has made the accounting policy election to use certain ongoing practical expedients made available by ASC 842 to: (i) not separate lease components from nonlease components for real estate - office buildings, machinery and equipment, lab equipment, office equipment, furniture and fixtures, and IT equipment; and (ii) exclude leases with an initial term of 12 months or less (short-term leases) from the consolidated balance sheets and will recognize related lease payments in the consolidated statements of operations on a straight-line basis over the lease term. However, the Company had no significant short-term leases as of August 31, 2022. The Company obtained additional right-of-use assets of $2.2 million in exchange for lease obligations related to renewals of existing leases during fiscal year 2022.\nThe Company recorded $2.0 million and $2.1 million in lease expense during the fiscal years ended August 31, 2022 and 2021, respectively. This lease expense was included in selling, general and administrative expenses. The Company recorded $0.3 million of lease expense classified within cost of products sold for the fiscal year ended August 31, 2022, and $0.6 million for the fiscal year ended August 31, 2021. During the fiscal year ended August 31, 2022 and 2021, the Company paid cash of $2.1 million and $2.0 million related to lease liabilities, respectively. Variable lease expense under the Companys lease agreements was not significant for both the fiscal years ended August 31, 2022 and 2021. As of August 31, 2022, the weighted-average remaining lease term was 6.5 years and the weighted-average discount rate was 3.1% for the Companys operating leases. As of August 31, 2021, the weighted-average remaining lease term was 6.7 years and the weighted-average discount rate was 2.8% for the Companys operating leases. The Company had approximately $1.2 million of leases that commenced after August 31, 2022 that created rights and obligations to the Company. These leases are not included in the following schedules.\nRight-of-use assets and lease liabilities consisted of the following (in thousands):\nAugust 31,\nAugust 31,\nAssets:\nOperating lease right-of-use assets\n$\n7,559\n$\n8,824\nLiabilities:\nCurrent operating lease liabilities(1)\n1,703\n1,903\nLong-term operating lease liabilities\n5,999\n7,062\nTotal operating lease liabilities\n$\n7,702\n$\n8,965\n(1)Current operating lease liabilities are classified in accrued liabilities on the Companys consolidated balance sheets.\n‎\nThe Companys maturities of its operating lease liabilities, including early termination and renewal options that management is reasonably certain to exercise, are as follows as of August 31, 2022 (in thousands):\nOperating\nLeases\nFiscal year 2023\n1,918\nFiscal year 2024\n1,656\nFiscal year 2025\n1,077\nFiscal year 2026\nFiscal year 2027\nThereafter\n2,230\nTotal undiscounted future cash flows\n$\n8,590\nLess: Interest\n(888)\nPresent value of lease liabilities\n$\n7,702\nNote 7. Accrued and Other Liabilities\nAccrued liabilities consisted of the following (in thousands):\nAugust 31,\nAugust 31,\nAccrued advertising and sales promotion expenses\n$\n13,563\n$\n11,796\nAccrued professional services fees\n1,979\n2,122\nAccrued sales taxes and other taxes\n1,708\nDeferred revenue\n4,988\n3,696\nShort-term operating lease liability\n1,703\n1,903\nOther\n3,933\n4,433\nTotal\n$\n27,161\n$\n25,658\nAccrued payroll and related expenses consisted of the following (in thousands):\nAugust 31,\nAugust 31,\nAccrued incentive compensation\n$\n2,524\n$\n14,068\nAccrued payroll\n4,001\n4,746\nAccrued profit sharing\n2,758\n3,273\nAccrued payroll taxes\n1,779\n2,952\nOther\nTotal\n$\n11,583\n$\n25,662\nNote 8. Debt\nAs of August 31, 2022, the Company held borrowings under two separate agreements as detailed below.\nNote Purchase and Private Shelf Agreement\nThe Company holds borrowings under its Note Purchase and Private Shelf Agreement, as amended (the Note Agreement) by and among the Company, PGIM, Inc. (Prudential), and certain affiliates and managed accounts of Prudential (the Note Purchasers). As of August 31, 2022, the Company had outstanding balances on its series A, B and C notes issued under this Note Agreement.\nCredit Agreement\nThe Companys Amended and Restated Credit Agreement, as amended (the Credit Agreement) with Bank of America, N.A., consists of a revolving commitment for borrowing by the Company up to $150.0 million with a sublimit of $100.0 million for WD-40 Company Limited, a wholly owned operating subsidiary of the Company for Europe, the Middle East, Africa and India.\nOn November 29, 2021, the Company entered into its most recent amendment to the Credit Agreement (the LIBOR Amendment) with Bank of America, N.A. The LIBOR Amendment changed the Companys index rates under the Credit Agreement for British Pound Sterling and U.S. Dollar borrowings from the London Interbank Offered Rate as administered by ICE Benchmark Administration to the Sterling Overnight Index Average Reference Rate and the Bloomberg Short-term Bank Yield Index rate, respectively, as well as certain definitions and clarifications within the Credit Agreement to accommodate the change in index rates. The impact of the LIBOR Amendment was insignificant to the Companys consolidated financial statements.\nShort-term and long-term borrowings under the Companys Credit Agreement and Note Agreement consisted of the following (in thousands):\nMaturities\nAugust 31,\nAugust 31,\nIssuance\n(calendar year)\nCredit Agreement - revolving credit facility (1)(3)\nVarious\n9/30/2025\n77,912\n$\n46,540\nNote Agreement\nSeries A Notes - 3.39% fixed rate(2)\n11/15/2017\n2021-2032\n16,400\n17,200\nSeries B Notes - 2.50% fixed rate(3)\n9/30/2020\n11/15/2027\n26,000\n26,000\nSeries C Notes - 2.69% fixed rate(3)\n9/30/2020\n11/15/2030\n26,000\n26,000\nTotal borrowings\n146,312\n115,740\nShort-term portion of borrowings\n(39,173)\n(800)\nTotal long-term borrowings\n$\n107,139\n$\n114,940\n(1)The Company has the ability to refinance any draw under the line of credit with successive short-term borrowings through the maturity date. Outstanding draws for which management has both the ability and intent to refinance with successive short-term borrowings for a period of at least twelve months are classified as long-term. As of August 31, 2022, $39.5 million on this facility is classified as long-term and is denominated in Euros and Pound Sterling. $38.4 million is classified as short-term and is denominated entirely in U.S. Dollar. Euro and Pound Sterling denominated draws will fluctuate in U.S. Dollars from period to period due to changes in foreign currency exchange rates.\n(2)Principal payments are required semi-annually in May and November of each year in equal installments of $0.4 million through May 15, 2032, resulting in $0.8 million classified as short-term. The remaining outstanding principal in the amount of $8.4 million will become due on November 15, 2032.\n(3)Interest on notes is payable semi-annually in May and November of each year with no principal due until the maturity date.\nBoth the Note Agreement and the Credit Agreement contain representations, warranties, events of default and remedies, as well as affirmative, negative and other financial covenants customary for these types of agreements. These covenants include, among other things, certain limitations on the ability of the Company and its subsidiaries to incur indebtedness, create liens, dispose of assets, make investments, declare, make or incur obligations to make certain restricted payments, including the payment of dividends and payments for the repurchase of the Companys capital stock and enter into certain merger or consolidation transactions. The Credit Agreement includes, among other limitations on indebtedness, a $125.0 million limit on other unsecured indebtedness.\nEach agreement also includes a most favored lender provision which requires that any time any other lender has the benefit of one or more financial or operational covenants that is different than, or similar to, but more restrictive than those contained in its own agreement, those covenants shall be immediately and automatically incorporated by reference to the other lenders agreement. Both the Note Agreement and the Credit Agreement require the Company to adhere to the same financial covenants. For the financial covenants, the definition of consolidated EBITDA includes the add back of non-cash stock-based compensation to consolidated net income when arriving at consolidated EBITDA. The terms of the financial covenants are as follows:\nThe consolidated leverage ratio cannot be greater than three and a half to one. The consolidated leverage ratio means, as of any date of determination, the ratio of (a) consolidated funded indebtedness as of such date to (b) consolidated EBITDA for the most recently completed four fiscal quarters.\nThe consolidated interest coverage ratio cannot be less than three to one. The consolidated interest coverage ratio means, as of any date of determination, the ratio of (a) consolidated EBITDA for the most recently completed four fiscal quarters to (b) consolidated interest charges for the most recently completed four fiscal quarters\nAs of August 31, 2022, the Company was in compliance with all debt covenants under both the Note Agreement and the Credit Agreement.\nNote 9. Share Repurchase Plan\nOn April 8, 2020, the Company elected to suspend repurchases under its previously approved share buy-back plan, which subsequently expired on August 31, 2020. The Company made this election in order to preserve cash while it continued to monitor the long-term impacts of the COVID-19 pandemic.\nOn October 12, 2021, the Companys Board of Directors approved a new share repurchase plan. Under the plan, which became effective on November 1, 2021, the Company is authorized to acquire up to $75.0 million of its outstanding shares through August 31, 2023. The timing and amount of repurchases are based on terms and conditions as may be acceptable to the Companys Chief Executive Officer and Chief Financial Officer, subject to present loan covenants and in compliance with all laws and regulations applicable thereto. During fiscal year 2022, the Company repurchased 138,562 shares at an average price of $210.39 per share, for a total cost of $29.2 million under this $75.0 million plan.\nNote 10. Earnings per Common Share\nThe table below reconciles net income to net income available to common shareholders (in thousands):\nFiscal Year Ended August 31,\nNet income\n$\n67,329\n$\n70,229\n$\n60,710\nLess: Net income allocated to participating securities\n(251)\n(277)\n(294)\nNet income available to common shareholders\n$\n67,078\n$\n69,952\n$\n60,416\nThe table below summarizes the weighted-average number of common shares outstanding included in the calculation of basic and diluted EPS (in thousands):\nFiscal Year Ended August 31,\nWeighted-average common shares outstanding, basic\n13,668\n13,698\n13,691\nWeighted-average dilutive securities\nWeighted-average common shares outstanding, diluted\n13,696\n13,733\n13,719\nFor the fiscal year ended August 31, 2022, weighted-average stock-based equity awards outstanding that are non-participating securities in the amount of 8,724 were excluded from the calculation of diluted EPS under the treasury stock method as they were anti-dilutive. There were no anti-dilutive stock-based equity awards outstanding for the fiscal year ended August 31, 2021. For the fiscal year ended August 31, 2020, weighted-average stock-based equity awards outstanding that are non-participating securities in the amount of 6,172, were excluded from the calculation of diluted EPS under the treasury stock method as they were anti-dilutive.\nNote 11. Revenue Recognition\nThe following paragraphs detail the Companys revenue recognition policies and provide additional information used in its determination of net sales and contract balances under ASC 606.\nDisaggregation of Revenue\nThe following table presents our revenues by segment and major source (in thousands):\nFiscal Year Ended August 31, 2022:\nFiscal Year Ended August 31, 2021:\nAmericas\nEMEA\nAsia-Pacific\nTotal\nAmericas\nEMEA\nAsia-Pacific\nTotal\nMaintenance products\n$\n223,470\n$\n196,524\n$\n65,332\n$\n485,326\n$\n194,295\n$\n198,309\n$\n56,213\n$\n448,817\nHCCP (1)\n16,763\n8,164\n8,567\n33,494\n20,306\n9,943\n9,043\n39,292\nTotal net sales\n$\n240,233\n$\n204,688\n$\n73,899\n$\n518,820\n$\n214,601\n$\n208,252\n$\n65,256\n$\n488,109\n(1)Homecare and cleaning products (HCCP)\nRevenue Recognition\nThe Company generates revenue from sales of its products to customers in its Americas, EMEA and Asia-Pacific segments. Product sales for the Company include maintenance products and homecare and cleaning products. The Company recognizes revenue related to the sale of these products when it satisfies a performance obligation in an amount reflecting the consideration to which it expects to be entitled. Sales are recorded net of allowances for damaged goods and other sales returns, sales incentives, trade promotions and cash discounts. The Company applies a five-step approach in determining the amount and timing of revenue to be recognized which includes the following: (1) identifying the contract with a customer, (2) identifying the performance obligations in the contract, (3) determining the transaction price, (4) allocating the transaction price to the performance obligations in the contract and (5) recognizing revenue when the performance obligation is satisfied.\nContracts with customers are renewable periodically and contain terms and conditions with respect to payment, delivery, sales incentives, warranty and supply, but do not require mandatory purchase commitments. In the absence of a specific sales agreement with a customer, the Companys standard terms and conditions at the time of acceptance of purchase orders apply to the sales transaction. The Companys standard terms and conditions are either included in a standalone document or on the Companys price lists or both, and these standard terms and conditions are provided to the customer prior to the sales transaction. The Company considers the customer purchase orders, governed by specific sales agreements or the Companys standard terms and conditions, to be the contract with the customer. The Company considers each transaction to sell products as separate and distinct, with no additional promises made, and as a result, all of the Company's sales are single performance obligation arrangements for which the transaction price is equivalent to the stated price of the product, net of any variable consideration for items such as sales returns, discounts, rebates and other sales incentives. The Company recognizes sales at a point in time upon transferring control of its product to the customer. This typically occurs when products are shipped or delivered, depending on when risks of loss and title have passed to the customer per the terms of the contract.\nTaxes imposed by governmental authorities on the Company's revenue, such as sales taxes and value added taxes, are excluded from net sales. Sales commissions are paid to certain third-parties based upon specific sales levels achieved during a defined time period. Since the Companys contracts related to these sales commissions do not exceed one year, the Company has elected as a practical expedient to expense these payments as incurred. The Company also elected the practical expedient related to shipping and handling fees which allows the Company to account for freight costs as fulfillment activities instead of assessing such activities as performance obligations. The Companys freight costs are sometimes paid by the customer, while other times, the freight costs are included in the sales price. The Company does not account for freight costs as a separate performance obligation, but rather as an activity performed to transfer the products to its customers.\nVariable Consideration - Sales Incentives\nIn determining the transaction price, the Company evaluates whether the price is subject to refund or adjustment related to variable consideration to determine the net consideration to which the Company expects to be entitled. The Company records estimates of variable consideration, which primarily includes rebates/other discounts (cooperative marketing programs, volume-based discounts, shelf price reductions and allowances for shelf space, charges from customers for services they provided to us related to the sale and penalties/fines charged to us by customers associated with failing to adhere to contractual obligations), coupon offers, cash discount allowances, and sales returns, as a reduction of sales in its consolidated statements of operations. These estimates are based on the expected value method considering all reasonably available information, including current and past trade promotion spending patterns, status of trade promotion activities, the interpretation of historical spending trends by customer and category, customer agreements and/or currently known factors that arise in the normal course of business. The Company reviews its assumptions and adjusts these estimates accordingly on a quarterly basis.\nRebates/Other Discounts - The Company offers various on-going trade promotion programs with customers and provides other discounts to customers that require management to estimate and accrue for the expected costs of such programs or discounts. These programs include cooperative marketing, volume-based discounts, shelf price reductions, consideration and allowances given to retailers for shelf space and/or favorable display positions in their stores and other promotional activities. Other discounts include items such as charges from customers for services they provide related to the sale of WD-40 Company products and penalties/fees associated with WD-40 Company failing to adhere to contractual obligations (e.g., errors on purchase orders, errors on shipment, late deliveries, etc.). Costs related to rebates, cooperative advertising and other promotional activities and other discounts are recorded as a reduction to sales upon delivery of the Companys products to its customers. The Company had a $8.7 million and $8.4 million balance in rebate/other discount liabilities as of August 31, 2022 and 2021, respectively, which are included in accrued liabilities on the Companys consolidated balance sheets. The Company recorded approximately $32.8 million and $28.7 million in rebates/other discounts as a reduction to sales during fiscal years 2022 and 2021, respectively.\nCoupons - Coupon costs are based upon historical redemption rates and are recorded as a reduction to sales as incurred, which is when the coupons are circulated. Coupon redemption liabilities, which are included in accrued liabilities on the Companys\nconsolidated balance sheets, were not significant at August 31, 2022 and 2021. Coupons recorded as a reduction to sales were not significant during fiscal years 2022 and 2021, respectively.\nCash discounts - The Company offers certain of its customers a cash discount program to incentivize them to pay the invoice earlier than the normal payment date on the invoice. Although payment terms vary, most customers typically pay within 30 to 90 days of invoicing. The Company had a $0.5 million balance in the allowance for cash discounts at both August 31, 2022 and 2021. The Company recorded approximately $5.2 million and $4.9 million in cash discounts as a reduction to sales during fiscal year 2022 and 2021, respectively.\nSales returns - The Company recognizes revenue net of allowances for estimated returns, which is generally based on historical return rates, with a corresponding reduction to cost of products sold. Although the Company typically does not have definitive sales return provisions included in the contract terms with its customers, when such provisions have been included, they have not been significant. The Company presents its provision for sales returns on a gross basis as a liability. The Companys refund liability for sales returns is included in accrued liabilities and represents the amount expected to be owed to the customers for product returns. The Companys refund liability for sales returns was $0.4 million at August 31, 2022 and was $0.5 million at August 31, 2021. The Company also records an asset for the value of inventory that represents the right to recover products from customers associated with sales returns. The value of this inventory is recorded to other current assets and the balance in this account associated with product returns was not significant at August 31, 2022 and August 31, 2021.\nContract Balances\nContract liabilities consist of deferred revenue related to undelivered products. Deferred revenue is recorded when payments have been received from customers for undelivered products. Revenue is subsequently recognized when revenue recognition criteria are met, generally when control of the product transfers to the customer. The Company had contract liabilities of $5.0 million and $3.7 million as of August 31, 2022 and 2021, respectively. All of the $3.7 million that was included in contract liabilities as of August 31, 2021 was recognized to revenue during fiscal year 2022. These contract liabilities are recorded in accrued liabilities on the Companys consolidated balance sheets. The Company did not have any contract assets as of August 31, 2022 and August 31, 2021.\nNote 12. Commitments and Contingencies\nPurchase Commitments\nThe Company has ongoing relationships with various suppliers (contract manufacturers) that manufacture the Companys products and third-party distribution centers that warehouse and ship the Companys products to customers. The contract manufacturers maintain title and control of certain raw materials and components, materials utilized in finished products, and of the finished products themselves until shipment to the Companys customers or third-party distribution centers in accordance with agreed upon shipment terms. Although the Company has definitive minimum purchase obligations included in the contract terms with certain of its contract manufacturers, when such obligations have been included, they have either been immaterial or the minimum amounts have been such that they are well below the volume of goods that the Company has historically purchased. In the ordinary course of business, supply needs are communicated by the Company to its contract manufacturers based on orders and short-term projections, ranging from two months to six months. The Company is committed to purchase the products produced by the contract manufacturers based on the projections provided.\nUpon the termination of contracts with contract manufacturers, the Company obtains certain inventory control rights and is obligated to work with the contract manufacturer to sell through all product held by or manufactured by the contract manufacturer on behalf of the Company during the termination notification period. If any inventory remains at the contract manufacturer at the termination date, the Company is obligated to purchase such inventory which may include raw materials, components and finished goods. The amounts for inventory purchased under termination commitments have been immaterial.\nIn addition to the commitments to purchase products from contract manufacturers described above, the Company may also enter into commitments with other manufacturers to purchase finished goods and components to support innovation and renovation initiatives and/or supply chain initiatives. As of August 31, 2022, no such commitments were outstanding.\nLitigation\nFrom time to time, the Company is subject to various claims, lawsuits, investigations and proceedings arising in the ordinary course of business, including but not limited to, product liability litigation and other claims and proceedings with respect to intellectual property, breach of contract, labor and employment, tax and other matters. As of August 31, 2022, there were no unasserted claims or pending proceedings for claims against the Company that the Company believes will result in a probable loss. As to claims that the Company believes may result in a reasonably possible loss, the Company believes that no reasonably\npossible outcome of any such claim will have a materially adverse impact on the Companys financial condition, results of operations or cash flows.\nIndemnifications\nAs permitted under Delaware law, the Company has agreements whereby it indemnifies senior officers and directors for certain events or occurrences while the officer or director is, or was, serving at the Companys request in such capacity. The maximum potential amount of future payments the Company could be required to make under these indemnification agreements is unlimited; however, the Company maintains Director and Officer insurance coverage that mitigates the Companys exposure with respect to such obligations. As a result of the Companys insurance coverage, management believes that the estimated fair value of these indemnification agreements is minimal. Thus, no liabilities have been recorded for these agreements as of August 31, 2022.\nFrom time to time, the Company enters into indemnification agreements with certain contractual parties in the ordinary course of business, including agreements with lenders, lessors, contract manufacturers, marketing distributors, customers and certain vendors. All such indemnification agreements are entered into in the context of the particular agreements and are provided in an attempt to properly allocate risk of loss in connection with the consummation of the underlying contractual arrangements. Although the maximum amount of future payments that the Company could be required to make under these indemnification agreements is unlimited, management believes that the Company maintains adequate levels of insurance coverage to protect the Company with respect to most potential claims arising from such agreements and that such agreements do not otherwise have value separate and apart from the liabilities incurred in the ordinary course of the Companys business. Thus, no liabilities have been recorded with respect to such indemnification agreements as of August 31, 2022.\nNote 13. Income Taxes\nIncome before income taxes consisted of the following (in thousands):\nFiscal Year Ended August 31,\nUnited States\n$\n47,427\n$\n40,949\n$\n43,000\nForeign (1)\n36,681\n45,550\n32,515\nIncome before income taxes\n$\n84,108\n$\n86,499\n$\n75,515\n(1)Included in these amounts are income before income taxes for the EMEA segment of $30.3 million, $38.8 million and $27.0 million for the fiscal years ended August 31, 2022, 2021 and 2020, respectively.\nThe provision for income taxes consisted of the following (in thousands):\nFiscal Year Ended August 31,\nCurrent:\nFederal\n$\n7,487\n$\n5,871\n$\n7,267\nState\n1,007\nForeign\n8,114\n10,944\n7,139\nTotal current\n16,462\n17,822\n15,228\nDeferred:\nUnited States\n(1,201)\n(619)\nForeign\n(351)\nTotal deferred\n(1,552)\n(423)\nProvision for income taxes\n$\n16,779\n$\n16,270\n$\n14,805\n‎\nDeferred tax assets and deferred tax liabilities consisted of the following (in thousands):\nAugust 31,\nAugust 31,\nDeferred tax assets:\nAccrued payroll and related expenses\n$\n$\n1,029\nReserves and accruals\n1,178\n1,115\nStock-based compensation expense\n2,366\n2,387\nLease Accounting\nUniform capitalization\n2,657\n1,558\nTax credit carryforwards\n3,512\n3,911\nOther\n2,548\n1,569\nTotal gross deferred tax assets\n13,784\n12,451\nValuation allowance\n(3,628)\n(3,984)\nTotal net deferred tax assets\n10,156\n8,467\nDeferred tax liabilities:\nProperty and equipment, net\n(4,122)\n(1,927)\nAmortization of tax goodwill and intangible assets\n(14,931)\n(15,109)\nLease Accounting\n(613)\n(856)\nOther\n(339)\n(118)\nTotal deferred tax liabilities\n(20,005)\n(18,010)\nNet deferred tax liabilities\n$\n(9,849)\n$\n(9,543)\nThe Company had state net operating loss (NOL) carryforwards of $5.3 million and $4.5 million as of August 31, 2022 and 2021, respectively, which generated a net deferred tax asset of $0.4 million and $0.3 million as of August 31, 2022 and 2021, respectively. The state NOL carryforwards, if unused, will expire between fiscal year 2023 and 2042. The Company also had tax credit carryforwards of $3.5 million and $3.9 million as of August 31, 2022 and 2021, respectively, of which $3.3 million and $3.7 million, respectively, is attributable to U.K. tax credit carryforwards, which do not expire. Future utilization of the U.K. tax credit carryforwards and certain state credit carryforwards is uncertain and is dependent upon several factors that may not occur, including the generation of future taxable income in certain jurisdictions. At this time, management cannot conclude that it is more likely than not that the related deferred tax assets will be realized. Accordingly, a valuation allowance has been recorded against the related deferred tax asset associated with the U.K. tax credit carryforwards and certain state carryforwards.\nA reconciliation of the statutory federal income tax rate to the Companys effective tax rate is as follows (in thousands):\nFiscal Year Ended August 31,\nAmount computed at U.S. statutory federal tax rate\n$\n17,662\n$\n18,165\n$\n15,858\nState income taxes, net of federal tax benefits\nNet benefit from GILTI/FDII\n(2,002)\n(1,764)\n(1,582)\nBenefit from stock compensation\n(204)\n(1,736)\n(1,078)\nOther\nProvision for income taxes\n$\n16,779\n$\n16,270\n$\n14,805\nThe provision for income taxes was 19.9% and 18.8% of income before income taxes for the fiscal years ended August 31, 2022 and 2021, respectively. The increase in the effective income tax rate from period to period was primarily due to an increase in nondeductible performance-based compensation expense.\n‎\nReconciliations of the beginning and ending amounts of the Companys gross unrecognized tax benefits, excluding interest and penalties, are as follows (in thousands):\nFiscal Year Ended August 31,\nUnrecognized tax benefits - beginning of fiscal year\n$\n9,314\n$\n9,352\nNet increases (decreases) - prior period tax positions\n-\nNet increases - current period tax positions\nExpirations of statute of limitations for assessment\n(263)\n(323)\nUnrecognized tax benefits - end of fiscal year\n$\n9,251\n$\n9,314\nGross unrecognized tax benefits totaled $9.3 million for both the fiscal years ended August 31, 2022 and 2021, of which $9.1 million in both fiscal years ended August 31, 2022 and 2021, would affect the Companys effective income tax rate if recognized. Interest and penalties related to uncertain tax positions included in tax expense was $0.3 million for both fiscal years ending August 31, 2022 and 2021, primarily related to the toll tax liability reserve. The total balance of accrued interest and penalties related to uncertain tax positions was $1.6 million and $1.2 million for the fiscal years ended August 31, 2022 and 2021, respectively.\nThe Company is subject to taxation in the U.S. and in various state and foreign jurisdictions. Due to expired statutes and closed audits, the Companys federal income tax returns for years prior to fiscal year 2018 are not subject to examination by the U.S. Internal Revenue Service. The Company is currently under audit in various state jurisdictions for fiscal years 2018 through 2019. Generally, for the majority of state and foreign jurisdictions where the Company does business, periods prior to fiscal year 2018 are no longer subject to examination. The Company has estimated that up to $0.2 million of unrecognized tax benefits related to income tax positions may be affected by the resolution of tax examinations or expiring statutes of limitation within the next twelve months. Audit outcomes and the timing of settlements are subject to significant uncertainty. Income taxes receivable of $5.0 million and $1.9 are recorded in the Companys consolidated balance sheets as of August 31, 2022 and 2021, respectively. Income taxes receivable are included in other current assets, which also consists of miscellaneous prepaid expenses and deposits.\nNote 14. Stock-based Compensation\nAs of August 31, 2022, the Company had one stock incentive plan, the WD-40 Company 2016 Stock Incentive Plan (2016 Plan), which was approved by the Companys shareholders effective as of December 13, 2016. The 2016 Plan permits the granting of various stock-based equity awards, including non-qualified stock options, incentive stock options, stock appreciation rights, restricted stock, restricted stock units, performance shares, performance units and other stock-based awards to employees, directors and consultants. To date through August 31, 2022, the Company had granted awards of restricted stock units (RSUs), market share units (MSUs), deferred performance units (DPUs) and performance share units (PSUs) under the 2016 Plan. Additionally, as of August 31, 2022, there were still certain outstanding awards which had been granted under the Companys prior equity incentive plan. The 2016 Plan is administered by the Board of Directors (the Board) or the Compensation Committee or other designated committee of the Board (the Committee). All stock-based equity awards granted under the 2016 Plan are subject to the specific terms and conditions as determined by the Committee at the time of grant of such awards in accordance with the various terms and conditions specified for each award type per the 2016 Plan. The total number of shares of common stock authorized for issuance pursuant to grants of awards under the 2016 Plan is 1,000,000. As of August 31, 2022, 384,859 shares of common stock remained available for future issuance pursuant to grants of awards under the 2016 Plan. The shares of common stock to be issued pursuant to awards under the 2016 Plan may be authorized shares not previously issued, or treasury shares. The Company has historically issued new authorized shares not previously issued upon the settlement of the various stock-based equity awards under its equity incentive plans.\nVesting of the RSUs granted to directors is immediate, with shares to be issued pursuant to the vested RSUs upon termination of each directors service as a director of the Company. Vesting of the one-time grant of RSUs granted to certain key executives of the Company in March 2008 in settlement of these key executives benefits under the Companys supplemental employee retirement plan agreements was over a period of three years from the date of grant, with shares to be issued pursuant to the vested RSUs six months following the day after each executive officers termination of employment with the Company. Vesting of the RSUs granted to certain high level employees is over a period of three years from the date of grant, subject to potential earlier vesting in the event of retirement of the holder of the award in accordance with the award agreement, with shares to be issued pursuant to the vested RSUs at the time of vest. The director RSU holders and the executive officer March 2008 grant date RSU holders are entitled to receive dividend equivalents with respect to their RSUs, payable in cash as and when dividends are declared by the Companys Board of Directors.\n‎\nVesting of the MSUs granted to certain high level employees follows a performance measurement period of three fiscal years commencing with the Companys fiscal year in which the MSU awards are granted (the Measurement Period). Shares will be issued pursuant to the vested MSUs following the conclusion of the applicable MSU Measurement Period after the Committees certification of achievement of the applicable performance measure for such awards and the vesting of the MSU awards and the applicable percentage of the target number of MSU shares to be issued. The recipient must remain employed with the Company for vesting purposes until the date on which the Committee certifies achievement of the applicable performance measure for the MSU awards, subject to potential pro-rata vesting in the event of earlier retirement of the holder of the award in accordance with the award agreement.\nDuring fiscal year 2021, PSU awards were granted for the first time under the 2016 Plan in October 2021 and granting of new DPUs was discontinued by the Company. No DPUs were granted in fiscal year 2021. Although certain vested DPU awards granted in prior periods remain outstanding due to a deferred settlement feature contained within these award agreements, the expense associated with these awards has been fully recognized in prior periods. Many features of the Companys PSU award agreements are similar to the discontinued DPU awards with the exception of the timing and terms of issuances. Vested DPUs contain a deferred settlement feature wherein the awards must be held until termination of employment, prior to which the recipients are entitled to dividend equivalents, with vested shares to be issued six months following each such recipients termination of employment with the Company. Vested PSUs are issuable prior to termination of employment but contain a period of restriction, wherein the recipient cannot sell or otherwise dispose of the stock until six months following termination of employment with the Company. Vesting of the PSUs granted to certain high level employees follows a performance measurement period of one fiscal year that is the same fiscal year in which the PSU awards are granted (the Measurement Year). A number of PSUs equal to the applicable percentage of the maximum number of PSUs awarded will be confirmed as vested and issuable following the conclusion of the applicable PSU Measurement Year after the Committees certification of achievement of the applicable performance measure for such awards. The recipient must remain employed with the Company for vesting purposes until August 31 of the Measurement Year, subject to potential pro-rata vesting in the event of earlier retirement of the holder of the award in accordance with the award agreement.\nStock-based compensation expense is amortized on a straight-line basis over the requisite service period for the entire award. Stock-based compensation expense related to the Companys stock-based equity awards is as follows by award type (in thousands):\nFiscal Year Ended August 31,\nRSU compensation expense\n$\n4,153\n$\n3,656\n$\n3,325\nMSU compensation expense\n2,544\n2,294\n2,033\nPSU compensation expense (1)\n-\n3,605\n-\nTotal\n$\n6,697\n$\n9,555\n$\n5,358\n(1)PSU awards, similar to DPU awards that were replaced by PSUs in fiscal year 2021, contain performance conditions for which accrual of expense is based on the probable outcome of the performance conditions. Vesting of DPUs related to the measurement year of 2020 was deemed not probable at the end of the fiscal year. DPUs were then discontinued by the Company beginning in fiscal year 2021. PSUs pertaining to the measurement year of fiscal year 2021 vested at 100% since the performance conditions were fully achieved. PSUs pertaining to the measurement year of fiscal year 2022 was deemed not probable at the end of the fiscal year.\nThe Company recorded deferred tax assets related to such stock-based compensation of $1.5 million, $2.0 million and $1.2 million for the fiscal years ended August 31, 2022, 2021 and 2020, respectively. As of August 31, 2022, the total unamortized compensation cost related to non-vested stock-based equity awards was $1.4 million and $3.1 million for RSUs and MSUs, respectively, which the Company expects to recognize over remaining weighted-average vesting periods of 1.45 and 1.82 years for RSUs and MSUs, respectively. No unamortized compensation cost for DPUs or PSUs remained as of August 31, 2022.\nRestricted Stock Units The estimated fair value of each of the Companys RSU awards was determined on the date of grant based on the closing market price of the Companys common stock on the date of grant for those RSUs which are entitled to receive dividend equivalents with respect to the RSUs, or based on the closing market price of the Companys common stock on the date of grant less the grant date present value of expected dividends during the vesting period for those RSUs which are not entitled to receive dividend equivalents with respect to the RSUs.\n‎\nA summary of the Companys restricted stock unit activity is as follows (in thousands, except share and per share amounts):\nWeighted-Average\nGrant Date\nNumber of\nFair Value\nAggregate\nRestricted Stock Units\nShares\nPer Share\nIntrinsic Value\nOutstanding at August 31, 2021\n69,001\n$\n$131.88\nGranted\n23,461\n$\n$217.03\nConverted to common shares\n(13,751)\n$\n$182.72\nForfeited\n(107)\n$\n$224.41\nOutstanding at August 31, 2022\n78,604\n$\n$148.28\n$\n14,869\nVested at August 31, 2022\n49,620\n$\n$116.22\n$\n9,386\nThe weighted-average grant date fair value of all RSUs granted during the fiscal years ended August 31, 2022, 2021 and 2020 was $217. 03, $208.29 and $184.43, respectively. The total intrinsic value of all RSUs converted to common shares was $3.0 million, $8.5 million and $5.4 million for the fiscal years ended August 31, 2022, 2021 and 2020, respectively.\nThe income tax benefits from RSUs converted to common shares totaled $0.6 million, $1.9 million and $1.2 million for the fiscal years ended August 31, 2022, 2021 and 2020, respectively.\nMarket Share Units\nThe MSUs are market performance-based awards that vest with respect to the applicable percentage of the target number of MSU shares based on relative total stockholder return (TSR) for the Company as compared to the total return for the Russell 2000 Index (Index) over the performance Measurement Period. The ultimate number of MSUs that vest may range from 0% to 200% of the original target number of shares depending on the relative achievement of the TSR performance measure at the end of the Measurement Period. The grant date fair value of MSUs are estimated using a Monte Carlo simulation model and are expensed over the requisite service period rendered. Assumptions and estimates utilized in the model include expected volatilities of the Companys stock and the Index, the Companys risk-free interest rate and expected dividends. The probabilities of the actual number of MSUs expected to vest and resultant actual number of shares of common stock expected to be awarded are reflected in the grant date fair values of the various MSU awards; therefore, the compensation expense for the MSU awards is not adjusted based on the actual number of such MSU awards to ultimately vest.\nThe following weighted-average assumptions for MSU grants for the last three fiscal years were used in the Monte Carlo simulation model:\nFiscal Year Ended August 31,\nExpected volatility\n32.7%\n28.5%\n21.4%\nRisk-free interest rate\n0.6%\n0.2%\n1.4%\nExpected dividend yield\n0.0%\n0.0%\n0.0%\nThe expected volatility utilized is based on the historical volatilities of the Companys common stock and the Index in order to model the stock price movements. The volatility used was calculated over the most recent 2.89-year period for MSUs granted during the fiscal year ended August 31, 2022 and over the most recent 2.88 and 2.90-year periods for MSUs granted during each of the fiscal years ended August 31, 2021 and 2020, respectively, which were the remaining terms of the performance Measurement Period at the dates of grant. The risk-free interest rates used are based on the implied yield available on a U.S. Treasury zero-coupon bill with a remaining term equivalent to the remaining performance Measurement Period. The expected dividend yield of zero was used in the Monte Carlo simulation model for the purposes of computing the relative TSR of the Company compared to the Index since it is the mathematical equivalent to reinvesting dividends in each issuing entity over the performance Measurement Period.\n‎\nA summary of the Companys market share unit activity is as follows (in thousands, except share and per share amounts):\nWeighted-Average\nGrant Date\nNumber of\nFair Value\nAggregate\nMarket Share Units\nShares\nPer Share\nIntrinsic Value\nOutstanding at August 31, 2021\n36,594\n$\n194.83\nGranted\n13,195\n$\n232.99\nPerformance factor adjustments\n8,890\n$\n186.38\nConverted to common shares\n(20,050)\n$\n182.13\nForfeited\n(1,428)\n$\n208.74\nOutstanding at August 31, 2022 (1)\n37,201\n$\n212.66\n$\n7,037\n(1)This figure represents the total number of shares underlying MSU grants assuming achievement of the target number of shares at 100%. As the ultimate number of shares that vest could be as high as 200% of the target, the Company may be required to issue additional shares to satisfy outstanding MSU award grants.\nThe weighted-average grant date fair value of all MSUs granted during the fiscal years ended August 31, 2022, 2021 and 2020 was $232.99, $184.96 and $216.77, respectively. The total intrinsic value of all MSUs converted to common shares was $4.4 million, $5.9 million and $4.4 million for the fiscal years ended August 31, 2022, 2021 and 2020, respectively.\nThe income tax benefits from MSUs converted to common shares totaled $0.9 million for the fiscal year ended August 31, 2022, $1.3 million for the fiscal years ended August 31, 2021 and $0.9 million for the fiscal year ended August 31, 2020.\nDeferred Performance Units\nDuring fiscal year 2021, the Company discontinued the granting of new DPU awards. Although certain vested DPU awards granted in prior periods remain outstanding due to the deferred settlement feature contained within these award agreements, the expense associated with these awards has been fully recognized in prior periods. DPU awards converted to common shares issued to recipients following termination of employment from the Company were not material to the Companys consolidated financial statements and related disclosures during fiscal years 2022, 2021 and 2020 respectively.\nPerformance Share Units\nThe PSU awards provide for performance-based vesting over a measurement period of the fiscal year in which the PSU awards are granted. The performance vesting provisions of the PSUs are based on relative achievement within an established performance measure range of the Companys reported earnings before interest, income taxes, depreciation in operating departments, and amortization computed on a consolidated basis for the Measurement Year, before deduction of the stock-based compensation expense for the Vested PSUs and excluding other non-operating income and expense amounts (Adjusted Global EBITDA). The ultimate number of PSUs that vest may range from 0% to 100% of the original maximum number of DPUs awarded depending on the relative achievement of the Adjusted Global EBITDA performance measure at the end of the Measurement Year.\nThe estimated fair value of each of the Companys PSU awards was determined on the date of grant based on the closing market price of the Companys common stock on the date of grant less the grant date present value of expected dividends during the vesting period for the PSUs, which are not entitled to receive dividend equivalents with respect to the unvested PSUs.\n‎\nA summary of the Companys performance share unit activity is as follows (in thousands, except share and per share amounts):\nWeighted-Average\nGrant Date\nNumber of\nFair Value\nAggregate\nPerformance Share Units\nShares\nPer Share\nIntrinsic Value\nOutstanding at August 31, 2021\n18,252\n$\n$197.51\nGranted\n18,684\n$\n227.24\nPerformance factor adjustments\n-\n$\n-\nConverted to common shares\n(18,252)\n$\n197.51\nForfeited\n(858)\n$\n227.24\nOutstanding at August 31, 2022 (1)\n17,826\n$\n227.24\n$\n3,371,966\n(1)PSUs pertaining to the measurement year of fiscal year 2022 were forfeited in October 2022 since performance conditions were not achieved. Performance is certified annually in October by the Companys compensation committee subsequent to the Companys fiscal year end and are forfeited, or vest, depending on performance achievement.\nThe weighted-average grant date fair value of all PSUs granted during the fiscal years ended August 31, 2022 and 2021 was $227.24 and $197.51, respectively. This form of PSU awards were granted for the first time in October 2021. The total intrinsic value of all PSUs converted to common shares was $4.0 million for the fiscal year ended August 31, 2022.\nThe income tax benefits from PSUs converted to common shares totaled $0.8 million for the fiscal year ended August 31, 2022. There were no conversions of PSUs to common shares for the fiscal years ended August 31, 2021 and 2020.\nNote 15. Other Benefit Plans\nThe Company has a WD-40 Company Profit Sharing/401(k) Plan and Trust (the Profit Sharing/401(k) Plan) whereby regular U.S. employees who have completed certain minimum service requirements can defer a portion of their income through contributions to a trust. The Profit Sharing/401(k) Plan provides for Company contributions to the trust, as approved by the Board of Directors, as follows: 1) matching contributions to each participant up to 50% of the first 6.6% of compensation contributed by the participant; 2) fixed non-elective contributions in the amount equal to 10% of eligible compensation; and 3) a discretionary non-elective contribution in an amount to be determined by the Board of Directors up to 5% of eligible compensation. The Companys contributions are subject to overall employer contribution limits and may not exceed the amount deductible for income tax purposes. The Profit Sharing/401(k) Plan may be amended or discontinued at any time by the Company. The Companys contribution expense for the Profit Sharing/401(k) Plan was $4.1 million for fiscal year 2022, $3.9 million for fiscal year 2021 and $3.6 million for fiscal year 2020.\nThe Companys international subsidiaries have similar benefit plan arrangements, dependent upon the local applicable laws and regulations. The plans provide for Company contributions to an appropriate third-party plan, as approved by the subsidiarys Board of Directors. The Companys contribution expense related to the international plans was $2.1 million for the fiscal year ended August 31, 2022, $1.9 million for the fiscal year ended August 31, 2021 and $1.6 million for the fiscal year ended August 31, 2020.\n‎\nNote 16. Business Segments and Foreign Operations\nThe Company evaluates the performance of its segments and allocates resources to them based on sales and operating income. The Company is organized on the basis of geographical area into the following three segments: the Americas; EMEA; and Asia-Pacific. Segment data does not include inter-segment revenues. Unallocated corporate expenses are general corporate overhead expenses not directly attributable to the business segments and are reported separate from the Companys identified segments. The corporate overhead costs include expenses for the Companys accounting and finance, information technology, human resources, research and development, quality control and executive management functions, as well as all direct costs associated with public company compliance matters including legal, audit and other professional services costs.\nUnallocated\nAmericas\nEMEA\nAsia-Pacific\nCorporate (1)\nTotal\nFiscal Year Ended August 31, 2022\nNet sales\n$\n240,233\n$\n204,688\n$\n73,899\n$\n-\n$\n518,820\nIncome from operations\n$\n54,198\n$\n42,058\n$\n22,590\n$\n(31,516)\n$\n87,330\nDepreciation and\namortization expense\n$\n4,320\n$\n3,356\n$\n$\n$\n8,294\nInterest income\n$\n$\n-\n$\n$\n-\n$\nInterest expense\n$\n2,165\n$\n$\n$\n-\n$\n2,742\nFiscal Year Ended August 31, 2021\nNet sales\n$\n214,601\n$\n208,252\n$\n65,256\n$\n-\n$\n488,109\nIncome from operations\n$\n51,591\n$\n53,003\n$\n19,121\n$\n(34,874)\n$\n88,841\nDepreciation and\namortization expense\n$\n3,219\n$\n3,174\n$\n$\n$\n7,019\nInterest income\n$\n$\n$\n$\n-\n$\nInterest expense\n$\n1,909\n$\n$\n$\n-\n$\n2,395\nFiscal Year Ended August 31, 2020\nNet sales\n$\n200,493\n$\n156,241\n$\n51,764\n$\n-\n$\n408,498\nIncome from operations\n$\n51,089\n$\n37,620\n$\n14,982\n$\n(26,471)\n$\n77,220\nDepreciation and\namortization expense\n$\n4,361\n$\n2,855\n$\n$\n$\n7,701\nInterest income\n$\n$\n$\n$\n-\n$\nInterest expense\n$\n1,867\n$\n$\n$\n-\n$\n2,439\n(1)Unallocated corporate expenses are general corporate overhead expenses not directly attributable to any one of the business segments. These expenses are reported separate from the Companys identified segments and are included in Selling, General and Administrative expenses on the Companys consolidated statements of operations.\nThe Companys Chief Operating Decision Maker does not review assets by segment as part of the financial information provided and therefore, no asset information is provided in the above table.\nNet sales by product group are as follows (in thousands):\nFiscal Year Ended August 31,\nMaintenance products\n$\n485,326\n$\n448,817\n$\n369,444\nHomecare and cleaning products\n33,494\n39,292\n39,054\nTotal\n$\n518,820\n$\n488,109\n$\n408,498\n‎\nNet sales and long-lived assets by geographic area are as follows (in thousands):\nFiscal Year Ended August 31,\nNet Sales by Geography:\nUnited States\n$\n176,863\n$\n164,946\n$\n164,446\nInternational\n341,957\n323,163\n244,052\nTotal\n$\n518,820\n$\n488,109\n$\n408,498\nLong-lived Assets by Geography (1) :\nUnited States\n$\n35,375\n$\n37,204\n$\n32,242\nInternational\n30,602\n32,941\n28,517\nTotal\n$\n65,977\n$\n70,145\n$\n60,759\n(1) Includes tangible assets and property and equipment, net, attributed to the geographic location in which such assets are located.\nNote 17. Subsequent Event\nDividend Declaration\nOn October 11, 2022, the Companys Board of Directors declared a cash dividend of $0.78 per share payable on October 31, 2022 to shareholders of record on October 21, 2022."
}