{
    "cik": "1061164",
    "company": "PEREGRINE INDUSTRIES INC",
    "filing_type": "10-K",
    "filing_date": "2023-10-27",
    "period_of_report": "2023-07-31",
    "sic": "3569",
    "state_of_inc": "FL",
    "state_location": "NY",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1061164/0001477932-23-007895-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1061164/000147793223007895/pgid_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1061164/0001477932-23-007895.txt",
    "filename": "1061164_10K_2023_0001477932-23-007895.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nSome of the statements contained in this Form 10-K of Peregrine Industries, Inc. (hereinafter the Company, We or the Registrant) discuss future expectations, contain projections of our plan of operation or financial condition or state other forward-looking information. In this registration statement, forward-looking statements are generally identified by the words such as anticipate, plan, believe, expect, estimate, and the like. Forward-looking statements involve future risks and uncertainties, there are factors that could cause actual results or plans to differ materially from those expressed or implied. These statements are subject to known and unknown risks, uncertainties, and other factors that could cause the actual results to differ materially from those contemplated by the statements. The forward-looking information is based on various factors and is derived using numerous assumptions. A reader, whether investing in the Companys securities or not, should not place undue reliance on these forward-looking statements, which apply only as of the date of this annual report. Important factors that may cause actual results to differ from projections include, for example:\n·\nthe success or failure of managements efforts to implement the Registrants plan of operation;\n·\nthe ability of the Registrant to fund its operating expenses;\n·\nthe ability of the Registrant to compete with other companies that have a similar plan of operation;\n·\nthe effect of changing economic conditions impacting our plan of operation;\n·\nthe ability of the Registrant to meet the other risks as may be described in future filings with the SEC.\nOrganizational History and General Background of the Registrant\nThe Company was incorporated in Florida in 1995 for the purpose of designing and manufacturing heat pump pool heaters, residential air conditioners and parallel flow coils for the heating, ventilation and air conditioning industry. In June 2002, the Registrant and its subsidiaries filed a petition for bankruptcy in the U.S. Bankruptcy Court for the Southern District of Florida. The Company emerged from bankruptcy in March 2004 free and clear of all liens, claims and obligations. On July 17, 2017, Peregrine Industries, Inc., (the Registrant) issued a total of 22,477,843 or 97.7% of the issued common restricted shares of the Registrants common stock, par value $0.0001 (the Shares) to Dolomite Holdings Ltd., organized under the laws of the State of Israel and the corporate parent and principal shareholder of the Registrant (Dolomite). The Shares were issued upon the conversion by Dolomite, effective July 14, 2017, of principal and accrued interest owed by the Registrant to Dolomite evidenced by convertible notes and other short-term debt in the aggregate amount of $443,718, representing all of the liabilities of the Registrant at its fiscal year-ended June 30, 2017. The fair value of the shares was deemed to be the carrying value of the principal and accrued interest, $443,718. Dolomite was a related party therefore the settlement had no gain or loss. The issuance of the Shares was made in reliance upon the exemptions provided in Section 4(2) of the Securities Act of 1933, as amended (the Act) and Regulation S promulgated by the United States Securities and Exchange Commission (the SEC) under the Securities Act of 1933, as amended (the Act). . Effective July 21, 2017, Dolomite sold, transferred and assigned the total of 22,477,843 restricted shares of the Registrants common stock, to four persons, none of whom were affiliated with the Registrant or with Dolomite. The 22,477,843 Shares represented in excess of 97% of the Registrants total issued and outstanding Shares at July 21, 2017, resulting in a change of control of the Company.\nOn September 3, 2021, through our wholly owned subsidiary Mace Merger, Corp., Mace, Corporation was merged into our Company, through the issuance to each shareholder of one share of Peregrine, Industries for each four share of Mace, Corporation which they held. A total of 250,000,000 were issued. The 22,477,843 shares held per the above paragraph were returned to the Company for cancelation.\nBusiness Objectives of the Registrant\nThe Registrant, through the above merger is now carrying on the business, of Mace Corporation. Management has a business plan which it intends to pursue during the coming fiscal year. The Company is actively pursuing the Mace business model on which to concentrate. The Mace business model is in its infancy and accordingly, there is no basis for investors in the Companys common stock to evaluate the possible merits or risks of the target business or the particular industry in which it operates. We may be affected by numerous risks inherent in the business and operations of an early stage or potential emerging growth company.\nEmployees\nBecause of the virus and minimal operations the Company, presently, has two full time and two part time employees. We currently have no employees, except for those included in the Mace, Corporation merger. The officers perform any duties necessary for corporate maintenance. Our CEO performs all duties related to the operations of this business. We also plan to utilize additional independent contractors on a part-time/as needed basis. ITEM 1A. RISK FACTORS\nThe Company is a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and is not required to provide the information under this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nThe Company is a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and is not required to provide the information under this item. ITEM 2. DESCRIPTION OF PROPERTIES\nThe Company rents corporate office space located at 4525 W. Reno Ave., Ste. A 5, Las Vegas, NV. The office facilities consist of approximately 1,115 square feet of executive office space. The Registrant believes that the office facilities are sufficient for the foreseeable future. ITEM 3. LEGAL PROCEEDING\nNone. ITEM 4. MINE SAFETY DISCLOSURES\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON STOCK AND RELATED STOCKHOLDER MATTER\n(a) Market Price Information\nOur common stock is currently quoted on the OTCQB under the symbol PGID, an inter-dealer automated quotation system for equity securities not included on The NASDAQ Stock Market. Quotation of the Companys securities on the OTCQB limits the liquidity and price of the Companys common stock more than if the Companys shares of common stock were listed on The NASDAQ Stock Market or a national exchange. For the periods indicated, the following table sets forth the high and low bid prices per share of common stock. The below prices represent inter-dealer quotations without retail markup, markdown, or commission and may not necessarily represent actual transactions.\nFISCAL YEAR ENDED JULY 31\nHI\nLOW\nHI\nLOW\nOctober 31\n$ 0.45\n$ 0.45\n$ 0.02\n$ 0.02\nJanuary 31\n0.20\n0.20\n0.15\n0.15\nApril 30\n0.19\n0.18\n0.06\n0.06\nJuly 31\n0.18\n0.17\n0.28\n0.28\n(b) As of July 31, 2023, our shares of common stock were held by approximately 235 stockholders of record. The Companys transfer agent is VStock Transfer, LLC.\n(c) Dividends\nWe currently do not pay cash dividends on our common stock and have no plans to reinstate a dividend on our common stock.\n(d) Sale of Unregistered Securities\nOn July 17, 2017, Peregrine Industries, Inc., issued a total of 22,477,843 of its restricted common shares, par value $0.0001, to Dolomite Holdings Ltd., the corporate parent and principal shareholder of the Registrant, at that time. The Shares were issued upon the conversion by Dolomite, effective July 14, 2017, of principal and accrued interest owed by the Registrant to Dolomite evidenced by convertible notes and other short-term debt in the aggregate amount of $443,718, representing all of the liabilities of the Registrant at its fiscal year-ended June 30, 2017. The fair value of the shares is determined to be the carrying value of the principal and accrued interest of $443,718 since Dolomite was related party. Therefore the settlement didnt have any gain or loss.\nThe issuance of the Shares was made in reliance upon the exemptions provided in Section 4(2) of the Securities Act of 1933, as amended and Regulation S promulgated by the United States Securities and Exchange Commission under the Securities Act of 1933, as amended.\nEffective July 21, 2017, Dolomite sold, transferred and assigned a total of 22,477,843 restricted shares of the Registrants common stock, par value $0.0001 that it acquired upon the conversion of all liabilities owed by the Registrant to Dolomite, to four persons, none of whom were affiliated with the Registrant or with Dolomite. The 22,477,843 Shares represented in excess of 97% of the Registrants total issued and outstanding Shares at July 21, 2017, resulting in a change of control of the Company.\nEffective July 30, 2021 the Company issued 250,000,000 common restricted shares to the shareholders of Mace, Corporation in return for their shareholding in Mace, Corporation. At the same time the four controlling shareholders of the Company returned their combined 22,477,843 common restricted shares to be cancelled.\nOn June 1, 2022 the Company sold, to an affiliate, for cash, 500,000 of its common restricted shares, recorded at a cost of $0.10 per share.\nOn December 31, 2022 the Company sold, to an investor, for cash, 1,000,000 of its common restricted shares, recorded at a cost of $0.01 per share.\nOn March 28, 2023 the Company issued an additional 100,000 common restricted shares, to a previous investor, to settle a dispute, recorded at a cost of $0.15 per share.\n(e) Equity Compensation Plans\nWe have no equity compensation plans. ITEM 6. SELECTED FINANCIAL DATA\nN.A. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITIONS AND PLAN OF OPERATION\nThe following discussion contains forward-looking statements. Forward-looking statements give our current expectations or forecasts of future events. You can identify these statements by the fact that they do not relate strictly to historical or current facts. They use of words such as anticipate, estimate, expect, project, intend, plan, believe, and other words and terms of similar meaning in connection with any discussion of future operating or financial performance. From time to time, we also may provide forward-looking statements in other materials we release to the public.\nRecent Developments\nResults of Operations during the year ended July 31, 2023 as compared to the year ended July 31, 2022.\nAlthough we have not generated any revenues during the years previous to the Mace merger, Mace Corporation did generate $22,007 and $22,723 sales revenue during the years ended July 31, 2023 and 2022 respectively. Operating losses for the years ended July 31, 2023 and July 31, 2022 were $394,086 and $307,902 previous to building sale proceeds of $198,204 and forgiven payroll grants of $10,000, for the year ended July 31, 2022.\nLiquidity and Capital Resources\nOn July 31, 2023 and July 31, 2022 we had $397,465 and $572,972 cash on hand. For the year ended July 31, 2023, the Company used $173,939 for operating activities, compared to the year ended July 31, 2022 when we provided $390,714 cash, primarily from the sale of the Company owned building. For the year ended July 31, 2023 we used $11,568 compared to $18,724 to acquire patents during the year ended July 31, 2022. During the year ended July 31, 2023 we raised $10,000 from the sale of common stock compared to the year ended July 31, 2022 when we received $50,000 from the sale of common shares, $106,700 from SBA loans and repaid a $50,000 related party loan.\nAs of July 31, 2023 the Company has sufficient cash to satisfy its cash requirements for the next 12 months. If additional cash is required, through borrowings from its majority shareholders or a related party, management believes it can satisfy its cash requirements by obtaining financing from its controlling shareholders.\nOff-Balance Sheet Arrangements\nThe Company has only limited capital. Additional financing may be necessary for the Company to continue as a going concern.\nAs of July 31, 2023 and 2022, we did not have any off-balance sheet arrangements as defined in Item 303(a) (4) (ii) of Regulation S-K promulgated under the Securities Act of 1934.\nContractual Obligations and Commitments\nAs of July 31, 2023 and 2022 we did not have any contractual obligations other than the lease to rent the premises being utilized for the Company office.\nCritical Accounting Policies\nOur significant accounting policies are described in the notes to our financial statements for the years ended July 31, 2023 and 2022, and are included elsewhere in this 10-K. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe have not entered into, and do not expect to enter into, financial instruments for trading or hedging purposes. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Independent Registered Public Accounting Firm\nFinancial Statements for the years Ended July 31, 2023 and 2022\nBalance Sheets\nStatements of Operations\nStatement of Stockholders Deficit\nStatements of Cash Flows\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Peregrine Industries, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Peregrine Industries, Inc. as of July 31, 2023 and 2022, the related statements of operations, stockholders equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Companys auditor since 2020\nLakewood, CO\nOctober 26, 2023\nPeregrine Industries, Inc.\nBalance Sheets\nJuly 31,\nJuly 31,\nAssets\nCurrent assets\nCash and cash equivalents\n$ 397,465\n$ 572,972\nAccounts receivable\n18,116\n22,654\nInventory\n601,105\n784,294\nPrepaid expenses and other current assets\n4,248\n13,181\nTotal current assets\n1,020,934\n1,393,101\nLong term assets\nProduction equipment - net\n-\n4,563\nPatents - cost\n262,007\n262,731\nRight of use asset\n12,314\n30,023\nTotal long term assets\n274,321\n297,317\nTotal assets\n$ 1,295,255\n$ 1,690,419\nLiabilities and Stockholders' Equity\nCurrent liabilities\nAccounts payable and accrued expenses\n$ 2,604\n$ 11,122\nCurrent portion of lease liability\n12,614\n19,113\nCurrent portion of long term loan\n3,612\n-\nTotal current liabilities\n18,830\n30,235\nLong term liabilities\nSBA loan\n113,088\n116,700\nLease liability\n-\n11,061\nTotal long term liabilities\n113,088\n127,761\nStockholders' equity\nPreferred stock, $0.0001 par value; 5,000,000 authorized;\nnone issued and outstanding as of July 31, 2023 and 2022 , respectively\n-\n-\nCommon stock, $0.0001 par value; 500,000,000 shares authorized; 252,124,221\nshares issued and outstanding as of July 31, 2023 and 251,024,200\nas of July 31, 2022\n25,212\n25,102\nAdditional paid in capital\n5,966,279\n5,941,389\nAccumulated deficit\n(4,828,154 )\n(4,434,068 )\nTotal stockholders' equity\n1,163,337\n1,532,423\nTotal liabilities and stockholders' equity\n$ 1,295,255\n$ 1,690,419\n(see accompanying notes which are an integral part of these audited financial statements)\nPeregrine Industries, Inc.\nStatement of Operations\nFor the Years Ended\nJuly 31\nRevenue, net\n$ 22,007\n$ 22,723\nRevenue total\n22,007\n22,723\nCost of sales\nProduct cost\n9,941\n7,465\nCost of sales\n9,941\n7,465\nGross profit\n12,066\n15,257\nOperating expenses\nAmortization and inventory impairment\n182,415\n70,157\nGeneral and administrative expenses\n152,883\n114,295\nSalary and payroll costs\n70,172\n138,708\nTotal operating expenses\n405,470\n323,159\nLoss from operations\n(393,404 )\n(307,902 )\nOther income (expense)\nOther income\n10,886\n-\nGain on sale of land and buildings in excess of net book value\n-\n198,204\nPatent impairment\n(11,568 )\n-\nPayroll and other grants forgiven\n-\n10,000\nTotal other income (expense)\n(682 )\n208,204\nNet loss for the year\n$ (394,086 )\n$ (99,698 )\nBasic and diluted loss per share\n$ (0.00 )\n$ (0.00 )\nWeighted average shares outstanding\nBasic and diluted\n251,669,405\n250,606,392\n(see accompanying notes which are an integral part of these audited financial statements)\nPeregrine Industries, Inc.\nStatements of Stockholders' Equity\nFor the Years Ended July 31, 2023 and 2022\nCommon Shares\nPar Value\nAdditional\nPaid in\nCapital\nAccumulated\nDeficit\nTotal Equity\nBalances, July 31, 2022\n251,024,200\n$ 25,102\n$ 5,941,389\n$ (4,434,068 )\n$ 1,532,423\nCommon shares issued for cash\n1,000,000\n9,900\n-\n10,000\nCommon shares issued as a bonus\n100,000\n14,990\n-\n15,000\nCommon shares issued to balance\n-\n-\n-\n-\nLoss for the year\n-\n-\n-\n(394,086 )\n(394,086 )\nBalances, July 31, 2023\n252,124,221\n$ 25,212\n$ 5,966,279\n$ (4,828,154 )\n$ 1,163,337\nBalances, July 31, 2021\n250,524,200\n$ 25,052\n$ 5,891,439\n$ (4,334,370 )\n$ 1,582,121\nCommon shares issued for cash\n500,000\n49,950\n-\n50,000\nLoss for the year\n-\n-\n-\n(99,698 )\n(99,698 )\nBalances, July 31, 2022\n251,024,200\n$ 25,102\n$ 5,941,389\n$ (4,434,068 )\n$ 1,532,423\n(see accompanying notes which are an integral part of these audited financial statements)\nPeregrine Industries, Inc.\nStatements of Cash Flow\nFor the Years Ended\nJuly 31\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet income (loss)\n$ (394,086 )\n(99,698 )\nAdjustments to reconcile net income (loss) to net cash used in used in operating activities\nCommon restricted shares issued as a settlement\n15,000\n-\nInventory impairment\n182,415\n-\nPatent impairment\n12,293\n-\nGain on asset disposal\n-\n(198,204 )\nDepreciation\n4,564\n69,105\nChanges in operating assets and liabilities\nDecrease (increse) in inventory\nDecrease in accounts receivable\n4,538\n3,766\n(Decrease) increase in prepaid expenses and other current assets\n8,933\n(1,949 )\n(Decrease) increase in accounts payable and accrued expenses\n(8,518 )\n(15,166 )\nOperating lease liabilities\nCash provided by (used in) operating activities\n(173,939 )\n(241,915 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nCash used to acquire patents\n(11,568 )\n(18,724 )\nNet proceeds received for sale of land and buildings\n-\n632,629\nCash used in investing activities\n(11,568 )\n613,905\nCASH FLOWS FROM FINANCING ACTIVITIES\nSale of common shares for cash\n10,000\n50,000\nProceeds form SBA Payroll Protection Plan\n-\n106,700\nRepayment of related party loan\n-\n(50,000 )\nCash flows provided by financing activities\n10,000\n106,700\nNET (DECREASE) INCREASE IN CASH\n(175,507 )\n478,690\nCash at beginning of period\n572,972\n94,282\nCash at end of period\n$ 397,465\n572,972\n(see accompanying notes which are an integral part of these audited financial statements)\nPeregrine, Industries, Inc.\nNotes to Financial Statements\nFor the Year Ended July 31, 2023\nNOTE 1 - ORGANIZATION AND OPERATIONS:\nPeregrine Industries, Inc. (the \"Company\") was formed on October 1, 1995 for the purpose of manufacturing residential pool heaters. The Company was formerly located in Deerfield Beach, Florida. Products were primarily sold throughout the United States, Canada, and Brazil. In June 2002, the Registrant and its subsidiaries filed a petition for bankruptcy in the U.S. Bankruptcy Court for the Southern District of Florida. At present, the Company has no business operations and is deemed to be a shell company. The Company had a change in control on July 8, 2013 as a result of the sale by our former principal shareholders, Richard Rubin, Thomas J. Craft, Jr. and Ivo Heiden, of their 324,000 shares of common stock, representing approximately 61.8% of the Company's outstanding common stock, to Dolomite Industries Ltd (\"Dolomite\"). In connection with the private sale of their shares of common stock to Dolomite on July 2, 2013, Messrs. Rubin and Heiden agreed to waive a total of $224,196 in liabilities owed to them at June 30, 2013. In connection with the change of control transaction, two former principal shareholders transferred and assigned all $195,000 of their two convertible notes to three unaffiliated third parties and one affiliated party. See also note 3. On June 12, 2017, the Board of Directors of the Registrant appointed Mr. Zohar Shpitz as Chief Financial Officer (CFO) of the Registrant. Mr. Shpitz was appointed as CFO in connection with the resignation of Mr. Ofer Naveh as the Registrant's CFO, effective June 19, 2017. On July 21, 2017, new management acquired, 22,477,843 or 97.7% of the issued common restricted shares. The new management is developing a business plan which they anticipate implementing within the current fiscal year.\nOn September 3, 2021, through our wholly owned subsidiary Mace Merger, Corp., Mace, Corporation was merged into our Company, through the issuance to each shareholders of one share of Peregrine, Industries for each four share of Mace, Corporation which they held. A total of 250,000,000 were issued. The 22,477,843 shares held, by the new management, per the above paragraph, were returned to the Company for cancelation.\nNOTE 2 - BASIS OF PRESENTATION AND SIGNIFICANT ACCOUNTING POLICIES:\nBasis of Presentation\nThe financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America (US GAAP\").\nReclassification\nCertain reclassifications have been made to the prior year financial statements to conform to the 2022 financial statement presentation. Such reclassifications did not affect total revenues, operating income or net income or cash flows as previously reported.\nUse of Estimates:\nThe preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statement and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from the estimates.\nPeregrine, Industries, Inc.\nNotes to Financial Statements\nFor the Year Ended July 31, 2023\nCash and cash equivalents\nThe Company maintains its cash in United States dollars in United States bank accounts which balances, may exceed the federal insured limit of $250,000.\nLand and Building\nOn October 28, 2021, Mace Corporation completed the sale of its land and building, located at 9171 W Flamingo Rd., Las Vegas, Nevada. Net proceeds of $632,629, resulting from the sale price of $679,000, were held in escrow and received by the Company on November 2, 2021.\nEarnings (loss) per share:\nBasic loss per share is computed using the weighted average number of common shares outstanding during the period. Diluted net loss per common share is computed using the weighted average number of common and dilutive equivalent shares outstanding during the period. Dilutive common equivalent shares consist of options to purchase common stock (only if those options are exercisable and at prices below the average share price for the period) and shares issuable upon the conversion of issued and outstanding preferred stock. Due to the net losses reported, dilutive common equivalent shares were excluded from the computation of diluted loss per share, as inclusion would be anti-dilutive for the periods presented. There were no common equivalent shares required to be added to the basic weighted average shares outstanding to arrive at diluted weighted average shares outstanding as of July 31, 2023 and 2022.\nRevenue Recognition\nThe Company adopted Accounting Standards Codification (ASC) 606. ASC 606, Revenue from Contracts with Customers, establishes principles for reporting information about the nature, amount, timing and uncertainty of revenue and cash flows arising from the entitys contracts to provide goods or services to customers. The core principle requires an entity to recognize revenue to depict the transfer of goods or services to customers in an amount that reflects the consideration that it expects to be entitled to receive in exchange for those goods or services recognized as performance obligations are satisfied.\nThe Company has assessed the impact of the guidance by performing the following five steps analysis:\nStep 1: Identify the contract\nStep 2: Identify the performance obligations\nStep 3: Determine the transaction price\nStep 4: Allocate the transaction price\nStep 5: Recognize revenue\nPeregrine, Industries, Inc.\nNotes to Financial Statements\nFor the Year Ended July 31, 2023\nThe Company generates revenue from the sale of items used for the care of babies. Although the Company plans to sell, its products through distributors, the bulk of current revenue is derived through internet and social media venues. Revenue is recognized upon delivery of services and when the Company has the right to invoice the customer using the allowable practical expedient under ASC 606-10-55-18 since the right to invoice the customer corresponds with the performance obligations completed. Revenue is recognized when obligations under the terms of a contract with the Companys customers are satisfied. Satisfaction of contract terms occurs when shipping is performed, and the customers assume risk of loss. The amount of consideration the Company expects to receive consists of the sales price adjusted for any incentives if applicable. In applying judgment, the Company considered customer expectations of performance, materiality and the core principles of ASC Topic 606. The Companys performance obligations are generally transferred to the customer at a point in time. The Companys contracts with customers generally do not include any variable consideration.\nAccounts Receivable and Allowance for Doubtful Accounts\nAccounts receivable are stated at the amount management expects to collect from outstanding balances. Accounts receivable as of July 31, 2023 and July 31, 2022 were $18,116 and $22,654 respectively. An allowance for doubtful accounts will be provided for those accounts receivable considered to be uncollectable based on historical experience and managements evaluation of outstanding accounts receivable at the end of the period. Management has reviewed the current accounts receivable and has concluded that no allowance was necessary as of July 31, 2023 and July 31, 2022. Bad debts will be written off against the allowance when identified.\nInventory\nAs at July 31, 2023 and 2022, respectively, the Company had $601,105 and $784,294 worth of inventory, stated at the lower of cost or market, valued on an average cost basis. The inventory is reviewed at least quarterly and adjusted for and discrepancies. Managements evaluation was that there was impairment of $182,415 required on July 31, 2023 or $0.00 on July 31, 2022.\nRelated Party Transactions\nWe consider all directors, officers and those who own more than 5% shares to be related parties and record any transactions between them and the Company to be related party transactions and disclose such transactions on notes to the financial statements.\nPrepaid Expenses and Product Deposits\nPrepaid expenses, totaling $4,248 and $13,181 at July 31, 2023 and July 31, 2022 respectively consist of cash paid in advance for services to be provided. The Company outsources all of the manufacturing processes and has paid deposits, to its manufacturers. At July 31, 2023 and 2022, there were no outstanding deposits. Service provider prepayments are amortized over the useful life of the service.\nPeregrine, Industries, Inc.\nNotes to Financial Statements\nFor the Year Ended July 31, 2023\nProperty and Equipment\nProperty and equipment consists primarily of office furniture and equipment stated at original cost less accumulated depreciation. Depreciation was calculated using the straight line method based on the estimated useful life of the underlying asset, generally three to five years. Expenditures for repairs and maintenance are expensed as incurred.\nProduction Molds\nThe building of production molds is outsourced to specialists and is recorded at the total cost to acquire each. The molds are built to specifications that include the number of parts anticipated to be produced. The cost of the mold is depreciated on a straight line basis over 5 years. Cost of repairs and maintenance will be expensed as incurred. The value of each mold is reviewed quarterly and will be impaired, when necessary, based on managements valuation of the molds continuing viability. Depreciation of $359,040 has been recorded through July 31, 2023. Because the molds were totally depreciated no depreciation was recorded for the year ended July 31, 2023 compared to $51,899 for the year ended July 31, 2022.\nPatents\nPatent costs consist of the legal fees paid to prepare, file and process the patent applications. Patents will be amortized, utilizing the straight line method, over the useful life of the patent and will be reviewed quarterly to determine if impairment is required. Research and development are not included in the cost of patents, and, are expensed as incurred. Management paid $11,568 for patent costs and determined that patent assets should be impaired by $12,293 for the year ended July 31, 2023.\nRecently Adopted Accounting Pronouncements\nIn February 2016, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2016-02, Leases (Topic 842). This pronouncement requires lessees to recognize a liability for lease obligations, which represents the discounted obligation to make future lease payments, and a corresponding right-of-use (ROU) asset on the balance sheet. The Company adopted ASU 2016-02, along with related clarifications and improvements, as of April 30, 2022.\nThe Company has evaluated and implemented all new accounting pronouncements that are in effect and that may impact its financial statements and does not believe that there are any other new pronouncements that have been issued that might have a material impact on its financial position or results of operations.\nIncome taxes\nThe Company follows ASC Topic 740 for recording the provision for income taxes. Deferred tax assets and liabilities are computed based upon the difference between the financial statement and income tax basis of assets and liabilities using the enacted marginal tax rate applicable when the related asset or liability is expected to be realized or settled. Deferred income tax expenses or benefits are based on the changes in the asset or liability each period. If available evidence suggests that it is more likely than not that some portion or all of the deferred tax assets will not be realized, a valuation allowance is required to reduce the deferred tax assets to the amount that is more likely than not to be realized. Future changes in such valuation allowance are included in the provision for deferred income taxes in the period of change.\nDeferred income taxes may arise from temporary differences resulting from income and expense items reported for financial accounting and tax purposes in different periods. Deferred taxes are classified as current or non-current, depending on the classification of assets and liabilities to which they relate. Deferred taxes arising from temporary differences that are not related to an asset or liability are classified as current or non-current depending on the periods in which the temporary differences are expected to reverse.\nPeregrine, Industries, Inc.\nNotes to Financial Statements\nFor the Year Ended July 31, 2023\nThe Company applies a more-likely-than-not recognition threshold for all tax uncertainties. ASC Topic 740 only allows the recognition of those tax benefits that have a greater than fifty percent likelihood of being sustained upon examination by the taxing authorities. As of July 31, 2023, the Company reviewed its tax positions and determined there were no outstanding, or retroactive tax positions with less than a 50% likelihood of being sustained upon examination by the taxing authorities, therefore this standard has not had a material effect on the Company.\nThe Company does not anticipate any significant changes to its total unrecognized tax benefits within the next 12 months.\nThe Company classifies tax-related penalties and net interest as income tax expense. As of July 31, 2023, no income tax expense has been incurred.\nThe cumulative tax effect at the expected rate of 21% of significant items comprising our net deferred tax amount is as follows:\nOperating loss\n$ 3,724,191\n$ 3,330,105\nDeferred tax benefit\n$ 782,080\n$ 699,322\nValuation allowance\n(782,080 )\n(699,322 )\nNet deferred tax asset\n$ -\n$ -\nShare-Based Compensation\nThe Company accounts for stock-based compensation to employees in accordance with FASB ASC 718 Compensation-Stock Compensation. Stock-based compensation to employees is measured at the grant date, based on the fair value of the award, and is recognized as expense over the requisite employee service period. The Company accounts for stock-based compensation to other than employees in accordance with FASB ASC 505-50 and since 2020 ASC 718 as well. Equity instruments issued to other than employees are valued at the earlier of a commitment date or upon completion of the services, based on the fair value of the equity instruments and is recognized as expense over the service period.\nFair Value Measurement\nThe Company adopted FASB ASC 820 - Fair Value Measurement and Disclosures, or ASC 820, for assets and liabilities measured at fair value on a recurring basis. ASC 820 establishes a common definition for fair value to be applied to existing generally accepted accounting principles that require the use of fair value measurements establishes a framework for measuring fair value and expands disclosure about such fair value measurements. The adoption of ASC 820 did not have an impact on the Companys financial position or operating results, but did expand certain disclosures.\nPeregrine, Industries, Inc.\nNotes to Financial Statements\nFor the Year Ended July 31, 2023\nASC 820 defines fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Additionally ASC 820 requires the use of valuation techniques that maximize the use of observable inputs and minimize the use of unobservable inputs. These inputs are prioritized below:\nLevel 1: Observable inputs such as quoted prices (unadjusted) in active markets for identical assets or liabilities.\nLevel 2: Inputs other than quoted prices that are observable, either directly or indirectly. These include quoted prices for similar assets or liabilities in active markets and quoted prices for identical or similar assets or liabilities in markets that are not active.\nLevel 3: Unobservable inputs in which little or no market data exists, therefore developed using estimates and assumptions developed by us, which reflect those that a market participant would use.\nThe Company did not have any Level 2 or Level 3 assets or liabilities as of July 31, 2023\nNOTE 3 - GOING CONCERN:\nThe Company's financial statements have been prepared on a going concern basis, which contemplates the realization of assets and settlement of liabilities and commitments in the normal course of business for the foreseeable future. The Company has accumulated losses aggregating $4,828,154 and $4,434,068 as of July 31, 2023 and 2022 respectively. During the year ended July 31, 2023, the Company recorded a loss of $394,086 which included an inventory valuation write down of $182,415, compared to a net loss for the year ended July 31, 2022 of $99,698 which included profit of $198,204 derived from the sale of its building, plus $10,000 from debt forgiveness. The Company has sufficient cash on hand to support its operations for the next fiscal year but has limited business operations, which raises substantial doubt about the Companys ability to continue as a going concern.\nThe financial statements do not include any adjustment relating to the recoverability and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThe Company is taking appropriate action to provide the necessary capital to continue its operations. These steps include, but are not limited to: 1) implementation of new business plan 2)focus on sales to minimize the need for capital at this stage; 3) raising equity financing; 4) continuous focus on reductions in cost where possible. There is no assurance that equity or debt offerings will be successful in raising sufficient funds to assure the eventual profitability of the Company.\nNOTE 4 - RELATED PARTY TRANSACTIONS:\nOn May 17, 2021, a related party loaned the Company $50,000 non-interest bearing, unsecured and without repayment terms. The loan was repaid on November 8, 2021.\nThe four controlling shareholders, as a condition of the Merger Agreement, returned, for cancellation, their 22,477,843 common restricted shares to the Company.\nNOTE 5 - STOCKHOLDERS DEFICIT:\nCommon Stock\nThe articles of incorporation authorize the issuance of 500,000,000 shares of common stock, par value $0.0001. All issued shares of common stock are entitled to one vote per share of common stock. Effective July 31, 2021, the Company issued 250,000,000 common restricted shares to the Mace shareholders to acquire 100% of the Mace Corporation. The Companys controlling shareholders, simultaneously, returned, for cancellation, their 22,477,843 common shares.\nPeregrine, Industries, Inc.\nNotes to Financial Statements\nFor the Year Ended July 31, 2023\nDuring December 2022, the Company sold 1,000,000 of its common restricted shares, for $10,000 cash, or $0.01 per share.\nOn March 28, 2023, the Company issued 100,000 common restricted shares to an existing investor, in settlement of a dispute, recorded at a cost of $0.15 per share.\nPreferred Stock\nThe articles of incorporation authorize the issuance of 5,000,000 shares of preferred stock with a par value of $0.0001 per share. None are issued.\nNOTE 6 - COMMITMENTS AND CONTINGIES\nLeases\nPrior to April 1, 2022, our office was located in 9171 W Flamingo Rd, Las Vegas. We sold the property on October 28, 2021 and subsequently signed a lease agreement for the same building for approximately 8 months from October 28, 2021 to June 30, 2022. No ASC Topic 842 was implemented under this agreement since its under 1 year. Effective April 1, 2022, we moved to 4525 W Reno Avenue, Las Vegas under a 24-month rental agreement covering April 1, 2022 through March 31, 2024, with an initial monthly rental rate of $1,525 in the first year increasing to a monthly rate of $1,600 in second year. At July 31, 2023, in accordance with ASC Topic 842, we recognized a right of use (ROU) asset of $12,314 and an operating lease liability of $12,614. The lease liability is determined by discounting the future lease payments under the lease terms and applying a 5% per annum discount rate to determine the current lease liability.\nSupplemental balance sheet information related to operating leases is as follows:\nJuly 31, 2023\nRight-of-use assets\n$ 12,314\nTotal\n$ 12,314\nOperating lease liabilities, current\n$ 12,614\nOperating lease liabilities, non-current\n$ -\nTotal operating lease liabilities\n$ 12,614\nOperating lease cost\n$ 18,750\nTotal lease cost\n$ 18,750\nWeighted average discount rate\n5.00 %\nWeighted average remaining lease terms (years)\n0.67\nFuture minimum lease payment\n8 months ending July 31, 2024\n12,800\nTotal\n12,800\nImputed interest\n(186 )\nTotal lease liabilities\n12,614\nU.S. Small Business Administration Loan and Agreement\nOn February 19, 2022 the U.S. Small Business Administration authorized a secured loan, in the amount of $116,800, to Mace Corporation. The loan balance, bearing interest of 3.75%, with payments of $602 per month beginning 24 months after the aforementioned date, will be due and payable in 30 years.\nNOTE 7 - SUBSEQUENT EVENTS:\nSubsequent to July 31, 2023 and through the date when this report was completed, the Company has evaluated subsequent events through the date the financial statements were issued and has not identified any reportable events. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nManagements Report on Disclosure Controls and Procedures\nDisclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934 (the Exchange Act), are our controls and other procedures that are designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Act is accumulated and communicated to our management to allow timely decisions regarding required disclosure. Rules 13a-15(b) and 15d-15(b) under the Exchange Act, requires us to carry out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of July 31, 2023. This evaluation was implemented under the supervision and with the participation of our officers and directors.\nBased on this evaluation, management concluded that, as of July 31, 2023 our disclosure controls and procedures are ineffective in ensuring that information required to be disclosed in our Exchange Act reports is (1) recorded, processed, summarized and reported in a timely manner and (2) accumulated and communicated to our management to allow timely decisions regarding required disclosure.\nOur officers and directors have concluded that our disclosure controls and procedures had the following material weaknesses:\nWe were unable to maintain any segregation of duties within our financial operations due to our reliance on limited personnel in the finance function. This control deficiency resulted in an audit adjustment to our financial statements, and could have resulted in a material misstatement that might have been prevented or detected by a segregation of duties.\nWe do not have an independent Board of Directors, nor do we have a board member designated as an independent financial expert. The Board of Directors is comprised of four members who also serve as executive officers. As a result, there is a lack of independent oversight of the management team, lack of independent review of our operating and financial results, and lack of independent review of disclosures made by us; and documentation of all proper accounting procedures is not yet complete. There is a lack of formal documentation of internal control policies and procedures.\nTo the extent reasonably possible given our limited resources, we intend to take measures to cure the aforementioned weaknesses, including, but not limited to, the following:\nEngaging consultants to assist in ensuring that accounting policies and procedures are consistent across the organization and that we have adequate control over financial statement disclosures;\nHiring additional qualified financial personnel;\nExpanding our current board of directors to include additional independent individuals willing to perform directorial functions; and\nIncreasing our workforce in preparation for exiting the development stage and commencing revenue producing operations.\nSince the recited remedial actions will require that we hire or engage additional personnel, these material weaknesses may not be overcome in the near-term due to our limited financial resources. Until such remedial actions can be realized, we will continue to rely on the limited advice of outside professionals and consultants. These initiatives will be subject to our ability to obtain sufficient future financing and subject to our ability to start generating revenue.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control system was designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation and fair presentation of our financial statements for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur officers have assessed the effectiveness of our internal controls over financial reporting as of July 31, 2023. In making this assessment, management used the criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based upon its assessment, management concluded that, as of July 31, 2023, our internal control over financial reporting was ineffective.\nManagement has identified a lack of sufficient personnel in the accounting function due to our limited resources with appropriate skills, training and experience to perform the review processes to ensure the complete and proper application of generally accepted accounting principles. We are in the process of developing and implementing remediation plans to address our material weaknesses in our internal controls.\nManagement has identified specific remedial actions to address the material weaknesses described above:\nImprove the effectiveness of the accounting group by augmenting our existing resources with additional consultants or employees to improve segregation procedures and to assist in the analysis and recording of complex accounting transactions and preparation of tax disclosures. We plan to mitigate the segregation of duties issue by hiring additional personnel in the accounting department once we have achieved positive cash flow from operations and/or have raised significant additional working capital; and improve segregation procedures by strengthening cross approval of various functions including cash disbursements and quarterly internal audit procedures where appropriate.\nDue to its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to an exemption for smaller reporting companies under Section 989G of the Dodd-Frank Wall Street Reform and Consumer Protection Act.\nChanges in Internal Control over Financial Reporting\nDuring the year ended July 31, 2023 there were no changes in our internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone\nPART III ITEM 10. DIRECTORS AND EXECUTIVE OFFICERS OF THE REGISTRANT, AND CORPORATE GOVERNANCE\nThe following table sets forth the names and ages of the members of our Board of Directors and our executive officers and the positions held by each:\nMiaohong Hanson\nAge 58\nPresident and Chief Executive Officer\nDong Hai Shi\nAge 59\nChairman of Board of Directors; Executive Vice President\nRonaldo Panida\nAge 61\nDirector/CFO\nDaniel Slater\nAge 30\nDirector; Secretary, Treasurer\nJeff Rorick\nAge 66\nDirector\nMiaohong Hanson, President, CEO and Director; Ms. Miaohong Hanson, age 58 has served as President and CEO of Mace Corporation from December 2015 to present. Miaohong Hanson is Chief Executive Officer of Mace Corporation, Inc. Mrs. Hanson brings a wealth of knowledge in the field of business development, management, and all stages of product line development. She has managed companies in the United States and Asia. Mrs. Hanson is also the Chairwoman of the Board of Directors of Mace Corporation and Peregrine Industries, Inc. Prior to the formation of Mace Corporation, Inc., Mrs. Hanson was Chief Financial Officer and Vice President for J.C. Hanson & Associates, was previously Vice President and Manager of Purchases, Sales, and Customer Service (South China) for Jiangxi Techmed Inkjet Co. Ltd. Ms. Hanson speaks fluent Chinese and English. Ms. Hanson was selected for the Board of Directors because of her general business experience and management knowledge of United States and Asian markets.\nDong Hai Shi, Chairman of Board of Directors, Executive Vice President and Director;. Dong Hai Shi, age 58, has served as Executive V.P. of Mace Corporation from December 2015 to present. He also is the founder and chairman Hong Kong WeChat Business E-Commerce Ltd and USA WeChat Business E-Commerce, Inc. He was founder and chairman of Shang Hai Hai Tong Architectural Ltd., Shang Hai Ao Tong Property Management Inc., and Shang Hai Si Tong Construction Ltd. He was the president of his own construction company in Shang Hai from 2005 to 2009. He speaks fluent Chinese and some English. Mr. Shi was selected for the Board of Directors because of his general business experience, knowledge, contacts, and multiple businesses in Asia.\nRonaldo Panida, Director, Chief Financial Officer; Ronaldo Panida, age 60, is presently employed by Wal-Mart Vision Center as a Vision Center Manager. He was previously a District Manager for the Optical Division in Reno, NV, Hawaii and Alaska. Duties were, Operations, Budgeting and Compliance. He attended Leeward College of University of Hawaii major in Liberal Arts. Attended Kenway School of Accounting and received a Diploma as a Fullcharge Accountant in Hawaii. Mr. Panida later became an Optical Technician in Hawaii and received a Refracting Optician Diploma. Mr. Panida is currently a Licensed Optician in both the state of Nevada and the state of Hawaii. He is certified in both American Board of Optician and National Contact Lens Certified. Mr. Panida was selected as a director because of his business experience in a retail environment.\nJeff Rorick, Director; Jeff Rorick, age 67, is an Information Systems professional with extensive experience in Retail Operations. He has been a Chief Information Officer and member of Executive Committee since 2003. His core strength is in Applications Development with expertise in Supply Chain Management, Marketing and Store Systems. His key strengths include planning, team building, communication and decision making. He has maintained excellent relationships with members of senior management and was a key member involved in merger activities in both the grocery and drug sectors. Despite retiring at the end of 2014, he is open to consulting opportunities. He has completed two years of general education with emphasis on Accounting and Information Systems, and attended and sponsored numerous management, leadership and technical training programs.\nDaniel Slater, Director, Secretary and Treasurer; Daniel Slater, age 30, has handled a variety of tasks and processes during the almost two years he has been employed at Mace Corporation. Some of those activities include: preparation of stock certificates, managing out-of-office shipments, reviewing board resolutions, and responsibility for sales and reconciliations in the Mace accounting system. Prior to his employment, he has proven himself to be a diligent student, graduating from UNLV with a Bachelor of Science in Business Administration; Accounting degree in 2015, and again from UNLV with a Master of Science in accounting degree in 2017.\nCode of Ethics\nThe Corporation has adopted a Code of Ethics that are designed to deter wrongdoing and to promote honest and ethical conduct, full, fair, accurate, timely and understandable disclosure in the Registrants SEC reports and other public communications. The Code of Ethics promotes compliance with applicable governmental laws, rules and regulations.\nSection 16(a) Compliance\nSection 16(a) of the Securities and Exchange Act of 1934 requires the Registrants directors and executive officers, and persons who own beneficially more than ten percent (10%) of the Registrants Common Stock, to file reports of ownership and changes of ownership with the Securities and Exchange Commission. Copies of all filed reports are required to be furnished to the Registrant pursuant to Section 16(a). Based solely on the reports received by the Registrant and on written representations from reporting persons, the Registrant was informed that its officer and director have not filed all reports required under Section 16(a). ITEM 11. EXECUTIVE COMPENSATION\nNo executive compensation was paid, by the Company, during the fiscal periods ended July 31, 2023 and 2022. The Registrant has no employment agreement with its Directors.\nExecutive Employment Agreements\nTo date, we have not entered into any employment agreements with our executive officers. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nThe following table sets forth information regarding the beneficial ownership of our common stock as of July 31, 2023. The information in this table provides the ownership information for: each person known by us to be the beneficial owner of more than 5% of our common stock; each of our directors; each of our executive officers; and our executive officers and directors as a group. Beneficial ownership has been determined in accordance with the rules and regulations of the SEC and includes voting or investment power with respect to the shares. Unless otherwise indicated, the persons named in the table below have sole voting and investment power with respect to the number of shares indicated as beneficially owned by them.\nName of Beneficial Owner\nCommon Stock\nBeneficially Owned (1)\nPercentage of\nCommon Stock\nBeneficially\nOwned (1)\nDong Hai Shi\nChairman of board of directors, executive vice president, director\n72,227,414\n28.7\n%\nMiaohong Hanson\nPresident, C.E.O. director\n23,750,000\n9.4\n%\nRonaldo Panida\nDirector, C.F.O.\n1,266,500\n0.0\n%\nall directors and officers as a group\n97,243,914\n38.1\n%\n(1)\nApplicable percentage ownership is based on 252,124,221 shares of common stock outstanding as of July 31, 2023. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nDuring the last two fiscal years, to the knowledge of the Registrant, there was no person who had or has a direct or indirect material interest in any transaction or proposed transaction to which the Registrant was or is a party. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nOn February 4th, 2020 (the Engagement Date), the Company engaged BF Borgers CPA PC (New Auditor) as its independent registered public accounting firm for the Companys fiscal year ended July 31, 2020. The decision to engage the new auditor as the Companys independent registered public accounting firm was approved by the Companys Board of Directors.\nPrincipal Accounting Fees\nThe following table presents the fees for professional audit services rendered by BF Borgers CPA PC for the audit of the Registrants annual financial statements, for the years ended July 31, 2023 and July 31, 2022, respectively, and fees billed for other services rendered by B F Borgers CPA PC.\nYear Ended\nJuly 31,\nJuly 31,\nAudit fees (1)\n$ 32,500\n25,500\nAudit-related fees (2)\n-\n2,550\nAll other fees\n-\n-\n(1)\nAudit fees consist of audit and review services, consents and review of documents filed with the SEC.\n(2)\nAudit-related fees consist of assistance and discussion concerning financial accounting and reporting standards and other accounting issues. ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULE\n(a) The following documents are filed as exhibits to this report on Form 10-K or incorporated by reference herein. Any document incorporated by reference is identified by a parenthetical reference to the SEC filing that included such document.\nExhibit No.\nDescription\n31.1\nCertification of CEO pursuant to Rule 13a-14(a) or 15d-14(a) of the Exchange Act pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of CFO pursuant to Rule 13a-14(a) or 15d-14(a) of the Exchange Act pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of CEO pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification of CFO pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101).\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, this report has been signed below by the following person on behalf of the registrant and in the capacities and on the date indicated.\nPEREGRINE INDUSTRIES INC.\nDate: October 26, 2023\nBy:\n/s/ Miahong Hanson\nMiahong Hanson\nPresident and Chief Executive Officer"
}