{
    "cik": "1069533",
    "company": "RGC RESOURCES INC",
    "filing_type": "10-K",
    "filing_date": "2023-12-01",
    "period_of_report": "2023-09-30",
    "sic": "4923",
    "state_of_inc": "VA",
    "state_location": "VA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1069533/0001437749-23-033392-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1069533/000143774923033392/rgco20230930_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1069533/0001437749-23-033392.txt",
    "filename": "1069533_10K_2023_0001437749-23-033392.htm",
    "content": "Item 1. Business.\nGeneral and Historical Development\nResources was incorporated in the Commonwealth of Virginia on July 31, 1998 and, effective July 1, 1999, its subsidiaries were reorganized into the Resources holding company structure. Resources is currently composed of the following subsidiaries: Roanoke Gas, Midstream and Diversified Energy.\nRoanoke Gas, originally established in 1883, was organized as a public service corporation under the laws of the Commonwealth of Virginia in 1912. The principal service of Roanoke Gas is the distribution and sale of natural gas to residential, commercial and industrial customers within its service territory in Roanoke, Virginia and the surrounding localities. Roanoke Gas also provides certain non-regulated services which account for less than 1% of consolidated revenues.\nIn July 2015, the Company formed Midstream for the purpose of becoming an investor in Mountain Valley Pipeline, LLC. The LLC was created to construct and operate interstate natural gas pipelines. Additional information regarding this investment is provided under Note 5 of the Company's annual consolidated financial statements and under the Equity Investment in Mountain Valley Pipeline section of Item 7.\nDiversified Energy is currently inactive.\nServices\nRoanoke Gas maintains an integrated natural gas distribution system to deliver natural gas purchased from suppliers to residential, commercial and industrial users in its service territory. The schedule below is a summary of customers, delivered volumes (expressed in DTHs), revenues and margin as a percentage of the total for each category. For the purposes of this schedule, margin for the utility operations is defined as revenues less cost of gas.\nCustomers\nVolume\nRevenue\nMargin\nResidential\n91.3 %\n33.7 %\n58.1 %\n62.6 %\nCommercial\n8.6 %\n29.2 %\n34.7 %\n24.7 %\nIndustrial\n0.1 %\n37.1 %\n5.9 %\n10.0 %\nOther utility\n0.0 %\n0.0 %\n1.0 %\n2.5 %\nOther non-utility\n0.0 %\n0.0 %\n0.3 %\n0.2 %\nTotal percent\n100.0 %\n100.0 %\n100.0 %\n100.0 %\nTotal value\n62,221\n10,185,005\n$ 97,439,765\n$ 45,671,443\nCustomers\nVolume\nRevenue\nMargin\nResidential\n91.3 %\n34.5 %\n57.3 %\n62.6 %\nCommercial\n8.6 %\n29.2 %\n34.9 %\n24.3 %\nIndustrial\n0.1 %\n36.3 %\n6.7 %\n10.9 %\nOther utility\n0.0 %\n0.0 %\n0.8 %\n2.0 %\nOther non-utility\n0.0 %\n0.0 %\n0.3 %\n0.2 %\nTotal percent\n100.0 %\n100.0 %\n100.0 %\n100.0 %\nTotal value\n62,001\n10,325,336\n$ 84,165,222\n$ 41,640,041\nRoanoke Gas regulated natural gas distribution business accounted for more than 99% of Resources total revenues for fiscal years ending September 30, 2023 and 2022. The tables above indicate that residential customers represent over 91% of the Companys customer total; however, they represent less than 35% of the total gas volumes delivered and more than half of the Companys consolidated revenues and margin. Industrial customers primarily include transportation customers that purchase their natural gas requirements directly from a supplier other than the Company and utilize Roanoke Gas natural gas distribution system for delivery to their operations. Most of the revenue billed for these customers relates only to transportation service, and not to the purchase of natural gas, resulting in total revenues generated by these deliveries to be less than 10%, although they represent more than 35% of total natural gas volumes and approximately 10% of margin for the years presented.\nThe Companys revenues are affected by changes in gas costs, changes in consumption volume due to weather and economic conditions and changes in the non-gas portion of customer billing rates. Increases or decreases in the cost of natural gas are passed on to customers through the PGA mechanism as explained in Note 1 of the Companys annual consolidated financial statements.\nThe Companys residential and commercial sales are primarily seasonal and subject to temperature sensitivity as the majority of the gas sold by Roanoke Gas to these customers is used for heating. For the fiscal year ended September 30, 2023, approximately 59% of the Companys total DTH of natural gas deliveries and 71% of the residential and commercial deliveries were made in the five-month period of November through March.\nRoanoke Gas relies on multiple interstate pipelines, including those operated by Columbia Gas Transmission Corporation, LLC and Columbia Gulf Transmission Corporation, LLC (together Columbia), and East Tennessee Natural Gas, LLC (East Tennessee), Tennessee Gas Pipeline, Midwestern Gas Transmission Company and Saltville Gas Storage Company, LLC (\"Saltville\"), to transport natural gas from the production and storage fields to Roanoke Gas distribution system. Roanoke Gas is currently served by two pipelines, Columbia and East Tennessee. Columbia historically has delivered more than 65% of the Companys required gas supply, with East Tennessee delivering the remainder. The rates paid for interstate natural gas transportation and storage services are established by tariffs approved by FERC. The current pipeline and storage contracts expire at various times from calendar 2024 to 2028. The Company anticipates being able to renew these contracts or enter into other contracts to meet customers existing demand for natural gas.\nIn March 2023, Roanoke Gas began operation of its RNG facility. Total volume produced from RNG is expected to be less than 1% of current system needs.\nThe Company manages its pipeline contracts and LNG facility in order to provide for sufficient capacity to meet the current natural gas demands of its customers. The maximum daily winter capacity available for delivery into Roanoke Gas distribution system from the current interstate pipelines is 78,606 DTH per day. The LNG facility is capable of storing up to 200,000 DTH of natural gas in a liquid state for use during peak demand. Combined, the pipelines and LNG facility may provide up to 103,606 DTH on a single winter day. Once in service, the MVP will provide Roanoke Gas with additional pipeline capacity to help meet current and future customer energy requirements.\nThe Company currently contracts with Sequent Energy Management, L.P. to manage its pipeline transportation, storage rights, gas supply inventories and deliveries and serve as the primary supplier of natural gas for Roanoke Gas. Natural gas purchased under the asset management agreement is priced at indexed-based market prices as reported in major industry pricing publications. The current Sequent contract expires March 31, 2025.\nThe Company uses summer storage programs to supplement heating season gas supply requirements. The Company has contracted for 2.4 million DTH of storage capacity from Columbia, Tennessee Gas Pipeline and Saltville in addition to the capacity available at the Company's LNG facility. The balance of the Companys annual natural gas requirements are met primarily through market purchases made by its asset manager.\nCompetition\nThe Companys natural gas utility operates in a regulated, monopolistic environment. Roanoke Gas currently holds the only franchises and/or CPCNs to distribute natural gas in its Virginia service areas. These franchises generally extend for multi-year periods and are renewable by the municipalities, including exclusive franchises in the cities of Roanoke and Salem and the Town of Vinton, Virginia. All three franchises are set to expire December 31, 2035. In 2019, the SCC issued an order granting a CPCN to furnish gas to all of Franklin County. Unlike the CPCNs for the other counties served by Roanoke Gas, the Franklin County CPCN was scheduled to terminate within five years of the date of the order if Roanoke Gas did not furnish gas service to the designated service area. In November 2023, the SCC granted Roanoke Gas a three-year extension on the CPCN. Roanoke Gas plans to serve the Franklin County area with natural gas delivered through the MVP, once MVP is placed into service.\nManagement anticipates that the Company will be able to renew all of its franchises prior to their current expiration date; however, there can be no assurance that a given jurisdiction will not refuse to renew a franchise or will not, in connection with the renewal of a franchise, attempt to impose restrictions or conditions that could adversely affect the Companys business operations or financial condition. CPCNs, issued by the SCC, are generally of perpetual duration and subject to compliance with regulatory standards.\nAlthough Roanoke Gas has exclusive rights for the distribution of natural gas in its service area, the Company competes with suppliers of other forms of energy such as fuel oil, electricity, propane, coal, wind and solar. Competition can be intense among the other energy sources with price being the primary consideration. This is particularly true for those industrial applications that have the ability to switch to alternative fuels. The relationship between supply and demand has the greatest impact on the price of natural gas. Greater demand for natural gas for electric generation and other uses can provide upward pressure on the price of natural gas.\nCompetition from renewable energy sources, such as solar and wind, is likely to increase as the political environment currently favors these energy sources through incentives or by placing restrictions on emissions from the burning of fossil fuels. Nevertheless, the Company continues to see a demand for natural gas. Growth in residential and commercial service has been steady as the Company continues to expand its customer base through a combination of extending distribution service and converting other energy users to natural gas.\nRegulation\nIn addition to the regulatory requirements generally applicable to all companies, Roanoke Gas is also subject to additional regulation at the federal, state and local levels. At the federal level, the Company is subject to pipeline safety regulations issued by the Department of Transportation's Pipeline and Hazardous Materials Safety Administration.\nAt the state level, the SCC performs regulatory oversight including the approval of rates and other charges for natural gas sold to customers, the approval of agreements between or among affiliated companies involving the provision of goods and services, pipeline safety and certain other corporate activities of the Company, including mergers and acquisitions related to utility operations.\nAt the local level, Roanoke Gas is further regulated by the municipalities and localities that grant franchises for the placement of gas distribution pipelines and the operation of gas distribution networks within their jurisdictions.\nHuman Capital Resources\nAt September 30, 2023, Resources had 100 full-time employees. During fiscal 2022, Roanoke Gas notified the United Steel, Paper and Forestry, Rubber, Manufacturing, Energy, Allied-Industrial International Union, Local No. 515 (the \"Union\") representing Company employees of its intent to withdraw recognition of the Union upon expiration of the current agreement. Effective August 1, 2022, the collective bargaining agreement between the Union and Roanoke Gas expired and the Union, due to the sustained lack of majority support by bargaining unit members, accepted the Company's withdrawal of recognition and disclaimed its interest in serving as the exclusive collective-bargaining representative of employees of Roanoke Gas. Prior to the expiration of the contract, 16 employees were represented by the Union. Employees had been represented by a union since 1952.\nThe Companys business strategy and ability to serve customers relies on employing talented professionals and attracting, training, developing and retaining a skilled workforce. This is particularly relevant as the Company continues to face retirements of key personnel over the next several years. Like many employers, Resources has been challenged at filling key positions, but has been successful in engaging the necessary qualified personnel to fill vacancies by reviewing and adjusting its compensation package to remain competitive in the current market environment.\nWebsite Access to Reports\nThe Companys website address is www.rgcresources.com. Information appearing on this website is not incorporated by reference in and is not a part of this annual report. The Company files reports with the SEC. A copy of this annual report, as well as other recent annual and quarterly reports, are available on the Company's website or through the SEC. The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding the Companys filings at www.sec.gov. Item 1A. Risk Factors\nPlease carefully consider the risks described below regarding the Company. These risks are not the only ones faced by the Company. Additional risks not presently known to the Company or that the Company currently believes are immaterial may also impair business operations and financial results. If any of the following risks actually occur, the Companys business, financial condition or results of operations could be adversely affected. In such case, the trading price of the Companys common stock could decline and investors could lose all or part of their investment. The risk factors below are categorized by operational, regulatory and financial:\nOPERATIONAL RISKS\nAvailability of sufficient and reliable pipeline capacity.\nThe Company is currently served directly by two interstate pipelines. These two pipelines carry 100% of the natural gas transported to the Companys distribution system. Depending on weather conditions and the level of customer demand, failure of one or both of these interstate transmission pipelines could have a major impact on the Companys ability to meet customer demand for natural gas and adversely affect the Companys earnings as a result of lost revenue and the cost of service restoration. Frequent or prolonged failure could lead customers to switch to alternative energy sources. Hurricanes, floods, fires and other natural or man-made disasters could damage or inhibit production and/or pipeline transportation facilities, which could result in decreased natural gas supplies. Capacity limitations on existing pipeline and storage infrastructure could impact the Companys ability to obtain additional natural gas supplies, thereby limiting its ability to add new customers or meet increased customer demand and thereby limiting future earnings potential. The concerns over capacity limitations should be partially mitigated assuming the MVP becomes operational.\nRisks associated with the operation of a natural gas distribution pipeline and LNG storage facility.\nNumerous potential risks are inherent in the operation of a natural gas distribution system and LNG storage facility, including unanticipated or unforeseen events that are beyond the control of the Company. Examples of such events include adverse weather conditions, acts of terrorism or sabotage, accidents and damage caused by third parties, equipment failure, failure of upstream pipelines and storage facilities, as well as catastrophic events such as explosions, fires, earthquakes, floods, or other similar events. These risks could result in injury or loss of life, property damage, pollution and customer service disruption resulting in potentially significant financial losses. The Company maintains insurance coverage to protect against many of these risks. However, if losses result from an event that is not fully covered by insurance, the Companys financial condition could be significantly impacted if it were unable to recover such losses from customers through the regulatory rate-making process. Even if the Company did not incur a direct financial loss as a result of any of the events noted above, it could encounter significant reputational damage from a reliability, safety, integrity or similar viewpoint, potentially resulting in a longer-term negative earnings impact or decline in share price.\nSecurity incident or cyber-attacks on the Companys computer or information technology systems.\nThe Companys business operations and information technology systems may be vulnerable to an attack by individuals or organizations intending to disrupt the operations of the Company. Such an attack or cyber-security incident on the Companys information technology systems could result in corruption of the Companys financial information; disruption of services to our customers; the unauthorized release of confidential customer, employee or vendor information; the interruption of natural gas deliveries to our customers; and/or compromise the safety of our distribution, transmission and storage systems. The Company has implemented policies, procedures and controls to prevent and detect these activities; however, there are no guarantees that Company processes will adequately protect against unauthorized access. In the event of a successful attack, the Company could be exposed to material financial and reputational risks, possible disruptions in natural gas deliveries or a compromise of the safety of the natural gas distribution system, as well as be exposed to claims by persons harmed by such an attack, all of which could materially increase the Company's costs to protect against such risks. Resources maintains cyber-insurance coverage, which does not protect the Company from cyber incidents but does provide some potential mitigation of the financial impacts resulting from such attacks.\nVolatility in the price and availability of natural gas.\nNatural gas purchases represent the single largest expense of the Company. Increasing demand from other areas, including electricity generation, combined with other factors, have placed upward pressure on natural gas commodity prices in the past. If these factors return and continue for an extended period of time, higher natural gas prices could result in declining sales as well as increases in bad debt expense and increased competition from other energy providers.\nInability to attract and retain professional and technical employees.\nThe ability to implement the Companys business strategy and serve customers is dependent upon employing talented professionals and attracting, training, developing and retaining a skilled workforce. As the Company expects key personnel to retire over the next several years, failure to hire and adequately train replacement employees, including the transfer of significant internal historical knowledge and skills to new employees, or future availability and cost of contracted labor may adversely affect the ability to manage and operate the Company. In addition, certain specialized knowledge is required of the Companys technical employees for construction and operation of the natural gas distribution facilities. If the Company is unable to attract and/or retain qualified employees, the Company could experience increased operating costs and expose the Company to other operational, reputational and financial risks.\nIncreased dependence on technology may hinder the Companys business operations and adversely affect its financial condition and results of operations if such technologies fail.\nOver the last several years, the Company has implemented or acquired a variety of technological tools including both Company-owned information technology and technological services provided by outside parties. Additionally, the Company expects to upgrade to new financial and customer information systems in fiscal 2024. These tools and systems support critical functions including, scheduling and dispatching of service technicians, automated meter reading systems, customer care and billing, revenue recognition, operational plant logistics, and external financial reporting. Issues in the implementation or the failure of these or other similarly important technologies, or the Companys inability to have these technologies supported, updated, expanded, or integrated into other technologies, could hinder its business operations and adversely impact its financial condition and results of operations. Although the Company has, when possible, developed alternative sources of technology and built redundancy into its computer networks and tools, there can be no assurance that these efforts would protect against all potential issues related to the loss of any such technologies.\nInability to complete necessary or desirable pipeline expansion or infrastructure improvement projects.\nIn order to serve new customers or expand service to existing customers, the Company installs new pipeline facilities and maintains, expands or upgrades its existing distribution, transmission and/or storage infrastructure. Various factors may prevent or delay the completion of such projects or make them more costly, such as the inability to obtain required approval from local, state and/or federal regulatory and governmental bodies, public opposition to the projects, inability to obtain adequate financing, competition for labor and materials, construction delays, cost overruns, and an inability to negotiate acceptable agreements relating to rights-of-way, construction or other material development components. As a result, the Company may not be able to adequately serve existing customers or expand its distribution system to support customer growth. This could include any potential customer growth or system reliability enhancement resulting from connection to the MVP. Any of these factors could negatively impact earnings.\nGeographic concentration of business activities.\nThe Company's business activities are concentrated in the Roanoke Valley and surrounding areas. Changes in the local economy, politics, regulations and weather patterns or other factors limiting demand for natural gas could negatively impact the Company's existing customer base, leading to declining usage patterns and financial condition of customers. Furthermore, these changes could also limit the Company's ability to serve its customers or add new customers within its service territory. Any of these factors could adversely affect earnings.\nCompetition from other energy providers.\nThe Company competes with other energy providers in its service territory, including those that provide electricity, propane, coal, fuel oil, wind and solar. Price is a significant competitive factor. Higher natural gas costs or decreases in the price of other energy sources may enhance competition and encourage customers to switch to alternative energy sources, thus lowering natural gas deliveries and earnings. Price considerations could also inhibit customer and revenue growth if builders and developers do not perceive, or are regulatorially prevented from installing, natural gas as a better value than other energy options and elect to install heating systems that use an energy source, including those perceived as more environmentally friendly.\nREGULATORY RISKS\nLaws or regulations associated with ESG matters.\nEnhanced focus on ESG matters related to, among other things, concerns raised by advocacy groups about climate change, social issues and corporate governance may lead to increased regulatory review, which may, in turn, lead to new state and federal safety and laws, regulations, guidelines, and enforcement interpretations. The social and corporate governance initiatives have gained prominence in recent years. In addition, several federal and state legislative and regulatory initiatives have been proposed and enacted in recent years in an attempt to limit the effects of climate change, including greenhouse gas emissions such as those created by the combustion of fossil fuels, including natural gas. Passage of new environmental legislation or implementation of regulations that mandate the use of electric rather than gas appliances, or reductions in greenhouse gas emissions or other similar restrictions could have a negative effect on the Companys core operations and its investment in the LLC. Such legislation could impose limitations on greenhouse gas emissions, require funding of new energy efficiency objectives, impose new operational requirements or lead to other additional costs to the Company. Regulations restricting or prohibiting the use of coal as a fuel for electric power generation has increased the demand for natural gas, and could at some point potentially result in natural gas supply concerns and higher costs for natural gas. Legislation or regulations could limit the exploration and development of natural gas reserves, making the price of natural gas less competitive and less attractive as a fuel source for consumers. Future legislation could also place limitations on the amount of natural gas used by businesses and homeowners to reduce the level of emissions, resulting in reduced deliveries and earnings or provide incentives to customers to utilize alternative energy sources not associated with fossil fuels.\nIn addition, advocacy groups, both domestically and internationally, have campaigned for governmental and private action to influence change in the business strategies of oil and gas companies, including through the investment and voting practices of investment advisers, public pension funds, universities and other members of the investing community. These activities include increasing attention and demands for action related to climate change and energy transition matters, such as promoting the use of substitutes to fossil fuel and encouraging the divestment of investments in the oil and gas industry, as well as pressuring lenders and other financial services companies to limit or curtail activities with oil and gas companies. If investors or financial institutions shift funding away from companies in the oil and gas industry, the Companys access to and costs of capital or the market for the Companys securities may be adversely impacted.\nIncreased compliance and pipeline safety requirements and fines.\nThe Company is committed to the safe and reliable delivery of natural gas to its customers. Working in concert with this commitment are numerous federal and state laws and regulations. Failure to comply with these laws and regulations could result in the levy of significant fines. There are inherent risks that may be beyond the Companys control, including third-party actions, which could result in damage to pipeline facilities, injury and even death. Such incidents could subject the Company to lawsuits, large fines, increased scrutiny and loss of customers, all of which could have a significant effect on the Companys financial position and results of operations.\nRegulatory actions or failure to obtain timely rate relief.\nThe Companys natural gas distribution operations are regulated by the SCC. The SCC approves the rates that the Company charges its customers. During periods of enhanced inflationary pressure or the incurrence of significant additional costs, if the SCC did not timely authorize rates that provided for the recovery of such costs including a reasonable rate of return on investment in natural gas distribution facilities, earnings could be negatively impacted.\nFurthermore, issuance of debt and equity by Roanoke Gas is also subject to SCC regulation and approval. Delays or lack of approvals could inhibit the ability to access capital markets and negatively impact liquidity or earnings.\nFINANCIAL RISKS\nInvestment in Mountain Valley Pipeline, LLC.\nThe Company re-assesses its equity investment at least quarterly. In 2022, due to increasing uncertainty concerning the ultimate completion of the pipeline, the Company recorded pre-tax impairments totaling $55.1 million concluding that an other-than-temporary decline in fair value existed.\nLegislative action, as well as actions taken by various jurisdictions and courts, in 2023, as discussed in Note 5, have allowed the construction of the MVP to resume. The projects operator has publicly conveyed the LLCs target for completing construction of the project as the first quarter of calendar 2024. However, future circumstances and any attendant effects on the probability of ultimate completion, as well as changes in future cash flow assumptions or changes in the discount rate, could lead to further and possibly full impairment of the Company's investment in the LLC.\nThe success of the Company's investment in the LLC is predicated on several key factors including but not limited to the ability of contributing members in the LLC to meet their capital calls when due, timely state and federal approvals, completing the construction of the pipeline and achieving in-service.\nIn addition, there are numerous factors relevant to the LLC in constructing and operating the project, which can adversely affect the Company's earnings and financial performance through its investment, including, among others, as it relates to construction, continued availability of contract crews to complete construction of the pipeline, physical construction conditions, including steep slopes and any further unexpected geological impediments, the ability to obtain or renew ancillary licenses, rights-of-way, permits or other approvals, productivity during the winter season, and opposition from pipeline opponents. Should the LLC be unable to adequately address these issues, the LLCs business, financial condition, results of operations and prospects could be adversely affected, which could materially impact the financial condition and results of operations of the Company.\nOnce in operation, the LLCs gas infrastructure facilities are subject to many operational risks. Operational risks could result in, among other things, lost revenues due to prolonged outages, increased expenses due to monetary penalties or fines for compliance failures, liability to third parties for property damage and personal injury, a failure to perform under applicable sales agreements and associated loss of revenues from terminated agreements or liability for liquidated damages under continuing agreements. The consequences of these risks, if realized, could adversely affect the LLCs business, financial condition, results of operations and prospects. Uncertainties and risks inherent in operating and maintaining the LLC's facilities include, but are not limited to, risks associated with facility start-up operations, such as whether the facility will achieve projected operating performance on schedule and otherwise as planned. The LLCs business, financial condition, results of operations and prospects potentially could be adversely affected by weather conditions, including, but not limited to, the impact of severe weather. Threats of terrorism and catastrophic events resulting from terrorism, sabotage, cyber-attacks, or individuals and/or groups attempting to disrupt the LLCs business, or the businesses of third parties, may materially adversely affect the LLCs business, financial condition, results of operations and prospects.\nCertain obstacles discussed above, as well as other factors, such as legal and regulatory setbacks, have in the past caused delays in construction, and to the extent obstacles are realized, such obstacles may further result in, among other things, significantly higher project costs and an extended targeted in-service date for the pipeline. Moreover, new factors, such as the operational matters described above, could drive adverse operational and financial impacts.\nAny adverse developments, such as significant delay or cost over-run, could have a significant effect on the LLC and the Company's earnings and financial position and materially impact Resources consolidated financial position and results of operations, including Resources ability to pay shareholder dividends at the current level or remain in compliance with credit agreement covenants. There is no guarantee that the LLC, and relatedly the Company and Resources, will not be subject to any adverse developments and related impacts.\nAccess to capital to maintain liquidity.\nThe Company relies on a variety of capital sources to operate its business and fund capital expenditures, including internally generated cash from operations, short-term borrowings under its line-of-credit, proceeds from the issuance of additional shares of its common stock and other sources. Access to a line-of-credit is essential to provide seasonal funding of natural gas operations and provide capital budget bridge financing. Access to capital markets and other long-term funding sources is important for capital outlays and funding of the LLC investment. The ability of the Company to maintain and renew its line-of-credit and to secure longer-term financing is critical to operations. Adverse market trends, market disruptions or deterioration in the financial condition of the Company could increase the cost of borrowing, restrict the Company's ability to issue additional shares of its common stock or otherwise limit the Companys ability to secure adequate funding.\nFailure to comply with debt covenant requirements.\nThe Company's long-term debt obligations and bank line-of-credit contain financial covenants. Noncompliance with any of these covenants could result in an event of default which, if not cured or waived, could accelerate payment on outstanding debt obligations or cause prepayment penalties. In such an event, the Company may not be able to refinance or repay all of its indebtedness, pay dividends or have sufficient liquidity to meet operating and capital expenditure requirements. Any such acceleration would cause a material adverse change in the Company's financial condition.\nThe cost of providing post-retirement benefits.\nThe Company provides certain post-retirement benefits. The costs of providing defined benefit pension and retiree medical plans are dependent on a number of factors such as the rates of return on plan assets, discount rates used in determining plan liabilities, the level of interest rates used to measure the required minimum funding levels of the plan, future government regulation, changes in life expectancy and required or voluntary contributions made to the plan. Changes in actuarial assumptions and differences between the assumptions and actual results, as well as a significant decline in the value of investments that fund these plans, if not offset or mitigated by a decline in plan liabilities, could increase the expense of these plans and require significant additional funding. Although the Company has soft-frozen both plans to limit future growth in each plan's liabilities, ongoing funding obligations and expenses could have a material impact on the Company's financial position, results of operation and cash flows should there be a material reduction in the amount of the recovery of these costs through rates currently charged to customers or significant delays in the timing of the recovery of such costs.\nObligations for income taxes that may arise from examinations by taxing authorities.\nThe Company is subject to federal and state income taxes as prescribed by the laws within the United States. Significant judgments are required in determining the provisions for income taxes. In preparing its tax provisions and returns, the Company must make calculations and assumptions regarding tax treatment of various transactions including the applicability of tax credits. The Companys tax returns are subject to examination by the IRS and state tax authorities. Although the Company utilizes the assistance of tax professionals in the preparation of its tax returns, there can be no assurance as to the outcome of these examinations. If the ultimate determination from an examination results in additional taxes above the amount reflected in its financial statements, the Company will record any additional income tax expenses as may be required including any interest and penalties that might result.\nExposure to market risks.\nThe Company is subject to market risks that are beyond the Companys control, such as commodity price volatility and interest rate risk. The Company is generally isolated from commodity price risk through the PGA mechanism. With respect to interest rate risk, there has been significant upward movement in interest rates. Much of the Company's outstanding debt is comprised of fixed rate notes or have interest rate swaps in place. However, these higher interest rates will impact the Company through higher borrowing costs on Roanoke Gas' line-of-credit and Midstream's variable rate credit facility as well as any future borrowings by the Company.\nGlobal pandemics have previously, continue to, and may in the future adversely impact the Companys business, financial condition, and results of operations, the global economy, and the demand for and prices of natural gas.\nGlobal pandemics and actions taken by third parties, including, but not limited to, governmental authorities, businesses and consumers, in response to such pandemics, including the COVID-19 pandemic, have adversely impacted and may from time to time in the future adversely impact the global, national and local economies, resulting in significant volatility in the financial markets. Previous business closures, restrictions on travel, stay-at-home or shelter-in-place orders, and other restrictions on movement within and among communities have impacted demand for, and the prices of, natural gas, and such restrictions may be reintroduced at any time. A continued, prolonged period or a renewed period a pandemic outbreak could significantly affect demand for natural gas, increase operational costs and limit the ability to provide natural gas service to customer. Governmental intervention could result in additional requirements and costs to the Company in response to a pandemic. The failure to develop or reformulate adequate treatments, including the emergence of new variants, and other adverse impacts from a pandemic may adversely affect the Companys business, financial condition, cash flows, and results of operations.\nThe Companys operations rely on its workforce having access to its structures, offices and facilities. If a significant portion of the Companys workforce cannot effectively perform their responsibilities, whether resulting from a lack of physical or virtual access, quarantines, illnesses, governmental actions or restrictions (including vaccine mandates and the reactions thereto), or other restrictions or adverse impacts resulting from a pandemic, the Companys business, financial condition, cash flows, and results of operations may be adversely affected. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nIncluded in Utility Property on the Companys consolidated balance sheet are storage plant, transmission plant, distribution plant and general plant of Roanoke Gas as categorized by natural gas utilities. The Company has approximately 1,179 miles of transmission and distribution pipeline with transmission and distribution plant representing 90% of the total utility property investment. The transmission and distribution pipelines are located on or under public roads and highways or private property for which the Company has obtained the legal authorization and rights to operate.\nRoanoke Gas currently owns and operates six metering stations through which it measures and regulates the gas being delivered by its suppliers. These stations are located at various points throughout the Companys distribution system.\nRoanoke Gas also owns a liquefied natural gas storage facility located in its service territory that has the capacity to store up to 200,000 DTH of natural gas.\nRoanoke Gas also began operation of an RNG facility during fiscal 2023 as part of a cooperative agreement with the local water authority to produce commercial quality biogas at the regional pollution control facility. The Company leases the land upon which the RNG facility is located.\nThe Companys executive, accounting and business offices, along with its maintenance and service departments, are located on Kimball Avenue in Roanoke, Virginia.\nAlthough the Company considers its present properties to be adequate, management continues to evaluate the adequacy of its current facilities as additional needs arise. Item 3. Legal Proceedings.\nThe Company is not known to be a party to any pending legal proceedings. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nResources' common stock is listed on the NASDAQ Global Market under the trading symbol RGCO. Payment of dividends is within the discretion of the Board of Directors and depends on, among other factors, earnings, capital requirements, and the operating and financial condition of the Company.\nRange of Bid Prices\nCash Dividends\nYear Ending September 30, 2023\nHigh\nLow\nDeclared\nFirst Quarter\n$ 24.54\n$ 20.70\n$ 0.1975\nSecond Quarter\n24.45\n22.10\n0.1975\nThird Quarter\n23.84\n18.12\n0.1975\nFourth Quarter\n20.40\n16.70\n0.1975\nYear Ending September 30, 2022\nFirst Quarter\n$ 25.00\n$ 21.32\n$ 0.1950\nSecond Quarter\n23.84\n20.25\n0.1950\nThird Quarter\n22.00\n18.01\n0.1950\nFourth Quarter\n23.35\n19.18\n0.1950\nAs of November 20, 2023, there were 950 holders of record of the Companys common stock. This number does not include all beneficial owners of common stock who hold their shares in street name.\"\nA summary of the Companys equity compensation plans follows as of September 30, 2023:\n(a)\n(b)\n(c)\nPlan category\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\nWeighted-average exercise price of outstanding options, warrants and rights\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\nEquity compensation plans approved by security holders\n22,000\n$ 20.23\n589,984\nEquity compensation plans not approved by security holders\n-\n-\n-\nTotal\n22,000\n$ 20.23\n589,984 Item 6. [Reserved]. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nOverview\nResources is an energy services company primarily engaged in the regulated sale and distribution of natural gas to approximately 62,200 residential, commercial and industrial customers in Roanoke, Virginia, and the surrounding localities, through its Roanoke Gas subsidiary. Midstream, a wholly-owned subsidiary of Resources, is a less than 1% investor in the MVP and Southgate, respectively. More information regarding the investment in MVP is provided below and under the Equity Investment in Mountain Valley Pipeline section.\nFollowing extended periods of delay due to actions by the Fourth Circuit, Congress passed and the President signed into law legislation to expedite the completion of the MVP. The Fourth Circuit continued to stay the necessary permits to complete the pipeline. Following a petition filed by the LLC to request relief from the stays issued by the Fourth Circuit, on July 27, 2023, the SCOTUS granted the relief requested and vacated the stays. Construction on the MVP resumed immediately and completion is currently expected during the first quarter of calendar 2024.\nThe utility operations of Roanoke Gas are regulated by the SCC, which oversees the terms, conditions and rates charged to customers for natural gas service, safety standards, extension of service and depreciation. Nearly all of the Companys revenues, excluding equity in earnings of MVP, are derived from the sale and delivery of natural gas to Roanoke Gas customers based on rates and fees authorized by the SCC. These rates are designed to provide the Company with the opportunity to recover its gas and non-gas expenses and to earn a reasonable rate of return for shareholders based on normal weather. These rates are determined based on various rate applications filed with the SCC. Generally, investments related to extending service to new customers are recovered through the additional revenues generated by the non-gas base rates in place at that time. The investment in replacing and upgrading existing infrastructure, as well as recovering increases in non-gas expenses due to inflationary pressures, regulatory requirements or operation needs, are generally not recoverable until a formal rate application is filed to include additional investment and higher costs, and new non-gas base rates are approved.\nThe Company is also subject to regulation from the Department of Transportation in regard to the construction, operation, maintenance, safety and integrity of its transmission and distribution pipelines, as well as the FERC, which regulates the prices for the transportation and delivery of natural gas to the Company's distribution system and underground storage services. In addition, Roanoke Gas is subject to other regulations which are not necessarily industry specific.\nBeginning January 1, 2023, Roanoke Gas implemented new, non-gas base rates designed to provide $8.55 million in additional annual non-gas revenues in response to higher operating costs and to recover its investment in non-SAVE related projects since the last non-gas base rate increase in fiscal 2019. Revenues from the SAVE Plan and Rider were incorporated into the new non-gas base rates. In September 2023, Roanoke Gas and SCC staff reached a settlement agreement for $7.45 million in additional annual non-gas revenues pending final approval by the SCC. Roanoke Gas placed the new non-gas base rates into effect on October 1, 2023 and has established a reserve for the difference between the rates implemented on January 1, 2023 and the new rates in the settlement agreement. The excess revenues collected will be refunded to customers upon receipt of the final SCC order, which is expected to be received in late calendar 2023 or early 2024.\nAs the Companys business is seasonal in nature, volatility in winter weather and the commodity price of natural gas can impact the effectiveness of the Companys rates in recovering its costs and providing a reasonable return for its shareholders. In order to mitigate the effect of weather variations and other factors not provided for in the Company's base rates, Roanoke Gas has certain approved rate mechanisms in place that help provide stability to customer bills and earnings, adjust for volatility in the price of natural gas and provide a return on qualified infrastructure investment. These mechanisms include the SAVE Rider, WNA, ICC, RNG and PGA.\nThe SAVE Plan and Rider provides the Company with a mechanism through which it recovers costs related to SAVE qualified infrastructure investments on a prospective basis, until such time a formal rate application is filed incorporating these investments in non-gas base rates. The SAVE Plan and Rider reset effective January 1, 2023, when the recovery of all prior SAVE Plan investment was incorporated into the new non-gas base rates, and accordingly, SAVE Plan revenue decreased by approximately $2,182,000 from the prior year. Roanoke Gas filed and received approval from the SCC for a new SAVE Plan and Rider with new rates placed into effect on October 1, 2023 that will result in approximately $366,000 in SAVE related revenues during fiscal 2024. Additional information regarding the SAVE Plan and Rider is provided under the Regulatory section below.\nThe WNA mechanism reduces the volatility in earnings due to the variability in temperatures during the heating season. The WNA is based on the most recent 30-year temperature average and provides the Company with a level of earnings protection when weather is warmer than normal and provides its customers with a level of price protection when the weather is colder than normal. The WNA allows the Company to recover from customers the lost margin, excluding gas costs, from the impact of warmer than normal weather and correspondingly requires the Company to refund to customers the excess margin earned for colder than normal weather. The WNA mechanism used by the Company is based on a linear regression model that determines the value of a single heating degree day and thereby estimates the revenue adjustment based on weather variance from normal. Any billings or refunds related to the WNA are completed following each WNA year, which extends for the 12-month period from April to March. The Company recorded approximately $3,005,000 and $1,973,000 in additional revenues under the WNA for weather that was approximately 16% and 13% warmer than normal for the fiscal years ended September 30, 2023 and 2022, respectively. The number of heating degree days used to determine normal can change annually as a new year is added to the 30-year period and the oldest year is removed. As a result of adding warmer than normal years to replace colder years, the number of heating degree days that defines normal has trended downward over the last several years.\nThe Company also has an approved rate structure that mitigates the impact of financing costs of its natural gas inventory. Under this rate structure, Roanoke Gas recognizes revenue by applying the ICC factor, based on the Companys weighted-average cost of capital, including interest rates on short-term and long-term debt, and the Companys authorized return on equity, to the average cost of natural gas inventory during the period. Total ICC revenues increased from approximately $657,000 in fiscal 2022 to $967,000 in fiscal 2023 as a result of the higher cost of gas in storage at the beginning of the fiscal year. Monthly average inventory balances, used to calculate ICC revenues, increased by 46%. However, as natural gas commodity prices declined significantly during the summer storage injection period, the average price of gas in storage at September 30, 2023 declined by 37% compared to the same period last year. Accordingly, fiscal 2024 ICC revenues are expected to decline from current year levels.\nIn March 2023, Roanoke Gas began the operation of the RNG facility to produce commercial quality RNG for delivery into its distribution system through a cooperative agreement with the Western Virginia Water Authority. With SCC approval, Roanoke Gas is allowed to recover the costs associated with the investment in RNG facilities and related operating costs through an RNG Rider added to customer bills. The customer benefits from this program through the monetization of environmental credits generated through RNG production, in which these credits are returned to customers through the RNG Rider. See the Regulatory section below for more information on RNG.\nThe cost of natural gas is a pass-through cost and is independent of the Company's non-gas rates. Accordingly, the Company's approved billing rates include a component designed to allow for the recovery of the cost of natural gas used by its customers. This rate component, referred to as the PGA, allows the Company to pass along to its customers increases and decreases in natural gas costs through a quarterly filing (or more frequent if necessary) with the SCC. Once SCC approval is received, the Company adjusts the gas cost component of its rates. As actual costs will differ from the projections used in establishing the PGA rate, the Company will either over-recover or under-recover its actual gas costs during the period. The difference between actual costs incurred and costs recovered through the application of the PGA is recorded as a regulatory asset or liability. At the end of the annual deferral period, the balance is amortized over an ensuing 12-month period as amounts are reflected in customer billings.\nCyber Risk\nCyber attacks are a constant threat to businesses and individuals. The Company remains focused on these threats and is committed to safeguarding its information technology systems. These systems contain confidential customer, vendor and employee information, as well as important operational and financial data. There is risk associated with unauthorized access of this information with a malicious intent to corrupt data, cause operational disruptions or compromise information. Management continuously monitors access to these systems and believes it has security measures in place to protect these systems from cyber attacks and similar incidents; however, there can be no guarantee that an incident will not occur. In the event of a cyber incident, the Company will execute its Security Incident Response Plan. The Company maintains cyber insurance to mitigate financial costs that may result from a cyber incident.\nInflation and Rising Prices\nNatural gas commodity, delivery and storage capacity costs constitute the single largest expense of the Company, representing 65% of fiscal 2023 total operating expenses. After peaking in December 2022, natural gas commodity prices decreased significantly through the remainder of fiscal 2023. The decline in prices was primarily due to improved supply availability resulting from a warm winter season. Roanoke Gas recovers natural gas costs through the PGA mechanism as noted above; however, in times where commodity prices rapidly increase, the timing of recovery may lag. Increasing natural gas prices, especially in relation to other energy options, may lead to reductions in energy consumption through customer conservation or fuel switching in addition to the potential for higher bad debts related to customers' inability to pay higher natural gas bills.\nInflation, due to supply chain delays, labor shortages and limited availability of critical supplies among other factors, affects the Company through increases in non-gas expenses such as labor, employee benefits, materials and supplies, contracted services, corporate insurance and other areas. The Company recovers non-gas related costs through the non-gas portion of its tariff rates, which are adjusted through a non-gas base rate application. Unlike the rate adjustments for the gas portion of rates which are done administratively, the non-gas base rate application can result in an inherent lag in non-gas expense recovery. Therefore, authorized non-gas base rates may not keep pace with rising costs during inflationary periods. Management regularly evaluates the Company's operations, economic conditions and other factors to assess the need to apply for a non-gas base rate adjustment. Accordingly, management filed a non-gas rate application in early December 2022 to incorporate increased expense levels and additional rate base, including both SAVE and non SAVE related plant investment, since the last non-gas base rate application. These new non-gas base rates were implemented effective January 1, 2023 subject to refund. See the Regulatory section below for more information.\nResults of Operations\nThe analysis on the results of operations is based on the consolidated operations of the Company, which are primarily associated with the utility segment. Additional segment analysis is provided when Midstream's investment in affiliates represents a significant component of the comparison. Net income increased by $43,031,884 from a net loss position of $31,732,602 to net income of $11,299,282 primarily due to the impairment of the Company's LLC investment in fiscal 2022 and the implementation of new non-gas base rates in January 2023. Excluding the after-tax effect of the prior year's impairment, net income would have increased by approximately $2,120,000.\nThe Company's operating revenues are affected by the cost of natural gas, as reflected in the consolidated statement of income under the line item cost of gas - utility. The cost of natural gas, which includes commodity price, transportation, storage, injection and withdrawal fees, with any increase or decrease offset by a correlating change in revenue through the PGA, is passed through to customers at cost. Accordingly, management believes that gross utility margin, a non-GAAP financial measure defined as utility revenues less cost of gas, is a more useful and relevant measure to analyze financial performance. The term gross utility margin is not intended to represent or replace operating income, the most comparable GAAP financial measure, as an indicator of operating performance and is not necessarily comparable to similarly titled measures reported by other companies. The following results of operations analyses will reference gross utility margin.\nFiscal Year 2023 Compared with Fiscal Year 2022\nThe table below reflects operating revenues, volume activity and heating degree days.\nOperating Revenues\nYear Ended September 30,\nIncrease\n(Decrease)\nPercentage\nGas utility\n$ 97,325,307\n$ 84,035,644\n$ 13,289,663\n%\nNon utility\n114,458\n129,578\n(15,120 )\n(12 )%\nTotal operating revenues\n$ 97,439,765\n$ 84,165,222\n$ 13,274,543\n%\nDelivered Volumes\nYear Ended September 30,\nIncrease\n(Decrease)\nPercentage\nRegulated natural gas (DTH)\nResidential and commercial\n6,408,436\n6,577,369\n(168,933 )\n(3 )%\nTransportation and interruptible\n3,776,569\n3,747,967\n28,602\n%\nTotal delivered volumes\n10,185,005\n10,325,336\n(140,331 )\n(1 )%\nHDD\n3,290\n3,398\n(108 )\n(3 )%\nTotal gas utility operating revenues for the year ended September 30, 2023 increased by 16% from the year ended September 30, 2022 primarily due to higher natural gas commodity prices during the first half of fiscal 2023, the implementation of a non-gas base rate increase, net of a reduction in SAVE revenues, higher ICC revenues and the implementation of the RNG Rider, slightly offset by lower deliveries due to warmer weather. Natural gas commodity prices for fiscal 2023 purchases declined from the prior year by approximately 9% per DTH; however, the total commodity component of gas costs increased by 37% per DTH due to the withdrawal of higher priced storage gas during the winter heating season. Total gas costs, which includes pipeline and storage fixed demand costs, increased by 26% compared to the same period last year, which corresponded to the 21% per DTH increase in the gas cost component of revenue. The non-gas base rate increase implemented in January 2023 contributed to an approximate $3.0 million increase in non-gas volumetric revenues, net of lower delivered volumes, and $1.2 million increase in customer base charge revenue. SAVE revenues declined due to the inclusion of the cumulative SAVE investment in the new non-gas base rates. As discussed in the Overview section, the SAVE Plan and Rider were temporarily halted with the implementation of the new rates. Corresponding to the higher average price of natural gas in storage during the first half of fiscal 2023, ICC revenues rose 47%. Additionally, the operation of the new RNG facility has added a new revenue stream for the Company. Residential and commercial deliveries decreased by 3% corresponding to a comparable decline in heating degree days, while transportation and interruptible volumes, primarily driven by business activity rather than weather, increased by 1%.\nGross Utility Margin\nYear Ended September 30,\nIncrease\nPercentage\nGas utility revenues\n$ 97,325,307\n$ 84,035,644\n$ 13,289,663\n%\nCost of gas - utility\n51,742,718\n42,496,055\n9,246,663\n%\nGross utility margin\n$ 45,582,589\n$ 41,539,589\n$ 4,043,000\n%\nGross utility margin increased over the prior fiscal year primarily as a result of the implementation of higher non-gas base rates, net of the reduction in SAVE revenues, combined with higher ICC revenues and the addition of RNG revenues. The reduction in the higher margin residential and commercial volumes, due to a warmer heating season, was mitigated by the WNA mechanism that provided for the recovery of lost margin related to the warmer weather.\nThe changes in the components of the gross utility margin are summarized below:\nYears Ended September 30,\nIncrease\n(Decrease)\nCustomer base charge\n$ 15,713,521\n$ 14,557,492\n$ 1,156,029\nSAVE Plan\n1,103,547\n3,285,518\n(2,181,971 )\nVolumetric\n23,925,200\n20,901,637\n3,023,563\nWNA\n3,005,249\n1,972,801\n1,032,448\nICC\n966,851\n657,042\n309,809\nRNG\n712,362\n-\n712,362\nOther revenues\n155,859\n165,099\n(9,240 )\nTotal\n$ 45,582,589\n$ 41,539,589\n$ 4,043,000\nOperations and Maintenance Expense - Operations and maintenance expense increased by $414,732, or 3%, over the prior year primarily due to increases in compensation costs, contracted services, corporate insurance premiums and RNG expenses, net of greater capitalized overheads and lower bad debt expense. Compensation costs and contracted services increased by approximately $852,000 due to increased staffing and the effects of inflation on salaries and externally provided services. Corporate insurance premiums increased by approximately $164,000 due to insurance market conditions and higher coverage limits. The operation of the new RNG facility contributed approximately $151,000 in additional operating expense. Total capitalized overheads increased by approximately $272,000 due to a combination of higher levels of constructed assets and a higher capitalization rate, as well as increased LNG production. Bad debt expense decreased by approximately $445,000 as customer and payment activity returned to historical, pre-COVID patterns resulting in improved aging and lower write-offs.\nGeneral Taxes - General taxes increased by $39,111, or 2%, due to increases in property taxes on greater utility plant investment and higher payroll taxes on increased employee count and compensation.\nDepreciation - Depreciation expense increased by $815,755, or 9%, corresponding to a similar increase in net additions to depreciable utility property.\nEquity in Earnings of Unconsolidated Affiliate - The equity in earnings of the MVP investment increased by $2,011,663 related to the recognition of AFUDC as construction activities on the MVP resumed in June 2023. See the Equity Investment in Mountain Valley Pipeline section below for additional information.\nImpairment of Unconsolidated Affiliates - The $55,092,303 impairment was due to two other-than-temporary write-downs of the Company's investment in the LLC that were made during the second and fourth quarters of fiscal 2022 as a result of the Company's valuation assessment during the prior year. See Equity Investment in Mountain Valley Pipeline and Critical Accounting Policies and Estimates sections below for more information.\nOther Income, Net - Other income decreased by $810,455, or 56%, primarily due to an approximate $1,502,000 increase in the non-service cost components of net periodic benefit costs arising from the effect of much higher interest rates on the actuarial expense calculation. This was partially offset by an approximate $227,000 increase in AFUDC recognized on the RNG project, $169,000 in additional interest income due to higher interest rates on available cash and $231,000 in additional revenue sharing based on the revised agreement with the Company's asset manager.\nInterest Expense - Total interest expense increased by $1,120,876, or 25%, primarily due to higher interest rates on the Company's variable rate debt and, to a lesser extent, higher borrowing levels. The weighted-average interest rate on the Company's total debt increased from 3.06% during fiscal 2022 to 3.83% during fiscal 2023, representing a 25% increase in the average rate. Total average debt outstanding during fiscal 2023 increased by less than 1% from fiscal 2022. Total borrowing levels were mitigated by the residual proceeds from the fiscal 2022 equity offering and the subsequent equity issues through the ATM in fiscal 2023.\nRoanoke Gas' interest expense increased by $214,294, or 7%, as total average debt outstanding increased by approximately $2,500,000 associated with net borrowings under the Company's line-of-credit. The average interest rate increased slightly from 3.38% in fiscal 2022 to 3.51% in fiscal 2023. All of Roanoke Gas' long-term debt carry fixed rates either due to fixed rate notes or with variable rate debt that has a corresponding swap agreement. See Note 6 and 7 for more information on the Company's debt.\nMidstream's interest expense increased by $906,582, or 61%, as the average interest rate on Midstream's total debt increased from 2.59% to 4.32% related to rising interest rates on the variable rate credit facility, net of an approximate $1,900,000 decrease in total average debt outstanding during the period.\nIncome Taxes - Income tax expense increased by $14,902,556, moving from a tax benefit of $11,410,645 in fiscal 2022 to tax expense of $3,491,911 in fiscal 2023. The net tax benefit in fiscal 2022 was attributable to a net deferred tax benefit of $14,180,759 corresponding to the recognition of the impairment of the Company's investment in the LLC. The effective tax rate was 23.6% for fiscal 2023 compared to 26.5% for fiscal 2022. The effective tax rate for the prior fiscal year exceeded the combined federal and state statutory rate of 25.74% due to the combination of moving to a taxable loss position combined with deductions related to the amortization of the R&D tax credits. Excluding the impairment, the effective tax rate for fiscal 2022 would have been 23.2%. See Note 8 for the impact of tax credits on the effective tax rate.\nEarnings Per Share and Dividends - Basic and diluted earnings per share were $1.14 in fiscal 2023 compared to $3.48 loss per share in fiscal 2022. Dividends declared per share of common stock were $0.79 in fiscal 2023 compared to $0.78 in fiscal 2022.\nCapital Resources and Liquidity\nDue to the capital intensive nature of the utility business, as well as the impact of weather variability, the Companys primary capital needs are the funding of its capital projects, investment in the LLC, the seasonal funding of its natural gas inventories and accounts receivables, debt service and payment of dividends to shareholders. The Company anticipates funding these items through its operating cash flows, credit availability under short-term and long-term debt agreements and proceeds from the sale of its common stock.\nCash and cash equivalents decreased by approximately $3.4 million in fiscal 2023 compared to a $3.4 million increase in fiscal 2022. The following table summarizes the categories of sources and uses of cash:\nCash Flow Summary\nYears Ended September 30,\nNet cash provided by operating activities\n$ 23,796,700\n$ 15,551,676\nNet cash used in investing activities\n(27,402,118 )\n(30,615,878 )\nNet cash provided by financing activities\n218,935\n18,444,799\nNet increase (decrease) in cash and cash equivalents\n$ (3,386,483 )\n$ 3,380,597\nCash Flows Provided by Operating Activities:\nThe seasonal nature of the natural gas distribution business causes operating cash flows to fluctuate significantly during the year, as well as from year to year. Factors, including weather, energy prices, natural gas storage levels and customer collections, all contribute to working capital levels and related cash flows. Generally, operating cash flows are positive during the second and third fiscal quarters as a combination of earnings, declining storage gas levels and collections on customer accounts all contribute to higher cash levels. During the first and fourth fiscal quarters, operating cash flows generally decrease due to the combination of increasing natural gas storage levels and rising customer receivable balances.\nCash flows from operating activities increased by $8.2 million from the prior year. The table below summarizes the significant components operating cash flow:\nYears Ended September 30, Increase\nCash Flows From Operating Activities:\n(Decrease)\nNet income (loss)\n$ 11,299,282\n$ (31,732,602 )\n$ 43,031,884\nNon-cash adjustments:\nDepreciation\n9,993,206\n9,182,751\n810,455\nEquity in earnings\n(2,084,990 )\n(73,327 )\n(2,011,663 )\nAFUDC\n(362,685 )\n(75,154 )\n(287,531 )\nAllowance for credit losses\n(216,106 )\n129,260\n(345,366 )\nImpairment of unconsolidated affiliates\n-\n55,092,303\n(55,092,303 )\nChanges in working capital and regulatory assets and liabilities:\nAccounts receivable\n1,374,442\n(532,630 )\n1,907,072\nGas in storage\n5,731,050\n(9,049,181 )\n14,780,231\nPrepaid income taxes\n(139,789 )\n17,195\n(156,984 )\nAccounts payable, accrued expenses and customer credit balances\n(91,522 )\n310,700\n(402,222 )\nDeferred taxes\n38,241\n(14,258,294 )\n14,296,535\nChange in over (under) collection of gas costs\n(66,760 )\n3,731,584\n(3,798,344 )\nRate refund\n652,018\n-\n652,018\nSupplier refunds\n(2,209,343 )\n2,484,992\n(4,694,335 )\nOther\n(120,344 )\n324,079\n(444,423 )\nNet cash provided by operating activities\n$ 23,796,700\n$ 15,551,676\n$ 8,245,024\nThe primary driver for the increase in operating cash flows was the change in gas storage balance. During the fiscal 2022 summer storage refill period, which generally extends from March through October, natural gas commodity prices rose significantly with the average price of gas in storage increasing from $3.15 per DTH at September 30, 2021 to $7.02 per DTH at September 30, 2022, resulting in a $9 million use of operating cash. Subsequently, in fiscal 2023, much of the higher priced gas was withdrawn from storage to meet the energy demands of the winter heating season. When the fiscal 2023 summer storage refill period began, natural gas commodity prices were much lower than the prior fiscal period resulting in a decline in the average price of gas in storage to $4.40 per DTH at September 30, 2023, thereby generating $5.7 million in operating cash in fiscal 2023. This improvement in operating cash flow was mitigated by changes in supplier refunds and under-collection of gas costs. In March 2022, the Company received a $2.3 million supplier refund, resulting from a FERC rate case settlement, from one of the interstate pipelines that provides the Company with natural gas. In July 2022, the Company began refunding this balance, along with other smaller refunds, to customers over a 12-month period. The transition from collecting supplier refunds in fiscal 2022 to refunding them during fiscal 2023 resulted in a $4.7 million net reduction in operating cash between years. At September 30, 2021, Roanoke Gas was in a net under-collected gas cost position of more than $5 million due to timing in adjusting the PGA factor for rising gas costs. During fiscal 2022, Roanoke Gas collected from customers, through the ACA mechanism, nearly $3.6 million of the prior year under-collection. In fiscal 2023, Roanoke Gas collected the remaining $1.4 million through the ACA mechanism; however, Roanoke Gas also generated a $1.5 million under-collection associated with current year gas costs. As a result of the aforementioned lower gas costs and the application of the supplier refunds to customers' accounts, as well as reduced delinquent balances, accounts receivable moved from a $500,000 use of cash in fiscal 2022 to a $1.4 million source of operating cash in fiscal 2023. The impairments on the Company's investment in the LLC resulted in significant swings in net income, deferred taxes and the recognition of impairment charges; however, the net effect of the impairments did not have an impact to operating cash flow.\nCash Flows Used in Investing Activities:\nInvesting activities primarily consist of expenditures related to investment in Roanoke Gas' utility property, which includes replacing aging natural gas pipe with new plastic or coated steel pipe, improvements to the LNG plant and gas distribution system facilities and expansion of its natural gas system to meet the demands of customer growth, as well as Midstream's investment in the LLC. Roanoke Gas' expenditures were approximately $25.3 million and $25.5 million in fiscal 2023 and 2022, respectively. Roanoke Gas renewed 5.7 miles of main and 452 service lines and 8.3 miles of main and 605 service lines in fiscal years 2023 and 2022, respectively. The current SAVE Plan is focused on the replacement of pre-1973 first generation plastic pipe in addition to other SAVE related infrastructure. Furthermore, Roanoke Gas capital expenditures included costs to extend natural gas distribution mains and services to 430 customers in fiscal 2023, compared to 544 customers in fiscal 2022. The RNG project, which went into service in March 2023, also accounted for $3.9 million and $3.1 million in expenditures for fiscal 2023 and 2022, respectively. Depreciation covered approximately 39% and 36% of the current and prior year's capital expenditures, respectively, with the balance provided from other operating cash flows and financing activities.\nCapital expenditures are expected to be at least $20 million annually over the next few years as Roanoke Gas continues to focus on its SAVE Plan, as well as system improvements and customer growth. The Company expects to utilize its operating cash flows and credit facilities, as well as consider additional equity capital, to meet the funding requirements of these planned expenditures.\nInvesting cash flows also reflects the fiscal 2023 funding of $2.1 million for Midstream's participation in the LLC, down from the $5.3 million in fiscal 2022. Effective in May 2023, under agreement with the LLC's managing partner and primary interest owner, Midstream's future capital contributions to the LLC have been assumed by the primary interest owner. Accordingly, Midstream has no further capital contributions during the remaining construction period of the MVP. Midstream has and will remain responsible for its portion of the capital requirements of the Southgate project. The LLC's managing partner is currently targeting completion of the MVP during the first quarter of calendar 2024. More information is provided under the Equity Investment in Mountain Valley Pipeline section below.\nCash Flows Provided by Financing Activities:\nFinancing activities generally consist of borrowings and repayments under credit agreements, issuance of common stock and the payment of dividends. Net cash flows provided by financing activities were $200,000 and $18.4 million in fiscal 2023 and 2022, respectively. The decrease in financing cash flows was primarily attributable to Resources' $27 million equity offering in March 2022 of which $12 million was invested in Roanoke Gas and $10 million in Midstream. The remaining $5 million in equity was invested in Midstream in fiscal 2023. Due to these cash infusions from the equity issue and the issuance of Roanoke Gas' $15 million and $10 million unsecured notes and Midstream's $8 million note, Roanoke Gas was able to pay down its line-of-credit balance and maturing $7 million note and Midstream applied $18 million against its non-revolving credit facility during fiscal 2022. During fiscal 2023, the Company realized $3.9 million from the issuance of stock through the ATM program, DRIP activity and the exercise of stock options compared to the $2.0 million received from those same activities during the prior year, in addition to the $27 million from the equity offering. Cash out flows for dividend payments reached $7.8 million as the annualized dividend rate increased from $0.78 to $0.79 per share and total outstanding shares increased as a result of the stock activity. The Companys consolidated capitalization was 44.4% equity and 55.6% long-term debt at September 30, 2023, exclusive of unamortized debt expense. This compares to 40.4% equity and 59.6% long-term debt at September 30, 2022.\nThe current interest rate environment is expected to continue to result in higher interest costs associated with the Company's variable rate debt or on the issuance of any new debt.\nManagement regularly evaluates the Company's liquidity through a review of its available financing resources and its operating cash flows. Resources maintains the ability to raise equity capital through its ATM program, private placement or other public offerings. Management believes Roanoke Gas has sufficient financing resources to meet its cash requirements for the next year, including the line-of-credit and the two private shelf facilities. The first shelf facility provides for the issuance of up to $40 million in unsecured notes in addition to the $28 million previously issued. This shelf agreement was extended in December 2022 and is scheduled to expire on December 6, 2025. The second facility provides for the issuance of up to $70 million in unsecured notes during its current term, which expires September 30, 2025. Roanoke Gas may also adjust capital spending as necessary if such a need would arise.\nBased on the agreement with the LLC's managing partner to assume future capital contributions related to the MVP, Midstream's future cash requirements are reduced to regular monthly operating expenses, debt service and capital contributions to Southgate. Midstream's total debt service over the succeeding 12 months includes $11 million to retire maturing debt and approximately $2.7 million in interest expense based on current rates. With current projections by the LLC's managing partner of MVP completion date during the first quarter of calendar 2024 and the subsequent operation of the pipeline, management believes that they will be able to negotiate extensions or refinancing options on the maturing debt and Midstream will meet its cash requirements over the ensuing 12 month period.\nNotes 6 and 7 provide details on the Company's line-of-credit and borrowing activities.\nATM Program\nResources issued 127,852 shares of common stock for $2,713,020, net of $69,565 in fees, under the ATM program for the year ended September 30, 2023. For the year ended September 30, 2022, Resources issued 4,872 shares of common stock for $112,500, net of $2,813 in fees, under the ATM program.\nOff-Balance Sheet Arrangements\nThe Company has no off-balance sheet arrangements as defined in Regulation S-K, Item 303(a)(4)(ii).\nEquity Investment in Mountain Valley Pipeline\nThe Company has a less than 1% interest in the MVP, which is accounted for as an equity investment, and a less than 1% interest in the Southgate pipeline, which is contemplated to interconnect with the MVP. As discussed more fully in Note 5, since inception, the MVP has encountered various legal and regulatory issues that have substantially delayed the completion of the project, including a period in 2022 where work on the project had been halted.\nAs required by GAAP, management assesses the fair value of its investment on a quarterly basis. As a result of the halt in construction in 2022, management conducted an assessment of its investment in MVP in accordance with the provisions of ASC 323, Investments - Equity Method and Joint Ventures. This assessment included a third-party valuation. As a result of its evaluations, management concluded that the investment in the LLC sustained other-than-temporary declines in fair value and recorded pre-tax impairment losses of $39.8 million and $15.3 million in its second and fourth quarters of 2022, respectively. This is described more fully in Note 5.\nDevelopments in 2023 on the legislative and legal fronts were favorable. Most notably, in June 2023, the FRA declared the completion of the MVP to be in the national interest and cleared the permitting and regulatory impediments. It also divested courts of jurisdiction to review agency actions on approvals necessary for MVP construction and initial operation. In July 2023, SCOTUS lifted certain stays and cleared the judicial impediments. Construction work restarted and the current target is that the MVP will be completed in the first quarter of calendar 2024. Combined, these actions have significantly increased the Companys assessment of the probability of a successful project with a concomitant increase to fair value. GAAP does not permit the Company to reverse previously recorded impairment charges.\nTo date, Resources' earnings from MVP are primarily attributable to AFUDC income generated by the LLC. Once the pipeline is commercially operational, AFUDC will cease and the Company will begin to receive its share of LLC earnings from long-term contracts to provide gas that were previously executed by the LLC. Resources expects cash distributions from the LLC to begin three to six months after commercial operations begin.\nAlthough the outlook for the MVP project is more positive than a year ago, management will monitor the status of MVP and Southgate for circumstances that could lead to future impairments. The amount and timing of further impairment, if any, would be dependent on the specific circumstances, including changes to probabilities of completion, changes in the assumed future cash flows and discount rate at the time of evaluation.\nMidstream fully borrowed $23 million under its non-revolving credit facility, which matures in December 2024. It has begun amortization of $400,000 per quarter on an additional variable rate note, as well as a note that comes fully due in June 2024. The Company is actively discussing and anticipates refinancing those obligations in 2024. With the expected completion of MVP in the first quarter of calendar 2024, Midstream is considering the long-term structure of its debt as it evolves from a project phase to an operating phase. See Note 7 for more information on all borrowings related to Midstream.\nRegulatory\nOn December 2, 2022, Roanoke Gas filed an application with the SCC seeking an $8.55 million annual increase in its non-gas base rates, of which $4.05 million was being recovered through the SAVE Rider. Since the Company was seeking to recover the costs associated with its SAVE Plan through interim non-gas base rates effective January 1, 2023, the Company discontinued its SAVE Plan and Rider for the remainder of the current fiscal year. In the fourth quarter of fiscal 2023, the Company reached a settlement with the SCC staff on all outstanding issues in the case. Under the terms of the settlement, the Company agreed to an incremental revenue requirement of $7.45 million. The Company agreed to begin billing the new rates effective October 1, 2023. The Company expects to receive the final order on the rate application in late calendar 2023 or early 2024.\nThe Company has recorded a provision for refund, including interest, associated with customer billings for the difference between the interim rates and the settlement rates.\nRoanoke Gas continues to recover the costs of its infrastructure replacement program through its SAVE Rider. The Company filed an application with the SCC for a new, five-year SAVE Plan and Rider on March 31, 2023, seeking recovery of costs associated with an estimated $8.5 million in SAVE eligible investment in fiscal 2024 and an estimated cumulative investment of $49.5 million over the proposed five-year plan period ending September 30, 2028. On August 31, 2023, the SCC approved the new SAVE Plan and Rider with rates effective October 1, 2023.\nOn May 16, 2022, Roanoke Gas announced a cooperative agreement under which Roanoke Gas and the Western Virginia Water Authority would produce commercial quality RNG from biogas produced at the regional water pollution control plant. In August 2022, Roanoke Gas filed an application with the SCC seeking approval of a rate adjustment clause to recover the costs associated with constructing, owning, operating and maintaining the renewable natural gas facility. The application was filed under Chapter 30 of Title 56 of the Code of Virginia. Chapter 30 allows the Company to accrue AFUDC on the RNG project. In connection with the RNG project, Roanoke Gas began accruing AFUDC in fiscal 2022 associated with construction of the facility. The Company has recognized approximately $468,000 of AFUDC since inception of the RNG project. The Company received a final order from the SCC on January 23, 2023 approving the Companys application. The RNG facility became operational in March 2023. The Company began billing customers the RNG rate adjustment on March 1, 2023, at which time the Company ceased recording AFUDC.\nOn May 30, 2023, the Company filed an application with the SCC to update the RNG Rider with an effective date of October 1, 2023. On September 1, 2023, the SCC approved the updated RNG Rider with rates effective October 1, 2023.\nOn June 2, 2022, Roanoke Gas filed an application with the SCC to acquire certain natural gas distribution assets from a local housing authority. Under this application, the Company requested the approval to acquire such facilities at five separate apartment complexes, located in the Companys service territory, that were under housing authority management. Under the proposed plan, the housing authority would renew existing natural gas distribution facilities to include mains, services, and meter installations and then transfer ownership of these facilities to Roanoke Gas. In turn, Roanoke Gas would assume responsibility for the operation and maintenance of these assets and recognize a gain related to the asset acquisition equal to the cost associated with the renewal.\nOn July 19, 2022, the SCC approved the application and on August 4, 2022, the housing authority transferred the assets from two apartment complexes to Roanoke Gas. Roanoke Gas recorded these assets and recognized a pre-tax gain of approximately $219,000 during the fourth quarter of fiscal 2022. On September 29, 2023, the housing authority transferred the assets from one additional apartment complex to Roanoke Gas and the Company recorded a pre-tax gain of approximately $311,000 during the fourth quarter of fiscal 2023. The authority is awaiting future funding to complete the two remaining apartment complexes. The timing of funding and the completion of the asset renewals for these complexes is unknown at this time.\nCritical Accounting Policies and Estimates\nThe consolidated financial statements of Resources are prepared in accordance with GAAP. The amounts of assets, liabilities, revenues and expenses reported in the Companys financial statements are affected by accounting policies, estimates and assumptions that are necessary to comply with generally accepted accounting principles. Estimates used in the financial statements are derived from prior experience, statistical analysis and management and professional judgments. Actual results may differ significantly from these estimates and assumptions.\nThe Company considers an estimate to be critical if it is material to the financial statements and requires assumptions to be made that were uncertain at the time the estimate was made and changes in the estimate are reasonably likely to occur from period to period. The Company considers the following accounting policies and estimates to be critical.\nInvestments - Under the provisions of ASC 323, Investments - Equity Method and Joint Ventures, the Company is required to evaluate its investment in the LLC to determine if the fair value of the investments are below the carrying amount and if this decline in fair value is considered other-than-temporary. If the results of the evaluation indicate that the decline in fair value is other-than-temporary, then the recognition of an impairment is required. The following events or circumstances would indicate the potential of an other-than-temporary decline in the fair value of the investment in the LLC:\na prolonged period of time that the fair value is below the investors carrying value;\nthe current expected financial performance is significantly worse than anticipated when the investor originally invested in the investee;\nadverse regulatory action is expected to substantially reduce the investees product demand or profitability;\nthe investee has lost significant customers or suppliers with no immediate prospects for replacement;\nthe investees discounted or undiscounted cash flows are below the investors carrying amount; and\nthe investees industry is declining and significantly lags the performance of the economy as a whole.\nThe determination of fair value of the Company's investment in the LLC is a significant estimate. Management has conducted quarterly evaluations of its investment in the LLC, with the assistance of a valuation specialist as needed, to determine the fair value utilizing an income approach and probability scenarios of discounted cash flows. In conducting these evaluations, management made a variety of assumptions that it believes to be reasonable. Variations in many of these assumptions could have a significant impact on the calculation of the fair value and the resulting level of impairment recorded. Furthermore, these assumptions are based on the facts and circumstances at the date of the evaluations and are subject to change. See the Equity Investment in Mountain Valley Pipeline section for additional information regarding the LLC valuation.\nRegulatory accounting - The Companys regulated operations follow the accounting and reporting requirements of ASC 980, Regulated Operations. The economic effects of regulation can result in a regulated company deferring costs that have been or are expected to be recovered from customers in a period different from the period in which the costs would be charged to expense by an unregulated enterprise. When this occurs, costs are deferred as regulatory assets on the consolidated balance sheet and recorded as expenses in the consolidated statements of income and comprehensive income when such amounts are reflected in rates. Additionally, regulators can impose regulatory liabilities upon a regulated company for amounts previously collected from customers and for current collection in rates of costs that are expected to be incurred in the future.\nIf, for any reason, the Company ceases to meet the criteria for application of regulatory accounting treatment for all or part of its operations, the Company would remove the applicable regulatory assets or liabilities from the consolidated balance sheet and include them in the consolidated statements of income and comprehensive income for the period in which the discontinuance occurred.\nRevenue recognition - Regulated utility sales and transportation revenues are based upon rates approved by the SCC. The non-gas cost component of rates may not be changed without a formal rate application and corresponding authorization by the SCC in the form of a Commission order; however, the gas cost component of rates is adjusted quarterly, or more frequently if necessary, through the PGA mechanism. When the Company files a request for a non-gas rate increase, the SCC may allow the Company to place such rates into effect subject to refund pending a final order. Under these circumstances, the Company estimates the amount of increase it anticipates will be approved based on the best available information. The Company has established a reserve for rate refund related for the difference in the settlement rates approved by the SCC staff and the interim rates implemented effective January 1, 2023. Once a final order is issued by the SCC, the Company will refund the excess billings to its customers.\nThe Company also bills customers through a SAVE Rider that provides a mechanism to recover on a prospective basis the costs associated with the Companys expected investment related to the replacement of natural gas distribution pipe and other qualifying projects. As authorized by the SCC, the Company adjusts billed revenues monthly through the application of the WNA model. As the Company's non-gas rates are established based on the 30-year temperature average, monthly fluctuations in temperature from the 30-year average could result in the recognition of more or less revenue than for what the non-gas rates were designed. The WNA authorizes the Company to adjust monthly revenues for the effects of variation in weather from the 30-year average with a corresponding entry to a WNA receivable or payable. At the end of each WNA year, the Company refunds excess revenue collected for weather that was colder than the 30-year average or bills customers for revenue short-fall resulting from weather that was warmer than normal. In a manner similar to the SAVE Rider, the Company also has an SCC approved mechanism to recover the investment and expenses for the operation of the RNG facility. As required under the provisions of ASC 980, the Company recognizes billed revenue related to SAVE projects, RNG and from the WNA to the extent such revenues have been earned under the provisions approved by the SCC.\nThe Company bills its regulated natural gas customers on a monthly cycle. The billing cycle for most customers does not coincide with the accounting periods used for financial reporting. The Company accrues revenue for estimated natural gas delivered to customers but not yet billed during the accounting period. The following month, the unbilled estimate is reversed, the actual usage is billed and a new unbilled estimate is calculated. The consolidated financial statements include unbilled revenue of $1,240,097 and $1,585,062 as of September 30, 2023 and 2022, respectively.\nUnder the provisions of ASU 2014-09, Revenue from Contracts with Customers, the Company recognizes revenues when natural gas is delivered to customers (the performance obligation) based on SCC approved tariff rates (the transaction price). The Company recognizes revenue through both billed and unbilled customer usage. The Company also recognizes revenue through ARPs, including the WNA.\nAllowance for Credit Losses - The Company evaluates the collectability of its accounts receivable balances based upon a variety of factors including loss history, level of delinquent account balances, collections on previously written off accounts and general economic conditions. The historical model used in valuing reserve for bad debts has been consistently applied prior to COVID-19 and has produced reasonable estimates for valuing the potential credit losses on customer accounts receivable. With the arrival of COVID-19 and the unprecedented widespread impact deriving from the pandemic, including the 17-month disconnection moratorium which ended August 30, 2021, the estimation of the Company's allowance for credit losses was more subjective with greater reliance on qualitative assessments and judgment rather than historical patterns. This greater focus on qualitative assessments continued into fiscal 2022 as the residual impact of COVID and the availability of federal financial assistance through the CARES Act and ARPA that were incorporated into fiscal 2021 credit loss estimates continued to have an effect on customer payment patterns. In fiscal 2023, customer account activity returned to pre-COVID levels where customer payment patterns and account aging were more predictable and prior valuation techniques were again applicable. Based on management's evaluation and assessments, the total allowance for credit losses were estimated at $155,164 and $371,271 as of September 30, 2023 and 2022, respectively.\nPension and Postretirement Benefits - The Company offers a pension plan and a postretirement plan to eligible employees. The expenses and liabilities associated with these plans, as disclosed in Note 9 to the consolidated financial statements, are based on numerous assumptions and factors, including provisions of the plans, employee demographics, contributions made to the plan, return on plan assets and various actuarial calculations, assumptions and accounting requirements. In regard to the pension plan, specific factors include assumptions regarding the discount rate used in determining future benefit obligations, expected long-term rate of return on plan assets, compensation increases and life expectancies. Similarly, the postretirement medical plan also requires the estimation of many of the same factors as the pension plan in addition to assumptions regarding the rate of medical inflation and Medicare availability. Actual results may differ materially from the results expected from the actuarial assumptions due to changing economic conditions, differences in actual returns on plan assets, different rates of medical inflation, volatility in interest rates and changes in life expectancy. Such differences may result in a material impact on the amount of expense recorded in future periods or the value of the obligations on the consolidated balance sheet.\nIn selecting the discount rate to be used in determining the benefit liability, the Company utilized the FTSE Pension Discount Curve, which incorporates the rates of return on high-quality, fixed-income investments that corresponded to the length and timing of benefit streams expected under both the pension plan and postretirement plan. The Company used a discount rate of 5.63% for valuing both its pension plan and postretirement plan liabilities at September 30, 2023. These discount rates represent an increase from the 5.15% for the pension plan and 5.16% for the postretirement plan used for valuing the corresponding liabilities at September 30, 2022. The increase in discount rates corresponds to the market reactions to the continuing inflationary pressures on the financial markets and economy. The yield on the 30-year Treasury increased from 2.08% at September 30, 2021 to 3.79% at September 30, 2022 and to 4.73% at September 30, 2023. Corporate bond rates experienced a smaller increase as credit spreads have narrowed. The rise in the discount rates was the primary factor in the reduction of the benefit obligations for both the pension and the postretirement plan. Mortality assumptions were based on the PRI-2012 Mortality Table with improvements projected generational using Projection Scale MP-2021 for the current year valuation.\nManagement has focused on reducing risk in the Company's defined benefit plans through different means including offering lump sum payouts to vested terminated participants and implementing a \"soft freeze\" on the plans. In 2017, the Company implemented a soft freeze to the pension plan whereby employees hired on or after January 1, 2017 would not be eligible to participate. Employees hired prior to that date continue to accrue benefits based on compensation and years of service. This soft freeze mirrored the strategy in 2000 when the Company implemented a similar freeze in its postretirement plan. Each of these strategies have served to limit liability growth and reduce volatility.\nThe Company also has focused on its asset investment strategy. With the soft freeze of both the pension and postretirement plans, future liability growth associated with participant service and compensation has been limited. Under the pension plan, the portion of the liability attributable to active eligible employees continuing to accrue benefits has declined from 56% of the liability as of the date of the soft freeze to 38% in fiscal 2023. The remaining 62% of the 2023 liability is set, subject to variability in the discount rate and mortality adjustments. Since January 2017, when the pension plan froze access to new employees, the asset allocation has transitioned from 60% equity and 40% fixed income to 25% equity and 75% fixed. During the same period, the fixed income portion of the plan was transitioned to an LDI approach, with the fixed income assets invested in securities with a duration that corresponds to the duration of the corresponding liability. This synchronization of the pension assets with the pension liabilities has reduced volatility in the funded status of the plan. This is evidenced by the relative stability of the funded status of the pension plan at September 30, 2023 and 2022 with a funded ratio of 100% and 103%, respectively. The 25% allocation to equity investments provides asset growth potential to offset increases in the pension liability related to those employees continuing to accrue benefits. Management will continue to evaluate the investment allocation as the liabilities mature and make adjustments as necessary.\nThe Company has initiated a transition of the postretirement plan assets from a 50% equity and 50% fixed income allocation to a 30% equity and 70% fixed income allocation. This revision to the investment targets is in response to a greater proportion of participants that have transitioned to retirement. As the postretirement plan implemented the soft freeze in 2000, only 25% of the plan's liability is currently attributable to active employees with the remaining liability associated with retired participants. Similar to the pension plan, the revision to the asset allocation will seek to reduce the volatility in funded status while still providing the opportunity for asset growth through the equity portion of the portfolio. The funded status for the postretirement plan was 116% and 98% as of September 30, 2023 and 2022, respectively. The improvement in the funded status was due to the higher equity allocation and shorter duration of the fixed income portion of the portfolio compared to the duration of the corresponding plan liabilities. Management will continue to monitor and evaluate the asset allocation and adjust as warranted.\nA summary of the funded status of both the pension and postretirement plans is provided below:\nFunded status - September 30, 2023\nPension\nPostretirement\nTotal\nBenefit obligation\n$ 26,747,624\n$ 11,248,448\n$ 37,996,072\nFair value of assets\n26,878,661\n13,019,313\n39,897,974\nFunded status\n$ 131,037\n$ 1,770,865\n$ 1,901,902\nFunded status - September 30, 2022\nPension\nPostretirement\nTotal\nBenefit obligation\n$ 27,268,456\n$ 12,416,546\n$ 39,685,002\nFair value of assets\n28,017,797\n12,138,119\n40,155,916\nFunded status\n$ 749,341\n$ (278,427 )\n$ 470,914\nThe Company annually evaluates the long-term rate of return on its targeted investment allocation model, as well as the overall asset allocation of its benefit plans, and reviews both plans' potential long-term rate of return with its investment advisors to determine the rates used in each plan's actuarial assumptions. Management maintained the long-term rate of return assumption at 4.50% for fiscal 2023 based on evaluation by the Company's investment advisor and management's assessment of the current market environment. The long-term rate of return for the postretirement plan increased slightly from 3.95% in fiscal 2023 to 4.24% for fiscal 2024. Management will continue to re-evaluate the return assumptions and asset allocation and adjust both as market conditions warrant.\nManagement estimates that the Company will have no minimum funding requirements next year. The Company currently does not expect to make contributions to its pension plan and postretirement plan in fiscal 2024 due to other financing considerations and the funded position of the plans. The Company will continue to evaluate its benefit plan funding levels in light of funding requirements and ongoing investment returns and make adjustments, as necessary, to avoid benefit restrictions and minimize PBGC premiums.\nThe following schedule reflects the sensitivity of pension costs to changes in certain actuarial assumptions, assuming that the other components of the calculation remain constant.\nActuarial Assumptions - Pension Plan\nChange in Assumption\nIncrease in Pension Cost\nIncrease in Projected Benefit Obligation\nDiscount rate\n-0.25 %\n$ 79,000\n$ 825,000\nRate of return on plan assets\n-0.25 %\n66,000\nN/A\nRate of increase in compensation\n0.25 %\n29,000\n132,000\nThe following schedule reflects the sensitivity of postretirement benefit costs from changes in certain actuarial assumptions, while the other components of the calculation remain constant.\nActuarial Assumptions - Postretirement Plan\nChange in Assumption\nIncrease (Decrease) in Postretirement Benefit Cost\nIncrease in Accumulated Postretirement Benefit Obligation\nDiscount rate\n-0.25 %\n$ (9,000 )\n$ 323,000\nRate of return on plan assets\n-0.25 %\n29,000\nN/A\nMedical claim cost increase\n0.25 %\n21,000\n316,000\nDerivatives - The Company may hedge certain risks incurred in its operation through the use of derivative instruments. The Company applies the requirements of ASC 815, Derivatives and Hedging, which requires the recognition of derivative instruments as assets or liabilities in the Companys consolidated balance sheet at fair value. In most instances, fair value is based upon quoted futures prices for natural gas commodities and interest rate futures for interest rate swaps. Changes in the commodity and futures markets will impact the estimates of fair value in the future. Furthermore, the actual market value at the point of realization of the derivative may be significantly different from the values used in determining fair value in prior financial statements. The Company had five interest-rate swaps outstanding at September 30, 2023 related to its variable rate notes. See Notes 1 and 7 to the consolidated financial statements for additional information regarding the swaps. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot applicable. Item 8. Financial Statements and Supplementary Data.\nRGC Resources, Inc. and Subsidiaries\nConsolidated Financial Statements\nfor the Years Ended September 30, 2023 and 2022\nand Report of Independent\nRegistered Public Accounting Firm\nRGC RESOURCES, INC. AND SUBSIDIARIES\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID 423)\nConsolidated Financial Statements for the Years Ended September 30, 2023 and 2022:\nConsolidated Balance Sheets\nConsolidated Statements of Income\nConsolidated Statements of Comprehensive Income (Loss)\nConsolidated Statements of Stockholders Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Stockholders\nRGC Resources, Inc.\nRoanoke, Virginia\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of RGC Resources, Inc. and Subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of income, comprehensive income, stockholders' equity, and cash flows for each of the years in the two-year period ended September 30, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the years in the two-year period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\n/s/ Brown Edwards & Company, L.L.P\nCERTIFIED PUBLIC ACCOUNTANTS\nWe have served as the Company's auditor since 2006.\nRoanoke, Virginia\nDecember 1, 2023\nRGC RESOURCES, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nAS OF September 30, 2023 AND 2022\nASSETS\nCURRENT ASSETS:\nCash and cash equivalents\n$ 1,512,431 $ 4,898,914\nAccounts receivable, net\n4,194,934 5,353,270\nMaterials and supplies\n1,674,462 1,228,554\nGas in storage\n11,185,601 16,916,651\nPrepaid income taxes\n3,227,544 3,087,755\nRegulatory assets\n2,854,276 1,877,468\nInterest rate swaps\n1,533,057 1,218,211\nOther\n612,957 967,496\nTotal current assets\n26,795,262 35,548,319\nUTILITY PROPERTY:\nIn service\n318,369,891 290,940,683\nAccumulated depreciation and amortization\n(85,752,798 ) (80,242,946 )\nIn service, net\n232,617,093 210,697,737\nConstruction work in progress\n14,966,458 19,163,337\nUtility property, net\n247,583,551 229,861,074\nOTHER NON-CURRENT ASSETS:\nRegulatory assets\n5,389,445 5,446,547\nInvestment in unconsolidated affiliates\n17,187,093 13,773,075\nBenefit plan assets\n1,901,902 749,341\nDeferred income taxes\n1,163,594 1,057,079\nInterest rate swaps\n3,084,398 3,580,256\nOther\n624,095 293,552\nTotal other non-current assets\n29,350,527 24,899,850\nTOTAL ASSETS\n$ 303,729,340 $ 290,309,243\n(Continued)\nRGC RESOURCES, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nAS OF September 30, 2023 AND 2022\nLIABILITIES AND STOCKHOLDERS EQUITY\nCURRENT LIABILITIES:\nCurrent maturities of long-term debt\n$ 10,975,000 $ 1,300,000\nLine-of-credit\n4,353,572 -\nDividends payable\n1,978,400 1,915,317\nAccounts payable\n5,838,643 8,600,919\nCapital contributions payable\n- 804,506\nCustomer credit balances\n1,972,132 1,400,770\nCustomer deposits\n1,476,321 1,457,610\nAccrued expenses\n4,661,722 3,668,122\nRegulatory liabilities\n1,632,716 3,168,066\nOther\n30,281 -\nTotal current liabilities\n32,918,787 22,315,310\nLONG-TERM DEBT:\nNotes payable\n126,100,000 135,971,200\nUnamortized debt issuance costs\n(255,272 ) (275,911 )\nLong-term debt, net\n125,844,728 135,695,289\nDEFERRED CREDITS AND OTHER NON-CURRENT LIABILITIES:\nAsset retirement obligations\n10,792,831 10,204,079\nRegulatory cost of retirement obligations\n13,029,376 12,277,796\nBenefit plan liabilities\n47,674 337,535\nDeferred income taxes\n2,008,458 3,165,454\nRegulatory liabilities\n18,031,693 13,223,124\nOther\n323,168 -\nTotal deferred credits and other non-current liabilities\n44,233,200 39,207,988\nCOMMITMENTS AND CONTINGENCIES (Note 12)\nCAPITALIZATION:\nStockholders Equity:\nCommon stock, $5 par value; authorized 20,000,000 shares; issued and outstanding 10,015,254 and 9,820,535 shares in 2023 and 2022, respectively\n50,076,270 49,102,675\nPreferred stock, no par; authorized 5,000,000 shares; no shares issued and outstanding in 2023 and 2022\n- -\nCapital in excess of par value\n44,430,786 41,479,459\nRetained earnings\n3,972,280 544,158\nAccumulated other comprehensive income\n2,253,289 1,964,364\nTotal stockholders equity\n100,732,625 93,090,656\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY\n$ 303,729,340 $ 290,309,243\nSee notes to consolidated financial statements.\nRGC RESOURCES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\nYEARS ENDED September 30, 2023 AND 2022\nOPERATING REVENUES:\nGas utility\n$ 97,325,307 $ 84,035,644\nNon utility\n114,458 129,578\nTotal operating revenues\n97,439,765 84,165,222\nOPERATING EXPENSES:\nCost of gas - utility\n51,742,718 42,496,055\nCost of sales - non utility\n25,603 29,126\nOperations and maintenance\n15,903,972 15,489,240\nGeneral taxes\n2,324,314 2,285,203\nDepreciation and amortization\n9,764,678 8,948,923\nTotal operating expenses\n79,761,285 69,248,547\nOPERATING INCOME\n17,678,480 14,916,675\nEquity in earnings of unconsolidated affiliate\n2,084,990 73,327\nImpairment of unconsolidated affiliates\n- (55,092,303 )\nOther income, net\n646,528 1,456,983\nInterest expense\n5,618,805 4,497,929\nINCOME (LOSS) BEFORE INCOME TAXES\n14,791,193 (43,143,247 )\nINCOME TAX EXPENSE (BENEFIT)\n3,491,911 (11,410,645 )\nNET INCOME (LOSS)\n$ 11,299,282 $ (31,732,602 )\nEARNINGS (LOSS) PER COMMON SHARE:\nBasic\n$ 1.14 $ (3.48 )\nDiluted\n$ 1.14 $ (3.48 )\nWEIGHTED AVERAGE SHARES OUTSTANDING:\nBasic\n9,922,701 9,122,678\nDiluted\n9,927,157 9,122,678\nSee notes to consolidated financial statements.\nRGC RESOURCES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\nYEARS ENDED September 30, 2023 AND 2022\nNET INCOME (LOSS)\n$ 11,299,282 $ (31,732,602 )\nOther comprehensive income (loss), net of tax:\nInterest rate swaps\n(134,419 ) 4,451,551\nDefined benefit plans\n423,344 (951,753 )\nOTHER COMPREHENSIVE INCOME, NET OF TAX\n288,925 3,499,798\nCOMPREHENSIVE INCOME (LOSS)\n$ 11,588,207 $ (28,232,804 )\nSee notes to consolidated financial statements.\nRGC RESOURCES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nYEARS ENDED September 30, 2023 AND 2022\nAccumulated\nCapital in\nOther\nTotal\nCommon\nExcess of\nRetained\nComprehensive\nStockholders\nStock\nPar Value\nEarnings\nIncome (Loss)\nEquity\nBALANCE - SEPTEMBER 30, 2021\n$ 41,875,460 $ 19,705,387 $ 39,656,296 $ (1,535,434 ) $ 99,701,709\nNet loss\n- - (31,732,602 ) - (31,732,602 )\nOther comprehensive income\n- - - 3,499,798 3,499,798\nExercise of stock options (8,750 shares)\n43,750 83,064 - - 126,814\nStock option grants\n- 16,330 - - 16,330\nCash dividends declared ($0.78 per share)\n- - (7,379,536 ) - (7,379,536 )\nIssuance costs\n- (54,175 ) - - (54,175 )\nIssuance of common stock (1,436,693 shares)\n7,183,465 21,728,853 - - 28,912,318\nBALANCE - SEPTEMBER 30, 2022\n$ 49,102,675 $ 41,479,459 $ 544,158 $ 1,964,364 $ 93,090,656\nNet income\n- - 11,299,282 - 11,299,282\nOther comprehensive income\n- - - 288,925 288,925\nExercise of stock options (12,500 shares)\n62,500 137,500 - - 200,000\nStock option grants\n- 21,560 - - 21,560\nCash dividends declared ($0.79 per share)\n- - (7,871,160 ) - (7,871,160 )\nIssuance costs\n- (221,618 ) - - (221,618 )\nIssuance of common stock (182,219 shares)\n911,095 3,013,885 - - 3,924,980\nBALANCE - SEPTEMBER 30, 2023\n$ 50,076,270 $ 44,430,786 $ 3,972,280 $ 2,253,289 $ 100,732,625\nSee notes to consolidated financial statements.\nRGC RESOURCES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYEARS ENDED September 30, 2023 AND 2022\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income (loss)\n$ 11,299,282 $ (31,732,602 )\nAdjustments to reconcile net income (loss) to net cash provided by operations:\nDepreciation and amortization\n9,993,206 9,182,751\nCost of retirement of utility property, net\n(824,637 ) (630,262 )\nStock option grants\n21,560 16,330\nEquity in earnings of unconsolidated affiliate\n(2,084,990 ) (73,327 )\nImpairment of unconsolidated affiliates\n- 55,092,303\nAllowance for funds used during construction\n(362,685 ) (75,154 )\nDeferred income taxes\n38,241 (14,258,294 )\nOther noncash items, net\n(67,266 ) 317,169\nChanges in assets and liabilities which provided (used) cash:\nAccounts receivable and customer deposits, net\n1,393,153 (646,362 )\nInventories and gas in storage\n5,285,142 (9,246,069 )\nRegulatory and other assets\n(891,152 ) 3,949,270\nAccounts payable, customer credit balances and accrued expenses, net\n(91,522 ) 310,700\nRegulatory liabilities\n88,368 3,345,223\nTotal adjustments\n12,497,418 47,284,278\nNet cash provided by operating activities\n23,796,700 15,551,676\nCASH FLOWS FROM INVESTING ACTIVITIES:\nExpenditures for utility property\n(25,306,524 ) (25,461,000 )\nInvestment in unconsolidated affiliates\n(2,133,534 ) (5,260,863 )\nProceeds from disposal of utility property\n37,940 105,985\nNet cash used in investing activities\n(27,402,118 ) (30,615,878 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nBorrowings under line-of-credit\n33,172,013 36,871,007\nRepayments under line-of-credit\n(28,818,441 ) (54,499,904 )\nProceeds from issuance of unsecured notes\n1,103,800 39,286,000\nRetirement of notes payable\n(1,300,000 ) (25,125,000 )\nDebt issuance expenses\n(33,722 ) (58,201 )\nProceeds from issuance of stock\n3,903,362 28,984,957\nCash dividends paid\n(7,808,077 ) (7,014,060 )\nNet cash provided by financing activities\n218,935 18,444,799\nNET INCREASE (DECREASE) IN CASH AND CASH EQUIVALENTS\n(3,386,483 ) 3,380,597\nBEGINNING CASH AND CASH EQUIVALENTS\n4,898,914 1,518,317\nENDING CASH AND CASH EQUIVALENTS\n$ 1,512,431 $ 4,898,914\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid during the year for:\nInterest\n$ 5,299,959 $ 4,269,900\nIncome taxes\n1,775,145 2,290,000\nSee notes to consolidated financial statements.\nRGC RESOURCES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nYEARS ENDED September 30, 2023 AND 2022\n1.\nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation-RGC Resources, Inc. is an energy services company primarily engaged in the sale and distribution of natural gas. The consolidated financial statements include the accounts of Resources and its wholly owned subsidiaries: Roanoke Gas, Midstream and Diversified Energy. Roanoke Gas is a natural gas utility, which distributes and sells natural gas to approximately 62,200 residential, commercial and industrial customers within its service areas in Roanoke, Virginia and the surrounding localities. The Companys business is seasonal in nature as a majority of natural gas sales are for space heating during the winter season. Roanoke Gas is regulated by the SCC. Midstream is a wholly owned subsidiary created primarily to invest in the Mountain Valley Pipeline project. Diversified Energy is inactive.\nThe Company follows accounting and reporting standards established by the FASB and the SEC, including certain provisions allowed under the smaller reporting company exceptions.\nRate Regulated Basis of Accounting-The Companys regulated operations follow the accounting and reporting requirements of ASC 980, Regulated Operations. The economic effects of regulation can result in a regulated company deferring costs that have been or are expected to be recovered from customers in a period different from the period in which the costs would be charged to expense by an unregulated enterprise. When this situation occurs, costs are deferred as assets in the consolidated balance sheet (regulatory assets) and recorded as expenses when such amounts are reflected in rates. Additionally, regulators can impose liabilities upon a regulated company for amounts previously collected from customers and for current collection in rates of costs that are expected to be incurred in the future (regulatory liabilities). In the event the provisions of ASC 980 no longer apply to any or all regulatory assets or liabilities, the Company would write off such amounts and include them in the consolidated statements of income and comprehensive income in the period which ASC 980 no longer applied.\nRegulatory assets and liabilities included in the Companys consolidated balance sheets as of September 30, 2023 and 2022 are as follows:\nSeptember 30\nAssets:\nCurrent Assets:\nRegulatory assets:\nAccrued WNA revenues\n$ 414,689 $ 193,518\nUnder-recovery of gas costs\n1,383,340 1,316,580\nUnder-recovery of RNG revenues\n797,804 -\nAccrued pension\n243,017 237,911\nOther deferred expenses\n15,426 129,459\nTotal current\n2,854,276 1,877,468\nUtility Property:\nIn service:\nOther\n479,647 11,945\nConstruction work in progress:\nAFUDC\n356,325 461,342\nOther Non-Current Assets:\nRegulatory assets:\nPremium on early retirement of debt\n1,256,059 1,370,246\nAccrued pension\n3,786,265 3,894,561\nOther deferred expenses\n347,121 181,740\nTotal non-current\n5,389,445 5,446,547\nTotal regulatory assets\n$ 9,079,693 $ 7,797,302\nLiabilities and Stockholders' Equity:\nCurrent Liabilities:\nRegulatory liabilities:\nOver-recovery of SAVE Plan revenues\n$ 146,861 $ 158,847\nRate refund\n652,018 -\nDeferred income taxes\n527,034 363,297\nSupplier refunds\n275,649 2,484,992\nOther deferred liabilities\n31,154 160,930\nTotal current\n1,632,716 3,168,066\nDeferred Credits and Non-Current Other Liabilities:\nAsset retirement obligations\n10,792,831 10,204,079\nRegulatory cost of retirement obligations\n13,029,376 12,277,796\nRegulatory liabilities:\nDeferred income taxes\n16,249,776 13,193,006\nDeferred postretirement medical\n1,781,917 30,118\nTotal non-current\n41,853,900 35,704,999\nTotal regulatory liabilities\n$ 43,486,616 $ 38,873,065\nAmortization of $213,450 and $156,467 of regulatory assets for the years ended September 30, 2023 and 2022, respectively, is included in operations and maintenance expense on the consolidated statements of income. Amortization of $237,911 and $206,679 of regulatory assets for the years ended September 30, 2023 and 2022, respectively, is included in other income, net on the consolidated statements of income. Amortization of $114,187 of regulatory assets for both years ended September 30, 2023 and 2022 is included in interest expense on the consolidated statements of income.\nAs of September 30, 2023, the Company had regulatory assets in the amount of $8,600,046 on which the Company did not earn a return during the recovery period.\nUtility Property and Depreciation-Utility property is stated at original cost and includes direct labor and materials, contractor costs, and all allocable overhead charges. The Company applies the group method of accounting, where the costs of like assets are aggregated and depreciated by applying a rate based on the average expected useful life of the assets. In accordance with Company policy, expenditures for depreciable assets with a life greater than one year are capitalized, along with any upgrades or improvements to existing assets, when such upgrades or improvements significantly improve or extend the original expected useful life. Expenditures for maintenance, repairs, and minor renewals and betterments are expensed as incurred. The original cost of depreciable property retired is removed from utility property and charged to accumulated depreciation. The cost of asset removals, less salvage, is charged to regulatory cost of retirement obligations or asset retirement obligations as explained under Asset Retirement Obligations below.\nUtility property is composed of the following major classes of assets:\nSeptember 30\nDistribution and transmission\n$ 286,200,652 $ 259,253,559\nLNG storage\n15,407,053 15,383,276\nGeneral and miscellaneous\n16,762,186 16,303,848\nTotal utility property in service\n$ 318,369,891 $ 290,940,683\nProvisions for depreciation are computed principally at composite straight-line rates over a range of periods. Rates are determined by depreciation studies, which are required to be performed at least every 5 years on the regulated utility assets of Roanoke Gas. The last depreciation study was completed and approved by the SCC staff in fiscal 2019. The Company will complete a new depreciation study during fiscal 2024. The composite weighted-average depreciation rate was 3.30% and 3.28% for the years ended September 30, 2023 and 2022, respectively.\nThe composite rates are composed of two components, one based on average service life and one based on cost of retirement. As a result, the Company accrues the estimated cost of retirement of long-lived assets through depreciation expense. These retirement costs are not a legal obligation but rather the result of cost-based regulation and are accounted for under the provisions of ASC 980. Such amounts are classified as a regulatory liability.\nThe Company reviews long-lived assets and certain identifiable intangibles for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. These reviews have not identified any impairments which would have a material effect on the results of operations or financial condition. See Note 5 for prior year impairment related to the Company's investment in affiliates.\nIn fiscal 2020, Roanoke Gas implemented the application of AFUDC related to infrastructure investments associated with two gate stations that will interconnect with the MVP. In fiscal 2022, the SCC approved the application of AFUDC on the RNG project during its construction phase. This treatment allows capitalizing both the equity and debt financing costs during the construction phases. For the years ended September 30, 2023, and 2022, the Company capitalized $76,785 and $15,911 of debt financing costs and $285,900 and $59,243 of equity financing costs related to these projects, respectively, thereby affecting interest expense and other income, net on the consolidated statements of income. See Note 3 for further information.\nAsset Retirement Obligations-ASC 410, Asset Retirement and Environmental Obligations, requires entities to record the fair value of a liability for an ARO when there exists a legal obligation for the retirement of the asset. When the liability is initially recorded, the entity capitalizes the cost, thereby increasing the carrying amount of the underlying asset. In subsequent periods, the liability is accreted, and the capitalized cost is depreciated over the useful life of the underlying asset. The Company has recorded AROs for its future legal obligations related to purging and capping its distribution mains and services upon retirement, although the timing of such retirements is uncertain.\nThe Companys composite depreciation rates include a component to provide for the cost of asset retirement. As a result, the Company accrues the estimated cost of retirement of its utility plant through depreciation expense and creates a corresponding regulatory liability. The costs of retirement considered in the development of the depreciation component include those costs associated with the legal liability. Therefore, the ARO is reclassified from the regulatory cost of retirement obligation. If the legal obligations were to exceed the regulatory liability provided for in the depreciation rates, the Company would establish a regulatory asset for such difference with the anticipation of future recovery through rates charged to customers. In 2022, the Company increased its asset retirement obligation to reflect revisions to the estimated cash flows for asset retirements due to increasing costs.\nThe following is a summary of the AROs:\nYears Ended September 30\nBeginning balance\n$ 10,204,079 $ 7,628,958\nLiabilities incurred\n91,670 236,926\nLiabilities settled\n(180,865 ) (131,763 )\nAccretion\n677,947 397,692\nRevisions to estimated cash flows\n- 2,072,266\nEnding balance\n$ 10,792,831 $ 10,204,079\nCash, Cash Equivalents and Short-Term Investments-From time to time, the Company will have balances on deposit at banks in excess of the amount insured by the FDIC. The Company has not experienced any losses on these accounts and does not consider these amounts to be at risk. For purposes of the consolidated statements of cash flows, the Company considers all highly liquid debt instruments purchased with an original maturity of three months or less to be cash equivalents.\nCustomer Receivables and Allowance for Credit Losses-Accounts receivable include amounts billed to customers for natural gas sales and related services and gas sales occurring subsequent to normal billing cycles but before the end of the period. The Company provides an estimate for losses on these receivables by utilizing historical information, current account balances, account aging and current economic conditions. Customer accounts are charged off annually when deemed uncollectible or when turned over to a collection agency for action.\nA reconciliation of changes in the allowance for credit losses is as follows:\nYears Ended September 30\nBeginning balance\n$ 371,271 $ 242,010\nProvision for credit losses\n54,211 492,875\nRecoveries of accounts written off\n181,676 135,143\nAccounts written off\n(451,994 ) (498,757 )\nEnding balance\n$ 155,164 $ 371,271\nLease Accounting-The Company leases certain assets including office space and land classified as operating leases. The Company determines if an arrangement is a lease at inception of the agreement based on the terms and conditions in the contract. The operating lease ROU assets and operating lease liabilities are recognized as the present value of the future minimum lease payments over the lease term at commencement date. As most of the leases do not provide an implicit rate, the Company uses an estimate of its secured incremental borrowing rate based on the information available at commencement date in determining the present value of future payments. The incremental borrowing rate is determined by management aided by inquiries of a third party. The operating lease ROU asset also is adjusted for any lease payments made and excludes lease incentives and initial direct costs incurred. The Companys lease terms may include options to extend or terminate the lease at certain dates, typically at the Companys own discretion. The Company regularly evaluates the renewal options and when they are reasonably certain of exercise, the Company includes the renewal period in its lease term. Lease expense for minimum lease payments is recognized on a straight-line basis over the term of the agreement. The Company made an accounting policy election that payments under agreements with an initial term of 12 months or less will not be included on the consolidated balance sheet but will be recognized in the consolidated statements of operations on a straight-line basis over the term of the agreement.\nFinancing Receivables-Financing receivables represent a contractual right to receive money either on demand, or on fixed or determinable dates, and are recognized as assets on the entitys balance sheet. Trade receivables, resulting from the sale of natural gas and other services to customers, are the Company's primary type of financing receivables. These receivables are short-term in nature with a provision for credit losses included in the consolidated financial statements.\nInventories-Natural gas in storage and materials and supplies inventories are recorded at average cost. Natural gas storage injections are priced at the purchase cost at the time of injection and storage withdrawals are priced at the weighted average cost of gas in storage. Materials and supplies are removed from inventory at average cost.\nUnbilled Revenues-The Company bills its natural gas customers on a monthly cycle; however, the billing cycle for most customers does not coincide with the accounting periods used for financial reporting. As the Company recognizes revenue when gas is delivered, an accrual is made to estimate revenues for natural gas delivered to customers but not billed during the accounting period. The amounts of unbilled revenue receivable included in accounts receivable on the consolidated balance sheets at September 30, 2023 and 2022 were $1,240,097 and $1,585,062, respectively.\nIncome Taxes-Income taxes are accounted for using the asset and liability method. Under the asset and liability method, deferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the years in which those temporary differences are expected to be recovered or settled. A valuation allowance against deferred tax assets is provided if it is more likely than not the deferred tax asset will not be realized. The Company and its subsidiaries file consolidated state and federal income tax returns.\nDebt Expenses-Debt issuance expenses are deferred and amortized over the lives of the debt instruments. The unamortized balances are offset against the carrying value of long-term debt.\nOver/Under-Recovery of Natural Gas Costs-Pursuant to the provisions of the Companys PGA clause, the SCC provides the Company with a method of passing along to its customers increases or decreases in natural gas costs incurred by its regulated operations, including gains and losses on natural gas derivative hedging instruments, if utilized. On at least a quarterly basis, the Company files a PGA rate adjustment request with the SCC to increase or decrease the gas cost component of its rates, based on projected price and activity. Once administrative approval is received, the Company adjusts the gas cost component of its rates to reflect the approved amount. As actual costs will differ from the projections used in establishing the PGA rate, the Company may either over-recover or under-recover its actual gas costs during the period. Any difference between actual costs incurred and costs recovered through the application of the PGA is recorded as a regulatory asset or liability. At the end of the deferral period, the balance of the net deferred charge or credit is amortized over an ensuing 12-month period as amounts are reflected in customer bills.\nFair Value-Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between willing market participants at the measurement date. The Company determines fair value based on the following fair value hierarchy which prioritizes each input to the valuation methods into one of the following three broad levels:\nLevel 1 - Unadjusted quoted prices in active markets for identical assets or liabilities that the Company has the ability to access at the measurement date.\nLevel 2 - Inputs other than quoted prices in Level 1 that are either for similar assets or liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable for the asset or liability, or inputs that are derived principally from or corroborated by observable market data by correlation or other means.\nLevel 3 - Unobservable inputs for the asset or liability where there is little, if any, market activity which require the Company to develop its own assumptions.\nThe fair value hierarchy gives the highest priority to unadjusted quoted prices in active markets (Level 1) and the lowest priority to unobservable inputs (Level 3). All fair value disclosures are categorized within one of the three categories in the hierarchy. See fair value disclosures below and in Notes 9 and 13.\nUse of Estimates-The preparation of consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nExcise and Sales Taxes-Certain excise and sales taxes imposed by the state and local governments in the Companys service territory are collected by the Company from its customers. These taxes are accounted for on a net basis and therefore are not included as revenues in the Companys consolidated income statements.\nEarnings Per Share-Basic EPS and diluted EPS are calculated by dividing net income by the weighted-average common shares outstanding during the period and the weighted-average common shares outstanding during the period plus potential dilutive common shares, respectively. Potential dilutive common shares are calculated in accordance with the treasury stock method, which assumes that proceeds from the exercise of all options are used to repurchase common stock at market value. The amount of shares remaining after the proceeds are exhausted represents the potentially dilutive effect of the securities. A reconciliation of basic and diluted EPS is presented below:\nYears Ended September 30\nNet income (loss)\n$ 11,299,282 $ (31,732,602 )\nWeighted-average common shares\n9,922,701 9,122,678\nEffect of dilutive securities:\nOptions to purchase common stock\n4,456 -\nDiluted average common shares\n9,927,157 9,122,678\nEarnings per share of common stock:\nBasic\n$ 1.14 $ (3.48 )\nDiluted\n$ 1.14 $ (3.48 )\nStock Issue-The Company may issue common stock to increase its cash position or lower its outstanding debt, thus strengthening the balance sheet.\nDuring fiscal 2023, 194,719 shares of common stock were issued related to the DRIP, Restricted Stock, stock option exercises and ATM activity.\nIn March 2022, the Company issued 1,350,000 shares of common stock in an equity offering resulting in net proceeds of nearly $27 million. The net proceeds were invested in Roanoke Gas to supplement the funding of its infrastructure improvement and replacement program and in Midstream to reduce its outstanding debt. An additional 95,443 shares of common stock were issued during fiscal 2022 related to the DRIP, Restricted Stock, stock option exercises and ATM activity.\nBusiness and Credit Concentrations-The primary business of the Company is the distribution of natural gas to residential, commercial and industrial customers in its service territories.\nNo sales to individual customers accounted for more than 5% of total revenue in any period. No individual customer amounted to more than 5% of total accounts receivable at September 30, 2023 and one customer amounted to approximately 5.1% of total accounts receivable at September 30, 2022.\nRoanoke Gas currently holds the only franchises and CPCNs to distribute natural gas in its service area. All franchises expire December 31, 2035. The Company's current CPCNs in Virginia are exclusive and are intended for perpetual duration, other than the CPCN to expand into Franklin County, which currently expires in February 2027.\nRoanoke Gas is currently served by two primary pipelines that provide all of the natural gas supplied to the Companys customers. Depending upon weather conditions and the level of customer demand, failure of one or both of these transmission pipelines could have a major adverse impact on the Company.\nDerivative and Hedging Activities-ASC 815, Derivatives and Hedging, requires the recognition of all derivative instruments as assets or liabilities in the Companys consolidated balance sheet and measurement of those instruments at fair value.\nThe Companys hedging and derivatives policy allows management to enter into derivatives for the purpose of managing the commodity and financial market risks of its business operations. The Companys hedging and derivatives policy specifically prohibits the use of derivatives for speculative purposes. The key market risks that the Company may hedge against include the price of natural gas and the cost of borrowed funds.\nFrom time to time, the Company has entered into collars, swaps and caps for the purpose of hedging the price of natural gas in order to provide price stability during the winter months. The fair value of these instruments is recorded in the consolidated balance sheets with the offsetting entry to either under- or over-recovery of gas costs. Net income and other comprehensive income are not affected by the change in market value as any cost incurred or benefit received from these instruments is recoverable or refunded through the PGA as the SCC allows for full recovery of prudent costs associated with natural gas purchases. At September 30, 2023 and 2022, the Company had no outstanding derivative instruments for the purchase of natural gas.\nThe Company has five interest rate swaps associated with certain of its variable rate debt. Roanoke Gas has two variable rate term notes in the amounts of $15 million and $10 million, with corresponding swap agreements to convert the variable interest rates into fixed rates of 2.00% and 2.49%, respectively. Under the provisions of the $10 million note, Roanoke Gas received $5 million on April 1, 2022 and the remaining $5 million on September 30, 2022. Midstream has three swap agreements corresponding to the $14 million, $10 million, and $8 million variable rate term notes. The swap agreements convert these three notes into fixed rate instruments with effective interest rates of 3.24%, 3.14%, and 2.443%, respectively. The swaps qualify as cash flow hedges with changes in fair value reported in other comprehensive income. No portion of the swaps were deemed ineffective during the periods presented.\nSee Notes 7 and 13 for additional information on the swaps and fair value.\nOther Comprehensive Income (Loss)-A summary of other comprehensive income is provided below:\nTax\nBefore Tax\n(Expense)\nNet of Tax\nAmount\nor Benefit\nAmount\nYear Ended September 30, 2023:\nInterest rate swaps:\nUnrealized gains\n$ 1,560,426 $ (401,652 ) $ 1,158,774\nTransfer of realized gains to interest expense\n(1,741,437 ) 448,244 (1,293,193 )\nNet interest rate swaps\n(181,011 ) 46,592 (134,419 )\nDefined benefit plans:\nNet gains arising during period\n491,270 (126,453 ) 364,817\nAmortization of actuarial losses\n78,813 (20,286 ) 58,527\nNet defined benefit plans\n570,083 (146,739 ) 423,344\nOther comprehensive income\n$ 389,072 $ (100,147 ) $ 288,925\nYear Ended September 30, 2022:\nInterest rate swaps:\nUnrealized gains\n$ 5,617,251 $ (1,445,878 ) $ 4,171,373\nTransfer of realized losses to interest expense\n377,299 (97,121 ) 280,178\nNet interest rate swaps\n5,994,550 (1,542,999 ) 4,451,551\nDefined benefit plans:\nNet losses arising during period\n(1,221,368 ) 314,379 (906,989 )\nAmortization of actuarial gains\n(60,280 ) 15,516 (44,764 )\nNet defined benefit plans\n(1,281,648 ) 329,895 (951,753 )\nOther comprehensive income\n$ 4,712,902 $ (1,213,104 ) $ 3,499,798\nThe amortization of actuarial gains or losses are included as a component of net periodic pension and postretirement benefit costs under other income, net in the consolidated statements of income.\nComposition of AOCI:\nInterest Rate Swaps\nDefined Benefit Plans\nAccumulated Other Comprehensive Income (Loss)\nBalance September 30, 2021\n$ (888,210 ) $ (647,224 ) $ (1,535,434 )\nOther comprehensive income (loss)\n4,451,551 (951,753 ) 3,499,798\nBalance September 30, 2022\n3,563,341 (1,598,977 ) 1,964,364\nOther comprehensive income (loss)\n(134,419 ) 423,344 288,925\nBalance September 30, 2023\n$ 3,428,922 $ (1,175,633 ) $ 2,253,289\nRecently Adopted Accounting Standards\nIn January 2018, the FASB issued ASU 2018-01, Leases (Topic 842): Land Easement Practical Expedient for Transition to Topic 842, which provides a practical expedient that allows entities the option of not evaluating existing land easements under the new lease standard for those easements that were entered into prior to adoption. New or modified land easements will require evaluation on a prospective basis. The new guidance is effective for the Company for the annual reporting period ending September 30, 2023 and interim periods within that annual period. The new guidance did not have a material effect on the Company's consolidated financial statements.\nRecently Issued Accounting Standards\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848) - Facilitation of the Effects of Reference Rate Reform on Financial Reporting. In combination with ASU 2021-01 and ASU 2022-06, the ASU provides temporary optional guidance to ease the potential burden in accounting for and recognizing the effects of reference rate change on financial reporting. The new guidance applies specifically to contracts and hedging relationships that reference LIBOR, or any other referenced rate that is expected to be discontinued due to reference rate reform. The new guidance is effective for the Company through December 31, 2024. The Intercontinental Exchange Benchmark Administration, the administrator for LIBOR and other inter-bank offered rates, announced that the LIBOR rates for one-day, one-month, six-month and one-year would cease publication in June 2023 and that no new financial contracts may use LIBOR after December 31, 2021. Subsequent to June 30, 2023, the one-day, one-month, six-month, and one-year LIBOR settings will continue to be published under an unrepresentative synthetic methodology until the end of September 2024 in order to bridge the transition to other reference rates. The Company has transitioned all but one LIBOR-based variable rate note to a new reference rate as of September 30, 2023. Each of the revised notes has a corresponding swap that was also transitioned to align with the related notes. The last LIBOR-based variable rate note will mature in fiscal 2024.\nOther accounting standards that have been issued or proposed by the FASB or other standard-setting bodies are not currently applicable to the Company or are not expected to have a significant impact on the Companys financial position, results of operations and cash flows.\nReclassification\nCertain prior year amounts have been reclassified to conform to current year presentations.\n2.\nREVENUE\nThe Company assesses new contracts and identifies related performance obligations for promises to transfer distinct goods or services to the customer. Revenue is recognized when performance obligations have been satisfied. In the case of Roanoke Gas, the Company contracts with its customers for the sale and/or delivery of natural gas.\nThe following tables summarize revenue by customer, product and income statement classification for the years ended September 30:\nGas utility\nNon utility\nTotal operating revenues\nNatural Gas (Billed and Unbilled):\nResidential\n$ 54,342,435 $ - $ 54,342,435\nCommercial\n33,083,485 - 33,083,485\nIndustrial and transportation\n5,730,726 - 5,730,726\nOther\n1,122,710 114,458 1,237,168\nTotal contracts with customers\n94,279,356 114,458 94,393,814\nAlternative revenue programs\n3,045,951 - 3,045,951\nTotal operating revenues\n$ 97,325,307 $ 114,458 $ 97,439,765\nGas utility\nNon utility\nTotal operating revenues\nNatural Gas (Billed and Unbilled):\nResidential\n$ 46,915,892 $ - $ 46,915,892\nCommercial\n28,874,522 - 28,874,522\nIndustrial and transportation\n5,671,884 - 5,671,884\nOther\n822,140 129,578 951,718\nTotal contracts with customers\n82,284,438 129,578 82,414,016\nAlternative revenue programs\n1,751,206 - 1,751,206\nTotal operating revenues\n$ 84,035,644 $ 129,578 $ 84,165,222\nGas utility revenues\nSubstantially all of Roanoke Gas revenues are derived from rates authorized by the SCC through its tariffs. Based on its evaluation, the Company has concluded that these tariff-based revenues fall within the scope of ASC 606. Tariff rates represent the transaction price. Performance obligations created under these tariff-based sales include the cost of natural gas sold to customers (commodity) and the cost of transporting natural gas through the Company's distribution system to customers (delivery). The delivery of natural gas to customers results in the satisfaction of the Companys respective performance obligations over time.\nAll customers are billed monthly based on consumption as measured by metered usage with payments due 20 days from the rendering of the bill. Revenue is recognized as bills are issued for natural gas that has been delivered or transported. In addition, the Company utilizes the practical expedient that allows an entity to recognize the invoiced amount as revenue, if that amount corresponds to the value received by the customer. Since customers are billed tariff rates, there is no variable consideration in the transaction price.\nUnbilled revenue is included in residential and commercial revenues in the preceding table. Natural gas consumption is estimated for the period subsequent to the last billed date and up through the last day of the month. Estimated volumes and approved tariff rates are utilized to calculate unbilled revenue. The following month, the unbilled estimate is reversed, the actual usage is billed and a new unbilled estimate is calculated. The Company obtains metered usage for industrial customers at the end of each month, thereby eliminating any unbilled consideration for these rate classes.\nOther revenues\nOther revenues primarily consist of miscellaneous fees and charges, utility-related revenues not directly billed to utility customers and billings for non-utility activities. Customers are invoiced monthly based on services provided for these activities. The Company utilizes the practical expedient allowing revenue to be recognized based on invoiced amounts. The transaction price is based on a contractually predetermined rate schedule; therefore, the transaction price represents total value to the customer and no variable price consideration exists.\nAlternative revenue program revenues\nARPs, which fall outside the scope of ASC 606, are SCC approved mechanisms that allow for the adjustment of revenues for certain broad, external factors, or for additional billings if the entity achieves certain performance targets. The Company's ARPs include its WNA, which adjusts revenues for the effects of weather temperature variations as compared to the 30-year average; the SAVE Plan over/under collection mechanism, which adjusts revenues for the differences between SAVE Plan revenues billed to customers and the revenues earned, as calculated based on the timing and extent of infrastructure replacement completed during the period; and the RNG over/under collection mechanism, which adjusts revenues similar to the SAVE Plan, but is calculated based on the timing and costs associated with owning, operating and maintaining the RNG facility. These amounts are ultimately collected from, or returned to, customers through future rate changes approved by the SCC.\nCustomer accounts receivable and liabilities\nAccounts receivable, as reflected in the condensed consolidated balance sheets, includes both billed and unbilled customer revenues, as well as amounts that are not related to customers. The balances of customer receivables are provided below:\nCurrent Assets\nCurrent Liabilities\nTrade accounts receivable (1)\nUnbilled revenue (1)\nCustomer credit balances\nCustomer deposits\nSeptember 30, 2022\n$ 3,697,431 $ 1,585,062 $ 1,400,770 $ 1,457,610\nSeptember 30, 2023\n2,782,025 1,240,097 1,972,132 1,476,321\nIncrease (decrease)\n$ (915,406 ) $ (344,965 ) $ 571,362 $ 18,711\n(1) Included in \"Accounts receivable, net\" in the consolidated balance sheet. Amounts shown net of reserve for bad debts.\nThe Company had no significant contract assets or liabilities during the period. Furthermore, the Company did not incur any significant costs to obtain contracts.\n3.\nREGULATORY MATTERS\nThe SCC exercises regulatory authority over the natural gas operations of Roanoke Gas. Such regulation encompasses terms, conditions and rates to be charged to customers for natural gas service, safety standards, service extension and depreciation.\nOn December 2, 2022, Roanoke Gas filed an application with the SCC seeking an $8.55 million annual increase in its non-gas base rates, of which $4.05 million was being recovered through the SAVE Rider. Since the Company was seeking to recover the costs associated with its SAVE Plan through interim non-gas base rates effective January 1, 2023, the Company discontinued its SAVE Plan and Rider for the remainder of the current fiscal year.\nOn December 21, 2022, the SCC issued its Order for Notice and Hearing, which authorized the Company to put its proposed rates into effect, on an interim basis and subject to refund, on January 1, 2023, and set the matter for hearing. In the fourth quarter of fiscal 2023, the Company reached a settlement with the SCC staff on all outstanding issues in the case. Under the terms of the settlement, the Company agreed to an incremental revenue requirement of $7.45 million. The Company agreed to begin billing the new rates effective October 1, 2023. The Company expects to receive the final order on the rate application in late calendar 2023 or early 2024.\nThe Company has recorded a provision for refund, including interest, associated with customer billings for the difference between the interim rates and the settlement rates.\nThe Company filed an application with the SCC for a new, five-year SAVE Plan and Rider on March 31, 2023, seeking recovery of costs associated with an estimated $8.5 million in SAVE eligible investment in fiscal 2024 and an estimated cumulative investment of $49.5 million over the proposed five-year plan period ending September 30, 2028. On July 7, 2023, the SCC Staff filed its report on the Companys SAVE Plan and Rider in which it recommended approval of the $49.5 million, five-year plan with a revenue requirement of approximately $366,000 beginning on October 1, 2023. On August 31, 2023, the SCC approved the new SAVE Plan and Rider with rates effective October 1, 2023.\nOn May 16, 2022, Roanoke Gas announced a cooperative agreement under which Roanoke Gas and the Western Virginia Water Authority would produce commercial quality RNG from biogas produced at the regional water pollution control plant. In August 2022, Roanoke Gas filed an application with the SCC seeking approval of a rate adjustment clause to recover the costs associated with constructing, owning, operating and maintaining the renewable natural gas facility. The application was filed under Chapter 30 of Title 56 of the Code of Virginia. Chapter 30 allows the Company to accrue AFUDC on the RNG project. In connection with the RNG project, Roanoke Gas began accruing AFUDC in fiscal 2022 associated with construction of the facility. The Company has recognized approximately $468,000 of AFUDC since inception of the RNG project. The Company received a final order from the SCC on January 23, 2023 approving the Companys application. The RNG facility became operational in March 2023. The Company began billing customers the RNG rate adjustment on March 1, 2023, at which time the Company ceased recording AFUDC.\nOn May 30, 2023, the Company filed an application with the SCC to update the RNG Rider with an effective date of October 1, 2023. On September 1, 2023, the SCC approved the updated RNG Rider with rates effective October 1, 2023.\nOn June 2, 2022, Roanoke Gas filed an application with the SCC to acquire certain natural gas distribution assets from a local housing authority. Under this application, the Company requested the approval to acquire such facilities at five separate apartment complexes, located in the Companys service territory, that were under housing authority management. Under the proposed plan, the housing authority would renew existing natural gas distribution facilities to include mains, services, and meter installations and then transfer ownership of these facilities to Roanoke Gas. In turn, Roanoke Gas would assume responsibility for the operation and maintenance of these assets and recognize a gain related to the asset acquisition equal to the cost associated with the renewal.\nOn July 19, 2022, the SCC approved the application and on August 4, 2022, the housing authority transferred the assets from two apartment complexes to Roanoke Gas. Roanoke Gas recorded these assets and recognized a pre-tax gain of approximately $219,000 during the fourth quarter of fiscal 2022. On September 29, 2023, the housing authority transferred the assets from one additional apartment complex to Roanoke Gas and the Company recorded a pre-tax gain of approximately $311,000 during the fourth quarter of fiscal 2023. The authority is awaiting future funding to complete the two remaining apartment complexes. The timing of funding and the completion of the asset renewals for these complexes is unknown at this time.\n4.\nSEGMENT INFORMATION\nOperating segments are defined as components of an enterprise for which separate financial information is available and is evaluated regularly by the Company's executive management in deciding how to allocate resources and assess performance. The Company uses operating income and equity in earnings to assess segment performance.\nIntersegment transactions are recorded at cost.\nThe reportable segments disclosed herein are defined as follows:\nGas Utility - The natural gas distribution segment of the Company generates revenue from its tariff rates and other regulatory mechanisms through which it provides for the sale and distribution of natural gas to its residential, commercial and industrial customers.\nInvestment in Affiliates - The investment in affiliates segment reflects the income generated through the activities of the Company's investment in MVP and Southgate projects.\nParent and Other - Parent and other include the unregulated activities of the Company as well as certain corporate reporting adjustments.\nInformation related to the segments of the Company are provided below:\nGas Utility\nInvestment in Affiliates\nParent and Other\nConsolidated Total\nFor the Year Ended September 30, 2023:\nOperating revenues\n$ 97,325,307 $ - $ 114,458 $ 97,439,765\nDepreciation\n9,764,678 - - 9,764,678\nOperating income (loss)\n17,827,485 (233,067 ) 84,062 17,678,480\nEquity in earnings\n- 2,084,990 - 2,084,990\nInterest expense\n3,216,220 2,402,585 - 5,618,805\nIncome (loss) before income taxes\n15,260,605 (553,378 ) 83,966 14,791,193\nAs of September 30, 2023:\nTotal assets\n$ 268,664,460 $ 17,882,108 $ 17,182,772 $ 303,729,340\nGross additions to utility property\n25,306,524 - - 25,306,524\nGross investment in affiliates\n- 2,133,534 - 2,133,534\nGas Utility\nInvestment in Affiliates\nParent and Other\nConsolidated Total\nFor the Year Ended September 30, 2022:\nOperating revenues\n$ 84,035,644 $ - $ 129,578 $ 84,165,222\nDepreciation\n8,948,923 - - 8,948,923\nOperating income (loss)\n15,104,946 (281,843 ) 93,572 14,916,675\nEquity in earnings\n- 73,327 - 73,327\nImpairment of investments in affiliates\n- (55,092,303 ) - (55,092,303 )\nInterest expense\n3,001,926 1,496,003 - 4,497,929\nIncome (loss) before income taxes\n13,547,601 (56,784,957 ) 94,109 (43,143,247 )\nAs of September 30, 2022:\nTotal assets\n$ 258,519,230 $ 13,838,108 $ 17,951,905 $ 290,309,243\nGross additions to utility property\n25,461,000 - - 25,461,000\nGross investment in affiliates\n- 5,260,863 - 5,260,863\n5.\nOTHER INVESTMENTS\nMidstream owns a less than 1% equity investment in the LLC constructing the MVP. Midstream is also a less than 1% investor, accounted for under the cost method, in Southgate. Since inception, the MVP has encountered various legal and regulatory issues that have substantially delayed the completion of the project, including a period in 2022 where work on the projected was halted. These events have, at various times, caused the Company to suspend/resume income accruals and/or impair its investment as described more fully below. In May 2023, Midstream agreed with the LLCs managing partner and primary interest owner that the primary interest owner would make Midstreams future capital contributions to the LLC for the MVP project until MVP in-service, as a result of which Midstream's ownership interest percentage in the LLC as it relates to the MVP project has been and will continue to be proportionately adjusted. Legislative and legal actions in the second half of fiscal 2023 enabled project construction to restart.\nWhile under construction, AFUDC has provided the majority of the income recognized by Midstream. The LLC temporarily suspended accruing AFUDC on the project for parts of 2021, 2022, and 2023. AFUDC accruals resumed in June 2023 when construction activities restarted. The amount of AFUDC recognized during the current and prior year is included in the equity in earnings of unconsolidated affiliate in the tables below.\nActions by the Fourth Circuit in the second quarter of fiscal 2022 led to the vacatur and remand of certain permits issued by the Bureau of Land Management and the U.S. Forest Service to the LLC with respect to the Jefferson National Forest and a vacatur and remand of the Biological Opinion and Incidental Take Statement issued by the U.S. Fish and Wildlife Service for the MVP. Primarily due to these unfavorable decisions, Midstream recorded an other-than-temporary decline in value of its investment due to the then increased uncertainty of the completion and commercial operation of MVP and Southgate.\nMidstream estimated the fair value of its investment in the LLC, with the assistance of a valuation specialist, using an income-based approach that primarily considered probability-weighted scenarios of discounted future cash flows based on the estimated project costs at completion and projected revenues. These scenarios reflected assumptions and judgments regarding the ultimate outcome of further matters relating to, or resulting from the Fourth Circuit rulings, as well as various other legal and regulatory matters affecting MVP and Southgate. Such assumptions and judgments also included certain potential additional delays and related cost increases that could result from unfavorable decisions on these proceedings and matters. Midstreams analysis considered probability-weighted growth expectations from additional compression expansion opportunities, how ongoing or new legal and regulatory matters may further delay the completion and increase the total costs of the project and the potential of MVP and Southgate cancellation. As a result of the assessment, Midstream recognized a pre-tax impairment loss of $39.8 million in the second quarter of fiscal 2022. Using a similar process, during the fourth quarter of fiscal 2022, Midstream recognized an additional pre-tax impairment charge of $15.3 million primarily due to increased uncertainty in the permitting process for the MVP project as a result of legal developments and regulatory uncertainties, as well as macroeconomic pressures primarily due to increased interest rates impacting the discount rate.\nMidstream reassesses the value of its investment in the LLC on at least a quarterly basis, and no impairment indicators were identified in fiscal 2023. As noted above, developments in 2023 on the legislative and legal fronts have been favorable. Most notably, in June 2023, the FRA declared the completion of the MVP to be in the national interest and cleared the permitting and regulatory impediments. It also divested courts of jurisdiction to review agency actions on approvals necessary for MVP construction and initial operation. In July 2023, SCOTUS lifted certain stays and cleared judicial impediments. Construction work was restarted and the current target from the project's managing partner is that the MVP will be completed in the first calendar quarter of 2024. Together, these actions have significantly increased the Companys assessment of the probability of a successful project with a corresponding increase to fair value. While the outlook for completion is decidedly more favorable than a year ago, the MVP project is not yet completed and adverse developments, as well as potential macroeconomic factors related to interest rates, cost increases, or other unanticipated events could erode fair value leading to new indicators or impairment.\nThe fair value of the investment in the LLC in fiscal 2022 was determined under a Level 3 measurement considering the significant assumptions and judgments required in estimating the fair value of the Company's investment in the LLC. Investment balances of MVP and Southgate, as of September 30, 2023 and 2022, are reflected in the table below.\nFunding for Midstream's investments has been provided through two variable rate, unsecured promissory notes which mature in June 2024, under a non-revolving credit agreement maturing in December 2024 and three additional notes as detailed in Note 7, as well as by equity contributions from Resources. The Company expects to refinance the maturing notes in 2024.\nThe Company will participate in the earnings generated from the transportation of natural gas through both pipelines proportionate to its level of investment once the pipelines are placed in service.\nThe investments in the LLC are included in the consolidated financial statements as follows:\nSeptember 30\nBalance Sheet location:\nOther Assets:\nMVP\n$ 17,096,476 $ 13,689,370\nSouthgate\n90,617 83,705\nInvestment in unconsolidated affiliates\n$ 17,187,093 $ 13,773,075\nCurrent Liabilities:\nMVP\n$ - $ 804,404\nSouthgate\n- 102\nCapital contributions payable\n$ - $ 804,506\nYears Ended September 30\nIncome Statement location:\nEquity in earnings of unconsolidated affiliate\n$ 2,084,990 $ 73,327\nSeptember 30\nUndistributed earnings, net of income taxes, of MVP in retained earnings, excluding impairment\n$ 9,683,797 $ 8,135,482\nThe change in the investment in unconsolidated affiliates is provided below:\nSeptember 30\nCash investment\n$ 2,133,534 $ 5,260,863\nChange in accrued capital calls\n(804,506 ) (1,336,131 )\nPre-tax impairment\n- (55,092,303 )\nEquity in earnings of unconsolidated affiliate\n2,084,990 73,327\nChange in investment in unconsolidated affiliates\n$ 3,414,018 $ (51,094,244 )\nSummary unaudited financial statements of MVP are presented below. Southgate financial statements, which are accounted for under the cost method, are not included:\nIncome Statements\nYears Ended September 30\nAFUDC\n$ 203,721,584 $ 6,883,069\nNet other income\n2,091,886 147,154\nNet income\n$ 205,813,470 $ 7,030,223\nBalance Sheets\nSeptember 30\nAssets:\nCurrent assets\n$ 795,787,358 $ 76,474,981\nConstruction work in progress\n7,499,128,254 6,667,146,408\nOther assets\n11,639,586 8,021,877\nTotal assets\n$ 8,306,555,198 $ 6,751,643,266\nLiabilities and Equity:\nCurrent liabilities\n$ 236,947,158 $ 115,061,723\nCapital\n8,069,608,040 6,636,581,543\nTotal liabilities and equity\n$ 8,306,555,198 $ 6,751,643,266\n6.\nLINE-OF-CREDIT\nOn March 24, 2023, Roanoke Gas entered into an unsecured Revolving Note in the principal amount of $25 million. The Revolving Note replaced an unsecured line-of-credit dated March 31, 2022 and will mature on March 31, 2024. The Revolving Note's variable interest is based upon Term SOFR plus 110 basis points and provides multiple tier borrowing limits to accommodate seasonal borrowing demands. The Company's total borrowing limits during the term of the Revolving Note range from $4 million to $25 million. As of September 30, 2023, the Company had an outstanding balance of $4,353,572 under the Revolving Note.\nThe Company's total available borrowing limits for the remaining term are as follows:\nAvailable\nAs of\nLine-of-Credit\nSeptember 30, 2023\n$ 13,000,000\nOctober 1, 2023\n22,000,000\nDecember 1, 2023\n25,000,000\nA summary of the line-of-credit follows:\nSeptember 30\nAvailable line-of-credit at year-end\n$ 13,000,000 $ 28,000,000\nOutstanding balance at year-end\n4,353,572 -\nHighest month-end balance outstanding\n9,990,114 19,636,179\nAverage daily balance\n1,877,527 6,233,620\nAverage rate of interest during year on outstanding balances\n5.16 % 1.15 %\nInterest rate at year-end\n6.43 % 4.08 %\nInterest rate on unused line-of-credit\n0.15 % 0.15 %\n7.\nLONG-TERM DEBT\nOn June 28, 2023, Midstream amended and restated its $14 million and $8 million Term Notes initially entered into on June 12, 2019 and November 1, 2021, respectively. The amendments revised each of the original Term Note's interest rate from LIBOR plus 115 basis points to Daily Simple SOFR plus 126.448 basis points, effective July 1, 2023. All other terms and requirements of the Term Notes were retained. In conjunction with the amendment of the Term Notes, Midstream also amended the corresponding interest rate swaps associated with the Term Notes. The amendments provided for the floating rates on the interest rate swaps to continue to match the rate of the associated notes as well as retain the overall fixed interest rates of 3.24% and 2.443%, respectively.\nOn March 24, 2023, Roanoke Gas amended and restated the $10 million Term Note originally entered into on September 24, 2021. The amendment revised the original Term Note's interest rate from LIBOR plus 100 basis points to Term SOFR plus 100 basis points. All other terms and requirements of the original Term Note were retained. The effective date of the Amended Term Note was April 1, 2023. In addition, on April 3, 2023, the interest rate swap was amended to align with the Amended Term Note and retained the fixed interest rate of 2.49%. In connection with the Revolving Note as referenced in Note 6 and Amended Term Note, Roanoke Gas also amended and restated the Loan Agreement dated September 24, 2021. The amendment provides for borrowing limits on the Revolving Note and amends certain financial conditions required of Roanoke Gas and Resources. All other terms and requirements of the original Loan Agreement were retained.\nOn March 31, 2022, Midstream applied $10 million from a cash infusion received from Resources to pay down a corresponding amount on the non-revolving credit facility which in turn reduced the total borrowing capacity from $33 million to $23 million. On June 30, 2022, Midstream entered into the Fourth Amendment to Credit Agreement and related Promissory Notes. The Fourth Amendment modified the original Credit Agreement and prior amendments by replacing the 30-day LIBOR plus 1.35% interest on the Promissory Notes with Term SOFR plus 1.50%. On July 28, 2023, Midstream entered into the Fifth Amendment to Credit Agreement and related Promissory Notes. The Fifth Amendment revised the interest rate from Term SOFR plus 1.50% to Term SOFR plus 2.00% and extended the maturity date of the Promissory Notes to December 31, 2024. All other terms and requirements remain unchanged.\nLong-term debt consisted of the following:\nSeptember 30\nPrincipal\nUnamortized Debt Issuance Costs Principal\nUnamortized Debt Issuance Costs\nRoanoke Gas:\nUnsecured senior notes payable at 4.26%, due September 18, 2034\n$ 30,500,000 $ 106,195 $ 30,500,000 $ 115,849\nUnsecured term notes payable at 3.58%, due October 2, 2027\n8,000,000 19,264 8,000,000 24,080\nUnsecured term notes payable at 4.41%, due March 28, 2031\n10,000,000 23,495 10,000,000 26,627\nUnsecured term notes payable at 3.60%, due December 6, 2029\n10,000,000 22,017 10,000,000 25,539\nUnsecured term note payable at 30-day SOFR plus 1.20%, due August 20, 2026 (swap rate at 2.00%)\n15,000,000 - 15,000,000 -\nUnsecured term note payable at TERM SOFR plus 1.00%, due October 1, 2028 (swap rate at 2.49%)\n10,000,000 33,666 10,000,000 28,674\nMidstream:\nUnsecured term notes payable at TERM SOFR plus 2.00%, due December 31, 2024\n23,000,000 23,386 21,896,200 18,553\nUnsecured term note payable at Daily Simple SOFR plus 1.26448%, due June 12, 2026 (swap rate at 3.24%)\n14,000,000 6,621 14,000,000 9,029\nUnsecured term note payable at 30-day LIBOR plus 1.20%, due June 1, 2024 with monthly principal installments of $41,667 that began July 1, 2022 (swap rate at 3.14%)\n9,375,000 1,571 9,875,000 3,929\nUnsecured term note payable at Daily Simple SOFR plus 1.26448%, due January 1, 2028 with quarterly principal installments of $400,000 that began April 1, 2023 (swap rate at 2.443%)\n7,200,000 19,057 8,000,000 23,631\nTotal long-term debt\n$ 137,075,000 $ 255,272 $ 137,271,200 $ 275,911\nLess: current maturities of long-term debt\n(10,975,000 ) - (1,300,000 ) -\nTotal long-term debt, net current maturities\n$ 126,100,000 $ 255,272 $ 135,971,200 $ 275,911\nDebt issuance costs are amortized over the life of the related debt. As of September 30, 2023 and 2022, the Company also had an unamortized loss on the early retirement of debt of $1,256,059 and $1,370,246, respectively, which has been deferred as a regulatory asset and is being amortized over a 20-year period.\nAll of the debt agreements set forth certain representations, warranties and covenants to which the Company is subject, including financial covenants that limit consolidated long-term indebtedness to not more than 65% of total capitalization. All of the debt agreements provide for priority indebtedness to not exceed 15% of consolidated total assets. The $15 million and $10 million notes, as well as the line-of-credit, have an interest coverage ratio requirement of not less than 1.5 to 1, which excludes the effect of a non-cash impairment on the LLC investments up to the total investment as of December 31, 2021, as revised by the Seventh Amendment to the Credit Agreement. The Company was in compliance with all debt covenants as of September 30, 2023 and 2022.\nThe aggregate annual maturities of long-term debt for the next five years ending after September 30, 2023 are as follows:\nYear Ending September 30\nMaturities\n$ 10,975,000\n24,600,000\n30,600,000\n1,600,000\n8,800,000\nThereafter\n60,500,000\nTotal\n$ 137,075,000\n8.\nINCOME TAXES\nUnder the provisions of ASC 740, the deferred tax assets and liabilities of the Company were revalued in fiscal 2018 to reflect the reduction in the corporate federal income tax rate. As a result of the revaluation, the excess deferred income taxes of the regulated operations of Roanoke Gas were reclassified to a regulatory liability. The excess deferred taxes related to the depreciable property are being returned to customers over the remaining weighted average useful life of the property with a corresponding reduction in income tax expense. The excess deferred taxes related to the other regulatory basis differences are being collected from customers over a five-year period.\nDuring fiscal 2022, the Company engaged an outside firm to conduct a study of its activities that would qualify for the Research and Development (\"R&D\") credit under 26 U.S. Code § 41 - Credit for increasing research activities. Upon completion of the 2022 study, the Company filed for the R&D tax credit on its fiscal 2021 federal income tax return. The total credits claimed on the fiscal 2021 income tax return amounted to $659,920. The Company deferred the tax credits as a regulatory liability because they related to utility plant. These credits are being amortized over the 20-year tax-life of the related utility plant. The Company recognized $129,600 and $165,652 of amortization as reduction of income tax expense on the consolidated statements of income in fiscal 2023 and 2022, respectively, related to the federal R&D tax credits. The Company has not yet completed a study of R&D activities for fiscal 2023 given the IRS audits in process, as discussed further below. Additionally, during fiscal 2023, the Company received refunds for the 2020 and 2021 tax years, neither of which are subject to the IRS audits.\nDuring fiscal 2022, the Company also applied for a Virginia State tax credit related to the R&D study for its fiscal 2021 tax year. The total credits claimed on the fiscal 2022 tax return were $58,065. Consistent with the treatment of the federal tax credits, the Company deferred the tax credits as a regulatory liability, which are being amortized over the 20-year tax-life of the related utility plant. The Company recognized $2,020 and $5,212 of amortization as a reduction of income tax expense on the consolidated statements of income in fiscal 2023 and 2022, respectively, related to the state R&D tax credits. The Company did not apply for a Virginia State tax credit related to R&D for fiscal 2023 given the IRS audits in process, as discussed further below.\nIn accordance with the SCC settlement agreement in relation to the Companys non-gas rate application, the amortization of the R&D tax credit was halted effective August 1, 2023. After resolution of the IRS audits, the Company will proceed with refunding the R&D tax credits, net of related fees, to customers through a mechanism to be approved by the SCC. As part of the settlement, the Company grossed up the tax credit consistent with treatment of the excess deferred taxes, thereby creating a deferred tax asset of $990,219 as of September 30, 2023.\nDuring fiscal 2023, the Company engaged an outside firm to conduct a study of its RNG facility to determine eligibility for the Federal Energy Investment Tax Credit under 26 U.S. Code § 48 - Energy credit (RNG tax credit). Upon completion of the study, the Company determined a credit in the amount of $1,892,164 to be claimed on the fiscal 2023 tax return. Similar to the treatment of the R&D tax credits, the Company deferred the RNG tax credit as a regulatory liability, which is being amortized over the 20-year tax-life of the related asset. Further, as part of the SCC order approving the RNG project and corresponding rates charged to customers, any tax credits attributable to the RNG project are to be used to reduce the cost to customers through the RNG Rider. Accordingly, the Company grossed up the RNG tax credit consistent with treatment of the excess deferred taxes, thereby creating a deferred tax asset of $655,862, which is also being amortized over the 20-year tax-life of the related asset. The Company recognized $74,265 of amortization as part of income tax expense on the consolidated statement of income in fiscal 2023 related to the federal RNG tax credit.\nThe details of income tax expense (benefit) are as follows:\nYears Ended September 30\nCurrent income taxes:\nFederal\n$ 2,935,052 $ 2,494,942\nState\n650,238 523,571\nTotal current income taxes\n3,585,290 3,018,513\nDeferred income taxes:\nFederal\n(223,862 ) (11,160,425 )\nState\n262,103 (3,097,869 )\nTotal deferred income taxes\n38,241 (14,258,294 )\nAmortization of R&D tax credits:\nFederal\n(129,600 ) (165,652 )\nState\n(2,020 ) (5,212 )\nTotal amortization of R&D tax credits\n(131,620 ) (170,864 )\nTotal income tax expense (benefit)\n$ 3,491,911 $ (11,410,645 )\nIncome tax expense for the years ended September 30, 2023 and 2022 differed from amounts computed by applying the U.S. federal income tax rate to earnings before income taxes due to the following:\nYears Ended September 30\nIncome (loss) before income taxes\n$ 14,791,193 $ (43,143,247 )\nCorporate federal income tax rate\n21 % 21 %\nIncome tax expense (benefit) computed at the federal statutory rate\n$ 3,106,151 $ (9,060,082 )\nState income taxes, net of federal income tax expense (benefit)\n720,749 (2,033,695 )\nNet amortization of excess deferred taxes on regulated operations\n(162,228 ) (162,228 )\nAmortization of R&D tax credits\n(131,620 ) (170,864 )\nNet amortization of RNG tax credits\n(58,669 ) -\nOther, net\n17,528 16,224\nTotal income tax expense (benefit)\n$ 3,491,911 $ (11,410,645 )\nThe tax effects of temporary differences that give rise to the deferred tax assets and deferred tax liabilities are as follows:\nSeptember 30\nDeferred tax assets:\nAllowance for credit losses\n$ 39,938 $ 95,564\nAccrued pension and postretirement medical benefits\n591,841 486,745\nRegulatory effect of change in federal income tax rate\n2,655,951 2,708,809\nAccrued paid time off\n149,087 150,075\nCost of gas held in storage\n752,989 702,040\nDeferred compensation\n1,020,512 993,079\nAccrued gas cost\n- 125,888\nMVP impairment\n14,180,759 14,180,759\nRegulatory effect on tax credits\n1,662,400 -\nOther\n263,971 124,034\nTotal gross deferred tax assets\n21,317,448 19,566,993\nDeferred tax liabilities:\nUtility property\n19,426,513 19,074,085\nMVP investment\n1,288,104 1,366,157\nInterest rate swaps\n1,188,533 1,235,126\nAccrued gas cost\n259,162 -\nTotal gross deferred tax liabilities\n22,162,312 21,675,368\nNet deferred tax asset\n1,163,594 1,057,079\nNet deferred tax liability\n$ 2,008,458 $ 3,165,454\nDeferred tax assets and liabilities are recorded on the consolidated balance sheets on a net basis by taxing jurisdictions. As of September 30, 2023 and 2022, the Company's consolidated balance sheets included net deferred tax liabilities of $2,008,458 and $3,165,454, respectively, in deferred credits and other non-current liabilities and net deferred tax assets of $1,163,594 and $1,057,079, respectively, in other non-current assets.\nASC 740 provides for the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recognized in the financial statements. The Company has evaluated its tax positions and accordingly has not identified any significant uncertain tax positions. The Companys policy is to classify interest associated with uncertain tax positions as interest expense in the financial statements. Penalties are netted against other income.\nThe Company files a consolidated federal income tax return and state income tax returns in Virginia and West Virginia, and thus subject to examinations by federal and state tax authorities. The IRS is currently examining the Company's 2018 and 2019 federal tax returns. The Company does not have any indication at this time of the outcome. The Company believes its income tax assets and liabilities are fairly stated as of September 30, 2023 and 2022; however, these assets and liabilities could be adjusted as a result of this examination. With the amendment of the federal returns for fiscal 2017, 2018 and 2019, these years will remain open for IRS examination for one more year. Aside from these exceptions, the federal returns and the state returns for Virginia for the tax years ended prior to September 30, 2018 are no longer subject to examination. The state returns for West Virginia prior to September 30, 2020 are no longer subject to examination.\n9.\nEMPLOYEE BENEFIT PLANS\nThe Company sponsors both a noncontributory pension plan and a postretirement plan. The pension plan covers all employees hired prior to January 2017 and benefits fully vest after 5 years of credited service. Benefits paid to retirees are based on age at retirement, years of service and average compensation. Effective January 1, 2017, a \"soft freeze\" to the pension plan was implemented, and employees hired on or after that date are no longer eligible to participate. Commensurate with the \"soft freeze\" in the pension plan, the Company amended its 401(k) Plan, allowing management to authorize a discretionary contribution to the 401(k) account for those employees hired on or after January 1, 2017. The amount, if any, of this discretionary contribution would be determined each year and would be applied to the eligible employees in the following calendar year. This Company contribution would be in addition to any employee elected deferrals and employer match as provided for under the 401(k) Plan.\nThe postretirement plan provides certain health care, supplemental retirement and life insurance benefits to retired employees who meet specific age and service requirements. Employees hired prior to January 1, 2000 are eligible to participate in the postretirement plan. Employees must have a minimum of 10 years of service and retire after attaining the age of 55 in order to vest in the postretirement plan. Retiree contributions to the plan are based on the number of years of service to the Company as determined under the pension plan.\nEmployers who sponsor defined benefit plans must recognize the funded status of defined benefit pension and other postretirement plans as an asset or liability in their statements of financial position and recognize changes in that funded status in the year in which the changes occur through comprehensive income. For pension plans, the benefit obligation is the projected benefit obligation, and for other postretirement plans, the benefit obligation is the accumulated benefit obligation. The Company established a regulatory asset for the portion of the obligation expected to be recovered through rates in future periods. The regulatory asset is adjusted for the recognition of actuarial gains and losses. The portion of the obligation attributable to the unregulated operations of the holding company is recognized in other comprehensive income, with actuarial gains and losses recognized using the corridor method.\nThe following table sets forth the benefit obligation, fair value of plan assets, the funded status of the plans, and amounts recognized in the Companys consolidated financial statements:\nPension Plan\nPostretirement Plan\nAccumulated benefit obligation\n$ 24,449,856 $ 24,776,968 $ 11,248,448 $ 12,416,546\nChange in benefit obligation:\nBenefit obligation at beginning of year\n$ 27,268,456 $ 37,654,468 $ 12,416,546 $ 16,796,849\nService cost\n366,537 648,289 45,897 97,802\nInterest cost\n1,372,098 1,013,115 620,622 443,721\nActuarial gain\n(1,031,160 ) (10,862,957 ) (1,331,541 ) (4,330,387 )\nBenefit payments, net of retiree contributions\n(1,228,307 ) (1,184,459 ) (503,076 ) (591,439 )\nBenefit obligation at end of year\n$ 26,747,624 $ 27,268,456 $ 11,248,448 $ 12,416,546\nChange in fair value of plan assets:\nFair value of plan assets at beginning of year\n$ 28,017,797 $ 38,914,107 $ 12,138,119 $ 15,882,342\nActual return on plan assets, net of taxes\n89,171 (9,711,851 ) 1,384,270 (3,152,784 )\nEmployer contributions\n- - - -\nBenefit payments, net of retiree contributions\n(1,228,307 ) (1,184,459 ) (503,076 ) (591,439 )\nFair value of plan assets at end of year\n$ 26,878,661 $ 28,017,797 $ 13,019,313 $ 12,138,119\nFunded status\n$ 131,037 $ 749,341 $ 1,770,865 $ (278,427 )\nAmounts recognized in the consolidated balance sheet consist of:\nNon-current assets\n$ 131,037 $ 749,341 $ 1,770,865 $ -\nNon-current liabilities\n- - - (278,427 )\nAmounts recognized in accumulated other comprehensive income:\nNet actuarial loss, net of tax\n$ 1,168,687 $ 1,243,889 $ 6,946 $ 355,088\nTotal amounts included in accumulated other comprehensive income, net of tax\n$ 1,168,687 $ 1,243,889 $ 6,946 $ 355,088\nAmounts deferred to a regulatory asset (liability):\nNet actuarial loss (gain)\n$ 4,029,282 $ 4,132,472 $ (1,813,071 ) $ (30,118 )\nAmounts recognized as regulatory assets (liabilities)\n$ 4,029,282 $ 4,132,472 $ (1,813,071 ) $ (30,118 )\nThe Company expects that approximately $64,000, before tax, of AOCI will be recognized in net periodic benefit costs in fiscal 2024 and approximately $243,000 of amounts deferred as regulatory assets and approximately $31,000 of amounts deferred as regulatory liabilities will be amortized and recognized in net periodic benefit costs in fiscal 2024.\nThe reduction in the benefit obligations for both the pension plan and postretirement plan was primarily attributed to actuarial gains resulting from the increase in the discount rate used to calculate the benefit obligations.\nThe following table details the actuarial assumptions used in determining the projected benefit obligations and net benefit cost of the pension plan and the accumulated benefit obligations and net benefit cost of the postretirement plan:\nPension Plan\nPostretirement Plan\nAssumptions used to determine benefit obligations:\nDiscount rate\n5.63 % 5.15 % 5.63 % 5.16 %\nExpected rate of compensation increase\n4.00 % 4.00 % N/A N/A\nAssumptions used to determine benefit costs:\nDiscount rate\n5.15 % 2.73 % 5.16 % 2.70 %\nExpected long-term rate of return on plan assets\n4.50 % 4.75 % 3.95 % 4.24 %\nExpected rate of compensation increase\n4.00 % 4.00 % N/A N/A\nTo develop the expected long-term rate of return on plan assets assumption, the Company, with input from the Plans' actuaries and investment advisors, considered the historical returns and the future expectations for returns for each asset class, as well as the target asset allocation of each plans portfolio.\nComponents of net periodic benefit cost are as follows:\nPension Plan\nPostretirement Plan\nService cost\n$ 366,537 $ 648,289 $ 45,897 $ 97,802\nInterest cost\n1,372,098 1,013,115 620,622 443,721\nExpected return on plan assets\n(1,232,597 ) (1,831,550 ) (464,046 ) (666,167 )\nRecognized loss\n316,724 146,402 - -\nNet periodic benefit cost\n$ 822,762 $ (23,744 ) $ 202,473 $ (124,644 )\nService cost is included in operations and maintenance expense in the consolidated statements of income. All other components of net periodic benefit costs are included in other income, net in the consolidated statements of income.\nThe assumed health care cost trend rates used in measuring the accumulated benefit obligation for the postretirement plan are presented below:\nPre 65\nPost 65\nHealth care cost trend rate assumed for next year\n6.30 % 6.00 % 5.20 % 5.20 %\nRate to which the cost trend is assumed to decline (the ultimate trend rate)\n3.94 % 5.20 % 3.94 % 5.20 %\nYear that the rate reaches the ultimate trend rate\nThe health care cost trend rate assumptions could have a significant effect on the amounts reported. A change of 1% would have the following effects:\n1% Increase\n1% Decrease\nEffect on total service and interest cost components\n$ 89,000 $ (74,000 )\nEffect on accumulated postretirement benefit obligation\n1,317,000 (1,117,000 )\nThe primary objectives of both plans' investment policies are to maintain investment portfolios that diversify risk through prudent asset allocation parameters, achieve asset returns that meet or exceed the corresponding actuarial assumptions and will provide for future benefits. The Company's pension plan allocation approach seeks to match the duration of the fixed income portion of the portfolio with the duration of the plan's liabilities. Such allocation is designed to reduce the overall volatility in the pension plan relative to the funded status. In fiscal 2023, the Company increased the targeted fixed income allocation for the pension investments from 70% to 75% and decreased the equity allocation from 30% to 25% to better align the assets with the duration of plan liabilities. The Company also reduced the targeted equity investment allocation in postretirement plan from 50% to 30% and increased the fixed income allocation from 50% to 70%. The investment advisor is transitioning each of the investment portfolios to the updated targets as market conditions warrant. The equity allocations in both plans provide for potential returns to offset growth in the corresponding liabilities.\nBased on its most recent evaluation of returns for the asset classes within each plan's investment portfolio, the Company set the expected long-term rate of return for the pension plan and the postretirement plan for fiscal 2024 at 4.50% and 4.24%, respectively.\nThe Companys target and actual asset allocation in the pension and postretirement plans as of September 30, 2023 and 2022 were:\nPension Plan\nPostretirement Plan\nTarget\nTarget\nAsset category:\nEquity securities\n25 % 27 % 13 % 30 % 43 % 48 %\nDebt securities\n75 % 72 % - % 70 % 37 % 51 %\nCash\n- % 1 % 87 % - % 20 % 1 %\nThe plans assets are invested in mutual funds and common and collective investment trust (\"CIT\") funds that function like mutual funds. On September 30, 2022, the Company was in the process of transitioning to new investment advisors for the pension plan. The mutual funds in the pension plan were unaffected by this change; however, the CITs were required to be re-registered and assigned new account numbers. As a result, the CIT funds were liquidated on September 30, 2022 and reinvested in the same investments on October 3, 2022. Absent the re-registration process, the investment allocation would have been 29% equity, 70% fixed income and 1% cash on September 30, 2022.\nThe Company uses the fair value hierarchy described in Note 1 to classify these assets. The mutual funds are included under Level 1 in the fair value hierarchy as their fair values are based on quoted net asset values of the shares held in the investments in the plans. The CIT funds are included under Level 2 as these investments have observable Level 2 pricing inputs, including quoted prices for similar assets in active or non-active markets. While the underlying asset values are quoted prices, the net asset value of a unit in these funds is not publicly quoted. The following tables contain the fair value classifications of the plans' assets:\nPension Plan\nFair Value Measurements - September 30, 2023\nFair Value\nLevel 1\nLevel 2\nLevel 3\nAsset Class:\nCash\n$ 202,218 $ 202,218 $ - $ -\nCommon and Collective Trust and Pooled Funds:\nBonds\nLiability Driven Investment\n16,446,813 - 16,446,813 -\nMutual Funds:\nDomestic Fixed Income\n3,000,525 3,000,525 - -\nEquities\nDomestic Large Cap Growth\n2,256,767 2,256,767 - -\nDomestic Large Cap Value\n2,222,733 2,222,733 - -\nDomestic Small/Mid Cap Core\n1,082,801 1,082,801 - -\nForeign Large Cap Growth\n481,309 481,309 - -\nForeign Large Cap Value\n463,907 463,907 - -\nForeign Large Cap Core\n721,588 721,588 - -\nTotal\n$ 26,878,661 $ 10,431,848 $ 16,446,813 $ -\nPension Plan\nFair Value Measurements - September 30, 2022\nFair Value\nLevel 1\nLevel 2\nLevel 3\nAsset Class:\nCash\n$ 24,312,969 $ 24,312,969 $ - $ -\nMutual Funds:\nEquities\nDomestic Large Cap Growth\n1,172,296 1,172,296 - -\nDomestic Large Cap Value\n1,172,714 1,172,714 - -\nForeign Large Cap Growth\n486,184 486,184 - -\nForeign Large Cap Core\n873,634 873,634 - -\nTotal\n$ 28,017,797 $ 28,017,797 $ - $ -\nPostretirement Plan\nFair Value Measurements - September 30, 2023\nFair Value\nLevel 1\nLevel 2\nLevel 3\nAsset Class:\nCash\n$ 2,640,622 $ 2,640,622 $ - $ -\nMutual Funds:\nBonds\nDomestic Fixed Income\n4,841,048 4,841,048 - -\nEquities\nDomestic Large Cap Growth\n1,693,422 1,693,422 - -\nDomestic Large Cap Value\n1,570,538 1,570,538 - -\nDomestic Small/Mid Cap Core\n588,898 588,898 - -\nForeign Large Cap Growth\n433,886 433,886 - -\nForeign Large Cap Value\n526,364 526,364 - -\nForeign Large Cap Core\n724,535 724,535 - -\nTotal\n$ 13,019,313 $ 13,019,313 $ - $ -\nPostretirement Plan\nFair Value Measurements - September 30, 2022\nFair Value\nLevel 1\nLevel 2\nLevel 3\nAsset Class:\nCash\n$ 75,219 $ 75,219 $ - $ -\nMutual Funds:\nBonds\nDomestic Fixed Income\n5,644,954 5,644,954 - -\nForeign Fixed Income\n589,284 589,284 - -\nEquities\nDomestic Large Cap Growth\n1,698,421 1,698,421 - -\nDomestic Large Cap Value\n1,793,746 1,793,746 - -\nDomestic Small/Mid Cap Growth\n182,823 182,823 - -\nDomestic Small/Mid Cap Value\n202,921 202,921 - -\nDomestic Small/Mid Cap Core\n443,900 443,900 - -\nForeign Large Cap Growth\n469,659 469,659 - -\nForeign Large Cap Value\n462,196 462,196 - -\nForeign Large Cap Core\n574,996 574,996 - -\nTotal\n$ 12,138,119 $ 12,138,119 $ - $ -\nEach mutual fund or common collective trust fund has been categorized based on its primary investment strategy.\nAnnual funding contributions to the pension plan and postretirement plan are made under advisement from the Company's actuaries and investment advisor based upon ERISA funding requirements. For the years ended September 30, 2023 and 2022, no contributions were made to the pension plan or postretirement plan. At this time, the Company is not currently anticipating making any funding contributions to the pension plan or postretirement plan in fiscal 2024.\nThe following table reflects expected future benefit payments:\nPension\nPostretirement\nFiscal year ending September 30\nPlan\nPlan\n$ 1,335,133 $ 713,518\n1,400,453 707,987\n1,486,089 710,935\n1,591,928 724,277\n1,665,580 721,402\n2029 - 2033\n9,316,587 3,957,815\nThe Company established an NQDC Plan in fiscal 2021. The NQDC Plan is an unfunded, nonqualified benefit plan offered to select members of senior management not eligible to participate in the pension plan. Under the NQDC Plan, participants have the right to defer a percentage of base salary as well as receive discretionary credits from the Company. The Company's discretionary credits vest over time. Any benefits distributed from the NQDC Plan are paid from the general assets of the Company. As the plan is unfunded, the balance reflected in the table below is a noncurrent liability included in benefit plan liabilities on the consolidated balance sheet.\nBeginning deferred compensation balance\n$ 59,108 $ 35,344\nEmployer contributions\n- 33,280\nEarnings (loss)\n6,787 (9,516 )\nForfeitures\n(18,221 ) -\nEnding deferred compensation balance\n$ 47,674 $ 59,108\nThe Company sponsors a 401(k) Plan covering all eligible employees who elect to participate. Employees may contribute from 1% to 50% of their annual compensation to the 401(k) Plan, limited to a maximum annual amount as set periodically by the IRS. The Company matches 100% of the participants first 4% of contributions and 50% of the next 2% of contributions. The 401(k) Plan also provides for discretionary contributions for employees hired on or after January 1, 2017. The following table reflects the Company's contributions:\nYears Ended September 30\nMatching contribution\n$ 388,616 $ 357,293\nDiscretionary contribution\n75,899 47,429\n10.\nCOMMON STOCK OPTIONS\nThe KESOP provides for the issuance of common stock options to officers and certain other full-time salaried employees to acquire shares of the Companys common stock. As of September 30, 2023, the number of shares available for future grants was 22,000.\nASC 718, Compensation-Stock Compensation, requires that compensation expense be recognized for the issuance of equity instruments to employees. During the fiscal year ended September 30, 2022, the Board approved stock option grants to certain officers. As required by the KESOP, each option's exercise price per share equaled the fair value of the Company's common stock on the grant date. Pursuant to the plan, the options vest over a six-month period and are exercisable over a ten-year period from the date of issuance. No options were granted during the fiscal year ended September 30, 2023.\nAs the Company's stock options are not traded on the open market, the fair value of each grant is estimated on the date of grant using the Black-Scholes option pricing model including the following assumptions:\nYears Ended September 30\nExpected volatility\nN/A 31.79 %\nExpected dividends\nN/A 2.77 %\nExpected exercise term (years)\nN/A 7\nRisk-free interest rate\nN/A 2.89 %\nThe underlying methods regarding each assumption are as follows:\nExpected volatility is based on the historical volatility of the daily closing price of the Company's common stock.\nExpected dividend rate is based on historical dividend payout trends.\nExpected exercise term is based on the average time historical option grants were outstanding before being exercised.\nRisk-free interest rate is based on the 7-year Treasury rate on the date of option grant.\nForfeitures are recognized when they occur.\nStock option transactions under the Company's plans are summarized below.\nNumber of Shares\nWeighted- Average Exercise Price\nWeighted- Average Remaining Contractual Terms (years)\nAggregate Intrinsic Value(1)\nOptions outstanding, September 30, 2021\n45,250 $ 19.34 6.0 $ 213,898\nOptions granted\n6,000 19.90\nOptions exercised\n(8,750 ) 14.49\nOptions forfeited\n(8,000 ) 27.87\nOptions outstanding, September 30, 2022\n34,500 $ 18.69 5.7 $ 121,278\nOptions exercised\n(12,500 ) 16.00\nOptions outstanding, September 30, 2023\n22,000 $ 20.23 5.6 $ 18,388\nVested and exercisable at September 30, 2023\n22,000 $ 20.23 5.6 $ 18,388\n(1) Aggregate intrinsic value includes only those options where the exercise price is below the market price.\nYears Ended September 30\nWeighted-average grant date option fair value\n$ - $ 5.39\nStock option expense\n21,560 16,330\nIntrinsic value of options exercised\n46,921 58,944\nProceeds from exercise of stock options\n200,000 126,814\n11.\nOTHER STOCK PLANS\nDividend Reinvestment and Stock Purchase Plan\nThe Company offers a DRIP Plan to shareholders of record for the reinvestment of dividends and the purchase of up to $100,000 per year in additional shares of common stock of the Company. Under the DRIP, the Company issued 32,805 and 34,290 shares in 2023 and 2022, respectively. As of September 30, 2023, the Company had 265,624 shares of stock available for issuance under the DRIP.\nRestricted Stock Plan for Outside Directors\nThe Board of Directors of the Company implemented the RSPD in 1997. Under the RSPD, each director may elect annually to have up to 100% of his or her fees paid in shares of common stock (\"Director Restricted Stock\"); however, a minimum of 40% of the monthly retainer fee must be paid to each non-employee director of Resources in shares of Director Restricted Stock until such time as the director has accumulated at least 10,000 shares. The number of shares of Director Restricted Stock awarded each month is determined based on the closing sales price of Resources' common stock on the NASDAQ Global Market on the first business day of the month. The Director Restricted Stock issued under the Plan vests only in the case of a participant's death, disability, retirement, or in the event of a change in control of Resources. The Director Restricted Stock may not be sold, transferred, assigned or pledged by the participant until the shares have vested under the terms of the Plan. The shares of Director Restricted Stock will be forfeited to Resources by a participant's voluntary resignation during his or her term on the Board or removal for cause as a director.\nThe Company assumes all directors will complete their term and there will be no forfeiture of the Director Restricted Stock. Since the inception of the RSPD, no director has forfeited any shares of Director Restricted Stock. The Company recognizes as compensation the market value of the Director Restricted Stock in the period it is issued.\nThe following table reflects the director compensation activity pursuant to the Plan:\nShares\nWeighted-Average Fair Value on Date of Grant\nShares\nWeighted-Average Fair Value on Date of Grant\nBeginning of year balance\n108,127 $ 16.27 110,444 $ 15.05\nGranted\n14,080 21.25 13,538 21.55\nVested\n- - (15,855 ) 12.33\nEnd of year balance\n122,207 $ 16.84 108,127 $ 16.27\nThe fair market value of the Director Restricted Stock included in compensation during fiscal 2023 and 2022 was $299,200 and $291,767, respectively. No Director Restricted Stock was forfeited during fiscal 2023 or 2022. During fiscal 2023, an additional 200,000 shares were registered and added to the RSPD, as authorized and approved by shareholders at the Annual Shareholder meeting on January 23, 2023.\nAs of September 30, 2023, the Company had 196,559 shares available for issuance under the RSPD.\nRGC Resources, Inc. Restricted Stock Plan\nThe Board of Directors of the Company implemented the RSPO in 2017 as approved by shareholders. Under the RSPO, the Compensation Committee of the Board of Directors may grant shares of common stock (\"Officer Restricted Stock\") that vest over time to key employees and officers for the purpose of attracting and retaining those individuals essential to the operation and growth of the Company. The RSPO provides for certain restrictions and non-transferability requirements until minimum levels of ownership are obtained. Such restrictions may continue beyond the vesting period.\nThe Company assumes all officers will complete their requirements and there will be no forfeiture of the Officer Restricted Stock.\nThe following table reflects the officer compensation activity pursuant to the RSPO:\nShares\nWeighted-Average Fair Value on Date of Grant\nShares\nWeighted-Average Fair Value on Date of Grant\nBeginning of year balance\n22,539 $ 23.44 11,836 $ 25.17\nGranted\n- - 26,897 23.19\nVested\n(13,573 ) 23.61 (16,194 ) 24.29\nEnd of year balance\n8,966 $ 23.19 22,539 $ 23.44\nThe fair market value of the Officer Restricted Stock included as compensation during fiscal 2023 and 2022 was $169,879 and $534,710, respectively. As of September 30, 2023, the Company had 366,745 shares available for issuance under the RSPO.\nStock Bonus Plan\nShares from the Stock Bonus Plan may be issued to certain employees and management personnel in recognition of their performance and service. Under the Stock Bonus Plan, the Company issued 105 shares at $23.76 per share in 2023 and no shares in 2022. As of September 30, 2023, the Company had 4,680 shares of stock available for issuance under the Stock Bonus Plan.\n12.\nCOMMITMENTS AND CONTINGENCIES\nLong-Term Contracts\nDue to the nature of the natural gas distribution business, Roanoke Gas enters into agreements with suppliers and pipelines to contract for natural gas commodity purchases, storage capacity and pipeline delivery capacity. Roanoke Gas obtains most of its natural gas supply through a third-party asset management contract. Roanoke Gas utilizes an asset manager to optimize the use of its transportation, storage rights and gas supply inventories, which helps to ensure a secure and reliable source of natural gas. Under the current asset management contract, Roanoke Gas has designated the asset manager to act as agent for its storage capacity and all gas balances in storage. Roanoke Gas retains ownership of gas in storage. Under provisions of this contract, Roanoke Gas is obligated to purchase its winter storage requirements from the asset manager during the spring and summer injection periods at market price. The table below details the volumetric obligations as of September 30, 2023 for the remainder of the contract period. The current asset management contract was renewed in September 2022 for a two-year period which will expire in March 2025. The contract was renewed at essentially the same terms and conditions as the prior agreement, except the utilization fee retained by Roanoke Gas increased.\nNatural Gas Contracts\nYear\n(In DTHs)\n2023-2024\n2,089,220\n2024-2025\n295,866\nTotal\n2,385,086\nIn addition to the volumetric commitment above, the Company also has fixed price agreements to purchase approximately 1.1 million DTH, from October 2023 to March 2024, at prices ranging from $2.75 to $4.57 per DTH.\nRoanoke Gas also has contracts for pipeline and storage capacity which extend for various periods. These capacity costs and related fees are valued at tariff rates in place as of September 30, 2023. These rates may increase or decrease in the future based upon rate filings and rate orders granting a rate change to the pipeline or storage operator. Roanoke Gas expended approximately $44,253,000 and $51,408,000 under the asset management, pipeline and storage contracts in fiscal years 2023 and 2022, respectively. The table below details the pipeline and storage capacity commitments as of September 30, 2023 for the remainder of the contract period.\nPipeline and\nYear\nStorage Capacity\n2023 - 2024\n$ 14,071,706\n2024 - 2025\n10,510,104\n2025 - 2026\n6,604,410\n2026 - 2027\n5,411,934\n2027 - 2028\n2,110,556\nThereafter\n127,196\nTotal\n$ 38,835,906\nRoanoke Gas maintains franchise agreements granted by the local cities and towns served by the Company. Roanoke Gas renewed its franchise agreements with the City of Roanoke, the City of Salem and the Town of Vinton in 2016 for 20-year terms to expire in December 2035. Per these agreements, franchise fees increase at a rate of 3% annually. As of September 30, 2023, $1,942,731 in future obligations remain under the franchise agreements.\nOther Contracts\nThe Company has a contract in place for approximately $1.2 million to complete the two gate stations that interconnect with the MVP.\nThe Company maintains other agreements in the ordinary course of business covering various maintenance, equipment, user fees and service contracts. These agreements currently extend through December 2031 and are not material to the Company.\nEnvironmental Matters\nRoanoke Gas operated an MGP as a source of fuel for lighting and heating until the early 1950s. A by-product of operating the MGP was coal tar, and the potential exists for tar waste contaminants at the former plant site. While the Company does not currently recognize any commitments or contingencies related to environmental costs, should the Company ever be required to remediate the site, it will pursue all prudent and reasonable means to recover any related costs, including the use of insurance claims and regulatory approval for rate case recognition of expenses associated with any work required.\n13.\nFAIR VALUE MEASUREMENTS\nThe following table summarizes the Companys financial assets and liabilities that are measured at fair value on a recurring basis and the fair value measurements by level within the fair value hierarchy as defined in Note 1 as of September 30, 2023 and 2022, respectively:\nFair Value Measurements - September 30, 2023\nQuoted Prices in Active Markets\nSignificant Other Observable Inputs\nSignificant Unobservable Inputs\nFair Value\nLevel 1\nLevel 2\nLevel 3\nAssets:\nInterest rate swaps\n$ 4,617,455 $ - $ 4,617,455 $ -\nTotal\n$ 4,617,455 $ - $ 4,617,455 $ -\nLiabilities:\nNatural gas purchases\n$ 1,022,662 $ - $ 1,022,662 $ -\nTotal\n$ 1,022,662 $ - $ 1,022,662 $ -\nFair Value Measurements - September 30, 2022\nQuoted Prices in Active Markets\nSignificant Other Observable Inputs\nSignificant Unobservable Inputs\nFair Value\nLevel 1\nLevel 2\nLevel 3\nAssets:\nInterest rate swaps\n$ 4,798,467 $ - $ 4,798,467 $ -\nTotal\n$ 4,798,467 $ - $ 4,798,467 $ -\nLiabilities:\nNatural gas purchases\n$ 1,295,225 $ - $ 1,295,225 $ -\nTotal\n$ 1,295,225 $ - $ 1,295,225 $ -\nThe fair value of the interest rate swaps are determined by using the counterparty's proprietary models that include observable quoted market interest rates and interest rate futures as well as certain assumptions regarding past, present and future market conditions.\nSee Note 5 for discussion on the fair value assumptions of the Company's investment in the LLC.\nUnder the asset management contract, a timing difference can exist between the payment for natural gas purchases and the actual receipt of such purchases. Payments are made based on a predetermined monthly volume with the price based on the weighted average first of the month index prices corresponding to the month of the scheduled payment. At September 30, 2023 and 2022, the Company had recorded in accounts payable the estimated fair value of the liability based on the corresponding first of month quoted index prices for which the liability was expected to be settled.\nThe Companys non-financial assets and liabilities that are measured at fair value on a nonrecurring basis consist of its AROs. The AROs are measured at fair value at initial recognition based on expected future cash flows to settle the obligation.\nThe carrying value of cash and cash equivalents, accounts receivable, borrowings under line-of-credit, accounts payable (with the exception of the timing difference under the asset management contract), customer credit balances and customer deposits is a reasonable estimate of fair value due to the short-term nature of these financial instruments. In addition, the carrying amount of the variable rate line-of-credit is a reasonable approximation of its fair value. The following table summarizes the fair value of the Companys financial assets and liabilities that are not adjusted to fair value in the consolidated financial statements as of September 30, 2023 and 2022.\nFair Value Measurements - September 30, 2023\nCarrying\nQuoted Prices in Active Markets\nSignificant Other Observable Inputs\nSignificant Unobservable Inputs\nAmount\nLevel 1\nLevel 2\nLevel 3\nLiabilities:\nCurrent maturities of long-term debt\n$ 10,975,000 $ - $ - $ 10,975,000\nNotes payable\n126,100,000 - - 120,298,658\nTotal\n$ 137,075,000 $ - $ - $ 131,273,658\nFair Value Measurements - September 30, 2022\nCarrying\nQuoted Prices in Active Markets\nSignificant Other Observable Inputs\nSignificant Unobservable Inputs\nAmount\nLevel 1\nLevel 2\nLevel 3\nLiabilities:\nCurrent maturities of long-term debt\n$ 1,300,000 $ - $ - $ 1,300,000\nNotes payable\n135,971,200 - - 130,266,252\nTotal\n$ 137,271,200 $ - $ - $ 131,566,252\nThe fair value of long-term debt is estimated by discounting the future cash flows of the fixed rate debt based on the underlying Treasury rate or other Treasury instrument with a corresponding maturity period and estimated credit spread extrapolated based on market conditions since the issuance of the debt.\nASC 825, Financial Instruments, requires disclosures regarding concentrations of credit risk from financial instruments. Cash equivalents are investments in high-grade, short-term securities (original maturity less than three months), placed with financially sound institutions. Accounts receivable are from a diverse group of customers including individuals and small and large companies in various industries. The Company maintains certain credit standards with its customers and requires a customer deposit if such evaluation warrants.\n14.\nLEASES\nDuring 2023, the Company entered into a land lease in conjunction with its RNG facility that has a 20-year term with two five-year Company renewal options that are not considered part of the ROU asset and liability as the decision to elect options will be made in the future. The Company also has three other operating leases with original terms ranging from 3 to 6 years. The operating lease ROU assets of $361,724 are reflected in other non-current assets in the consolidated balance sheets. The current operating lease liabilities of $30,281 and non-current lease liabilities of $323,168 are included in other current liabilities and deferred credits and other non-current liabilities, respectively, in the consolidated balance sheets. The cost components of the Companys operating leases are included under operations and maintenance expense in the consolidated statements of income and were less than $50,000 for each period presented.\nOther information related to leases were as follows:\nSupplemental Cash Flow Information:\nCash paid on operating leases\n$ 48,900 $ 22,500\nRight of use obtained in exchange for operating lease obligations\n325,688 -\nWeighted-average remaining term (in years)\n17.4 3.1\nWeighted-average discount rate\n5.65 % N/A\nOn September 30, 2023, the future minimum rental payments under non-cancelable operating leases were as follows:\n$ 49,065\n43,065\n30,038\n30,038\n26,400\nThereafter\n369,600\nTotal minimum lease payments\n548,206\nLess imputed interest\n(194,757 )\nTotal\n$ 353,449\n15.\nSUBSEQUENT EVENTS\nThe Company has evaluated subsequent events through the date the financial statements were issued. There were no other items not otherwise disclosed which would have materially impacted the Companys consolidated financial statements. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone.   Item 10. Directors, Executive Officers and Corporate Governance.\nFor information with respect to the executive officers of the registrant, see Executive Officers\" section in the Proxy Statement for the 2024 Annual Meeting of Shareholders of Resources incorporated herein by reference. For information with respect to the Companys directors and nominees and the Companys Audit Committee, see Proposal 1 Election of Directors of Resources and Report of the Audit Committee, respectively, in the Proxy Statement for the 2024 Annual Meeting of Shareholders of Resources, which information is incorporated herein by reference. In addition, the Board of Directors has determined that Abney S. Boxley, III and Jacqueline L. Archer are audit committee financial experts under applicable SEC rules.\nFor information regarding the process for identifying and evaluating candidates to be nominated as directors, see \"Director Nominations\" in the Proxy Statement for the 2024 Annual Meeting of Shareholders of Resources, which is incorporated herein by reference.\nInformation with respect to compliance with Section 16(a) of the Exchange Act, which is set forth under the caption \"Delinquent Section 16(a) Reports\" in the Proxy Statement for the 2024 Annual Meeting of Shareholders of Resources, is incorporated herein by reference.\nThe Company has adopted a Code of Ethics applicable to all of its officers, directors and employees. The Company has posted the text of its Code of Ethics on its website at www.rgcresources.com. The Board of Directors has adopted charters for the Audit, Compensation, and Governance and Nominating Committees of the Board of Directors. These documents may also be found on the Companys website at www.rgcresources.com. Item 11. Executive Compensation.\nThe information set forth under \"Compensation of Directors\", \"Compensation Discussion and Analysis\" and \"Report of the Compensation Committee\" in the Proxy Statement for the 2024 Annual Meeting of Shareholders of Resources is incorporated herein by reference. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nFor information pertaining to securities authorized for issuance under equity compensation plans, see Part II, Item 5 above.\nThe information pertaining to shareholders beneficially owning more than five percent of the registrants common stock and the security ownership of management, which is set forth under the caption Security Ownership of Certain Beneficial Owners and Management\" in the Proxy Statement for the 2024 Annual Meeting of Shareholders of Resources, is incorporated herein by reference. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe information pertaining to director independence is set forth under the caption Board of Directors and Committees of the Board of Directors and pertaining to transactions with related persons is set forth under the caption \"Transactions with Related Persons\" in the Proxy Statement for the 2024 Annual Meeting of Shareholders of Resources, which information is incorporated herein by reference. Item 14. Principal Accounting Fees and Services.\nThe information set forth under the caption \"Report of the Audit Committee\" in the Proxy Statement for the 2024 Annual Meeting of Shareholders of Resources is incorporated herein by reference.\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n(a) List of documents filed as part of this report:\n1. Financial statements filed as part of this report:\nAll financial statements of the registrant as set forth under Item 8 of this Report on Form 10-K.\n2. Financial statement schedules filed as part of this report:\nAll information is inapplicable or presented in the consolidated financial statements or related notes thereto.\n3. Exhibits.\n1 (a)\nAt Market Issuance Sales Agreement, dated March 5, 2020, between RGC Resources, Inc. and Janney Montgomery Scott LLC, as agent (incorporated herein by reference to Exhibit 1.1 on Form 8-K as filed March 5, 2020)\n3 (a)\nArticles of Incorporation as amended (incorporated herein by reference to Exhibit 3.1 on Form 8-K as filed February 5, 2020)\n3 (b)\nAmended and Restated Bylaws of RGC Resources, Inc. (incorporated herein by reference to Exhibit 3(b) on Form 8-K as filed on April 8, 2022)\n4 (a)\nSpecimen copy of certificate for RGC Resources, Inc. common stock, $5.00 par value (incorporated herein by reference to Exhibit 4(a) of Registration Statement No. 33-67311, on Form S-4, filed with the Commission on November 13, 1998, and amended by Amendment No. 5, filed with the Commission on January 28, 1999)\n4 (b)\nRGC Resources, Inc., Amended and Restated Dividend Reinvestment and Stock Purchase Plan (incorporated herein by reference to Exhibit 4(b) on Form 10-K for the year ended September 30, 2014)\n4 (c)\nDescription of RGC Resources, Inc. Common Stock (incorporated herein by reference to Exhibit 4(c) on Form 10-K for the year ended September 30, 2020)\n10 (a)\nP\nFirm Transportation Agreement between East Tennessee Natural Gas Company and Roanoke Gas Company dated November 1, 1993 (incorporated herein by reference to Exhibit 10(a) of the Annual Report on Form 10-K for the fiscal year ended September 30, 1994 (SEC file number reference 0-367))\n10 (b)\nFSS Service Agreement by and between Columbia Gas Transmission LLC and Roanoke Gas Company dated July 23, 2019 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed July 26, 2019)\n10 (c)\nFTS Service Agreement by and between Columbia Gas Transmission LLC and Roanoke Gas Company dated July 23, 2019 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed July 26, 2019)\n10 (d)\nSST Service Agreement by and between Columbia Gas Transmission LLC and Roanoke Gas Company dated July 23, 2019 (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed July 26, 2019)\n10 (e)\nFTS Service Agreement effective April 1, 2017 between Columbia Gas Transmission LLC and Roanoke Gas Company (incorporated herein by reference to Exhibit 10(f) on Form 10-K for the year ended September 30, 2017)\n10 (f)\nFTS-1 Service Agreement between Columbia Gulf Transmission LLC and Roanoke Gas Company dated March 7, 2022 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed March 11, 2022)\n10 (g)\nNegotiated Rate Letter Agreement with Columbia Gulf Transmission, LLC (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed March 11, 2022)\n10 (h)\nGas Transportation Agreement, for use under FT-A rate schedule, between Tennessee Gas Pipeline Company and Roanoke Gas Company originally dated November 1, 1993 as amended (incorporated herein by reference to Exhibit 10(g) on Form 10-K for the year ended September 30, 2021)\n10 (i)\nP\nGas Transportation Agreement, for use under IT rate schedule, between Tennessee Gas Pipeline Company and Roanoke Gas Company dated September 1, 1993 (incorporated herein by reference to Exhibit 10(l) of the Annual Report on Form 10-K for the fiscal year ended September 30, 1994 (SEC file number reference 0-367))\n10 (j)\nGas Storage Contract under rate schedule FS between Tennessee Gas Pipeline Company and Roanoke Gas Company originally dated November 1, 1993 as amended (incorporated herein by reference to Exhibit 10(i) on Form 10-K for the year ended September 30, 2021)\n10 (k)\nGas Transportation Agreement, for use under FT-A rate schedule, between Tennessee Gas Pipeline Company and Roanoke Gas Company originally dated November 1, 1993 as amended (incorporated herein by reference to Exhibit 10(j) on Form 10-K for the year ended September 30, 2021)\n10 (l)\nFTA Gas Transportation Agreement effective November 1, 1998, between East Tennessee Natural Gas Company and Roanoke Gas Company (incorporated herein by reference to Exhibit 10(s)(s) on Form 10-K for the year ended September 30, 1998 (SEC file reference number 0-367))\n10 (m)\nFirm Storage Service Agreement effective March 19, 1997, between Virginia Gas Storage Company and Roanoke Gas Company (incorporated herein by reference to Exhibit 10(w)(w) on Form 10-K for the year ended September 30, 1998 (SEC file reference number 0-367))\n10 (n)\nFirm Storage Service Agreement by and between Roanoke Gas Company and Virginia Gas Pipeline Company, dated June 1, 2001 (incorporated herein by reference to Exhibit 10(b)(b)(b) on Form 10-K for the year ended September 30, 2001 (SEC file number reference 0-367))\n10 (o)\nFSS Service Agreement between Saltville Gas Storage Company L.L.C. and Roanoke Gas Company dated November 21, 2012 (incorporated herein by reference to Exhibit 10(o) on Form 10-K for the year ended September 30, 2017)\n10 (p)\nFirm Pipeline Service Agreement by and between Roanoke Gas Company and Virginia Gas Pipeline Company, dated June 1, 2001 (incorporated herein by reference to Exhibit 10(c)(c)(c) on Form 10-K for the year ended September 30, 2001 (SEC file number reference 0-367))\n10 (q)\nNatural Gas Asset Management Agreement by and between Roanoke Gas Company and Sequent Energy Management LP effective April 1, 2018 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed on March 27, 2018)\n10 (r)\nAmendment No. 1 to Natural Gas Asset Management Agreement dated July 31, 2020 by and between Roanoke Gas Company and Sequent Energy Management LP (incorporated herein by reference to Exhibit 10.6 on Form 10-Q as filed August 5, 2020)\n10 (s)\nAmendment No. 2 to Natural Gas Asset Management Agreement dated August 5, 2021 by and between Roanoke Gas Company and Sequent Energy Management LP (incorporated herein by reference to Exhibit 10.1 on Form 10-Q as filed August 6, 2021)\n10 (t)\nAmendment No. 3 to Natural Gas Asset Management Agreement dated September 23, 2022 by and between Roanoke Gas Company and Sequent Energy Management LLC (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed October 11, 2022)\n10 (u)\nParental Guaranty by RGC Resources, Inc. in favor of Sequent Energy Management LP effective April 1, 2018 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed on March 27, 2018)\n10 (v)\nGas Transportation Agreement between Tennessee Gas Pipeline Company and Roanoke Gas Company originally dated November 1, 1999 as amended May 17, 2016 (incorporated herein by reference to Exhibit 10.3 of Form 10-Q as filed August 4, 2016)\n10 (w)\nAmendment dated May 17, 2016 to Gas Transportation Agreement originally dated December 1, 1993 between Tennessee Gas Pipeline Company and Roanoke Gas Company (incorporated herein by reference to Exhibit 10.1 of Form 10-Q as filed August 4, 2016)\n10 (x)\nAmendment dated May 17, 2016 to Gas Transportation Agreement originally dated November 1, 1993 between Tennessee Gas Pipeline Company and Roanoke Gas Company (incorporated herein by reference to Exhibit 10.2 of Form 10-Q as filed August 4, 2016)\n10 (y)\nGas Transportation Agreement, for use under FT-A rate schedule between Midwestern Gas Transmission Company and Roanoke Gas Company dated March 11, 2019 (incorporated herein by reference to Exhibit 10.1 on Form 10-Q as filed May 6, 2019)\n10 (z)\nAmendment dated November 29, 2021 to Gas Transportation Agreement originally dated December 1, 1993 between Tennessee Gas Pipeline and Roanoke Gas Company (incorporated herein by reference to Exhibit 10(s)(s)(s)(s) on Form 10-K for the year ended September 30, 2021)\n10 (a)(a)\nP\nCertificate of Public Convenience and Necessity for Bedford County dated February 21, 1966 (incorporated herein by reference to Exhibit 10(o) of Registration Statement No. 33-36605, on Form S-2, filed with the Commission on August 29, 1990, and amended by Amendment No. 1, filed with the Commission on September 19, 1990)\n10 (b)(b)\nP\nCertificate of Public Convenience and Necessity for Roanoke County dated October 19, 1965 (incorporated herein by reference to Exhibit 10(p) of Registration Statement No. 33-36605, on Form S-2, filed with the Commission on August 29, 1990, and amended by Amendment No. 1, filed with the Commission on September 19, 1990 (SEC file number reference 0-367))\n10 (c)(c)\nP\nCertificate of Public Convenience and Necessity for Botetourt County dated August 30, 1966 (incorporated herein by reference to Exhibit 10(q) of Registration Statement No. 33-36605, on Form S-2, filed with the Commission on August 29, 1990, and amended by Amendment No. 1, filed with the Commission on September 19, 1990 (SEC file number reference 0-367))\n10 (d)(d)\nP\nCertificate of Public Convenience and Necessity for Montgomery County dated July 8, 1985 (incorporated herein by reference to Exhibit 10(r) of Registration Statement No. 33-36605, on Form S-2, filed with the Commission on August 29, 1990, and amended by Amendment No. 1, filed with the Commission on September 19, 1990 (SEC file number reference 0-367))\n10 (e)(e)\nP\nResolution of the Council for the Town of Fincastle, Virginia dated June 8, 1970 (incorporated herein by reference to Exhibit 10(f) of Registration Statement No. 33-11383, on Form S-4, filed with the Commission on January 16, 1987 (SEC file number reference 0-367))\n10 (f)(f)\nP\nResolution of the Council for the Town of Troutville, Virginia dated November 4, 1968 (incorporated herein by reference to Exhibit 10(g) of Registration Statement No. 33-11383, on Form S-4, filed with the Commission on January 16, 1987 (SEC file number reference 0-367))\n10 (g)(g)\nCertificate of Public Convenience and Necessity for Franklin County dated March 5, 2019 (incorporated herein by reference to Exhibit 10.2 on Form 10-Q as filed May 6, 2019)\n10 (h)(h)\nGas Franchise Agreement between the City of Roanoke, Virginia, and Roanoke Gas Company dated December 14, 2015 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed December 16, 2015)\n10 (i)(i)\nGas Franchise Agreement between the City of Salem, Virginia, and Roanoke Gas Company dated December 14, 2015 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed December 16, 2015)\n10 (j)(j)\nGas Franchise Agreement between the Town of Vinton, Virginia, and Roanoke Gas Company dated November 17, 2015 (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed December 16, 2015)\n10 (k)(k)\nRGC Resources Amended and Restated Key Employee Stock Option Plan (incorporated herein by reference to Exhibit 4(c) of Registration Statement No. 333-02455, Post Effective Amendment on Form S-8, filed with the Commission on July 2, 1999)\n10 (l)(l)\nRGC Resources, Inc. Amended and Restated Stock Bonus Plan (incorporated herein by reference to Exhibit 10 on Form 8-K filed on January 27, 2005 (SEC file reference number 0-367))\n10 (m)(m)\nRGC Resources, Inc. Amended And Restated Restricted Stock Plan for Outside Directors (incorporated herein by reference to Exhibit 10(i)(i) on Form 10-K for the year ended September 30, 2017)\n10 (n)(n)\nRGC Resources, Inc. Restricted Stock Plan (incorporated herein by reference to Exhibit 10.1 of Form 8-K as filed February 9, 2017)\n10 (o)(o)\nNonqualified Deferred Compensation Plan Document (incorporated herein by reference to Exhibit 10.1 on Form 10-Q as filed February 11, 2021)\n10 (p)(p)\nChange in Control Agreement between RGC Resources, Inc. and Mr. Paul W. Nester effective May 1, 2023 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed April 27, 2023)\n10 (q)(q)\nChange in Control Agreement between RGC Resources, Inc. and Mr. Lawrence T. Oliver effective May 1, 2023 (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed April 27, 2023)\n10 (r)(r)\nChange in Control Agreement between RGC Resources, Inc. and Mr. Carl J. Shockley, Jr. effective May 1, 2023 (incorporated herein by reference to Exhibit 10.4 on Form 8-K as filed April 27, 2023)\n10 (s)(s)\nChange in Control Agreement between RGC Resources, Inc. and Mrs. C. Brooke Miles effective May 1, 2023 (incorporated herein by reference to Exhibit 10.5 on Form 8-K as filed April 27, 2023)\n10 (t)(t)\nCredit Agreement by and between Roanoke Gas Company and Wells Fargo Bank, N.A. dated March 31, 2016 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed April 4, 2016)\n10 (u)(u)\nFirst Amendment to Credit Agreement by and between Roanoke Gas Company and Wells Fargo Bank, N.A. dated March 27, 2017 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed March 29, 2017)\n10 (v)(v)\nSecond Amendment to Credit Agreement by and between Roanoke Gas Company and Wells Fargo Bank, N.A. dated as of March 26, 2018 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed March 27, 2018)\n10 (w)(w)\nThird Amendment to Credit Agreement by and between Roanoke Gas Company and Wells Fargo Bank, N.A. dated as of March 26, 2019 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed March 28, 2019)\n10 (x)(x)\nFourth Amendment to Credit Agreement by and between Roanoke Gas Company and Wells Fargo Bank, N.A. dated as of March 25, 2020 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed March 30, 2020)\n10 (y)(y)\nFifth Amendment to Credit Agreement by and between Roanoke Gas Company and Wells Fargo Bank, N.A., including Guarantor's Consent and Reaffirmation, dated as of March 25, 2021 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed March 31, 2021)\n10 (z)(z)\nSixth Amendment to Credit Agreement by and between Roanoke Gas Company and Wells Fargo Bank, N.A., including Guarantor's Consent and Reaffirmation, dated as of August 20, 2021 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed August 26, 2021)\n10 (a)(a)(a)\nSeventh Amendment to Credit Agreement by and between Roanoke Gas Company and Wells Fargo Bank, N.A. dated March 31, 2022 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed April 1, 2022)\n10 (b)(b)(b)\nContinuing Guaranty by RGC Resources, Inc. in favor of Wells Fargo Bank, N.A. dated March 31, 2016 (incorporated by reference to Exhibit 10.3 on Form 8-K as filed April 4, 2016)\n10 (c)(c)(c)\nNote Purchase Agreement for 4.26% Senior Guaranteed Notes due September 18, 2034 in the original principal amount of $30,500,000 in favor of The Prudential Insurance Company of America, PAR U Hartford Life & Annuity Comfort Trust and PRUCO Life Insurance Company of New Jersey (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed August 4, 2014)\n10 (d)(d)(d)\nUnconditional Parent Guaranty by RGC Resources, Inc. in favor of each of the holders of the notes: The Prudential Life Insurance Company of America, PAR U Hartford Life & Annuity Comfort Trust and PRUCO Life Insurance Company of New Jersey (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed August 4, 2014)\n10 (e)(e)(e)\n4.26% Senior Guaranteed Notes due September 18, 2034 in the original principal amount of $15,250,000 in favor of The Prudential Insurance Company of America (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed September 23, 2014)\n10 (f)(f)(f)\n4.26% Senior Guaranteed Notes due September 18, 2034 in the original principal amount of $9,700,000 in favor of PAR U Hartford Life & Annuity Comfort Trust (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed September 23, 2014)\n10 (g)(g)(g)\n4.26% Senior Guaranteed Notes due September 18, 2034 in the original principal amount of $5,550,000 in favor of PRUCO Life Insurance Company of New Jersey (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed September 23, 2014)\n10 (h)(h)(h)\nCredit Agreement between RGC Midstream, LLC, Union Bank & Trust and Branch Banking and Trust Company dated December 29, 2015 (incorporated by reference to Exhibit 10.1 on Form 8-K as filed December 31, 2015)\n10 (i)(i)(i)\nFirst Amendment to Credit Agreement between RGC Midstream, LLC and the lenders Union Bank & Trust and Branch Banking and Trust dated April 11, 2018 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed April 12, 2018)\n10 (j)(j)(j)\nSecond Amendment to Credit Agreement between RGC Midstream, LLC and the lenders Union Bank & Trust and Branch Banking and Trust dated February 19, 2019 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed February 19, 2019)\n10 (k)(k)(k)\nThird Amendment to Credit Agreement between RGC Midstream, LLC and the lenders Atlantic Union Bank and Truist Bank dated December 23, 2019 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed December 23, 2019)\n10 (l)(l)(l)\nFourth Amendment to Credit Agreement between RGC Midstream, LLC and the lenders Atlantic Union Bank and Truist Bank dated June 30, 2022 (incorporated by reference to Exhibit 10.1 on Form 8-K as filed July 5, 2022)\n10 (m)(m)(m)\nFifth Amendment to Credit Agreement between RGC Midstream, LLC and the lenders Atlantic Union Bank and Truist Bank dated July 28, 2023 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed July 31, 2023)\n10 (n)(n)(n)\nAmended and Restated Note in the principal amount of $13,800,000 in favor of Atlantic Union Bank due December 31, 2023 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed July 5, 2022)\n10 (o)(o)(o)\nAmended and Restated Note in the principal amount of $9,200,000 in favor of Truist Bank due December 31, 2023 (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed July 5, 2022)\n10 (p)(p)(p)\nGuaranty by RGC Resources, Inc. in favor of Union Bank & Trust and Branch Banking and Trust Company dated December 29, 2015 (incorporated herein by reference to Exhibit 10.4 on Form 8-K as filed December 31, 2015)\n10 (q)(q)(q)\nPrivate Shelf Agreement by and between Roanoke Gas Company and Prudential Investment Management, Inc. for the pre-authorization to issue notes up to $29,500,000 in total during the term of the agreement (incorporated herein by reference to Exhibit 10.4 on Form 8-K as filed October 4, 2017)\n10 (r)(r)(r)\nSecond Amendment to Private Shelf Agreement dated as of December 6, 2019 (incorporated herein by reference to Exhibit 10.4 on Form 8-K as filed December 9, 2019)\n10 (s)(s)(s)\nThird Amendment to Private Shelf Agreement dated as of December 6, 2022 (incorporated by reference to Exhibit 10.1 on Form 8-K as filed December 7, 2022)\n10 (t)(t)(t)\nUnsecured Note in the original principal amount of $4,000,000 by and between Roanoke Gas Company and PRUCO Life Insurance Company of New Jersey, dated October 2, 2017 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed October 4, 2017)\n10 (u)(u)(u)\nUnsecured Note in the original principal amount of $4,000,000 by and between Roanoke Gas Company and Prudential Arizona Reinsurance Captive Company, dated October 2, 2017 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed October 4, 2017)\n10 (v)(v)(v)\nUnconditional Parent Guaranty by RGC Resources, Inc. in favor of each of the holders of the notes: The PRUCO Life Insurance Company of New Jersey and the Prudential Arizona Reinsurance Captive Company (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed October 4, 2017)\n10 (w)(w)(w)\nUnsecured Note in the original principal amount of $5,000,000 by and between Roanoke Gas Company and Highmark, Inc. dated March 28, 2019 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed March 29, 2019)\n10 (x)(x)(x)\nUnsecured Note in the original principal amount of $3,000,000 by and between Roanoke Gas Company and Prudential Arizona Reinsurance Term Company dated March 28, 2019 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed March 29, 2019)\n10 (y)(y)(y)\nUnsecured Note in the original principal amount of $2,000,000 by and between Roanoke Gas Company and The Prudential Insurance Company of America dated March 28, 2019 (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed March 29, 2019)\n10 (z)(z)(z)\nUnconditional Guaranty Agreement by and between RGC Resources, Inc. and Prudential Investment Management and each Prudential Affiliate which is a party to the borrowing (incorporated herein by reference to Exhibit 10.4 on Form 8-K as filed March 29, 2019)\n10 (a)(a)(a)(a)\nPromissory Note in the original principal amount of $14,000,000 by and between RGC Midstream, LLC and Atlantic Union Bank, dated June 12, 2019 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed June 17, 2019)\n10 (b)(b)(b)(b)\nLoan Agreement between RGC Midstream, LLC and Atlantic Union Bank, dated June 12, 2019 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed June 17, 2019)\n10 (c)(c)(c)(c)\nUnconditional Guaranty by and between RGC Resources, Inc. and Atlantic Union Bank (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed June 17, 2019)\n10 (d)(d)(d)(d)\nSwap Agreement by and between RGC Midstream, LLC and Atlantic Union Bank, dated June 12, 2019 (incorporated herein by reference to Exhibit 10.4 on Form 8-K as filed June 17, 2019)\n10 (e)(e)(e)(e)\nPromissory Note in the original principal amount of $10,000,000 by and between RGC Midstream, LLC and Branch Banking and Trust, dated June 13, 2019 (incorporated herein by reference to Exhibit 10.5 on Form 8-K as filed June 17, 2019)\n10 (f)(f)(f)(f)\nLoan Agreement between RGC Midstream, LLC and Branch Banking and Trust Company, dated June 13, 2019 (incorporated herein by reference to Exhibit 10.6 on Form 8-K as filed June 17, 2019)\n10 (g)(g)(g)(g)\nUnconditional Guaranty by and between RGC Resources, Inc. and Branch Banking and Trust Company (incorporated herein by reference to Exhibit 10.7 on Form 8-K as filed June 17, 2019)\n10 (h)(h)(h)(h)\nSwap Agreement by and between RGC Midstream, LLC and Branch Banking and Trust Company, dated June 13, 2019 (incorporated herein by reference to Exhibit 10.8 on Form 8-K as filed June 17, 2019)\n10 (i)(i)(i)(i)\n**\nThird Amended and Restated Limited Liability Company Agreement of Mountain Valley Pipeline, LLC dated April 6, 2018 (incorporated by reference to Exhibit 10.1 on the Quarterly Report on Form 10-Q as filed May 7, 2018)\n10 (j)(j)(j)(j)\nGuaranty Agreement by RGC Resources, Inc. in favor of Mountain Valley Pipeline, LLC (incorporated herein by reference to Exhibit 10.2 on Form 10-Q as filed May 7, 2018)\n10 (k)(k)(k)(k)\nLetter Agreement dated May 4, 2023, between MVP Holdco, LLC and RGC Midstream, LLC (incorporated by reference to Exhibit 10.1 on Form 10-Q filed on May 5, 2023)\n10 (l)(l)(l)(l)\nUnsecured Note in the original principal amount of $5,000,000 by and between Roanoke Gas and Prudential Arizona Reinsurance Universal Company, dated December 6, 2019 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed December 9, 2019)\n10 (m)(m)(m)(m)\nUnsecured Note in the original principal amount of $5,000,000 by and between Roanoke Gas and Prudential Arizona Reinsurance Universal Company, dated December 6, 2019 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed December 9, 2019)\n10 (n)(n)(n)(n)\nUnconditional Guaranty Agreement by and between RGC Resources, Inc. and Prudential Investment Management and each Prudential Affiliate which is a party to the borrowings dated December 6, 2019 (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed December 9, 2019)\n10 (o)(o)(o)(o)\nPrivate Shelf Agreement by and between Roanoke Gas Company and MetLife Investment Management Limited dated September 30, 2020, for the pre-authorization to issue notes up to the aggregate amount of $70,000,000 in total during the term of the agreement (incorporated herein by reference to Exhibit (l)(l)(l)(l) on Form 10-K for the year ended September 30, 2020)\n10 (p)(p)(p)(p)\nDelayed Draw Term Note in the principal amount of $15,000,000 by Roanoke Gas Company with Wells Fargo Bank, N.A. dated as of August 20, 2021 (incorporated by reference to Exhibit 10.1 on Form 8-K as filed August 26, 2021)\n10 (q)(q)(q)(q)\nSwap Agreement by and between Roanoke Gas Company and Wells Fargo Bank, N.A., executed on August 20, 2021 (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed August 26, 2021)\n10 (r)(r)(r)(r)\nPromissory Note (Revolving Loan) in the principal amount of $25,000,000 by Roanoke Gas Company with Pinnacle Bank, dated March 24, 2023 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed March 28, 2023)\n10 (s)(s)(s)(s)\nAmended and Restated Promissory Note (Term Loan) in the principal amount of $10,000,000 by Roanoke Gas Company with Pinnacle Bank, dated March 24, 2023 (effective as of April 1, 2023) (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed March 28, 2023)\n10 (t)(t)(t)(t)\nAmended and Restated Loan Agreement by and between Roanoke Gas Company and Pinnacle Bank, dated March 24, 2023 (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed March 28, 2023)\n10 (u)(u)(u)(u)\nAmended and Restated Guaranty Agreement by RGC Resources, Inc. with Pinnacle Bank, dated March 24, 2023 (incorporated herein by reference to Exhibit 10.4 on Form 8-K as filed March 28, 2023)\n10 (v)(v)(v)(v)\nAmended Swap Agreement by and between Roanoke Gas Company and Pinnacle Bank, dated April 3, 2023 (effective April 1, 2023) (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed April 4, 2023)\n10 (w)(w)(w)(w)\nPromissory Note in the principal amount of $8,000,000 by RGC Midstream, LLC with Atlantic Union Bank, dated as of November 1, 2021 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed November 4, 2021)\n10 (x)(x)(x)(x)\nLoan Agreement by and between RGC Midstream, LLC and Atlantic Union Bank, dated as of November 1, 2021 (incorporated herein by reference to Exhibit 10.2 on Form 8-K as filed November 4, 2021)\n10 (y)(y)(y)(y)\nSwap Agreement by and between RGC Midstream, LLC and Atlantic Union Bank, executed on November 1, 2021 (incorporated herein by reference to Exhibit 10.3 on Form 8-K as filed November 4, 2021)\n10 (z)(z)(z)(z)\nLIBOR Transition Notice and ISDA Swap Amendment between Atlantic Union Bank and RGC Midstream, LLC, executed June 28, 2023 (incorporated herein by reference to Exhibit 10.1 on Form 8-K as filed June 29, 2023)\n10 (a)(a)(a)(a)(a)\nGuaranty by RGC Resources, Inc. with Atlantic Union Bank, dated as of November 1, 2021 (incorporated herein by reference to Exhibit 10.4 on Form 8-K as filed November 4, 2021)\nAnnual Report\nRevised Code of Ethics (incorporated herein by reference to Exhibit 14.1 on Form 8-K as filed April 27, 2023)\nSubsidiaries of the Company\nConsent of Brown, Edwards & Company, LLP\n31.1\nRule 13a-14(a)/15d-14(a) Certification of Principal Executive Officer\n31.2\nRule 13a-14(a)/15d-14(a) Certification of Principal Financial Officer\n32.1\n*\nSection 1350 Certification of Principal Executive Officer\n32.2\n*\nSection 1350 Certification of Principal Financial Officer\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101)\n* These certifications are being furnished solely to accompany this annual report pursuant to 18 U.S.C. Section 1350, and are not being filed for purposes of Section 18 of the Securities Exchange Act of 1934 and are not to be incorporated by reference into any filing of the registrant, whether made before or after the date hereof, regardless of any general incorporation language in such filing.\n** Confidential treatment has been granted with respect to portions of this exhibit, indicated by asterisks, which has been filed separately with the Securities and Exchange Commission.\nP These original exhibits were filed with the SEC in paper form and therefore are not hyper-linked to the original filing.\nItem 16. Form 10-K Summary.\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized.\nRGC RESOURCES, INC.\nBy:\n/s/ Timothy J. Mulvaney\nDecember 1, 2023\nTimothy J. Mulvaney\nDate\nInterim CFO and Treasurer\n(Principal Financial Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\n/S/ PAUL W. NESTER\nDecember 1, 2023\nPresident and Chief Executive Officer, Director\nPaul W. Nester\nDate\n(Principal Executive Officer)\n/S/ TIMOTHY J. MULVANEY\nDecember 1, 2023\nInterim CFO and Treasurer\nTimothy J. Mulvaney\nDate\n(Principal Financial Officer)\n/S/ JOHN B. WILLIAMSON, III\nDecember 1, 2023\nChairman of the Board and Director\nJohn B. Williamson, III\nDate\n/S/ NANCY H. AGEE\nDecember 1, 2023\nDirector\nNancy H. Agee\nDate\n/S/ JACQUELINE L. ARCHER\nDecember 1, 2023\nDirector\nJacqueline L. Archer\nDate\n/S/ ABNEY S. BOXLEY, III\nDecember 1, 2023\nDirector\nAbney S. Boxley, III\nDate\n/S/ T. JOE CRAWFORD\nDecember 1, 2023\nDirector\nT. Joe Crawford\nDate\n/S/ MARYELLEN F. GOODLATTE\nDecember 1, 2023\nDirector\nMaryellen F. Goodlatte\nDate\n/S/ ROBERT B. JOHNSTON\nDecember 1, 2023\nDirector\nRobert B. Johnston\nDate\n/S/ J. ALLEN LAYMAN\nDecember 1, 2023\nDirector\nJ. Allen Layman\nDate\n/S/ ELIZABETH A. MCCLANAHAN\nDecember 1, 2023\nDirector\nElizabeth A. McClanahan\nDate"
}