{
    "cik": "1071840",
    "company": "SolarWindow Technologies, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-11-21",
    "period_of_report": "2023-08-31",
    "sic": "2860",
    "state_of_inc": "NV",
    "state_location": "AZ",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1071840/0001171843-23-007232-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1071840/000117184323007232/f10k_112123.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1071840/0001171843-23-007232.txt",
    "filename": "1071840_10K_2023_0001171843-23-007232.htm",
    "content": "Item 1. Business\nWe are a pre-revenue company developing proprietary transparent electricity-generating coatings and methods for application to various materials which we refer to as LiquidElectricity® Coatings. Our LiquidElectricity® Coatings generate electricity by harvesting light energy from natural sun, artificial light, and low, shaded, or reflected light conditions. We apply ultra-thin layers of LiquidElectricity® Coatings to rigid glass, and flexible glass and plastic surfaces where they transform otherwise ordinary surfaces into organic photovoltaic devices, commonly known as solar cells, or solar modules.\nOur LiquidElectricity® is a framework which utilizes chemistry for different ultra-thin layers applied to a substrate. These layers include hole transport layers, active layers, electron transport layers, and conductive contact points for transmission of electricity. We have developed a specialty expertise in each layer of our LiquidElectricity® to optimize for power, optical clarity, manufacturability, stability, and other qualities. The flexibility engineered into our LiquidElectricity® framework allows us to target a variety of potential applications spanning multiple industries, including architectural, automotive, agrivoltaic (agricultural greenhouse), aerospace, commercial transportation and marine.\nOur LiquidElectricity® Coatings are under development at one of the most respected and advanced solar-photovoltaic research institutions in the world, the U.S. Department of Energys (DOE) National Renewable Energy Laboratory (NREL), through a Cooperative Research and Development Agreement (CRADA). SolarWindow also has support from commercial contract firms who provide expertise in chemistry, coatings processes, and manufacturing.\nOur commercial development efforts include seeking technology, product licensing, and joint venture arrangements with research institutions, commercial partners, manufacturing and fabrication facilities, and organizations with established technical competencies, market reach, and distribution networks in targeted industries.\nAmong our near-term product iterations, is the electrification of glass surfaces. LiquidElectricity® , when applied using our proprietary processes to glass, could be fabricated into a window product to produce electricity-generating windows for potential use in new construction and retrofit applications in commercial buildings. We also envision the application of LiquidElectricity® Coatings to existing third-party materials or product surfaces, to create electricity-generating products which could become self-powered, or colloquially, self-charging products.\nWe have achieved important milestones and overcome major technical challenges in order to broaden the range of materials and products that we can coat to generate electricity. Our goals in developing electricity-generating products have included ensuring transparency and aesthetics, optimizing power generation, developing productization processes, simplifying manufacturability, and lowering costs of coating materials and their related application.\nWe first coated rigid flat glass with our LiquidElectricity® Coatings to generate electricity. Numerous technological advancements have enabled us to fabricate panes of flat glass layered with LiquidElectricity® coatings at room temperature and ambient pressure; this process represents a significant technical achievement which may provide manufacturing advantages over expensive and cumbersome high temperature and high positive or negative pressure-sensitive manufacturing methods common to conventional solar photovoltaic manufacturing.\nAmong important field tests, LiquidElectricity® Coatings on flat glass have been successfully processed through the rigorous autoclave system for window glass lamination at a commercial fabricator. At the fabricators facilities, glass panes layered with LiquidElectricity® Coatings were subjected to the extremely high heat and pressure of autoclave equipment used in commercial glass lamination. Subsequent performance testing confirmed that glass with LiquidElectricity® Coatings continued to produce power.\nLiquidElectricity® Coatings on glass panes have also been subjected to more than 200 freeze/thaw cycles, yielding favorable performance. Our edge sealing processes and materials contributed to the prevention of moisture-related damage, an important feature.\nIn addition to flat glass, we have successfully applied our LiquidElectricity® Coatings to generate electricity on flexible glass and plastics. On glass surfaces, our electricity-generating coatings could enable new and retrofit architectural applications such as windows for commercial towers, glass walls and curtain walls, room dividers, and other related products. On flexible surfaces, our electricity-generating products present applications in various industries, including: automotive, light and commercial trucks, recreational vehicles, marine, aerospace and defense, agrivoltaics, and others.\nIn 2022, SolarWindow successfully applied LiquidElectricity® Coatings using fully-solution processable methodology to create a non-transparent organic photovoltaic device. Fully-solution processable organic photovoltaic methodology offers the potential for industry standard chemical deposition for more capital and time efficient manufacturing and production.\nIn 2023, LiquidElectricity® Coatings were successfully applied using fully-solution processable methodology to create semi-transparent solar modules. LiquidElectricity® applied with this methodology could benefit the agriculture market through utilizing crop shelter structures which offer protection in adverse climate conditions by generating electricity on greenhouse windows and canopies while simultaneously optimizing light transmission for maximum crop yield.\nOur planned productization and commercialization of SolarWindow® technologies will require significant further product development, fabrication, testing, and validation. In addition to our technology development CRADA and engagements with specialty contract groups, we anticipate the need for product development partnerships with commercial partners, as well as additional financing, which may not be readily available, to ascertain the viability of our technologies and products, currently under development.\nOur technologies and products, currently under development, use our proprietary chemistries and application processes in order to generate electricity on glass and plastics. Our ongoing research and product development requires the commitment of significant resources to support the extensive invention, design, engineering, testing, prototyping, and intellectual property initiatives carried-out by our scientists, engineers, and consultants.\nWe cannot accurately predict the amount of funding or the time required to successfully commercialize products. The actual cost and time required to commercialize our technology may vary significantly depending on, among other things, the results of our product development efforts; the cost of developing, acquiring, or licensing various enabling technologies; changes in the focus and direction of our business or product development plans; competitive and technological advances; the cost of patent filing, prosecuting, defending and enforcing claims; demonstrating compliance with regulations and standards; and manufacturing, marketing and other costs that may be associated with product fabrication. Because of this uncertainty, even if financing is available to us, we may secure insufficient funding to effectuate our business and/or product development plans.\nThe Market Opportunity for our LiquidElectricity® Coatings\nSolarWindow recognizes demand for global energy requirements, including reducing energy costs while using environmentally friendly next-generation renewables, and actively seeks to advance our novel solar photovoltaic solutions in global adoption of new renewable technologies.\nBased on our market research, there are no commercially marketed electricity-generating products available for sale in the United States which provide the functionality, features, esthetics, and adaptability of LiquidElectricity® Coatings. Our markets include building window and glass applications, referred to as architectural flat glass and fabricated glass products. Flat glass is extensively used in the architecture industry in applications such as windows, partitions, and facades. One third-party glass industry report, published in February 2022, by Grandview Research, Inc., projects that the global flat glass market was $273.43 billion in 2021 and is expected to reach $400.38 billion by 2030, growing at a revenue-based compounded annual growth rate (CAGR) of 4.3%.\nWe are also targeting applications for our LiquidElectricity® Coatings in automotive, light and commercial trucks, recreational vehicles, marine, and aerospace and defense sectors, among others. We believe that the rising demand for electric propulsion and autonomous piloting in these segments presents a timely opportunity for our electricity-generating technologies.\nAdditionally, the agrivoltaics market for our electricity-generating coatings includes the smart greenhouse market, projected to reach $11 billion by 2032 with a growth rate of 11.7% annually from 2023 to 2032, driven in part by rising food demand due to growing populations and by government initiatives to develop smart farming, according to reports by Precedence Research issued in August 2023 and Research & Markets issued in April 2023. In addition to these smart greenhouses which monitor and control the growth condition of plants and optimize the growing process of the plants, we believe that conventional greenhouse structures, both new and existing, present commercial opportunities for the application of SolarWindow to these structures.\nWe believe that our addressable markets in each of the forgoing segments, although fractional may nevertheless present viable commercial opportunities. Our ability to successfully address these markets is also dependent on our ability to effectuate development and commercial partnerships as well as securing adequate financing as needed.\nOur Competitive Strengths\nWe believe that the following strengths of our LiquidElectricity® Coatings and technologies should enable us to compete successfully in the alternative and renewable energy industries:\n· Performance in Natural and Artificial Light - We propose unique solutions for harvesting the light energy of natural and artificial light sources to generate sustainable electricity;\n· Works on Glass and Plastics - Our LiquidElectricity® Coatings are capable of generating electricity on flat glass and flexible glass and plastics; and\n· Cost Effective - Our LiquidElectricity® Coatings are engineered for manufacturing using earth abundant materials at a low price point and are suited for high-throughput manufacturing.\nOur Business Strategy\nOur commercial development efforts include seeking opportunities for intellectual property in-licensing, out-licensing, cross-licensing, and acquisition. We also seek technology, product licensing and joint venture arrangements with research institutions, commercial partners, manufacturing and fabrication facilities, and organizations with established technical competencies, market reach, and distribution networks in targeted industries. Key elements of our business strategy to implement the forgoing include:\n· Strategic Commercial Partnerships - We pursue commercial partnerships to enable productization, manufacturing, and marketing of our technologies and products. Our target partnerships include supply chain glass, plastics, window, automotive, greenhouse manufacturing and other related companies;\n· Innovative Research and Continuous Product and Technology Enhancement - We seek partnerships with product development groups, manufacturers of specialty chemicals, advanced-manufacturing companies, and others with proven technology expertise and developing additional applications and markets for LiquidElectricity® Coatings. We are currently working with scientists at NREL for the ongoing development of our coatings and applications processes, including high-speed roll-to-roll manufacturing processes development. We work to engage additional firms and institutions with important technical and product development competencies as needed; and\n· Management Team Development - Augment our management team with experienced and effective talent in order to, among other competencies, advance our product development and innovation programs, monetize and leverage our intellectual property, develop and implement sales and marketing plans, enhance the Companys brand positioning in industry and capital markets, and raise capital in order to effectuate our business plan.\nCompetition for Our Technology and Products\nThe Solar photovoltaic industry is highly competitive and such competition is increasing as the number of participants in the industry continues to grow. Although we are not aware of other products utilizing technology substantially similar to our technology, numerous solar cell technologies have been developed, or are being developed, by a number of companies, from which products may be derived and ultimately compete with our products.\nSuch technologies include, but are not necessarily limited to, the use of organic materials, advanced crystalline silicon thin film concepts, amorphous silicon, cadmium telluride, copper-indium-gallium-selenide, titanium dioxide, and copper indium di-selenide, and others to generate electricity from sunlight. Given sufficient time, investment and advances in manufacturing technologies, any of these competing technologies may achieve lower manufacturing costs, superior performance, or greater market acceptance than our products, currently under development. Among the companies purporting to be developing such technologies, are ONYX Solar, Next Energy Technologies, Solarmer Organic Optoelectronics Technology (Beijing) Co., Ltd., Ubiquitous Energy, Heliatek, Sunew Filmes Fotovoltaicos Impressos S.A. and ASCA GmbH.\nWe face competition from many companies, major universities and research institutions in the United States and abroad. Many of these companies, universities and research institutions have substantially greater resources, experience in conducting research, experience in obtaining regulatory approvals for their products, operating experience, research and development and marketing capabilities name recognition and production capabilities. We will face competition from companies marketing existing products or developing new products which may render our technologies (and hence future products) obsolete.\nThese companies, universities and research institutions may have numerous competitive advantages, including:\nSignificantly greater name recognition;\nestablished distribution networks;\nmore advanced technologies and product development;\nadditional lines of products, and the ability to offer rebates, higher discounts or incentives to gain a competitive advantage;\nprocesses that are operational and manufacturing prototype or final products;\ngreater experience in conducting research and development, manufacturing, obtaining regulatory approval for products, and marketing approved products; and\nsignificantly greater financial and human resources for product development, sales and marketing, and patent litigation.\nIf our competitors were to:\n· succeed in developing products that are more effective in producing electrical energy at a lower cost than our technology, some or all of our products or our technology could be rendered obsolete and non-competitive;\n· succeed in bringing their products or services to market earlier than ours, our ability to commercialize our products may be adversely affected, which in turn may impede or limit our ability to generate revenues and achieve profitability. See Risk Factors.\nAccordingly, in addition to our research and development efforts, historically, we have undertaken public relations, advertising, and market access outreach programs designed to establish our brand name recognition early on in our corporate development; we intend to continue to develop and market our brand name pending commercialization of products, if any, we may derive from our research and development efforts. We believe our strategy ultimately will facilitate development and commercialization partnerships, the marketing, distribution and public acceptance of any products derived from our research and development efforts, and assist in attracting equity capital, if and when needed.\nOur competitive position in the market will also depend on:\n· our ability to attract and retain qualified personnel, to obtain patent protection, develop proprietary products and processes, protect our intellectual property rights, and to secure sufficient capital resources required during the often-substantial period between technology development and commercial sales; and\n· the timing of market introduction of any products utilizing our LiquidElectricity® Coatings. Accordingly, the speed with which we can develop products, complete safety approvals, and ultimately supply commercial quantities of any products we develop to the market is important.\nIn addition to the foregoing, ultimately, our commercial success will depend on our ability and the ability of our manufacturing partners, licensee or sub-licensees, if any, to compete effectively in product development areas such as, but not limited to safety, reliability, availability, price, marketing, distribution and patent position.\nIntellectual Property\nThe success of our business depends, in part, on our ability to pursue, maintain and protect our proprietary technologies, information, processes, and know-how. We rely primarily on patent, trademark, copyright and trade secrets laws in the U.S. and similar laws in other countries, confidentiality agreements and procedures and other contractual arrangements to protect our technologies and products.\nThe Company periodically reviews its intellectual property portfolio in order to ensure that its portfolio remains germane to its continuing business and operations and, as a cost saving measure, and if warranted, sell or abandon any intellectual property which is no longer useful or relevant to the Companys commercialization efforts or to more fully protect the Companys intellectual property portfolio.\nAs of the date of the Annual Report, our proprietary technologies are the subject of eleven (11) granted United States patents, nineteen (19) granted patents in non-U.S. jurisdictions, and eight (8) U.S. and twelve (12) non-U.S. pending patent applications. If maintained to their full term our issued patents are scheduled to expire on various dates between January 2030 and April 2040. These dates are subject to change depending on the Companys current and future patent application filings and the Companys discretion to maintain its various intellectual property assets in accordance with its corporate interests and goals. We continually assess opportunities to seek patent protection for those aspects of our technology, designs, and methodologies and processes that we believe may provide us with significant competitive advantages or additional commercial opportunities. Some aspects of LiquidElectricity® Coatings and related processes, technologies and products involve proprietary trade secrets of the Company.\nAdditionally, the Company has filed various trademark registrations and applications for use in commerce.\nWe believe that many elements of LiquidElectricity® Coatings and related processes, technologies and products involve proprietary know-how, technology, or data that are not covered by patents or patent applications, including but not limited to technical processes, equipment, design architecture, algorithms, and procedures. Accordingly, we rely on trade secret protection and confidentiality agreements to safeguard our interests with respect to proprietary know-how that is not patentable and processes for which patents are difficult to enforce.\nThe Companys commercial success depends in part on its ability to obtain intellectual property protection of its innovations and designs, to protect its trade secrets, and to conduct business without infringing the intellectual property rights of others.\nGovernment Regulation\nOur technology may be subject to certain government regulations and standards. Our ability to remain viable will depend on favorable government decisions at various stages of the technologys development by various agencies. From time to time, legislation is introduced that could significantly change the statutory or regulatory provisions governing our research and product development processes, as well as approval of the manufacturing and marketing of any products derived from such research and development activities.\nThe production and marketing of our technology derived products would be subject to existing and future safety & health regulations and standards in the United States and South Korea.\nCurrent safety & health requirements and standards for electrical products can include, but may not be limited to, Occupational Safety and Health Administration regulations, National Electrical Code as approved as an American National Standard by the American National Standards Institute or ANSI/NFPA-70, certification by Underwriters Laboratories and the Society of Automotive Engineers, and compliance with State, Federal, and local building codes. These regulations are subject to change, and our ability to remain viable is contingent upon successfully satisfying regulatory requirements as stipulated by these agencies and/or others as the development of our technology evolves. We may be additionally required to comply with similar regulations and standards in South Korea.\nEmployees and Consultants\nThe Company utilizes the services of full-time employees as well as part-time employees and consultants on a contract basis. As of the date of this annual report, the Company has one (1) full-time employee, two (2) part-time employees, one (1) full-time consultant and one (1) part-time consultant all located in the United States.\nFrom time to time, the Company grants stock options to employees and consultants either pursuant to contract requirements or on a discretionary basis. None of our employees are covered by a collective bargaining agreement. We believe our relations with our employees are good.\nOther Information\nOur website address is www.solarwindow.com. We make available free of charge through our website our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to the Securities Exchange Act of 1934, as amended, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The information accessible through our website is not a part of this annual report.\nThe public may also read and copy any materials we file with the United States Securities and Exchange Commission (SEC) on the SECs website at www.sec.gov which site contains reports, proxy and information statements, and other information regarding issuers, such as us, that file electronically with the SEC. All statements made in any of our filings, including all forward-looking statements, are made as of the date of the document(s) in which the statement is included, and we do not assume or undertake any obligation to update any of those statements or documents unless we are required to do so by law.\nOur executive office is located at 9375 E Shea Blvd., Suite 107-B, Scottsdale AZ 85260. Our telephone number is (800) 213-0689; our email is info@solarwindow.com. Our website is www.solarwindow.com. Information contained on our web site (or any other website) does not constitute part of this annual report.\nOur research and development activities are conducted at the U.S. Department of Energys National Renewable Energy Laboratories in Golden, Colorado pursuant to a Cooperative Research and Development Agreement.\nStockholder Communications\nStockholders who wish to communicate with the Board may do so by addressing their correspondence to the Board at SolarWindow Technologies, Inc., Attention: Mr. Amit Singh, 9375 E Shea Blvd., Suite 107-B, Scottsdale AZ 85260. The Board will review and respond to all correspondence received, as appropriate. Item 1A. Risk Factors\nRisk Factors\nThe following risk factors and the forward-looking statements elsewhere in this annual report should be read carefully in connection with evaluating the business of the Company. A wide range of events and circumstances could materially affect our overall performance and our results of operations, and therefore, an investment in us is subject to risks and uncertainties. In addition to the important factors affecting specific business operations and the financial results of those operations identified elsewhere in this annual report, the following important factors, among others, could adversely affect our operations. While each risk is described separately below, some of these risks are interrelated and it is possible that certain risks could trigger the applicability of other risks described below. Also, the risks and uncertainties described below are not the only ones that we face. Additional risks and uncertainties not presently known to us, or that are currently deemed immaterial, could also potentially impair our business, results of operations and potential profitability. These risk factors may be amended, supplemented, or superseded from time to time in filings and reports that we file with the SEC in the future.\nRisks Related to Our Financial Condition and Need for Additional Financing\nWe have not generated any revenues and have experienced significant losses to date and we expect to continue incur losses for the foreseeable future. Consequently, we will require additional financing in the future to maintain and expand operations into advanced stages of product development and fabrication, and failure to obtain such financing would have a material adverse effect on our business, operating results, financial condition and prospects.\nWe have experienced and continue to experience negative cash flows from operations. We have not generated any revenue since inception and do not expect to generate any substantial amounts of revenue for the foreseeable future. We had a net loss of $2,396,395 and $4,948,533 for our fiscal years ended August 31, 2023 and 2022, respectively. As of August 31, 2023, we had cash and short-term investments of $5,992,610 and working capital of $6,017,272. Based on managements assessment, the Company has sufficient cash and short-term investments to meet its current funding requirements over the next twelve months following the date of this annual report, to meet our projected product development and fabrication goals during this period. However, our current cash and short-term investments may not be sufficient to permit us to maintain or expand our operations beyond this period.\nWe are currently in the advanced stages of our research and early stages of product development and have come to the point where larger, faster, and more precise equipment is necessary for development to continue and to be able to come to market with a commercially viable product. We expect that we will need to raise substantial additional capital to accomplish our manufacturing and product sales objectives in future years.\nWe anticipate seeking additional funding through financial or strategic investors. If adequate funds are not available on reasonable terms, or at all, it would result in a material adverse effect our business, operating results, financial condition, intellectual property and prospects. In particular, the Company may be required to delay; reduce the scope of or terminate its research and development programs; abandon its pursuit of filed but unissued patents; sell rights to its technology or other technologies or products based upon these technologies; or license the rights to these technologies or products on terms that are less favorable to us than might otherwise be available.\nIf we raise additional funds by issuing equity or debt securities, further dilution to stockholders may result and new investors could have rights superior to existing stockholders.\nBecause we cannot currently estimate the amount of funds or time required to commercialize our technologies, even if financing is available to us, we may secure less funding than is actually required to effectuate our business plan.\nAs noted above, we are currently in the advanced stages of our research and early stages of product development. We have come to the point where larger, faster, and more precise equipment is necessary for all facets of technology and product development to continue and to be able to come to market with a commercially viable product. We, however, cannot accurately predict the amount of funding or the time required to successfully commercialize our technology. The actual cost and time required to commercialize these technologies may vary significantly depending on, among other things, the results of our research and product development efforts; the cost of developing, acquiring, or licensing various enabling technologies, changes in the focus and direction of our research and product development programs; competitive and technological advances; the cost of filing, prosecuting, defending and enforcing claims with respect to patents; the regulatory approval process; process manufacturing; marketing and other costs associated with commercialization of these technologies. Because of this uncertainty, even if financing is available to us, we may secure insufficient funding to effectuate our business plan.\nTo obtain financing as needed, we may enter into transactions that may dilute the ownership interest of our current stockholders.\nIn order to raise sufficient capital to meet its financial obligations, we may enter into financing transactions that would result in dilution of the ownership interests of our current stockholders or which may involve the sale of our securities at prices that are at a discount to current market price of our stock as reported on the Pink market. Such sales will be made at prices determined by our Board based on factors deemed appropriate at the time; accordingly, such sales by us could be made at prices less than the price of the shares of our common stock purchased, in which case, investors could experience dilution of their investment.\nAdverse conditions in the alternative energy industry or the global economy generally could have adverse effects on our results of operations and consequently the price of our common stock.\nOur business is exposed to significant financial risks, most of which are beyond our control, related to interest rates, State & Federal subsidies, the modified accelerated cost recovery system, taxes, and general economic conditions both domestic and internationally. These risks may affect our ability to effect (i) borrowings or to raise capital through the offer and sale of equity-based securities and (ii) the execution of our business plan and product commercialization efforts by thwarting consumer demand for our products, and thereby adversely impacting our potential revenue and profitability.\nAn increase in raw material prices could have negative consequences for our long-term profitability.\nWe face exposure to fluctuations in energy, raw materials, chemicals, and glass and plastic film prices. If we are not able to hedge, compensate or pass on our increased costs through a supply chain or to customers, this could have an adverse impact on our financial results and stability, and deployment of our products.\nRisks Related to Our Technology, Products and Operations\nThe development of our technology is subject to the risks of failure inherent in the development of any novel technology.\nUltimately, the development and commercialization of our technology is subject to a variety of risks that are particular to the development and commercialization of any novel technology, the occurrence of any one of which may adversely affect our operations. These risks include, but are not limited to, the following:\n· our research and development efforts may not produce a commercially viable product;\n· we may not be able to develop an industrial process required to manufacture a commercial product;\n· we may fail to maintain license rights to the SolarWindow® technology (or any of its derivatives);\n· we may fail to develop, acquire, or license various enabling technologies that may be integral to the commercialization of the SolarWindow® (or any of its derivatives);\n· we may fail to integrate our process into an industrial setting for the manufacturing of products;\n· our technology (or any of its derivatives) may ultimately prove to be ineffective, unsafe or otherwise fail to receive necessary regulatory or safe operating approvals;\n· our technology (or any of its derivatives), even if safe and effective, may be difficult to manufacture on a large scale or be uneconomical to market;\n· our marketing license or proprietary rights to products derived from our technology may not be sufficient to protect our products from competitors;\n· the proprietary rights of third parties may preclude us or our collaborators from making, using or marketing products utilizing our technology; or,\n· third parties may market superior, more effective, or less expensive technologies or products having comparable performance and appearance characteristics to the \tLiquidElectricity® Coatings (or any of its derivatives).\nThe success of our research and development activities is uncertain. If such efforts are not successful, we will be unable to generate revenues from our operations and we may have to cease doing business.\nCommercialization of our technology will require significant further research, development, and testing as we must ascertain whether our technology can form the basis for a commercially viable technology or product. If our research and development efforts fail to prove the commercial viability of our technology, we may need to abandon our business model and/or cease doing business, in which case our shares may have no value and you may lose your investment. We anticipate remaining engaged in technology and product development for the foreseeable future.\nIf we ultimately do not obtain the necessary regulatory and safe operation approvals for the commercialization of our technology, we will not achieve profitable operations and your investment may be lost.\nTo commercialize our technology, we may need to obtain regulatory approval from various local, state, federal or international agencies; or approval from global safety certifying organizations that will certify safe operation of our products. At this time, we do not have a product to be submitted for regulatory or safe operating approval. The process for obtaining these approvals may be time consuming and costly, and there is no guaranty that we will be able to obtain such approvals. The failure to obtain any necessary approvals could delay or prevent us from achieving revenue or profitability, which could result in the partial or total loss of your investment.\nWe are operating in a highly fragmented and competitive market and our competitors have several competitive advantages over us.\nOur commercial success will depend on our ability to compete effectively in product development areas such as, but not limited to, building integration, safety, efficacy, ease of use, customer compliance, price, marketing and distribution. Our competitors may succeed in developing products that are more effective than any products derived from our research and development efforts or that would render such products obsolete and non-competitive. The alternative and renewable energy industry is characterized by intense competition, rapid product development and technological change.\nMost of the competition that we encounter is expected to come from companies, research institutions and universities who are researching and developing technologies and products similar to, or are competitive with, any technology we may develop.\nThese companies, research institutions and universities may have several competitive advantages over us, including:\nSignificantly greater name recognition;\nestablished distribution networks;\nmore advanced technologies and product development;\nadditional lines of products, and the ability to offer rebates, higher discounts or incentives to gain a competitive advantage;\nprocesses that are operational and manufacturing prototype or final products;\ngreater experience in conducting research and development, manufacturing, obtaining regulatory approval for products, and marketing approved products; and\nsignificantly greater financial and human resources for product development, sales and marketing, and patent litigation.\nAs a result, we may not be able to compete effectively against these companies or their products.\nAny products developed from our technology will face competition from other companies producing solar power and/or energy harvesting or storage products.\nThe solar power market is intensely competitive and rapidly evolving. Some of our competitors are better capitalized or have more employees than we do; and, unlike us, some have established market positions for their products. There are a number of companies that produce solar power and alternative energy products, which may be competitive with those that we are seeking to develop. Additionally, some of our competitors may be developing or currently producing products based on new solar power and alternative energy technologies that may have a cost basis similar to, or lower than, our projected product costs.\nAccordingly, If we fail to attract and retain customers and establish a successful distribution network for our products, we may be unable to achieve adequate sales and market share; or, if our competitors products, services or technologies become more accepted than ours, or if they are successful in bringing their products or services to market earlier than us our revenues could be adversely affected.\nAs noted above, some of our current (and potential competitors) have significantly greater resources and better competitive positions in certain markets than we do. These factors may allow our competitors to respond more effectively than us to new or emerging technologies and changes in market requirements. Our competitors may develop products, features, or services that are similar to ours or that achieve greater market acceptance, may undertake more far-reaching and successful product development efforts or marketing campaigns, or may adopt more aggressive pricing policies. See Our Business.\nMergers of, or other strategic transactions by, our competitors could weaken our competitive position or reduce our revenue.\nIf one or more of our competitors were to merge or partner with another of our competitors, the change in the competitive landscape could adversely affect our ability to compete effectively. A potential result of such expansion is that certain of our current or potential competitors may be acquired by third parties with greater available resources and the ability to further invest in product improvements and initiate or withstand substantial price competition. Our competitors also may establish or strengthen cooperative relationships with our current or future value-added resellers, third-party consulting firms or other parties with whom we have relationships, thereby limiting our ability to promote our products. Disruptions in our business caused by these events could reduce our revenue.\nTechnological changes could render our products uncompetitive or obsolete, which could prevent us from achieving market share and sales.\nThe alternative and renewable energy industry is rapidly evolving and highly competitive. Our failure to refine or advance our technologies, and to develop and introduce new products on a timely basis could cause our products to become uncompetitive or obsolete, which could prevent us from achieving market share and sales. We will need to invest significant financial resources in additional technology research & development, and product development to keep pace with technological advances in the industry and to compete in the future; however, we may be unable to secure such financing. We believe that a variety of competing solar and alternative or renewable energy technologies may be in development by other companies that could result in lower manufacturing costs and/or higher product performance than those expected for our products. Our development efforts may be hindered or rendered obsolete by the technological advances of others, and other technologies may prove more advantageous for the commercialization of transparent electricity-generating products.\nTo the extent we can develop and commercialize products, if such products do not gain market acceptance, we may not achieve sales and market share.\nThe development of a successful market for our products may be adversely affected by a number of factors, some of which are beyond our control, including:\n· customer, architectural and engineering acceptance of our products;\n· our failure to produce products that compete favorably against other alternative or renewable energy, or solar-photovoltaic power products on the basis of cost, quality, durability, reliability, and performance;\n· our failure to produce products that compete favorably against conventional energy sources and distributed-generation technologies on the basis of cost, quality and performance;\n· our failure to qualify for and secure government grants, tax incentives and any other financial subsidies that may be available to consumers for the implementation of alternative or renewable energy technologies such as solar systems at such time as our products become available for commercial sale, and which potential customers for our products may reasonably expect; and\n· our failure to develop and maintain successful partnerships with manufacturers, distributors, and other resellers, as well as strategic partners.\nIf our products fail to gain market acceptance, we will be unable to achieve sales, market share, or profitability.\nIf organic solar photovoltaic light energy harvesting technologies are not suitable for widespread adoption or sufficient demand for such products does not develop or takes longer to develop than we anticipate, we may not be able to profitably exploit our technology.\nThe market for OPV solar-energy related products is emerging and rapidly evolving, and the market for energy harvesting products is generally unproven and not well established. The success of products for these markets is uncertain.\nIf our OPV solar power or light energy harvesting technologies prove unsuitable for widespread commercial deployment or if demand for such power products fails to develop sufficiently, we would be unable to achieve sales and market share. In addition, demand for such products in the markets and geographic regions we target may not develop or may develop more slowly than we anticipate. Many factors will influence the widespread adoption of organic solar photovoltaic light energy capture and conversion products, including, without limitation, the following:\n· cost-effectiveness of such technologies as compared with conventional and competitive alternative or renewable energy technologies;\n· performance, durability, and reliability of such products as compared with conventional and competitive alternative energy products;\n· success of other alternative or renewable energy technologies such as hydrogen fuel cells, wind turbines, bio-diesel generators, and solar thermal technologies;\n· public concern regarding energy security, the potential risks that may be associated with global warming, the environmental and social impacts of fossil fuel extraction and use;\n· fluctuations in economic and market conditions that impact the viability of conventional and competitive alternative or renewable energy generating products;\n· fluctuations in the prices of fossil fuels or their derivatives;\n· capital expenditures by customers, which tend to decrease when domestic or foreign economies slow;\n· potential deregulation of the electric power industry and broader energy industry initiatives; and\n· availability of government, state, feed-in tariff, and other financial subsidies and incentives.\nOur growth and success depend on our ability to develop new products and services and adapt to market and customer needs.\nThe sectors in which we operate experience rapid and significant changes due to the introduction of innovative technologies. Introducing new technology products and innovative services, which we must do on an ongoing basis to meet customers' needs, requires a significant commitment to research and development, which may not result in success. The company is pre-revenue and may suffer if it invests in technologies that do not function as expected or are not accepted in the marketplace; its products, systems or service offers are not brought to market in a timely manner; or products become obsolete or are not responsive to our customers' needs or requirements.\nOur business model and strategy are based on growth through in-licensing, out-licensing, cross-licensing, acquisitions, joint ventures, and mergers that may be difficult to execute.\nOur business model and strategy are based on growth through in-licensing, out-licensing, cross-licensing, acquisitions, joint ventures, and mergers. External growth transactions are inherently risky because of the difficulties that may arise in integrating people, operations, technologies and products, and the related acquisition, administrative and other costs.\nAs noted above, on a going forward basis, we plan to make acquisitions, which could require significant management attention, disrupt our business, result in dilution to our stockholders, and adversely affect our financial results.\nAs part of our business strategy, we intend to make acquisitions to add specialized employees, complementary companies, products, or technologies. However, we have not made any acquisitions to date, and, as a result, our ability to acquire and integrate larger or more significant companies, products, or technologies in a successful manner is unproven. In the future, we may not be able to find suitable acquisition candidates, and we may not be able to complete acquisitions on favorable terms, if at all. Any acquisitions that we consummate may not achieve our goals and could be viewed negatively by investors. In addition, if we fail to successfully integrate any acquisitions, or the technologies associated with such acquisitions, into our company, the revenue and operating results of the combined company could be adversely affected. Any integration process may require significant time and resources, and we may not be able to manage the process successfully. We may not successfully evaluate or utilize the acquired technology or personnel, or accurately forecast the financial impact of an acquisition transaction, including accounting charges. We may have to pay cash, incur debt, or issue equity securities to pay for any such acquisition, any of which could adversely affect our financial results. The sale of equity or issuance of debt to finance any such acquisitions could result in dilution to our stockholders. The incurrence of indebtedness would result in increased fixed obligations and could also include covenants or other restrictions that would impede our ability to manage our operations.\nWe may be the subject of product liability claims and other adverse effects due to defective products, design faults or harm caused to persons and property.\nOur products may not operate properly or could contain design or fabrication faults or defects, which could give rise to disputes in respect of their performance, degradation and reliability giving rise to liability. Product liability related to defective products could lead to a loss of revenue, claims under warranty, and legal proceedings. Such disputes could result in a fall-off in demand or harm our reputation for product performance, safety, and/or quality.\nWe lack sales and marketing experience and will likely rely on third party marketers.\nWe have limited experience in sales, marketing or distribution of photovoltaic and energy capture and conversion and generating products. We expect to market and sell or otherwise commercialize our technology (or any of its derivatives) through distribution and supply-chain channels, co-marketing, co-promotion, or licensing arrangements with third parties. Therefore, any revenues received by us will be dependent on the efforts of third parties. If any such parties breach or terminate their agreements with us or otherwise fail to conduct marketing activities successfully and in a timely manner, the commercialization of our technology (or any of its derivatives) would be delayed or terminated, which would adversely affect our ability to generate revenues and our profitability.\nWe may not be able to integrate our process and/or technologies into a manufacturing process necessary to produce a manufacturable product.\nWithout sufficient capital, human resources, the appropriate process equipment, or required supply chain, the Company may not be capable of integrating its process and/or technologies into a manufacturing process necessary to produce a manufacturable product. The innovation of our processes and technologies is a crucial strategic concern, with mounting pressure to meet anticipated power, financial, and ROI and IRR for our manufacturers, or sales and distribution channels. If we are unable to integrate our processes and/or technologies into industry, our product innovations can rapidly become obsolete. LiquidElectricity® Coatings and related processes and supply chains are highly complex and continuously exposed to a variety of risks such as microeconomics, macroeconomic, face geopolitical pressures, regulatory requirements, environmental risk and responsibilities, construction risk, and emerging markets. Integration of our processes is critical to product development and revenue generation. If the process cannot be integrated into industry, products, or brought to market in a timely manner, the Company, its potential products, and ability to operate may be threatened. Currently, the integration of our technologies into industrial manufacturing processes is uncertain.\nWhile there are numerous reasons for selecting a manufacturing partner, there is considerable risk in selecting a manufacturing partner that is the correct fit for the Company. The level and severity of risk to the Company is associated with cost, resources and resource management, quality control, scaled production, complicated supply chain, location, corporate culture, management philosophy, market experience, and an adaptable business model. Based on these risks, the Company may not be able to integrate our process or technology into an existing manufacturing process with an acceptable level of risk.\nOur insurance coverage may not be adequate to protect us from all business risks.\nWe may be subject, in the ordinary course of business, to losses resulting from products liability, accidents, acts of God, and other claims against us, for which we may have no insurance coverage. As a general matter, the policies that we do have may include significant deductibles or self-insured retentions, and we cannot be certain that our insurance coverage will be sufficient to cover all future losses or claims against us. A loss that is uninsured or which exceeds policy limits may require us to pay substantial amounts, which could adversely affect our financial condition and operating results.\nRisks Related to International Expansion\nIn fiscal year 2021, we expanded our operations to Asia with a business and corporate development operations office in the Republic of Korea, which, on January 13, 2023, the Board decided to exit.\nIn September 2020, the Company established SolarWindow Asia Co. Ltd., its indirectly, wholly owned South Korean subsidiary (the Korean Subsidiary). The Company experienced difficulties in Korea that ultimately resulted in the Board electing to shut down the Korean Subsidiary. The Company has engaged Korea-based legal counsel and accountants to assist it in winding down the Korea operations and gathering the data necessary to meet its financial reporting requirements. The Company may incur significant future costs related to the closure, and/or potential unknown liabilities which may remain undisclosed by its former Chairman and Chief Executive Officer. Currently, the company is not able to determine when the closure of its Korea Subsidiary will be final.\nThe Company has limited experience in intellectual property, manufacturing, regulatory compliance, and sales in international markets, which may adversely affect our business, results of operations or financial condition should the Company pursue establishing operations in international markets.\nInternational expansion would expose the Company to risks which could have a material impact on our overall operations and ultimate success. These risks, include:\n· protection of intellectual property and trade secrets in foreign jurisdictions in which our US based protections may not be generally recognized or otherwise enforceable;\n· tariffs, customs, trade sanctions, trade embargoes and other barriers to importing/exporting materials and products in a cost-effective and timely manner, or changes in applicable tariffs or custom rules;\n· fluctuations in currency exchange rates;\n· enhanced difficulties of integrating any foreign acquisitions;\n· the burden of complying with and changes in U.S. or international taxation policies;\n· difficulties in staffing and managing global operations and the increased travel, infrastructure, and legal compliance costs associated with multiple international locations;\n· political, social, or economic instability;\n· compliance with statutory equity requirements and management of tax consequences.\n· the impact of public health epidemics on employees and the global economy, such as the coronavirus;\n· difficulties in staffing and managing international operations;\n· compliance with the U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act, and similar laws in other jurisdictions; and\n· risks related to and the burdens of complying with the legal and regulatory environment in foreign jurisdictions, including with respect to privacy, and unexpected changes in laws, regulatory requirements, and enforcement.\nChanges in regulatory, geopolitical, social, economic, or monetary policies and other factors, if any, may have a material adverse effect on our business in the future, or may require us to exit a particular market or significantly modify our current business practices. Abrupt political change, terrorist activity and armed conflict pose a risk of general economic disruption in affected countries, which could also result in an adverse effect on our business and results of operations.\nWe may expand our operations abroad where we have limited operating experience and may be subject to increased business and economic risks that could affect our financial results.\nAs we move forward with our strategy of expanding into new markets, we may enter new international markets where we have limited or no experience in marketing, selling, and deploying our products. Our operations and performance will become significantly more dependent on worldwide economic conditions. Uncertainty about global economic conditions ultimately could have a material negative effect on demand for our products and services and, accordingly, on our business, results of operations and financial condition. In addition to the risks inherent in doing business internationally, as noted above, if we are unable to expand internationally and manage the complexity of our global operations successfully, our financial results could be adversely affected.\nRisks Related to Compliance with Laws and Regulations\nOur products or the application thereof will be subject to environmental, occupational safety & health regulations, including but not limited to Underwriter Laboratory (UL) Certification, European Conformity (CE) Certification, electrical codes, and other state and federal, European Union (EU), and other Country regulations dealing with, among other matters, harmful or hazardous materials.\nOur products will be subject to extensive and increasingly stringent environmental, occupational safety and health regulations and certifications, including but not limited to, Underwriter Laboratory (UL) Certification, electrical codes, and other state and federal, foreign laws, regulations, and standards (Laws & Regulations). If violations of these Laws & Regulations occur, whether unintentional or otherwise, we could be held liable for damages, penalties and costs of remedial actions. These expenses or this liability could have a significant negative impact on our business, financial condition, and results of operations.\nThese Laws & Regulations could become more stringent over time, imposing greater compliance costs, and increasing risks and penalties associated with violations. There can be no guarantee that we will not be required to pay significant fines or compensation because of past, current, or future breaches of Laws & Regulations. This exposure exists even if we are not responsible for the breaches, in cases where they were committed in the past by companies or businesses that were not part of ours that may be exposed to the risk of claims for breaches of these Laws & Regulations. Such claims could adversely affect our financial position and reputation and require unplanned capital investment. If we fail to conduct our business in full compliance with the applicable Laws & Regulations, the judicial or regulatory authorities could require us to conduct investigations, unplanned capital investments, and/or implement costly curative measures.\nOur periodic and other reports filed with various securities regulators subject us to additional compliance expense as well potential liability for any alleged violations of the securities laws and regulations to which we are or may be subject (the Securities Laws & Regulations).\nAs a public company filing periodic and other reports, whether on a mandatory or voluntary basis, with foreign, federal, or state securities regulators (collectively, Securities Regulators), we incur significant accounting, legal and administrative expenses in connection with our efforts to fully comply with the Securities Laws & Regulations. This expense may increase significantly should there be any changes in the Securities Laws & Regulations that impose greater obligations or requirements on us to fully comply. Such costs may adversely impact our other operations including but not limited to, our research and development efforts.\nMoreover, should there be a violation of the Securities Laws & Regulations, we may be subject to fines, penalties and other sanctions that could adversely impact our ability to continue our research, product development and commercialization efforts.\nRisks Related to our Intellectual Property\nOur ability to operate profitably is directly related to our ability to develop, protect, and perfect rights in and to our proprietary technology.\nWe rely on a combination of trademark, trade secret, nondisclosure, know-how, copyright, and patent law to protect our technology, which may afford only limited protection.\nWe may initiate claims or litigation against third parties for infringement of our proprietary rights or to establish the validity, scope or enforceability of our proprietary rights. Any such claims could be time consuming, result in costly litigation, or force us to enter into royalty or license agreements rather than dispute the merits of such claims, requiring us to pay royalties and/or license fees to third parties. There is always a risk that patents, if issued, may be subsequently invalidated, either in whole or in part and this could diminish or extinguish protection for any technology we may license or may adversely affect our ability to fully commercialize our technologies.\nWe generally require our employees, consultants, advisors and collaborators to execute appropriate agreements with us, regarding the confidential information developed or made known to such persons during the course of their engagement by us. These agreements provide that any proprietary technologies developed during such engagement are owned by us and that confidential information pertaining to such technologies will be kept confidential and not disclosed to third parties except in specific circumstances. These agreements also provide for the assignment to us by any such person of any patents issued with respect to any such technologies. If these provisions are breached, we may not be able to fully perfect our rights to the technologies in question, and in some instances, we may not have an appropriate remedy available for the damages that we may incur because of any such breach.\nOur proprietary rights may not adequately protect our technologies and products.\nOur commercial success will depend, in part, on our ability to obtain patents and/or maintain adequate protection for our technologies and products in the United States and other countries. We will be able to protect our proprietary rights from unauthorized use by third parties only to the extent that our proprietary technologies and products are covered by valid and enforceable patents or are effectively maintained as trade secrets.\nWe intend to apply for additional patents for our technologies, applications, processes, and products, as we deem appropriate. We may, however, fail to apply for patents on important technologies, products, or processes in a timely manner, if at all. Our existing patents and any future patents we obtain may not be sufficiently broad to prevent others from practicing our technologies or from developing competing products, processes, or technologies. In addition, the patent positions of alternative energy technology companies are highly uncertain and involve complex legal and factual questions for which important legal principles and regulations or policies remain unresolved. As a result, the validity and enforceability of our patents cannot be predicted with certainty. In addition, we cannot guarantee that:\n· we were the first to make the inventions covered by each of our issued patents and pending patent applications;\n· we were the first to file patent applications for these inventions;\n· we will be able to reduce an invention to fabrication and product practice required for formation beyond conception;\n· others will not independently develop similar or alternative technologies or duplicate any of our technologies;\n· any of our pending patent applications will result in issued patents;\n· any of our patents will be valid or enforceable;\n· any patents issued to us will provide us with any competitive advantages, or will not be challenged by third parties; and\n· we will develop additional proprietary technologies, products, or processes that are patentable, or the patents of others will not have an adverse effect on our business.\nThe actual protection afforded by a patent varies on a product-by-product basis, from country to country and depends on many factors, including the type of patent, the scope of its coverage, the availability of regulatory related extensions, the availability of legal remedies in a particular country and the validity and enforceability of the patents. Our ability to maintain and solidify our proprietary position for our products will depend on our success in obtaining effective claims and enforcing those claims once granted. Our issued patents and those that may be issued in the future, or those licensed to us, may be challenged, invalidated, unenforceable or circumvented, and the rights granted under any issued patents may not provide us with proprietary protection or competitive advantages against competitors with similar products. We also rely on trade secrets to protect some of our technology, especially where it is believed that patent protection is inappropriate or unobtainable. However, trade secrets are difficult to maintain. While we use reasonable efforts to protect our trade secrets, our employees, consultants, contractors, or scientific and other advisors may unintentionally or willfully disclose our proprietary information to competitors. Enforcement of claims that a third party has illegally obtained and is using trade secrets is expensive, time consuming and uncertain. In addition, non-U.S. courts are sometimes less willing than U.S. courts to protect trade secrets. If our competitors independently develop equivalent knowledge, methods, and know-how, we may not be able to assert our trade secrets against them and our business could be harmed.\nWe may not be able to protect our intellectual property rights throughout the world.\nFiling, prosecuting, and defending patents on all our products in every jurisdiction would be prohibitively expensive. Competitors may use our technologies in jurisdictions where we have not obtained patent protection to develop their own products. These products may compete with our products and may not be covered by any patent claims or other intellectual property rights.\nThe laws of some foreign countries do not protect intellectual property rights to the same extent as the laws of the United States, and many companies have encountered significant problems in protecting and defending such rights in foreign jurisdictions. The legal systems of certain countries, particularly certain developing countries, do not favor the enforcement of patents and other intellectual property protection, which could make it difficult for us to stop the infringement of our patents. Proceedings to enforce our patent rights in foreign jurisdictions could result in substantial cost and divert our efforts and attention from other aspects of our business.\nIf we fail to protect our intellectual property rights, our competitors may take advantage of our ideas and compete directly against us.\nOur success will depend, to a significant degree, on our ability to secure and protect intellectual property rights and enforce patent and trademark protections relating to our technology. While we believe that the protection of patents and trademarks is important to our business, we also rely on a combination of copyright, trade secret, nondisclosure and confidentiality agreements, know-how and continuing technological innovation to maintain a competitive position. From time to time, litigation may be advisable to protect our intellectual property position. However, these legal means afford only limited protection and may not adequately protect our rights or permit us to gain or keep any competitive advantage. Any litigation in this regard could be costly, and it is possible that we will not have sufficient resources to fully pursue litigation or to protect our intellectual property rights. This could result in the rejection or invalidation of our existing and future patents. Any adverse outcome in litigation relating to the validity of our patents, or any failure to pursue litigation or otherwise to protect our patent position, could materially harm our business and financial condition. In addition, confidentiality agreements with our employees, consultants, customers, and key vendors may not prevent the unauthorized disclosure or use of our technology. It is possible that these agreements will be breached or that they will not be enforceable in every instance, and that we will not have adequate remedies for any such breach. Enforcement of these agreements may be costly and time consuming. Furthermore, the laws of foreign countries may not protect our intellectual property rights to the same extent as the laws of the United States of America.\nWe may be accused of infringing the intellectual property rights of others.\nWe cannot guarantee that we will not become the subject of infringement claims or legal proceedings by third parties with respect to our current or future technological developments. Any such claims could be time-consuming, result in costly litigation and could ultimately lead to a determination that our technology, or any of its derivatives, infringes on a third party's patent rights.\nWe may need to curtail or cease operations if, in the future, we are unable to obtain additional licenses pursuant to our collaborative development agreements required to maintain our rights to market products, if any, developed by us.\nWe may not retain all rights to developments, inventions, patents, and other proprietary information resulting from any collaborative arrangements, whether in effect as of the date hereof or which may be entered into at some future time with third parties. As a result, we may be required to license such developments, inventions, patents, or other proprietary information from such third parties, possibly at significant cost to us. Our failure to obtain and maintain any such licenses could have a material adverse effect on our business, financial condition, and results of our operations. In particular, the failure to obtain a license could prevent us from using or commercializing our technology.\nOur proprietary rights may not adequately protect our technologies and products.\nOur commercial success will depend, in part, on our ability to obtain patents and/or regulatory exclusivity and maintain adequate protection for our technologies and products in the United States of America and other countries. Our ability to protect our proprietary rights from unauthorized use by third parties only to the extent that our proprietary technologies and products are covered by valid and enforceable patents or are effectively maintained as trade secrets.\nRisks Related to Our Personnel and Management\nWe are dependent upon hiring and retaining highly qualified management and technical personnel.\nCompetition for highly qualified management, technical, and scientific personnel (Personnel) is intense in our industry. Future success depends in part on our ability to attract, hire, assimilate and retain engineers and scientists, sales and marketing personnel, and other qualified personnel, especially in the OPV space with focus in our technologies and products. A key risk is our ability to anticipate our needs for certain key competences and to implement human resource solutions to recruit, hire, or improve these competences. If we are not successful in hiring and retaining qualified Personnel, our ability to execute on our business model and strategy will be adversely affected and our ability to achieve profitability compromised.\nDue to the fact each of our three directors conducts outside business activities and are not our employees, attention and efforts will not be focused solely on our business activities, which may hinder our achieving our business objectives.\nCurrently we have three directors, none of whom provides their full-time efforts to our business activities. While our directors intend to devote as much time as necessary to the success and development of our technology, each has other business interests or employment obligations requiring their time and attention. While each has generally agreed to provide such time and attention to our business activities as may be reasonably required, there can be no assurance that their priorities will not shift in the future and that the amount of time that each devotes to our activities will be sufficient for us to meet our business objectives. If their outside interests begin to take precedence over their positions with the Company, our business will suffer and may adversely impact our goal of achieving profitability through the commercialization of SolarWindow. In this event, if effective corrective action is not taken, investors could lose all or part of their investment.\nDue to our small size each of our officers and consultants has a significant influence on our operations and access to sensitive information, which, if an officer or consultant goes rogue, could result in significant damage to, without limitation, the Companys operations, reputation, financial health, and security of our intellectual property.\nDue to our small size, each of our officers and consultants exercises a significant degree of authority and influence on our operations, and has access to highly sensitive information, including related to our intellectual property and access to the Companys assets. While the Company has implemented various operating procedures and a Code of Ethics and Business Conduct that each person affiliated with the Company is required to review and sign, the Company has no direct control over individual persons actions can make no assurance that one of our officers and consultants will adhere to our operating procedures or act in a manner that is consistent with our Code of Ethics. Nor can the Company provide assurance that an officers and a consultant or a former officers and a consultant may take deliberate action(s) to harm the Company. The potential damages that may result from these unintentional or intentional acts could be materially adverse and result in, but not limited to, loss of capital, loss of assets, weakened intellectual property position because of leaked information, and reputational harm.\nRisks Related To Ownership of Our Common Stock\nWe are not a fully reporting company under the Securities Exchange Act of 1934, as amended, which we refer to as the Exchange Act; therefore, we are subject only to the reporting requirements of Section 15(d) of the Exchange Act.\nWe are not a fully reporting company under the Securities Exchange Act of 1934, as amended (the Exchange Act); therefore, we are subject only to the reporting requirements of Section 15(d) of the Exchange Act. Until our Common Stock is registered under the Exchange Act, we will be subject only to the reporting obligations imposed by Section 15(d) of the Exchange Act, which we refer to as Section 15(d). Section15(d) requires that issuers file periodic and current reports with the U.S. Securities and Exchange Commission (the Commission or the SEC) when they have issued any class of securities for which a registration statement was filed and became effective pursuant to the Securities Act. The purpose of Section 15(d) is to ensure that investors who buy securities in registered offerings are provided with the same information on an ongoing basis that they would receive if the securities they purchased were listed on a securities exchange or the issuer were otherwise subject to periodic reporting obligations. However, companies that are required to report only under Section 15(d) are not subject to some of the Exchange Act reporting requirements. For example, companies that are required to report only under Section 15(d) are not subject to the short-swing profit reporting requirements contained in Section 16 of the Exchange Act, the beneficial ownership reporting requirements contained in Section 13 of the Exchange Act, the institutional investor reporting rules or the third-party tender offer rules, or the Exchange Acts proxy rules contained in Section 14 of the Exchange Act.\nThe reporting obligations under Section15(d) of the Exchange Act are automatically suspended when: (i) any class of securities of the issuer reporting under Section 15(d) is registered under Section 12 of the Exchange Act; or (ii) at the beginning of the issuers fiscal year, other than the year in which the applicable registration statement became effective, if the class of securities covered by the registration statement is held of record by fewer than 300 persons. In the latter case, the Company would no longer be subject to periodic reporting obligations so long as the number of holders remained below 300 unless we filed a registration statement with the Securities and Exchange Commission under Section 12 of the Exchange Act. If our obligation to file reports under Section 15(d) is suspended (other than due to our having registered our common stock under Section 12 of the Exchange Act), then investors will have reduced visibility with respect to the Company, its financial condition, and results of operations.\nUntil our Common Stock is listed on an exchange, we expect to remain eligible for quotation on the OTCPK or on another over-the-counter quotation system. In those venues, however, an investor may find it difficult to obtain accurate quotations for our common stock. In addition, if we fail to meet the criteria set forth in SEC regulations, various requirements would be imposed by law on broker-dealers who sell our securities to persons other than established customers and accredited investors. Consequently, such regulations may deter broker-dealers from recommending or selling our common stock, which may further affect the liquidity of your shares. This would also make it more difficult for us to raise additional capital or attract qualified employees or partners. Please refer to Our common stock is currently quoted on the OTCPK (Current Information) which may make it more difficult for you to purchase or sell shares of the Companys Common Stock below.\nOur common stock is currently quoted on the OTCPK (Current Information) which may make it more difficult for you to purchase or sell shares of the Companys Common Stock.\nThe OTCPK (Current Information) is viewed by most investors as a less desirable, and less liquid, marketplace. As a result, an investor may find it more difficult to purchase, dispose of or obtain accurate quotations as to the value of our common stock. Unless and until we file an application for listing of our shares on a national stock exchange or the OTCQB and such an application is accepted (as to which there is no assurance), we expect that our stock will continue to trade on the OTCPK (Current Information).\nOur common stock is not registered for trading on any national stock exchange and thus, should the price of our stock on the OTCPK (Current Information) fall below five dollars per share and our net tangible assets fall below two million dollars our stock may be deemed a penny stock, in which case, you may find it difficult to, deposit, transfer, sell or purchase the shares of our common stock in open market transactions.\nPenny stocks are those securities that are not listed on a national securities exchange and are priced under $5. There are exclusions for securities of issuers that have net tangible assets greater than $2 million if they have been in operation at least three years or greater than $5 million if in operation less than three years. Securities of issuers with average revenue of at least $6 million for the last three years are also not considered penny stocks.\nMore specifically, under Rule 240.3a51-1 a stock is excluded from the penny stock definition if it meets one of the following tests: 1) A price of over $5 per share, 2) the issuer has Average Revenue of at least $6 million for the last 3 years, or 3) the issuer has Net Tangible Assets in excess of $2 million if the issuer has been in continuous operations for at least 3 years or $5 million if less than 3 years.\nThe value of our net tangible assets for the fiscal years ended August 31, 2023, and 2022 was approximately $7,563,000 and $9,539,000, respectively. Accordingly, we do not believe our stock is a penny stock. And if we continue to satisfy at least one of the foregoing exemptions, our common stock should continue to be deemed penny stock exempt. However, because our stock is not registered for trading on a national stock exchange should we no longer satisfy at least one of the exemption criteria described above, our common stock would be considered a penny stock.\nThe penny stock rules are designed to prevent deceptive or manipulative practices. It provides that a broker cannot sell a penny stock to any person unless it has approved that person's account for penny stock transactions and the broker/dealer has received in writing from customer agreement to the transaction; approving an account includes, among other things, reviewing the customer's financial data and determining the customer's suitability, including the capability to evaluate the risks of trading in penny stocks. Some types of transactions in penny stocks are exempt from these rules. Exempt transactions include those with an established customer (a customer of more than one year or one who has made at least three separate penny stock purchases) and transactions in which the customer is an institutional investor.\nIn addition, the penny stock regulations require that prior to any non-exempt buy/sell transaction in a penny stock, a disclosure schedule proscribed by the SEC relating to the penny stock market must be delivered by a broker-dealer to the purchaser of such penny stock. This disclosure must include the dollar amount of commissions payable to both the broker-dealer and the registered representative and current price quotations for our common stock. The regulations also require that monthly statements be sent to holders of penny stock that disclose recent price information for the penny stock and information of the limited market for penny stocks. Because of these requirements, many brokerage firms will not process transactions involving low price stocks, especially those that come within the definition of a penny stock. Accordingly, these requirements may adversely affect the market liquidity of our common stock.\nShould our common stock be deemed a penny stock, you may find it difficult to deposit, transfer, sell or purchase the shares of our common stock in open market transactions.\nFinancial Industry Regulatory Authority (FINRA) sales practice requirements may also limit a stockholders ability to buy and sell our common stock, which could depress the price of our common stock.\nIn addition to the penny stock rules described above, FINRA has adopted rules that require a broker-dealer to have reasonable grounds for believing that the investment is suitable for that customer before recommending an investment to a customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives, and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. Thus, the FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our shares of common stock, have an adverse effect on the market for our shares of common stock, and thereby depress the per share price of, and liquidity for, our common stock.\nThere is a limited market for our common stock, which may make it difficult for holders of our common stock to sell their stock.\nOur common stock currently trades on the OTC Pink (Current Information) under the symbol WNDW; there is limited and sporadic trading in our common stock. Accordingly, there can be no assurance as to the liquidity of any markets that may develop for our common stock, the ability of the holders of our common stock to sell our common stock, or the prices at which holders may be able to sell our common stock. Further, many brokerage firms will not process transactions involving low price stocks, especially those that come within the definition of a penny stock. If we cease to be quoted, holders of our common stock may find it more difficult to dispose of, or to obtain accurate quotations as to the market value of our common stock, and the market value of our common stock would likely decline.\nThe trading price of our common stock has been and will likely continue to be volatile.\nThe trading price of our common stock has been, and is likely to continue to be, highly volatile and could be subject to wide fluctuations in response to various factors, some of which are beyond our control. From December 31, 2019, through November 10, 2023, the stock price of our common stock has ranged from a low of $0.01 to a high of $39.20 per share. In addition to the factors discussed in these Risk Factors and elsewhere in this report, factors that may cause volatility in our share price include:\n· changes in projected operational and financial results;\n· issuance of new or updated research or reports by securities analysts;\n· market rumors or press reports;\n· announcements of significant transactions;\n· announcements related to our stock repurchase program;\n· the use by investors or analysts of third-party data regarding our business that may not reflect our actual performance;\n· fluctuations in the valuation of companies perceived by investors to be comparable to us;\n· fluctuations in the trading volume of our shares, or the size of our public float relative to the total number of shares of our common stock that are issued and outstanding;\n· share price and volume fluctuations attributable to inconsistent trading volume levels of our shares; and\n· general economic and market conditions.\nIn addition, in recent years, broad stock market indices in general, and smaller capitalization companies in particular, have experienced substantial price fluctuations. In a volatile market, we may experience wide fluctuations in the market price of our common stock. These fluctuations may have a negative effect on the market price of our common stock. Such volatile fluctuations may also make us more susceptible to possible class action lawsuits, which are often initiated following price declines.\nIf securities or industry analysts do not publish, or cease publishing, research or publish inaccurate or unfavorable research about our business or our market, or if they change their recommendations regarding our stock adversely, our stock price and any trading volume could decline.\nThe trading market for our common stock , which is highly volatile, may depend in part on the research and reports that securities or industry analysts publish about us or our business, markets, or competitors. Securities and industry analysts do not currently, and may never, publish research on us or our business. If no securities or industry analysts commence coverage of our company, the trading price for our stock would be negatively affected. If securities or industry analysts initiate coverage, and one or more of those analysts downgrade our stock or publish inaccurate or unfavorable research about our business or our market, our stock price would likely decline. If one or more of these analysts cease coverage of our company or fail to publish reports on us regularly, demand for our stock could decrease, which might cause our stock price and any trading volume to decline.\nThe sale or availability for sale of substantial amounts of our common stock could adversely affect their market price.\nSales of substantial amounts of our common stock in the public market after the filing of a Form S-1, or pursuant to Rule 144, the perception that these sales could occur, could adversely affect the market price of our common stock, and could materially impair our ability to raise capital through equity offerings in the future. Shares held by our existing stockholders may be sold in the public market in the future subject to the restrictions in Rule 144 and Rule 701 under the Securities Act.\nAs of the date of this annual report, we have 53,198,399 shares of common stock outstanding. We cannot predict what effect, if any, market sales of securities held by our significant stockholders or any other stockholder or the availability of these securities for future sale will have on the market price of our common stock.\nAdverse publicity about us and/or our brands, including without limitation, through social media or in connection with brand damaging events and/or public perception, could negatively impact our business.\nNegative claims, publicity or allegations made by Securities Regulators, involving us, our board of directors, our employees and consultants, our brands, our products, services and experiences, consumer data, or any of our key employees, or suppliers, whether arising through social media outlets or short and distort attacks could seriously damage our reputation and the image of our brands, regardless of whether such claims are accurate or true.\nSocial media, which accelerates and potentially amplifies the scope of negative publicity, can increase the challenges we face in attempting to respond to negative claims. Negative attention or scrutiny on us can also possibly result in negative publicity.\nAdverse publicity could also damage our reputation and the image of our brands, undermine consumer confidence in us and reduce long-term demand for our products, even if such adverse publicity is unfounded or not material to our operations. If our reputation, culture, or image is tarnished or receives negative publicity (whether accurate or not), then our business, financial condition, results of operations and liquidity could be materially adversely affected.\nAs a smaller reporting company within the meaning of the Securities Act, we may utilize certain modified disclosure requirements, and we cannot be certain if these reduced requirements will make our common stock less attractive to investors.\nGenerally, a smaller reporting Company or (SRC) is a company that as of the last business day of its most recently completed second quarter: (i) Had a public float of less than $250 million; or (ii) Had annual revenues of less than $100 million and either: (A) No public float; or (B) A public float of less than $700 million. On February 28, 2023, we had a public float of $25,648,000.\nWe are a SRC; and, for as long as we continue to be a SRC, we are exempt from various reporting requirements applicable to other public companies but not to a SRC, including, for example, not being required to have our independent registered public accounting firm audit our internal control over financial reporting under Section 404 of the Sarbanes-Oxley Act, reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements, and exemptions from the requirements of holding a nonbinding advisory vote on executive compensation and stockholder approval of any golden parachute compensation not previously approved. We have in this annual report utilized, and we may in future filings with the SEC continue to utilize, the modified disclosure requirements available to emerging growth companies. As a result, our stockholders may not have access to certain information they may deem important and may therefore find our stock a less attractive investment.\nThe sale by our stockholders of restricted shares, either pursuant to a resale prospectus or Rule 144, may adversely affect our ability to raise the funds we will require to effectuate our business plan.\nAs of the date of this annual report, we had 53,198,399 shares issued and outstanding, of which 35,847,241 are deemed restricted securities or control securities within the meaning of Rule 144. The possibility that substantial amounts of our common stock may be sold into the public market, either under Rule 144, or pursuant to a resale registration statement, may adversely affect prevailing market prices for the common stock and could impair our ability to raise capital in the future through the sale of equity securities because of the perception that future re-sales could decrease our stock price and because of the availability of resale shares to those interested in investing in our common stock. Subject to compliance with our insider trading policies to the extent applicable, sales of such restricted securities or control securities may be made from time to time, at the discretion of the holders of such securities. We may not have knowledge of any such sales until sometime after such sales are made.\nKalen Capital Corporation (KCC), a private corporation solely owned by Mr. Harmel S. Rayat, our Chairman and director, beneficially owns approximately 72.68% of our issued and outstanding stock when giving effect to derivative securities owned by KCC. This ownership interest may preclude you from influencing significant corporate decisions.\nAs of the date of this report, Kalen Capital Holdings LLC, a wholly owned subsidiary of KCC, a private corporation solely owned by Harmel S. Rayat, beneficially owned 50,705,598 shares (inclusive of 16,566,667 shares issuable upon exercise of outstanding warrants), or approximately 72.68% of our outstanding common stock, on a fully diluted basis.\nAs a result, Mr. Rayat, having voting control of 34,138,931shares of our total issued and outstanding 53,198,399 shares, can exercise significant influence over matters requiring stockholder approval, including the election of directors and approval of significant corporate transactions, and will have significant control over our management and policies. Mr. Rayat's interests may be different from yours. For example, he may support proposals and actions with which you may disagree, or which are not in your interest. This concentration of ownership could delay, prevent, or cause a change in control should Mr. Rayat sell all or a portion of his shares of our company or otherwise discourage a potential acquirer from attempting to obtain control of our company, which in turn could reduce the price of our common stock, possibly cause acceleration of vesting of outstanding options, result in limits to the utilization of our net operating loss, and may adversely affect your investment. In addition, Mr. Rayat could use his voting influence to maintain our existing management and Board of Directors (Board) in office, or support or reject other management and Board members) proposals that are subject to stockholder approval, such as the adoption of employee stock plans and significant unregistered and registered financing transactions.\nThe company may be subject to compliance with rules requiring the adoption of certain corporate governance measures, which require control measures for related party transactions, conflicts of interest and similar matters.\nThe Sarbanes-Oxley Act of 2002 (SOX), as well as rule changes proposed and enacted by the SEC, the New York Stock Exchange and the Nasdaq Stock Market, as a result of SOX, require the implementation of various measures relating to corporate governance. These measures are designed to enhance the integrity of corporate management and the securities markets and apply to securities which are listed on those exchanges or the Nasdaq Stock Market.\nA significant requirement that applies to accelerated and large accelerated filers under SOX 404(b), but not to non-accelerated filers, is the requirement that accelerated and large accelerated filers have an internal control over financial reporting (ICFR) auditor attestation. An ICFR auditor attestation requires the independent accounting firm that prepares or issues the issuers financial statement audit report to also attest to, and report on, managements assessment of the effectiveness of the issuers ICFR. SOX Section 404(b), however, exempts non-accelerated filers from the ICFR auditor attestation requirement. As a result of our public float exceeding $75 million (prior to the rule change described below) on February 28, 2018, for our year ended August 31, 2018, the Company was subject to SOX 404(b). As a result of the rule change described below, The Company was not considered an accelerated filer for its fiscal year ended August 31, 2019.\nOn March 12, 2020, the SEC approved amendments to Rule 12b-2 that excludes from the definitions of accelerated filer and large accelerated filer any issuer that is eligible to be a SRC. To be an eligible SRC that is also a non-accelerated filer, a company must have revenues of less than $100 million in the most recent fiscal year and also have a public float of less than $700 million. As a result of the recent amendments to the definition of an SRC and the resulting increase in the thresholds in revenue and public float value, the Company is not subject to the attest requirements of SOX 404(b). However, should our fiscal year revenues exceed $100 million, and our second quarter public float exceed $250 million, the Company will again be subject to SOX 404(b) and the added additional professional fees and management time required to comply SOX 404(b).\nThere are options to purchase shares of our common stock currently outstanding.\nAs of November 10, 2023, we have granted options to purchase shares of our common stock to various persons and entities, under which we could be obligated to issue up to 4,207,400 shares of our common stock. The exercise prices of these options range from $2.32 to $6.21 per share. 3,813,000 of the options contain cashless exercise provisions. If issued, the shares underlying these options would increase the number of shares of our common stock currently outstanding and dilute the holdings and voting rights of our then-existing stockholders.\nThere are warrants to purchase shares of our common stock currently outstanding.\nAs of November 10, 2023, we had outstanding warrants to purchase shares of our common stock to various persons and entities, under which we could be obligated to issue up to 16,666,667 shares of common stock with exercise price of $1.70 per share. Each of the Companys warrants outstanding entitles the holder to purchase one share of the Companys common stock for each warrant share held. The Companys unexercised warrants may be exercised on a cashless basis. If issued, the shares underlying these warrants would increase the number of shares of our common stock currently outstanding and dilute the holdings and voting rights of our then-existing stockholders.\nWe may issue preferred stock which may have greater rights than our common stock.\nOur Articles of Incorporation allow our Board to issue up to 1,000,000 shares of preferred stock. Currently, no shares of preferred stock are issued and outstanding. However, we can issue shares of our preferred stock in one or more series and can set the terms of the preferred stock without seeking any further approval from the holders of our common stock. Any preferred stock that we issue may rank ahead of our common stock in terms of dividend priority or liquidation premiums and may have greater voting rights than our common stock. In addition, such preferred stock may contain provisions allowing it to be converted into shares of common stock, which could dilute the value of our common stock to then current stockholders and could adversely affect the market price, if any, of our common stock.\nThe Company may sell additional equity securities in the future and your ownership interest in the Company may be diluted because of such sales.\nThe Company may sell additional equity securities to fully implement our business plan. Such sales will be made at prices determined by our Board based on factors deemed appropriate at the time; accordingly, such sales by us could be made at prices less than the price of the shares of our common stock purchased, in which case, investors could experience dilution of their investment.\nOur compliance with changing laws and rules regarding corporate governance and public disclosure may result in additional expenses to us which, in turn, may adversely affect our ability to continue our operations.\nKeeping abreast of, and in compliance with, changing laws, regulations and standards relating to corporate governance and public disclosure, including SOX, new SEC regulations and, in the event, we are ever approved for listing on a registered national exchange, such exchange's rules, will require an increased amount of management attention and external resources. We intend to continue to invest all reasonably necessary resources to comply with evolving standards, which may result in increased general and administrative expenses and a diversion of management time and attention from revenue-generating activities to compliance activities. Our failure to adequately comply with any of these laws, regulations, standards, or rules may result in substantial fines or other penalties and could have an adverse impact on our ongoing operations.\nBecause we do not intend to pay dividends for the foreseeable future, you should not purchase our shares if you are seeking dividend income.\nWe currently intend to retain future earnings, if any, to support the development and expansion of our business and do not anticipate paying cash dividends in the foreseeable future. Our payment of any future dividends will be at the discretion of our Board after considering various factors, including but not limited to our financial condition, operating results, cash needs, growth plans and the terms of any credit agreements that we may be a party to at the time. Accordingly, investors must rely on sales of their common stock after price appreciation, which may never occur, as the only way to realize their investment. Investors seeking cash dividends should not purchase our common stock.\nOur articles of incorporation provide for indemnification of officers and directors at our expense and limit their liability, which may result in a major cost to us and hurt the interests of our stockholders because corporate resources may be expended for the benefit of officers and/or directors and may inhibit actions against our officers and directors.\nOur articles of incorporation and applicable Nevada law provide for the indemnification of our directors, officers, employees, and agents, under certain circumstances, against attorneys fees and other expenses incurred by them in any litigation to which they become a party arising from their association with or activities on our behalf. We will also bear the expenses of such litigation for any of our directors, officers, employees, or agents, upon such persons promise to repay us if it is ultimately determined that any such person shall not have been entitled to indemnification. This indemnification policy could result in substantial expenditures by us, which we will be unable to recoup.\nThe provisions of the Nevada Revised Statutes and our bylaws may discourage stockholders from bringing a lawsuit against our directors for breach of their fiduciary duty. The provisions may also have the effect of reducing the likelihood of derivative litigation against directors and officers, even though such an action, if successful, might otherwise benefit us and our stockholders. Furthermore, a stockholders investment may be adversely affected to the extent we pay the costs of settlement and damage awards against directors and officers pursuant to these indemnification provisions. We believe that these amended and restated certificate of incorporation provisions, amended and restated bylaw provisions, indemnification agreements and the insurance are necessary to attract and retain qualified persons as directors and officers.\nWe have been advised that, in the opinion of the SEC, indemnification for liabilities arising under federal securities laws is against public policy as expressed in the Securities Act and is, therefore, unenforceable. In the event that a claim for indemnification against these types of liabilities, other than the payment by us of expenses incurred or paid by a director, officer or controlling person in the successful defense of any action, suit or proceeding, is asserted by a director, officer or controlling person in connection with the securities being registered, we will (unless in the opinion of our counsel, the matter has been settled by controlling precedent) submit to a court of appropriate jurisdiction, the question whether indemnification by us is against public policy as expressed in the Securities Act and will be governed by the final adjudication of such issue. The legal process relating to this matter, if it were to occur, is likely to be very costly and may result in us receiving negative publicity, either of which factors is likely to materially reduce the market and price for our common stock.\nBecause Mr. Harmel S. Rayat, our majority stockholder by virtue of his sole ownership KCC, has been named a defendant, along with RenovaCare, Inc. (a company whose majority stockholder is also Mr. Rayat by virtue of his sole ownership of KCC) and certain other individuals in an enforcement action filed by the SEC in May 2021 (the Enforcement Action), the Company has and may incur ancillary legal costs.\nAlthough not named as a defendant in the Enforcement Action, the Company has incurred approximately $145,000 in legal fees pertaining to counsels privilege review of Company related documentation that has been or may be produced to the SEC by Mr. Rayat, KCC and others in the Enforcement Action and related matters.\nShould the matter involve the Company further, the costs, legal and otherwise, that may be incurred by the Company may increase significantly and require Company personnel to expend more time on the matter, which could adversely affect the Companys operations and ability to secure additional financing as, when, and if needed.\nIt is the Companys understanding that each of Mr. Rayat and RenovaCare, Inc. has denied the SECs allegations of any wrongdoing and are, and intend to continue, defending themselves against such allegations. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nOur corporate office is located at 9375 E. Shea Blvd., Suite 107-B, Scottsdale, AZ 85260. The office is provided free from rent by a shareholder. Item 3. LEGAL PROCEEDINGS\nWe are not party to nor are we aware of any material pending lawsuit, litigation or proceeding.\nPART II  ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information for Common Stock\nOur common stock is quoted on the OTC Pink (Current Information) under the symbol WNDW. Our warrants to purchase common stock are not currently traded on any market.\nAs of November 10, 2023, there were 100 stockholders of record of our common stock, and the closing price of our common stock was $0.70 per share as reported on the OTC Pink (Current Information). Because many of our shares of common stock are held by brokers and other institutions on behalf of stockholders, we are unable to estimate the total number of stockholders represented by these record holders.\nDividend Policy\nWe have not paid any dividends on our common stock and our Board presently intends to continue a policy of retaining earnings, if any, for use in our operations. The declaration and payment of dividends in the future, of which there can be no assurance, will be determined by the Board considering conditions, then existing, including earnings, financial condition, capital requirements and other factors. The Nevada Revised Statutes prohibit us from declaring dividends where, if after giving effect to the distribution of the dividend:\n· We would not be able to pay our debts as they become due in the usual course of business; or\n· Our total assets would be less than the sum of our total liabilities plus the amount that would be needed to satisfy the rights of stockholders who have preferential rights superior to those receiving the distribution.\nExcept as set forth above, there are no restrictions that currently materially limit our ability to pay dividends or which we reasonably believe are likely to limit materially the future payment of dividends on common stock.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe following sets forth certain information regarding the common stock that may be issued upon the exercise of options, warrants and other rights that have been or may be granted to employees, directors, or consultants under all of our equity compensation plans. The 2006 Incentive Stock Option Plan (see below) was our only equity-based compensation plan as of August 31, 2022, and expired on March 17, 2023.\n2006 Incentive Stock Option Plan (Equity Compensation Plan Approved by Security Holders)\nOn October 10, 2006, the Board adopted and approved, and on February 7, 2011, shareholders owning a majority of our issued and outstanding stock approved, our 2006 Incentive Stock Option Plan (the 2006 Plan) that provided for the grant of stock awards, restricted stock purchase offers and stock options to employees, directors, officers, and consultants. On February 1, 2021, the Board extended the 2006 Plan for a period of two years. On January 13, 2023, the Board extended the 2006 Plan for two months. The 2006 Plan expired on March 17, 2023. The 2006 Plan provided for the granting of options to purchase a maximum of 15,000,000 shares of our common stock. Stock options granted to employees under the 2006 Plan generally vest over zero to five years or as otherwise determined by the plan administrator. Stock options to purchase shares of our common stock expire no later than ten years after the date of the grant.\nWe measure all stock-based compensation awards using a fair value method on the date of grant and recognize such expense in our financial statements over the requisite service period. We use the Black-Scholes option pricing model to calculate the fair value of stock option grants. The Black-Scholes option pricing model requires management to make assumptions regarding the option lives, expected volatility, and risk-free interest rates, all of which impact the fair value of the option and, ultimately, the expense that will be recognized over the life of the option.\nThe risk-free interest rate is based on the U.S. Treasury yield curve in effect at the time of grant for a bond with a similar term. We do not anticipate declaring dividends in the foreseeable future. Volatility is calculated based on the historical daily closing stock prices for the same period as the expected life of the option. We use the simplified method for determining the expected term of our plain vanilla stock options.\nPlan Category Number of securities to be issued upon exercise of outstanding options, warrants and rights\n(a) Weighted-average exercise price of outstanding options, warrants and rights\n(b) Number of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\n(c)\nEquity compensation plans approved by security holders (1) 4,207,400 (2) $ 3.04 -\nEquity compensation plans not approved by security holders - - -\nTotal 4,207,400 $ 3.04 -\n(1) Consists of grants under the 2006 Plan as of August 31, 2023.\n(2) Please refer to ITEM 8, Financial Statements NOTE-7 - STOCK OPTIONS, ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE, and ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nRecent Sales of Unregistered Securities\nNone.  Item 7. Managements Discussion and Analysis of Financial condition and results of operations\nThe following Managements Discussion and Analysis (MD&A) is intended to help the reader understand our results of operations and financial condition. The MD&A is provided as a supplement to, and should be read in conjunction with financial statements and the accompanying notes to the financial statements included in this Form 10-K.\nOur discussion and analysis of our financial condition and results of operations is based on our financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities and expenses and related disclosure of contingent assets and liabilities. Management bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nOverview\nWe are a developer of transparent electricity-generating coatings, and methods for their application to various materials (collectively, LiquidElectricity® Coatings). When applied in ultra-thin layers to rigid glass, and flexible glass and plastic surfaces our LiquidElectricity® Coatings transform otherwise ordinary surfaces into photovoltaic devices capable of generating electricity from natural sun, artificial light, and low, shaded, or reflected light conditions while maintaining transparency.\nWe have overcome major technical challenges and achieved many important milestones resulting in an expansion of the potential applications of LiquidElectricity® Coatings which span multiple industries, including architectural, automotive, agrivoltaic, aerospace, commercial transportation and marine. Our LiquidElectricity® Coatings are under development with support from commercial contract firms and at the U.S. Department of Energys National Renewable Energy Laboratory, through Cooperative Research and Development Agreements.\nResearch and Related Agreements\nWe are a party to certain agreements related to the development of our technology.\nStevenson-Wydler Cooperative Research and Development Agreement with the Alliance for Sustainable Energy\nOn March 18, 2011, we entered into the NREL CRADA with Alliance for Sustainable Energy, the operator of the NREL under its U.S. Department of Energy contract to advance the commercial development of our technology. Under terms of the NREL CRADA, NREL researchers make use of our exclusive intellectual property (IP), newly developed IP, and NRELs background IP in order to work towards specific product development goals, established by the Company. Under the terms of the NREL CRADA, we agreed to reimburse Alliance for Sustainable Energy for filing fees associated with all documented, out-of-pocket costs directly related to patent application preparation and filings, and maintenance of the patent applications.\nOn March 6, 2013, we entered into Phase II of our NREL CRADA. Under the terms of the agreement, researchers will additionally work towards:\n· further improving our technology efficiency and transparency;\n· optimizing electrical power (current and voltage) output;\n· optimizing the application of the active layer coatings and application processes which make it possible for LiquidElectricity® Coatings to generate electricity on glass surfaces;\n· developing improved electricity-generating coatings by enhancing performance, processing, reliability, and durability;\n· optimizing LiquidElectricity® Coating performance on flexible substrates; and\n· developing high speed and large area roll-to-roll (R2R) and sheet-to-sheet (S2S) coating application methods required for commercial-scale building integrated photovoltaic (BIPV) products and windows.\nOn December 28, 2015, we executed another modification to the NREL CRADA (the Modification). Under the Modification, (i) the date of completion was extended to December 2017; and (ii) the Company and the NREL will work jointly towards achieving specific product development goals and objectives for the purpose of preparing to commercialize our OPV-based transparent electricity-generating coatings for various applications, including BIPV, glass and flexible plastics.\nOver the course of our collaborative research and development efforts with the NREL under the CRADA, both parties have agreed to modifications to extend the date of completion. The Company and NREL have entered into eleven such No Cost Time Extensions (NCTE). Under the terms of each NCTE, all terms and conditions of the NREL CRADA remain in full force and effect without change. The current NCTE was executed on December 6, 2021, and extends the date of completion to December 31, 2024. As of August 31, 2023, the Company had a capitalized asset balance of $56,698 related to deferred research and development costs for advances to Alliance for Sustainable Energy for work to be performed under the NREL CRADA.\nResults of Operations\nYear ended August 31, 2023, compared to the year ended August 31, 2022\nA summary of our operating expenses for the years ended August 31, 2023, and 2022 follows:\n2023 compared to 2022\nYears Ended August 31, Change Percentage\n($) Change\nOperating expenses:\nSelling, general & administrative $ 1,403,300 $ 1,906,534 $ (503,234 ) -26 %\nResearch and development 748,322 817,046 (68,724 ) -8 %\nStock compensation 159,382 1,024,162 (864,780 ) -84 %\nTotal Operating expense $ 2,311,004 $ 3,747,742 $ (1,436,738 ) -38 %\nSelling, General and Administrative\nSelling, general and administrative (SG&A) costs include all expenditures incurred other than research and development related costs, including costs related to personnel, professional fees, travel and entertainment, public company costs, insurance, and other office related costs. During the year ended August 31, 2023, compared to the year ended August 31, 2022, SG&A costs decreased due to lower personnel costs ($495,000), and professional fees ($44,000), offset by net increases in other administrative costs ($36,000).\nResearch and Product Development\nResearch and Development (R&D) costs represent costs incurred to develop our SolarWindow® technology and are incurred pursuant to our research agreements and agreements with other third-party providers and certain internal R&D cost allocations. Payments under these agreements include salaries and benefits for R&D personnel, allocated overhead, contract services and other costs. R&D costs are expensed when incurred, except for non-refundable advance payments for future research and development activities which are capitalized and recognized as expense as the related services are performed. During the year ended August 31, 2023, compared to the year ended August 31, 2022, R&D costs decreased primarily as a result of lower personnel costs ($100,000), offset by net increases in CRADA costs ($31,000).\nStock Based Compensation\nThe Company grants stock options to its directors, employees and consultants. Stock compensation represents the expense associated with the amortization of our stock options. Expense associated with equity-based transactions is calculated and expensed in our financial statements as required pursuant to various accounting rules and is non-cash in nature. Stock based compensation expense decreased primarily due to current year expense excluding compensation related to the prior year which included expense related to 2,500,000 stock purchase options granted in the fourth quarter of fiscal year ended August 31, 2020, Mr. John Rhee, former President, CEO and Chairman and the tailing off of expense as a result of most other option grants becoming fully vested in our first quarter of fiscal 2023.\nNet loss from continuing operations\nConsolidated net loss from continuing operations decreased $1,624,570 to $2,064,513 for the year ended August 31, 2023, as compared to a net loss of $3,689,083 in the same period of the prior year. The decrease for the year ended August 31, 2023, compared to 2022 is primarily due to lower costs related to stock compensation, personnel, and professional fees.\nNet loss from discontinued operations\nNet loss from discontinued operations of $331,882 in the year ended August 31, 2023, is primarily comprised of costs related to legal and accounting fees ($221,000), personnel ($89,000), and other SG&A ($22,000). Net loss from discontinued operations of $1,259,450 in the year ended August 31, 2022, is primarily comprised of costs related to SG&A ($628,000), legal fees ($66,000), R&D ($185,000), and the impairment of assets ($380,000).\nLiquidity and Capital Resources\nOur primary cash needs are for personnel, professional and R&D related fees and other administrative costs. Our principal sources of liquidity are cash and short-term investments. As of August 31, 2023, and 2022, the Company had cash and short-term investments of $5,992,610 and $8,077,849, respectively. We have financed our operations primarily from the sale of equity and debt securities.\nThe following table presents a summary of our cash flows for the periods indicated:\nYears Ended August 31,\nChange\nNet cash used in operating activities $ (2,084,734 ) $ (3,640,810 ) $ 1,556,076\nNet cash provided by (used in) investing activities (5,500,000 ) 4,643,034 (10,143,034 )\nEffect of exchange rate changes on cash and cash equivalents (505 ) (51,831 ) 51,326\nNet increase (decrease) in cash and cash equivalents $ (7,585,239 ) $ 950,393 $ (8,535,632 )\nOperating Activities - Operating activities consist of net loss adjusted for certain non-cash items, including depreciation, stock-based compensation expense, impairments and the effect of changes in working capital. The amount of cash used during the year ended August 31, 2023 compared to cash used during the year ended August 31, 2022 decreased $1,556,076 due to an approximate decrease in cash layouts related to the Korea office ($702,000), US based personnel ($595,000), CRADA advances ($90,000), other SG&A costs ($49,000), and working capital ($151,000), offset by increased R&D ($31,000) and working capital items ($199,000).\nInvesting Activities - We have used cash primarily for liquid short-term investments, purchases of furniture, office equipment, leasehold improvements, and computers. During February 2023, we purchased $5,500,000 of twelve-month term deposits and $500,000 of a six-month term deposit. During 2022, the Company redeemed a $5,000,000 term deposit offset by $356,966 of capital expenditures.\nIndebtedness\nNone.\nOther Contractual Obligations\nNone.\nOff-Balance Sheet Arrangements\nThere were no off-balance sheet arrangements for the years ended August 31, 2023 and 2022.\nRecently Issued Accounting Standards\nFor more information regarding recent accounting standards and their impact to our results of operations and financial position, see Note 2- Summary of Significant Accounting Policies to our Financial Statements.\nCritical Accounting Policies\nManagements discussion and analysis of financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these consolidated financial statements required the use of estimates and judgments that affect the reported amounts of our assets, liabilities, and expenses. Management bases estimates on historical experience and other assumptions it believes to be reasonable under the circumstances and evaluates these estimates on an on-going basis. Actual results may differ from these estimates. For more information regarding our critical accounting policies, see Note 2- Summary of Significant Accounting Policies to our Financial Statements.\nRelated Party Transactions\nFor a discussion of our Related Party Transactions, see Note-8 - Transactions With Related Persons to our Financial Statements included elsewhere in this Annual Report on Form 10-K. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company does not carry any balances that are materially exposed to market risk. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe report of the independent registered public accounting firm and financial statements listed in the accompanying index are included in Item 15 of this report. See Index to the financial statements on page of this Form 10-K. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nWe maintain a system of disclosure controls and procedures, as defined in Rule 13a-15(e) under the Exchange Act, which are designed to provide reasonable assurance that information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SECs rules and forms. In designing and evaluating our disclosure controls and procedures, our management recognized that any system of controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, as ours is designed to do, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. In addition, the design of any system of controls is also based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Over time, controls may become inadequate because of changes in conditions, or the degree of compliance with policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\nUnder supervision and with the participation of the Acting Principal Executive Officer and Principal Financial Officer (Management), we carried out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures for the Company and its subsidiaries as of August 31, 2023. Based on that evaluation, Management concluded that our disclosure controls and procedures were effective at a reasonable assurance level as of August 31, 2023.\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our internal control over financial reporting is a process designed under the supervision of Management to provide reasonable assurance regarding the reliability of financial reporting and the preparation of our financial statements for external reporting purposes in accordance with US GAAP. Because of inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nAs of August 31, 2023, Management assessed the effectiveness of our internal control over financial reporting using the criteria set forth in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, Management concluded that our internal control over financial reporting was effective as of August 31, 2023.\nBackground\nAs of our fiscal year ended August 31, 2022, and through our third quarter ended May 31, 2023, Management concluded that our internal control over financial reporting was ineffective due to control deficiencies at the subsidiary level that constituted material weaknesses. A material weakness, as defined by COSO, is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is more than a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. Management identified the following material weaknesses in our internal control over financial reporting as of August 31, 2022, and for the nine months ended May 31, 2023:\nDue to jurisdictional challenges of operating the Korean Subsidiary from the U.S., the Company relied upon the cooperation of the Korean Subsidiarys management to maintain adherence to and compliance with the documented internal control procedures, including the dissemination of its financial results and support thereof to the Company, for purposes of consolidating the Companys financial results. Management is unable to assess compliance with the Korean Subsidiarys documented and established policies and procedures due to the management of the Korean Subsidiary failing to provide the financial information required for consolidation thereby resulting in the inability of the Companys auditors to complete their audit of the Korean Subsidiary.\nAlso, due to reductions in staffing during 2022 at the Korean Subsidiary, there were inadequate segregation of duties consistent with control objectives. The Korean Subsidiarys management is comprised of a single individual resulting in a situation where limitations of segregation of duties existed. To remedy this situation, the Korean Subsidiary would need to hire additional staff to provide greater segregation of duties.\nAccordingly, because of identifying the above material weaknesses we concluded that these control deficiencies resulted in a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis by the Companys internal controls.\nManagement believes that the material weaknesses set forth above are intrinsic to our small size and that these weaknesses are limited to the Korean Subsidiary.\nRemedies Employed as of May 31, 2023\nManagement has retained counsel in South Korea to provide legal services with respect to the recovery of its assets, and with the dissolution of the Korean Subsidiary as resolved by the Board on January 13, 2023.\nOn April 25, 2023, management formally removed the Korean Subsidiary management and installed persons affiliated with the Company thus providing management with the authority, not previously held, to direct and oversee the Korean Subsidiary.\nOn May 25, 2023, management engaged a large, professional Korean accounting firm (the Korean Accountants) to provide accounting services, financial reporting, and assist with the dissolution of the Korean subsidiary.\nChanges in Internal Control over Financial Reporting\nThis annual report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting. Our Managements report was not subject to attestation by our independent registered public accounting firm pursuant to the permanent exemption from section 404(b) of the Sarbanes-Oxley Act of 2002 for non-accelerated filers.\nThere were changes to the Companys internal control over financial reporting with respect to the Korean Subsidiary that occurred during the Companys most recent fiscal quarter ended August 31, 2023, that materially affected the Companys internal control over financial reporting. The changes to the internal controls over financial reporting at the Korean Subsidiary include the transfer of oversight for all accounting and reporting functions from the management of the Korean Subsidiary to Management. Additionally, the Company considers the operations of the Korean subsidiary to no longer be material. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDIRECTORS AND EXECUTIVE OFFICERS\nThe following table sets forth the names and ages of all of our directors and executive officers. We have a Board comprised of three members. Each director holds office until a successor is duly elected or appointed. Executive officers serve at the discretion of the Board and are appointed by the Board. Also provided herein are brief descriptions of the business experience of each of the directors and officers during the past five years, and an indication of directorships held by each director in other companies subject to the reporting requirements under the Federal securities law.\nName\nAge\nCurrent Position With Us\nDirector or Officer Since\nHarmel S. Rayat\nChairman and Director\nJanuary 13, 2023\nBob Levine\nDirector\nDecember 7, 2018\nJoseph Sierchio\nDirector\nOctober 1, 2020\nJustin Frere, CPA\nTreasurer, Interim Chief Financial Officer and Secretary (Principal Financial Officer and Principal Accounting Officer)\nJuly 5, 2019\nAmit Singh\nVice President (Acting Principal Executive Officer)\nFebruary 2021\nBusiness Experience\nSet forth below are the names of all our directors and executive officers, all positions and offices held by each person, the period during which each has served as such, and the principal occupations and employment of such persons during at least the last five years, and other director positions held currently or during the last five years:\nCurrent Directors and Officers\nHarmel S. Rayat. Mr. Rayat was appointed to the Board of Directors on January 13, 2023. Mr Rayat previously served the Company in several capacities, including, at various times, as its President and Chief Executive Officer, Chairman and as a member of the Companys Board of Directors. Mr. Rayat has been a long-time majority stockholder and financial supporter of the Company. Mr. Rayat currently holds a 66.99% ownership of the Companys issued and outstanding common stock. Mr Rayats support has been key to advancing SolarWindows technology. Beginning his career in the financial industry as a messenger and mail-room clerk in a stock brokerage firm in 1981, Mr. Rayat has since invested in a wide range of businesses and sectors, including auto wreckers, resource exploration, technologies, artificial liver devices, commercial and retail buildings, and raw land development opportunities. In recent years, Mr. Rayat has narrowed his focus to impact investing, despite the high risks associated with early stage, pre-revenue, and pre-clinical companies. His goal is to help inventors, entrepreneurs, and scientists to create and commercialize products and technologies that will have a beneficial impact on society at large.\nBob Levine. Mr. Levine has been with Avison Young since 1994 and is one of the founding partners of the company which has 120 offices in 25 countries and 5,000 real estate professionals. Since 2008, Avison Young has been one of the fastest growing commercial real estate companies in the world. Having retired from the Board of Directors of Avison Young after 10 years service, Mr. Levine remains on Avison Youngs Executive Committee. Mr. Levine has 40 years of experience in commercial real estate sales, leasing, and advisory roles and has worked with many leading developers, equity partners, and renowned investors. Having consummated many billions of dollars in transactions, he has been responsible for the sale of numerous landmark and Class-A office buildings, shopping centers, industrial properties, and major development sites.\nJoseph Sierchio. Mr. Sierchio has been engaged in the practice of law as the principal of Sierchio Law LLP, our general corporate counsel since August 2019; prior thereto Mr. Sierchio provided legal services to the Company as a partner of Satterlee Stephens LLP, our counsel, from September 2016 to August 2019. Since 1975, Mr. Sierchio has continuously practiced corporate and securities law in New York City, representing, in the United States, domestic and foreign private and public corporations, investors, brokerage firms, and entrepreneurs. Mr. Sierchio is admitted in all New York state courts and federal courts in the Eastern, Northern, and Southern Districts of the State of New York as well as the federal Court of Appeals for the Second Circuit. Mr. Sierchio was invited to join the Board due to his experience representing corporations (public and private) and individuals in numerous and various organizational, compliance, administrative, governance, finance (equity and debt private and public offerings), regulatory and legal matters as well as his familiarity with the Companys business and operations. Mr. Sierchio also served as a director of RenovaCare, Inc. from August 26, 2010, to June 22, 2018. Mr. Sierchio earned his J.D. at Cornell University Law School in 1974, and a B.A., with Highest Distinction in Economics from Rutgers College at Rutgers University in 1971, and where he was also named a Henry Rutgers Scholar.\nJustin Frere, CPA. Mr. Frere has served as the Companys Controller since August of 2011 and was appointed Secretary and Interim Chief Financial Officer on July 5, 2019, and July 22, 2020, respectively. Mr. Frere has over 20 years of experience as a hands-on CFO/Controller level finance and administration professional with extensive operational and analytical experience as a consultant, CFO, and controller for numerous public entities. From 2001 through present, Mr. Frere has been principal of Frontline Accounting performing CFO/controller, and financial analyst services for various public and private domestic and international clients. Mr. Frere has been the primary party responsible for accounting, drafting, and filing SEC Forms and interacting with auditors and the SEC in support of public company reporting. Mr. Frere started his career at KPMG in their assurance practice. Mr. Frere earned a Bachelor of Science in accounting and finance from California Polytechnic State University in San Luis Obispo and MBA from San Diego State University.\nAmit Singh. Has served as the Companys Vice President since February 2021. Mr. Singh has diverse experience with incubating and developing ventures in cleantech and renewables, biomedical devices, drug discovery and development, and financial marketing and advertising. From June 2006 to May 2008, Mr. Singh served as a Risk and Strategy Consultant at Crowe, where he specialized in identifying high-risk areas for public and private companies, specifically detecting weaknesses in business models and helping develop, re-engineer, and implement core business processes. From September 2007 to March 2018, Mr. Singh served as the Executive Director of Sikhcess, a non-profit, where he coordinated the efforts of more than 5,000 global volunteers to break the cycle of homelessness by providing meals, basic needs, education, mentoring, tutoring, and support. Mr. Singh earned his MBA from the University of Michigan in 2006, and an undergraduate business degree from Wayne State University in 2003.\nAll our directors are elected annually to serve for one year or until their successors are duly elected and qualified.\nFamily Relationships and Other Matters\nThere are no family relationships between any of our officers and directors.\nLegal Proceedings\nNone of our directors or officers are involved in any legal proceedings as described in Regulation S-K (§229.401(f)).\nSECTION 16(a) BENEFICIAL OWNERSHIP REPORTING COMPLIANCE\nBecause we do not have a class of equity securities registered pursuant to section 12 of the Exchange Act, we are not required to make the disclosures required by Item 405 of Regulation SK.\nCORPORATE GOVERNANCE\nGeneral\nWe believe that good corporate governance is important to ensure that our company is managed for the long-term benefit of our stockholders. We periodically review our corporate governance policies and practices and compare them to those suggested by various authorities in corporate governance and the practices of other public companies. As a result, we have adopted policies and procedures that we believe are in the best interests of the Company and our stockholders.\nCorporate Governance Guidelines; Code of Conduct and Ethics; Amended and Restated Insider Trading Policy\nOur Corporate Governance Guidelines assist our board of directors in the exercise of its duties and responsibilities and to serve the best interests of SolarWindow and our stockholders. These guidelines, which provide a framework for the conduct of our boards business addresses the role of a director, Board composition, Board meetings, access to management, Board compensation and other topics.\nWe have adopted a Code of Ethics that applies to all of our officers, directors and employees, including our Acting Principal Executive Officer. The Code of Ethics is designed to deter wrongdoing, and to promote, among other things, honest and ethical conduct, full, fair, accurate, timely, and understandable disclosure in reports and documents that we file with, or submit to the SEC, compliance with applicable governmental laws, rules and regulations, the prompt internal reporting of violations of the Code of Ethics, and accountability for adherence to the Code of Ethics.\nWe have adopted an Amended and Restated Insider Trading Policy (the ITP) that applies to all officers, directors, employees, and other persons, such as contractors or consultants who have access to material nonpublic information. The ITP also applies to family members, other members of a persons household and entities controlled by a person covered by the ITP. The purpose of the ITP is to provide guidelines with respect to transactions in the Companys securities and the handling of material nonpublic information about the Company and the companies with which the Company does business. The Companys Board of Directors has adopted this Policy to promote compliance with federal, state and foreign securities laws that prohibit certain persons who are aware of material nonpublic information about a company from: (i) trading in securities of that company; or (ii) providing material nonpublic information to other persons who may trade on the basis of that information. Oversight and implementation of the ITP is performed by the Board and Interim CFO.\nWe have posted a copy of our Corporate Governance Guidelines, Code of Ethics and Business Conduct, and Amended and Restated Insider Trading Policy on the Investor section of our website at https://www.solarwindow.com/investors/corporate-governance/. Our full Board of Directors must approve in advance any waivers of the Code of Ethics. We will post any amendments or waivers from our Code of Ethics that apply to our executive officers and directors on the Corporate Governance section of our website.\nBoard Independence\nWe are not listed on a major U.S. securities exchange and, therefore, are not subject to the corporate governance requirements of any such exchange, including those related to the independence of directors. However, Our Board considers that a director is independent when the director is not an officer or employee of the Company, does not have any relationship which would, or could reasonably appear to, materially interfere with the independent judgment of such director, and the director otherwise meets the independence requirements under the listing standards of FINRA and the rules and regulations of the SEC. Our Board has reviewed the materiality of any relationship that each of our directors has with the Company, either directly or indirectly. Based on this review, our Board has affirmatively determined that one of our three directors, including Bob Levine, qualify as an independent director.\nBoard Leadership Structure\nWe currently have one executive officer, the Interim CFO and Secretary, and three directors; one of which is independent. At present, Mr. Amit Singh serves as our Acting Executive Officer. Mr. Sierchio serves as the Representative Director of SolarWindow Asia Co., Ltd. Actions taken by SolarWindow Asia Co., Ltd. are performed by the Companys South Korean law firm, pursuant to powers of attorney provided by Mr. Sierchio and SolarWindow Asia (USA) Corp.\nOur Bylaws provide our Board with flexibility to combine or separate the positions of Chairman of the Board and Chief Executive Officer in accordance with its determination that utilizing one or the other structure would be in the best interests of our Company and its stockholders. Our Board has reviewed our current Board leadership structure, our size, the nature of our business, the regulatory framework under which we operate, our stockholder base, our peer group and other relevant factors, and has determined that this structure is currently the most appropriate Board leadership structure for our company.\nBoard Committees\nAudit Committee\nThe Board does not currently have a standing Audit Committee. The full Board oversees our accounting and financial reporting processes and the audits of our annual financial statements.\nCompensation Committee\nThe Board does not currently have a standing Compensation Committee. The full Board establishes our overall compensation policies and reviews recommendations submitted by our management.\nNominating Committee\nThe Board does not currently have a standing Nominating Committee. We do not maintain a policy for considering nominees. Our Bylaws provide that the number of Directors shall be fixed from time to time by the Board, but in no event shall be less than the minimum required by law. The Board should be large enough to maintain our required expertise but not too large to function inefficiently. Director nominees are recommended, reviewed, and approved by the entire Board. The Board believes that this process is appropriate due to the number of directors on the Board and the opportunity to benefit from a variety of opinions and perspectives in determining director nominees by involving the full Board.\nWhile the Board is solely responsible for the selection and nomination of Directors, the Board may consider nominees recommended by stockholders as deemed appropriate. The Board evaluates each potential nominee in the same manner regardless of the source of the potential nominees recommendation. Although we do not have a policy regarding diversity, the Board does take into consideration the value of diversity among Board members in background, experience, education, and perspective in considering potential nominees for recommendation to the Board for selection. Stockholders who wish to recommend a nominee should send nominations to Mr. Justin Frere, Interim CFO and Secretary, 9375 E. Shea Blvd., Suite 107-B, Scottsdale, AZ 85260, that includes all information relating to such person that is required to be disclosed in solicitations of proxies for the election of directors. The recommendation must be accompanied by the written consent of the individual to stand for election if nominated by the Board and to serve if elected.\nCompensation Consultants\nWe have not historically relied upon the advice of compensation consultants in determining Named Executive Officer compensation. Instead, the Board reviews compensation levels and makes adjustments based on their personal knowledge of competition in the marketplace, publicly available information, and informal surveys of human resource professionals.\nBoard of Directors Meetings, Committees of the Board of Directors, and Annual Meeting Attendance\nDuring the fiscal year ended August 31, 2023, all directors attended the meetings of the Board. The Board met three (3) times and acted by written consent three (3) times during the fiscal year ended August 31, 2023. We did not have an annual meeting of shareholders during the fiscal year ended August 31, 2023, or 2022.\nBoard Role in Risk Oversight\nRisk is inherent in every business, and how well a business manages risk can ultimately determine its success. We face a number of risks, including strategic risks, enterprise risks, financial risks, and regulatory risks. While our management is responsible for day-to-day management of various risks we face, the Board, as a whole, is responsible for evaluating our exposure to risk and to satisfy itself that the risk management processes designed and implemented by management are adequate and functioning as designed. The Board reviews and discusses policies with respect to risk assessment and risk management. The Board also has oversight responsibility with respect to the integrity of our financial reporting process and systems of internal control regarding finance and accounting, as well as its financial statements. ITEM 11. EXECUTIVE COMPENSATION\nOur Board is responsible for establishing the compensation and benefits for our executive officers. The Board reviews the performance and total compensation package for our executive officers and considers the modification of existing compensation and the adoption of new compensation plans. The board has not retained any compensation consultants.\nThe goals of our executive compensation program are to attract, motivate and retain individuals with the skills and qualities necessary to support and develop our business within the framework of our small size and available resources. We designed our executive compensation program to achieve the following objectives:\n· attract and retain executives experienced in developing and delivering products such as our own;\n· motivate and reward executives whose experience and skills are critical to our success;\n· reward performance; and\n· align the interests of our executive officers and stockholders by motivating executive officers to increase stockholder value.\nSummary Compensation Table\nThe following table summarizes the total compensation paid to or earned by each named executive officer for Fiscal 2023 and Fiscal 2022 :\nName and Principal Position Year Ended August 31,\nSalary ($)\nBonus ($) Option Awards ($)\nAll Other Compensation ($)\nTotal ($)\nJatinder S. Bhogal (1) Former Chief Executive Officer and Director 156,505 368,000 - - 524,505\nJustin Frere (2) Interim Chief Financial Officer and Secretary 120,000 - - - 120,000\n120,000 - 246,000 - 366,000\nJohn Rhee, Former President and Chief Executive Officer. Former Director, President and CEO of SolarWindow Asia Co., Ltd. (3) 26,000 - - - 26,000\n244,000 - - - 244,000\nAmit Singh, Vice President (4) 180,000 - - - 180,000\n160,700 - 73,800 - 234,500\n(1) Effective July 1, 2020, the Company, Mr. Bhogal, and Vector Asset Management, Inc., a Canadian entity wholly-owned by Mr. Bhogal (VAMI), entered into an Executive Consulting Agreement (the ECA) whereby Mr. Bhogal, in addition to his role as a Director, served the Company as its President (On March 1, 2021, Mr. Bhogal resigned as President and Mr. Rhee was appointed President) and Chief Executive Officer (Principle Executive Officer). On January 18, 2022, Mr. Bhogal resigned all of his positions with the Company, including as Chairman and CEO. Pursuant to the ECA, which had an initial term of three years with one-year extensions thereafter, VAMI 1) was paid an annual salary of $410,000; 2) was eligible for a discretionary performance-based annual bonus of up to 40% of the then annual base fee in effect; and 3) received a stock option grant to purchase up to 2,500,000 shares of the Companys common stock which was fully vested as of August 31, 2022.\n(2) Mr. Frere has served as the Companys Controller since August of 2011 and was appointed Secretary on July 5, 2019. Effective July 23, 2020, Mr. Frere was appointed to also serve as the Companys Interim Chief Financial Officer (Principal Financial Officer and Principal Accounting Officer) and Treasurer. Mr. Frere is providing his services on an as needed basis; Mr. Freres engagement is at will and can be terminated by either party on notice. Mr. Freres aggregate fee for his services is $10,000 per month. On October 27, 2021, the Board granted Mr. Frere a stock option to purchase up to 50,000 shares of the Companys common stock with an exercise price of $6.21 per share and which vests as to 50% on April 27, 2022 and 50% on October 27, 2022. The aggregate grant date fair value of the stock option award, determined in accordance with FASB ASC Topic 718, was $4.92 per share. For additional information, see NOTE 6 - Stock Options of our notes to financial statements contained in this annual report.\n(3) On July 1, 2020, the Company appointed John Rhee to the Board of Directors. On August 31, 2020, the Company and Mr. John Rhee entered into an Executive Services Consulting Agreement (the ESCA), which was amended effective March 1, 2021 to appoint Mr. Rhee to the office of President and increase his monthly fee from $10,000 to $22,000. Pursuant to the ESCA as amended, 1) Mr. Rhee provided executive consulting services to the Company, and its directly and indirectly owned subsidiaries; 2) Mr. Rhees engagement pursuant to the ESCA was an at-will engagement; and 3) Mr. Rhee received a stock option grant to purchase up to 2,500,000 shares of the Companys common stock which was fully vested as of August 31, 2022 and expired, in full, on August 31, 2023. Mr. Rhee has no outstanding equity awards. On September 1, 2021, the Board approved an increase in Mr. Rhees monthly salary to $24,640. On January 19, 2022, the Board appointed Mr. Rhee to serve as the Companys Chief Executive Officer. By letter dated May 8, 2022, the Board terminated ESCA as amended effective May 9, 2022. Termination of the ESCA resulted in the automatic termination of Mr. Rhees positions as the President, Chief Executive Officer and Chairman of the Company and all positions held at the Companys subsidiaries. However, due lack of jurisdiction in Korea, the Company was unable to effect Mr. Rhees termination with the Korean Subsidiary and he maintained his position as Representative Director and President of SolarWindow Asia Co., Ltd. through April 25, 2023, the date Mr. Rhee was removed pursuant to an Extraordinary Shareholder Meeting. Mr. Rhee, prior to his removal at the Korean Subsidiary, received approximately $26,000. Additionally, termination of the ESCA did not constitute termination of Mr. Rhees tenure as a member of the Board. Mr. Rhee resigned from the Board effective December 18, 2022.\n(4) Effective July 28, 2020, the Company, Amit Singh, and Damaak Group, LLC, a U.S. entity wholly-owned by Mr. Singh (Damaak), entered into a Business Consulting Agreement (the BCA) whereby Mr. Singh supports the executive management team with corporate finance, business development, media & public relations, brand positioning, technology, and investor engagement. Pursuant to the BCA, which had an initial term of two years, Damaak was paid a monthly fee of $9,250 which was raised to $10,175 effective March 2021 and again raised to $15,000 effective January 2021. On October 27, 2021, the Board granted Mr. Singh a stock option to purchase up to 15,000 shares of the Companys common stock with an exercise price of $6.21 per share and which vests as to 50% on April 27, 2022, and 50% on October 27, 2022. The aggregate grant date fair value of the stock option award, determined in accordance with FASB ASC Topic 718, was $4.92 per share. For additional information, see NOTE 6 - Stock Options of our notes to financial statements contained in this annual report. Although the term of the BCA was through June 30, 2022, Damaak continues to provide services under the BCA.\nOutstanding Equity Awards at Fiscal-Year End\nThe following table sets forth information regarding equity awards that have been previously awarded to each of the Named Executives and which remained outstanding as of August 31, 2023.\nOption Awards\nName\n# of Securities Underlying Unexercised Options Exercisable # of Securities Underlying Unexercised Options Not Currently Exercisable\nOption Exercise Price ($)\nOption Expiration Date\nJatinder S. Bhogal (1) 1,033,000 - 3.54 1/18/2024\n90,000 - 4.87 1/18/2024\n2,500,000 - 2.60 1/18/2024\nJustin Frere (2) 42,500 7,500 3.54 7/5/2025\n50,000 - 6.21 10/27/2031\nAmit Singh (3) 15,000 - 6.21 10/27/2031\n(1) On November 21, 2017, pursuant to the grant of stock options to our Board and certain personnel for their services, the Company granted a stock option to purchase 90,000 shares of our common stock. On July 5, 2019, pursuant to a grant of stock options to our Board and executives for their services, the Company granted a stock option to purchase 1,008,000 and 50,000 shares of our common stock. On July 1, 2020, pursuant to an Executive Consulting Agreement and Stock Option Grant and Grant Agreement both dated June 29, 2020, the Company granted a stock option to purchase 2,500,000 shares of our common stock. Due to his resignation on January 18, 2022, all of Mr. Bhogals stock options expire on January 18, 2024.\n(2) On July 5, 2019, pursuant to a grant of stock options to our Board and executives for their services, the Company granted a stock option to purchase 50,000 shares of our common stock at an exercise price of $3.54 per share and a term of six (6) years. On October 27, 2021, pursuant to a grant of stock options for services, the Company granted a stock option to purchase 50,000 shares of our common stock at an exercise price of $6.21 per share and a term of ten (10) years.\n(3) On October 27, 2021, pursuant to a grant of stock options for services, the Company granted a stock option to purchase 15,000 shares of our common stock at an exercise price of $6.21 per share and a term of ten (10) years.\nTermination and Change of Control\nNot applicable.\nOption Exercises and Stock Vested\nNot applicable.\nCOMPENSATION OF DIRECTORS\nOur directors play a critical role in guiding our strategic direction and overseeing the management of our Company. Ongoing developments in corporate governance and financial reporting have resulted in an increased demand for such highly qualified and productive public company directors. The many responsibilities and risks and the substantial time commitment of being a director of a public company require that we provide adequate incentives for our directors continued performance by paying compensation commensurate with our directors workload. Our non-employee directors are compensated based upon their respective levels of Board participation and responsibilities, including service on Board Committees. Our employee directors receive no separate compensation for their service as directors. Our Board determines the non-employee directors compensation for serving on the Board and its committee(s). In establishing director compensation, the Board is guided by the following goals:\n· compensation should consist of a combination of cash and equity awards that are designed to fairly pay the directors for work required for a company of our size and scope;\n· compensation should align the directors interests with the long-term interests of stockholders; and\n· compensation should assist with attracting and retaining qualified directors.\nFor their services as directors, non-employee directors received cash compensation of $2,500 per quarter during fiscal 2023 and 2022.\nDuring fiscal 2022, the Company granted 15,000 options to Joesph Sierchio and 30,000 options to Bob Levine. The options fair value was calculated to be $4.92 per share using the Black-Scholes Option Pricing Model. No equity-based grants were awarded to the other Board members in fiscal 2022.\nDirector Compensation Table\nThe following table sets forth the compensation earned and paid to each non-employee director for service as a director during Fiscal 2023 and 2022:\nName Fees Earned or Paid in Cash ($) Option Awards ($) Total ($)\nBob Levine 10,000 - 10,000\nJoseph Sierchio 10,000 - 10,000\nTotal 2023 director compensation 20,000 - 20,000\nDirector Compensation - Equity\nThe following table shows the total number of unvested and total option awards held by each of our non-employee directors as of August 31, 2023:\nName Vested Stock Options Outstanding (#) Unvested Stock Options Outstanding (#)\nBob Levine (1) 74,200 7,800\nJoseph Sierchio (1) (2) 115,000 20,000\nTotal 189,200 27,800\n(1) Includes the following option grants: 1) 52,000 options granted on July 5, 2019 ,with a six (6) year life and exercise price of $3.54 per share, and 2) 30,000 options granted on October 27, 2021 with a ten (10) year life and exercise price of $6.21 per share.\n(2) Includes the following option grants: 1) 20,000 options granted on November 21, 2017 with a ten (10) year life and exercise price of $4.87 per share; 2) 50,000 options granted on July 5, 2019 with a six (6) year life and exercise price of $3.54 per share; 3) 50,000 options granted on October 19, 2020 with a six (6) year life and exercise price of $3.42 per share, and 4) 15,000 options granted on October 27, 2021 with a ten (10) year life and exercise price of $6.21 per share.\nLimitation on Directors' Liabilities; Indemnification of Officers and Directors\nOur Amended and Restated Bylaws designate the relative duties and responsibilities of our officers and establish procedures for actions by directors and stockholders and other items. Our bylaws also contain extensive indemnification provisions, which will permit us to indemnify our officers and directors to the maximum extent provided by Nevada law. For additional information, see Exhibit 4.34 to this Annual Report.\nDirectors' and Officers' Liability Insurance\nWe have obtained directors' and officers' liability insurance, which expires on September 30, 2024. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information as of October 1, 2023, by (i) all persons who are known by us to beneficially own more than 5% of our outstanding shares of common stock, (ii) each director, director nominee, and Named Executive Officer; and (iii) all executive officers and directors as a group. To our knowledge, no other person beneficially owns more than 5% of our common stock.\nName and Address of Beneficial Owner (1) Number of shares Beneficially Owned (2) % of Class Owned (2)\nDirectors and Officers\nHarmel S. Rayat (3) 50,705,598 72.68\nBob Levine (4) 386,133 *\nJoseph Sierchio (5) 1,576,567 2.96\nJustin Frere (6) 101,943 *\nAll Directors and Officers as a Group (4 people) 52,770,241 75.28\n5% Shareholders\nKalen Capital Corporation (3)\n688 West Hastings St.\n7th Floor\nVancouver, BC V6B 1P1\n50,705,598 72.68\n* less than 1%\n(1) Beneficial ownership is determined in accordance with SEC rules and generally includes voting or investment power with respect to securities. Each of the beneficial owners listed above has direct ownership of and sole voting power and investment power with respect to the shares of our common stock and except as indicated the address of each beneficial owner is 9375 E Shea Blvd., Suite 107-B, Scottsdale, AZ 85260.\n(2) Calculated pursuant to rule 13d-3(d) of the Exchange Act. Beneficial ownership is calculated based on 53,198,399 shares of common stock issued and outstanding as of November 10, 2023. Under Rule 13d-3(d) of the Exchange Act, shares not outstanding which are subject to options, warrants, rights, or conversion privileges exercisable within 60 days are deemed outstanding for the purpose of calculating the number and percentage owned by such person, but are not deemed outstanding for the purpose of calculating the percentage owned by each other person listed.\n(3) Kalen Capital Corporation is a private Alberta corporation wholly owned by Mr. Harmel Rayat, our Chairman. In such a capacity, Mr. Rayat may be deemed to have beneficial ownership of these shares. The number of shares reflected above based upon the review of our transfer records and information provided to us by Kalen Capital Corporation and includes 34,138,931 shares owned by Kalen Capital Corporation and its wholly owned subsidiary, and 16,566,667 shares issuable upon exercise of a Series T Warrant.\n(4) Includes 276,000 shares of common stock, 33,333 shares of common stock reserved for issuance upon the exercise of a Series T Warrant and 76,800 shares of common stock reserved for issuance upon the exercise of vested stock options granted under the 2006 Plan. Does not include 5,200 shares of common stock reserved for issuance upon exercise of stock options granted under the 2006 Plan that have not yet vested.\n(5) Includes 1,446,567 shares of common stock and 130,000 shares of common stock reserved for issuance upon the exercise of vested stock options granted under the 2006 Plan. Does not include 5,000 shares of common stock reserved for issuance upon exercise of stock options granted under the 2006 Plan that have not yet vested.\n(6) Includes 6,493 shares of common stock and 95,000 shares of common stock reserved for issuance upon the exercise of vested stock options granted under the 2006 Plan. Does not include 5,000 shares of common stock reserved for issuance upon exercise of stock options granted under the 2006 Plan that have not yet vested. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe Board establishes policies and procedures, and sets standards regarding operations and governance. Accordingly, the Company adopted a policy and procedures pertaining to related-party transactions (RPTs) as they relate to the Companys employees, officers and directors.\nThe Board recognizes that RPTs must be managed to prevent the risk of perceived or actual conflicts of interest. The Companys RPT policy and procedures addresses these transactions as they may occur. The Board is responsibe for reviewing and approving RPTs in accordance with the adopted policy and procedures. The Board may review the RPT policy and procedures from time to time and accordingly recommend amendments for consideration and/or implementation.\nThe Board will review and approve all RPTs over $25,000 with the option to review and approve all RPTs if, in their judgment, it would be in the best interests of the Company for the proposed transaction to be reviewed.\nUnder SEC rules (Section 404 (a) of Regulation S-K), a related person is a director, officer, nominee for director, or 5% stockholder of our outstanding shares of common stock since the beginning of the previous fiscal year, and their immediate family members. Immediate family members include spouses, parents, stepparents, children, stepchildren, siblings, mothers- and fathers-in-law, sons- and daughters-in-law, and brothers- and sisters-in-law and anyone residing in such persons home (other than a tenant)\nThe Board has determined that, barring additional facts or circumstances, a related person does not have a direct or indirect material interest in the following categories of transactions:\n· any transaction with another company for which a related persons only relationship is as an employee (other than an executive officer), director, or beneficial owner of less than 10% of that companys shares, if the amount involved does not exceed the greater of $1 million or 2% of that companys total annual revenue;\n· compensation to executive officers determined by the Board;\n· compensation to directors determined by the Board;\n· transactions in which all security holders receive proportional benefits; and\n· banking-related services involving a bank depository of funds, transfer agent, registrar, trustee under a trust indenture, or similar service.\nThe Board reviews transactions involving related persons who are not included in one of the above categories and makes a determination whether the related person has a material interest in a transaction and may approve, ratify, rescind, or take other action with respect to the transaction in its discretion. The Board reviews all material facts related to the transaction and takes into account, among other factors it deems appropriate, whether the transaction is on terms no less favorable than terms generally available to an unaffiliated third party under the same or similar circumstances; the extent of the related persons interest in the transaction; and, if applicable, the availability of other sources of comparable products or services. An interested related party who serves on the Board shall recuse their self from the review and approval of a RPT in which they have an interest in the transaction.\nOur employees are expected to disclose personal interests that may conflict with ours and they may not engage in personal activities that conflict with their responsibilities and obligations to us. Periodically, we inquire as to whether or not any of our Directors have entered into any transactions, arrangements or relationships that constitute related party transactions. If any actual or potential conflict of interest is reported, our Board will review the transaction and relationship disclosed and make a determination regarding appropriatness and recommend modifications to the RPT if the transaction is deemed to present a conflict of interest.\nTransactions with Related Persons\nThe following is a description of each transaction since the beginning of fiscal 2022, and each currently proposed transaction, in which:\nwe have been or are to be a participant;\nthe amount involved exceeds the lesser of $120,000 or 1% of the average of our total assets for the last two completed fiscal years; and\nany of our directors, executive officers, or holders of more than 5% of any class of our capital stock at the time of the transactions in issue, or any immediate family member of or person sharing the household with any of these individuals, had or will have a direct or indirect material interest.\nFor additional information, please refer to see NOTE 8 - Transactions with Related Persons under the Notes to Financial Statements for the Years Ended August 31, 2023, and 2022.\nDirector Independence\nPlease refer to Director Independence under the section titled CORPORATE GOVERNANCE in ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nINDEPENDENT PUBLIC ACCOUNTANTS\nPKF OConnor Davies, LLP (PKF) currently serves as our independent registered public accounting firm to audit our financial statements for the fiscal year ending August 31, 2023. PKF has served as the companys independent registered public accounting firm since May 28, 2020. To the knowledge of management, neither such firm nor any of its members has any direct or material indirect financial interest in us or any connection with us in any capacity otherwise than as independent accountant.\nPRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table represents aggregate fees billed or expected to be billed to us for services related to the fiscal years ended August 31, 2023 and 2022, by PKF:\nAudit Fees (1) $ 54,000 $ 55,750\nAudit Related Fees (2) - -\nTax Fees (3) 6,000 6,675\nAll Other Fees (4) - -\nTotal $ 54,000 $ 62,425\n(1) Consists of fees and expenses billed for professional services rendered in connection with the audit of our consolidated financial statements, reviews of our quarterly consolidated financial statements, related accounting consultations, and services provided in connection with our registration statements, and other regulatory filings.\n(2) Consists of fees billed for assurance and related services that are reasonably related to the performance of the audit or review of our consolidated financial statements and not reported under Audit Fees, such as due diligence related to mergers and acquisitions.\n(3) Tax Fees consist of fees for professional services for domestic and international tax advisory services for tax planning, compliance, and advice.\n(4) Consists of aggregate fees billed for services provided by the independent registered public accounting firm other than those disclosed above.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\n(a) The following documents are filed as a part of this Form 10-K:\n(a)(1) Financial Statements and Schedules\nThe following financial statements, notes related thereto and report of independent auditors, are included in Item 8 of this Form 10-K:\n· Report of Independent Registered Public Accounting Firm;\n· Balance Sheets as of August 31, 2023, and 2022;\n· Statements of Operations and Comprehensive Loss for the years ended August 31, 2023, and 2022;\n· Statements of Stockholders Equity for the years ended August 31, 2023, and 2022;\n· Statements of Cash Flows for the years ended August 31, 2023, and 2022; and\n· Notes to Financial Statements\n(a)(2) Financial Statement Schedules:\nAll schedules have been omitted since they are either not applicable or the information is contained within the accompanying financial statements.\n(b) Exhibit Index\nThe following is a list of exhibits filed as part of this Annual Report on Form 10-K.\nExhibit No.\nDescription of Exhibit\n3.1\nArticles of Incorporation, as amended (Incorporated by reference to the exhibits filed as part of the report on Form 10-Q filed on April 16, 2010)\n3.2\nCertificate of Amendment to the Articles of Incorporation changing name to New Energy Technologies, Inc. (Incorporated by reference to the exhibits filed as part of the report on Form 10-Q on April 16, 2010)\n3.3\nCertificate of Amendment to the Articles of Incorporation increasing the authorized shares from 100,000,000 to 300,000,000 (Incorporated by reference to the Form 8-K filed on March 21, 2011)\n3.4\nCertificate of Change to the Articles of Incorporation relating to the one-for-three reverse stock split (Incorporated by reference to the Form 8-K filed on March 21, 2011)\n3.5\nBy Laws. (Incorporated by reference to the exhibits filed as part of the report on Form 10-Q filed April 16, 2010)\n3.6\nCertificate of Amendment to the Articles of Incorporation changing name to SolarWindow Technologies, Inc. (Incorporated by reference to Form 8-K filed on March 4, 2015)\n4.1\n$3,000,000 Convertible Promissory Note dated October 7, 2013 (Incorporated by reference to the Form 8-K filed on October 10, 2013)\n4.2\nSeries I Stock Purchase Warrant (Incorporated by reference to the Form 8-K filed on October 10, 2013)\n4.3\nRegistration Rights Agreement dated October 7, 2013, entered into between New Energy Technologies, Inc. and Kalen Capital Corporation (Incorporated by reference to the Form 8-K filed on October 10, 2013)\n4.4\nAmendment to Convertible Promissory Note by and between the Company and Kalen Capital Corporation dated November 10, 2014 (Incorporated by reference to Form 8-K filed on November 17, 2014)\n4.5\nAmendment to Bridge Loan Agreement by and between the Company and Kalen Capital Corporation dated November 10, 2014 (Incorporated by reference to Form 8-K filed on November 17, 2014)\n4.6\nForm of Stock Purchase Warrant granted to Kalen Capital Corporation (Incorporated by reference to Form 8-K filed on November 17, 2014)\n4.7\nForm of Stock Award Agreement (Incorporated by reference to the Form 8-K filed on December 19, 2014\n4.8\nForm of Series L Warrant issued to 1420468 Alberta Ltd. (Incorporated by reference to Form 8-K filed on March 10, 2015)\n4.9\nBridge Loan Agreement and Promissory Note by and between the Company and Kalen Capital Corporation dated December 7, 2015 (Incorporated by reference to Form 8-K filed on December 11, 2015)\n4.10\nForm of Series M Warrant issued to Kalen Capital Corporation dated December 7, 2015 (Incorporated by reference to Form 8-K filed on December 11, 2015)\n4.11\nAmendment to Bridge Loan Agreement dated December 7, 2015 (Incorporated by reference to Form 8-K filed on December 11, 2015)\n4.12\nForm of Series M Warrant issued to1420468 Alberta Ltd. dated December 7, 2015 (Incorporated by reference to Form 8-K filed on December 11, 2015)\n4.13\nSecond Amended Bridge Loan Agreement dated December 31, 2015 (Incorporated by reference to Form 8-K filed on January 7, 2016)\n4.14\nForm of Series N Warrant dated December 31, 2015 (Incorporated by reference to Form 8-K filed on January 7, 2016)\n4.15\nLock-Up Agreement dated January 5, 2016 (Incorporated by reference to Form 8-K filed on January 7, 2016)\n4.16\nForm of Series O Stock Purchase Warrant (Incorporated by reference to Form 8-K filed on February 24, 2016)\n4.17\nForm of Series P Stock Purchase Warrant (Incorporated by reference to Form 8-K filed on February 24, 2016)\n4.18\nForm of Subscription Agreement (Incorporated by reference to Form 8-K filed on February 24, 2016)\n4.19\nForm of Series Q Stock Purchase Warrant (Incorporated by reference to Form 8-K filed on June 23, 2016)\n4.20\nForm of Series R Stock Purchase Warrant (Incorporated by reference to Form 8-K filed on June 23, 2016)\n4.21\nForm of Subscription Agreement (Incorporated by reference to Form 8-K filed on June 23, 2016)\n4.22\nForm of Registration Rights Agreement dated June 20, 2016 (Incorporated by reference to Form 8-K filed on June 23, 2016)\n4.23\nForm of Series S-A Stock Purchase Warrant (Incorporated by reference to Form 8-K filed on July 28, 2017)\n4.24\nForm of Subscription Agreement (Incorporated by reference to Form 8-K filed on July 28, 2017)\n4.25\nForm of Registration Rights Agreement dated July 24, 2017 (Incorporated by reference to Form 8-K filed on July 28, 2017)\n4.26\nForm of Series S Stock Purchase Warrant dated September 29, 2017 (Incorporated by reference to Form 8-K filed on September 29, 2017)\n4.27\nForm of Subscription Agreement (Incorporated by reference to Form 8-K filed on September 29, 2017)\n4.28\nForm of Registration Rights Agreement dated September 29, 2017 (Incorporated by reference to Form 8-K filed on September 29, 2017)\n4.29\nAmendment to the 2014 Amended Bridge Loan Agreement dated November 3, 2017 (Incorporated by reference to Form 8-K filed on November 9, 2017)\n4.30\nThird Amendment to the 2015 Bridge Loan Agreement dated November 3, 2017 (Incorporated by reference to Form 8-K filed on November 9, 2017)\n4.31\nForm of Series T Stock Purchase Warrant dated November 26, 2018 (Incorporated by reference to Form 8-K filed on November 29, 2018)\n4.32\nForm of Subscription Agreement for Units Dated November 26, 2018 (Incorporated by reference to Form 8-K filed on November 29, 2018)\n4.33\nAmended and Restated Articles (Incorporated by reference to Form 10-K filed on November 18, 2019)\n4.34\nAmended and Restated Bylaws (Incorporated by reference to Form 10-K filed on November 18, 2019)\n4.35\nForm of Stock Option Agreement dated August 31, 2020 (Incorporated by reference to Form 8-K filed on September 4, 2020)\n10.1\nForm of Lock-Up Agreement dated November 15, 2016, between SolarWindow, Inc. and each of John A. Conklin, Alastair Livesey and Joseph Sierchio (Incorporated by reference to the Form 8-K filed on November 18, 2016)\n10.2\nForm of Lock-Up Agreement dated January 5, 2016, between SolarWindow Technologies, Inc. and each of John A. Conklin, Alastair Livesey and Joseph Sierchio (Incorporated by reference to Form 8-K filed on January 7, 2016)\n10.3\nProcess Integration and Production Agreement dated August 2, 2017 by and between SolarWindow Technologies, Inc. and TriView Glass Industries, LLC, (Incorporated by reference to Form 8-K filed on August 8, 2017)\n10.4\nConsulting agreements dated July 7, 2017 (Incorporated by reference to Form 8-K filed on July 13, 2017)\n10.5\nModification to the Stevenson-Wydler Cooperative Research and Development Agreement dated December 28, 2015 (Incorporated by reference to Form 8-K filed on January 4, 2016)\n10.6§\nEmployment Agreement dated January 1, 2014, between New Energy Technologies, Inc. and John A. Conklin (Incorporated by reference to the Form 8-K filed on January 31, 2014)\n10.7§\nEmployment Agreement dated December 27, 2017, between SolarWindow Technologies, Inc. and John A. Conklin (Incorporated by reference to the Form 8-K filed on January 3, 2018)\n10.8\nRedacted copy of the CRADA Modification (Incorporated by reference to the Form 8-K filed on March 22, 2018)\n10.9\nAmendment to the March 2015 Loan Agreement dated November 26, 2018 (Incorporated by reference to Form 8-K filed on November 29, 2018)\n10.11\nAmendment to the 2013 Note as amended dated November 26, 2018 (Incorporated by reference to Form 8-K filed on November 29, 2018)\n10.12\nLease dated May 1, 2019 between Rose Claudia of the Vestal Professional Building and Registrant for 300 Main Street, Suite 6, Vestal, New York (Incorporated by reference to Form 10-Q filed on July 9, 2019)\n10.13\nExecutive Consulting Agreement dated June 29, 2020 having an effective date of July 1, 2020 by and among SolarWindow Technologies, Inc., Vector Asset Management, Inc., and Jatinder S. Bhogal (Incorporated by reference to Form 10-Q filed on July 8, 2020)\n10.14\nStock Option Grant and Grant Agreement dated as of June 29, 2020 between SolarWindow Technologies, Inc., Jatinder S. Bhogal and Vector Asset Management, Inc. and having an effective date of July 1, 2020 (Incorporated by reference to Form 10-Q filed on July 8, 2020)\n10.15\nExecutive Services Consulting Agreement dated August 31, 2020, between SolarWindow Technologies, Inc. and John Rhee, an individual (Incorporated by reference to Form 8-K filed on September 4, 2020)\n10.16\nNon-statutory Stock Option Agreement dated as of August 31, 2020 between SolarWindow Technologies, Inc., and John Rhee, an individual (Incorporated by reference to Form 8-K filed on September 4, 2020)\n10.17\nStock Option Grant and Grant Agreement dated as of October 19, 2020 between SolarWindow Technologies, Inc., and Joseph Sierchio (Incorporated by reference to Form 8-K filed on September 4, 2020)\n10.18\nAmendment dated March 1, 2021 to the Executive Services Consulting Agreement dated as of August 31, 2020, between SolarWindow Technologies, Inc., and John Rhee, an individual (Incorporated by reference to Form 10-Q filed on January 8, 2021).\n10.19\nSeparation and Release of Claims Agreement dated January 18, 2022 by and among SolarWindow Technologies, Inc. and Vector Asset Management, Inc. and Jatinder S. Bhogal (Incorporated by reference to the Companys Form 8-K filed on January 24, 2022).\n10.20\nForm of Equipment Purchase Agreement dated February 10, 2022 between SolarWindow Asia Co., Ltd and WI-A Corporation (Incorporated by reference to the Companys Form 10-Q filed on April 8, 2022).\n17.0\nTermination Notice dated May 8, 2022 (incorporated by reference to the Companys Form 8-K filed on May 13, 2022).\n99.0\nNotice of Civil Claim, Endorsement on Originating Pleading or Petition for Service Outside British Columbia Notice of Application - Without Notice; Affidavit (incorporated by reference to the Companys Form 8-K filed on June 15, 2022)\n99.1§\n2006 Incentive Stock Option Plan (Incorporated by reference to the Form S-8 filed on March 15, 2011)\n31.1\nCertification of the Acting Principal Executive Officer pursuant to Rule 13a-14 of the Securities Exchange Act of 1934, As Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002*\n31.2\nCertification of the Principal Financial Officer pursuant to Rule 13a-14 of the Securities Exchange Act of 1934, As Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002*\n32.1\nCertification of Acting Principal Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002*\n101.INS\nInline XBRL Instance Document**\n101.SCH\nInline XBRL Taxonomy Extension - Schema Document**\n101.CAL\nInline XBRL Taxonomy Extension - Calculation Linkbase Document**\n101.DEF\nInline XBRL Taxonomy Extension - Definition Linkbase Document**\n101.LAB\nInline XBRL Taxonomy Extension - Label Linkbase Document**\n101.PRE\nInline XBRL Taxonomy Extension - Presentation Linkbase Document**\nCover Page Interactive Data File (embedded within the Inline XBRL Document)\n*Filed herewith.\n§ Management contract or compensatory plan.\n** Furnished herewith. XBRL (eXtensible Business Reporting Language) information is furnished and not filed or a part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933, as amended, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, and otherwise is not subject to liability under these sections.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Sections 13 or 15(d) of the Securities and Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nSolarWindow Technologies, Inc.\nBy: /S/ Amit Singh\nAmit Singh\nVice President (Acting Principal Executive Officer)\nDate: November 21, 2023\nBy: /S/ Justin Frere, CPA\nJustin Frere, CPA\nInterim Chief Financial Officer\n(Principal Financial Officer and Principal Accounting Officer)\nDate: November 21, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Harmel S. Rayat Chairman and Director November 21, 2023\nHarmel S. Rayat\n/s/Bob Levine Director November 21, 2023\nBob Levine\n/s/ Joseph Sierchio Director November 21, 2023\nJoseph Sierchio\nSOLARWINDOW TECHNOLOGIES, INC.\nPage\nReports of Independent Registered Public Accounting Firm\nBalance Sheets as of August 31, 2023, and 2022\nStatements of Operations and Comprehensive Loss for the Years Ended August 31, 2022, and 2022\nStatements of Stockholders Equity for the Years Ended August 31, 2023, and 2022\nStatements of Cash Flows for the Years Ended August 31, 2023, and 2022\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and\nStockholders of SolarWindow Technologies, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of SolarWindow Technologies, Inc. (the Company) as of August 31, 2023 and 2022, and the related consolidated statements of operations and comprehensive loss, consolidated stockholders equity, and consolidated cash flows for each of the two years in the in the period ended August 31, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2023 and 2022, and the results of its operations and its cash flows for each of the two years in the period ended August 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\nWe have served as the Companys auditor since 2020.\n/s/ PKF OConnor Davies, LLP\nNew York, New York\nNovember 21, 2023\nPCAOB ID No. 127\n* * * * *\nSOLARWINDOW TECHNOLOGIES, INC.\nCONSOLIDATED BALANCE SHEETS\nAugust 31,\nASSETS\nCurrent assets\nCash and cash equivalents $ 492,610 $ 8,077,849\nShort-term investments 5,500,000 -\nDeferred research and development costs 56,698 153,799\nPrepaid expenses and other current assets 241,668 87,232\nCurrent assets of discontinued operations 13,522 43,599\nTotal current assets 6,304,498 8,362,479\nProperty and Equipment, net of accumulated depreciation of $125,128 and $110,418, respectively 1,315,282 1,329,992\nTotal assets $ 7,619,780 $ 9,692,471\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities\nAccounts payable and accrued expenses $ 114,092 $ 60,791\nRelated party payables 37,025 -\nCurrent liabilities of discontinued operations 136,109 57,585\nTotal current liabilities 287,226 118,376\nTotal liabilities 287,226 118,376\nCommitments and contingencies - -\nStockholders' equity\nPreferred stock: $0.10 par value; 1,000,000 shares authorized, no shares issued and outstanding - -\nCommon stock: $0.001 par value; 300,000,000 shares authorized, 53,198,399 shares issued and outstanding at August 31, 2023 and 2022 53,198 53,198\nAdditional paid-in capital 82,735,384 82,576,002\nAccumulated other comprehensive (loss) (78,159 ) (73,631 )\nRetained deficit (75,377,869 ) (72,981,474 )\nTotal stockholders' equity 7,332,554 9,574,095\nTotal liabilities and stockholders' equity $ 7,619,780 $ 9,692,471\n(The accompanying notes are an integral part of these consolidated financial statements)\nSOLARWINDOW TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nYears Ended August 31,\nRevenue $ - $ -\nOperating expenses\nSelling, general and administrative 1,546,177 2,845,766\nResearch and development 764,827 901,976\nTotal operating expenses 2,311,004 3,747,742\nLoss from operations (2,311,004 ) (3,747,742 )\nOther income (expense)\nInterest income 246,491 45,099\nOther income - 13,560\nTotal other income (expense) 246,491 58,659\nNet loss from continuing operations $ (2,064,513 ) $ (3,689,083 )\nNet loss from discontinued operations (331,882 ) (1,259,450 )\nNet loss $ (2,396,395 ) $ (4,948,533 )\nOther comprehensive income (loss)\nForeign currency translation gain/(loss) (4,528 ) (58,759 )\nComprehensive income (loss) $ (2,400,923 ) $ (5,007,292 )\nLoss per Share from continuing operations basic and diluted $ (0.04 ) $ (0.07 )\nLoss per Share from discontinued operations basic and diluted $ (0.01 ) $ (0.02 )\nLoss per Share basic and diluted $ (0.04 ) $ (0.09 )\nWeighted average number of common shares outstanding - basic and diluted 53,198,399 53,198,399\nSOLARWINDOW TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\nAdditional Accumulated Other\nTotal\nCommon Stock Paid-in Comprehensive Retained Stockholders'\nShares Amount Capital Income (Loss) Deficit Equity\nBalance, August 31, 2021 53,198,399 $ 53,198 $ 81,551,840 $ (14,872 ) $ (68,032,941 ) $ 13,557,225\nStock based compensation due to common stock purchase options - - 1,024,162 - - 1,024,162\nForeign currency translation adjustments - - - (58,759 ) - (58,759 )\nNet loss for the year ended August 31, 2022 - - - - (4,948,533 ) (4,948,533 )\nBalance, August 31, 2022 53,198,399 53,198 82,576,002 (73,631 ) (72,981,474 ) 9,574,095\nStock based compensation due to common stock purchase options - - 159,382 - - 159,382\nForeign currency translation adjustments - - - (4,528 ) - (4,528 )\nNet loss for the year ended August 31, 2023 - - - - (2,396,395 ) (2,396,395 )\nBalance, August 31, 2023 53,198,399 $ 53,198 $ 82,735,384 $ (78,159 ) $ (75,377,869 ) $ 7,332,554\n(The accompanying notes are an integral part of these consolidated financial statements)\nSOLARWINDOW TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears Ended August 31,\nCash flows from operating activities\nLoss from continuing operations $ (2,064,513 ) $ (3,689,083 )\nLoss from discontinued operations (331,882 ) (1,259,450 )\nAdjustments to reconcile net loss to net cash flows used in operating activities:\nDepreciation 14,709 30,024\nStock based compensation expense 159,382 1,024,162\nImpairment of assets - 380,220\nChanges in operating assets and liabilities:\nDeferred research and development costs 97,101 (31,467 )\nPrepaid expenses and other assets (124,063 ) (46,064 )\nAccounts payable and accrued expenses 99,078 65,598\nRelated party payable 65,454 (114,750 )\nNet cash used in operating activities (2,084,734 ) (3,640,810 )\nCash flows from investing activities\nPurchase of short-term investments (6,000,000 ) -\nRedemption of short-term investments 500,000 5,000,000\nCapital expenditures - (356,966 )\nNet cash provided by (used in) investing activities (5,500,000 ) 4,643,034\nEffect of exchange rate changes on cash and cash equivalents (505 ) (51,831 )\nNet increase (decrease) in cash and cash equivalents (7,585,239 ) 950,393\nCash and cash equivalents at beginning of year 8,077,849 7,127,456\nCash and cash equivalents at end of year $ 492,610 $ 8,077,849\n(The accompanying notes are an integral part of these consolidated financial statements)\nSOLARWINDOW TECHNOLOGIES, INC.\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED AUGUST 31, 2023 AND 2022\nNOTE 1 - Organization and Liquidity\nOrganization\nSolarWindow Technologies, Inc. was incorporated in the State of Nevada on May 5, 1998 (SWT and together with its controlled subsidiary companies, collectively, the Company). SolarWindow® technology harvests light energy from the sun and from artificial light sources using a transparent and ultra-lightweight coating of organic photovoltaic (OPV) solar cells applied to glass and plastics, thereby generating electricity. The Companys ticker symbol is WNDW.\nOn August 24, 2020, the SolarWindow Technologies, Inc. formed wholly owned SolarWindow Asia (USA) Corp., a Nevada Corporation, as the holding company for SolarWindow Asia Co. Ltd., (the Korean Subsidiary) a company formed in the Republic of Korea for the purpose of expansion into the Asian markets.\nDuring the year ended August 31, 2022, the Company recognized an impairment of certain assets related to the Korean Subsidiary totaling $380,220. The impairment was recognized due to the Companys inability to obtain from the management of the Korean Subsidiary the complete financial statements and related documentation thereby placing into doubt the recoverability of assets located in South Korea. Any amounts that become recoverable will be recognized accordingly. On January 13, 2023, the Board formally elected to dissolve the Korean Subsidiary. SWT has retained accountants and counsel in South Korea to assist in the dissolution of the Korean Subsidiary.\nLiquidity\nThe Company has not generated any revenue since inception and has sustained recurring losses and negative cash flows from operations since inception. We expect to incur losses as we continue to develop and further refine and promote our technologies and potential product applications. As of August 31, 2023, the Company had $5,992,610 of cash, cash equivalents and short-term investments on hand, and working capital of $6,017,272. The Company believes that it currently has sufficient cash to meet its funding requirements over the next twelve months following the issuance of this Annual Report on Form 10-K. However, the Company has experienced and continues to experience negative cash flows from operations, as well as an ongoing requirement for substantial additional capital investment. The Company expects that it may need to raise additional capital to accomplish its business plan. If additional funding is required, the Company expects to seek to obtain that funding through financial or strategic investors. There can be no assurance as to the availability or terms upon which such financing and capital might be available.\nNOTE 2 - Summary of Significant Accounting Policies\nBasis of presentation and Use of Estimates\nThe Management of the Company is responsible for the selection and use of appropriate accounting policies and their application. Critical accounting policies and practices are those that are both most important to the portrayal of the Companys financial condition and results and require managements most difficult, subjective, or complex judgments, often as a result of the need to make estimates about the effects of matters that are inherently uncertain. The Companys significant and critical accounting policies and practices are disclosed below as required by generally accepted accounting principles.\nBasis of presentation\nThe accompanying consolidated financial statements and related notes have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the accounting period. The Company considers its accounting policies relating to stock-based compensation to be the most significant accounting policy that involves management estimates and judgments. The Company has made accounting estimates based on the facts and circumstances available as of the reporting date. Actual amounts could differ from these estimates, and such differences could be material.\nFiscal Year-End\nThe Companys quarterly periods end on November 30, February 28 and May 31 with August 31 being the Companys fiscal year end.\nPrinciples of Consolidation\nThese consolidated financial statements presented are those of SolarWindow Technologies, Inc. and its wholly owned subsidiaries, SolarWindow Asia (USA) Corp., and SolarWindow Asia Co. Ltd. All significant intercompany balances and transactions have been eliminated.\nCash and Highly Liquid Investments\nCash includes cash on hand and highly liquid investments with original maturities of three months or less from the date of purchase. The Company had $5,992,610 of cash and short-term deposits as of August 31, 2023, including $134,218 held in the US and covered by FDIC insurance, and $5,857,681 held in Canadian bank accounts with $5,783,777 in excess of Canadian Deposit Insurance Corporation insured limits.\nSchedule of cash and short-term investments\nAugust 31,\nCash $ 492,610 $ 8,077,849\nShort-term investments 5,500,000 -\nTotal cash and short-term investments $ 5,992,610 $ 8,077,849\nShort-term investments\nThe Company determines the balance sheet classification of its investments at the time of purchase and evaluates the classification at each balance sheet date. Money market funds, certificates of deposit, and time deposits with maturities of greater than three months but no more than twelve months are carried at cost, which approximates fair value and are recorded in the consolidated balance sheets in short-term investments. As of August 31, 2023, short-term investments consists of a 12-month $4,000,000 fixed-term deposit earning interest of 5.3%, and a 12-month $1,500,000 fixed term deposit earning interest of 4.25% purchased in February 2023.\nFair Value Measurements\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The Company utilizes a three-tier fair value hierarchy which prioritizes the inputs used in measuring fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurements). These tiers include:\nLevel 1, defined as observable inputs such as quoted prices for identical instruments in active markets;\nLevel 2, defined as inputs other than quoted prices in active markets that are either directly or indirectly observable such as quoted prices for similar instruments in active markets or quoted prices for identical or similar instruments in markets that are not active; and\nLevel 3, defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions, such as valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nDuring the periods covered by this report, the Company did not have any assets or liabilities that were required to be measured at fair value on a recurring basis or on a non-recurring basis.\nFair Value of Financial Instruments\nThe Companys financial instruments consist of accounts payable and accrued expenses. The carrying amounts of the Companys financial instruments approximate fair value because of the short-term maturity of these items. These fair value estimates are subjective in nature and involve uncertainties and matters of significant judgment and, therefore, cannot be determined with precision. Changes in assumptions could significantly affect those estimates. We do not hold or issue financial instruments for trading purposes, nor do we utilize derivative instruments.\nStock-Based Compensation\nThe Company accounts for stock-based compensation in accordance with Accounting Standards Codification (ASC) 718, Stock Based Compensation. ASC 718 requires all stock-based payments to directors, employees and consultants, including grants of stock options, to be recognized in the consolidated statements of operations based on their fair values. The Company uses the Black-Scholes option pricing model (the Black-Scholes Model) to determine the weighted-average fair value of options granted and recognizes the compensation expense of stock-based awards on a straight-line basis over the vesting period of the award. If a stock-based award contains performance-based conditions, at the point that it becomes probable that the performance conditions will be met, the Company records a cumulative catch-up of the expense from the grant date to the current date, and then amortizes the remainder of the expense over the remaining service period. Management evaluates when the achievement of a performance-based condition is probable based on the expected satisfaction of the performance conditions as of the reporting date.\nThe determination of the fair value of stock-based payment awards utilizing the Black-Scholes option pricing model requires the use of the following assumptions: expected volatility of our common stock, which is based on our own calculated historical rate; expected life of the option award, which we elected to calculate using the simplified method; expected dividend yield, which is 0%, as we have not paid and do not have any plans to pay dividends on our common stock; and the risk-free interest rate, which is based on the U.S. Treasury rate in effect at the time of grant with maturities equal to the stock option awards expected life. The Company evaluates the assumptions used to value the awards at each grant date and if factors change and different assumptions are utilized, stock-based compensation expense may differ significantly from what has been recorded in the past. If there are any modifications or cancellations of the underlying unvested securities, the Company may be required to accelerate, increase or cancel any remaining unearned stock-based compensation expense. Forfeitures are accounted for as they occur. See NOTE 5 - Common Stock and Warrants and NOTE 5 - Stock Options for additional information on the Companys stock-based compensation plans.\nProperty and Equipment\nFixed assets are carried at cost, less accumulated depreciation. Major improvements are capitalized, while repair and maintenance are expensed when incurred. Renewals and betterments that materially extend the life of the assets are capitalized. When assets are retired or otherwise disposed of, the cost and related accumulated depreciation are removed from the accounts, and any resulting gain or loss is reflected in that period.\nDepreciation is computed on a straight-line basis over estimated useful lives of the related assets. The estimated useful lives of depreciable assets are:\nSchedule of estimated useful lives\nEstimated\nUseful Lives\nComputer equipment and software 3-5 years\nEquipment, furniture and fixtures 5 years\nPatent and Trademark Costs\nCosts related to filing and pursuing patent applications are recorded as general and administrative expense and expensed as incurred since recoverability of such expenditures is uncertain.\nResearch and Product Development\nResearch and product development costs represent costs incurred to develop the Companys technology, including salaries and benefits for research and development personnel, allocated overhead and facility occupancy costs, supplies, equipment purchase and repair and other costs. Research and product development costs are expensed when incurred, except for advance payments for future research and development activities which are deferred and recognized as expense as the related services are performed.\nIncome Taxes\nThe Company accounts for income taxes using the asset and liability method. Under the asset and liability method, deferred tax assets and liabilities are recognized for the future tax consequences attributed to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and tax credits and loss carry-forwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences and carry-forwards are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is established when necessary to reduce deferred tax assets to amounts expected to be realized. The Company reports a liability for unrecognized tax benefits resulting from uncertain income tax positions, if any, taken or expected to be taken in an income tax return. Estimated interest and penalties are recorded as a component of interest expense or other expense, respectively.\nSegment Reporting\nThe Companys business is considered to be operating in one segment based upon the Companys organizational structure, the way in which the operations are managed and evaluated, the availability of separate financial results and materiality considerations.\nNet Income (Loss) Per Share\nThe computation of basic earnings per share (EPS) is based on the weighted average number of shares that were outstanding during the period, including shares of common stock that are issuable at the end of the reporting period. The computation of diluted EPS is based on the number of basic weighted-average shares outstanding plus the number of common shares that would be issued assuming the exercise of all potentially dilutive common shares outstanding using the treasury stock method. The computation of diluted net income per share does not assume conversion, exercise or contingent issuance of securities that would have an antidilutive effect on earnings per share. Therefore, when calculating EPS if the Company experienced a loss, there is no inclusion of dilutive securities as their inclusion in the EPS calculation is antidilutive. Furthermore, options and warrants will have a dilutive effect under the treasury stock method only when the average market price of the common stock during the period exceeds the exercise price of the options or warrants (they are in the money).\nThe shares listed below were not included in the computation of diluted losses per share because to do so would be antidilutive for the periods presented:\nSchedule of computation of diluted losses per share\nYears Ended August 31,\nStock options 4,207,400 6,761,400\nWarrants 16,666,667 19,281,917\n20,874,067 26,043,317\nAlso, the 2023 EPS for continuing operations ($0.04), as rounded up from ($0.038), and discontinued operations ($0.01), as rounded up from ($0.006), are rounded to the nearest penny, and when added together total ($0.05). However, due to rounding the net loss per share is calculated at ($0.04) which is rounded down from ($0.044).\nForeign Currency Translation Gain and Comprehensive Income (Loss)\nIn countries in which the Company operates, and the functional currency is other than the U.S. dollar, assets and liabilities are translated using published exchange rates in effect at the consolidated balance sheet date. Expenses and cash flows are translated using an approximate weighted average exchange rate for the period. Resulting translation adjustments are recorded as a component of accumulated other comprehensive income on the accompanying consolidated balance sheet. For the years ended August 31, 2023 and 2022, comprehensive loss includes a loss of $4,528 and $58,759, respectively, which were entirely from foreign currency translation.\nAs of and for the years ended August 31, 2023 and 2022, the Company used the following exchange rates.\nSchedule of exchange rates\nApproximate weighted\nApproximate weighted\naverage exchange rate\naverage exchange rate\nExchange rate at For the year ended Exchange rate at For the year ended\nCurrency August 31, 2023 August 31, 2023 August 31, 2022 August 31, 2022\nKorean Won 1,324.00 1,321.29 1,342.00 1,230.36\nAccounting Pronouncements\nThe Company reviews new accounting standards as issued. Although some of these accounting standards issued or effective after the end of the Companys previous fiscal year may be applicable, the Company has not identified any standards that the Company believes merit further discussion.\nRecent accounting pronouncements not yet adopted\nNone.\nRecently adopted accounting pronouncements\nIn December 2019, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2019-12, Income Taxes - Simplifying the Accounting for Income Taxes. The guidance removes certain exceptions for recognizing deferred taxes for equity method investments, performing intra period allocation, and calculating income taxes in interim periods. The ASU also adds guidance to reduce complexity in certain areas, including recognizing deferred taxes for goodwill and allocating taxes to members of a consolidated group, among others. This guidance is effective for interim and annual reporting periods beginning after December 15, 2020. Early adoption of the standard is permitted, including adoption in interim or annual periods for which financial statements have not yet been issued. The transition requirements are dependent upon each amendment within this update and applied either prospectively or retrospectively. The Company adopted ASU 2019-12 beginning September 1, 2021 with no impact on its Financial Statements.\nNOTE 3 - Discontinued Operations\nOn January 13, 2023, the Board determined that it is in the best interests of the Company to discontinue operations in South Korea and to dissolve the Korean Subsidiary. The Company is working to dispose the Korean Subsidiary other than by sale in accordance with Accounting Standards Codification (ASC) 360-10-45-15, Long-Lived Assets to Be Disposed of Other Than by Sale\nIn accordance with ASC 205-20, Discontinued Operations, the results of the Korean Subsidiary are presented as discontinued operations in the Consolidated Statements of Operations and Comprehensive Loss, and, as such, have been excluded from continuing operations. Further, the Company reclassified the assets and liabilities of the Korean Subsidiary as assets and liabilities of discontinued operations in the Consolidated Balance Sheet as of August 31, 2022. The Consolidated Statements of Cash Flows are presented on a consolidated basis for both continuing operations and discontinued operations.\nThe following table summarizes the significant items included in income from discontinued operations, net of tax in the Consolidated Statement of Operations and Comprehensive Loss for the years ended August 31, 2023 and 2022:\nSchedule of Consolidated statement of operations and comprehensive loss\nYears Ended August 31,\nOperating expenses\nSelling, general and administrative $ 315,638 $ 694,058\nResearch and development 16,253 185,352\nTotal operating expenses 331,891 879,410\nOther income (expense)\nInterest income\nImpairment of assets - (380,220 )\nNet loss from discontinued operations $ (331,882 ) (1,259,450 )\nThe following table summarizes the carrying value of the significant classes of assets and liabilities classified as discontinued operations as of August 31, 2023 and 2022:\nSchedule of significant classes of assets and liabilities\nAugust 31,\nCurrent assets\nPrepaid expenses and other current assets $ 13,522 $ 43,599\nTotal current assets 13,522 43,599\nTotal assets $ 13,522 $ 43,599\nCurrent liabilities\nAccounts payable and accrued expenses $ 136,109 $ 57,585\nTotal current liabilities $ 136,109 $ 57,585\nThe cash flows related to discontinued operations have not been segregated and are included in the consolidated statements of cash flows for all periods presented. The Korean Subsidiary depreciation expense for the years ended August 31, 2023 and 2022, and included in the consolidated statement of cash flow was $0 and $14,835, respectively. Capital expenditures in the years ended August 31, 2023 and 2022 were $0 and $330,363, respectively.\nNOTE 4 - Property and Equipment\nProperty and equipment consists of the following:\nSchedule of property and equipment\nAugust 31, Increase/\n(decrease)\nComputers, office equipment and software $ 14,102 $ 14,102 $ -\nEquipment 133,653 133,653 -\nIn-process equipment 1,292,655 1,292,655 -\nTotal property and equipment 1,440,410 1,440,410 -\nAccumulated depreciation (125,128 ) (110,418 ) (14,709 )\nProperty and equipment, net $ 1,315,282 $ 1,329,992 $ (14,709 )\nDuring the year ended August 31, 2023 and 2022, the Company purchased $0 and $356,966 of property and equipment, respectively. During the years ended August 31, 2023 and 2022, the Company recognized straight-line depreciation expense of $14,709 and $30,024, respectively. During 2022, the Company disposed of $7,468 of fully depreciated computer equipment.\nDuring 2022, the Companys Korean subsidiary agreed to purchase equipment consisting of a roll-2-roll coating system for use in Korea. The Company paid approximately $512,000 as a deposit. During 2022, the Company canceled the equipment purchase and received a refund of approximately $186,000. For reasons discussed above, the Company impaired the value of all property and equipment recorded on the books of the Korean Subsidiary, including the unreturned portion of roll-2-roll coating system deposit of approximately $326,000 and $54,000 of furniture and fixtures and leasehold improvements net of accumulated depreciation.\nDuring the year ended August 31, 2019, the Company made deposits for in-process equipment totaling $1,292,655 towards the purchase of manufacturing equipment. The Company is currently evaluating configuration options to optimize the equipment for manufacturing of the Companys initial product. Completion of the equipment may require additional payments of up to approximately $510,000.\nNOTE 5 - Common Stock and Warrants\nCommon Stock\nAt August 31, 2023, the Company had 300,000,000 authorized shares of common stock with a par value of $0.001 per share, and 53,198,399 shares of common stock outstanding.\n2006 Long-Term Incentive Plan\nIn 2006 the Companys Board and stockholders adopted and approved 15,000,000 shares for grant under the 2006 Long-Term Incentive Plan (the 2006 Plan). The 2006 Plan was extended by the Board on February 7, 2021 for a period of two years. On January 13, 2023, the Board extended the 2006 Plan for two months. The 2006 Plan expired on March 17, 2023. The 2006 Plan provided for the grant of incentive stock options, non-qualified stock options, restricted stock, restricted stock units, stock appreciation rights, and other types of awards to employees, consultants, and directors. Stock option grants pursuant to the 2006 Plan vest from zero to five years and expire from six to ten years after the date of grant with the exercise price equal to the fair value of the underlying stock on the date of grant. See NOTE 6 - Stock Options for additional information.\nWarrants\nEach of the Companys warrants outstanding entitles the holder to purchase one share of the Companys common stock for each warrant share held. Other than the Series P Warrants, all of the following warrants may be exercised on a cashless basis. A summary of the Companys warrants outstanding and exercisable as of August 31, 2023 and 2022 is as follows:\nSchedule of warrants outstanding and exercisable\nShares of Common Stock Issuable from Warrants Outstanding as of Weighted\nAugust 31, Average Date of\nDescription Exercise Price Issuance Expiration\nSeries M - 246,000 $ 2.34 December 7, 2015 December 31, 2022\nSeries N - 767,000 $ 3.38 December 31, 2015 December 31, 2022\nSeries P - 213,500 $ 3.70 March 25, 2016 December 31, 2022\nSeries R - 468,750 $ 4.00 June 20, 2016 December 31, 2022\nSeries S-A - 300,000 $ 2.53 July 24, 2017 December 31, 2022\nSeries S - 620,000 $ 3.42 September 29, 2017 September 29, 2022\nSeries T 16,666,667 16,666,667 $ 1.70 November 26, 2018 November 26, 2025\nTotal 16,666,667 19,281,917\nDuring the year ended August 31, 2023, the Series M, N, P R, S-A and S Warrants expired unexercised.\nNOTE 6 - Stock Options\nThe Company measures share-based compensation cost on the grant date, based on the fair value of the award, and recognizes the expense on a straight-line basis over the requisite service period for awards expected to vest. The Company estimated the grant date fair value of stock options using a Black-Scholes valuation model using the following weighted-average assumptions:\nSchedule of weighted-average assumptions\nYears Ended August 31,\nExpected dividend yield - -\nExpected stock price volatility - 103.31 %\nRisk-free interest rate - 1.16 %\nExpected term (in years)(simplified method) - 5.75\nExercise price - $ 6.21\nWeighted-average grant date fair-value - $ 4.92\nA summary of the Companys stock option activity for the years ended August 31, 2023 and 2022 and related information follows:\nSchedule of stock option activity\nNumber of Shares Subject to Option Grants Weighted Average Exercise Price ($) Weighted Average Remaining Contractual Term Aggregate Intrinsic Value ($)\nOutstanding at August 31, 2021 6,740,400 3.97\nGrants 140,000 6.21\nForfeitures and cancellations (119,000 ) 4.28\nOutstanding at August 31, 2022 6,761,400 4.01\nForfeitures and cancellations (2,554,000 ) 5.60\nOutstanding at August 31, 2023 4,207,400 3.04 3.80 years -\nExercisable at August 31, 2023 4,165,700 3.03 3.81 years -\nThe aggregate intrinsic value in the table above represents the total pretax intrinsic value for all in-the-money options (i.e. the difference between the Companys closing stock price on the last trading day of the period covered by this report and the exercise price, multiplied by the number of shares) that would have been received by the option holders had all in-the-money option holders exercised their vested options on August 31, 2023. The intrinsic value of the option changes based upon the fair market value of the Companys common stock. Since the closing stock price was $0.03 on August 31, 2023 and no outstanding options have an exercise price below $0.03 per share, as of August 31, 2023, there is no intrinsic value in the Companys outstanding, and vested stock options.\nYear Ended August 31, 2023\nForfeitures and cancellations - totaled 2,554,000 options, including the expiration of 2,500,000, three (3) year, fully vested stock options granted on August 31, 2020 to Mr. John Rhee, former CEO and Chairman; and the cancellation of 54,000 options which expired unexercised.\nYear Ended August 31, 2022\nGrants - On October 27, 2021, the Companys Board granted 140,000 options to its officers and directors, with an exercise price of $6.21, exercisable on a cashless basis any time prior to the Companys listing of any of its securities for trading on a national stock exchange, ten-year term and vesting as to 50% of the options on the six-month anniversary of the date of grant and as to the remaining 50% of the options on the twelve-month anniversary from the date of grant.\nForfeitures and cancellations - totaled 119,000 options, including the forfeiture of 83,600 unvested stock options as a result of certain director resignations from the Board, and the cancellation of 35,400 options which expired unexercised.\nThe following table sets forth the share-based compensation cost resulting from stock option grants, including those previously granted and vesting over time, that were recorded in the Companys Statements of Operations and Comprehensive Loss for the years ended August 31, 2023 and 2022:\nSchedule of share-based compensation\nYears Ended August 31,\nStock compensation expense:\nSelling, general and administrative $ 142,877 $ 939,232\nResearch and development 16,505 84,930\nTotal $ 159,382 $ 1,024,162\nAs of August 31, 2023, the Company had $68,945 of unrecognized compensation cost related to unvested stock options which is expected to be recognized over a period of 1.00 year.\nThe following table summarizes information about stock options outstanding and exercisable at August 31, 2023:\nSchedule of stock options outstanding and exercisable\nStock Options Outstanding Stock Options Exercisable\nRange of\nExercise\nPrices Number of Shares\nSubject to\nOutstanding Options Weighted\nAverage\nContractual\nLife (years) Weighted\nAverage\nExercise\nPrice ($) Number\nof Shares Subject\nTo Options\nExercise Weighted Average\nRemaining\nContractual\nLife (Years) Weighted\nAverage\nExercise\nPrice ($)\n2.32 153,000 6.11 2.32 153,000 6.11 2.32\n2.60 2,500,000 2.84 2.60 2,500,000 2.84 2.60\n3.42 50,000 3.14 3.42 37,500 3.14 3.42\n3.46 35,000 2.35 3.46 35,000 2.35 3.46\n3.54 1,249,400 5.09 3.54 1,220,200 5.16 3.54\n4.87 110,000 4.23 4.87 110,000 4.23 4.87\n6.21 110,000 8.16 6.21 110,000 8.16 6.21\nTotal 4,207,400 3.80 3.04 4,165,700 3.81 3.03\nNOTE 7 - Lease\nOn February 26, 2021, the Korean Subsidiary entered into an apartment lease for the purposes of housing foreign personnel, which lease was terminated in November of 2022. The apartment lease provided for a term of one year beginning March 7, 2021, monthly rent of approximately $950 and a security deposit of approximately $8,700.\nIn September 2020, the Korean Subsidiary entered a lease for office space, which lease was terminated in December of 2022. The office lease provided for an initial term of one-year from September 23, 2020 through September 23, 2021, which was been renewed for an additional year, monthly rent of approximately $1,200 and a security deposit of approximately $13,000.\nThe Companys policy is to record all leases with a term of less than one year as an operating lease with rent expensed recorded on a straight-line basis and to not recognize lease assets or lease liabilities.\nAs of May 31, 2023, the Company had not entered into any leases other than those described above which have not yet commenced and would entitle the Company to significant rights or create additional obligations.\nNOTE 8 - Transactions with Related Persons\nA related party with respect to the Company is generally defined as any person (i) (and, if a natural person, inclusive of his or her immediate family) that holds 10% or more of the Companys securities, (ii) that is part of the Companys management, (iii) that directly or indirectly controls, is controlled by or is under common control with the Company, or (iv) who can significantly influence the financial and operating decisions of the Company. A transaction is considered to be a related party transaction when there is a transfer of resources or obligations between related parties.\nOn August 7, 2017, the Company appointed Jatinder Bhogal to the Board of directors. Mr. Bhogal provided consulting services to the Company through his wholly owned company, Vector Asset Management, Inc. (VAMI). On July 1, 2020 the Company and VAMI entered into an Executive Consulting Agreement (the ECA) pursuant to which Mr. Bhogal served as a director of the Company and as its Chairman and Chief Executive Officer. Effective January 18, 2022, Mr. Bhogal resigned all positions he held in the Company and executed a Separation and Release of Claims Agreement by and among the Company, VAMI and Mr. Bhogal. Pursuant to the ECA, VAMI received $34,167 per month and was eligible for an annual bonus. VAMI also incurred expenses on behalf of the Company which are reimbursed according to the Companys expense reimbursement policy. The Company recognized cash compensation expense of $0 and $524,505 during the years ended August 31, 2023 and 2022, respectively, related to the ECA.\nJoseph Sierchio, one of the Companys directors, has maintained his role as the Companys general counsel since its inception as Principal of the law firm of Sierchio & Partners, LLP, and then as a Partner with Satterlee Stephens LLP and beginning in August 2020, as Principal of Sierchio Law, LLP pursuant to an engagement letter which provides for an annual fee of $175,000 in exchange for general counsel services, and the reimbursement of expenses. Fees for legal services and expense reimbursement billed by Sierchio Law, LLP totaled $189,299 and $175,000 for the years ended August 31, 2023 and 2022, respectively. As of August 31, 2023, the Company recognized a related party payable to Sierchio Law, LLP of $17,083, including $14,583 related to legal services and $2,500 related to the quarterly board fee for the three months ended August 31, 2023.\nAll related party transactions are recorded at the exchange amount established and agreed to between related parties and are in the normal course of business.\nNOTE 9 - Income Taxes\nProvision for Income Taxes\nThe components of loss before income taxes follows:\nSchedule of loss before income taxes\nYears Ended August 31,\nUnited States $ (2,244,302 ) $ (3,755,493 )\nForeign (111,001 ) (1,193,040 )\nLoss before income taxes $ (2,355,303 ) $ (4,948,533 )\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Significant components of the Companys deferred tax assets at August 31, 2023 and 2022 are as follows:\nSchedule of deferred tax assets and liabilities\nDeferred tax assets:\nNet operating loss carryforwards $ 8,468,620 $ 7,977,402\nCapitalized research and development 944,662 990,618\nStock based compensation 2,550,537 2,508,105\nGross deferred tax assets 11,963,819 11,476,125\nLess: valuation allowance (11,962,425 ) (11,474,539 )\nTotal deferred tax assets $ 1,394 $ 1,586\nDeferred tax liabilities\nDepreciation $ (1,394 ) $ (1,586 )\nGross deferred tax liabilities (1,394 ) (1,586 )\nNet deferred taxes $ - $ -\nThe net increase in the valuation allowance for deferred tax assets was $487,886 and $947,949 for the year ended August 31, 2023 and 2022, respectively. The Company evaluates its valuation allowance requirements on an annual basis based on projected future operations. When circumstances change and this causes a change in managements judgment about the realizability of deferred tax assets, the impact of the change on the valuation allowance is reflected in current operations.\nFor federal income tax purposes, the Company has U.S. federal net operating loss carry forwards at August 31, 2023 available to offset future federal taxable income, if any, of $38,523,539, which will begin to expire in 2023. These carryforwards may be subject to an annual limitation under Section 382 and 383 of the Internal Revenue Code of 1986, and similar state provisions if the Company experienced one or more ownership changes which would limit the amount of NOL and tax credit carryforwards that can be utilized to offset future taxable income and tax, respectively. In general, an ownership change, as defined by Section 382 and 383, results from transactions increasing ownership of certain stockholders or public groups in the stock of the corporation by more than 50 percentage points over a three-year period. The Company also has foreign net operating losses of $1,514,707 as of August 31, 2023, which will begin to expire in 2035.\nThe effects of state income taxes were insignificant for the years ended August 31, 2023 and 2022.\nThe following is a reconciliation between expected income tax benefit and actual, using the applicable statutory income tax rate of 21% for the year ended August 31, 2023 and 2022:\nSchedule of effective income tax rate reconciliation\nIncome tax benefit at statutory rate $ 494,614 $ 1,039,192\nForeign rate differential 4,440 32,513\nPermanent differences - (79,846 )\nStock options 8,961 (32,236 )\nOther (20,127 ) (11,674 )\nChange in valuation allowance (487,886 ) (947,949 )\nTotal $ - $ -\nThe fiscal years 2021 through 2023 remain open to examination by federal authorities and other jurisdictions in which the Company operates.\nThe Company does not have any uncertain tax positions at August 31, 2023 and 2022 that would affect its effective tax rate. The Company does not anticipate a significant change in the amount of unrecognized tax benefits over the next twelve months. Because the Company is in a loss carryforward position, the Company is generally subject to US federal and state income tax examinations by tax authorities for all years for which a loss carryforward is available. If and when applicable, the Company will recognize interest and penalties as part of income tax expense.\nNOTE 10 - Commitments and Contingencies\nOn June 9, 2022, the Company was served the Notice of Civil Claim dated May 16, 2022 (the Notice of Claim), and related Notice of Application (the Application) and Order Made After Application (the Order) copies of which are referenced in this report as Exhibit 99.0. The Notice of Claim, the Application and Order are collectively referred to herein as the Complaint. Please refer to our Form 8-K filed on June 15, 2022 and Exhibit 99.0 hereto.\nNOTE 11 - Subsequent Events\nManagement has reviewed material events subsequent of the period ended August 31, 2023 and through the date of filing of financial statements in accordance with FASB ASC 855 Subsequent Events. In managements opinion, no material subsequent events have occurred as of the date of this annual report."
}