{
    "cik": "1082733",
    "company": "VISIUM TECHNOLOGIES, INC.",
    "filing_type": "10-K",
    "filing_date": "2022-10-04",
    "period_of_report": "2022-06-30",
    "sic": "7371",
    "state_of_inc": "FL",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1082733/0001654954-22-013289-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1082733/000165495422013289/vism_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1082733/0001654954-22-013289.txt",
    "filename": "1082733_10K_2022_0001654954-22-013289.htm",
    "content": "Item 1. Business\nOverview\nVisium Technologies, Inc. (Visium) was incorporated in Nevada as Jaguar Investments, Inc. during October 1987. During March 2003, a wholly owned subsidiary of the Company merged with Freight Rate, Inc., a development stage company in the logistics software business. During May 2003, the Company changed its name to Power2Ship, Inc. During October 2006, the Company merged with a newly formed, wholly owned subsidiary, Fittipaldi Logistics, Inc., a Nevada corporation, with the Company surviving but its name changed to Fittipaldi Logistics, Inc. effective November 2006. During December 2007, the Company merged with a newly formed, wholly owned subsidiary, NuState Energy Holdings, Inc., a Nevada corporation, with the Company surviving but renamed NuState Energy Holdings, Inc. effective December 2007. In March 2018, the Company brought in a new management team and changed its name to Visium Technologies, Inc.\nVisium is a provider of cyber security visualization, big data analytics and automation that operates in the traditional cyber security space, as well as in the Internet of Things and data analytics spaces. In March 2019, Visium entered into a software license agreement with MITRE Corporation to license a patented technology known as CyGraph, a tool for cyber warfare analytics, visualization and knowledge management. CyGraph is a military-grade, highly scalable big data analytics tool for cyber security, based on graph database technology. The development of the technology was sponsored by the US Army and is currently in use by the U.S. Army Cyber Command. CyGraph provides advanced analytics for cybersecurity situational awareness that is scalable, flexible and comprehensive. Visium has completed significant proprietary product development efforts to commercialize CyGraph, which the Company has rebranded as TruContextTM. The commercialization efforts included adding functionality to the core technology to make it a native cloud application, adding multi-user and multi-tenant capability, enhancing the graphical user interface, (GUI) to make the application more intuitive to use, and adding enhanced dashboard and reporting capabilities. TruContext would typically be deployed by an enterprise and be used by the security analyst to intuitively understand the massive amount of data flowing through the network environment, giving the analyst actionable information in real-time to ensure that the network is protected from threats. The analyst will understand the relationships of the assets in the data center, the communication patterns, and cybersecurity exposures, in real-time.\nTruContext provides visualization, advanced cyber monitoring intelligence, threat hunting, forensic and root cause analysis, data modeling, analytics, and automation to help reduce risk, simplify security, and deliver better security outcomes. Our mission is to help people see and understand data, empowering decision-makers to make more informed and more timely decisions. Our solutions put the power of data into the hands of everyday people, allowing a broad population of business users to engage with their data, ask questions, solve problems, and create value.\nOur products dramatically reduce the complexity, and expense associated with traditional business intelligence applications. Our software allows people to access information, perform analysis, and share results without assistance from technical specialists. By putting powerful analytical technology directly into the hands of people who make decisions with data, we accelerate the pace of informed and intelligent decision-making. Our TruContext platform enables our customers to reduce or streamline their siloed and layered security products, simplifying operations while providing a comprehensive solution. Our solution automates certain previously manual tasks, freeing up personnel to focus on their most important objectives.\nTruContext can be deployed in a broad range of use cases such as cyber security threat intelligence and forensics, IT/OT critical infrastructure security, supply chain analytics, anti-fraud, law enforcement, compliance, and health care. For example, a breach of your network might go undetected for months, as was the case with the Solar Winds hack that occurred in 2019-2020. In that case the hackers went undetected for 14 months. A Solar Winds type breach may not be preventable, but with TruContext analyzing streaming network data in real-time, this hack would almost certainly have been identified and remediated very quickly.\nTruContext is a very effective tool for proactively and iteratively searching through networks to detect and isolate advanced threats that evade existing security solutions. Should a breach occur, TruContext can quickly perform forensics and root cause analysis, identifying when an incident occurred, how it occurred, and the downstream effects of the incident to the network.\nOne of the top challenges faced by Security practitioners is to keep up with the increase in new cyber attacks while investigating and remediating existing threats. Time is of the essence while investigating potential threats and determining the scope and root-cause of a potential reach.\nShortage of resources and experienced personnel continues to limit the ability of companies to conduct thorough investigations. Root cause analysis and forensics are key to intelligently securing the network.\nTruContext directly addresses these challenges by:\nProviding real-time comprehensive visualized information on security events, that\n·\nallow the cyber warrior to immediately pinpoint the root cause of the breach; and\n·\nknow with certainty the priority and required remediation.\nThe real-time ingestion of and visualization of massive amounts of data simplifies the cyber effort, allowing the cyber analyst to intuitively understand the security posture of the organization at a glance.\nUsing TruContext makes the cyber analyst significantly more productive by eliminating false positives and prioritizing threat events.\nTruContext ingests cyber data from any source, making the data generated by other cyber tools easily understood and actionable. TruContext give the security analyst the ability to combine, layer, filter, and query data with a no-code user interface in a way that no other analytics platform can do.\nThere are some sophisticated and powerful cybersecurity tools currently available, but they all lack one thing - providing a comprehensive contextualized understanding of the data. Analysts have too many tools that dont communicate, creating silos of data/information. TruContext brings all the information for a comprehensive visualization.\nOn average, according to CrowdStrike, the time from breach to harm caused by threat actors is 98 minutes making the ability to:\n1.\nIdentify malicious hacks in real time; and\n2.\nPerform threat hunting critically important for the security analyst\nUsing the MITRE ATT&CK framework, TruContext can hunt threats beyond the physical network boundary so that the analyst fully understands his security posture in real time.\nTruContext leverages MITREs ATT&CK® framework, which is a globally-accessible knowledge base of adversary tactics and techniques based on real-world observations. The ATT&CK knowledge base is used as a foundation for the development of specific threat models and methodologies in the private sector, in government, and in the cybersecurity product and service community.\nA use case example for TruContext would be in the event sensitive data is being exfiltrated from your network to an external IP address. TruContext has the capability to identify this activity and provide alerts that would allow the cyber analyst to quickly remediate the problem.\nAnother example for TruContext would be the analysis of millions of unemployment insurance claims by a state government that identifies patterns to identify potential fraud. If 30 claims are submitted that are tied to a single bank account, or address, or social security number, TruContext would be able to identify these anomalies in real-time. TruContext offers new methods of uncovering fraud rings and other complex scams with a high level of accuracy through advanced contextual link analysis, and is capable of stopping advanced fraud scenarios in real time. This is currently a significant problem in every state, costing billions of dollars annually.\nOne last example of how TruContext can be used by law enforcement in the context of police investigations. TruContext can analyze highly connected data in real time from any source and make connections which help police solve crime. Connections are quickly made between persons, objects, locations, and events (the POLE model), generating insights into patterns of behaviors and incidents. Using real-time data with TruContext helps investigators be proactive and prevent crime or other incidents, rather than only reacting after an incident has occurred.\nVisium currently plans to generate revenue in three (3) primary ways:\n● through a virtual appliance model, primarily targeted to the Federal government, charging an annual seat license, with the seat license fee increasing based on the size of the network environment ;\n● through a SaaS model, charging a recurring monthly license fee for TruContext based on the size of the network environment and the number of TruContext Identifiers (nodes); and\n● through professional services to support and deliver cybersecurity solutions and services to its customers, billed on an hourly basis, and delivered through a service contract for implementation and data science services.\nPartnership Ecosystem\nWe work with a number of technology alliance partners to design go-to-market strategies that combine our platform with products or services provided by our technology alliance partners. These partner integrations deliver more secure solutions and an improved end user experience to their customers. Our technology alliance partnerships focus on security analytics, network and infrastructure security, threat platforms and orchestration, and automation.\nVisium heavily relies on our technology and infrastructure to provide our products and services to our customers. For example, we host many of our products using third-party data center facilities, and we do not control the operation of these facilities. In addition, we rely on certain technology that we license from third parties, including third-party commercial software and open-source software, which is used with certain of our solutions.\nCompetition\nThe markets for our solutions are highly competitive, and we expect both the requirements and pricing competition to increase, particularly given the increasingly sophisticated attacks, changing customer preferences and requirements, current economic pressures, and market consolidation. Competitive pressures in these markets may result in price reductions, reduced margins, loss of market share and inability to gain market share, and a decline in sales, any one of which could seriously impact our business, financial condition, results of operations, and cash flows. We may face competition due to changes in the manner that organizations utilize IT assets and the security solutions applied to them, such as the provision of privileged account security functionalities as part of public cloud providers infrastructure offerings, or cloud-based identity management solutions. Limited IT budgets may also result in competition with providers of other advanced threat protection solutions such as McAfee, LLC, Palo Alto Networks, Splunk Inc., and Dynatrace. We also may compete, to a certain extent, with vendors that offer products or services in adjacent or complementary markets to privileged access management, including identity management vendors and cloud platform providers such as Okta and Tableau.\nEmployees\nAt September 30, 2022, we had 8 full time employees.\nOur principal offices are located at 4094 Majestic Lane, Suite 360, Fairfax, Virginia 22033. We currently operate in a virtual office arrangement. Our telephone number is (703) 273-0383.\nOur common stock is quoted on the OTC Pink under the symbol VISM.\nRecent Developments\nAppointment of Directors\nOn December 13, 2021, the Companys Board of Directors appointed Wayne H. Monk as a member of the Board of Directors. On December 16, 2021, the Companys Board of Directors appointed Solomon Adote as a member of the Board of Directors.\nApproval of Reverse Stock Split and Reduction of Authorized Stock\nOn June 20, 2022, the Company held a special meeting of stockholders, pursuant to which the stockholders of the Company voted in favor of an amendment to the Companys Amended and Restated Certificate of Incorporation to effect a reverse stock split at a ratio not less than 1-for-600 and not greater than 1-for-1,600, with the exact ratio to be set within that range at the discretion of the board of directors without further approval or authorization of the stockholders, together with the simultaneous reduction of the number of shares of Common Stock that the Company is authorized to issue to one billion (1,000,000,000), was approved as follows:\nFinancing Transactions\nOn February 7, 2022, the Company entered into two securities purchase agreements with two separate institutional investors. Under these agreements, each investor separately purchased a promissory note with a face value of $270,000, for a total combined principal amount of $540,000 and a combined purchase price of $496,800. The closing of the purchase agreements occurred on February 7, 2022. Each promissory note was issued with original issue discount of $21,600 ($43,200 in the aggregate), each bear interest of 8% per year and mature on February 7, 2023. The promissory notes are convertible into shares of the Common Stock at conversion price of $0.0018 per share, subject to adjustment (the Conversion Shares). The Company has the right to prepay each promissory note in full, including accrued but unpaid interest, without prepayment penalty provided an event of default, as defined therein, has not occurred. The promissory notes contain events of defaults and negatives covenants customary for transactions of this nature. Pursuant to the securities purchase agreements, the Company issued to the investors an aggregate 54,000,000 commitment shares of the Companys common stock (the Commitment Shares) as a condition to closing. In connection with the securities purchase agreements, the Company entered into a Registration Rights Agreements with each of the investors, pursuant to which the Company is obligated to file a registration statement covering the sale of the Commitment Shares and the shares of the Companys common stock that may be issued to the investors pursuant to the conversion of the promissory notes. Resale of the Commitment Shares is being registered with the registration statement that this primary offering prospectus forms a part, with alternate disclosures for a resale prospectus that this registration statement also forms a part.\nOn February 23, 2022, the Company entered into a securities purchase agreement with one institutional investor. Under this agreement, the investor separately purchased a promissory note with a face value of $270,000 and a purchase price of $248,400. The closing of the purchase agreements occurred on February 23, 2022. The promissory note was issued with original issue discount of $21,600, bears interest of 8% per year and mature on February 23, 2023. The promissory note is convertible into Conversion Shares at conversion price of $0.0018 per share, subject to adjustment. The Company has the right to prepay the promissory note in full, including accrued but unpaid interest, without prepayment penalty provided an event of default, as defined therein, has not occurred. The promissory note contains events of defaults and negatives covenants customary for transactions of this nature. Pursuant to the securities purchase agreement, the Company issued to the investors an aggregate 27,000,000 commitment shares of the Companys common stock (the Commitment Shares) as a condition to closing. In connection with the securities purchase agreement, the Company entered into a Registration Rights Agreements with the investor, pursuant to which the Company is obligated to file a registration statement covering the sale of the Commitment Shares and the shares of the Companys common stock that may be issued to the investor pursuant to the conversion of the promissory note. Resale of the Commitment Shares is being registered with the registration statement that this primary offering prospectus forms a part, with alternate disclosures for a resale prospectus that this registration statement also forms a part.\nOn April 18, , the Company entered into a Securities Purchase Agreement with one institutional investor, pursuant to which the investor purchased a promissory note with a face value of $360,000, made by the Company in favor of the investors for a purchase price of $331,200. The Note bear an original issue discount of $28,800, bears interest of 8% per year and matures on April 20, 2023. The Note is convertible into shares of the Companys common stock at conversion price of $0.0018 per share, subject to adjustment as provided therein. The Company has the right to prepay each Note in full, including accrued but unpaid interest, without prepayment penalty provided an event of default, as defined therein, has not occurred. In the seven (7) trading days prior to any prepayment the Investor shall have the right to convert their Notes into Common Stock of the Company in accordance with the terms of such Note. The Notes contain events of defaults and certain negatives covenants that are typical in the types of transactions contemplated by the Purchase Agreements. Pursuant to the Purchase Agreement, the Company issued to the Investor 36,000,000 commitment shares of the Companys common stock (the Commitment Shares) as a condition to closing.\nOn September 16, 2022, the Company entered into Amendment #1 with each of the investors party to the February 7, 2022, February 23, 2022 and March 1, 2022 transactions (the Amendments), pursuant to which the following amendments were made to the respective Purchase Agreements, Notes and other transaction documents: (i) such investors (the Investors) waived the Companys obligations to make interim payments; (ii) the time period for the Company to file a registration statement for the resale of the shares underlying the Notes was extended until October 31, 2022. Pursuant to the Amendments, the Company issued to each of the Investors a warrant to purchase 43,200,000 shares of the Companys common stock (129,600,000 shares in the aggregate) (the Warrants). The Warrants are exercisable at a price of $0.001, provided, however, that if the Company consummates an Uplist Offering (as defined in the Warrant to refer to an offering resulting in the Companys stock being listed with a national stock exchange), then the exercise price shall equal the offering price per share of Common Stock (or unit, if units are offered in the Uplist Offering) at which the Uplist Offering is made (the Uplist Exercise Price), subject to adjustment as provided in the Warrant. The Warrants are exercisable for a period of five years and exercise may be cashless under certain circumstances. Item 1A. Risk Factors\nThe common shares of our Company are considered speculative. You should carefully consider the following risks and uncertainties in addition to other information in this annual report in evaluating our Company and our business before purchasing our common shares. Our business, operating or financial condition could be harmed due to any of the following risks:\nManagement and our auditors have raised substantial doubts as to our ability to continue as a going concern.\nOur financial statements have been prepared assuming we will continue as a going concern. Since inception we have experienced recurring net losses which losses caused an accumulated deficit of approximately $56.6 million as of June 30, 2022. These factors, among others, raise substantial doubt about our ability to continue as a going concern. Our financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nWe currently have a working capital deficit and negative cash flow from operations and are uncertain if and when we will be able to pay our current liabilities.\nOur working capital deficit was approximately $2.8 million as of June 30, 2022. This deficit consists of $137,000 in current assets, offset by $2,930,000 in current liabilities. In addition, we had negative cash flow from operations for the year ended June 30, 2022 of approximately $2,318,000. We do not have any liquid or other assets that can be liquidated to pay our current liabilities while we continue to incur additional liabilities to our officer and certain service providers who are working to prepare the documents required to be filed with the Securities and Exchange Commission to enable our common shares to be registered for trading. Since we currently have limited operations, the only ways we have of paying our current liabilities are to issue our common or preferred shares to our creditors or to issue unsecured promissory notes which may include certain features such as convertibility into common or preferred shares or warrants to purchase additional common or preferred shares in the future.\nWe had $1,684,199 of convertible notes, notes payable, and accrued interest payable as of June 30, 2022, of which $792,453 of this amount is past due, and we do not have the funds necessary to pay these obligations.\nIn addition to funding our operating expenses, we need capital to pay various debt obligations totaling approximately $792,453 as of June 30, 2022 which are either currently past due or which are due in the current fiscal year. Currently, there is $324,009 principal amount of the convertible notes payable which is past due, $205,000 principal of the notes payable which is past due, and $263,444 of accrued interest which is past due. The interest on the past due principal amounts will continue to accrue monthly at their stated rates. Holders of past due notes do not have a security interest in our assets. The existence of these obligations provides additional challenges to us in our efforts to raise capital to fund our operations.\nIn the event we consummate a transaction with a profitable company, we may not be able to utilize our net operating loss carryover which may have a negative impact on your investment.\nIf we enter into a combination with a business that has operating income, we cannot assure you that we will be able to utilize all or even a portion of our existing net operating loss carryover for federal or state tax purposes following such a business combination. If we are unable to make use of our existing net operating loss carryover, the tax advantages of such a combination may be limited, which could negatively impact the price of our stock and the value of your investment. These factors will substantially increase the uncertainty, and thus the risk, of investing in our shares.\nEconomic conditions may affect our ability to obtain financing and to complete a merger or acquisition.\nDue to general economic conditions, rapid technological advances being made in some industries, and shortages of available capital, our management believes that there are numerous firms seeking even the limited additional capital which we will need. In the presence of these economic conditions, we may have difficulty raising sufficient capital to support the investigation of potential business opportunities, and to consummate a merger or acquisition. These factors substantially increase the uncertainty, and thus the risk, of investing in our shares.\nIn December 2019, a novel coronavirus (COVID-19) emerged and has subsequently spread worldwide. The World Health Organization has declared COVID-19 a pandemic resulting in federal, state, and local governments mandating various restrictions, including travel restrictions, restrictions on public gatherings, stay at home orders and advisories and quarantining of people who may have been exposed to the virus.\nAs the COVID-19 pandemic is complex and rapidly changing, the full extent and duration of the impact of COVID-19 on the Companys operation and financial performance is currently unknown and depends on future developments that are uncertain and unpredictable, including the duration and spread of the pandemic, its impact on capital and financial markets.\nThere are a number of factors related to our common stock which may have an adverse effect on our shareholders.\nShareholders interests in our Company will be diluted and investors may suffer dilution in their net book value per share if we issue additional shares or raise funds through the sale of equity securities. In the event that we are required to issue additional shares, enter into private placements to raise financing through the sale of equity securities or acquire business interests in the future from the issuance of shares of our common stock to acquire such interests, the interests of existing shareholders in our Company will be diluted and existing shareholders may suffer dilution in their net book value per share depending on the price at which such securities are sold. If we do issue additional shares, it will cause a reduction in the proportionate ownership and voting power of all existing shareholders.\nWe have certain provisions in our Articles of Incorporation and Bylaws, and there are other provisions under Florida law, that may serve to make a takeover of our Company more difficult.\nProvisions of our articles of incorporation and bylaws may delay or prevent a takeover which may not be in the best interests of our stockholders. Provisions of our articles of incorporation and bylaws may be deemed to have anti-takeover effects, which include when and by whom special meetings of our stockholders may be called, and may delay, defer, or prevent a takeover attempt. In addition, certain provisions of Florida law also may be deemed to have certain anti-takeover effects which include that control of shares acquired in excess of certain specified thresholds will not possess any voting rights unless these voting rights are approved by a majority of a corporations disinterested stockholders.\nVoting power of our shareholders is highly concentrated by insiders.\nOur officers and directors control, either directly or indirectly, a substantial portion of our voting securities. As of June 30, 2022, our executive officer and directors beneficially owns 594,723 shares of Common Stock, or approximately 21% of our outstanding shares of Common Stock. In addition, our executive officer owns the only issued and outstanding share of Series AA Convertible Preferred Stock which entitles him to 51% of the Common votes on any matter requiring a shareholder vote. Therefore, our management may significantly affect the outcome of all corporate actions and decisions for an indefinite period of time including the election of directors, amendment of charter documents and approval of mergers and other significant corporate transactions.\nOur common stock is quoted in the over the counter market on the OTC Pink.\nOur common stock is quoted on the OTC Pink. OTC Pink offers a quotation service to companies that are unable to list their securities on an exchange or for companies, such as ours, whose securities are not eligible for quotation on the OTC Bulletin Board. The requirements for quotation on the OTC Pink are considerably lower and less regulated than those of the OTC Bulletin Board or an exchange. Because our common stock is quoted on the OTC Pink, it is possible that even fewer brokers or dealers would be interested in making a market in our common stock which further adversely impacts its liquidity.\nThe tradability of our common stock is limited under the penny stock regulations which may cause the holders of our common stock difficulty should they wish to sell their shares.\nBecause the quoted price of our common stock is less than $5.00 per share, our common stock is considered a penny stock, and trading in our common stock is subject to the requirements of Rule 15g-9 under the Exchange Act. Under this rule, broker/dealers who recommend low-priced securities to persons other than established customers and accredited investors must satisfy special sales practice requirements. The broker/dealer must make an individualized written suitability determination for the purchaser and receive the purchasers written consent prior to the transaction. SEC regulations also require additional disclosure in connection with any trades involving a penny stock, including the delivery, prior to any penny stock transaction, of a disclosure schedule explaining the penny stock market and its associated risks. These requirements severely limit the liquidity of securities in the secondary market because few broker or dealers are likely to undertake these compliance activities and this limited liquidity will make it more difficult for an investor to sell his shares of our common stock in the secondary market should the investor wish to liquidate the investment. In addition to the applicability of the penny stock rules, other risks associated with trading in penny stocks could also be price fluctuations and the lack of a liquid market. Item 1B. Unresolved Staff Comments.\nNot applicable. Item 2. Properties.\nOur Company and its employees work 100% remotely. We rent our principal executive office from an unrelated third party on an annual basis for $420/year. Item 3. Legal Proceedings.\nOn May 9 2022, the company entered into a global settlement agreement to satisfy any and all claims with i) Tarpon Bay Partners LLC, (ii) J.P. Carey Enterprises Inc., and (iii) Anvil Financial Management LLC to resolve all litigation amongst the parties. The terms of the agreement included J.P. Carey Enterprises Inc. and Anvil Financial ManagementLLC receiving sixty million shares of the Company's $0.0001 par value common stock, valued at $108,000, or $2.43 per share. The agreement also calls for the retirement of the notes payable to Tarpon Bay Partners LLC (ASC Recap) in the amount of $147,965. The details of this litigation are as follows:\nIn July 2018 the Company was named as the defendant in a legal proceeding brought by Tarpon Bay Partners LLC (the Plaintiff) in the Judicial District Court of Danbury, Connecticut. Plaintiff asserts that the Company failed to convert two convertible notes held by Plaintiff. The Company is vigorously contesting this claim. There are no other proceedings in which any of our directors, officers or affiliates, or any registered or beneficial stockholder, is an adverse party or has a material interest adverse to our interest.\nIn January 2021, the Company won a dismissal of an involuntary bankruptcy petition that was filed against the Company in the Southern District Court of Florida on December 30, 2020, which had been brought by three parties, (i) Tarpon Bay Partners LLC, (ii) J.P. Carey Enterprises Inc., and (iii) Anvil Financial Management LLC (collectively the \"Petitioning Creditors\").\nThe Court ruled in the Company's favor, dismissing the involuntary bankruptcy petition and allowing the Company to file a motion with the Court seeking compensatory and punitive damages. In addition, Visium plans to file an affidavit of fees and costs incurred in connection with Visium's defense of the Involuntary Petition.\nIn March 2021, the Company filed a Complaint for Damages and Other Relief against Tarpon Bay Partners, LLC, a Florida limited liability company; J.P. Carey Enterprises, Inc., a Florida profit corporation; Anvil Financial Management, LLC, a Florida limited liability company; Stephen Hicks, an individual; Joseph C Canouse, an individual; Jeffrey M. Canouse, an individual; Paul A. Rachmuth, an individual; and Litt Law Group, LLC, a New York Limited Liability Company (collectively the Defendants) related to the involuntary bankruptcy petition. The Company is seeking damages from the Defendants for reasonable attorneys fees and costs, as well as compensatory, consequential special and punitive damages. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities.\nOur common shares are quoted on the OTC Pink Quotation System under the symbol VISM, but trade infrequently.\nThe high and low bid prices of our common stock for the periods indicated below are as follows:\nFiscal Year Ended June 30, 2022\nHigh\nLow\nQuarter Ended September 30, 2021\n$ 28.35\n$ 5.94\nQuarter Ended December 31, 2021\n$ 14.58\n$ 3.78\nQuarter Ended March 31, 2022\n$ 8.64\n$ 2.16\nQuarter Ended June 30, 2022\n$ 8.64\n$ 1.35\nFiscal Year Ended June 30, 2021\nHigh\nLow\nQuarter Ended September 30, 2020\n$ 2.295\n$ 0.54\nQuarter Ended December 31, 2020\n$ 14.715\n$ 0.54\nQuarter Ended March 31, 2021\n$ 67.50\n$ 0.54\nQuarter Ended June 30, 2021\n$ 27.00\n$ 6.885\nStockholders\nAs of September 30, 2022, there were 14,800 stockholders of record of our Common Stock.\nDividend Policy\nWe have not paid any cash dividends and do not anticipate or contemplate paying dividends in the foreseeable future.\nRecent Sales of Unregistered Securities\nDuring the year ended June 30, 2022 the Company issued 146,701 shares of its common stock related to the conversion of $828,797 of principal and accrued interest of its convertible notes payable, at an average contract conversion price of $5.66 per share. The fair value of the shares issued was $2,422,722.\nStock Based Compensation and Stock Based Consulting Services Expense\nDuring the year ended June 30 2022, the Company issued 53,334 shares of its $0.0001 par value common stock to three consultants, as compensation for services rendered. The shares were valued at $241,800, or $4.53 per share.\nDuring the year ended June 30, 2022 the Company issued 54,955 shares of its $0.0001 par value common stock to six employees, as compensation for services rendered. The shares were valued at $762,833, or $13.88 per share.\nDuring the year ended June 30, 2022 the Company issued 100,758 shares of its $0.0001 par value common stock to our Directors and Officer, as compensation for services rendered. The shares were valued at $1,173,800, or $11.65 per share.\nWarrants\nDuring the fiscal year ended June 30, 2022 the Company issued 4,881 shares of its $0.0001 par value common stock pursuant to the cashless exercise of warrants. The warrant shares were valued at $211,411, or $43.32 per share.\nFunding\nIn September 2021 the Company entered into two securities purchase agreement (the Purchase Agreements) with a single institutional investor (the Purchaser) resulting in the raise of $1,500,000 in gross proceeds to the Company. Pursuant to the terms of the Purchase Agreements, the Company agreed to sell, in a registered director offering, an aggregate of 222,222 shares (the Shares) of the Companys common stock, par value $0.0001 per share (the Common Stock) at a purchase price of $6.75 per Share (the Offering). The Offerings closed on September 15 2021, and September 27 2021, respectively.\nDuring the fiscal year ended June 30 2022, the Company issued 86,667 shares of its $0.0001 par value common stock to three investors as commitment shares pursuant to the issuance of promissory notes. The shares were valued at $330,959, or $3.82 per share.\nLitigation Settlement\nDuring the fiscal year ended June 30 2022, we issued 44,444 shares of its common stock pursuant to the settlement of litigation with ASC Recap.\nRule 10B-18 Transactions\nDuring the year ended June 30, 2022, there were no repurchases of the Companys common stock by the Company. Item 6. Selected Financial Data.\nAs a smaller reporting company, we are not required to provide information required by this item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following information should be read in conjunction with our financial statements and accompanying notes included in this Annual Report on Form 10-K.\nOverview\nThe Company was incorporated in Nevada as Jaguar Investments, Inc. during October 1987. During March 2003, a wholly owned subsidiary of the Company merged with Freight Rate, Inc., a development stage company in the logistics software business. During May 2003, the Company changed its name to Power2Ship, Inc. During October 2006, the Company merged with a newly formed, wholly owned subsidiary, Fittipaldi Logistics, Inc., a Nevada corporation, with the Company surviving but its name changed to Fittipaldi Logistics, Inc. effective November 2006. During December 2007, the Company merged with a newly formed, wholly owned subsidiary, NuState Energy Holdings, Inc., a Nevada corporation, with the Company surviving but renamed NuState Energy Holdings, Inc. effective December 2007. In March 2019, the Company changed its name to Visium Technologies, Inc.\nSince February 12, 2018 Mark Lucky has served as Chairman and CEO. He currently also serves as CFO. The Companys headquarters is located at 4094 Majestic Lane, Suite 360, Fairfax, VA 22124. Since February 2018, the Company has focused on creating a world-class cybersecurity/digital risk management company, with a focus on network security, threat visualization, pinpoint threat identification, and big-data analytics. Our solutions address the growing security and compliance complexities and risks resulting from the increasing adoption of cloud computing and the proliferation of geographically dispersed IT assets.\nIn March 2019, Visium entered into a software license agreement with MITRE Corporation to license a patented technology, known as TruContext, a tool for cyber warfare analytics, visualization, and knowledge management. TruContext is a military-grade highly scalable big data analytics tool for Cybersecurity, based on graph database technology. The development of the technology was sponsored by, and is currently in use by US Army Cyber Command. TruContext provides advanced analytics for cybersecurity situational awareness that is scalable, flexible, and comprehensive. Visium has completed significant proprietary product development efforts to commercialize TruContext. During fiscal 2021 the Company rebranded TruContext as TruContextTM to reflect the enhanced version of the software tool which resulted from significant proprietary development of the software.\nResults of Operations\nDevelopment Expense\nFor the year ended June 30, 2022, development expense totaled $361,298 as compared to $258,168 for the year ended June 30, 2021, an increase of $103,130 or approximately 72%.\nSelling, General, and Administrative Expenses\nFor the year ended June 30, 2022, selling, general and administrative expenses were $3,879,158 as compared to $3,879,158 for the year ended June 30, 2021, an increase of $2,961,165 or approximately 322.6%. For the years ended June 30, 2022 and 2021 selling, general and administrative expenses consisted of the following:\nIncrease/\n(Decrease)\n% Change\nAccounting expense\n$ 61,283\n$ 50,305\n$ 10,978\n22 %\nConsulting fees\n44,575\n56,455\n(11,880 )\n(21\n%)\nSalaries\n1,001,435\n374,000\n627,435\n168 %\nLegal and professional fees\n488,995\n144,180\n344,815\n239 %\nTravel expense\n15,512\n1,459\n14,053\n963 %\nOccupancy expense\n1,702\n1,333\n361 %\nTelephone expense\n4,037\n3,630\n11 %\nMarketing expense\n203,527\n5,877\n197,650\n3,363 %\nWebsite expense\n34,505\n6,284\n28,221\n449 %\nInvestor relations expense\n-\n15,000\n(15,000 )\n(100\n%)\nStock based consulting expense\n385,329\n372,553\n12,776\n3 %\nStock based compensation\n1,936,633\n2,809,000\n(872,637\n)\n(31\n%)\nOther\n138,658\n40,046\n98,612\n246 %\n$ 4,316,191\n$ 3,879,158\n$ 437,033\n11 %\nThe increase in selling, general and administrative expenses during fiscal 2022, when compared with the prior year, is primarily due to an increase in salaries of $627,435, legal and professional fees of $344,815, and stock based consulting expense of $899,175, offset by decreases in stock based compensation of $1,668,200.\nChange in Fair Value of Derivative Liability\nYears ended\nJune 30,\nGain on change in fair value of derivative liabilities\n$ 1,119\n$ 1,844,460\nChanges in fair value of derivative liabilities results from the changes in the fair value of the derivative liability due to the application of ASC 815, resulting in either income or expense, depending on the difference in fair value of the derivative liabilities between their measurement dates. The increase in fair value of derivative liabilities recognized during fiscal 2021 is primarily due to a change in accounting estimate related to the accounting for derivative liabilities as a result of a decrease in share price.\nDerivative Liability Expense\nYears Ended\nJune 30,\n%\nChange\nDerivative liability expense\n$ -\n$ 1,059,282\n100 %\nThe Company issued convertible notes in January 2021 and June 2021 which provisions contained variable price conversion terms, resulting in a derivative liability expense, measured as of the issuance date of the notes.\nInterest Expense\nYears Ended\nJune 30,\n%\nChange\nInterest Expense\n$ 705,075\n$ 442,167\n48 %\nInterest expense represents the stated interest of notes and convertible notes payable as well as the amortization of debt discount. The increase in interest expense during fiscal 2021 is primarily due to higher amortization of debt discount of $265,582.\nGain on Debt Write-Off\nYears Ended\nJune 30,\nGain (loss) on debt write off/conversions\n$ 187,930\n$ 607,271\nIn June 2021, the Company obtained a legal opinion to extinguish aged debt totaling $787,272 as detailed in the following table. Each of the individual debt instruments were determined to be beyond the statute of limitations and it was determined that the Company has a complete defense to liability related to this debt under the applicable statute of limitations.\nAccrued interest payable\n$ 385,803\nConvertible notes payable\n401,469\n$ 787,272\nLiquidity and Capital Resources\nBalance at June 30,\nCash\n$ 136,990\n$ 125,166\nAccounts payable and accrued expenses\n(596,464 )\n(425,804 )\nAccrued compensation\n(614,589\n)\n(672,529 )\nNotes, convertible notes, and accrued interest\n$ (1,684,199 )\n$ (1,735,057 )\nAt June 30, 2021 our total assets consisted of cash and prepaid license fees. At June 30, 2022 100% our total assets consisted of cash.\nWe do not have any material commitments for capital expenditures.\nThe objective of liquidity management is to ensure that we have ready access to sufficient funds to meet commitments and effectively implement our growth strategy. Our primary sources are financing activities such as the issuance of notes payable and convertible notes payable. In the past, we have mostly relied on debt and equity financing to provide for our operating needs.\nWe were unable to generate sufficient funds from operations to fund our ongoing operating requirements through June 30, 2022. As of September 30, 2022, we had approximately $100,000 on hand. We may need to raise funds to enhance our working capital and use them for strategic purposes. If such need arises, we intend to generate proceeds from either debt or equity financing.\nWe intend to finance our operations using equity financing. We do not anticipate incurring capital expenditures for the foreseeable future. We anticipate that we will need to raise approximately $180,000 per year in the near term to finance the recurring costs of being a publicly traded company.\nGoing Concern\nThe accompanying financial statements have been prepared on a going concern basis. The Company has used net cash in its operating activities of $2,224,572 and $792,640 during the years ended June 30 2021 and 2021, respectively, and has a working capital deficit of approximately $2.8 million and $3.4 million at June 30, 2022 and 2021, respectively. The Companys ability to continue as a going concern is dependent upon its ability to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due, to fund possible future acquisitions, and to generate profitable operations in the future, once a merger with an operating company is consummated. Management plans may continue to provide for its capital requirements by issuing additional equity securities and debt and the Company will continue to find possible acquisition targets. The outcome of these matters cannot be predicted at this time and there are no assurances that, if achieved, the Company will have sufficient funds to execute its business plan or generate positive operating results.\nYears Ended\nJune 30,\nCash flows from operating activities:\nNet loss\n$ (5,193,515 )\n$ (3,373,459 )\nNon-cash Adjustments:\n(Gain) loss on debt settlement and expense write off\n(187,930 )\n(607,271\nStock based compensation\n2,178,437\n3,163,000\nAmortization of debt discount\n571,081\n305,499\nDerivative liability expense\n-\n1,059,282\n(Gain) on change in derivative liability\n(1,119 )\n(1,844,460 )\nAmortization of deferred compensation\n143,529\n-\nAmortization of prepaid expenses\n55,417\n-\nWarrant conversion expense\n-\n211,411\nChanges in assets and liabilities\nAccrued interest\n97,926\n96,007\nAccrued compensation\n(57,940 )\n20,000\nAccounts payable and accrued expenses\n169,538\n445,850\nPrepaid license fees\n-\n(55,417\nDiscount on note payable\n-\n(213,082 )\nNet cash used in operations\n(2,224,572 )\n(792,640 )\nCash flows from financing activities:\nAdvance from officers, net\n-\n(102,340 )\nRepayment of convertible notes payable\n(115,000 )\n(73,700 )\nProceeds from sale of common stock\n1,500,000\n-\nProceeds from issuance of short term notes payable\n-\n225,000\nRepayment of short term notes payable\n(225,000 )\n-\nProceeds from issuance of convertible notes payable, net of debt issuance costs\n1,076,400\n838,595\nNet cash provided by financing activities\n2,236,400\n887,555\nNet increase in cash\n$ 11,824\n$ 94,915\nYear ended June 30, 2022\nNet cash used in operations in fiscal year 2022 increased by $1,525,536 or 192% from fiscal year 2021. This cash was obtained through the sale of common stock that netted the Company $1,500,000, and three convertible notes that netted the Company $1,170,000.\nYear ended June 30, 2021\nNet cash used in operations in fiscal year 2021 increased by $685,883 or 646% from fiscal year 2020. This cash was obtained through the sale of three convertible notes that netted the Company $838,595, and from the sale of three short term notes payable that netted the Company $225,000.\nCapital Raising Transactions\nIssuance of Convertible Notes Payable\nWe generated net proceeds of $1,170,000 and $838,595 during fiscal 2022 and 2021, respectively, from the issuance of convertible notes payable. We generated net proceeds of $225,000 during fiscal 2021 from the issuance of short term notes payable.\nConvertible Notes Payable\nThe Company had convertible promissory notes aggregating approximately $809,000 and $853,000 outstanding at June 30, 2022 and 2021, respectively. The accrued interest amounted to approximately $163,000 and $503,000 at June 30, 2022 and 2021, respectively. There is no provision in the note agreements for adjustments to the interest rates on these notes in the event of default. The convertible notes payable bear interest at rates ranging between 10% and 18% per annum. Interest is generally payable monthly. The Convertible Notes Payable are generally convertible at rates ranging between $0.20 and $22,500,000 per share, at the holders option. At June 30, 2022, all convertible promissory notes have matured.\nBalance at\nBalance at\nJune 30, 2022\nJune 30, 2021\nConvertible notes payable\n$ 1,487,431\n$ 1,205,228\nDiscount on convertible notes\n(412,944 )\n(396,033 )\nNotes payable, net of discount\n$ 1,074,487\n$ 809,195\nConvertible notes payable to ASC Recap LLC\nOn July 22 2013, and May 6, 2014, the Company issued to ASC Recap LLC (ASC) two convertible promissory notes with principal amounts of $25,000 and $125,000, respectively. These two notes were issued as a fee for services under a 3(a)10 transaction.\nIn May 2022 the Company entered into a litigation settlement agreement to satisfy the balance owed on these notes. Pursuant to the agreement the Company issued 44,444 shares of its $0.0001 par value common stock, valued at $108,000, or $2.43 per share, the market value at the time, resulting in a gain on extinguishment of debt of $187,930.\nNotes Payable\nThe Company had promissory notes aggregating approximately $205,000 at June 30, 2022 and $411,748 at June 30, 2021. The related accrued interest amounted to approximately $226,300 and $204,900 at June 30, 2022 and 2021, respectively. There is no provision in the note agreements for adjustments to the interest rates on these notes in the event of default. The notes payable bear interest at rates between 0% and 16% per annum. Interest is generally payable monthly. $205,000 of these notes have matured as of June 30, 2022.\nCommon Stock Warrants\nIn January and February 2021, we issued 39,371 warrants with a two-year life, and fixed exercise prices ranging from $0.0055 to $0.02 per share. An additional 9,239,130 warrant shares were issued due to repricing certain warrants with a $0.02 exercise price to a $0.0115 exercise price.\nIn January 2019 we issued 500 warrants with a three-year life and a conversion price of $0.15 per share. These warrants had price protection provisions that allow for the reduction in the current exercise price upon the occurrence of certain events, including the Companys issuance of common stock or securities convertible into or exercisable for common stock, such as options and warrants, at a price per share less than the exercise price then in effect. For instance, if the Company issues shares of its common stock or options exercisable for or securities convertible into common stock at an effective price per share of common stock less than the exercise price then in effect, the exercise price will be reduced to the effective price of the new issuance. Simultaneously with any reduction to the exercise price, the number of shares of common stock that may be purchased upon exercise of each of these warrants shall be increased proportionately, so that after such adjustment the aggregate exercise price payable for the adjusted number of warrants shall be the same as the aggregate exercise price in effect immediately prior to such adjustment.\nThe holders of the warrants issued in 2019 exercised all of their warrants on a cashless basis, during the three months ended December 31, 2020. Due to the price protection features of these warrants, the Company issued 277,407 warrant shares to these warrant holders.\nA summary of the status of the Companys outstanding common stock warrants as of June 30, 2022 and changes during the fiscal year ending on that date is as follows:\nNumber of\nWeighted Average\nWarrants\nExercise Price\nCommon Stock Warrants\nBalance at beginning of year\n9,012\n$ 14.85\nGranted\n2,781\n$ 14.22\nExercised\n(4,863 )\n0.0002\nForfeited\n(1,881 )\n0.0002\nBalance at end of period\n5,049\n$ 0.011\nWarrants exercisable at end of period\n5,049\n$ 0.011\nDerivative Liability\nThe Company recognizes all derivative financial instruments on its balance sheet at fair value.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements.\nClimate Change\nOur opinion is that neither climate change, nor governmental regulations related to climate change, have had, or are expected to have, any material effect on our operations.\nCritical Accounting Policies\nWe have identified the policies below as critical to our understanding of the results of our business operations. We discuss the impact and any associated risks related to these policies on our business operations throughout Managements Discussion and Analysis of Financial Condition and Results of Operations where such policies affect our reported and expected financial results.\nIn the ordinary course of business, we have made a number of estimates and assumptions in preparing our financial statements in conformity with accounting principles generally accepted in the United States of America (GAAP). Actual results could differ significantly from those estimates and assumptions. The following critical accounting policies are those that are most important to the portrayal of our consolidated financial statements. For a summary of our significant accounting policies, including the critical accounting policies discussed below, refer to Note 2 - Summary of Significant Accounting Policies included in the notes to consolidated financial statements for the year ended June 30, 2022 included elsewhere in this Annual Report on Form 10-K.\nWe consider the following accounting policies to be those most important to the portrayal of our results of operations and financial condition:\nRevenue Recognition\nWe recognize revenue in accordance with the Financial Accounting Standards Boards (FASB), Accounting Standards Codification (ASC) ASC 606, Revenue from Contracts with Customers (ASC 606). Revenues are recognized when control is transferred to customers in amounts that reflect the consideration the Company expects to be entitled to receive in exchange for those goods. Revenue recognition is evaluated through the following five steps: (i) identification of the contract, or contracts, with a customer; (ii) identification of the performance obligations in the contract; (iii) determination of the transaction price; (iv) allocation of the transaction price to the performance obligations in the contract; and (v) recognition of revenue when or as a performance obligation is satisfied.\nThe Company recognizes revenue when performance obligations under the terms of a contract with the customer are satisfied. Product sales occur once control is transferred upon delivery to the customer. Revenue is measured as the amount of consideration the Company expects to receive in exchange for transferring products. In the event any discounts, sales incentives, or similar arrangements are agreed to with a customer, such amounts are estimated at time of sale and deducted from revenue. Sales taxes and other similar taxes are excluded from revenue.\nConvertible Instruments - The Company evaluates and accounts for conversion options embedded in its convertible instruments in accordance with ASC 815.\nASC 815 generally provides three criteria that, if met, require companies to bifurcate conversion options from their host instruments and account for them as free standing derivative financial instruments in accordance with EITF 00-19. These three criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument subject to the requirements of ASC 815. ASC 815 also provides an exception to this rule when the host instrument is deemed to be conventional (as that term is described).\nThe Company accounts for convertible instruments (when it has determined that the embedded conversion options should not be bifurcated from their host instruments) in accordance with the provisions of ASC 470 20 Debt with Conversion Options Accordingly, the Company records, when necessary, discounts to convertible notes for the intrinsic value of conversion options embedded in debt instruments based upon the differences between the fair value of the underlying common stock at the commitment date of the note transaction and the effective conversion price embedded in the note. Debt discounts under these arrangements are amortized over the term of the related debt to their earliest date of redemption. The Company also records when necessary deemed dividends for the intrinsic value of conversion options embedded in preferred shares based upon the differences between the fair value of the underlying common stock at the commitment date of the note transaction and the effective conversion price embedded in the note.\nThe Company believes the certain conversion features embedded in convertible notes payable are not clearly and closely related to the economic characteristics of the Companys stock price. Accordingly, the Company has recognized derivative liabilities in connection with such instruments. The Company uses judgment in determining the fair value of derivative liabilities at the date of issuance at every balance sheet thereafter. The Company uses judgment in determining which valuation is most appropriate for the instrument (e.g., Cox, Ross & Rubinstein Binomial Tree valuation model), the expected volatility, the implied risk-free interest rate, as well as the expected dividend rate.\nShare-Based Compensation\nWe compute share-based payments in accordance with the provisions of ASC Topic 718, Compensation - Stock Compensation and related interpretations. As such, compensation cost is measured on the date of grant at the fair value of the share-based payments. Such compensation amounts, if any, are amortized over the respective vesting periods of the grants.\nRestricted stock awards are granted at the discretion of the compensation committee of our board of directors (the Board of Directors). These awards are restricted as to the transfer of ownership and generally vest over the requisite service periods (vesting on a straight-line basis). The fair value of a stock award is equal to the fair market value of a share of our common stock on the grant date.\nWe estimate the fair value of stock options and warrants by using the Cox, Ross & Rubinstein Binomial Tree model. The Cox, Ross & Rubinstein valuation model requires the development of assumptions that are inputs into the model. These assumptions are the expected stock volatility, the risk-free interest rate, the expected life of the option, the dividend yield on the underlying stock and the expected forfeiture rate. Expected volatility is calculated based on the historical volatility of our common stock over the expected term of the option. Risk-free interest rates are calculated based on continuously compounded risk-free rates for the appropriate term.\nDetermining the appropriate fair value model and calculating the fair value of equity-based payment awards requires the input of the subjective assumptions described above. The assumptions used in calculating the fair value of equity-based payment awards represent managements best estimates, which involve inherent uncertainties and the application of managements judgment. We are required to estimate the expected forfeiture rate and recognize expense only for those shares expected to vest.\nWe account for share-based payments granted to non-employees in accordance with ASC 505-50, Equity Based Payments to Non-Employees. We determine the fair value of the stock-based payment as either the fair value of the consideration received or the fair value of the equity instruments issued, whichever is more readily determinable. If the fair value of the equity instruments issued is used, it is measured using the stock price and other measurement assumptions as of the earlier of either (1) the date at which a commitment for performance by the counterparty to earn the equity instruments is reached, or (2) the date at which the counterpartys performance is complete.\nDerivative Instruments\nWe enter into financing arrangements that consist of freestanding derivative instruments or are hybrid instruments that contain embedded derivative features. We recognize derivative instruments as either assets or liabilities in the balance sheet and measure such derivative instruments at fair values with gains or losses recognized in earnings. Embedded derivatives that are not clearly and closely related to the host contract are bifurcated and are recognized at fair value with changes in fair value recognized as either a gain or loss in earnings. The fair values of derivative financial instruments are estimated using various techniques (and combinations thereof) that are considered consistent with the objective measuring fair values. In selecting the appropriate technique, the nature of the instrument, the market risks that it embodies and the expected means of settlement are considered. Estimating fair values of derivative financial instruments requires the development of significant and subjective estimates that may, and are likely to, change over the duration of the instrument with related changes in internal and external market factors. In addition, option-based techniques (such as the Cox, Ross & Rubinstein model) are highly volatile and sensitive to changes in the trading market price of our common stock. Since derivative financial instruments are initially and subsequently carried at fair values, our income (expense) going forward will reflect the volatility in these estimates and assumption changes. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot applicable. Item 8. Financial Statements and Supplementary Data.\nThe information required by this item is included in Item 15 of this Annual Report on Form 10-K. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer, who at June 30, 2022 was also our principal executive and financial officer, has evaluated the effectiveness of our disclosure controls and procedures as defined in Rule 13a-15(e) of the Securities Exchange Act of 1934, as amended, or the Exchange Act. Based upon that evaluation, our Chief Executive Officer concluded that, as of June 30, 2022, our disclosure controls and procedures were not effective in ensuring that material information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms, including ensuring that such material information is accumulated and communicated to our Chief Executive Officer to allow timely decisions regarding required disclosure.\nManagement Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Exchange Act. Our management assessed the effectiveness of our internal control over financial reporting as of June 30, 2022. In making this assessment, our management used criteria issued by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control Over Financial Reporting - Guidance for Smaller Public Companies.\nDuring our assessment of the design and the effectiveness of internal control over financial reporting as of June 30, 2022, management identified the following material weaknesses:\n●\nWhile we have processes in place, there are no formal written policies and procedures related to certain financial reporting processes;\n●\nThere is no formal documentation in which management specified financial reporting objectives to enable the identification of risks, including fraud risks;\n●\nOur Board of Directors consists of six members, however, we lack the resources and personnel to implement proper segregation of duties or other risk mitigation systems.\nA material weakness is a significant deficiency, or a combination of significant deficiencies, that result in more than a remote likelihood that a material misstatement of the annual or interim financial statements will not be prevented or detected by us in a timely manner. A significant deficiency is a deficiency or a combination of deficiencies, in internal control over financial reporting that is less severe than a material weakness, yet important enough to merit attention by those responsible for oversight of the registrants financial reporting.\nWe intend to gradually improve our internal control over financial reporting to the extent that we can allocate resources to such improvements. We intend to prioritize the design of our internal control over financial reporting starting with our control environment and risk assessments and ending with control activities, information and communication activities, and monitoring activities. Although we believe the time to adapt in the next year will help position us to provide improved internal control functions into the future, in the interim, these changes caused control deficiencies, which in the aggregate resulted in a material weakness. Due to the existence of these material weaknesses, our management, including our Chief Executive Officer, concluded that our internal control over financial reporting was not effective as of June 30, 2022.\nThis annual report does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys independent registered public accounting firm pursuant to the rules of the SEC that permit smaller reporting companies to provide only the managements report in this annual report.\nChanges in Internal Control over Financial Reporting\nThere was no change in our internal control over financial reporting during the fiscal quarter ended June 30, 2022, that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe following table sets forth the names, ages and principal position of our executive officers and directors as of June 30, 2022:\nName\nAge\nPosition\nMark Lucky\nChairman of the Board, Chief Executive Office, Chief Financial Officer\nThomas Grbelja (1)(2)\nDirector\nEmmanuel Esaka, MD\nDirector\nPaul Favata (1)(2)\nDirector\nWayne Monk\nDirector\nSolomon Adote\nDirector\n(1) Member of the Compensation Committee\n(2) Member of the Audit Committee\nMr. Mark Lucky has served as the Companys Chief Executive Officer, Treasurer, Secretary, and Chairman of the Companys Board of Directors since February 2019. Mr. Lucky has been a certified public accountant and has more than 15 years of experience serving as a public company chief financial officer. His professional experience includes working with start-ups, development-stage and mature companies in a wide variety of industries. From May 2014 until February 2019 Mr. Lucky has worked as a consultant to various public and private companies, including Visium Technologies, Inc., Intelligent Living America, Inc. (OTCBB: ILIV), and Ronn Motor Group, Inc. Prior to that, Mr. Lucky served as the CFO for IceWeb Inc. (OTCBB: IWEB) from March 2007 to May 2014. From 2004 to 2005 he served as Vice President of Finance and Administration at Galt Associates, Inc., a Sterling, Virginia informatics/ technology and medical research services company and from 2001 to 2004 he was Vice President of Finance and Administration of MindShare Design, Inc., a San Francisco, California based internet technology company. During his career Mr. Lucky has also been employed by Axys Pharmaceuticals, Inc (NASDAQ: AXPH) a San Francisco, California-based early-stage drug discovery biotech company, PriceWaterhouseCoopers, LLC, COMPASS Management and Leasing, Inc., Mindscape, Inc., The Walt Disney Company and KPMG. Mr. Lucky formerly served as a member of the board of directors of Intelligent Living America, Inc., VOIS Inc. and HASCO Medical, Inc. Mr. Lucky received a B.A. degree in Economics from the University of California, Los Angeles.\nWe believe that Mr. Luckys extensive senior management and operational experience brings valuable knowledge to our board of directors and that these experiences, qualifications, and attributes have led to our conclusion that Mr. Lucky should be serving as a member of our board of directors.\nMr. Thomas Grbelja previously served as a director of Realbiz Media Group, Inc. (OTCBB: RBIZ), and served as their Chief Financial Officer from June 19, 2015 to January 2, 2017. Mr. Grbelja has spent over 30 years as a Certified Public Accountant providing a wide variety of professional accounting, tax and financial consulting services to professional service, manufacturing, and construction industry participants. Since 1990 he has served as the President and a Founding Member of Burke Grbelja & Symeonides, LLC, Certified Public Accountants, an accounting firm based in Rochelle Park, New Jersey. In addition, between 1983 and 1990, Mr. Grbelja worked as an accountant at Coopers & Lybrand, where he was responsible for the overall audit engagement, including filings with the SEC, for certain large, publicly traded companies. He received his undergraduate degree in accounting at Fairleigh Dickinson University and is a Certified Public Accountant.\nBased on his business experience the Company believes that Mr. Grbelja is well-qualified to serve on the Companys Board of Directors.\nMr. Paul Favata is a 29-year Wall Street veteran who began his career on the American Stock Exchange (AMEX), working for two smaller member firms, before moving to the New York Stock Exchange (NYSE). After five years with one of the largest specialist firms on the floor, Mr. Favata left the exchange in 1992 to work on the sell-side. Mr. Favata spent the bulk of the 1990s with a small boutique firm working in both the retail and institutional sales areas. Mr. Favata held the position of Senior Vice President of Finance at a small, privately held consulting firm that advised clients on acquisitions and long-term financing strategies. Since 2008, Mr. Favata has held various C-level executive positions including as Chief Financial Officer of a $60 million annual revenue telecom provider having management oversight and responsibility for all financial functions while overseeing all revenues, costs, capital expenditures, investments, and debt. Most recently, President of a publicly traded company specializing in the acquisition and integration of IT and Cloud Technology service providers and Internet and web technologies. Mr. Favata resides, with his family, in Saint Petersburg, Florida.\nWe believe that Mr. Favatas extensive senior management and operational experience brings valuable knowledge to our board of directors and that these experiences, qualifications, and attributes have led to our conclusion that Mr. Favata should be serving as a member of our board of directors.\nDr. Emmanuel Esaka. Dr. Esaka brings decades of experience as a successful surgeon. He has earned an MBA from Auburn University, and graduated Cum Laude with Highest Honors from Università Degli Studi di Bologna, Italy School of Medicine and Surgery. He is the Founder, Owner, and CEO of Advanced Care Obstetrics and Gynecology PA in Wilmington, Delaware, Co-Founder and Managing Director of 3N Pharma USA, Inc., Founder and CEO of Cameroon American Health System, Inc., and Co-Founder of Caritas Home Health Services, Inc. Dr. Osaka also served as attending obstetrics and gynecology at Irwin Army Community Hospital, and serves as a Director of Meiger Health, Inc.\nWe believe that Dr. Esakas extensive experience and business background adds valuable knowledge to our board of directors and that these experiences, qualifications, and attributes have led to our conclusion that Dr. Esaka should be serving as a member of our board of directors.\nWayne Monk. Mr. Monk has over 35 years of enterprise solution sales, marketing and alliance management experience working with technology companies to drive growth and develop their partner ecosystem to reach new customers and markets. Mr. Monk has a unique blend of sales and marketing leadership with the right level of technical expertise and proven business experience to help organizations accelerate their growth to new heights. Mr. Monk has held leadership positions at ASG Technologies, Skytap, Informatica, HP Software, Mercury, and Computer Associates. Mr. Monk holds a BS in Computer Science from Virginia Tech.\nWe believe that Mr. Monks extensive experience and business background, particularly involving his background in technology sales and channel development, adds valuable knowledge to our board of directors.\nSolomon Adote. Mr. Adote currently serves as the Chief Security Officer for the State of Delaware. Mr. Adote brings great experience designing comprehensive information security programs and deploying some of the industry's leading technologies. He has also developed hybrid-managed and in-house Security Operations Centers (SOC) and led the architecture and implementation of secure computing environments for both public and private clouds. Prior to his role with the State of Delaware, he led FMC, Inc.'s global IT cyber security team for six years. He was responsible for the security of a complex, 90-site international manufacturing and corporate network. His team covered all aspects of cyber security from network security, application security, incident response, identity, and access lifecycle management, to internet and remote access. Mr. Adote also previously worked as an IT security technical lead at QVC Inc., the third-largest e-commerce company in North America, where he secured a dynamic Payment Card Industry (PCI) compliant credit card processing environment with a web presence in multiple countries. Mr. Adote holds a Master of Science in Computer Information Technology degree from Regis University and various industry-leading certifications including Computer Information Security Management (CISM), Certified Information System Security Professional (CISSP), Cisco Certified Network Profession in Security (CCNP-S), Certified Ethical Hacker (C|EH), and SANs Firewall Security Analyst, among others.\nWe believe that Mr. Adotes extensive technology experience and business background, particularly involving network security, adds valuable knowledge to our board of directors.\nThere are no family relationships among our directors or executive officers.\nCommittees of the Board of Directors\nOur Board of Directors has established an Audit Committee, and a Compensation Committee, and meet as a whole to fulfill the functions of the Nominating Committee.\nAudit Committee. Mr. Favata and Mr. Grbelja are members of the Audit Committee. The Audit Committee of our Board of Directors was formed to assist the Board of Directors in fulfilling its oversight responsibilities for the integrity of our consolidated financial statements, compliance with legal and regulatory requirements, the independent registered public accounting firms qualifications and independence, and the performance of our internal audit function and independent auditors. The Audit Committee will also prepare the report that SEC rules require be included in our annual proxy statement. The Audit Committee has adopted a charter which sets forth the parameters of its authority The Audit Committee Charter provides that the Audit Committee is empowered to:\n●\nAppoint, compensate, and oversee the work of the independent registered public accounting firm employed by our company to conduct the annual audit. This firm will report directly to the audit committee;\n●\nResolve any disagreements between management and the auditor regarding financial reporting;\n●\nPre-approve all auditing and permitted non-audit services performed by our external audit firm;\n●\nRetain independent counsel, accountants, or others to advise the committee or assist in the conduct of an investigation;\n●\nSeek any information it requires from employees - all of whom are directed to cooperate with the committees requests - or external parties;\n●\nMeet with our officers, external auditors, or outside counsel, as necessary; and\n●\nThe committee may delegate authority to subcommittees, including the authority to pre-approve all auditing and permitted non-audit services, provided that such decisions are presented to the full committee at its next scheduled meeting.\nEach Audit Committee member is required to:\n●\nsatisfy the independence requirements of Section 10A(m)(3) of the Securities Exchange Act of 1934, and all rules and regulations promulgated by the SEC as well as the rules imposed by the stock exchange or other marketplace on which our securities may be listed from time to time, and\n●\nmeet the definitions of non-employee director for purposes of SEC Rule 16b-3 and outside director for purposes of Section 162(m) of the Internal Revenue Code.\nEach committee member is required to be financially literate and at least one member is to be designated as the financial expert, as defined by applicable legislation and regulation. No committee member is permitted to simultaneously serve on the audit committees of more than two other public companies. As we expand our Board of Directors with additional independent directors the number of directors serving on the Audit Committee will also increase.\nA copy of the Audit Committee Charter is available on our website at www.visiumtechnologies.com under Investor Relations.\nCompensation Committee. Mr. Favata and Mr. Grbelja are members of the Compensation Committee. The Compensation Committee was appointed by the Board to discharge the Boards responsibilities relating to:\n●\ncompensation of our executives,\n●\nequity-based compensation plans, including, without limitation, stock option and restricted stock plans, in which officers or employees may participate and\n●\narrangements with executive officers relating to their employment relationships with our company, including employment agreements, severance agreements, supplemental pension, or savings arrangements, change in control agreements and restrictive covenants.\nThe Compensation Committee has adopted a charter. The Compensation Committee charter provides that the Compensation Committee has overall responsibility for approving and evaluating executive officer compensation plans, policies, and programs of our company, as well as all equity-based compensation plans and policies. In addition, the Compensation Committee oversees, reviews, and approves all of our ERISA and other employee benefit plans which we may establish from time to time. The Compensation Committee is also responsible for producing an annual report on executive compensation for inclusion in our proxy statement and assisting in the preparation of certain information to be included in other periodic reports filed with the SEC.\nEach Compensation Committee member is required to:\n●\nsatisfy the independence requirements of Section 10A(m)(3) of the Securities Exchange Act of 1934, and all rules and regulations promulgated by the SEC as well as the rules imposed by the stock exchange or other marketplace on which our securities may be listed from time to time, and\n●\nmeet the definitions of non-employee director for purposes of SEC Rule 16b-3 and outside director for purposes of Section 162(m) of the Internal Revenue Code.\nPursuant to our Compensation Committee Charter, the Compensation Committee is charged with evaluating and recommending for approval by the Board of Directors the compensation of our executive officers. In addition, the Compensation Committee also evaluates and makes recommendations to the entire Board of Directors regarding grants of options which may be made as director compensation. The Compensation Committee does not delegate these authorities to any other persons, nor does it use the services of any compensation consultants.\nCompliance with Section 16(a) of the Exchange Act\nSection 16(a) of the Securities Exchange Act of 1934 requires our officers and directors, and persons who own more than ten percent of a registered class of our equity securities, to file reports of ownership and changes in ownership with the Securities and Exchange Commission. Such persons are required by SEC regulations to furnish us with copies of all Section 16(a) reports they file.\nTo our knowledge, based solely on our review of the copies of such reports furnished to us and written representations that no other reports were required to be filed during fiscal 2020, we believe that for fiscal 2021, all required reports were filed on a timely basis under Section 16(a), except for Dr Esaka, who had not yet filed his initial Form 3 or subsequent Form 4 and Form 5.\nCode of Ethics\nWe have adopted a Code of Ethics and Business Conduct to provide guiding principles to our principal executive officer, principal financial officer, and principal accounting officer or controller of our company in the performance of their duties. Our Code of Ethics and Business Conduct also strongly recommends that all directors and employees of our company comply with the code in the performance of their duties. Our Code of Ethics and Business Conduct provides that the basic principle that governs all of our officers, directors and employees is that our business should be carried on with loyalty to the interest of our stockholders, customers, suppliers, fellow employees, strategic partners and other business associates. We believe that the philosophy and operating style of our management are essential to the establishment of a proper corporate environment for the conduct of our business.\nGenerally, our Code of Ethics and Business Conduct provides guidelines regarding:\n·\nconflicts of interest,\n·\nfinancial reporting responsibilities,\n·\ninsider trading,\n·\ninappropriate and irregular conduct,\n·\npolitical contributions, and\n·\ncompliance with laws. Item 11. Executive Compensation.\nThe following table sets forth, for the last two completed fiscal years, all compensation paid, distributed or accrued for services rendered to us by (i) all individuals serving as our principal executive officer or acting in a similar capacity during the last completed fiscal year, regardless of compensation level; (ii) our two most highly compensated executive officers other than the principal executive officer who were serving as executive officers at the end of the last completed fiscal year and whose total compensation exceeded $100,000; and (iii) up to two additional individuals for whom disclosure would have been provided pursuant to (ii) above but for the fact that the individual was not serving as our executive officer at the end of the last completed fiscal year:\nSummary Compensation Table\nNon-\nEquity\nNon-Qualified\nIncentive Plan\nDeferred\nAll Other\nName and Principal Position\nYear\nSalary\n($)(1)\nBonus\n($)\nStock\nAwards\nOption\nAwards ($)\nCompensation ($)\nCompensation\nEarnings\nCompensation ($)\nTotal ($)\nMark Lucky (1)\n$ 400,000\n$\n$ 690,000\n$\n$\n$\n$\n$ 1,090,000\nChief Executive Officer and Chief Financial Officer\n$ 374,000\n$\n$ 1,906,000\n$\n$\n$\n$\n$ 2,280,000\n(1)\nAmounts includes accrued compensation for Mr. Lucky.\nEmployment Agreements\nCurrently no employees are party to any employment agreement with the Company. We anticipate that as we complete certain acquisition transactions, the Company will enter into employment agreements with key executives.\nPension, Retirement or Similar Benefit Plans\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. Our directors and executive officers may receive stock options at the discretion of our Board in the future.\nOutstanding Equity Awards at Fiscal Year-End\nThe following table provides information concerning equity incentive plan awards for each named executive officer outstanding as of June 30, 2022:\nOUTSTANDING EQUITY AWARDS AT FISCAL YEAR END\nSTOCK AWARDS\nEquity\nEquity\nIncentive\nIncentive\nPlan\nMarket\nPlan\nAwards:\nNumber\nValue\nAwards:\nMarket\nof\nof\nNumber\nor Payout\nShares\nShares\nof\nValue of\nor\nor\nUnearned\nUnearned\nUnits\nUnits\nShares,\nShares,\nof\nof\nUnits or\nUnits or\nStock\nStock\nOther\nOther\nThat\nThat\nRights\nRights\nHave\nHave\nThat\nThat\nNot\nNot\nHave Not\nHave Not\nVested\nVested\nVested\nVested\nName\n(#)\n($)\n(#)\n(#)\n(a)\n(g)\n(h)\n(i)\n(j)\nNone\n-\n$ -\n-\n-\nDirector Compensation\nOur Board of Directors is comprised of Mr. Paul Favata, Mr. Tom Grbelja, Dr. Emmanuel Esaka, and Mr. Mark Lucky, who is also an executive officer of our company. In March 2021, Messrs. Favata and Grbelja each received restricted stock grants as compensation for their Board services.\nThe following table sets forth the restricted stock grants issued to Messrs. Favata, Grbelja, and Dr. Esaka as compensation for their Board service:\nFY2022\nFY2021\nCommon Shares\nCommon Shares\nName\nGranted/Vested\nExpense\nGranted/Vested\nExpense\nTom Grbelja\n8,894\n138,000\n56,296\n$ 857,000\nPaul Favata\n2,967\n46,000\n1,481\n23,000\nEmmanuel Esaka\n2,967\n46,000\n1,481\n23,000\nWayne Monk\n18,519\n95,000\n-\n-\nSolomon Adote\n19,260\n145,000\n-\n-\n52,607\n470,000\n59,258\n$ 903,000 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholders Matters.\nAt September 25, 2022, we had 2,896,396 shares of our Common Stock outstanding. The following table sets forth information regarding the beneficial ownership of our Common Stock as of September 25, 2022:\n●\neach person known by us to be the beneficial owner of more than 5% of our Common Stock;\n●\nour director;\n●\neach of our executive officers named in the compensation tables in Item 11; and\n●\nall of our executive officers and director as a group.\nAmount and Nature of Beneficial Ownership\nCOMMON STOCK\nSeries AA Preferred Stock Ownership\nAMOUNT OF\nAMOUNT OF\n% OF\nVOTING\nBENEFICIAL\n% OF\nBENEFICIAL\n% OF\nCONTROL\nNAME\nOWNERSHIP\nCLASS\nOWNERSHIP\nCLASS\n(1 )\nMark Lucky\n339,465\n11.70\n%\n100 %\n56.73\n%\nTom Grbelja\n115,169\n3.97\n%\n1.94\n%\nPaul Favata\n23,214\n0.80 %\n0.39 %\nEmmanuel Esaka\n75,688\n2.61 %\n1.28 %\nWayne Monk\n21,483\n0.74\n%\n0.36\n%\nSolomon Adote\n23,707\n0.82\n%\n0.40\n%\nOfficers and directors as a group\n598,726\n20.63\n%\n100 %\n61.11\n%\nTotal\n598,726\n20.63\n%\n100 %\n61.11\n%\n(1)\nPercent of Voting Control is based upon the number of outstanding shares of our common stock and our Series AA Preferred Stock as of September 30, 2022. On that date, we had 2,901,590 outstanding shares of common stock with one vote per share, and 1 share of Series AA Preferred Stock outstanding with voting rights equal to 51% of the outstanding common shares.\nThe following table sets forth securities authorized for issuance under any equity compensation plans approved by our stockholders as well as any equity compensation plans not approved by our stockholder as of June 30, 2022.\nPlan category\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights (a)\nWeighted-average exercise price of outstanding options, warrants and rights (b)\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a)) (c)\nEquity compensation plans approved by security holders\n2021 Employee Stock Compensation Plan\n2,222\n$ 27.00\n88,888\nEquity compensation plans not approved by security holders\n-\n-\n-\nTotal\n2,222\n$ 27.00\n88,888 Item 13. Certain Relationship and Related Party Transactions, and Director Independence.\nOther than compensation arrangements, we describe below, transactions during our last fiscal year, to which we were a party, in which:\n●\nThe amounts involved exceeded or will exceed the lesser of $120,000 or 1% of the average of our total assets at year-end for the last two completed fiscal years; and\n●\nAny of our directors, executive officers, or holders of more than 5% of our common stock, or any member of the immediate family of the foregoing persons, had or will have a direct or indirect material interest.\nCommon Stock\nIssuances of Common Stock During Fiscal 2022\nDuring fiscal 2022 we issued shares of our common stock as follows:\nConvertible Notes Payable\nDuring the year ended June 30, 2022 the Company issued 146,701 shares of its common stock related to the conversion of $828,797 of principal and accrued interest of its convertible notes payable, at an average contract conversion price of $5.66 per share. The fair value of the shares issued was $831,048.\nSale of Restricted Common Stock\nDuring the year ended June 30, 2022, the Company sold 222,223 shares of its $0.0001 par value common stock valued at $1,500,000, or $6.75 per share.\nCommitment Shares\nDuring the year ended June 30, 2022, we issued 86,667 shares of its common stock as commitment shares related to four financing transactions that raised an aggregate $1,170,000. The fair value of the commitment shares totaled $236,567 and was accounted for as discount on the related notes payable, which is being amortized over the term of the note.\nStock Based Compensation\nDuring the year ended June 30, 2022, the Company issued 100,758 shares of its $0.0001 par value common stock as compensation to its directors and officers. The shares were valued at $1,134,118, or $11.25 per share, based on the share price at the time of the transactions.\nDuring the year ended June 30, 2022, the Company issued and vested 53,334 shares of its $0.0001 par value common stock to three consultants, as compensation under three separate consulting agreements. The shares were valued at $763,036, or $13.88 per share, based on the share price at the time of the transactions.\nDuring the year ended June 30, 2022, the Company issued and vested 54,955 shares of its $0.0001 par value common stock to its employees, as compensation. The shares were valued at $255,033, or $4.78 per share, based on the share price at the time of the transactions.\nIssuances of Common Stock During Fiscal 2021\nDuring fiscal 2021 we issued shares of our common stock as follows:\nConvertible Notes Payable\nDuring the year ended June 30, 2021, the Company issued 388,550 shares of its common stock related to the conversion of $188,460 of principal and accrued interest of its convertible notes payable, at an average contract conversion price of $0.50 per share. The fair value of the shares issued was $2,422,722.\nSale of Restricted Common Stock\nDuring the year ended June 30, 2021, the Company issued 166,667 commitment shares related to convertible note transactions, with 4 investors.\nStock Based Compensation\nDuring the year ended June 30, 2021, the Company issued 162,963 shares of its $0.0001 par value common stock as compensation to its directors and officers. The shares were valued at $2,809,000, or $17.55 per share, based on the share price at the time of the transactions.\nDuring the year ended June 30, 2021, the Company issued and vested 41,975 shares of its $0.0001 par value common stock to three consultants, as compensation under three separate consulting agreements. The shares were valued at $354,000, or $8.43 per share, based on the share price at the time of the transactions.\nDirector Independence\nAlthough our common stock is not listed on any national securities exchange, for purposes of independence we use the definition of independence applied by The Nasdaq Stock Market. The Board has determined that each of Paul Favata, Tom Grbelja, and Dr. Emmanuel Esaka are independent in accordance with such definition. Item 14. Principal Accountant Fees and Services\nDuring the two most recent fiscal years and through the Engagement Date, neither the Company, nor any one on its behalf, consulted with Assurance Dimensions, Inc. in regard to the application of accounting principles to any specified transaction, either completed or proposed, or the type of audit opinion that might be rendered on the Companys financial statements, or any other matters or reportable events as defined in Item 304(a)(2)(i) and (ii) of Regulation S-K.\nThe following table summarizes the fees of Assurance Dimensions, Inc., our independent registered public accounting firm billed for each of the last two fiscal years for audit services and other services:\nFee Category\nAudit Related Fees Paid to Assurance Dimensions, Inc. (1)\n$ 35,500\n$ 35,500\nTax Fees (2)\n-\nAll Other Fees\n-\nTotal Fees\n$ 35,500\n$ 35,500\n(1) Consists of fees for professional services rendered in connection with the financial statements included in our Annual Report on Form 10-K and quarterly reports on Form 10-Q.\n(2) Consists of fees relating to any tax compliance and tax planning.\nPART IV Item 15. Exhibits and Financial Statement Schedules\na. Index to Financial Statements and Financial Statement Schedules\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations for each of the two years in the period ended June 30, 2022\nConsolidated Statements of Changes in Stockholders Deficit for each of the two years in the period ended June 30, 2022\nConsolidated Statements of Cash Flows for each of the two years in the period ended June 30, 2022\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n-\nAll other schedules for which provision is made in the applicable accounting regulations of the SEC are not required under the related instructions, or are inapplicable, and therefore have been omitted.\nb. Exhibits\nExhibit No.\nDescription of Exhibit\n2.1\nMerger Agreement Between Jaguar Investments, Inc., Freight Rate, Inc., and Jag2 Corporation (1)\n2.2\nAgreement and Plan of Merger Between Fittipaldi Logistics, Inc. and State Petroleum Distributors, Inc. (30)\n2.3\nMembership Interest Purchase Agreement by and Among Threat Surface Solutions Group, LLC, Acquired Data Solutions, Inc., Ramparts, LLC, and Kevin Anderson, an Individual, and Visium Technologies, Inc. (36)\n2.4\nAmendment to Membership Interest Purchase Agreement (37)\n3.1\nArticles of Incorporation (2)\n3.2\nCertificate of Amendment to Articles of Incorporation (3)\n3.3\nCertificate of Amendment to the Articles of Incorporation (4)\n3.4\nCertificate of Voting Powers, Designations, Preferences and Rights to Series B Convertible Preferred Stock (10)\n3.5\nCertificate of Voting Powers, Designations, Preferences and Rights to Series C Convertible Preferred Stock (10)\n3.6\nCertificate of Voting Powers, Designations, Preferences and Rights to Series Y Preferred Stock (5)\n3.7\nCertificate of Correction of Certificate of Voting Powers, Designations, Preferences and Right to Series Y Preferred Stock (5)\n3.8\nCertificate of Amendment to Articles of Incorporation Increasing Authorized Shares of Common Stock to 250,000,000 filed on August 13, 2004 (9)\n3.9\nCertificate of Voting Powers, Designations, Preferences and Rights to Preferred Stock of Series X Convertible Preferred Stock (5)\n3.10\nBylaws (2)\n3.11\nAmended Bylaws dated March 31, 2003 (5)\n3.12\nCertificate to Set Forth Designations, Preferences and Rights to Series D Convertible Preferred Stock (23)\n3.13\nCertificate to Set Forth Designations, Preferences and Rights to Series E Convertible Preferred Stock (29)\n3.14\nCertificate to Set Forth Designations, Preferences and Rights to Series F Convertible Preferred Stock (29)\n3.15\nCertificate to Set Forth Designations, Preferences and Rights to Series G Convertible Preferred Stock (29)\n3.16\nCertificate to Set Forth Designations, Preferences and Rights to Series H Convertible Preferred Stock (29)\n3.17\nCertificate to Set Forth Designations, Preferences and Rights to Series I Convertible Preferred Stock (29)\n3.18\nCertificate to Set Forth Designations, Preferences and Rights to Series J Convertible Preferred Stock (35)\n4.1\nForm of Common Stock Purchase Warrant to Newbridge Securities Corporation for Business Advisory Agreement (10)\n4.1\nForm of Unsecured Promissory Note to Talos Victory Fund, LLC and Mast Hill Fund, L.P. for $270,000 Principal Amount (40)\n4.1\nForm of Unsecured Promissory Note to Investor for $270,000 Principal Amount (41)\n4.2\nForm of 14.25% secured convertible debenture (35)\n4.3\n$100,000 principal amount promissory note pursuant to settlement agreement with Stokes Logistics Consulting, LLC (35)\n4.4\n$100,000 principal amount 8% secured convertible promissory note (35)\n4.5\nLetter of agreement dated February 8, 2008 evidencing $25,000 principal promissory note to Canberra Financial Services II, Inc. (35)\n4.6\n$14,000 principal 12.5% promissory note for services (35)\n4.7\nForm of unsecured promissory note (35)\n4.8\nForm of non-plan option agreement (10)\n4.9\nForm of common stock purchase warrant (10)\n4.10\nForm of Common Stock Purchase Warrant re: 14.25% secured convertible debentures (10)\n4.11\nForm of Common Stock Purchase Warrant issued to Newbridge Securities Corporation as Placement Agent for 14.25% secured convertible debentures (10)\n4.12\nForm of Series C 10% unsecured convertible debenture (20)\n4.13\nForm of Warrant for Series C 10% unsecured convertible debenture offering (35)\n4.14\nForm of Series D 8% unsecured convertible debenture (35)\n4.15\nForm of 10% convertible debenture (35)\n4.16\nForm of Warrant for Series D 8% unsecured convertible debenture (22)\n4.17\nArticles of Merger between Power2Ship, Inc. and Fittipaldi Logistics, Inc. (25)\n4.18\nForm of Term Sheet for Purchase of Outstanding Debentures (Version 2) (28)\n4.19\nForm of Term Sheet for Purchase of Outstanding Debentures (Version 1) (28)\n4.20\nForm of Non-Plan Stock Option Agreement for Employees (29)\n4.21\nForm of Non-Plan Stock Options Agreement for Executives (29)\n4.22\nArticles of Merger between Fittipaldi Logistics, Inc. and Visium Technologies, Inc. (31)\n4.23\n$10,000 principal amount 12% convertible promissory note (35)\n4.24\n$5,000 principal amount 12% convertible promissory note (35)\n4.25\n$25,000 principal amount 12% convertible promissory note (35)\n4.26\n$25,000 principal amount 12% convertible promissory note (35)\n4.27\n$20,000 principal amount 12% convertible promissory note (35)\n4.28\n$20,000 principal amount 12% convertible promissory note (35)\n4.29\n$5,000 principal amount 12% convertible promissory note (35)\n4.30\n$20,000 principal amount 12% convertible promissory note (35)\n4.31\n$25,000 principal amount 12% convertible promissory note (35)\n4.32\n$25,000 principal amount 18% convertible promissory note (35)\n4.33\n$12,000 principal amount 12% convertible promissory note (35)\n4.34\n$10,000 principal amount 12% convertible promissory note (35)\n4.35\n$20,000 principal amount 12% convertible promissory note (35)\n4.36\n$18,000 principal 12.5% promissory note for services (35)\n4.37\n$30,000 principal amount 12% convertible promissory note (35)\n4.38\n$15,000 principal amount 12% convertible promissory note (35)\n4.39\n$10,000 principal amount 12% convertible promissory note (35)\n4.40\n$25,000 principal amount 18% convertible promissory note (35)\n4.41\n$25,000 principal amount 18% convertible promissory note (35)\n4.42\n$15,000 principal amount 12% convertible promissory note (35)\n4.43\n$25,000 principal amount 12% convertible promissory note (35)\n4.44\n$10,000 principal amount 12% convertible promissory note (35)\n4.45\n$25,000 principal amount 12% convertible promissory note (35)\n4.46\n$10,000 principal amount 12% convertible promissory note (35)\n4.47\nForm of Promissory Note issued to FirstFire Global Opportunities Fund, LLC (37)\n4.48\nForm of Warrant issued to FirstFire Global Opportunities Fund, LLC (37)\n4.49\nForm of Promissory Note issued to Auctus Fund, LLC (38)\n4.50\nForm of Warrant issued to Auctus Fund, LLC (38)\n4.51\nForm of Unsecured Promissory Note (40)\n4.52\nForm of Unsecured Promissory Note (41)\n4.53\nForm of Unsecured Promissory Note (42)\n4.54\nForm of Warrant (42)\n10.1\nSecurities Purchase Agreement (6)\n10.2\nInvestor Registration Rights Agreement (6)\n10.3\n2001 Employee Stock Compensation Plan (3)\n10.4\nEmployment Agreement with Richard Hersh (8)\n10.5\nForm of Intellectual Property Assignment Agreement between Power2Ship, Inc. and each of Richard Hersh, Michael J. Darden and John Urbanowicz (10)\n10.6\nSecurity Agreements for 14.25% secured convertible debentures (10)\n10.7\nRegistration Rights Agreement for 14.25% secured convertible debentures (10)\n10.8\nAsset Purchase Agreement with GFC, Inc. (14)\n10.9\nMutual Agreement with Commodity Express Transportation, Inc. (15)\n10.10\nAsset Purchase Agreement with GFC, Inc. (16)\n10.11\nForm of Unsecured Promissory Note (13)\n10.12\nSeparation and Severance Agreement with Richard Hersh (23)\n10.13\nConsulting Agreement with Richard Hersh (23)\n10.14\nConsulting Agreement with David S. Brooks and S. Kevin Yates (as amended) (23)\n10.15\nSoftware Transaction Agreement Between Visium Technologies, Inc., Rentar Environmental Solutions, Inc. and the organizers of a new company to be formed (33)\n10.16\nCapital Contribution Agreement Between Rentar Logic, Inc., Rentar Environmental Solutions, Inc. and Visium Technologies, Inc. (33)\n10.17\nRentar Logic, Inc. Shareholders Agreement (33)\n10.18\nVoting Trust Agreement Between Rentar Logic, Inc., Rentar Environmental Solutions, Inc. and Visium Technologies, Inc. (33)\n10.19\nVisium/Rentar Agreement April 2010 (35)\n10.20\nEmployment Agreement with Kevin Yates (35)\n10.21\nConsulting Agreement with Will Williams (35)\n10.22\nConsulting Agreement with Mobile Software Team, LLC (35)\n10.23\nConsulting Agreement with C3i Sports, LLC (35)\n10.24\nExclusive License Agreement between George Mason Research Foundation, Inc. and Visium Technologies, Inc.(36)\n10.25\nSecurities Purchase Agreement by and between the Company and FirstFire Global Opportunities Fund, LLC (37)\n10.26\nSecurities Purchase Agreement by and between the Company and Auctus Fund, LLC (38)\n10.27\nAmendment to License Agreement between MITRE Corporation and Visium Analytics, LLC (39)\n10.28\nForm of Securities Purchase Agreement (40)\n10.29\nForm of Registration Rights Agreement (40)\n10.30\nForm of Securities Purchase Agreement (41)\n10.31\nForm of Registration Rights Agreement (41)\n10.32\nForm of Securities Purchase Agreement (42)\n10.33\nForm of Amendment #1 (42)\n14.1\nCode of Ethics (11)\n21.1\nSubsidiaries of Registrant (20)*\n31.1\nSection 302 Certificate of Chief Executive Officer.*\n31.2\nSection 302 Certificate of Principal Financial Officer.*\n32.1\nCertification of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002*\n32.2\nCertification of the Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002*\n101.\nThe following materials from the Companys Annual Report on Form 10-K for the year ended June 30, 2013, formatted in XBRL (eXtensible Business Reporting Language): (i) the Balance Sheets, (ii) the Statements of Operations, (iii) the Statements of Cash Flows, and (iv) related notes to these financial statements.**\n*\nFiled herewith.\n**\nFurnished herewith.\n(1)\nIncorporated by reference to Current Report on Form 8-K filed on March 26, 2003.\n(2)\nIncorporated by reference to registration statement on Form 10-SB, as amended.\n(3)\nIncorporated by reference to definitive Schedule 14C Information Statement filed on February 2, 2001.\n(4)\nIncorporated by reference to definitive Schedule 14C Information Statement filed on April 22, 2003.\n(5)\nIncorporated by reference to Annual Report on Form 10-K for the fiscal year ended December 31, 2002.\n(6)\nIncorporated by reference to Current Report on Form 8-K filed on July 8, 2004.\n(7)\nIncorporated by reference to Current Report on Form 8-K filed on January 3, 2002.\n(8)\nIncorporated by reference to Quarterly Report on Form 10-QSB for the period ended March 31, 2003.\n(9)\nIncorporated by reference to Preliminary Information Statement on Schedule 14C filed on July 8, 2004.\n(10)\nIncorporated by reference to registration statement on Form SB-2, SEC File No. 333-118792, filed on September 3, 2004.\n(11)\nIncorporated by reference to Amendment No. 1 to registration statement the Form SB-2, SEC File No. 333-118792, filed on October 20, 2004.\n(12)\nIncorporated by reference to Amendment No. 3 to the registration statement on Form SB-2, SEC File No. 333-118792, filed on December 15, 2004.\n(13)\nIncorporated by reference to Quarterly Report on Form 10-QSB for the period ended December 31, 2004 filed on February 14, 2005.\n(14)\nIncorporated by reference to Current Report on Form 8-K/A filed on February 25, 2005.\n(15)\nIncorporated by reference to Current Report on Form 8-K filed on March 25, 2005.\n(16)\nIncorporated by reference to Current Report on Form 8-K filed on March 28, 2005.\n(17)\nIncorporated by reference to Quarterly Report on Form 10-QSB for the period ended March 31, 2005.\n(18)\nIncorporated by reference to Current Report on Form 8-K filed on June 3, 2005.\n(19)\nIncorporated by reference to Current Report on Form 8-K filed on July 28, 2005.\n(20)\nReserved\n(21)\nIncorporated by reference to Current Report on Form 8-K filed on February 17, 2006.\n(22)\nIncorporated by reference to Amendment No. 1 to registration statement the Form SB-2, SEC File No. 333-131832 filed on May 5, 2006.\n(23)\nIncorporated by reference to Annual Report on Form 10-K for the fiscal year ended June 30, 2006 filed on October 13, 2006.\n(24)\nIncorporated by reference to Current Report on Form 8-K filed on October 17, 2006.\n(25)\nIncorporated by reference to Current Report on Form 8-K filed on October 24, 2006.\n(26)\nIncorporated by reference to Current Report on Form 8-K filed on January 26, 2007.\n(27)\nIncorporated by reference to Current Report on Form 8-K filed on April 30, 2007.\n(28)\nIncorporated by reference to Current Report on Form 8-K filed on July 25, 2007.\n(29)\nIncorporated by reference to Annual Report on Form 10-KSB filed on October 15, 2007.\n(30)\nIncorporated by reference to Current Report on Form 8-K filed on November 15, 2007.\n(31)\nIncorporated by reference to Current Report on Form 8-K filed on December 31, 2007.\n(32)\nIncorporated by reference to Current Report on Form 8-K filed on March 25, 2008.\n(33)\nIncorporated by reference to Current Report on Form 8-K filed on June 13, 2008.\n(34)\nIncorporated by reference to Current Report on Form 8-K filed on October 16, 2008.\n(35)\nIncorporated by reference to Registration Statement on Form 10-12G/A filed on June 14, 2013.\n(36)\nIncorporated by reference to Current Report on Form 8-K filed on July 27, 2019.\n(37)\nIncorporated by reference to Current Report on Form 8-K filed on January 10, 2019.\n(38)\nIncorporated by reference to Current Report on Form 8-K filed on January 16, 2019.\n(39)\nIncorporated by reference to Current Report on Form 8-K filed on May 13, 2020\n(40)\nIncorporated by reference to Current Report on Form 8-K filed on February 11, 2022\n(41)\nIncorporated by reference to Current Report on Form 8-K filed on March 4, 2022\n(42)\nIncorporated by reference to Current Report on Form 8-K filed on September 22, 2022\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nVISIUM TECHNOLOGIES, INC.\nBy:\n/s/ Mark Lucky\nMark Lucky\nChief Executive Officer\nDate: October 4, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSIGNATURE\nTITLE\nDATE\nBy:\n/s/ Mark Lucky\nChief Executive Officer and Chief Financial Officer\nOctober 4, 2022\n(principal accounting officer)\nReport of Independent Registered Public Accounting Firm 5036\nFinancial Statements:\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Changes in Stockholders Deficit\nConsolidated Statements of Cash Flows\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n-\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Visium Technologies, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Visium Technologies, Inc (the Company) as of June 30, 2022 and 2021, and the related statements of operations, stockholders deficit and cash flows for each of the years in the two year period ended June 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two year period ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph - Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has suffered recurring losses as of June 30, 2022. For the year ended June 30, 2022, the Company had a net loss of $5,193,515 and net cash used in operating activities of $2,224,572, and had negative working capital of $2,793,558. These factors raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of Derivatives\nDescription of the Matter\nThe Company has issued various debt and equity offerings in the past. Convertible notes have various terms, including a conversion feature and warrants. The Company accounts for derivative instruments in accordance with Accounting Standards Codification 815, Derivatives and Hedging (ASC 815), which establishes accounting and reporting standards for derivative instruments, including certain derivative instruments embedded in the conversion feature and its warrants.\nSignificant judgment is exercised by the Company in accounting and valuation of the financial instruments by using a Cox, Ross & Rubinstein Binomial Tree simulation to value them at inception and on any subsequent valuation dates.\nHow We Addressed the Matter in Our Audit\nThe primary procedures we performed to address this critical audit matter included evaluating all debt instruments, confirmation of significant balances, reviewing inputs used in the valuation of the derivative instruments, and performing a reasonableness test the accuracy of the Companys calculations.\nWe have served as the Companys auditor since 2017.\nMargate, Florida\nOctober 4, 2022\nVISIUM TECHNOLOGIES, INC.\nCONSOLIDATED BALANCE SHEETS\nJune 30,\nASSETS\nCurrent assets:\nCash\n$ 136,990\n$ 125,166\nPrepaid license fee\n-\n55,418\nTotal current assets\n136,990\n180,584\nTotal assets\n$ 136,990\n$ 180,584\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent liabilities:\nAccounts payable and accrued expenses\n$ 596,463\n$ 425,804\nAccrued compensation\n614,589\n672,529\nAccrued interest\n404,712\n366,149\nConvertible notes payable to ASC Recap LLC\n-\n147,965\nConvertible notes payable, net of discount of $412,944 and $396,033, respectively\n1,074,487\n809,195\nDerivative liability\n35,297\n184,381\nNotes payable, net of discount of $0 and $18,252, respectively\n205,000\n411,748\nTotal current liabilities\n2,930,548\n3,017,771\nCommitments and contingencies (Note 11)\nStockholders deficit:\nPreferred stock\nSeries A Convertible Stock ($0.001 par value; 20,000,000 shares authorized, 13,992,340 shares issued and outstanding as of June 30, 2022 and 2021, respectively)\n13,992\n13,992\nSeries B Convertible Stock ($0.001 par value 30,000,000 shares authorized, 1,327,640 shares issued and outstanding as of June 30, 2022 and 2021, respectively)\n1,328\n1,328\nSeries AA Convertible Stock ($0.001 par value; 1 share authorized, 1 share issued and outstanding as of June 30, 2022 and 2021)\nCommon stock, $0.0001 par value, 1,000,000,000 shares authorized: 2,903,804 shares issued and 2,896,385 outstanding at June 30, 2022, and 2,280,202 shares issued and 2,182,423 outstanding at June 30, 2021, respectively (See Note 7)\nAdditional paid in capital\n53,749,386\n48,512,312\nAccumulated deficit\n(56,558,552 )\n(51,365,037 )\nTotal stockholders deficit\n(2,793,558 )\n(2,837,187 )\nTotal liabilities and stockholders deficit\n$ 136,990\n$ 180,584\nSee accompanying notes to consolidated financial statements.\nVISIUM TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFOR THE YEAR ENDED\nJune 30, 2022\nJune 30, 2021\nRevenues\n$ -\n$ 25,000\nOperating expenses:\nSelling, general and administrative\n4,316,191\n3,879,158\nDevelopment expense\n361,298\n258,168\nTotal operating expenses\n4,677,489\n4,137,326\nLoss from operations\n(4,677,489 )\n(4,112,326 )\nOther income (expense)\nGain on change in fair value of derivative liabilities\n1,119\n1,844,460\nDerivative liability expense\n-\n(1,059,282 )\nInterest expense\n(705,075 )\n(442,171 )\nGain (loss) on debt settlement\n187,930\n28,863\nGain on debt write off\n-\n578,408\nWarrant exercise expense\n-\n(211,411 )\nTotal other income (expense)\n(516,026 )\n738,867\nNet loss\n$ (5,193,515 )\n$ (3,373,459 )\nWeighted average common shares\nBasic and diluted\n2,505,011\n1,467,777\nNet loss Per Common Share -Basic and Diluted:\n$ (2.07 )\n$ (2.30 )\nSee accompanying notes to consolidated financial statements.\nVISIUM TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\nPreferred\nPreferred\nPreferred\nStock -\nStock -\nStock -\nCommon\nSeries A\nSeries B\nSeries AA\nStock\n$0.001\n$0.001\n$0.001\n$0.0001\nAdditional\nTotal\nPar Value\nPar Value\nPar Value\nPar Value\nPaid-in\nAccumulated\nStockholders\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nDeficit\nBalance at June 30, 2020\n13,992,340\n$ 13,992\n1,327,670\n$ 1,328\n$ 0\n1,143,798\n$ 114\n$ 44,595,384\n$ (47,991,578 )\n$ (3,380,760 )\nShares issued as compensation to directors and officers\n162,963\n2,808,984\n2,809,000\nShares issued for consulting services\n41,975\n353,996\n354,000\nShares issued for conversion of notes payable\n388,550\n391,000\n391,039\nCommitment shares issued pursuant to financings\n166,667\n133,012\n133,029\nShares issued upon exercise of stock warrants\n278,470\n211,383\n211,411\nAmortization of deferred compensation\n18,553\n18,553\nNet loss for the year ended June 30, 2022\n(3,373,459 )\n(3,373,459 )\nBalance at June 30, 2021\n13,992,340\n$ 13,992\n1,327,670\n$ 1,328\n$ 0\n2,182,423\n$ 218\n$ 48,512,312\n$ (51,365,037 )\n$ (2,837,187 )\nShares issued as compensation to directors and officers\n100,758\n1,173,790\n1,173,800\nShares issued as compensation to employees\n54,955\n762,832\n762,837\nShares issued for consulting services\n53,334\n241,795\n241,800\nShares issued for conversion of notes payable\n146,701\n831,032\n831,047\nShares issued pursuant to sale of common stock\n222,222\n1,499,978\n1,500,000\nCommitment shares issued pursuant to convertible notes payable\n86,667\n236,558\n236,567\nBenefical conversion feature with convertible debt\n239,564\n239,564\nShares issued upon exercise of stock warrants\n4,881\n-\n-\nShares issued pursuant to settlement of litigation\n44,444\n107,996\n108,000\nAmortization of deferred compensation\n143,529\n143,529\nNet loss for the year ended June 30, 2022\n(5,193,515 )\n(5,193,515 )\nBalance at June 30, 2022\n13,992,340\n$ 13,992\n1,327,670\n$ 1,328\n$ 0\n2,896,385\n$ 288\n$ 53,749,386\n$ (56,558,552 )\n$ (2,793,558 )\nSee accompanying notes to consolidated financial statements.\nVISIUM TECHNOLOGIES, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFOR THE YEAR ENDED\nJune 30, 2022\nJune 30, 2021\nCash flows from operating activities:\nNet loss\n$ (5,193,515 )\n$ (3,373,459 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nAmortization of debt discounts\n571,081\n305,499\nStock based payments for consultants, directors, and officers\n2,178,437\n3,163,000\n(Gain) loss on debt settlement\n(187,930 )\n(607,271 )\nGain on change in fair value of derivative liabilities\n(1,119 )\n(1,844,460 )\nAmortization of deferred compensation\n143,529\n-\nAmortization of prepaid expense\n55,417\n-\nWarrant conversion expense\n-\n211,411\nDerivative liability expense\n-\n1,059,282\nChanges in operating assets and liabilities:\nAccounts payable and accrued expenses\n169,538\n445,850\nAccrued compensation\n(57,940 )\n20,000\nAccrued interest\n97,926\n96,007\nPrepaid license fee\n-\n(55,417\nDiscount on notes payable\n-\n(213,082 )\nNet cash used in operating activities\n(2,224,572 )\n(792,640 )\nCash flows from financing activities:\nAdvance from officers\n-\n(102,340\nProceeds from convertible notes payable\n1,076,400\n838,595\nProceeds from short term notes payable\n-\n225,000\nProceeds from sale of common stock\n1,500,000\n-\nRepayment of short term notes payable\n(225,000 )\n-\nRepayment of convertible notes payable\n(115,000 )\n(73,700 )\nNet cash provided by financing activities\n2,236,400\n887,555\nNet increase in cash\n11,824\n94,915\nCash at beginning of year\n125,166\n30,251\nCash at end of year\n$ 136,990\n$ 125,166\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid for:\nInterest\n$ 30,231\n$ 39,755\nIncome taxes\n$ -\n$ -\nIssuance of common stock for conversion of notes payable and accrued interest\n$ 831,047\n$ 188,460\nCommitment shares issued pursuant to convertible notes payable\n236,567\n-\nShares issued pursuant to settlement of litigation\n108,000\n-\nBeneficial conversion feature with convertible debt\n$ 239,564\n-\nSee accompanying notes to consolidated financial statements.\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 1: ORGANIZATION, DESCRIPTION OF BUSINESS AND GOING CONCERN\nVisium Technologies, Inc., or the Company, is a Florida corporation that was originally incorporated in Nevada in October 1987. It was formerly known as Jaguar Investments, Inc. between October 1987 and May 2003, Power2Ship, Inc. between May 2003 and November 2006, Fittipaldi Logistics, Inc. between November 2006 and December 2007, and as NuState Energy Holdings, Inc. between December 2007 and March 5, 2018 when it changed its name to Visium Technologies, Inc.\nVisium is a provider of cyber security visualization, big data analytics and automation that operates in the traditional cyber security space, as well as in the cloud-based technology and Internet of Things spaces. In March 2019, Visium entered into a software license agreement with MITRE Corporation to license a patented technology known as CyGraph, a tool for cyber warfare analytics, visualization and knowledge management. CyGraph is a military-grade, highly scalable big data analytics tool for cyber security, based on graph database technology. The development of the technology was sponsored by the US Army and is currently in use by the U.S. Army Cyber Command. CyGraph provides advanced analytics for cybersecurity situational awareness that is scalable, flexible and comprehensive. Visium has completed significant proprietary product development efforts to commercialize CyGraph which the Company has rebranded as TruContextTM. The commercialization efforts included adding functionality to the core technology to make it a native cloud application, adding multi-user and multi-tenant capability, enhancing the graphical user interface, (GUI) to make the application more intuitive to use, and adding enhanced dashboard and reporting capabilities. TruContext would typically be deployed by an enterprise and be used by the cyber analyst to intuitively understand the massive amount of data flowing through the network environment, giving him actionable information in real-time to ensure that the network is protected from threats. The analyst will understand the relationships of the assets in the data center, the communication patterns, and cybersecurity exposures, in real-time.\nIn April 2021 the Company created JAJ Advisory, LLC, a Viriginia limited liability company. The LLC was established to account for non-cybersecurity related business activities that the Company may pursue. As of June 30, 2022 there has been no activity in this subsidiary.\nOn June 20, 2022 a majority of the common shareholders approved certain corporate actions, and the Company filed an amendment to its Articles of Incorporation with the State Department of Corporations in the State of Florida to effect the following changes, effective September 22, 2022:\n(i)\nreverse the Common stock by a ratio of one thousand six hundred for one (1,350:1). The board of directors was authorized to implement the reverse stock split.\n(ii)\nReduce the number of shares of Common Stock that the company is authorized to issue to one billion (1,000,000,000) from ten billion (10,000,000,000).\nThe principal effects of the Reverse Split include the following:\n●\nthe number of outstanding shares of the Companys common stock and treasury stock is decrease based on the Reverse Split ratio of 1,350:1;\n●\nthe number of shares of the Companys common stock held by individual stockholders will decrease based on the Reverse Split ratio selected by the Board, and the number of stockholders who own odd lots of less than 100 shares of our common stock will increase;\n●\nthe number of shares common stock reserved for issuance under our stock incentive plans are reduced proportionally based on the Reverse Split ratio of 1,350:1 (along with any other appropriate adjustments or modifications); and\n●\nthe exercise price of our outstanding stock options and warrants and the conversion price of our outstanding convertible securities, including preferred stock, and the number of shares reserved for issuance upon exercise or conversion thereof are adjusted in accordance with their terms based on the Reverse Split ratio of 1,350:1.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared on a going concern basis. For the year ended June 30, 2022 we had a net loss of $5,193,515, had net cash used in operating activities of $2,224,572 and had negative working capital of $2,793,558. These matters raise substantial doubt about the Companys ability to continue as a going concern for a period of one year from the date of this filing. The Companys ability to continue as a going concern is dependent upon its ability to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due, to fund possible future acquisitions, and to generate profitable operations in the future. Management plans to provide for the Companys capital requirements by continuing to issue additional equity and debt securities. The outcome of these matters cannot be predicted at this time and there are no assurances that, if achieved, the Company will have sufficient funds to execute its business plan or generate positive operating results. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nNOTE 2: SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reporting amounts of revenues and expenses during the reported period. Actual results will differ from those estimates. Included in these estimates are assumptions used in Cox, Ross & Rubinstein Binomial Tree stock-based compensation and derivative liabilities valuation methods, such as expected volatility, risk-free interest rate, and expected dividend rate and in the valuation allowance of deferred tax assets.\nCash and Cash Equivalents\nThe Company considers all highly liquid, temporary, cash equivalents or investments with an original maturity of three months or less when purchased, to be cash equivalents. The Company had no cash equivalents during the years ended June 30, 2022 and 2021.\nConcentration of Credit Risks\nThe Company is subject to a concentration of credit risk from cash.\nThe Companys cash account is held at a financial institution and is insured by the Federal Deposit Insurance Corporation, or FDIC, up to $250,000.\nDerivative Liabilities\nThe Company assessed the classification of its derivative financial instruments as of June 30, 2022 and 2021, which consist of convertible instruments and rights to shares of the Companys common stock and determined that such derivatives meet the criteria for liability classification under ASC 815.\nASC 815 generally provides three criteria that, if met, require companies to bifurcate conversion options from their host instruments and account for them as free standing derivative financial instruments. These three criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument subject to the requirements of ASC 815. ASC 815 also provides an exception to this rule when the host instrument is deemed to be conventional, as described.\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 2: SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES, continued\nThe Company uses judgment in determining the fair value of derivative liabilities at the date of issuance and at every balance sheet thereafter and in determining which valuation method is most appropriate for the instrument, the expected volatility, the implied risk-free interest rate, as well as the expected dividend rate, if any. The Company recorded a derivative liability as of June 30, 2022 of $35,297.\nFair Value of Financial Instruments\nThe Company accounts for assets and liabilities measured at fair value on a recurring basis, in accordance with ASC Topic 820, Fair Value Measurements and Disclosures, or ASC 820. ASC 820 establishes a common definition for fair value to be applied to existing generally accepted accounting principles that require the use of fair value measurements, establishes a framework for measuring fair value, and expands disclosure about such fair value measurements.\nASC 820 defines fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Additionally, ASC 820 requires the use of valuation techniques that maximize the use of observable inputs and minimize the use of unobservable inputs. These inputs are prioritized below:\nLevel 1:\nObservable inputs such as quoted market prices in active markets for identical assets or liabilities.\nLevel 2:\nObservable market-based inputs or unobservable inputs that are corroborated by market data.\nLevel 3:\nUnobservable inputs for which there is little or no market data, which require the use of the reporting entitys own assumptions.\nThe following is the Level 3 activity for the Companys derivatives:\nDerivative liability at June 30, 2020\n$ 438,663\nIncrease due to issuance of convertible note\n1,059,282\nDerivative liability adjsutments as a result of note discounts\n530,896\nGain on change in fair value of derivative liability\n(1,844,460)\nDerivative liability at June 30, 2021\n$ 184,381\nDerivative liability reduced as a result of debt settlement\n(147,965)\nGain on change in fair value of derivative liability\n(1,119)\nDerivative liability at June 30, 2022\n$ 35,297\nAdditional Disclosures Regarding Fair Value Measurements\nThe carrying value of cash, accounts payable and accrued expenses, accrued compensation, notes payable, convertible promissory notes payable, approximate their fair value due to the short maturity of these items or the use of market interest rates. At June 30, 2022 and 2021, the fair value of derivative liabilities is estimated using the Cox, Ross & Rubinstein Binomial Tree valuation model using inputs that include the expected volatility, the implied risk-free interest rate, as well as the expected dividend rate. The derivative liabilities are the only Level 3 fair value measures.\nConvertible Instruments\nThe Company accounts for convertible instruments (when it has determined that the embedded conversion options should not be bifurcated from their host instruments) in accordance with ASC 470-20, Debt with Conversion and Other Options. Accordingly, the Company records, when necessary, discounts to convertible notes for the intrinsic value of conversion options embedded in debt instruments based upon the differences between the fair value of the underlying common stock at the commitment date of the note transaction and the effective conversion price embedded in the note. Debt discounts under these arrangements are amortized over the term of the related debt to their earliest date of redemption. The Company also records deemed dividends for the intrinsic value of conversion options embedded in preferred shares based upon the differences between the fair value of the underlying common stock at the commitment date of the note transaction and the effective conversion price embedded in the note.\nASC 815-40, Contracts in Entitys own Equity, generally provides that, among other things, if an event is not within the entitys control, such contract could require net cash settlement and shall be classified as an asset or a liability.\nThe Company determines whether the instruments issued in the transactions are considered indexed to the Companys own stock. During fiscal years 2014 through 2020 the Companys issued convertible securities with variable conversion provisions that resulted in derivative liabilities. See discussion above under derivative liabilities that resulted in a change in derivative liability accounting.\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 2: SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES, continued\nRevenue Recognition\nAll revenues are recorded in accordance with ASC 606, which is recognized when: (i) a contract with a client has been identified, (ii) the performance obligation(s) in the contract have been identified, (iii) the transaction price has been determined, (iv) the transaction price has been allocated to each performance obligation in the contract, and (v) the Company has satisfied the applicable performance obligation over time.\nIncome Taxes\nThe Company accounts for income taxes pursuant to the provisions of ASC 740-10, Accounting for Income Taxes, which requires, among other things, an asset and liability approach to calculating deferred income taxes. The asset and liability approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax bases of assets and liabilities. A valuation allowance is provided to offset any net deferred tax assets for which management believes it is more likely than not that the net deferred asset will not be realized.\nThe Company follows the provisions of ASC 740-10, Accounting for Uncertain Income Tax Positions. When tax returns are filed, it is highly certain that some positions taken would be sustained upon examination by the taxing authorities, while others are subject to uncertainty about the merits of the position taken or the amount of the position that would be ultimately sustained. In accordance with the guidance of ASC 740-10, the benefit of a tax position is recognized in the financial statements in the period during which, based on all available evidence, management believes it is more likely than not that the position will be sustained upon examination, including the resolution of appeals or litigation processes, if any. Tax positions taken are not offset or aggregated with other positions. Tax positions that meet the more-likely-than-not recognition threshold are measured as the largest amount of tax benefit that is more than 50 percent likely of being realized upon settlement with the applicable taxing authority. The portion of the benefits associated with tax positions taken that exceeds the amount measured as described above should be reflected as a liability for uncertain tax benefits in the accompanying balance sheet along with any associated interest and penalties that would be payable to the taxing authorities upon examination. The Company believes its tax positions are all highly certain of being upheld upon examination. As such, the Company has not recorded a liability for uncertain tax benefits.\nThe Company has adopted ASC 740-10-25, Definition of Settlement, which provides guidance on how an entity should determine whether a tax position is effectively settled for the purpose of recognizing previously unrecognized tax benefits and provides that a tax position can be effectively settled upon the completion of an examination by a taxing authority without being legally extinguished. For tax positions considered effectively settled, an entity would recognize the full amount of tax benefit, even if the tax position is not considered more likely than not to be sustained based solely on the basis of its technical merits and the statute of limitations remains open. As of June 30, 2022, the Company had not filed tax returns for the tax years ending June 30, 2008 through 2021 and such returns, when filed, potentially will be subject to audit by the taxing authorities for a minimum of three years beyond the filing date under the three-year statute of limitations. The Company has not accrued any potential tax penalties associated with not filing these tax returns. Due to recurring losses, management believes such potential tax penalties, if any, would not be material in amount.\nShare-Based Payments\nThe Company accounts for stock-based compensation in accordance with ASU 2020-07, Compensation - Stock Compensation (Topic 718). This update is intended to reduce cost and complexity and to improve financial reporting for share-based payments issued to non-employees (for example, service providers, external legal counsel, suppliers, etc.). The ASU expands the scope of Topic 718, Compensation-Stock Compensation, which currently only includes share-based payments issued to employees, to also include share-based payments issued to non-employees for goods and services. Consequently, the accounting for share-based payments to non-employees and employees is substantially aligned.\nUnder ASC Topic 718, Compensation - Stock Compensation. Under the fair value recognition provisions of this topic, stock-based compensation cost is measured at the grant date based on the fair value of the award and is recognized as an expense on a straight-line basis over the requisite service period, which is the vesting period.\nThe Company has elected to use the Cox, Ross & Rubinstein Binomial Tree valuation model to estimate the fair value of its options, which incorporates various subjective assumptions including volatility, risk-free interest rate, expected life, and dividend yield to calculate the fair value of stock option awards. Compensation expense recognized in the statements of operations is based on awards ultimately expected to vest and reflects estimated forfeitures. ASC 718 requires forfeitures to be estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates.\nSegment Reporting\nThe Company operates in one business segment which technologies are focused on cybersecurity.\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 2: SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES, continued\nRecent Accounting Pronouncements\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40) - Accounting for Convertible Instruments and Contracts in an Entitys Own Equity. The ASU simplifies accounting for convertible instruments by removing major separation models required under current GAAP. Consequently, more convertible debt instruments will be reported as a single liability instrument with no separate accounting for embedded conversion features. The ASU removes certain settlement conditions that are required for equity contracts to qualify for the derivative scope exception, which will permit more equity contracts to qualify for the exceptions.\nThe ASU also simplifies the diluted net income per share calculation in certain areas. The new guidance is effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years, and early adoption is permitted. The Company is currently evaluating the impact of the adoption of the standard on the financial statements.\nIn May 2021, the FASB issued ASU 2021-04, Earnings Per Share (Topic 260), Debt-Modifications and Extinguishments (Subtopic 470-50), Compensation-Stock Compensation (Topic 718), and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40). The new ASU addresses issuers accounting for certain modifications or exchanges of freestanding equity-classified written call options. This amendment is effective for all entities, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. The Company adopted ASU 2021-04 on January 1, 2022. There is no impact of the adoption of the standard on the financial statements.\nAll other newly issued accounting pronouncements but not yet effective have been deemed immaterial or nonapplicable.\nBasic and Diluted Earnings Per Share\nBasic earnings per share are calculated by dividing income available to stockholders by the weighted-average number of shares of Common Stock outstanding during each period. Diluted earnings per share are computed using the weighted average number of shares of Common Stock and the dilutive Common Stock share equivalents outstanding during the period. Dilutive Common Stock share equivalents consist of shares issuable upon the exercise of in-the-money stock options and warrants (calculated using the modified-treasury stock method) and conversion of other securities such as convertible debt or convertible preferred stock. Potential common shares includable in the computation of fully diluted per-share results are not presented in the financial statements for the year ended June 30, 2022 and 2021 as their effect would be anti-dilutive. Potential common shares that would be as follows:\nFor the Years ended June 30,\nWeighted average common shares outstanding\n2,505,011\n1,464,777\nEffect of dilutive securities-when applicable:\nConvertible promissory notes\n482,472\n105,244\nPreferred Stock converted to common stock\n11,348\n11,348\nCommon stock options\n2,222\n11,852\nWarrants\n5,049\n9,011\nFully diluted earnings per share-adjusted weighted-average shares and assumed conversions\n3,006,102\n1,602,232\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 3: PREPAID LICENSE FEE\nIn April 2021, the Company entered into a two-year software license agreement to enable product development. The license fee is prepaid annually at a rate of $70,000 annually. The prepaid license fee is amortized on a straight-line basis over the term of the license agreement, and is included in Development expense in our Statement of Operations. The license fee term starts on July1 each year.\nNOTE 4: DERIVATIVE LIABILITY\nDerivative liability - warrants\nThe Company issued warrants in connection with convertible notes payable which were issued in January, February, and July 2021. These warrants have price protection provisions that allow for the reduction in the exercise price of the warrants in the event the Company subsequently issues stock or securities convertible into stock at a price lower than the stated conversion for each warrant, ranging from $0.0055 to $0.02 per share exercise price of the warrants. Simultaneously with any reduction to the exercise price, the number of shares of common stock that may be purchased upon exercise of each of these warrants shall be increased or decreased proportionately, so that after such adjustment the aggregate exercise price payable for the adjusted number of warrants shall be the same as the aggregate exercise price in effect immediately prior to such adjustment. Because it is indeterminate whether there is a sufficient number of authorized and unissued shares exists at the assessment date, the Company calculates a derivative liability associated with the warrants in accordance with FASB ASC Topic 815-40-25.\nAccounting for Derivative Warrant Liability\nThe Companys derivative warrant instruments have been measured at fair value at June 30, 2022 using the Cox, Ross & Rubinstein Binomial Tree valuation model. The Company recognizes the derivative liability related to those warrants that contain price protection features in its consolidated balance sheet as liabilities. The liability is revalued at each reporting period and changes in fair value are recognized currently in the consolidated statements of operations. The initial recognition and subsequent changes in fair value of the derivative warrant liability have no effect on the Companys cash flows.\nDerivative liability - convertible notes\nThe Company has certain convertible notes with variable price conversion terms. Upon the issuance of these convertible notes and as a consequence of their conversion features, the convertible notes give rise to derivative liabilities. The Companys derivative liabilities related to its convertible notes payable have been measured at fair value at June 30, 2022 and June 30, 2021 using the Cox, Ross & Rubinstein Binomial Tree valuation model.\nThe revaluation of the warrants and convertible debt at each reporting period, as well as the charges associated with issuing additional convertible notes, and warrants with price protection features, resulted in the recognition of a gain of $1,119 and $1,844,460 for the years ended June 30, 2022 and 2021, respectively in the Companys consolidated statements of operations, under the caption Gain in change of fair value of derivative liability. The fair value of the warrants at June 30 2022 and June 30, 2021 was $3,947 and $69,334, respectively. The fair value of the derivative liability related to the convertible debt at June 30, 2022 and June 30, 2021 is $31,350 and $115,047, respectively, which is reported on the consolidated balance sheet under the caption Derivative liability.\nThe Company has determined its derivative liability to be a Level 3 fair value measurement. The significant assumptions used in the Cox, Ross & Rubinstein Binomial Tree valuation of the derivative are as follows:\nYear Ended June 30,\nEffective exercise price\n$ 0.972 - $27.00\n$ 4.87 - $10.39\nEffective market price\n$ 1.755\n$ 8.10\nExpected volatility\n113% to 248\n%\n96.4% to 304.0\n%\nRisk-free interest\n1.68%-2.92\n%\n0.05%-0.25\n%\nExpected terms\n60 - 824 days\n60 - 711 days\nExpected dividend rate\n%\n0 %\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 5: CONVERTIBLE NOTES PAYABLE AND NOTE PAYABLE\nConvertible Notes Payable\nAt June 30, 2022 and June 30, 2021 convertible debentures consisted of the following:\nJune 30,\nConvertible notes payable\n$ 1,487,431\n$ 1,205,228\nDiscount on convertible notes\n(412,944 )\n(396,033 )\nConvertible notes, net\n1,074,487\n809,195\nConvertible notes payable to ASC Recap\n-\n147,965\nTotal\n$ 1,074,487\n$ 957,160\nThe Company had convertible promissory notes aggregating $1,487,431 and $1,205,228 at June 30, 2022 and June 30, 2021, respectively. The related accrued interest amounted to approximately $261,300 and $149,800 at June 30, 2022 and June 30, 2021, respectively. The convertible notes payable bear interest at rates ranging from 0% to 18% per annum. The convertible notes are generally convertible, at the holders option, at rates ranging from $2.43 to $22,500 per share, as a result of the two reverse stock splits. At June 30, 2022, approximately $324,000 of convertible promissory notes had matured, are in default and remain unpaid. There are no punitive default provisions included in the terms of these convertible promissory notes.\nOn July 22, 2013 and May 6, 2014, the Company issued to ASC Recap LLC (ASC) two convertible promissory notes with principal amounts of $25,000 and $125,000, respectively. These two notes were issued as a fee for services under a 3(a)10 transaction. While the Company continues to carry the balance of these notes on its balance sheet, management is disputing the notes and does not believe that the balances of these notes are owed. See Note 11 - Commitments and Contingencies in the footnotes to the financial statements. The July 22, 2013 note matured on March 31, 2014 and a balance of $22,965 remains unpaid. The May 6, 2014 note matured on May 6, 2016 and remains unpaid. The notes are convertible into the common stock of the Company at any time at a conversion price equal to (i) 50% of the lowest closing bid price of our common stock for the twenty days prior to conversion or (ii) fixed price of $0.15 or $0.30 per share.\nOn May 9, 2022 the company entered into a global settlement agreement to satisfy any and all claims with i) Tarpon Bay Partners LLC, (ii) J.P. Carey Enterprises Inc., and (iii) Anvil Financial Management LLC to resolve all litigation amongst the parties. The terms of the agreement included J.P. Carey Enterprises Inc. and Anvil Financial Management LLC receiving 44,444 shares of the Company's $0.0001 par value common stock, valued at $108,000, or $2.43 per share. The agreement also calls for the retirement of the notes payable to Tarpon Bay Partners LLC (ASC Recap) in the amount of $147,965. The settlement of this litigation resulted in a gain of $39,965.\nIn June 2021, the Company obtained a legal opinion to extinguish aged debt totaling $787,272 as detailed in the following table. Each of the individual debt instruments were determined to be beyond the statute of limitations and it was determined that the Company has a complete defense to liability related to this debt under the applicable statute of limitations.\nAccrued interest expense\n$ 385,803\nConvertible notes payable\n401,469\n$ 787,272\nFor the year ended June 30, 2022, the following summarizes the conversion of debt for common shares:\nAmount of\nAmount of\nConversion\nShares\nConverted\nConverted\nConversion\nPrice\nName\nIssued\nPrincipal\nInterest\nExpense\nTotal\nPer Share\nLabrys Funds\n146,701\n$ 772,797\n$ 56,000\n$ 2,250\n$ 831,047\n$ 5.66\nTotal\n146,701\n$ 772,797\n$ 56,000\n$ 2,250\n$ 831,047\n$ 5.66\nTransactions\nConvertible Notes Payable\nIn February 2022, the Company entered into three Securities Purchase Agreements with three investors pursuant to which each investor purchased a promissory note, each with a face value of $270,000, made by the Company in favor of the Investors in the total combined principal amount of $810,000 for a combined purchase price of $745,200. These Notes bear an aggregate original issue discount of $64,800, each bear interest of 8% per year and mature in February 2023. The Notes are convertible into shares of the Companys common stock at a conversion price of $2.43 per share, subject to adjustment as provided therein. The Company has the right to prepay each Note in full, including accrued but unpaid interest, without prepayment penalty provided an event of default, as defined therein, has not occurred. In the seven (7) trading days prior to any prepayment the Investors shall have the right to convert their Notes into Common Stock of the Company in accordance with the terms of such Note. The Notes contain events of defaults and certain negatives covenants that are typical in the types of transactions contemplated by the Purchase Agreements. Pursuant to the Purchase Agreements, the Company issued to the Investors an aggregate 60,000 commitment shares of the Companys common stock (the Commitment Shares) as a condition to closing. The commitment shares were valued at $291,600, or $4.86 per share and recorded as a discount.\nIn April 2022, the Company entered into a Securities Purchase Agreement with an investor pursuant to which the investor purchased a promissory note with a face value of $360,000, made by the Company for a purchase price of $331,200. The Note bears an original issue discount of $28,800, bears interest of 8% per year and mature in April 2023. The Note is convertible into shares of the Companys common stock at a conversion price of $2.43 per share, subject to adjustment as provided therein. The Company has the right to prepay each Note in full, including accrued but unpaid interest, without prepayment penalty provided an event of default, as defined therein, has not occurred. In the seven (7) trading days prior to any prepayment the Investor shall have the right to convert their Notes into Common Stock of the Company in accordance with the terms of such Note. The Note contains events of defaults and certain negatives covenants that are typical in the types of transactions contemplated by the Purchase Agreement. Pursuant to the Purchase Agreement, the Company issued to the Investor 26,667 commitment shares of the Companys common stock (the Commitment Shares) as a condition to closing. The commitment shares were valued at $54,915, or $2.06 per share and recorded as a discount.\nDuring the year ended Jun 30, 2022, the total shares issued with these convertible notes payable was 86,667 with a total relative fair value $236,567 and also a beneficial conversion feature of $239,564\nThe Company recognized interest expense on convertible notes payable of approximately $111,530 and $108,000 during the fiscal years 2022 and 2021, respectively.\nNotes Payable\nThe Company had promissory notes aggregating $205,000 and $411,748 at June 30, 2022 and 2021, respectively. The related accrued interest amounted to approximately $226,343 and $204,912 at June 30, 2022 and June 30, 2021, respectively. The notes payable bear interest at rates ranging from 0% to 16% per annum and are payable monthly. Promissory notes totaling $205,000 that are outstanding as of June 30, 2022 have matured, are in default, and remain unpaid. There is no provision in the note agreements for adjustments to the interest rates on these notes in the event of default.\nThe Company recognized interest expense on promissory notes payable of approximately $21,430 and $28,400 during the fiscal years 2022 and 2021, respectively.\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 6: ACCRUED INTEREST PAYABLE\nChanges in accrued interest payable during the year ended June 30, 2022, is as follows:\nAccrued interest payable at June 30, 2021\n$ 366,149\nInterest expense on notes payable for the year ended June, 2021\n133,994\nPayments of accrued interest\n(39,431 )\nConversion of accrued interest into common stock\n(56,000 )\nAccrued interest payable at June 30, 2022\n$ 404,712\nInterest expense for year ended June 30, 2022 was comprised of the following:\nInterest expense for the year ended June 30, 2022\n$ 133,994\nAmortization of debt discount\n571,081\nTotal interest expense for the year ended June 30, 2022\n$ 705,075\nNOTE 7: STOCKHOLDERS DEFICIT\nCommon Stock\nAt June 30, 2022, the Company had 1,000,000,000 authorized common shares. At June 30, 2022, the Company has 2,903,804 common shares issued of which 2,896,396 were outstanding, which is net of 7,408 unvested shares issued for the restricted stock awards granted during the year.\nThe Company effected a reverse split of our Common stock by a ratio of one thousand three hundred fifty for one (1,350:1). The board of directors was authorized to implement the reverse stock split effective September 22, 2022. The reverse stock split adjusted the then outstanding Common shares of the company from 3,916,144,800 Common Shares to a total of 2,896,396 Common Shares. This action also reduced the number of Authorized common shares of the Company from 10,000,000,000 to 1,000,000,000.\nIssuances of Common Stock During 2022\nDuring the year ended June 30 2022, the Company issued 146,701 shares of its common stock related to the conversion of $828,797 of principal and accrued interest of its convertible notes payable, at an average contract conversion price of $5.66 per share. The fair value of the shares issued was $2,422,722.\nStock Based Compensation and Stock Based Consulting Services Expense\nDuring the year ended June 30, 2022 the Company issued 53,334 shares of its $0.0001 par value common stock to three consultants, as compensation for services rendered. The shares were valued at $255,033, or $4.78 per share.\nDuring the year ended June 30 2022, the Company issued 54,955 shares of its $0.0001 par value common stock to six employees, as compensation for services rendered. The shares were valued at $763,041, or $13.89 per share.\nDuring the year ended June 30 2022, the Company issued 100,758 shares of its $0.0001 par value common stock to our Directors and Officer, as compensation for services rendered. The shares were valued at $1,134,118, or $11.26 per share.\nWarrants\nDuring the fiscal year ended June 30 2022, the Company issued 4,881 shares of its $0.0001 par value common stock pursuant to the cashless exercise of warrants. The warrant shares were valued at $211,411, or $43.32 per share.\nFunding\nIn September 2021 the Company entered into two securities purchase agreement (the Purchase Agreements) with a single institutional investor (the Purchaser) resulting in the raise of $1,500,000 in gross proceeds to the Company. Pursuant to the terms of the Purchase Agreements, the Company agreed to sell, in a registered director offering, an aggregate of 222,222 shares (the Shares) of the Companys common stock, par value $0.0001 per share (the Common Stock) at a purchase price of $6.75 per Share (the Offering). The Offerings closed on September 15, 2021 and September 27, 2021, respectively.\nDuring the fiscal year ended June 30, 2022 the Company issued 86,667 shares of its $0.0001 par value common stock to three investors as commitment shares pursuant to the issuance of promissory notes. The shares were valued at $236,567,\nLitigation Settlement\nDuring the fiscal year ended June 30, 2022 we issued 44,444 shares of its common stock pursuant to the settlement of litigation with ASC Recap. The shares were valued at $108,000, and resulted in a gain of $39,965.\nIssuances of Common Stock During the Year ended June 30, 2021\nConvertible Notes Payable\nDuring the fiscal year ended June 30 2021, the Company issued 388,550 shares of its common stock related to the conversion of $188,460 of principal and accrued interest of its convertible notes payable, at an average contract conversion price of $0.50 per share. The fair value of these conversions was $2,031,402.\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nStock Based Compensation\nDuring the fiscal year ended June 30 2021, the Company issued 162,963 shares of its $0.0001 par value common stock as compensation to its directors and officers related to the vesting of restricted stock grants. The shares were valued at $2,809,000, or $17.28 per share, based on the share price at the time of the transactions.\nDuring the fiscal year ended June 30 2021, we issued 41,975 shares of its common stock to consultants, as compensation. The shares were valued at $8.44, the market price on the date of issuance for a total value of $354,000. The expense is included in general and administrative expenses and was recognized on the date the stock was issued or vested.\nCommon Stock Warrants\nA summary of the status of the Companys outstanding common stock warrants as of June 30, 2022 and 2021 and changes during the fiscal years ending on these dates is as follows:\nYear ended June 30, 2022\nYear ended June 30, 2021\nNumber of\nWeighted Average\nNumber of\nWeighted Average\nWarrants\nExercise Price\nWarrants\nExercise Price\nCommon Stock Warrants\nBalance at beginning of year\n9,012\n$ 14.85\n$ 202.50\nGranted\n2,781\n$ 14.85\n34,695\n$ 14.85\nGranted due to repricing\n-\n-\n257,601\n0.27\nExercised\n0.27\n0.27\nForfeited\n0.27\n0.27\nBalance at end of period\n5,049\n$ 14.85\n9,012\n$ 14.85\nWarrants exercisable at end of period\n5,049\n$ 14.85\n9,012\n$ 14.85\nThe following table summarizes information about common stock warrants outstanding at June 30, 2022:\nWarrants Outstanding\nWarrants Exercisable\nRange of\nExercise Price\nNumber\nOutstanding\nAt June 30,\nWeighted\nAverage\nRemaining\nContractual Life\nWeighted\nAverage\nExercise\nPrice\nNumber\nExercisable\nAt June 30,\nWeighted\nAverage\nExercise\nPrice\n$ 7.425\n1,212\n0.54 Years\n$ 7.425\n1,212\n$ 7.425\n$ 10.395\n1.03 Years\n$ 10.395\n10.395\n$ 12.285\n1,339\n2.26 Years\n$ 12.285\n1,339\n12.285\n$ 20.385\n2.26 Years\n$ 20.385\n20.385\n5,049\n1.78 Years\n$ 14.85\n5,049\n$ 14.85\nPreferred Stock\nSeries A, B, and AA issued and outstanding shares of the Companys convertible preferred stock have a par value of $0.001. All classes rank(ed) prior to any class or series of the Companys common stock as to the distribution of assets upon liquidation, dissolution or winding up of the Company or as to the payment of dividends. All preferred stock shall have no voting rights except if the subject of such vote would reduce the amount payable to the holders of preferred stock upon liquidation or dissolution of the company and cancel and modify the conversion rights of the holders of preferred stock as defined in the certificate of designations of the respective series of preferred stock.\nSeries A Convertible Preferred Stock\nThe Series A Preferred Stock has a stated value of $750 per share. Each one share of Series A Preferred Stock is convertible into one (1) share of Common Stock. In the event the Common Stock price per share is lower than $0.10 (ten cents) per share then the Conversion shall be set at $0.035 per share. The Common Stock shares are governed by Lock-Up/Leak-Out Agreements.\nSeries B Convertible Preferred Stock\nThirty million (30,000,000) shares of preferred stock were designated as a new Series B Preferred stock in April 2016. This new Series B Preferred Stock has a $0.001 par value, and each 300 shares is convertible into one share of the Companys common stock, with a stated value of $375 per share.\nSeries AA Convertible Preferred Stock\nIn March 2019, the Company authorized and issued one (1) share of Series AA convertible preferred stock which provides for the holder to vote on all matters as a class with the holders of Common Stock and each share of Series AA Convertible Preferred Stock shall be entitled to 51% of the common votes on any matters requiring a shareholder vote of the Company. Each one share of Series AA Convertible Preferred Stock is convertible into one (1) share of Common Stock. Mark Lucky, our Chief Executive Officer, is the holder of the one (1) share of Series AA Convertible Preferred Stock.\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 8 - STOCK-BASED COMPENSATION\nThe Company adopted an Incentive Stock Plan on April 18, 2021. This plan is intended to provide incentives which will attract and retain highly competent persons at all levels as employees of the Company, as well as independent contractors providing consulting or advisory services to the Company, by providing them opportunities to acquire the Companys common stock or to receive monetary payments based on the value of such shares pursuant to Awards issued. While the plan terminates 10 years after the adoption date, issued options have their own schedule of termination. Options to acquire shares of common stock may be granted at no less than fair market value on the date of grant. Upon exercise, shares of new common stock are issued by the Company.\nUnder the 2021 Stock Incentive Plan, the Company has issued options to purchase 11,852 shares at an average price of $0.015 with a fair value of $0.00. For the years ended June 30, 2022 and 2021, the Company issued options to purchase no shares. Upon exercise, shares of new common stock are issued by the Company.\nFor the years ended June 30, 2022 and 2021, the Company recognized an expense of approximately $143,529 and $18,554, respectively, of non-cash compensation expense (included in General and Administrative expense in the accompanying Consolidated Statement of Operations) determined by application of a binomial option pricing model with the following inputs: exercise price, dividend yields, risk-free interest rate, and expected annual volatility. As of June 30, 2022, the Company had approximately $0 of unrecognized pre-tax non-cash compensation expense. The Company used straight-line amortization of compensation expense over the one-year requisite service or vesting period of the grant. The Company recognizes forfeitures as they occur. There are options to purchase approximately 2,222 shares that have vested as of June 30, 2022.\nThe Company uses a binomial option pricing model to estimate the fair value of its stock option awards and warrant issuances. The calculation of the fair value of the awards using the binomial option-pricing model is affected by the Companys stock price on the date of grant as well as assumptions regarding the following:\nYear ended June 30,\nExpected volatility\n-\n%\n369.76% - 496.27\n%\nExpected term\n-\n4 Years\nRisk-free interest rate\n-\n%\n0.76%-0.84\n%\nForfeiture Rate\n-\n%\n%\nExpected dividend yield\n-\n%\n%\nThe expected volatility was determined with reference to the historical volatility of the Companys stock. The Company uses historical data to estimate option exercise and employee termination within the valuation model. The expected term of options granted represents the period of time that options granted are expected to be outstanding. The risk-free interest rate for periods within the contractual life of the option is based on the U.S. Treasury rate in effect at the time of grant.\nA summary of the status of the Companys outstanding stock options as of June 30, 2022 and 2021 and changes during the periods ending on that date is as follows:\nYear Ended June 30,\nYear Ended June 30,\nWeighted\nWeighted\nAverage\nAggregate\nAverage\nAggregate\nExercise\nIntrinsic\nExercise\nIntrinsic\nPrice\nValue\nPrice\nValue\nStock options\nBalance at beginning of year\n11,852\n$ 20.25\n-\n$ -\n$\nGranted\n-\n0.00\n11,852\n$ 20.25\n-\nExercised\n-\n$ 0.00\n-\n$ -\n-\nForfeited\n(9,630 )\n$ (18.69 )\n-\n$ -\nBalance at end of year\n2,222\n$ 27.00\n$ -\n11,852\n$ 20.25\n$ -\nOptions exercisable at end of year\n2,222\n$ 27.00\n$ -\n1,173\n$ 20.25\n$ -\nThe following table summarizes information about employee stock options outstanding at June 30, 2022:\nOutstanding Options\nVested Options\nNumber\nNumber\nOutstanding\nWeighted\nWeighted\nExercisable\nWeighted\nWeighted\nat\nAveraged\nAveraged\nat\nAveraged\nAveraged\nJune 30,\nRemaining\nExercise\nJune 30,\nExercise\nRemaining\nRange of Exercise Price\nLife\nPrice\nPrice\nLife\n$27.00\n2,222\n3.84\n$ 27.00\n2,222\n$ 27.00\n3.84\nOutstanding options\n2,222\n3.84\n$ 27.00\n2,222\n$ 27.00\n3.84\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nRestricted Stock Awards\nRestricted stock awards are awards of common stock that are subject to restrictions on transfer and to a risk of forfeiture if the holder leaves the Company before the restrictions lapse. The holder of a restricted stock award is generally entitled at all times on and after the date of issuance of the restricted shares to exercise the rights of a shareholder of the Company, including the right to vote the shares. The value of stock awards that vest over time was established by the market price on the date of its grant.\nA summary of the Companys restricted stock activity for the year ended June 30, 2022 and 2021 is presented in the following table:\nFor the Year ended\nJune 30, 2022\nJune 30, 2021\nWeighted\nWeighted\nAverage\nAverage\nGrant Date\nGrant Date\nShares\nFair Value\nShares\nFair Value\nUnvested at beginning of period\n97,778\n$ 15.53\n$ 81.00\nGranted\n41,481\n$ 10.66\n146,667\n$ 15.53\nForfeited\n(8,025 )\n10.80\nVested\n(123,827 )\n$ 14.85\n(49,383 )\n$ 15.53\nUnvested at end of period\n7,407\n$ 13.50\n97,778\n$ 15.53\nUnrecognized compensation expense related to outstanding restricted stock awards to consultants as of June 30, 2022 was $91,800 and is expected to be recognized over a weighted average period of 0.5 years.\nNOTE 9: INCOME TAXES\nThe Company has not filed its corporate tax returns since fiscal 2007.\nDue to recurring losses, the Companys tax provision for the years ended June 30 2022 and 2021 was $0.\nThe difference between the effective income tax rate and the applicable statutory federal income tax rate is summarized as follows:\nStatutory federal rate\n(21.7 )%\n(21.7 )%\nState income tax rate, net of federal benefit\n(3.6 )%\n(3.6 )%\nPermanent differences, including stock-based compensation\n8.6 %\n8.6 %\nChange in valuation allowance\n16.7 %\n16.7 %\nEffective tax rate\n0.0 %\n0.0 %\nAt June 30, 2022 and 2021 the Companys deferred tax assets were as follows:\nJune 30, 2022\nJune 30, 2021\nTax benefit of net operating loss carry forward\n$ 7,768,000\n$ 7,245,000\nIntangible\n-\n-\nTotal deferred tax assets\n7,768,000\n7,245,000\nLess: valuation allowance\n(7,768,000 )\n(7,245,000 )\nNet deferred tax assets\n$ -\n$ -\nAs of June 30, 2022, the Company had unused net operating loss carry forwards of approximately $36.9 million available to reduce future federal taxable income. Net operating loss carryforwards expire through fiscal years ending 2040. Internal Revenue Code Section 382 places a limitation on the amount of taxable income that can be offset by carryforwards after a change in control (generally a greater than 50% change in ownership).\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 9: INCOME TAXES, continued\nThe Companys ability to offset future taxable income, if any, with tax net operating loss carryforwards may be limited due to the non-filing of tax returns and the impact of the statute of limitations on the Companys ability to claim such benefits. Furthermore, changes in ownership may result in limitations under Internal Revenue Code Section 382. Due to these limitations, and other considerations, management has established full valuation allowances on deferred tax assets relating to net operating loss carryforward, as the realization of any future benefits from these assets is uncertain.\nThe Companys valuation allowance at June 30, 2022 and 2021 was $7,768,000 and $7,245,000, respectively. The change in the valuation allowance during the year ended June 30, 2022 was an increase of approximately $523,000. Effective December 22 2018, a new tax bill was signed into law that reduced the federal income tax rate for corporations from 35% to 21.7% for the year ended June 30, 2022. Going forward the blended rate will be 25.4% for future years.\nNOTE 10: RELATED PARTY TRANSACTIONS\nEquity transactions with related parties are described in Note 7.\nFrom time to time we have borrowed operating funds from Mr. Mark Lucky, our Chief Executive Officer and from certain Directors, for working capital. The advances were payable upon demand and were interest free. $0 in advances remain outstanding as of June 30, 2022. Mr. Lucky is owed $1,481 for out-of-pocket expenses as of June 30, 2022, which is included on the balance sheet in Accounts payable and accrued expenses.\nNOTE 11: COMMITMENTS AND CONTINGENCIES\nOperating Leases\nThe Company operates virtually, with no office space rented. The Company has no future minimum annual payments under non-cancelable operating leases at June 30, 2022.\nVISIUM TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022 AND 2021\nNOTE 11: COMMITMENTS AND CONTINGENCIES, continued\nContingencies\nThe Company accounts for contingent liabilities in accordance with Accounting Standards Codification (ASC) Topic 450, Contingencies. This guidance requires management to assess potential contingent liabilities that may exist as of the date of the financial statements to determine the probability and amount of loss that may have occurred, which inherently involves an exercise of judgment. If the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potential material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed. For loss contingencies considered remote, no accrual or disclosures are generally made. Management has assessed potential contingent liabilities as of June 30, 2022, and based on the assessment there are no probable loss contingencies requiring accrual or disclosures within its financial statements.\nLicense Contingent Consideration\nOur license agreements with the sellers of Threat Surface Solutions Group, LLC includes a provision for a royalty payment based on ten percent (10%) of sales generated by Threat Surface Solutions Group beginning on the Agreement Date and ending on October 12, 2021, capped at a maximum royalty of $2,500,000. As of June 30, 2022, we have not generated any revenue related to these license agreements.\nOur license agreements with George Mason University and The MITRE Corporation include provisions for a royalty payment on revenues collected of 5% and 6%, respectively. As of June 30, 2022, we have not generated any revenue related to these license agreements.\nNote 12 - Fair Value Measurement\nFair value measurements\nAt June 30, 2022 and 2021, the fair value of derivative liabilities is estimated using the Cox, Ross & Rubinstein Binomial Tree valuation model using inputs that include the expected volatility, the implied risk-free interest rate, as well as the expected dividend rate. The derivative liabilities are the only Level 3 fair value measures.\nAt June 30, 2022, the estimated fair values of the liabilities measured on a recurring basis are as follows:\nFair Value Measurements at\nJune 30, 2022:\n(Level 1)\n(Level 2)\n(Level 3)\nDerivative liability - Convertible notes\n31,350\nDerivative liability - Warrants\n$ -\n$ -\n$ 3,947\nTotal derivative liability\n$ -\n$ -\n$ 35,297\nAt June 30, 2021, the estimated fair values of the liabilities measured on a recurring basis are as follows:\nFair Value Measurements at\nJune 30, 2021:\n(Level 1)\n(Level 2)\n(Level 3)\nDerivative liability - Convertible notes\n115,047\nDerivative liability - Warrants\n$ -\n$ -\n$ 69,334\nTotal derivative liability\n$ -\n$ -\n$ 184,381\nNOTE 13: SUBSEQUENT EVENTS\nIn the quarter ended September 30 2022, our consultants vested 1,482 shares of our $0.0001 par value common stock, valued at $23,000, or at an average price per share of $15.53.\nIn the quarter ended September 30 2022, our directors and officers vested 3,705 shares of our $0.0001 par value common stock, valued at $34,412, or at an average price per share of $9.29.\nIn September 2022 the Company amended the terms of four convertible notes held by three individual investors. The amendment to each of the notes waived the requirement for an interim note payment to be made by the Company. In exchange for this the Company issued the noteholders warrants for an aggregate 138,667 common shares. The warrants have a five year life and a conversion price of $0.001 per share."
}