{
    "cik": "1096752",
    "company": "EDGEWELL PERSONAL CARE Co",
    "filing_type": "10-K",
    "filing_date": "2023-11-28",
    "period_of_report": "2023-09-30",
    "sic": "2844",
    "state_of_inc": "MO",
    "state_location": "CT",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1096752/0001628280-23-040139-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1096752/000162828023040139/epc-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1096752/0001628280-23-040139.txt",
    "filename": "1096752_10K_2023_0001628280-23-040139.htm",
    "content": "Item 1. Business.\nOverview\nEdgewell Personal Care Company, and its subsidiaries, is one of the worlds largest manufacturers and marketers of personal care products in the Wet Shave, Sun and Skin Care, and Feminine Care categories. With operations in over 20 countries, our products are widely available in more than 50 countries.\nHistory and Development\nWe were incorporated in the state of Missouri on September 23, 1999 and, prior to April 2000, were a wholly-owned subsidiary of Ralston Purina Company. On April 1, 2000, all of the outstanding shares of our common stock were distributed to shareholders of Ralston Purina Company and we became an independent publicly-owned company. During the years that followed, we implemented a strategy of acquiring several personal care brands, which created the foundation for the company we are today.\nIn 2003, we completed the acquisition of the Schick-Wilkinson Sword business (SWS) from Pfizer, Inc., the second largest manufacturer and marketer of mens and womens wet shave products in the world at that time. Our portfolio of wet shave products includes: Hydro® and Quattro® mens shaving systems; Hydro Silk®, Quattro for Women®, Intuition® and Silk Effects® Plus womens shaving systems; and the Hydro, Quattro, Xtreme 3®, Slim Twin®, Slim Triple®, Skintimate and Extra3™ disposables. SWS has over 100 years of history in the shaving products industry with a reputation for high quality and innovation in shaving technology. SWS products are sold throughout the world.\nIn 2007, we acquired Playtex Products, Inc. (Playtex), a leading manufacturer and marketer of well-recognized brands such as Playtex® feminine care products, Wet Ones® pre-moistened wipes, and Banana Boat® and Hawaiian Tropic® sun care products, thereby expanding our branded consumer products portfolio.\nIn 2009, we completed the acquisition of the Edge® and Skintimate® shave preparation brands from S.C. Johnson & Son, Inc., adding market leading United States-based (U.S.) shave preparation brands to our existing wet shave product portfolio. In 2010, we completed the acquisition of American Safety Razor, LLC (ASR), a leading global manufacturer of private label and value wet shaving razors and blades and specialty blades.\nStrengthening our companys feminine care product portfolio, in 2013 we acquired the Stayfree® pad, Carefree® liner and o.b.® tampon feminine hygiene brands in the U.S., Canada and the Caribbean from Johnson & Johnson.\nIn 2015, we completed the separation of our Household Products business, which manufactures and markets batteries and portable lighting, into a separate publicly-owned company (the Spin or the Separation). We completed the tax-free Separation by distributing 100% of the outstanding shares of common stock of Energizer SpinCo, Inc. to our shareholders. The newly formed company assumed the name Energizer Holdings, Inc. (New Energizer) and began trading under the symbol ENR on the New York Stock Exchange (NYSE). Edgewell retained the Personal Care business and trades on the NYSE under the symbol EPC. Following the Separation, we do not beneficially own any shares of New Energizer. In connection with the Separation, we changed our name to Edgewell Personal Care Company on June 30, 2015.\nIn recent years, we have entered the mens grooming and skin care markets through several acquisitions. On October 31, 2016, we completed the acquisition of Bulldog Skincare Holdings Limited (Bulldog), a mens grooming and skincare company based in the United Kingdom (U.K.). On March 1, 2018, we completed the acquisition of Jack Black, L.L.C. (Jack Black), a mens luxury skincare company based in the U.S. On September 2, 2020, we completed the acquisition of Cremo Holding Company, LLC (Cremo), a U.S.-based masstige mens grooming brand. On November 29, 2021, we completed the acquisition of Billie, a high-quality shaving and premium body care brand which strengthens our womens Wet Shave and grooming product portfolio (the Billie Acquisition). These more recent acquisitions have created opportunities to expand our personal care portfolio into the growing, global grooming category, and have allowed us to leverage our international geographic footprint.\nOur Business Segments and Product Strategies\nWe manage our business in three operating segments: Wet Shave, Sun and Skin Care, and Feminine Care. Segment performance is evaluated based on segment profit, exclusive of general corporate expenses, share-based compensation costs, costs associated with restructuring initiatives and other items that are not representative of managements view on how segment performance is evaluated. Information regarding the product portfolios of these segments is included within the following discussion. Financial information regarding each of our reportable segments, as well as other geographical information, is included in Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations and in Note 18 of Notes to Consolidated Financial Statements included within Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\nWet Shave\nWet Shave products are sold under the Schick®, Wilkinson Sword®, Edge, Skintimate®, Billie®, Shave Guard and our custom brands group (formerly sold under our Shave Guard and Personna® brands). We manufacture and distribute Schick and Wilkinson Sword razor systems, composed of razor handles and refillable blades, and disposable shave products for men and women. While we market our wet shave products throughout the world, our primary markets are the U.S., Canada, Japan, Germany, France and the U.K. We believe we hold the number two global market share position in wet shaving. The category is highly competitive, with brands vying for consumer loyalty and retail shelf space.\nIn fiscal 2022, we completed the acquisition of Billie, adding the growing womans brand to our portfolio of products. Billies strong direct-to-consumer and digital capabilities have underpinned its strong growth, which positioned the brand well for its initial expansion into U.S. brick-and-mortar in 2022. The Billie brand complements and strengthens Edgewells position in the womens shaving category, adding to our portfolio of strong brands such as Schick Intuition, Hydro Silk and Skintimate.\nIn the U.S., Canada and Japan, we sell market-leading shave preparation products, including shaving gels and creams under the Edge, Skintimate and Shave Guard brands.\nWe also manufacture, distribute and sell a complete line of private label and disposable razors, shaving systems and replacement blades. These private label wet shave products including emerging direct-to-consumer (DTC) brands are sold primarily under a retailers store name or under our value brand names such as Personna.\nSun and Skin Care\nSun and Skin Care products are sold under the Banana Boat, Hawaiian Tropic, Bulldog®, Jack Black®, Cremo® and Wet Ones brand names. We market Sun Care products under the Banana Boat and Hawaiian Tropic brands and believe these brands, on a combined basis, hold a leading market share position in the U.S. Sun Care category. We compete across the full spectrum of Sun Care categories: general protection, sport, kids, baby, tanning and after sun. Outside of the U.S., we believe we are also the leading Sun Care manufacturer in Mexico with significant presence in Australia and Canada. We expect to continue to drive our worldwide business through product innovation, increased distribution and geographic expansion.\nWe offer Wet Ones antibacterial hand wipes and other related products as the leader in the U.S. portable hand wipes category. We expect to utilize our position as market leader to further scale the business and use innovation such as Wet Ones lavender gel, to increase growth.\nWe have acquired a portfolio of mens grooming skin care products that have grown under our direction. Our Bulldog skincare products are purpose-built for men and were created to work simply and efficiently while dealing with issues specific to mens skin. Since acquiring Bulldog, we have expanded sales geographically and we continue to commit resources to further growth and distribution for the brand. We acquired the Jack Black brand and obtained a footprint in the luxury mens skincare market and continue to use resources at our disposal to grow the Jack Black brand globally. Our Cremo products compete in the masstige category for mens grooming, and offer a complete line of barber quality beard, hair and skin care products.\nFeminine Care\nIn Feminine Care, we market products under the Playtex, Stayfree, Carefree and o.b. brands. We offer tampons under the Playtex Gentle Glide® 360°®, Playtex Sport®, Playtex and o.b. brands, including the Playtex Sport compact tampon launched in 2017. We also market pads and liners under the Stayfree and Carefree brands. We believe we are one of the top three manufacturers of feminine care products in North America, with unique, competitive product technologies and well-known brands that address complementary consumer needs. We intend to continue to invest in innovation in our feminine care brands.\nCompetition\nThe personal care product categories in which we compete are highly competitive, both in the U.S. and in most international markets, as large manufacturers with global operations and new entrants attempting to disrupt the market compete for consumer acceptance and increasingly limited retail shelf space. Competition is based upon several factors, including brand quality and perception, product formulation and performance, customer service and price and promotion. The continued growth in online sales also puts additional competitive pressure on our Company.\nWet Shave\nThe global shaving products category is comprised of wet shave blades and razors, electric shavers and shaving gels and creams. With our established brands and product lines and global presence, we believe we compete effectively in this market. Our principal competitors in the global wet shave business are: The Procter & Gamble Company, which owns the Gillette brand and is the leading company in the global wet shave segment; Bic Group, which is expanding beyond its historical strength in the disposable segment; and Dorco, which competes primarily in the private label segment. We also compete with newer entrants to the Wet Shave market for both DTC online and traditional retail shelf space including Unilever (Dollar Shave Club brand), Harry's, Perio (Barbasol and PureSilk brands), Beiersdorf (Nivea branded womens wet shave product in Germany) and numerous other online start-ups.\nSun and Skin Care\nThe markets for sun and skin care are also highly competitive, characterized by the frequent introduction of new products accompanied by major advertising and promotional programs. Our competitors in these markets consist of a large number of domestic and foreign companies, including Bayer AG and Johnson & Johnson.\nThe Sun Care categories globally are characterized historically by global growth and is impacted by trends in skin care. With our balanced Sun Care portfolio, depth of Sun Care formulation expertise and global presence, we believe we compete effectively and have more than doubled our international sun care business since acquiring the Banana Boat and Hawaiian Tropic brands in 2008. We intend to continue to compete by driving product innovation, building differentiated brand equity and focusing on in-store visibility.\nThe global mens skin care market is expected to continue to grow, with increased demand for mens personal care products. Our competitors in this market include large companies such as Johnson & Johnson, LOréal S.A., The Estee Lauder Companies, Inc. and Unilever, as well as smaller companies. We compete in the market by creating simple and effective skin care products with natural ingredients at multiple price points through our Bulldog and Cremo skin care products and in the luxury mens skin care market with Jack Black.\nFeminine Care\nThe markets for feminine care and other personal products are characterized by large manufacturers with global presence, as well as new market entrants, and is likewise very competitive, with a large number of domestic and foreign competitors, including The Procter & Gamble Company and Kimberly Clark Corp. With our acquisition of the Stayfree, Carefree and o.b. brands, we expanded our presence within the feminine care product category and became one of the top three manufacturers in North America. We compete by having a portfolio of well-known brands that address complementary consumer needs.\nSales and Distribution\nOur products are marketed primarily through a direct sales force and supplemented by strategic exclusive and non-exclusive distributors and wholesalers. In the U.S., Japan and larger markets in Western Europe and Latin America, we have dedicated commercial organizations, reflecting the scale and importance of these businesses to our Company. In several countries where we do not have dedicated commercial organizations, we utilize third-party distributors and wholesalers. As a result of increased competition through the expansion of online markets, we have established e-commerce operations across several business lines, including global Schick.com websites providing mens and womens shaving products, Bulldog, Jack Black and Billie DTC sites, an acceleration of e-commerce sales in China through our partnership with T-Mall. We distribute our products to consumers through numerous retail locations worldwide, including mass merchandisers and warehouse clubs, food, drug and convenience stores, and military stores.\nAlthough a large percentage of our sales are attributable to a relatively small number of retail customers, only Walmart Inc. and its subsidiaries (Walmart), as a group, account for more than 10% of our consolidated annual net sales. Walmart accounted for approximately 19.4% of our net sales in fiscal 2023. Purchases by Walmart included products from all of our segments. Target Corporation represented approximately 9.4% of net sales for our Sun and Skin Care segment and 10.0% for our Feminine Care segment, respectively.\nGenerally, orders are shipped within a month of their order date. Because of the short period of time between order and shipment dates, the dollar amount of current backlog is not material and is not considered to be a reliable indicator of future sales volume.\nGovernment contracts do not represent a material portion of our net sales.\nSeasonality\nCustomer orders for Sun Care products within our Sun and Skin Care segment are highly seasonal, which has historically resulted in higher sun care sales to retailers during the late winter through mid-summer months. Within our Wet Shave segment, sales of womens products are moderately seasonal, with increased consumer demand in the spring and summer months. See Our business is subject to seasonal volatility in Item 1A. Risk Factors.\nThe following risks and uncertainties could materially adversely affect our business, results of operations, financial condition and cash flows. We may amend or supplement the risk factors described below from time to time in other reports we file with the SEC.\nMacroeconomic Conditions and Related Risk Factors\nChanges in production costs, including raw material prices and tariffs, could erode our profit margins and negatively impact operating results.\nPricing and availability of raw materials, energy, shipping, labor and other services needed for our business can be volatile due to general economic conditions, including inflation, supplier capacity restraints, geopolitical developments, changes in supply and demand, natural disasters, energy costs, health epidemics or pandemics (including the COVID-19 pandemic), labor shortages and turnover, production levels, currency fluctuations, governmental actions (including import and export requirements such as new or increased tariffs, sanctions, quotas or trade barriers), port congestions or delays, transport capacity restraints, cybersecurity incidents or other disruptions of key manufacturing sites, acts of terrorism and other factors beyond our control. There is no certainty that we will be able to offset future cost increases. This volatility can significantly affect our production costs and may, therefore, have a material adverse effect on our business, results of operations and financial condition.\nIf such cost pressures persist or exceed our estimates and we are not able to increase the prices of our products or achieve cost savings to offset such cost increases, our operating margins would be harmed. In addition, even if we increase the prices of our products in response to increases in the cost of commodities or other cost increases, we may not be able to sustain its price increases. Sustained price increases may lead to declines in volume as competitors may not adjust their prices or customers may decide not to pay the higher prices, which could lead to sales declines and loss of market share, and our projections may not accurately predict the volume impact of price increases, which could adversely affect its business, financial condition and results of operations.\nWe may not be able to attract, retain and develop key personnel.\nOur future performance depends in significant part upon the continued service of our executive officers and other key personnel. The loss of the services of one or more of our executive officers or other key employees could have a material adverse effect on our business, prospects, financial condition and results of operations. Our success also depends on our continuing ability to attract, retain and develop highly qualified personnel. Competition for such personnel is intense, and there can be no assurance that we can retain and motivate our key employees or attract and retain other highly qualified personnel in the future.\nCompetition in our industries may hinder our ability to execute our business strategy, achieve profitability, or maintain relationships with existing customers.\nThe categories in which we operate are largely mature and highly competitive, both in the U.S. and globally, as a number of companies compete for consumer acceptance, limited retail shelf space and e-commerce opportunities. Because of the highly competitive environment in which we operate, as well as increasing retailer concentration, our retailer customers, including online retailers, frequently seek to obtain pricing concessions or better trade terms, resulting in either reduction of our margins or losses of distribution to lower cost competitors. Competition is based upon brand perceptions, product performance and innovation, customer service and price. Our ability to compete effectively may be affected by a number of factors, including:\nseveral of our competitors, including The Procter & Gamble Company, Unilever, Johnson & Johnson and others, may have substantially greater financial, marketing, research and development and other resources and greater market share in certain segments than we do, which could provide them with greater scale and negotiating leverage with retailers\nand suppliers, and other competitors are newer companies backed by private-equity investors with the goal of expanding revenue instead of profitability;\nour competitors may have lower production, sales and distribution costs, and higher profit margins, which may enable them to offer aggressive retail discounts and other promotional incentives;\nour competitors may be able to obtain exclusive distribution rights at particular retailers or favorable in-store placement;\nour retailers could reduce inventories, shift to different products, or require us to lower our prices to retain shelf placement of our products; and\nwe may lose market share to private label brands sold by retail chains, or to price brands sold by local and regional competitors, which, in each case, are typically sold at lower prices than our products.\nLegal, Regulatory, Tax and Other Risks\nOur business is subject to increasing global regulation, including product related regulations and environmental regulations, that may expose us to significant liabilities.\nThe manufacturing, packaging, labeling, storage, distribution, advertising and sale of our products are subject to extensive regulation. For example, a number of our products are regulated by health authorities both in the U.S. and in the E.U. (such as the U.S. Food and Drug Administration), and by consumer protection organizations (such as the U.S. Consumer Product Safety Commission). These regulatory frameworks focus on our ingredients as well as the safety and efficacy of our products. Similarly, the advertising and marketing of our products is regulated by agencies such as the U.S. Federal Trade Commission. All of these regulatory frameworks exist at the federal, state and local level in the U.S. as well as in foreign countries where we sell our products. New or more restrictive regulations or more restrictive interpretations of existing regulations are likely and could lead to additional compliance costs and could have an adverse impact on our business. Additionally, a finding that we are in violation of, or not in compliance with, applicable laws or regulations could subject us to material civil remedies, including fines, damages, injunctions or product recalls, or criminal sanctions. Even if a claim is unsuccessful, is not merited or is not fully pursued, the negative publicity surrounding such assertions could jeopardize our reputation and brand image and have a material adverse effect on our businesses, as well as require resources to rebuild our reputation.\nWe must comply with various environmental laws and regulations in the jurisdictions in which we operate, including those relating to the handling and disposal of solid and hazardous wastes and the remediation of contamination associated with the use and disposal of hazardous substances. A release of such substances due to an accident or intentional act could result in substantial liability to governmental authorities or to third parties. Pursuant to certain environmental laws, we could be subject to joint and several strict liability for contamination relating to our or our predecessors current or former properties or any of their respective third-party waste disposal sites. In addition to potentially significant investigation and remediation costs, any such contamination can give rise to claims from governmental authorities or other third parties for natural resource damage, personal injury, property damage or other liabilities. We have incurred, and will continue to incur, capital and operating expenses and other costs in complying with environmental laws and regulations, including remediation costs relating to our current and former properties and third-party waste disposal sites. As new laws and regulations are introduced, we could become subject to additional environmental liabilities in the future that could cause a material adverse effect on our results of operations or financial condition.\nOur Company may be named a party to legal proceedings or may be subject to product liability or other claims that can result in significant expenses, fines, product recalls or withdrawals and reputational damage, which would affect our results of operations and financial condition.\nIn the ordinary course of business, the Company and its subsidiaries are subject to numerous claims and lawsuits involving various issues such as patent disputes, current and historical product liability claims; claims that our product manufacturing, sales, and marketing practices violate various consumer protection laws both in the U.S. and internationally; and claims arising out of alleged defects in our products, including property damage, bodily injury or other adverse effects. While the Company believes it has substantial defenses in these matters, it is not feasible to predict the ultimate outcome of litigation. The Company could in the future be required to pay significant amounts as a result of settlements or judgments in these matters, including matters where the Company could be held jointly and severally liable among other defendants. In addition to the risk of monetary judgments not covered by insurance, product liability claims could result in negative publicity that could harm our products reputation and in certain cases require a product recall. Product recalls or product liability claims, and any subsequent remedial actions, could have a material adverse effect on our business, reputation, brand value, results of operations and financial condition.\nLitigation, in general, and class action and multi-district litigation, in particular, can be expensive and disruptive. Some of these matters may include large numbers of plaintiffs, may involve parties seeking large or indeterminate amounts, including punitive or exemplary damages, and may remain unresolved for several years. Although we maintain product liability insurance, this insurance does not cover all types of claims, particularly claims other than those involving personal injury or property damage or claims that exceed the amount of insurance coverage. Further, we may not be able to maintain such insurance in sufficient amounts, on desirable terms, or at all, in the future.\nOur business could be negatively impacted by corporate citizenship and sustainability matters.\nThere is an increased focus from certain investors, customers, consumers, employees, and other stakeholders concerning corporate citizenship and sustainability matters. From time to time, we announce certain initiatives, including goals, regarding our focus areas, which include environmental matters, packaging, responsible sourcing, social investments and diversity, equity and inclusion. We could fail, or be perceived to have failed, in our achievement of such initiatives or goals, or we could fail in accurately reporting our progress on such initiatives and goals. Such failures could be due to changes in our business (e.g., shifts in business among distribution channels or acquisitions). Moreover, the standards by which citizenship and sustainability efforts and related matters are measured are evolving, and certain areas are subject to assumptions which could change over time. In addition, we could be criticized for the scope of such initiatives or goals or perceived as not acting responsibly in connection with these matters. Adverse incidents related to corporate citizenship or sustainability matters could impact the value of our brands, the cost of our operations, and our relationships with existing and future investors, which could have a material adverse effect on our business.\nIf we fail to adequately protect our intellectual property rights, competitors may manufacture and market similar products, which could adversely affect our market share and results of operations.\nThe vast majority of our total net sales are from products bearing proprietary trademarks and brand names. In addition, we own or license from third parties a considerable number of patents, patent applications and other technology. We rely on trademark, trade secret, patent and copyright laws to protect our intellectual property rights. There is a risk that we will not be able to obtain and perfect or maintain our own intellectual property rights or, where appropriate, license intellectual property rights necessary to support new product introductions. In addition, even if such rights are protected in the U.S., the laws of some other countries in which our products are or may be sold do not protect intellectual property rights to the same extent as the laws of the U.S. Our intellectual property rights could be invalidated, circumvented or challenged in the future, and we could incur significant costs in connection with legal actions relating to such rights. As patents expire, we could face increased competition or decreased royalties, either of which could negatively impact our operating results. If other parties infringe our intellectual property rights, they may dilute the value of our brands in the marketplace, which could diminish the value that consumers associate with our brands which may harm our sales.\nLegislative changes in applicable tax laws, policies and regulations or unfavorable resolution of tax matters may result in additional tax liabilities, which could adversely impact our cash flows and results of operations.\nOur businesses are subject to taxation in the U.S. and multiple foreign jurisdictions. The impact of any legislative tax law, policy or regulation changes by federal, state, local and foreign authorities may result in additional tax liabilities which could adversely impact our cash flows and results of operations. Significant estimation and judgment are required in determining our provisions for taxes in the U.S. and jurisdictions outside the U.S. In the ordinary course of our business, there are transactions and calculations in which the ultimate tax determination is uncertain. We are regularly under audit by tax authorities, and although we believe our tax positions are defensible and our tax provision estimates are reasonable, the final outcome of tax audits and related litigation could be materially different than that reflected in our income tax provisions and accruals. The unfavorable resolution of any audits or litigation could have an adverse impact on future operating results and our financial condition. More aggressive and assertive tax collection policies, particularly in jurisdictions outside the U.S., may increase the costs of resolving tax issues and enhance the likelihood that we will have increased tax liabilities going forward. In addition, international tax reform remains a priority with the Organization for Economic Cooperation and Developments Action Plan on Base Erosion & Profit Shifting and other proposed foreign jurisdictional tax law changes. Given the uncertainty of the possible changes and their potential interdependency, we are unable to determine the net consolidated impact of changes in global tax legislation, if any.\nInformation Technology and Systems\nA failure of a key information technology system or a breach of our information security could adversely impact our ability to conduct business.\nWe rely extensively on information technology systems in order to conduct business, including some that are managed by third-party service providers. These systems include, but are not limited to, programs and processes relating to internal and external communications, ordering and managing materials from suppliers, converting materials to finished products, shipping products to customers, processing transactions, summarizing and reporting results of operations, and complying with regulatory, legal or tax requirements. These information technology systems could be damaged or cease to function properly due to the poor performance or failure of third-party service providers, catastrophic events, power outages, network outages, failed upgrades or other similar events. If our business continuity plans do not effectively resolve such issues on a timely basis, we may suffer interruptions in conducting our business which may adversely impact our operating results.\nPeriodically, we also need to upgrade our information technology systems or adopt new technologies. If such a new system or technology does not function properly or otherwise exposes us to increased cybersecurity breaches and failures, it could affect our ability to order materials, make and ship orders, and process payments in addition to other operational and information integrity and loss issues. Further, if the information technology systems, networks or service providers we rely upon fail to function properly or cause operational outages or aberrations, or if we or one of our third-party providers suffer significant unavailability of key operations, or inadvertent disclosure of, lack of integrity of, or loss of our sensitive business or stakeholder information, due to any number of causes, ranging from catastrophic events or power outages to improper data handling, security incidents or employee error or malfeasance, and our business continuity plans do not effectively address these failures on a timely basis, we may be exposed to reputational, competitive, operational, financial and business harm as well as litigation and regulatory action. The costs and operational consequences of responding to the above items and implementing remediation measures could be significant and could adversely impact our results.\nAn information security incident, including a cybersecurity breach, could have a negative impact to the Companys business or reputation.\nOur systems and networks, as well as those of our retailer customers, suppliers, service providers, and banks, may become the target of advanced cyber-attacks or information security breaches which will pose a risk to the security of our services, systems, networks and supply chain, as well as to the confidentiality, availability and integrity of data of our Company, employees, customers or consumers, and disrupt our operations or damage our facilities or those of third parties. As cybersecurity threats rapidly evolve in sophistication and become more prevalent across the industry globally, we are continually increasing our attention to these threats. We assess potential threats and vulnerabilities and make investments seeking to address them, including ongoing monitoring and updating of networks and systems, increasing specialized information security skills, deploying employee security training, and updating security policies for our Company and our third-party providers. However, because the techniques, tools and tactics used in cyber-attacks frequently change and may be difficult to detect for periods of time, we may face difficulties in anticipating and implementing adequate preventative measures or fully mitigating harms after such an attack. As a result, a cyber-attack could negatively impact our net sales and increase our operating and capital costs. In addition, our employees frequently access our suppliers and customers systems and we may be liable if our employees are the source of any breaches in these third-party systems. It could also damage our reputation with retailer customers and consumers and diminish the strength and reputation of our brands or require us to pay monetary penalties.\nBusiness and Operational Risk Factors\nLoss of any of our principal customers could significantly decrease our sales and profitability.\nWalmart, together with its subsidiaries, is our largest customer, accounting for approximately 19.4% of our net sales in fiscal 2023. Generally, sales to our top customers are made pursuant to purchase orders and we do not have supply agreements or guarantees of minimum purchases from them. As a result, these customers may decrease their level of purchases from us at any time. The loss or a substantial decrease in the volume of purchases by any of our top customers would harm our sales and profitability. Increasing retailer customer concentration could result in reduced sales outlets for our products, as well as greater negotiating pressures and pricing requirements.\nChanges in the policies of our retailer customers and increasing dependence on key retailer customers in developed markets may adversely affect our business.\nIn recent years, retailer consolidation both in the U.S. and internationally has increased. This trend has resulted in the increased size and influence of large, highly consolidated retail customers, including internet-based retailers, who may demand lower pricing, special packaging or impose other commercial requirements on us. These business demands may relate to inventory practices, logistics or other aspects of the customer-supplier relationship. Some of our customers, particularly our high-volume retail customers, have sought to obtain pricing and other concessions and better trade terms. To the extent we provide concessions or better trade terms to those customers, our margins are reduced. Further, if we are unable to effectively respond to the demands of our customers, these customers could reduce their purchases of our products and increase their purchases of products from competitors, which would harm our sales and profitability. In addition, reductions in inventory by our customers, including as a result of consolidations in the retail industry, or our customers managing their working capital requirements, could result in reduced orders for our products and adversely affect our results of operations for the financial periods affected by such reductions.\nProtracted unfavorable market conditions have caused many of our customers to more critically analyze the number of brands they sell, which could lead to the retailer reducing or discontinuing certain of our product lines, particularly those products that were not number one or two in their category.\nOur inability to execute a successful e-commerce strategy could have a significant negative impact on our business.\nSales of consumer products via e-commerce has gained increasing importance among market participants as more end user customers purchase consumer goods through e-commerce. We are engaged in e-commerce sales channels with respect to many of our products; however, if e-commerce and other sales channels were to take significant market share away from traditional brick and mortar retailers, and if we are not successful in achieving sales growth in these sales channels, our business, financial condition and results of operations may be negatively impacted. We have invested and continue to invest resources into our e-commerce business to maintain competitiveness in the market. There can be no assurances that these investments and initiatives will be successful.\nWe face risks arising from our ongoing efforts to achieve cost savings.\nIn the normal course of business, we may initiate projects which change our manufacturing footprint or our operations in order to gain production efficiencies and reduce costs. The execution of cost savings initiatives may present a number of significant risks, including:\nactual or perceived disruption of service or reduction in service standards to customers;\nthe failure to preserve adequate internal controls as we restructure our general and administrative functions, including our information technology and financial reporting infrastructure;\nthe failure to preserve supplier relationships and distribution, sales and other important relationships and to resolve conflicts that may arise;\nloss of sales as we reduce or eliminate staffing on non-core product lines;\ndiversion of management attention from ongoing business activities;\nthe failure to maintain employee morale and retain key employees while implementing benefit changes and reductions in the workforce; and\nidentification of potential synergies in our manufacturing footprint\nBecause of these and other factors, we cannot predict whether we will realize the purpose and anticipated benefits of these initiatives and, if we do not, our business and results of operations may be adversely affected.\nWe are subject to risks related to our international operations, including currency fluctuations, which could adversely affect our results of operations.\nOur businesses are conducted on a worldwide basis, with nearly 41% of our net sales in fiscal 2023 originating outside the U.S., and a significant portion of our production capacity and cash are located overseas. Consequently, we are subject to a number of risks associated with doing business in foreign countries, including:\nsourcing of raw materials from around the world;\nreliance on China to source, manufacture, and transport materials and goods;\ndelays in transportation of goods when shipping globally;\neconomic conditions impact availability and capacity of key vendors;\nthe possibility of expropriation, confiscatory taxation or price controls;\nthe ability to repatriate foreign-based cash effectively for strategic needs in the U.S., as well as the heightened counterparty, internal control and country-specific risks associated with holding cash overseas;\nthe effect of foreign income taxes, value-added taxes and withholding taxes, including the inability to recover amounts owed to us by a government authority without extended proceedings or at all;\nthe effect of the U.S. tax treatment of foreign source income and losses, and other restrictions on the flow of capital between countries;\nadverse changes in local investment or exchange control regulations;\nrestrictions on and taxation of international imports and exports;\nlegal and regulatory constraints, including tariffs and other trade barriers;\ncurrency fluctuations, including the impact of hyper-inflationary conditions, particularly where exchange controls limit or eliminate our ability to convert from local currency;\npolitical or economic instability, government nationalization of business or industries, government corruption and civil unrest, including political or economic instability; and\ndifficulty in enforcing contractual and intellectual property rights.\nOne or more of these factors could harm our international operations or investments and our operating results.\nWe are currently dependent on third party manufacturers to manufacture certain products for our business. Our business could suffer as a result of a third-party manufacturers inability to produce our products for us on time or to our specifications.\nThe inability of a third-party manufacturer to ship orders in a timely manner, in desirable quantities or to meet our safety, quality and social compliance standards or regulatory requirements could have a material adverse impact on our business. While certain of our relationships with these third parties are subject to minimum volume commitments, whereby the third-party manufacturer has committed to produce and we have committed to purchase a minimum quantity of product, we may nonetheless experience situations where such manufacturers are unable to fulfill their obligations under our agreements.\nOur manufacturing facilities, supply channels or other business operations may be subject to disruption from events beyond our control.\nOperations of our manufacturing and packaging facilities worldwide, and of our corporate offices, and the methods we use to obtain supplies and to distribute our products, may be subject to disruption for a variety of reasons, including availability of raw materials, work stoppages, industrial accidents, disruptions in logistics, loss or impairment of key manufacturing sites, product quality or safety issues, licensing requirements and other regulatory issues, trade disputes between countries in which we have operations, and acts of war, terrorism, pandemics, fire, earthquake, hurricanes, flooding or other natural disasters. The supply of our raw materials may be similarly disrupted. There is also a possibility that third-party manufacturers, which produce a significant portion of certain of our products, could discontinue production with little or no advance notice, or experience financial problems or problems with product quality or timeliness of product delivery, resulting in manufacturing delays or disruptions, regulatory sanctions, product liability claims or consumer complaints. If a major disruption were to occur, it could result in delays in shipments of products to customers or suspension of operations. We maintain business interruption insurance to potentially mitigate the impact of business interruption, but such coverage may not be sufficient to offset the financial or reputational impact of an interruption.\nLoss of reputation of our leading brands or failure of our marketing plans could have an adverse effect on our business.\nWe depend on the continuing reputation and success of our brands, particularly the Schick, Wilkinson Sword, Billie, Edge, Skintimate, Playtex, Wet Ones, Banana Boat, Hawaiian Tropic, Bulldog, Cremo, Jack Black, Stayfree, Carefree and o.b. brands. Our operating results could be adversely affected if one of our leading brands suffers damage to its reputation due to real or perceived quality issues. Further, the success of our brands can suffer if our marketing plans or new product offerings do not improve or have a negative impact on our brands image or ability to attract and retain consumers. Additionally, if claims made in our marketing campaigns become subject to litigation alleging false advertising, it could damage one or several of our brands, cause us to alter our marketing plans in ways that may materially and adversely affect sales, or result in the imposition of significant damages against us. Further, a boycott or other campaign critical of us, through social media or otherwise, could negatively impact our brands reputation and, consequently, our products sales.\nOur business is subject to seasonal volatility.\nCustomer orders for sun care products within our Sun and Skin Care segment are highly seasonal, which has historically resulted in higher sun care sales to retailers during the late winter through mid-summer months. Accordingly, our sales, financial performance, working capital requirements and cash flow may experience volatility during these periods. Further, purchases of our sun care products can be significantly impacted by unfavorable weather conditions during the summer period, and as a result we may suffer decreases in net sales if conditions are not favorable for use of our products, which could in turn have a material adverse effect on our financial condition, results of operation and cash flows. Within our Wet Shave segment, sales of womens products are moderately seasonal, with increased consumer demand in the spring and summer months.\nOur financial performance depends on our ability to anticipate and respond to consumer trends and changes in consumer preferences. New product introductions may not be as successful as we anticipate, which could have a material adverse effect on our business, prospects, results of operations, financial condition and/or cash flows.\nWe have a rigorous process for the continuous development and evaluation of new product concepts, led by executives in marketing, sales, research and development, product development, operations, legal and finance. However, consumer preference and spending patterns change rapidly and cannot be predicted with certainty. There can be no assurance that we will anticipate and respond to trends for consumer products effectively. Each new product launch, including those resulting from our product development process, carries risks, as well as the possibility of unexpected consequences, including:\nthe acceptance of our new product launches and sales of such new products may not be as high as we anticipate;\nour marketing, promotional, advertising and/or pricing strategies for our new products may be less effective than planned and may fail to effectively reach the targeted consumer base or engender the desired consumption of the products by consumers;\nwe may incur costs exceeding our expectations as a result of the continued development and launch of new products, including, for example, unanticipated levels of research and development costs, advertising, promotional and/or marketing expenses, sales return expenses or other costs related to launching new products;\nwe may experience a decrease in sales of certain of our existing products as a result of newly-launched products, the impact of which could be exacerbated by shelf space limitations and/or any shelf space loss;\nour product pricing strategies for new product launches may not be accepted by customers and/or consumers, which may result in sales being less than we anticipate; and/or\nwe may experience a decrease in sales of certain of our products as a result of counterfeit products and/or products sold outside of their intended territories.\nEach of the risks referred to above could delay or impede our ability to achieve our sales objectives, which could have a material adverse effect on our business, prospects, results of operations, financial condition and/or cash flows.\nImpairment of our goodwill and other intangible assets would result in a reduction in net income.\nWe have a material amount of goodwill, trademarks and other intangible assets, as well as other long-lived assets, which are periodically evaluated for impairment in accordance with current accounting standards. Declines in our profitability and estimated cash flows related to specific intangible assets, as well as potential changes in market valuations for similar assets and market discount rates, may result in an impairment charge, which could have an adverse impact on our operating results.\nOur access to capital markets and borrowing capacity could be limited.\nOur access to capital markets to raise funds through the sale of debt or equity securities is subject to various factors, including general economic and financial market conditions. Significant reduction in market liquidity conditions could impact access to funding and increase associated borrowing costs, which could reduce our earnings and cash flows. Additionally, disruptions in financial markets could reduce our access to debt and equity capital markets, negatively affecting our ability to implement our business plan and strategy.\nOur access to debt financing at competitive risk-based interest rates is partly a function of our credit ratings. The major credit rating agencies periodically evaluate our creditworthiness and have assigned us credit ratings. These ratings are based on a number of factors, which include our financial strength and financial policies as well as our strategies, operations and execution. A downgrade to our credit ratings could have a material impact on our business, including increasing our interest rates, limiting our access to public debt markets, limiting the institutions willing to provide us credit facilities, more restrictive credit arrangements and making any future credit facilities or credit facility amendments more costly and difficult to obtain.\nWe have a substantial level of indebtedness and are subject to various covenants relating to such indebtedness, which could limit our discretion to operate and grow our business.\nAs of September 30, 2023, our debt level was approximately $1.4 billion. We may be required to dedicate a substantial portion of our cash to debt service, thereby reducing funds available to fund working capital, capital expenditures, acquisitions and investments and other general corporate purposes. Our failure to make scheduled interest payments or to repay or refinance the indebtedness at maturity or obtain additional financing as needed could have a material adverse effect on our business. Approximately $1.3 billion (90%) of our debt balance as of September 30, 2023 is borrowed at fixed interest rates ranging from 4.125% to 5.50% with maturity dates in 2028 and thereafter.\nAdditionally, certain of our debt instruments are subject to certain financial and other covenants, including debt ratio tests. We may be in breach of such covenants in the event of future declines in our operating cash flows or earnings performance, foreign currency movements or other events. In the event of such breach, our lenders may be entitled to accelerate the related debt as well as any other debt to which a cross-default provision applies, and we could be required to seek amendments or waivers under the debt instruments or to refinance the debt. There is no assurance that we would obtain such amendments or waivers or effect such refinancing, or that we would be able to do so on terms similar to those of our current debt instruments. The covenants and financial ratio requirements contained in our debt instruments could also:\nincrease our vulnerability to general adverse economic and industry conditions;\nrequire a substantial portion of our cash flow from operations to make payments on our indebtedness;\nreduce the cash flow available or limit our ability to borrow additional funds, to pay dividends, to fund capital expenditures and other corporate purposes and to pursue our business strategies;\nlimit our flexibility in planning for, or reacting to, changes in our business and the markets in which we operate; and\nplace us at a competitive disadvantage relative to our competitors that have greater financial flexibility or limit, among other things, our ability to borrow additional funds as needed or take advantage of business opportunities as they arise.\nOur Revolving Credit Facility (See Liquidity and Capital Resources for details) contains customary representations and warranties, and affirmative and negative covenants, including limitations on additional indebtedness, dividends, and other distributions, entry into new lines of business, use of loan proceeds, restrictions on liens on the assets of the Company and our subsidiaries, transactions with affiliates and dispositions. The breach of any of these covenants could result in a default under the Revolving Credit Facility, as defined below. In addition, the Revolving Credit Facility contains customary events of default that include, among others, non-payment of principal, interest or fees, violation of covenants, inaccuracy of representations and warranties, failure to make payment on, or defaults with respect to, certain other material indebtedness, bankruptcy and insolvency events, material judgments and change of control provisions. Upon the occurrence of an event of default, and after the expiration of any applicable grace period, payment of any outstanding loans under the Revolving Credit Facility could be accelerated and the lenders thereunder could foreclose on their security interests in the assets of the Company and certain of our subsidiaries.\nWe may not be able to continue to identify and complete strategic acquisitions and effectively integrate acquired companies to achieve desired financial benefits.\nWe have completed a number of acquisitions, and we expect to continue making acquisitions if appropriate opportunities arise. Acquisitions could be a key use of our cash and a potential driver of future growth. However, we may not be able to identify and successfully negotiate suitable strategic acquisitions at attractive valuations, obtain financing for future acquisitions on satisfactory terms or otherwise complete future acquisitions. Our size relative to other companies in our industry may make completing desirable acquisitions more challenging.\nIf we can complete future acquisitions, we may face significant challenges in consolidating functions and effectively integrating procedures, personnel, product lines, and operations in a timely and efficient manner. The integration process can be complex and time consuming, may be disruptive to our existing and acquired business and may cause an interruption of, or a loss of momentum in, the business. Even if we can successfully complete the integration of acquired businesses into our operations, there is no assurance that anticipated cost savings, synergies, or revenue enhancements will be realized within the expected time frame, or at all. Such acquisitions may result in potentially dilutive issuances of our equity securities, the incurrence of additional debt, restructuring charges, impairment charges, contingent liabilities, amortization expenses related to intangible assets, and increased operating expenses, which could adversely affect our results of operations and financial condition.\nWe may experience losses or be subject to increased funding and expenses related to our pension plans.\nThe Company has several defined benefit pension plans covering employees in the U.S. and certain employees in other countries. The funding obligations for our pension plans are impacted by the performance of the financial markets, interest rates and governmental regulations. While the pension benefit earned to date by active participants under our legacy U.S. pension plan was frozen effective January 1, 2014, and retirement service benefits no longer accrue under this retirement program, and in 2023, under our Canadian defined benefit pension plan, we derecognized the assets and projected benefit obligation, our pension obligations are expected to remain significant. If the investment of plan assets does not provide the expected long-term returns, if interest rates or other assumptions change, or if governmental regulations change the timing or amounts of required contributions to the plans, we could be required to make additional pension contributions which may have an adverse impact on our liquidity, our ability to comply with debt covenants and may require recognition of increased expense within our financial statements.\nItem 1C. Cybersecurity.\nNot Applicable. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nAs of September 30, 2023, we owned or leased 49 properties, 28 in the U.S. and 21 globally. Ten of these properties are used as production plants consisting of 1.8 million square feet that is owned and 0.6 million square feet that is leased. Five of these plants are located in the U.S., and five are in other countries. Six of these plants are used exclusively by our Wet Shave segment, one by our Feminine Care segment, two by our Sun and Skin Care segment and one is shared by our Wet Shave and Sun and Skin Care segments. We also have 14 warehouses consisting of 0.1 million square feet that is owned and 0.8 million square feet that is leased. We operate from 24 different offices throughout the world, totaling 0.3 million square feet, all of which are leased, and includes our corporate headquarters in Shelton, Connecticut. We believe all of our facilities are well-maintained and suitable for the operations conducted in them. Item 3. Legal Proceedings.\nWe, and our subsidiaries, are subject to a number of legal proceedings in various jurisdictions arising out of our operations during the ordinary course of business. Many of these legal matters are in preliminary stages and involve complex issues of law and fact and may proceed for protracted periods of time. The amount of liability, if any, from these proceedings cannot be determined with certainty. We review our legal proceedings and claims, regulatory reviews and inspections on an ongoing basis and follow appropriate accounting guidance when making accrual and disclosure decisions. We establish accruals for those contingencies when the incurrence of a loss is probable and can be reasonably estimated, and disclose the amount accrued and the amount of a reasonably possible loss in excess of the amount accrued, if such disclosure is necessary for our financial statements to not be misleading. We do not record liabilities when the likelihood that the liability has been incurred is probable, but the amount cannot be reasonably estimated. Based upon present information, we believe that our liability, if any, arising from such pending legal proceedings, asserted legal claims and known potential legal claims, which are likely to be asserted, is not reasonably likely to be material to our financial position, results of operations or cash flows, taking into account established accruals for estimated liabilities.\nSee also the discussion captioned Governmental Regulation and Environmental Matters and Legal, Regulatory, Tax and Other Risks included within Item 1. Business of this Annual Report on Form 10-K. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nEdgewell common stock is listed and traded on the New York Stock Exchange (NYSE) under the symbol EPC.\nThere were approximately 4,540 shareholders of record of our common stock as of October 31, 2023.\nIssuer Purchases of Equity Securities\nIn January 2018, our Board of Directors approved an authorization to repurchase up to 10.0 million shares of our common stock. This authorization replaced a prior share repurchase authorization from May 2015. The following table sets forth the purchases of our Companys securities by our Company and any affiliated purchasers within the meaning of Rule 10b-18(a)(3) (17 CFR 240.10b-18(a)(3)) during the fourth quarter of fiscal 2023:\nPeriod Total Number of Shares\nPurchased (1)\nAverage Price Paid per Share (2)\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs Maximum Number that May Yet Be Purchased Under the Plans or Programs\nJuly 1, 2023 to July 31, 2023 80,892 $ 39.19 80,892 5,307,071\nAugust 1, 2023 to August 31, 2023 314,622 $ 38.51 314,622 4,992,449\nSeptember 1, 2023 to September 30, 2023 381,722 $ 38.50 381,772 4,610,677\n(1)There were no shares purchased during the quarter related to the surrender of shares of common stock to our Company to satisfy tax withholding obligations in connection with the vesting of restricted stock equivalents.\n(2)Includes $0.02 per share of brokerage fee commissions.\nDuring fiscal 2023, we repurchased 1,865,353 shares of common stock under the share repurchase authorization from January 2018 for $75.2 million. Future share repurchases, if any, would be made in the open market, privately negotiated transactions or otherwise, in such amounts and at such times as we deem appropriate based upon prevailing market conditions, business needs and other factors.\nDuring fiscal 2023, we repurchased 227,332 shares related to the surrender of shares of common stock to satisfy tax withholding obligations in connection with the vesting of restricted stock equivalent awards.\nDuring the quarter ended September 30, 2023, our executive officers and directors had no equity trading arrangements nor were there any adoptions, terminations, or modifications to a Rule 10b5-1 equity trading plan or any non-Rule 10b5-1 equity trading arrangements as defined in Item 408 of Regulation S-K.\nPerformance Graph\nThe following graph compares the cumulative five-year total return provided to shareholders of the Companys common stock relative to the cumulative total returns of the S&P Midcap 400 index and the S&P Household Products index. An investment of $100 (with reinvestment of all dividends and other distributions) is assumed to have been made in our common stock and in each of the indices on September 30, 2018 and its relative performance is tracked through September 30, 2023. These indices are included only for comparative purposes as required by SEC rules and do not necessarily reflect managements opinion that such indices are an appropriate measure of the relative performance of our common stock. They are not intended to forecast possible future performance of our common stock, nor is our historical common stock price performance necessarily indicative of our future common stock price performance.\n* $100 invested on September 30, 2018 in stock or index, with reinvestment of all dividends. Fiscal year ending September 30.\n.\n9/18 9/19 9/20 9/21 9/22 9/23\nEdgewell Personal Care Company $ 100.00 $ 70.28 $ 60.31 $ 78.52 $ 80.90 $ 79.95\nS&P Midcap 400 $ 100.00 $ 95.84 $ 92.16 $ 130.75 $ 109.11 $ 123.89\nS&P Household Products $ 100.00 $ 135.46 $ 150.26 $ 151.73 $ 132.47 $ 142.05 Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\n(in millions, except per share data)\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Consolidated Financial Statements and the accompanying notes included in this Annual Report on Form 10-K. The fiscal 2022 amounts have been revised to reflect the immaterial revisions described in Item 8 - Note 1 and Note 19, in the notes to our Consolidated Financial Statements. In addition, the fiscal 2023 amounts have been updated from those preliminarily reported in our earnings release, dated November 9, 2023, as a result of the immaterial revisions to both the three-months ended and fiscal year ended September 30, 2023, as described in Item 8 - Note 1. The following discussion may contain forward-looking statements that reflect our plans, estimates and beliefs and involve risks, uncertainties and assumptions. Our actual results could differ materially from those discussed in these forward-looking statements. Factors that could cause or contribute to these differences include those discussed in Item 1A. Risk Factors and Forward-Looking Statements included within this Annual Report on Form 10-K.\nNon-GAAP Financial Measures\nWhile we report financial results in accordance with GAAP, this discussion also includes non-GAAP measures. These non-GAAP measures are referred to as adjusted or organic and exclude certain costs deemed non-recurring in nature. Reconciliations of non-GAAP measures are included within this Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThis non-GAAP information is provided as a supplement to, not as a substitute for, or as superior to, measures of financial performance prepared in accordance with GAAP. We use this non-GAAP information internally to make operating decisions and believe it is helpful to investors because it allows more meaningful period-to-period comparisons of ongoing operating results. Given the various significant events, including restructuring projects and recent acquisitions, we view the use of non-GAAP measures that take into account the impact of these unique events as particularly valuable in understanding our underlying operational results and providing insights into future performance. The information can also be used to perform trend analysis and to better identify operating trends that may otherwise be masked or distorted by the types of items that are excluded. This non-GAAP information is also a component in determining managements incentive compensation. Finally, we believe this information provides more transparency. The following provides additional detail on our non-GAAP measures for the periods presented:\nWe analyze net sales and segment profit on an organic basis to better measure the comparability of results between periods. Organic net sales and organic segment profit exclude the impact of changes in foreign currency and the impact of acquisitions and divestitures:\n◦Organic net sales was unfavorably impacted in fiscal 2022 and 2023 by the Billie Acquisition as sales that were previously reported as third party sales to Billie were included as inter-company sales. Organic net sales for fiscal 2021 was impacted by the Cremo acquisition and the divestiture of the Infant and Pet Care products.\n◦Segment profit was unfavorably impacted in fiscal 2022 as a result of a change in the timing of profit recognition due to the Billie Acquisition. Subsequent to the acquisition of Billie, profit previously earned on sales to Billie was deferred until Billie sold to a third party.\n◦Segment profit will be impacted by fluctuations in translation and transactional foreign currency. The impact of currency was applied to segments using managements best estimate.\nWe utilize adjusted non-GAAP measures including gross profit, SG&A, operating income, income taxes, net earnings, and diluted earnings per share internally to make operating decisions. The following items are excluded when analyzing non-GAAP measures: restructuring and related costs, acquisition and integration costs, Sun Care reformulation, SKU rationalization, pension settlement expense, income from resolution of legal matters, VAT settlement costs, cost of early debt retirement and at times management excludes other costs and income.\nAll comparisons are with the same period in the prior year, unless otherwise noted.\nSignificant Events\nAcquisitions\nOn November 29, 2021, we completed the acquisition of Billie, a leading U.S. based consumer brand company that offers a broad portfolio of personal care products for women, for a purchase price of $309.4, net of cash acquired, utilizing a combination of cash on hand and drawing on our U.S. revolving credit facility maturing in 2025 between the Company and Bank of America, N.A., as administrative agent, and lenders parties thereto (the Revolving Credit Facility). As a result, Billie became a wholly owned subsidiary of the Company. Refer to Note 3 of Notes to the Consolidated Financial Statements for further discussion.\nExecutive Summary\nThe following is a summary of key results for fiscal 2023, 2022 and 2021. Net earnings and diluted earnings per share (EPS) for the time periods presented were impacted by restructuring and related costs, acquisition and integration costs, SKU Rationalization, Sun Care reformulation, income from resolution of legal matters, pension settlement expense, VAT settlement costs, cost of early debt retirement and other costs or income, as described in the table below. The impact of these items on reported net earnings and EPS are provided below as a reconciliation of net earnings and EPS to adjusted net earnings and adjusted diluted EPS, which are non-GAAP measures.\nFiscal 2023\nNet sales in fiscal 2023 increased $79.9, or 3.7%, to $2,251.6, including a net benefit of $12.0 or 0.6% from the acquisition of Billie and a $26.1 or 1.2% unfavorable impact due to currency movements. Organic net sales increased $94.0, or 4.3%, reflecting growth in all segments, as increased pricing was only partly offset by a slight decrease in volumes. International markets increased 6.2%, reflecting both volume and price gains and were driven by strong double digit growth in Sun and Skin Care, and low single digit growth in Wet Shave. North America markets increased 3.3%, with growth in Sun Care, Feminine Care, Grooming and Wet Ones partly offset by a slight decline in Wet Shave.\nNet earnings for fiscal 2023 increased $15.2, or 15.3% to $114.7. On an adjusted basis, net earnings for fiscal 2023 decreased 2.9% to $134.5. Adjusted net earnings decreased primarily due to unfavorable currency movements.\nDiluted net earnings per share during fiscal 2023 was $2.21 compared to earnings of $1.85 in the prior fiscal year. On an adjusted basis, as illustrated in the table below, net earnings per diluted share during fiscal 2023 were $2.59 compared to $2.58 in the prior year.\nYear Ended September 30, 2023\nGross Profit SG&A Operating Income EBIT Income Taxes Net Earnings Diluted EPS\nGAAP - Reported $ 940.8 $ 409.6 $ 227.0 $ 147.7 $ 33.0 $ 114.7 $ 2.21\nRestructuring and related costs 0.2 0.3 17.1 17.1 4.4 12.7 0.24\nAcquisition and integration costs - 7.5 7.5 7.5 1.8 5.7 0.11\nSKU rationalization (1.7) - (1.7) (1.7) (0.4) (1.3) (0.03)\nSun Care reformulation (1)\n(1.4) - 1.9 1.9 0.5 1.4 0.03\nLegal matters, net income - (6.3) (6.3) (6.3) (1.5) (4.8) (0.09)\nPension settlement expense - - - 7.9 2.1 5.8 0.11\nOther costs - 0.4 0.4 0.4 0.1 0.3 0.01\nTotal Adjusted Non-GAAP $ 937.9 $ 407.7 $ 245.9 $ 174.5 $ 40.0 $ 134.5 $ 2.59\nGAAP as a percent of net sales 41.8 % 18.2 % 10.1 % GAAP effective tax rate 22.3 %\nAdjusted as a percent of net sales 41.7 % 18.1 % 10.9 % Adjusted effective tax rate 23.0 %\n(1) Also includes pre-tax research and development (R&D) costs of $3.3 related to the reformulation, recall, and destruction of certain Sun Care products\nYear Ended September 30, 2022\nGross Profit SG&A Operating Income EBIT Income Taxes Net Earnings Diluted EPS\nGAAP - Reported $ 880.5 $ 389.1 $ 182.3 $ 124.1 $ 24.6 $ 99.5 $ 1.85\nRestructuring and related costs 0.1 0.8 16.2 16.2 4.2 12.0 0.23\nAcquisition and integration costs 0.8 9.1 9.9 9.9 1.3 8.6 0.16\nSKU rationalization 22.5 - 22.5 22.5 5.5 17.0 0.32\nSun Care reformulation 3.5 - 4.6 4.6 1.2 3.4 0.06\nLegal matters, net income expense - (7.5) (7.5) (7.5) (1.8) (5.7) (0.11)\nValue-added tax settlement costs - 3.4 3.4 3.4 1.1 2.3 0.04\nPension settlement expense - - - 1.8 0.4 1.4 0.03\nTotal Adjusted Non-GAAP $ 907.4 $ 383.3 $ 231.4 $ 175.0 $ 36.5 $ 138.5 $ 2.58\nGAAP as a percent of net sales 40.5 % 17.9 % 8.4 % GAAP effective tax rate 19.9 %\nAdjusted as a percent of net sales 41.8 % 17.6 % 10.7 % Adjusted effective tax rate 20.9 %\nYear Ended September 30, 2021\nGross Profit SG&A Operating Income EBIT Income Taxes Net Earnings Diluted EPS\nGAAP - Reported $ 951.2 $ 391.2 $ 239.9 $ 147.1 $ 29.3 $ 117.8 $ 2.13\nRestructuring and related charges 0.6 8.7 30.1 30.1 7.5 22.6 0.41\nAcquisition and integration costs 1.3 7.1 8.4 8.4 2.1 6.3 0.12\nSun Care reformulation 1.1 - 1.1 1.1 0.3 0.8 0.01\nCost of early retirement of long-term debt - - - 26.1 6.4 19.7 0.36\nUK tax rate increase - - - - (0.3) 0.3 -\nTotal Adjusted Non-GAAP $ 954.2 $ 375.4 $ 279.5 $ 212.8 $ 45.3 $ 167.5 $ 3.03\nGAAP as a percent of net sales 45.6 % 18.7 % 11.5 % GAAP effective tax rate 19.8 %\nAdjusted as a percent of net sales 45.7 % 18.0 % 13.4 % Adjusted effective tax rate 21.2 %\nFor further discussion of these items refer to Note 18 of Notes to Consolidated Financial Statements.\nOperating Results\nThe following table presents changes in net sales for fiscal 2023 and 2022, as compared to the corresponding prior year period, and provides a reconciliation of organic net sales to reported amounts.\nNet Sales\nNet Sales - Total Company\nFor the Years Ended September 30,\n2023 %Chg 2022 %Chg\nNet sales - prior year $ 2,171.7 $ 2,087.3\nOrganic 94.0 4.3 % 80.4 3.9 %\nImpact of Billie acquisition, net 12.0 0.6 % 74.9 3.6 %\nImpact of currency (26.1) (1.2) % (70.9) (3.5) %\nNet sales - current year $ 2,251.6 3.7 % $ 2,171.7 4.0 %\nFor fiscal 2023, net sales were $2,251.6, an increase of $79.9, or 3.7%, including a net benefit of $12.0 or 0.6% from the acquisition of Billie and a $26.1, or 1.2% unfavorable impact due to currency movements. Organic net sales increased $94.0, or 4.3%, reflecting growth in all segments, as increased pricing was only partially offset by a slight decrease in volumes. International markets increased 6.2%, driven by strong double digit growth in Sun and Skin Care and a low single digit growth\nin Wet Shave. North America markets increased 3.3%, with growth in Sun Care, Feminine Care, Grooming and Wet Ones partially offset by a slight decline in Wet Shave.\nFor further discussion regarding net sales, including a summary of reported versus organic changes, see Segment Results.\nGross Profit\nGross profit was $940.8 in fiscal 2023, as compared to $880.5 in fiscal 2022, an increase of $60.3, or 6.8%, including a $33.7 unfavorable impact from currency movements. Gross margin as a percent of net sales for fiscal 2023 was 41.8% compared to 40.5% in the prior year period. Contributing to the increase were higher sales and the absence of a $22.5 charge within Cost of products sold in the prior year period for the write-off of inventory for certain Wet Ones SKUs and a related contract termination charge. Adjusted gross margin as a percent of net sales was 41.7% compared to 41.8% in the prior year period. The decrease of 10-basis points as productivity savings of 230-basis points and the benefit from higher pricing of 305-basis points were more than offset by gross inflationary pressures of approximately 400-basis points and 55-basis points of negative mix.\nSelling, General and Administrative Expense\nSG&A was $409.6, or 18.2%, of net sales in fiscal 2023 compared to $389.1, or 17.9%, of net sales in the prior year period primarily due to higher people costs and travel expenses. Adjusted SG&A as a percent of net sales was 18.1%, an increase of 50-basis points, as higher incentive compensation, people costs and travel expense was only partially offset by the benefits of leverage, savings from ongoing operational efficiency programs and favorable currency movements.\nAdvertising and Sales Promotion Expense\nFor fiscal 2023, A&P was $229.1, down $9.2, or 3.9%, compared to fiscal 2022. A&P as a percent of net sales was 10.2% for fiscal 2023, compared with 11.0% in fiscal 2022. The decrease in A&P was primarily due to lower media spend and agency fees partially offset by higher investment in Feminine Care.\nResearch and Development Expense\nResearch and development expense (R&D) was $58.5 in fiscal 2023, an increase of $3.0, or 5.4%, compared to the prior year. As a percent of net sales, R&D remained flat at 2.6%.\nInterest Expense Associated with Debt\nInterest expense associated with debt for fiscal 2023 was $78.5, an increase of $7.1, or 9.9%, as compared to $71.4 in fiscal 2022. The increase in interest expense was the result of higher interest rates and a higher overall debt balance on the Companys Revolving Credit Facility compared to fiscal 2022.\nOther Expense (income), Net\nOther expense (income), net was income of $0.8 in fiscal 2023 compared to income of $13.2 in fiscal 2022, which included currency hedge and remeasurement gains of $12.7 in fiscal 2023 compared to $11.5 in fiscal 2022. Current year expense includes higher accounts receivable factoring costs, higher pension expense in the current year, including the loss on the settlement of the Canada Plan of $7.9 compared to a pension benefit in the prior year.\nIncome Tax Provision\nIncome taxes, which include federal, state and foreign taxes, were 22.3% and 19.9% of Earnings before income taxes in fiscal 2023 and 2022, respectively. On an adjusted basis, the effective tax rate for fiscal 2023 was 23.0% compared to 20.9% in the prior year. The fiscal 2023 effective tax rate reflects an unfavorable mix of earnings in low tax jurisdictions with an increase in valuation allowances partially offset by favorable discrete items including the impact of a change in our prior estimates.\nOur effective tax rate is highly sensitive to the mix of countries from which earnings or losses are derived. Declines in earnings in lower tax rate jurisdictions, earnings increases in higher tax rate jurisdictions, or repatriation of foreign earnings or operating losses in the future could increase future tax rates. Additionally, adjustments to prior year tax provision estimates could increase or decrease future tax provisions.\nOperating Model Redesign\nIn fiscal 2023, the Company is continuing to strengthen its operating model, simplify the organization and improve manufacturing and supply chain efficiency. As a result of these actions, we incurred charges of approximately $17.1 in fiscal 2023, primarily related to employee severance, project implementation and other exit costs.\nSegment Results\nSegment performance is evaluated based on segment profit, exclusive of general corporate expenses, share-based compensation costs, amortization of intangible assets, and costs associated with restructuring charges, acquisition and integration costs, SKU rationalization, and other non-standard expenses. The exclusion of such changes from segment results reflects managements view on how it evaluates segment performance. Financial items, such as interest income and expense, are managed on a global basis at the corporate level.\nOur operating model includes some shared business functions across the segments, including product warehousing and distribution, transaction processing functions and, in most cases, a combined sales force and management teams. We apply a fully allocated cost basis, in which shared business functions are allocated between the segments on a percentage of net sales basis. Such allocations are estimates and do not represent the costs of such services if performed on a stand-alone basis.\nThe following tables present changes in segment net sales and segment profit for fiscal 2023 and 2022, as compared to the corresponding prior year periods, and also provide a reconciliation of organic segment net sales and organic segment profit to reported amounts. For a reconciliation of Segment profit to Earnings before income taxes, see Note 18 of Notes to Consolidated Financial Statements. Net sales and segment profit activity related to Billie products were included in the Wet Shave segment for the post-acquisition period.\nWet Shave\nNet Sales - Wet Shave\nFor the Years Ended September 30,\n2023 %Chg 2022 %Chg\nNet sales - prior year $ 1,242.5 $ 1,215.9\nOrganic 0.6 - % 14.3 1.2 %\nImpact of Billie acquisition, net 12.0 1.0 % 74.9 6.2 %\nImpact of currency (24.2) (1.9) % (62.6) (5.2) %\nNet sales - current year $ 1,230.9 (0.9) % $ 1,242.5 2.2 %\nWet Shave net sales for fiscal 2023 was $1,230.9, a decrease of $11.6, or 0.9%, as compared to the prior year period, including $24.2 or 1.9% decline due to unfavorable impact from currency, partially offset by an increase of $12.0, or 1.0%, from the Billie Acquisition. Organic net sales were flat with an increase of $0.6, or 0.0%. Organic net sales were primarily impacted by increases in Womens Systems, Disposables, and Mens Shave Preps, offset by declines in Mens Systems and Womens Shave Preps. Organic net sales in International markets increased 1.2% compared to declines in North America of 1.1%.\nSegment Profit - Wet Shave\nFor the Years Ended September 30,\n2023 %Chg 2022\nSegment profit - prior year $ 174.5 $ 221.5\nOrganic 9.3 5.3 % (21.2) (9.5) %\nImpact of Billie acquisition, net - - % (6.8) (3.1) %\nImpact of currency (25.5) (14.6) % (19.0) (8.6) %\nSegment profit - current year $ 158.3 (9.3) % $ 174.5 (21.2) %\nWet Shave segment profit for fiscal 2023 was $158.3, a decrease of $16.2, or 9.3%. Organic segment profit increased $9.3, or 5.3% primarily driven by growth in International markets and was partially offset by unfavorable impact from currency.\nSun and Skin Care\nNet Sales - Sun and Skin Care\nFor the Years Ended September 30,\n2023 %Chg 2022 %Chg\nNet sales - prior year $ 638.5 $ 585.3\nOrganic 68.1 10.7 % 61.4 10.5 %\nImpact of currency (1.1) (0.2) % (8.2) (1.4) %\nNet sales - current year $ 705.5 10.5 % $ 638.5 9.1 %\nSun and Skin Care net sales for fiscal 2023 was $705.5, an increase of $67.0, or 10.5%. Organic net sales increased $68.1, or 10.7%, with organic net sales in International markets increasing 29.9% with the impact of favorable pricing and higher volumes. North America markets increased 5.8% with strong growth with favorable volumes in Grooming and Wet Ones and favorable pricing in Sun Care.\nSegment Profit - Sun and Skin Care\nFor the Years Ended September 30,\n2023 %Chg 2022 %Chg\nSegment profit - prior year $ 108.8 $ 99.0\nOrganic 28.7 26.4 % 11.4 11.5 %\nImpact of currency (0.1) (0.1) % (1.6) (1.6) %\nSegment profit - current year $ 137.4 26.3 % $ 108.8 9.9 %\nSun and Skin Care segment profit for fiscal 2023 was $137.4, an increase of $28.6, or 26.3%. Organic segment profit increased $28.7, or 26.4% driven by increased net sales and gross margin from favorable volumes of Sun Care products and Grooming, partially offset by higher commodity costs.\nFeminine Care\nNet Sales - Feminine Care\nFor the Years Ended September 30,\n2023 %Chg 2022 %Chg\nNet sales - prior year $ 290.7 $ 286.1\nOrganic 25.3 8.7 % 4.7 1.6 %\nImpact of currency (0.8) (0.3) % (0.1) - %\nNet sales - current year $ 315.2 8.4 % $ 290.7 1.6 %\nFeminine Care net sales for fiscal 2023 was $315.2, an increase of $24.5, or 8.4%. Organic segment net sales increased $25.3, or 8.7%, with growth in North America markets of 8.0% driven largely by pricing.\nSegment Profit - Feminine Care\nFor the Years Ended September 30,\n2023 %Chg 2022 %Chg\nSegment profit - prior year $ 31.5 $ 37.5\nOrganic 19.2 61.0 % (5.9) (15.7) %\nImpact of currency (1.0) (3.2) % (0.1) (0.3) %\nSegment profit - current year $ 49.7 57.8 % $ 31.5 (16.0) %\nFeminine Care segment profit for fiscal 2023 was $49.7, an increase of $18.2, or 57.8%. The increase is primarily due to favorable pricing offset by higher marketing expense.\nGeneral Corporate and Other Expenses\nFiscal Year\n2023 2022\nGeneral corporate and other expenses $ (68.7) $ (54.0)\nRestructuring and related costs (17.1) (16.2)\nAcquisition and integration planning costs (7.5) (9.9)\nSKU rationalization 1.7 (22.5)\nSun Care reformulation (1.9) (4.6)\nLegal matters, net income 6.3 7.5\nValue- added tax settlement costs - (3.4)\nPension settlement expense (7.9) (1.8)\nOther (0.4) -\nGeneral corporate and other expenses $ (95.5) $ (104.9)\n% of net sales (4.2) % (4.8) %\nFor fiscal 2023, general corporate expenses were $68.7, an increase of $14.7 as compared to fiscal 2022.\nIn fiscal 2022, we recorded a charge of $22.5 relating to the write-off of inventory and related contract termination charges associated with a third-party co-manufacturer. During fiscal 2023, the Company released a reserve of $1.7 related to certain accrued expenses associated with the write-off of inventory for certain Wet Ones SKUs. This charge was included in Cost of products sold in the Consolidated Statements of Earnings and Comprehensive Income.\nIn fiscal 2023, the Company recorded a charge of $7.9 related to the wind-up of its Canadian defined benefit pension plan. For further information see Note 12 of Notes to Consolidated Financial Statements.\nIn fiscal 2022, the Company took specific actions to strengthen our operating model, simplify our organization and improve manufacturing and supply chain efficiency and productivity. As a result of these actions, we incurred restructuring and related costs of $17.1 and $16.2 during fiscal 2023 and fiscal 2022, respectively, primarily related to employee severance, project implementation and other exit benefit costs.\nLiquidity and Capital Resources\nAt September 30, 2023, we had cash of $216.4, a portion which was located outside the U.S. Given our extensive international operations, a significant portion of our cash is denominated in foreign currencies. Refer to Note 16 of Notes to Consolidated Financial Statements for a discussion of the primary currencies to which the Company is exposed. We manage our worldwide cash requirements by reviewing available funds among the many subsidiaries through which we conduct business and the cost effectiveness with which those funds can be accessed. We generally repatriate a portion of current year earnings from select non-U.S. subsidiaries only if the economic cost of the repatriation is not considered material.\nOur cash is deposited with multiple counterparties which consist of major financial institutions. We consistently monitor positions with, and credit ratings of, counterparties both internally and by using outside ratings agencies.\nOur total borrowings as of September 30, 2023 and 2022 were as follows:\nInterest Type Currency September 30,\n2023 September 30,\nLong-term notes fixed USD $ 1,250.0 $ 1,250.0\nRevolver loans borrowed under credit facility variable USD 122.0 155.0\nShort-term notes payable variable various 19.5 19.0\nTotal borrowings $ 1,391.5 $ 1,424.0\nOur Revolver utilization is summarized below.\nSeptember 30,\n2023 September 30,\nTotal Revolver Capacity $ 425.0 $ 425.0\nLess: Revolver Borrowings 122.0 155.0\nLess: Outstanding Letters of Credit 5.9 6.5\nRevolver Balance Available $ 297.1 $ 263.5\nOn February 6, 2023, we amended our Revolving Credit Facility to transition from using the London Interbank Offered Rate (LIBOR) to the Secured Overnight Financing Rate (SOFR) as LIBOR is no longer available as of June 30, 2023.\nEffective February 7, 2022, we increased the maximum receivables sold facility amount under the Sixth Amendment to Master Accounts Receivable Purchase Agreement to $180.0 from $150.0. Refer to Note 10 of Notes to the Consolidated Financial Statements for further discussion on our $180.0 uncommitted master accounts receivable purchase agreement with The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch, as the purchaser (the Accounts Receivable Facility).\nOn August 5, 2022, we entered into the Master Receivable Assignment Agreement (the \"Japan Agreement\"). The Japan Agreement was between Schick Japan K.K. and Concerto Receivables Corporation (the Purchaser), Tokyo Branch, a subsidiary of MUFG Bank, LTD., which allows us to assign third party accounts receivable to the Purchaser. The Japan Agreement allows for the sale of up to ¥3,000 (approximately $20.0 using the exchange rate as of September 30, 2023) with limits set between individual customers. The terms of the agreement expire one year after the date of execution and will be renewed annually unless either party notifies of its intent not to renew. The assigned receivables will be discounted using the funding rate from the Tokyo Interbank Market plus 1.1%.\nHistorically, we have generated, and expect to continue to generate, favorable cash flows from operations. Our cash flows are affected by the seasonality of our Sun Care business, typically resulting in higher net sales and increased cash generated in the second and third quarter of each fiscal year. We believe our cash on hand, cash flows from operations and borrowing capacity under the Revolving Credit Facility will be sufficient to satisfy our future working capital requirements, interest payments, R&D activities, capital expenditures, and other financing requirements for at least the next 12 months. We will continue to monitor our cash flows, spending and liquidity needs.\nShort-term financing needs primarily consist of working capital requirements and interest payments on our long-term debt. Long-term financing needs will depend largely on potential growth opportunities, including acquisition activity and repayment or refinancing of our long-term debt obligations. Our long-term liquidity may be influenced by our ability to borrow additional funds, renegotiate existing debt, and raise equity under terms that are favorable to us. We may, from time-to-time, seek to repurchase shares of our common stock. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors.\nIn fiscal 2024, we expect our total capital expenditures to be in the range of $55 to $65 primarily on maintenance and productivity efforts across manufacturing facilities, new product development and information technology system enhancements. While we intend to fund these capital expenditures with cash generated from operations, we may also utilize our borrowing facilities.\nDuring fiscal 2023, we did not make any contributions to our pension and postretirement plans. Due to the election of certain terms of the American Rescue Plan Act, we were not required to make any cash contributions to our pension and postretirement plans in fiscal 2023. Pension contributions required beyond fiscal 2024 represent future pension payments to comply with local funding requirements in the U.S. only. The projected contributions for the U.S. pension plans total $7.0 in fiscal 2024, $9.2 in fiscal 2025, $10.4 in fiscal 2026, $10.2 in fiscal 2027, and $10.1 in fiscal 2028. Estimated contributions beyond fiscal 2028 are not determinable. The Company may also elect to make discretionary contributions.\nDebt Covenants\nThe Revolving Credit Facility governing our outstanding debt at September 30, 2023 contains certain customary representations and warranties, financial covenants, covenants restricting our ability to take certain actions, affirmative covenants, and provisions relating to events of default. Under the terms of the Revolving Credit Facility, the ratio of our indebtedness to our earnings before interest, taxes, depreciation and amortization (EBITDA), as defined in the agreement and detailed below, cannot be greater than 4.0 to 1.0, however, there is an exception for acquisition activity. In addition, under the Revolving Credit Facility, the ratio of our EBITDA to total interest expense must exceed 3.0 to 1.0. If we fail to comply with these covenants or with other requirements of the Revolving Credit Facility, the lenders may have the right to accelerate the maturity of the debt. Acceleration under one of our facilities would trigger cross-defaults on our other borrowings. Under the Revolving Credit Facility, EBITDA is defined as net earnings, as adjusted to add-back interest expense, income taxes, depreciation and amortization, all of which are determined in accordance with GAAP. In addition, the Revolving Credit Facility allows certain non-cash charges such as stock award amortization and asset write-offs including, but not limited to, impairment and accelerated depreciation, and operating expense reductions or synergies to be added-back in determining EBITDA for purposes of the indebtedness ratio. Total debt and interest expense are calculated in accordance with GAAP.\nAs of September 30, 2023, we were in compliance with the provisions and covenants associated with the Revolving Credit Facility.\nCash Flows\nA summary of our cash flow from operating, investing and financing activities is provided in the following table:\nFiscal Year\n2023 2022\nNet cash from (used by):\nOperating activities $ 216.1 $ 102.0\nInvesting activities (50.5) (355.4)\nFinancing activities (146.5) (17.6)\nEffect of exchange rate changes on cash 8.6 (19.5)\nNet increase (decrease) in cash and cash equivalents $ 27.7 $ (290.5)\nOperating Activities\nCash flow from operating activities was $216.1 in fiscal 2023, as compared to $102.0 in fiscal 2022. The increase in fiscal 2023 was driven by favorable changes in working capital and increased earnings.\nInvesting Activities\nCash flow used by investing activities was $50.5 in fiscal 2023 as compared to $355.4 in fiscal 2022. Capital expenditures were $49.5 during fiscal 2023, compared to $56.4 in the prior year period. In fiscal 2022, we completed the Billie acquisition for $309.4, net of cash acquired.\nFinancing Activities\nNet cash used by financing activities was $146.5 in fiscal 2023 as compared to $17.6 in fiscal 2022. During the fiscal 2023, we had net repayments of $33.0 under the Revolving Credit Facility, compared to net borrowings of $155.0 in the prior year\nperiod. During fiscal 2023, we repurchased $75.2 of our common stock under our 2018 Board authorization to repurchase our common stock (the Repurchase Plan) compared to $125.3 in the prior year period. Dividend payments totaled $31.5 in fiscal 2023, compared to $32.6 in the prior year period. We had financing outflows for employee equity awards held for taxes totaling $9.0 in fiscal 2023, compared to $10.7 in the prior year period.\nIn January 2018, our Board approved an authorization to repurchase up to 10.0 shares of our common stock. This authorization replaced a prior share repurchase authorization from May 2015. During fiscal 2023, we repurchased 1.9 shares of our common stock for $75.2. We have 4.6 shares remaining available for purchase under the January 2018 Board authorization.\nSince September 30, 2023, we repurchased 0.1 shares of common stock for $3.5. There are 4.5 common shares remaining available to be purchased.\nDividends\nThe following is a summary of cash dividends paid and declared per share on the Companys Common Stock during the year ended September 30, 2023\nDate Declared Record Date Payable Date Amount Per Share\nJuly 29, 2022 September 2, 2022 October 5, 2022 $ 0.15\nNovember 3, 2022 November 29, 2022 January 4, 2023 $ 0.15\nFebruary 3, 2023 March 8, 2023 April 5, 2023 $ 0.15\nMay 8, 2023 June 7, 2023 July 6, 2023 $ 0.15\nAugust 1, 2023 September 7, 2023 October 4, 2023 $ 0.15\nOn November 2, 2023, the Board declared a quarterly cash dividend of $0.15 per common share for the third fiscal quarter of 2023. The dividend will be paid on January 4, 2024 to shareholders of record as the close of business on December 6, 2023.\nDividends declared during fiscal 2023 totaled $31.7. Payments made for dividends during fiscal 2023 totaled $31.5.\nInflation\nManagement recognizes that inflationary pressures may have an adverse effect on our company through higher material, labor and transportation costs, asset replacement costs and related depreciation, healthcare and other costs. We continued to navigate the challenging and uncertain inflationary environment and resultant cost pressure with a combination of productivity efforts to achieve efficiencies and lower costs to our Cost of products sold and SG&A expenses and increase focus on revenue management. We can provide no assurance that such mitigation will be available in the future.\nSeasonality\nCustomer orders for sun care products within our Sun and Skin Care segment are highly seasonal. This has historically resulted in higher sun care sales to retailers during the late winter through mid-summer months. Within our Wet Shave segment, sales of womens products are moderately seasonal, with increased consumer demand in the spring and summer months. See Our business is subject to seasonal volatility in Item 1A. Risk Factors.\nForeign Currency\nCertain net sales and costs of our international operations are denominated in the local currency of the respective countries. As such, sales and profits from these subsidiaries may be impacted by fluctuations in the value of these local currencies relative to the U.S. dollar. We also have significant intercompany financing arrangements that may result in gains and losses in our results of operations. In an effort to mitigate the impact of currency exchange rate effects, we may hedge certain operational and intercompany transactions; however, our hedging strategies may not fully offset gains and losses recognized in our results of operations.\nCommitments and Contingencies\nLegal Proceedings\nDuring fiscal 2023, the Company settled a legal matter which resulted in a gain of $4.9 related to an intellectual property claim against a third party. This was included in selling, general and administrative (SG&A) in the Consolidated Statements of Earnings and Comprehensive Income. The Company received payment for the intellectual property claim settlement during fiscal 2023.\nAdditionally, during fiscal 2023, the Company received a favorable court ruling regarding an international VAT matter, which the plaintiff has no ability to appeal. As the Company had previously recorded an accrual for this matter, based on its best estimate of the facts and circumstances at that time, the result of the favorable court ruling was a release of the reserve established which resulted in a gain of $2.2. This was included in SG&A in the Consolidated Statements of Earnings and Comprehensive Income.\nDuring fiscal 2022 the Company settled certain legal matters which resulted in a gain of $7.5 related to intellectual property claims against a third party. This was included in SG&A in the Consolidated Statements of Earnings and Comprehensive Income. The Company received payment for the settlement in fiscal 2022.\nWe are subject to a number of legal proceedings in various jurisdictions arising out of our operations during the ordinary course of business. Many of these legal matters are in preliminary stages and involve complex issues of law and fact and may proceed for protracted periods of time. The amount of liability, if any, from these proceedings cannot be determined with certainty. We review legal proceedings and claims, regulatory reviews and inspections and other legal proceedings on an ongoing basis and follows appropriate accounting guidance when making accrual and disclosure decisions. We establish accruals for those contingencies when the incurrence of a loss is probable and can be reasonably estimated and discloses the amount accrued and the amount of a reasonably possible loss in excess of the amount accrued if such disclosure is necessary for its financial statements to not be misleading. We do not record liabilities when the likelihood that the liability has been incurred is probable, but the amount cannot be reasonably estimated. Based upon present information, we believe that its liability, if any, arising from such pending legal proceedings, asserted legal claims, and known potential legal claims which are likely to be asserted, is not reasonably likely to be material to its financial position, results of operations or cash flows, when taking into account established accruals for estimated liabilities.\nContractual Obligations\nWe have significant contractual obligations to fulfill our business operations including the repayment of short and long term debt, periodic interest payments, minimum levels of pension funding, and other obligations including payments for various leases of real estate, vehicles, and equipment, and minimum fixed costs to be paid to third party logistics vendors. We are also party to various service and supply contracts that generally extend one to three months. These arrangements are primarily individual, short-term purchase orders for routine goods and services at market prices, which are part of our normal operations and are reflected in historical operating cash flow trends. These contracts can generally be canceled at our option at any time. We do not believe such arrangements will adversely affect our liquidity position. In addition, we have various commitments related to service and supply contracts that contain penalty provisions for early termination. Because of the short period between order and shipment date (generally less than one month) for most of our orders, the dollar amount of current backlog is not material and is not considered to be a reliable indicator of future sales volume. Generally, sales to our top customers are made pursuant to purchase orders and we do not have supply agreements or guarantees of minimum purchases from them. As a result, these customers may cancel their purchase orders or reschedule or decrease their level of purchases from us at any time. As of September 30, 2023, we do not believe such purchase arrangements or termination penalties will have a significant effect on our results of operations, financial position or liquidity position in the future.\nEnvironmental Matters\nOur operations, like those of other companies, are subject to various federal, state, local and foreign laws and regulations intended to protect public health and the environment. These regulations relate primarily to worker safety, air and water quality, underground fuel storage tanks, and waste handling and disposal. Accrued environmental costs at September 30, 2023 were $9.3. It is difficult to quantify with reasonable certainty the cost of environmental matters, particularly remediation and future capital expenditures for environmental control equipment. Total environmental capital expenditures and operating expenses are not expected to have a material effect on our total capital and operating expenditures, consolidated earnings or competitive position. However, current environmental spending estimates could be modified as a result of changes in our plans or our understanding of underlying facts, changes in legal requirements, including any requirements related to global climate change, or other factors.\nCritical Accounting Policies\nThe methods, estimates and judgments we use in applying our most critical accounting policies have a significant impact on the results we report in our consolidated financial statements. Specific areas, among others, requiring the application of managements estimates and judgment include assumptions pertaining to accruals for consumer and trade promotion programs, pension and postretirement benefit costs, share-based compensation, future cash flows associated with impairment testing of goodwill and other long-lived assets, uncertain tax positions, the reinvestment of undistributed foreign earnings and tax valuation allowances. On an ongoing basis, we evaluate our estimates, but actual results could differ materially from those estimates.\nOur most critical accounting policies are revenue recognition, pension and other postretirement benefits, the valuation of long-lived assets (including property, plant and equipment), income taxes (including uncertain tax positions) and valuation related to acquisitions, goodwill and intangible assets. A summary of our significant accounting policies is contained in Note 2 of Notes to Consolidated Financial Statements. This listing is not intended to be a comprehensive list of all of our accounting policies.\nRevenue Recognition\nWe derive revenue from the sale of our products. Revenue is recognized when the customer obtains control of the goods, which occurs when the ability to use and obtain benefits from the goods are passed to the customer, most commonly upon the delivery of the goods. Discounts are offered to customers for early payment, and an estimate of the discounts is recorded as a reduction of Net sales in the same period as the sale. Our standard sales terms are final and returns or exchanges are not permitted with the exception of end of season returns for Sun Care products, as detailed below. Reserves are established and recorded in cases where the right of return does exist for a particular sale.\nWe assess the contractual obligations in customers purchase orders and identify performance obligations related to the transferred goods (or a bundle of goods) that are distinct. To identify the performance obligations, we consider all the goods promised, whether explicitly stated or implied based on customary business practices. Our purchase orders are short term in nature, lasting less than one year, and contain a single delivery element. For a purchase order that has more than one performance obligation, we allocate the total consideration to each distinct performance obligation on a relative stand-alone selling price basis. We do not exclude variable consideration in determining the remaining value of performance obligations.\nWe record sales at the time that control of goods passes to the customer. The terms of these sales vary, but, in all instances, the following conditions are met: (1) the sales arrangement is evidenced by purchase orders submitted by customers; (2) the selling price is fixed or determinable; (3) title to the product has transferred; (4) there is an obligation to pay at a specified date without any additional conditions or actions required by us; and (5) collectability is reasonably assured. Simultaneously with the sale, we reduce Net sales and Cost of products sold and reserve amounts on the Consolidated Balance Sheet for anticipated returns based upon an estimated return level in accordance with GAAP. Customers are required to pay for the Sun Care product purchased during the season under the required terms. Under certain circumstances, we allow customers to return Sun Care products that have not been sold by the end of the Sun Care season, which is normal practice in the Sun Care industry. The timing of returns of Sun Care products can vary in different regions, based on climate and other factors. However, the majority of returns occur in the U.S. from September through January, following the summer Sun Care season. We estimate the level of Sun Care returns as the Sun Care season progresses, using a variety of inputs including historical experience, consumption trends during the Sun Care season, obsolescence factors including expiration dates and inventory positions at key retailers. We monitor shipment activity and inventory levels at key retailers during the season in an effort to more accurately estimate potential returns. This allows us to manage shipment activity to our customers, especially in the latter stages of the Sun Care season, to reduce the potential for returned product. The level of returns may fluctuate from our estimates due to several factors, including, but not limited to, weather conditions, customer inventory levels and competitive activity. Based on our fiscal 2023 Sun Care shipments, each percentage point change in our returns rate would have impacted our reported net sales by $2.5 and our reported operating income by $2.4. At September 30, 2023 and 2022, our reserve on the Consolidated Balance Sheet for returns was $53.5 and $47.5 respectively.\nWe offer a variety of programs, primarily to our retail customers, designed to promote sales of our products. Such programs require periodic payments and allowances based on estimated results of specific programs and are recorded as a reduction to net sales. We accrue, at the time of sale, the estimated total payments and allowances associated with each transaction. Additionally, we offer programs directly to consumers to promote the sale of our products. Promotions which reduce the ultimate consumer sale prices are recorded as a reduction of net sales at the time the promotional offer is made, generally using estimated redemption and participation levels. Taxes we collect on behalf of governmental authorities, which are generally included in the price to the customer, are also recorded as a reduction of net sales.\nWe continually assess the adequacy of accruals for customer and consumer promotional program costs not yet paid. To the extent total program payments differ from estimates, adjustments may be necessary. Historically, these adjustments have not been material to annual results.\nPension Plans and Other Postretirement Benefits\nThe determination of our obligation and expense for pension and other postretirement benefits is dependent on certain assumptions developed by us and used by actuaries in calculating such amounts. Assumptions include, among others, the discount rate, the expected long-term rate of return on plan assets, and future salary increases, where applicable. Actual results that differ from assumptions made are recognized on the balance sheet and subsequently amortized to earnings over future periods. Significant differences in actual experience or significant changes in macroeconomic conditions resulting in changes to assumptions may materially affect pension and other postretirement obligations. In determining the discount rate, we use the yield on high-quality bonds that coincide with the cash flows of our plans estimated payouts. For our U.S. plans, which represent our most significant obligations, we use the Mercer yield curve in determining the discount rates.\nWe utilize a spot discount rate approach to estimate service and interest components of net periodic benefit cost for our pension benefits. The spot discount rate approach applies the specific spot rates along the yield curve used in the determination of the benefit obligation to the relevant projected cash flows and is a more precise application of the yield curve spot rates used in the traditional single discount rate approach.\nOf the assumptions listed above, changes in the expected long-term rate of return on plan assets and changes in the discount rate used in developing plan obligations will likely have the most significant impact on our annual earnings, prospectively. Based on plan assets at September 30, 2023, a one percentage point decrease or increase in expected asset returns would increase or decrease our pension expense by approximately $4.0. In addition, it may increase and accelerate the rate of required pension contributions in the future. Uncertainty related to economic markets and the availability of credit may produce changes in the yields on corporate bonds rated as high-quality. As a result, discount rates based on high-quality corporate bonds may increase or decrease, leading to lower or higher pension obligations, respectively. A one percentage point decrease in the discount rate would increase pension obligations by approximately $41.8 at September 30, 2023.\nAs allowed under GAAP, our U.S. qualified pension plan uses market related value, which recognizes market appreciation or depreciation in the portfolio over five years, thereby reducing the short-term impact of market fluctuations.\nWe have historically provided defined benefit pension plans to our eligible employees, former employees and retirees. We fund our pension plans in compliance with the Employee Retirement Income Security Act of 1974 or local funding requirements.\nFurther detail on our pension and other postretirement benefit plans is included in Note 12 of Notes to Consolidated Financial Statements.\nShare-Based Compensation\nWe award restricted stock equivalents (RSE), which generally vest over a range of two to four years. The fair value of each grant is estimated on the date of grant based on the current market price of our shares of common stock.\nWe also award performance restricted stock equivalents (PRSE) which may provide for the issuance of common stock to certain managerial staff and executive management if specified performance or market targets are achieved. The recipient of the PRSE award may earn a total award ranging from 0% to 200% of the target award.\nFor PRSE awards with performance conditions, the fair value of each grant is estimated on the date of grant based on the current market price of our shares of common stock. The total amount of compensation expense recognized reflects the initial assumption that target performance goals will be achieved. Compensation expense may be adjusted during the life of the performance grant based on managements assessment of the probability that performance goals will be achieved. If such goals are not met or it is determined that achievement of performance goals is not probable, compensation expense is adjusted to reflect the reduced expected payout level. If it is determined that the performance goals will be exceeded, additional compensation expense is recognized.\nFor PRSE awards based on market conditions, the fair value is estimated on the grant date using a Monte Carlo simulation. The payout for PRSE awards with market conditions are assessed by comparing our total shareholder return (TSR) during a certain three year period to the respective TSRs of companies in a selected performance peer group.\nNon-qualified stock options (share options) are granted at the market price of our common stock on the grant date and generally vest ratably over three years. We calculate the fair value of total share-based compensation for share options using the Black-Scholes option pricing model, which utilizes certain assumptions and estimates that have a material impact on the amount of total compensation cost recognized in our consolidated financial statements, including the expected term, expected stock price volatility, risk-free interest rate and expected dividends. The original estimate of the grant date fair value is not subsequently revised unless the awards are modified or there is a change in the number of awards expected to forfeit prior to vesting.\nFurther detail on Share-Based Payments is included in Note 13 of Notes to Consolidated Financial Statements.\nValuation of Long-Lived Assets\nWe periodically evaluate our long-lived assets, including property, plant and equipment, goodwill, and intangible assets, for potential impairment indicators. Judgments regarding the existence of impairment indicators, including lower than expected cash flows from acquired businesses, are based on legal factors, market conditions and operational performance. Future events could cause us to conclude that impairment indicators exist. We estimate fair value using valuation techniques such as discounted cash flows. This requires management to make assumptions regarding future income, working capital, and discount rates, which would affect the impairment calculation.\nIncome Taxes\nOur annual effective income tax rate is determined based on our income, statutory tax rates and the tax impacts of items treated differently for tax purposes than for financial reporting purposes. Tax law requires certain items to be included in the tax return at different times than the items reflected in the financial statements. Some of these differences are permanent, such as expenses that are not deductible in our tax return, and some differences are temporary, reversing over time, such as depreciation expense. These temporary differences create deferred tax assets and liabilities.\nDeferred tax assets generally represent the tax effect of items that can be used as a tax deduction or credit in future years for which we have already recorded the tax benefit in our income statement. Deferred tax liabilities generally represent tax expense recognized in our financial statements for which payment has been deferred, the tax effect of expenditures for which a deduction has already been taken in our tax return but has not yet been recognized in our financial statements, or assets recorded at estimated fair value in business combinations for which there was no corresponding tax basis adjustment.\nWe estimate income taxes and the effective income tax rate in each jurisdiction that we operate. This involves estimating taxable earnings, specific taxable and deductible items, the likelihood of generating sufficient future taxable income to utilize deferred tax assets, the portion of the income of foreign subsidiaries that is expected to be remitted to the U.S. and be taxable and possible exposures related to future tax audits. Deferred tax assets are evaluated on a subsidiary by subsidiary basis to ensure that the asset will be realized. Valuation allowances are established when the realization is not deemed to be more likely than not. Future performance is monitored, and when objectively measurable operating trends change, adjustments are made to the valuation allowances accordingly. To the extent the estimates described above change, adjustments to income taxes are made in the period in which the estimate is changed.\nWe operate in multiple jurisdictions with complex tax and regulatory environments, which are subject to differing interpretations by the taxpayer and the taxing authorities. At times, we may take positions that management believes are supportable, but are potentially subject to successful challenges by the appropriate taxing authority. We evaluate our tax positions and establish liabilities in accordance with guidance governing accounting for uncertainty in income taxes. We review these tax uncertainties in light of the changing facts and circumstances, such as the progress of tax audits, and adjust them accordingly.\nFurther detail on Income Taxes is included in Note 5 of Notes to Consolidated Financial Statements.\nAcquisitions, Goodwill and Intangible Assets\nWe allocate the cost of an acquired business to the assets acquired and liabilities assumed based on their estimated fair values at the date of acquisition. The excess value of the cost of an acquired business over the estimated fair value of the assets acquired and liabilities assumed is recognized as goodwill. The valuation of the acquired assets and liabilities will impact the determination of future operating results. We use a variety of information sources to determine the value of acquired assets and liabilities, including: third-party appraisers for the values and lives of property, identifiable intangibles and inventories; actuaries for defined benefit retirement plans; and legal counsel or other experts to assess the obligations associated with legal, environmental or other claims.\nDuring fiscal 2022, the Company used variations of the income approach in determining the fair value of intangible assets acquired in the acquisition of Billie, Inc. Specifically, we utilized the multi-period excess earnings method to determine the fair value of the definite lived customer relationships acquired and the relief from royalty method to determine the fair value of the definite lived trade name and proprietary technology that we acquired.\nOur determination of the fair value of customer relationships acquired involved significant estimates and assumptions related to revenue growth rates, discount rates, and customer attrition rates. The determination of the fair value of trade names and proprietary technology acquired involved the use of significant estimates and assumptions related to revenue growth rates, royalty rates and discount rates. We believe that the fair value assigned to the assets acquired and liabilities assumed are based on reasonable assumptions and estimates that marketplace participants would use.\nThe recorded value of goodwill and intangible assets from recently acquired businesses are derived from more recent business operating plans and macroeconomic environmental conditions and, therefore, are likely more susceptible to an adverse change that could require an impairment charge. As such, significant judgment is required in estimating the fair value of goodwill and intangible assets. Additionally, significant judgment is needed when assigning a useful life to intangible assets. Certain intangible assets are expected to have determinable useful lives. Our assessment of intangible assets that have a determinable life is based on a number of factors including the competitive environment, market share, brand history, underlying product life cycles, operating plans and the macroeconomic environment. The costs of determinable-lived intangible assets are amortized to expense over the estimated useful life. The value of residual goodwill is not amortized, but is tested at least annually for impairment. See Note 7 of Notes to Consolidated Financial Statements.\nHowever, future changes in the judgments, assumptions and estimates that are used in our acquisition valuations and intangible asset and goodwill impairment testing, including discount rates or future operating results and related cash flow projections, could result in significantly different estimates of the fair values in the future. An increase in discount rates, a reduction in projected cash flows or a combination of the two could lead to a reduction in the estimated fair values, which may result in impairment charges that could materially affect our financial statements in any given year.\nDuring the fourth quarter of fiscal 2023, we performed an annual test for impairment of goodwill on each of our reporting units. We elected to perform a qualitative test of goodwill impairment for the Sun Care and Feminine Care reporting units. Taking into account the excess fair value over carrying value in the prior valuation, as well as macroeconomic factors, industry conditions and actual results relative to the amounts projected in the prior quantitative test, we determined it was not more likely than not that the fair value of the reporting unit is less than the carrying amount. For the Wet Shave and Skin Care reporting units, we elected to perform a quantitative impairment test in fiscal 2023. As part of the quantitative goodwill impairment test, we estimated the fair value of each reporting unit using both market and income approaches of valuation. The income approach utilizes the discounted cash flow method and incorporates significant estimates and assumptions, including long-term projections of future cash flows, market conditions, and discount rates reflecting the risk inherent in future cash flows. The projections for future cash flows are generated using our companys strategic plan to determine a five-year period of forecasted cash flows and operating data. The market approach uses the guideline public company method to calculate the value of each reporting unit based on the operating data of similar assets from competing publicly traded companies. Multiples derived from guideline companies provide an indication of how much a knowledgeable investor in the marketplace would be willing to pay for a company. The multiples are adjusted given the specific characteristics of the reporting unit including its position in the market relative to the guideline companies and applied to the reporting units operating data to arrive at an\nindication of value. The income and market approaches are weighted based on circumstances specific to each reporting unit and combined are used to calculate fair value.\nDetermining the fair value of a reporting unit requires the use of significant judgment, estimates and assumptions. While we believe that the estimates and assumptions underlying the valuation methodology are reasonable, these estimates and assumptions could have a significant impact on whether an impairment charge is recognized, and also on the magnitude of any such charge. The results of an impairment analysis are as of a point in time. There is no assurance that actual future earnings or cash flows of the reporting units will not decline significantly from these projections. We will monitor any changes to these assumptions and will evaluate goodwill as deemed warranted during future periods.\nThe key assumptions for the market and income approaches used to determine fair value of the reporting units are updated at least annually. Those assumptions and estimates include market data and market multiples, discount rates and terminal growth rates, as well as future levels of revenue growth and operating margins based upon our strategic plan. The assumptions used for the annual goodwill impairment test for fiscal year 2023 include terminal growth rates of 2.50% and a weighted-average cost of capital ranging from 10.0% to 11.0%.\nOur annual impairment testing date was July 1, 2023, and the valuation indicated there was no impairment of the goodwill of the tested reporting units. The results of the valuation indicated that all tested reporting units had a fair value that exceeded its carrying value by more than 27%.\nWe evaluate the fair value of indefinite-lived intangible assets annually in conjunction with the goodwill impairment test. Our assessment of intangible assets that have an indefinite life is based on a number of factors including the competitive environment, market share, brand history, underlying product life cycles, operating plans and the macroeconomic environment.\nDuring the fourth quarter of fiscal 2023, we elected to complete a qualitative assessment for impairment of indefinite lived trade names, except for the Schick, Bulldog, and Carefree, o.b., Stayfree trade names, for which we completed a quantitative assessment. There were no significant events nor adverse trends that indicated any of the indefinite lived intangible assets were impaired during the fourth quarter of fiscal 2023.\nWe tested the Schick, Bulldog, and Carefree, o.b., Stayfree trade names for impairment by performing a quantitative assessment to estimate the fair value. The estimated fair value was determined using two incomes approaches: the multi-period excess earnings method and the relief-from-royalty method, both of which requires significant assumptions, including estimates regarding future revenue and operating margin growth, discount rates, and appropriate royalty rates. Revenue and operating margin growth assumptions are based on historical trends and managements expectations for future growth by brand. The discount rates were based on a weighted-average cost of capital utilizing industry market data of similar companies, in addition to estimated returns on the assets utilized in the operations of the applicable reporting unit, including net working capital, fixed assets and intangible assets. We estimated royalty rates based on operating profits of the brand.\nThe valuation of the tested trade names had no indication of impairment as of the annual testing date on July 1, 2023. The impairment analysis performed in fiscal 2023 indicated that the tested trade names all had a fair value that exceeded its carrying value by more than 22%.\nFuture changes in the judgment, assumptions and estimates that are used in our impairment testing could result in significantly different estimates of the fair values in the future. An increase in discount rates, a reduction in projected cash flows or a combination of the two could lead to a reduction in the estimated fair values, which may result in impairment charges that could materially affect our financial statements in any given year. The assumptions used for the annual valuation for indefinite-lived intangible assets for fiscal year 2023 include a terminal growth rate ranging from 0.3% to 2.50% and a weighted-average cost of capital of 10.25%.\nThe annual impairment analysis performed in fiscal 2023 did not indicate that impairment existed in the reporting units or indefinite lived trade names.\nRecently Issued Accounting Standards\nRefer to Note 2 of Notes to Consolidated Financial Statements for a discussion regarding recently issued accounting standards and their estimated impact on our financial statements. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\n($ in millions)\nThe market risk inherent in our financial instruments and positions represents the potential loss arising from adverse changes in currency rates, commodity prices, interest rates, and our stock price. The following risk management discussion and the estimated amounts generated from the sensitivity analysis are forward-looking statements of market risk, assuming certain adverse market conditions occur. Company policy allows derivatives to be used only for identifiable exposures and, therefore, we do not enter into hedges for trading purposes where the sole objective is to generate profits.\nCurrency Rate Exposure\nA significant share of our sales is tied to currencies other than the U.S. dollar, our reporting currency. As such, a weakening of currencies relative to the U.S. dollar can have a negative impact to reported earnings. Conversely, strengthening of currencies relative to the U.S. dollar can improve reported results. The primary currencies to which we are exposed include the euro, the Japanese yen, the British pound, the Canadian dollar and the Australian dollar.\nWe do business in certain developing markets, which may be susceptible to greater volatility of inflation and currency exchange rates, as well as government pricing and import controls. While the activity is not considered material in relation to the consolidated company as a whole, there could be negative impacts to operating results in certain markets if inflationary pressures, exchange volatility and government controls negatively impact our ability to operate effectively and profitably.\nDerivatives Designated as Cash Flow Hedging Relationships\nAt September 30, 2023, we maintained a cash flow hedging program related to foreign currency risk. These derivative instruments have a high correlation to the underlying exposure being hedged and have been deemed highly effective by the Company for accounting purposes in offsetting the associated risk.\nWe enter into forward currency contracts to hedge the cash flow uncertainty associated with currency fluctuations. These transactions are accounted for as cash flow hedges. We had an unrealized pre-tax gains of $4.4 and $11.3 at September 30, 2023 and 2022, respectively, on these forward currency contracts accounted for as cash flow hedges included in Accumulated other comprehensive loss (AOCI). Assuming foreign exchange rates versus the U.S. dollar remain at September 30, 2023 levels over the next 12 months, the majority of the pre-tax gain included in AOCI at September 30, 2023 is expected to be included in Other expense (income), net. Contract maturities for these hedges extend into fiscal year 2025. There were 64 open foreign currency contracts at September 30, 2023 with a notional value of approximately $105.4.\nFor further information on our derivatives designated as cash flow hedging relationships, see Note 16 of Notes to Consolidated Financial Statements.\nDerivatives Not Designated as Cash Flow Hedging Relationships\nOur foreign subsidiaries enter into internal and external transactions in the ordinary course of business that create non-functional currency balance sheet positions at the foreign subsidiary level. These exposures are generally the result of intercompany purchases, intercompany loans and, to a lesser extent, external purchases, and are revalued in the foreign subsidiarys local currency at the end of each period. Changes in the value of the non-functional currency balance sheet positions in relation to the foreign subsidiarys local currency result in an exchange gain or loss recorded in Other expense (income), net in the Consolidated Statements of Earnings and Comprehensive Income. The primary currency to which our foreign subsidiaries are exposed is the U.S. dollar.\nTo mitigate these balance sheet exposures we enter into foreign currency derivative contracts, which are not designated as cash flow hedges for accounting purposes. Any gains or losses on these contracts are expected to be offset by exchange gains or losses on the underlying exposure; thus, they are not subject to significant market risk. The change in the estimated fair value of the foreign currency contracts resulted in a gains of $3.0 and $8.2 for fiscal 2023 and 2022, respectively, which were recorded in Other expense (income), net in the Consolidated Statements of Earnings and Comprehensive Income. There were five open foreign currency derivative contracts which were not designated as cash flow hedges at September 30, 2023, with a notional value of approximately $34.5.\nFor further information on our derivatives not designated as cash flow hedging relationships, see Note 16 of Notes to Consolidated Financial Statements.\nCommodity Price Exposure\nWe use raw materials that are subject to price volatility. At times, we have used, and may in the future, use hedging instruments to reduce exposure to variability in cash flows associated with future purchases of certain materials and commodities. At September 30, 2023, there were no open derivative or hedging instruments for future purchases of raw materials or commodities.\nInterest Rate Exposure\nOur exposure to interest rate risk relates primarily to our variable-rate debt instruments, which currently bear interest based on LIBOR plus margin. As of September 30, 2023, our outstanding debt included $122.0 related to our Revolving Credit Facility and international, variable-rate note payable. Assuming a one percent increase in the applicable interest rates, annual interest expense would increase by approximately $1.2.\nThe remaining outstanding debt as of September 30, 2023 is fixed-rate debt. Changes in market interest rates generally affect the fair value of fixed-rate debt, but do not impact earnings or cash flows. Item 8. Financial Statements and Supplementary Data.\nConsolidated Financial Statements\nResponsibility for Financial Statements 41\nReport of Independent Registered Public Accounting Firm 42\nConsolidated Statements of Earnings and Comprehensive Income for the fiscal years ended September 30, 2023, 2022 and 2021.\nConsolidated Balance Sheets as of September 30, 2023 and 2022.\nConsolidated Statements of Cash Flows for the fiscal years ended September 30, 2023, 2022 and 2021.\nConsolidated Statements of Changes in Shareholders Equity for the period from October 1, 2020 to September 30, 2023.\nNotes to Consolidated Financial Statements. 49\nResponsibility for Financial Statements\nThe preparation and integrity of the financial statements of Edgewell Personal Care Company (the Company) are the responsibility of its management. These statements have been prepared in conformance with generally accepted accounting principles (GAAP) in the United States of America, and in the opinion of management, fairly present the Companys financial position, results of operations and cash flows.\nThe Company maintains accounting and internal control systems, which it believes are adequate to provide reasonable assurance that assets are safeguarded against loss from unauthorized use or disposition and that financial records are reliable for preparing financial statements. The selection and training of qualified personnel, the establishment and communication of accounting and administrative policies and procedures, and a program of internal audits are important elements of these control systems.\nThe Board of Directors, through its Audit Committee consisting solely of non-management directors, meets periodically with management, internal audit and the independent auditors to discuss audit and financial reporting matters. To ensure independence, our auditor, PricewaterhouseCoopers LLP, has direct access to the Audit Committee.\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Edgewell Personal Care Company\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Edgewell Personal Care Company and its subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of earnings and comprehensive income, of changes in shareholders equity and of cash flows for each of the three years in the period ended September 30, 2023, including the related notes and financial statement schedule listed in the index appearing under Item 15(2) (collectively referred to as the consolidated financial statements). We also have audited the Company's internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Managements Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Companys consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nGoodwill Impairment Assessment - Skin Care Reporting Unit\nAs described in Notes 2 and 7 to the consolidated financial statements, the Companys consolidated goodwill balance as of September 30, 2023 was $1,331.4 million, and the goodwill associated with the Sun and Skin Care segment was $353.9 million. Goodwill from the Skin Care reporting unit makes up a significant portion of the goodwill related to the Sun and Skin Care segment. Management evaluates goodwill annually for impairment in the fourth fiscal quarter, or when indicators of a potential impairment are present. The impairment assessment compares the carrying value of the reporting unit to the estimated fair value. In determining the estimated fair value of the reporting unit when performing a quantitative analysis, both the market approach and the income approach are considered in the valuation, and where appropriate, both methods will be used and weighted, unless appropriate market comparables are not available for a reporting unit. The key assumptions and estimates for the market and income approaches used to determine fair value of the reporting unit included market data and market multiples (for the market approach), discount rate and terminal growth rate (for the income approach), as well as revenue growth rates, and operating margins (for the income approach), which are based upon managements strategic plan.\nThe principal considerations for our determination that performing procedures relating to the goodwill impairment assessment of the Skin Care reporting unit is a critical audit matter are (i) the significant judgment by management when developing the fair value estimate of the Skin Care reporting unit; (ii) a high degree of auditor judgment, subjectivity and effort in performing procedures and evaluating managements significant assumptions related to revenue growth rates, operating margins, and the discount rate used in the income approach; and (iii) the audit effort involved the use of professionals with specialized skill and knowledge.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to managements goodwill impairment assessments, including controls over the valuation of the Skin Care reporting unit. These procedures also included, among others (i) testing managements process for developing the fair value estimate; (ii) evaluating the appropriateness of the income and market approaches used by management; (iii) testing the completeness and accuracy of underlying data used in the income and market approaches; and (iv) evaluating the reasonableness of the significant assumptions used by management related to revenue growth rates, operating margins, and the discount rate used in the income approach for the Skin Care reporting unit. Evaluating managements assumptions related to revenue growth rates and operating margins involved evaluating whether the assumptions used by management were reasonable considering (i) the current and past performance of the Skin Care reporting unit; (ii) the consistency with external relevant industry forecasts and macroeconomic conditions; (iii) managements historical forecasting accuracy; (iv) managements objectives and strategies; and (v) whether the assumptions were consistent with evidence obtained in other areas of the audit. Professionals with specialized skill and knowledge were used to assist in evaluating (i) the appropriateness of the Companys income and market approaches and (ii) the reasonableness of the discount rate assumption.\n/s/ PricewaterhouseCoopers LLP\nSt. Louis, Missouri\nNovember 28, 2023\nWe have served as the Companys auditor since 1999.\nEDGEWELL PERSONAL CARE COMPANY\nCONSOLIDATED STATEMENTS OF EARNINGS AND COMPREHENSIVE INCOME\n(in millions, except per share data)\nFiscal Year\n2023 2022 2021\nNet sales $ 2,251.6 $ 2,171.7 $ 2,087.3\nCost of products sold 1,310.8 1,291.2 1,136.1\nGross profit 940.8 880.5 951.2\nSelling, general and administrative expense 409.6 389.1 391.2\nAdvertising and sales promotion expense 229.1 238.3 241.5\nResearch and development expense 58.5 55.5 57.8\nRestructuring charges 16.6 15.3 20.8\nOperating income 227.0 182.3 239.9\nCost of early retirement of long-term debt - - 26.1\nInterest expense associated with debt 78.5 71.4 67.9\nOther expense (income), net 0.8 (13.2) (1.2)\nEarnings before income taxes 147.7 124.1 147.1\nIncome tax provision 33.0 24.6 29.3\nNet earnings $ 114.7 $ 99.5 $ 117.8\nEarnings per share (Note 6):\nBasic net earnings per share $ 2.24 $ 1.87 $ 2.17\nDilutive net earnings per share $ 2.21 $ 1.85 $ 2.13\nStatements of Comprehensive Income:\nNet earnings $ 114.7 $ 99.5 $ 117.8\nOther comprehensive income (loss), net of tax:\nForeign currency translation adjustments 44.3 (89.4) 5.6\nPension and postretirement activity, net of tax of $2.7 in 2023, $5.2 in 2022, and $17.1 in 2021\n6.6 4.7 44.8\nDeferred (loss) gain on hedging activity, net of tax (benefit) provision of $(2.2) in 2023, $2.5 in 2022, and $2.0 in 2021\n(4.8) 5.5 4.3\nTotal other comprehensive income (loss), net of tax 46.1 (79.2) 54.7\nTotal comprehensive income $ 160.8 $ 20.3 $ 172.5\nSee accompanying Notes to Consolidated Financial Statements.\nEDGEWELL PERSONAL CARE COMPANY\nCONSOLIDATED BALANCE SHEETS\n(in millions, except share data)\nSeptember 30,\n2023 September 30,\nAssets\nCurrent assets\nCash and cash equivalents $ 216.4 $ 188.7\nTrade receivables, less allowance for doubtful accounts of $5.6 and $3.8\n106.2 136.9\nInventories 492.4 449.3\nOther current assets 147.4 167.3\nTotal current assets 962.4 942.2\nProperty, plant and equipment, net 337.9 345.5\nGoodwill 1,331.4 1,322.2\nOther intangible assets, net 973.8 996.6\nOther assets 135.2 106.6\nTotal assets $ 3,740.7 $ 3,713.1\nLiabilities and Shareholders Equity\nCurrent liabilities\nNotes payable 19.5 19.0\nAccounts payable 194.4 228.8\nOther current liabilities 309.5 291.7\nTotal current liabilities 523.4 539.5\nLong-term debt 1,360.7 1,391.4\nDeferred income tax liabilities 136.4 140.4\nOther liabilities 179.7 174.7\nTotal liabilities 2,200.2 2,246.0\nCommitments and contingencies (Note 17)\nShareholders equity\nPreferred shares, $0.01 par value, 10,000,000 authorized; none issued or outstanding\n- -\nCommon shares, $0.01 par value, 300,000,000 authorized; 65,251,989 issued; 50,118,789 and 51,573,001 outstanding\n0.7 0.7\nAdditional paid-in capital 1,593.8 1,604.3\nRetained earnings 1,022.1 939.1\nCommon shares in treasury at cost, 15,133,200 and 13,678,988\n(906.1) (860.9)\nAccumulated other comprehensive loss (170.0) (216.1)\nTotal shareholders equity 1,540.5 1,467.1\nTotal liabilities and shareholders equity $ 3,740.7 $ 3,713.1\nSee accompanying Notes to Consolidated Financial Statements.\nEDGEWELL PERSONAL CARE COMPANY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions)\nFiscal Year\n2023 2022 2021\nCash Flow from Operating Activities\nNet earnings $ 114.7 $ 99.5 $ 117.8\nAdjustments to reconcile net earnings to net cash flow from operations:\nDepreciation and amortization 91.4 89.9 87.1\nShare-based compensation expense 27.5 23.8 27.3\nDeferred income taxes (4.5) (13.7) 9.6\nDeferred compensation payments (4.9) (7.3) (9.3)\nLoss on sale of assets 2.5 1.5 0.9\nDefined benefit settlement loss 7.9 - -\nCost of early retirement of long-term debt - - 26.1\nOther, net (23.5) (9.6) (2.5)\nChanges in current assets and liabilities from operations, net of effects of acquisitions:\nAccounts receivable, net 31.0 (6.6) 3.7\nInventories (32.4) (111.3) (28.8)\nOther current assets 20.8 (11.5) (13.8)\nAccounts payable (30.2) 29.3 24.3\nOther current liabilities 15.8 18.0 (13.4)\nNet cash from operating activities 216.1 102.0 229.0\nCash Flow from Investing Activities\nCapital expenditures (49.5) (56.4) (56.8)\nAcquisitions, net of cash acquired - (309.4) (0.3)\nProceeds from sale of Infant Care business - 5.0 7.5\nCollection of deferred purchase price from accounts receivable sold 2.7 6.9 2.6\nOther, net (3.7) (1.5) (1.7)\nNet cash used by investing activities (50.5) (355.4) (48.7)\nEDGEWELL PERSONAL CARE COMPANY\nCONSOLIDATED STATEMENTS OF CASH FLOWS (Continued)\n(in millions)\nFiscal Year\n2023 2022 2021\nCash Flow from Financing Activities\nCash proceeds from debt with original maturities greater than 90 days 841.0 707.0 -\nCash payments on debt with original maturities greater than 90 days (874.0) (552.0) -\nCash proceeds from the issuance of Senior Notes due 2029 - - 500.0\nCash payments on Senior Notes due 2022 - - (500.0)\nNet (decrease) increase in debt with original maturities of 90 days or less - (3.9) 4.2\nCost of early retirement of long-term debt - - (26.1)\nDebt issuance costs for Senior Notes due 2029 - - (6.5)\nRepurchase of shares (75.2) (125.3) (9.2)\nDividends paid (31.5) (32.6) (25.6)\nEmployee shares withheld for taxes (9.0) (10.7) (4.2)\nNet financing inflow (outflow) from the Accounts Receivable Facility 2.3 (0.8) 2.4\nOther, net (0.1) 0.7 (0.4)\nNet cash used by financing activities (146.5) (17.6) (65.4)\nEffect of exchange rate changes on cash 8.6 (19.5) (0.4)\nNet increase (decrease) in cash and cash equivalents 27.7 (290.5) 114.5\nCash and cash equivalents, beginning of period 188.7 479.2 364.7\nCash and cash equivalents, end of period $ 216.4 $ 188.7 $ 479.2\nSupplemental Disclosures of Cash Flow Information:\nCash paid for interest, net $ 74.3 $ 68.4 $ 61.0\nCash paid for income taxes, net 45.8 23.8 25.4\nSee accompanying Notes to Consolidated Financial Statements.\nEDGEWELL PERSONAL CARE COMPANY\nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS EQUITY\n(in millions)\nCommon Shares Treasury Shares\nNumber Par Value Number Amount Additional Paid-In Capital Retained Earnings Accumulated Other Comprehensive Loss Total Shareholders Equity\nBalance at October 1, 2020 (see Note 1) 65.2 $ 0.7 (10.9) $ (790.4) $ 1,631.8 $ 788.1 $ (191.6) $ 1,438.6\nNet earnings - - - - - 117.8 - 117.8\nDividends declared to common shareholders - - - - - (33.7) - (33.7)\nForeign currency translation adjustments - - - - - - 5.6 5.6\nPension and postretirement activity - - - - - - 44.8 44.8\nDeferred gain on hedging activity - - - - - - 4.3 4.3\nRepurchase of shares - - (0.3) (9.2) - - - (9.2)\nActivity under share plans - - 0.3 23.3 (0.7) - - 22.6\nBalance at September 30, 2021 65.2 $ 0.7 (10.9) $ (776.3) $ 1,631.1 $ 872.2 $ (136.9) $ 1,590.8\nNet earnings - - - - - 99.5 - 99.5\nDividends declared to common shareholders - - - - - (32.6) - (32.6)\nForeign currency translation adjustments - - - - - - (89.4) (89.4)\nPension and postretirement activity - - - - - - 4.7 4.7\nDeferred gain on hedging activity - - - - - - 5.5 5.5\nRepurchase of shares - - (3.3) (125.3) - - - (125.3)\nActivity under share plans - - 0.5 40.7 (26.8) - - 13.9\nBalance at September 30, 2022 65.2 $ 0.7 (13.7) $ (860.9) $ 1,604.3 $ 939.1 $ (216.1) $ 1,467.1\nNet earnings - - - - - 114.7 - 114.7\nDividends declared to common shareholders - - - - - (31.7) - (31.7)\nForeign currency translation adjustments - - - - - - 44.3 44.3\nPension and postretirement activity - - - - - - 6.6 6.6\nDeferred loss on hedging activity - - - - - - (4.8) (4.8)\nRepurchase of shares - - (1.9) (75.2) - - - (75.2)\nActivity under share plans - - 0.6 30.0 (10.5) - - 19.5\nBalance at September 30, 2023 65.2 $ 0.7 (15.0) $ (906.1) $ 1,593.8 $ 1,022.1 $ (170.0) $ 1,540.5\nSee accompanying Notes to Consolidated Financial Statements.\nEDGEWELL PERSONAL CARE COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in millions, except per share data)\nNote 1 - Background and Basis of Presentation\nBackground\nEdgewell Personal Care Company and its subsidiaries (collectively, Edgewell or the Company) is one of the worlds largest manufacturers and marketers of personal care products in the wet shave, sun and skin care and feminine care categories. With operations in over 20 countries, the Companys products are widely available in more than 50 countries.\nThe Company conducts its business in the following three segments:\nWet Shave consists of products sold under the Schick®, Wilkinson Sword®, Edge, Skintimate®, Billie®, Shave Guard and our custom brands group (formerly sold under our Shave Guard and Personna® brands), as well as non-branded products. The Companys wet shave products include razor handles and refillable blades, disposable shave products, and shaving gels and creams.\nSun and Skin Care consists of Banana Boat® and Hawaiian Tropic® sun care products, Jack Black®, Bulldog® and Cremo® mens grooming products, Billie womens grooming products and Wet Ones® products.\nFeminine Care includes tampons, pads and liners sold under the Playtex Gentle Glide® and Sport®, Stayfree®, Carefree®, and o.b.® brands.\nBasis of Presentation\nThe accompanying Consolidated Financial Statements include the accounts of the Company and its controlled subsidiaries and have been prepared in accordance with United States (U.S.) generally accepted accounting principles (GAAP) under the rules and regulations of the U.S. Securities and Exchange Commission (the SEC). The preparation of the Consolidated Financial Statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amount of assets and liabilities, disclosure of contingent assets and liabilities and the reported amounts of revenues and expenses. Actual results may differ materially from those estimates. All intercompany balances and transactions have been eliminated in consolidation and, in the opinion of management, all normal recurring adjustments considered necessary for a fair presentation have been included.\nAcquisition of Billie, Inc. On November 29, 2021 (the Acquisition Date), the Company completed the acquisition of Billie, Inc. (Billie) (the Acquisition), a leading U.S. based consumer brand company that offers a broad portfolio of personal care products for women. The results of Billie for the post-acquisition period are included within the Companys results since the Acquisition Date. For more information on the Acquisition, see Note 3 of Notes to the Consolidated Financial Statements.\nRevision of Previously Issued Consolidated Financial Statements\nDuring the fourth quarter of 2023, the Company evaluated aged accrued expenditures related to goods received but not yet invoiced by certain of its vendors (GRNI). Based upon an assessment, including evaluating the expiry of the applicable statute of limitations of the accrued expenditures, the Company concluded that $8.5 of aged accrued GRNI originating in years 2014 through 2018 were no longer required to be reflected as accounts payable on the Consolidated Balance Sheet as of September 30, 2023 and should have been reversed in prior fiscal years. The Company concluded that the misstatements were not material, either individually or in the aggregate, to its previously issued consolidated financial statements. To correct the immaterial misstatements, the Company has revised its previously issued consolidated financial statements as of and for the year ended September 30, 2022, as well as for the year ended September 30, 2021.\nThe Company has revised the Consolidated Statements of Earnings and Comprehensive Income, Consolidated Statements of Cash Flows, and Consolidated Statements of Changes in Shareholders' Equity for the periods ended September 30, 2022 and September 30, 2021 and Consolidated Balance Sheet as of September 30, 2022 as well as the associated Notes to the Consolidated Financial Statements to reflect the corrections of these immaterial misstatements in this Annual Report on Form 10-K for the period ended September 30, 2023. Due to these GRNI misstatements, which originated prior to fiscal 2023, net income for the years ended September 30, 2022, and 2021 and the opening retained earnings balance as of October 1, 2021, were understated by $0.9, $0.8, and $5.7, respectively, with a corresponding overstatement of total liabilities. There were no changes to previously issued total cash flows generated from (used by) operating, investing, or financing activities for any of the impacted periods. Additionally, the Company will further present the revisions of its previously issued 2023 interim financial statements and relevant notes to the consolidated financial statements in connection with the future filings of its 2024\ninterim reporting on Form 10-Q for the periods ended December 31, 2023, March 31, 2024, and June 30, 2024. Refer to Note 19 of Notes to Consolidated Financial Statements for further discussion on the unaudited quarterly financial information.\nThe following table reflects the revisions to the previously issued Consolidated Statements of Earnings and Comprehensive Income for the fiscal years ended September 30, 2022 and September 30, 2021:\nFiscal Year\n2022 2021\nAs Previously Reported Adjustment As Revised As Previously Reported Adjustment As Revised\nCost of products sold $ 1,292.3 $ (1.1) $ 1,291.2 $ 1,137.2 $ (1.1) $ 1,136.1\nGross profit 879.4 1.1 880.5 950.1 1.1 951.2\nOperating income 181.2 1.1 182.3 238.8 1.1 239.9\nEarnings before income taxes 123.0 1.1 124.1 146.0 1.1 147.1\nIncome tax provision 24.4 0.2 24.6 29.0 0.3 29.3\nNet earnings 98.6 0.9 99.5 117.0 0.8 117.8\nEarnings per share:\nBasic net earnings per share $ 1.86 $ 0.01 $ 1.87 $ 2.15 $ 0.02 $ 2.17\nDilutive net earnings per share 1.84 0.01 1.85 2.12 0.01 2.13\nTotal comprehensive income 19.4 0.9 20.3 171.7 0.8 172.5\nThe following table reflects the revisions to the previously issued Consolidated Statements of Cash Flows for the fiscal years ended September 30, 2022 and September 30, 2021:\nFiscal Year\n2022 2021\nAs Previously Reported Adjustment As Revised As Previously Reported Adjustment As Revised\nNet earnings $ 98.6 $ 0.9 $ 99.5 $ 117.0 $ 0.8 $ 117.8\nOther, net (9.8) 0.2 (9.6) (2.8) 0.3 (2.5)\nAccounts payable 30.4 (1.1) 29.3 25.4 (1.1) 24.3\nThe following table reflects the revisions to the previously issued Consolidated Balance Sheet as of September 30, 2022:\nAs of September 30, 2022\nAs Previously Reported Adjustment As Revised\nAccounts payable $ 237.3 $ (8.5) $ 228.8\nTotal current liabilities 548.0 (8.5) 539.5\nOther liabilities 173.6 1.1 174.7\nTotal liabilities 2,253.4 (7.4) 2,246.0\nRetained earnings 931.7 7.4 939.1\nTotal shareholders equity 1,459.7 7.4 1,467.1\nNote 2 - Summary of Significant Accounting Policies\nCash Equivalents\nCash equivalents are considered to be highly liquid investments with a maturity of three months or less when purchased. At September 30, 2023, the Company had $216.4 in available cash and cash equivalents, a significant portion of which was outside of the U.S. The Company has extensive operations outside of the U.S., including a significant manufacturing footprint. The Company manages its worldwide cash requirements by reviewing available funds among the many subsidiaries through which it conducts its business and the cost effectiveness with which those funds can be accessed. The repatriation of cash balances from certain of the Companys subsidiaries could have adverse tax consequences or be subject to regulatory capital requirements; however, those balances are generally available without legal restrictions to fund ordinary business operations.\nCash Flow Presentation\nThe Consolidated Statements of Cash Flows are prepared using the indirect method, which reconciles Net earnings to Net cash from operating activities. The reconciliation adjustments include the removal of timing differences between the occurrence of operating receipts and payments and their recognition in Net earnings. The adjustments also remove cash flows arising from investing and financing activities, which are presented separately from operating activities. Cash flows from foreign currency transactions and operations are translated at an average exchange rate for the period. Cash flows from hedging activities are included in the same category as the items being hedged, which is primarily operating activities. Cash payments related to income taxes are classified as operating activities.\nTrade Receivables\nTrade receivables are stated at their net realizable value. The allowance for doubtful accounts reflects the Companys best estimate of probable losses inherent in the trade receivables portfolio determined on the basis of historical experience, specific allowances for known troubled accounts and other currently available information. Bad debt expense is included in Selling, general and administrative expense (SG&A) in the Consolidated Statements of Earnings and Comprehensive Income. The Company has two accounts receivable factoring programs. For further discussion, see Note 10 of Notes to Consolidated Financial Statements.\nInventories\nInventories are valued at the lower of cost or market value, with cost generally determined using average cost or the first-in, first-out (FIFO) method.\nCapitalized Software Costs\nCapitalized software costs are included in Property, plant and equipment, net. These costs are amortized using the straight-line method over periods of related benefit ranging from three to seven years. Expenditures related to capitalized software are included within Capital expenditures in the Consolidated Statements of Cash Flows. Amortization expense associated with capitalized software was $5.0, $4.7, and $4.5 in fiscal 2023, 2022 and 2021, respectively.\nProperty, Plant and Equipment, net\nProperty, plant and equipment, net (PP&E) is stated at historical cost. PP&E acquired as part of a business combination is recorded at estimated fair value. Expenditures for new facilities and expenditures that substantially increase the useful life of property, including interest during construction, are capitalized and reported as Capital expenditures in the accompanying Consolidated Statements of Cash Flows. Maintenance, repairs and minor renewals are expensed as incurred. When property is retired or otherwise disposed of, the related cost and accumulated depreciation are removed from the accounts and gains or losses on the disposition are reflected in Net earnings. Depreciation is generally provided on the straight-line basis by charges to earnings at rates based on estimated useful lives. Estimated useful lives range from two to 10 years for machinery and equipment and three to 30 years for buildings and building improvements. Depreciation expense was $55.6, $55.7 and $60.6 in fiscal 2023, 2022 and 2021, respectively.\nEstimated useful lives are periodically reviewed and, when appropriate, changes are made and accounted for prospectively. When certain events or changes in operating conditions occur, asset lives may be adjusted and an impairment assessment may be performed on the recoverability of the carrying amounts.\nLeases\nThe Company leases certain offices and manufacturing facilities, warehouses, employee vehicles and certain manufacturing related equipment. A lease is defined as a contract, or part of a contract, that conveys the right to control the use of identified PP&E over a contracted period in exchange for payment. The Company evaluates if an arrangement is a lease as of the effective date of the agreement. Certain leases include an option to either renew or terminate the lease. For purposes of calculating lease liabilities, these options are included within the lease term when it has become reasonably certain that the Company will exercise such options. Operating lease ROU assets and operating lease liabilities are recorded based on the present value of minimum payments over the lease term at the effective date of the lease. Any costs in excess of the minimum payments are expensed as incurred as variable lease cost.\nLeases with an initial term of 12 months or less are not recorded on the Consolidated Balance Sheet. All recorded leases are classified as operating leases and lease expense is recognized on a straight-line basis over the lease term. The Company has elected as an accounting policy not to separate non-lease components from lease components and, instead, account for these components as a single lease component. For leases that do not provide an implicit rate, the Company uses its secured incremental borrowing rate, based on the information available for leases, including the lease term and interest rate environment in the country in which the lease exists, to calculate the present value of the future lease payments.\nAcquisitions, Goodwill and Other Intangible Assets\nThe Company allocates the cost of an acquired business to the assets acquired and liabilities assumed based on their estimated fair values at the date of acquisition. The excess value of the cost of an acquired business over the estimated fair value of the assets acquired and liabilities assumed is recognized as goodwill. The valuation of the acquired assets and liabilities will impact the determination of future operating results. The Company uses a variety of information sources to determine the value of acquired assets and liabilities, including: third-party appraisers for the values and lives of property, identifiable intangibles and inventories; actuaries for defined benefit retirement plans; and legal counsel or other experts to assess the obligations associated with legal, environmental or other claims.\nGoodwill and indefinite-lived intangibles are not amortized but are instead evaluated annually for impairment as part of the Companys annual business planning cycle in the fourth fiscal quarter, or when indicators of a potential impairment are present. The annual test for impairment performed for goodwill can be qualitative or quantitative, taking into consideration certain factors surrounding the fair value of the goodwill including, level by which fair value exceeded carrying value in the prior valuation, as well as macroeconomic factors, industry conditions and actual results at the test date. The quantitative analysis to test for impairment will estimate the fair value of each reporting unit (Wet Shave, Sun Care, Skin Care and/or Feminine Care) using valuation models that incorporate assumptions and projections of expected future cash flows and operating plans. In determining the estimated fair value of the reporting units when performing a quantitative analysis, both the market approach and the income approach are considered in the valuation, and where appropriate, both methods will be used and weighted, unless appropriate market comparables are not available for a reporting unit.\nDetermining the fair value of a reporting unit requires the use of significant judgment, estimates, and assumptions. While the Company believes that the estimates and assumptions underlying the valuation methodology are reasonable, these estimates and assumptions could have a significant impact on whether an impairment charge is recognized and the magnitude of any such charge. The results of an impairment analysis are as of a point in time. There is no assurance that actual future earnings or cash flows of the reporting units will not vary significantly from these projections. The Company will monitor any changes to these assumptions and will evaluate the carrying value of goodwill as warranted during future periods.\nThe key assumptions and estimates for the market and income approaches used to determine fair value of the reporting units included market data and market multiples (for the market approach), discount rates and terminal growth rates (for the income approach), as well as revenue growth rates and operating margins (for the income approach), which are based upon managements strategic plan.\nThe Company evaluates indefinite-lived intangible assets, which consist of trademarks and brand names used across the Companys segments for impairment on an annual basis. Similar to goodwill, the impairment test can be qualitative or quantitative, taking into consideration certain factors surrounding the fair value of the brand names including, level by which fair value exceeded carrying value in the prior valuation, as well as macroeconomic factors, industry conditions and actual results at the test date. The quantitative test will determine the fair value using one of two income approaches: (i) the multi-period excess earnings method and (ii) the relief-from-royalty method, both of which require significant assumptions, including estimates regarding future revenue and operating margin growth, discount rates, and appropriate royalty rates. Revenue and operating margin growth assumptions are based on historical trends and managements expectations for future growth by brand. The discount rates were based on a weighted-average cost of capital utilizing industry market data of similar companies and estimated returns on the assets utilized in the operations of the applicable reporting unit, including net working capital, fixed assets and intangible assets. The Company estimated royalty rates based on operating profits of the brand.\nIntangible assets with finite lives, and a remaining weighted-average life of approximately eight years, are amortized on a straight-line basis over expected lives of three to 25 years. Such intangibles are also evaluated for impairment including ongoing monitoring of potential impairment indicators.\nRefer to Note 7 of Notes to Consolidated Financial Statements for further discussion on goodwill and other intangible assets.\nImpairment of Long-Lived Assets\nThe Company reviews long-lived assets, other than goodwill and other intangible assets, for impairment when events or changes in business circumstances indicate that the remaining useful life may warrant revision or that the carrying amount of the long-lived asset may not be fully recoverable. The Company performs an undiscounted cash flow analysis to determine if impairment exists for an asset or asset group. If impairment is determined to exist, any related impairment loss is calculated based on estimated fair value. Impairment losses on assets to be disposed of, if any, are based on the estimated proceeds to be received, less cost of disposal.\nRevenue Recognition\nPrincipal Revenue Streams and Significant Judgments\nOur principal revenue streams can be divided into: (i) sale of personal care products primarily through retailers in North America; (ii) sale of personal care products through a combination of retailers and distributors internationally; and (iii) production and sale of private brands products in North America and internationally that are made to customer specifications.\nPerformance Obligations\nThe Companys revenue is generated from the sale of its products. Revenue is recognized when the customer obtains control of the goods, which occurs when the ability to use and obtain benefits from the goods are passed to the customer, most commonly upon the delivery of goods to the customer. Discounts are offered to customers for early payment and an estimate of discounts is recorded as a reduction of Net sales in the same period as the sale. The Companys standard sales terms are final and returns or exchanges are not permitted with the exception of end of season returns for Sun Care products. Reserves are established and recorded in cases where the right of return exists for a particular sale.\nThe Company assesses the goods promised in its customers purchase orders and identifies a performance obligation to transfer goods (or a bundle of goods) that is distinct. To identify the performance obligations, the Company considers all the goods promised, whether explicitly stated or implied based on customary business practices. The Companys purchase orders are short term in nature, lasting less than one year and contain a single delivery element. For a purchase order that has more than one performance obligation, the Company allocates the total consideration to each distinct performance obligation on a relative stand-alone selling price basis. The Company does not exclude variable consideration in determining the remaining value of performance obligations.\nSignificant Judgments\nThe Company records sales at the time that control of goods pass to the customer. The terms of these sales vary but the following conditions are applicable to all sales: (i) the sales arrangement is evidenced by purchase orders submitted by customers; (ii) the selling price is fixed or determinable; (iii) title to the product has transferred; (iv) there is an obligation to pay at a specified date without any additional conditions or actions required by the Company; and (v) collectability is reasonably assured. Simultaneously with the sale, the Company reduces Net sales and Cost of products sold and reserves amounts on its Consolidated Balance Sheet for anticipated returns based upon an estimated return level in accordance with GAAP. The Company also allows for returns of other products under limited circumstances. Customers are required to pay for the Sun Care product purchased during the season under the required terms. Under certain circumstances, the Company allows customers to return Sun Care products that have not been sold by the end of the Sun Care season, which is normal practice in the Sun Care industry. The timing of returns of Sun Care products can vary in different regions based on climate and other factors. However, the majority of returns occur in the U.S. from September through January following the summer Sun Care season. The Company estimates the level of Sun Care returns as the Sun Care season progresses using a variety of inputs including historical experience, consumption trends during the Sun Care season, obsolescence factors including expiration dates and inventory positions at key retailers. The Company monitors shipment activity and inventory levels at key retailers during the season in an effort to more accurately estimate potential returns. This allows the Company to manage shipment activity to its customers, especially in the latter stages of the Sun Care season, to reduce the potential for returned product. The Company also allows for returns of other products under limited circumstances. Non-Sun Care returns are evaluated each period based on communications with customers and other issues known as of period end. The Company had a reserve for returns of $53.5 and $47.5 at September 30, 2023 and 2022, respectively.\nIn addition, the Company offers a variety of programs, such as consumer coupons and rebate programs, primarily to its retail customers, designed to promote sales of its products. Such programs require periodic payments and allowances based on estimated results of specific programs and are recorded as a reduction to Net sales. The Company accrues, at the time of sale, the estimated total payments and allowances associated with each transaction. Additionally, the Company offers programs directly to consumers to promote the sale of its products. Promotions which reduce the ultimate consumer sale price are recorded as a reduction of Net sales at the time the promotional offer is made using estimated redemption and participation levels. Taxes the Company collects on behalf of governmental authorities, which are generally included in the price to the customer, are also recorded as a reduction of Net sales. The Company continually assesses the adequacy of accruals for customer and consumer promotional program costs not yet paid. To the extent total program payments differ from estimates, adjustments may be necessary. Historically, these adjustments have not been material.\nContract Balances\nThe timing of revenue recognition is based on completion of performance obligations through the transfer of goods. Standard payment terms with customers require payment after goods have been delivered and risk of ownership has transferred to the customer. The Company has contract liabilities as a result of advanced payments received from certain customers before goods have been delivered and all performance obligations have been completed. Contract liabilities were $0.6 and $1.1 at September 30, 2023 and 2022, respectively, and were classified within Other current liabilities on our Consolidated Balance Sheets. Substantially all of the amount deferred will be recognized within a year, with the significant majority to be captured within a quarter following deferral.\nTrade receivables are stated at their net realizable value. The allowance for doubtful accounts reflects the Companys best estimate of probable losses inherent in its receivables portfolio determined by historical experience, specific allowances for known troubled accounts, and other currently available information.\nAdvertising and Sales Promotion Costs\nThe Company advertises and promotes its products through national and regional media and expenses such activities as incurred. Advertising and sales promotion expense reported on the Consolidated Statements of Earnings and Comprehensive Income includes advertising costs of $116.0, $125.8 and $142.3 for fiscal 2023, 2022 and 2021, respectively.\nShare-Based Payments\nThe Company grants restricted share equivalents (RSE), which generally vest over two to four years. The estimated fair value of each grant is estimated on the date of grant based on the current market price of the Companys common shares. The original estimate of the grant date fair value is not subsequently revised unless the awards are modified. The Company has elected to recognize forfeiture of awards as they occur. A portion of the RSE awards provide for the issuance of common stock to certain managerial staff and executive management if the Company achieves specified performance targets. For Performance Restricted Share Equivalents (PRSE) granted during fiscal 2020, the Company records estimated expense for performance-based grants based on target achievement of performance metrics for the three-year period for each respective program, unless evidence exists that achievement above or below target for the applicable performance metric is more likely to occur. For PRSE awards granted during fiscal 2023, 2022 and 2021, awards will vest by comparing the Companys total shareholder return (TSR) during a certain three year period to the respective TSRs of companies in a selected performance peer group. The expense recorded for these awards was recorded on a straight-line basis based on the grant date fair value using a Monte Carlo simulation.\nNon-qualified stock options (Share Options) are granted at the market price on the grant date and generally vest ratably over three years. The Company calculates the fair value of total share-based compensation for Share Options using the Black-Scholes option pricing model, which utilizes certain assumptions and estimates that have a material impact on the amount of total compensation cost recognized in the Consolidated Financial Statements, including the expected term, expected share price volatility, risk-free interest rate and expected dividends. The original estimate of the grant date fair value is not subsequently revised unless the awards are modified. The Company has elected to recognize forfeiture of awards as they occur.\nIncome Taxes\nThe Companys annual effective income tax rate is determined based on its pre-tax income, statutory tax rates and the tax impacts of items treated differently for tax purposes than for financial reporting purposes. Tax law requires that certain items be included in its federal tax return at different times than the items are reflected in the financial statements. Some of these differences are permanent, such as expenses that are not deductible in the Companys tax return, and some differences are temporary, reversing over time, such as depreciation expense. These temporary differences create deferred tax assets and liabilities.\nDeferred tax assets generally represent the tax effect of items that can be used as a tax deduction or credit in future years for which the Company has already recorded the tax benefit in the Consolidated Statement of Earnings. Deferred tax liabilities generally represent tax expense recognized in the Companys financial statements for which payment has been deferred, the tax effect of expenditures for which a deduction has already been taken in its tax return but has not yet been recognized in its financial statements or assets recorded at estimated fair value in business combinations for which there was no corresponding tax basis adjustment.\nThe Company estimates income taxes and the effective income tax rate in each jurisdiction that it operates. This involves estimating taxable earnings, specific taxable and deductible items, the likelihood of generating sufficient future taxable income to utilize deferred tax assets, the portion of the income of foreign subsidiaries that is expected to be remitted to the U.S. and be taxable and possible exposures related to future tax audits. Deferred tax assets are evaluated on a subsidiary by subsidiary basis to ensure that the asset will be realized. Valuation allowances are established when the realization is not deemed to be more likely than not. Future performance is monitored, and when objectively measurable operating trends change, adjustments are made to the valuation allowances accordingly. To the extent the estimates described above change, adjustments to income taxes are made in the period in which the estimate is changed.\nThe Company operates in multiple jurisdictions with complex tax and regulatory environments, which are subject to differing interpretations by the taxpayer and the taxing authorities. At times, the Company may take positions that management believes are supportable but are potentially subject to successful challenges by the appropriate taxing authority. The Company evaluates its tax positions and establishes liabilities in accordance with guidance governing accounting for uncertainty in income taxes. The Company reviews these tax uncertainties in light of changing facts and circumstances, such as the progress of tax audits, and adjusts them accordingly.\nEstimated Fair Values of Financial Instruments\nCertain financial instruments are required to be recorded at estimated fair value. Changes in assumptions or estimation methods could affect the fair value estimates; however, the Company does not believe any such changes would have a material impact on its financial condition, results of operations or cash flows. Other financial instruments including cash and cash equivalents and short-term borrowings, including notes payable, are recorded at cost, which approximates estimated fair value. The estimated fair values of long-term debt and financial instruments are disclosed in Note 16 of Notes to Consolidated Financial Statements.\nForeign Currency Translation\nFinancial statements of foreign operations where the local currency is the functional currency are translated using end-of-period exchange rates for assets and liabilities, and average exchange rates during the period for results of operations. Related translation adjustments are reported as a component within accumulated other comprehensive loss in the shareholders equity section of the Consolidated Balance Sheets, except as noted below.\nGains and losses resulting from foreign currency transactions are included in Net earnings. Foreign currency (losses) gains of $(1.7), $7.7 and $0.5 during fiscal 2023, 2022 and 2021, respectively, were included within Other expense (income), net in the Consolidated Statements of Earnings and Comprehensive Income. The Company uses foreign exchange (FX) instruments to reduce the risk of FX transactions as described below and in Note 16 of Notes to Consolidated Financial Statements.\nFinancial Instruments and Derivative Securities\nThe Company uses financial instruments, from time to time, in the management of foreign currency, interest rate, and other risks that are inherent to its business operations. Such instruments are not held or issued for trading purposes.\nFX instruments, including forward currency contracts, are used primarily to reduce cash transaction exposures and, to a lesser extent, to manage other translation exposures. FX instruments are selected based on their risk reduction attributes, costs, and related market conditions. The Company has designated certain foreign currency contracts as cash flow hedges for accounting purposes as of September 30, 2023.\nAt September 30, 2023, the Company had $122.0 of variable rate debt outstanding. In the past the Company has used interest rate swaps to hedge the risk of variable rate debt. As of September 30, 2023, the Company did not have any outstanding interest rate swap agreements.\nFor further discussion, see Note 11 and Note 16 of Notes to Consolidated Financial Statements.\nRecently Issued Accounting Pronouncements\nIn September 2022, the Financial Accounting Standards Board issued Accounting Standards Update 2022-04, \"Liabilities - Supplier Finance Programs (Subtopic 405-50): Disclosure of Supplier Finance Program Obligations\". This guidance requires annual and interim disclosures for entities that use supplier finance programs in connection with the purchase of goods and services. These amendments are effective for fiscal years beginning after December 15, 2022, except for the amendment on roll forward information, which is effective for fiscal years beginning after December 15, 2023. The Company is assessing the impact, if any, of this guidance on its Consolidated Financial Statements.\nNote 3 - Business Combinations\nBillie Inc.\nOn November 29, 2021, the Company completed the Billie Acquisition for cash consideration of $309.4, net of cash acquired. As a result of the Acquisition, Billie became a wholly owned subsidiary of the Company. The Company accounted for the Acquisition utilizing the acquisition method of accounting, which requires assets and liabilities to be recognized based on estimates of their acquisition date fair values. The determination of the values of the acquired assets and assumed liabilities, including goodwill, other intangible assets and deferred taxes, requires significant judgement. The Company has calculated fair values of the assets and liabilities acquired from Billie, including goodwill, intangible assets and working capital. The Company completed the final fair value determination of the Acquisition in the fourth quarter of fiscal year 2022.\nThe Company used variations of the income approach in determining the fair value of intangible assets acquired in the Billie Acquisition. Specifically, we utilized the multi-period excess earnings method to determine the fair value of the definite lived customer relationships acquired and the relief from royalty method to determine the fair value of the definite lived trade name acquired. Our determination of the fair value of the intangible assets acquired involved the use of significant estimates and assumptions related to revenue growth rates, discount rates, customer attrition rates, and royalty rates. Edgewell believes that the fair value assigned to the assets acquired and liabilities assumed are based on reasonable assumptions and estimates that marketplace participants would use.\nThe following table provides the allocation of the purchase price related to the Billie Acquisition based upon the fair value of assets and liabilities assumed:\nCurrent assets $ 17.0\nGoodwill 181.2\nIntangible assets 136.0\nOther assets, including property, plant and equipment, net 3.2\nCurrent liabilities (6.9)\nDeferred tax liabilities (21.1)\n$ 309.4\nThe acquired goodwill represented the value of expansion into new markets and channels of trade and is not deductible for tax purposes. The intangible assets acquired consisted primarily of the Billie trade name and customer relationships with a weighted average useful life of 19 years. All assets are included in the Companys Wet Shave segment.\nBillie contributed net sales and a loss before income taxes totaling $93.7 and $1.1, respectively, for the post-acquisition period ending September 30, 2022 in the Consolidated Statements of Earnings and Comprehensive Income. The loss before income taxes was driven primarily by amortization expense of acquired intangible assets. Acquisition and integration costs related to Billie totaling $7.5 and nil were included in SG&A and Cost of products sold in the Consolidated Statements of Earnings and Comprehensive Income, respectively, for fiscal 2023. Acquisition and integration costs related to Billie totaling $9.1 and $0.8 were included in SG&A and Cost of products sold in the Consolidated Statements of Earnings and Comprehensive Income, respectively, for fiscal 2022.\nThe following summarizes the Company's unaudited pro forma consolidated results of operations for the twelve months ended September 30, 2022 and September 30, 2021, as though the Billie Acquisition occurred on October 1, 2020. The twelve months ended September 30, 2022 and 2021 include results of Billie over the full periods presented.\nTwelve Months Ended September 30,\n2022 2021\nPro forma net sales $ 2,181.7 $ 2,155.3\nPro forma net earnings 104.9 93.1\nThe unaudited pro forma consolidated results of operations were adjusted by pre-tax amortization expense of $1.3 and $8.9 for the years ended September 30, 2022 and 2021, respectively. Additionally, pro forma earnings for the twelve months ended September 30, 2022 exclude $9.9 of pre-tax acquisition costs, which were included in the pro forma earnings for the twelve months ended September 30, 2021. The pro forma earnings were also adjusted to reflect the capital structure as of the Acquisition Date, and all pro forma adjustments have been included with related tax effects. The unaudited pro forma consolidated results of operations are not necessarily indicative of the results obtained had the Billie Acquisition occurred on October 1, 2020, or of those results that may be obtained in the future. Amounts do not reflect any anticipated cost savings or cross-selling opportunities expected to result from the Billie Acquisition.\nCremo Holding Company, LLC\nOn September 2, 2020, the Company completed the acquisition of Cremo Holding Company, LLC (the Cremo Acquisition). The Company accounted for the Cremo Acquisition utilizing the acquisition method of accounting, which requires assets and liabilities to be recognized based on estimates of their acquisition date fair values. The determination of the values of the acquired assets and assumed liabilities, including goodwill and other intangible assets, requires significant judgment. We have calculated fair values of the assets and liabilities acquired from Cremo including goodwill and intangible assets and working capital. The Company completed the final fair value determination of the Cremo Acquisition in the first quarter of fiscal year 2021.\nThe Company used variations of the income approach in determining the fair value of intangible assets acquired in the Cremo Acquisition. Specifically, we utilized the multi-period excess earnings method to determine the fair value of the definite lived customer relationships acquired and the relief from royalty method to determine the fair value of the definite lived trade name and proprietary technology acquired. Our determination of the fair value of the intangible assets acquired involved the use of significant estimates and assumptions related to revenue growth rates, discount rates, customer attrition rates, and royalty rates. The Company believes that the fair value assigned to the assets acquired and liabilities assumed are based on reasonable assumptions and estimates that marketplace participants would use.\nThe following table provides the allocation of the purchase price related to the Cremo Acquisition based upon the fair value of assets and liabilities assumed:\nWorking capital and other net assets (including cash of $0.7) $ 11.5\nIntangible assets 95.1\nGoodwill 128.0\nNet Assets acquired $ 234.6\nThe acquired goodwill represented the value of expansion into new markets and channels of trade and is deductible for tax purposes. The intangible assets acquired consisted primarily of the Cremo trade name, customer relationships, and product formulations with a weighted-average useful life of 17 years. All assets are included in the Companys Sun and Skin Care segment.\nThe Company noted that the net sales and net earnings of Cremo from the beginning of fiscal 2020 through the date of the closing of the Cremo Acquisition were not material relative to the total net sales and net earnings of the Company during fiscal 2020, and thus pro-forma results for Cremo were not disclosed in accordance with Accounting Standards Codification 805. Acquisition and integration costs related to Cremo totaling $7.1 for the year ended September 30, 2021 were included in SG&A in the Consolidated Statements of Earnings and Comprehensive Income. Additionally, acquisition costs of $1.3 were included in Cost of products sold for the year ended September 30, 2021.\nNote 4 - Restructuring Charges\nOperating Model Redesign\nIn fiscal 2023, the Company is continuing to take actions to strengthen its operating model, simplify the organization and improve manufacturing and supply chain efficiency and productivity. As a result of these actions, the Company expects to incur restructuring and re-positioning actions of approximately $19 in fiscal 2024. To date the Company has incurred restructuring and related charges as follows:\nFiscal 2023 Fiscal 2022\nSeverance and related benefit costs 6.2 5.6\nAsset write-off and accelerated depreciation 0.8 0.8\nConsulting, project implementation and management, and other exit costs 10.1 9.8\nTotal restructuring and related costs (1) (2)\n$ 17.1 $ 16.2\n(1) Restructuring and related costs of $0.2 and nil are included within Cost of products sold for fiscal 2023 and 2022, respectively.\n(2) Restructuring and related costs of $0.3 and $0.9 are included within SG&A for fiscal 2023 and 2022, respectively.\nProject Fuel\nProject Fuel was an enterprise-wide transformational initiative launched in fiscal 2018 to improve operational performance and reshape the business cost structure. Project Fuel was completed on September 30, 2021.\nThe Company does not include Project Fuel restructuring costs in the results of its reportable segments. However, the estimated impact of allocating such charges to segment results for fiscal 2021 would have been as follows:\nFiscal 2021\nWet\nShave Sun and Skin Care Feminine Care Corporate Total\nProject Fuel\nSeverance and related benefit costs $ 1.5 $ 0.1 $ - $ 7.8 $ 9.4\nAsset impairment and accelerated depreciation 1.1 - - - $ 1.1\nConsulting, project implementation and management and other exit costs 2.7 0.2 0.3 16.4 19.6\nTotal Restructuring and related costs $ 5.3 $ 0.3 $ 0.3 $ 24.2 $ 30.1\nConsulting, project implementation and management and other exit costs include pre-tax SG&A associated with certain information technology enablement expenses and compensation expenses related to Project Fuel of $8.7 for fiscal 2021. Asset impairment and accelerated depreciation includes pre-tax Cost of products sold associated with inventory obsolescence related to Project Fuel of $0.6 for fiscal 2021. Project-to-date restructuring and related costs inclusive of information technology enablement charges and inventory obsolescence totaled $163.7.\nRestructuring Reserves\nThe following table summarizes restructuring activities and related accruals:\nUtilized\nOctober 1, 2022 Charge to\nIncome Cash Non-Cash September 30, 2023\nSeverance and related benefit costs $ 1.7 $ 6.2 $ (4.0) $ - $ 3.9\nAsset write-off and accelerated depreciation - 0.8 - (0.8) -\nConsulting, project implementation and management, and other exit costs 0.8 10.1 (10.2) - 0.7\nTotal restructuring activities and related accrual $ 2.5 $ 17.1 $ (14.2) $ (0.8) $ 4.6\nUtilized\nOctober 1, 2021 Charge to\nIncome Cash Non-Cash September 30, 2022\nSeverance and related benefit costs $ 1.9 $ 5.6 $ (5.8) $ - $ 1.7\nAsset write-off and accelerated depreciation - 0.8 - (0.8) -\nConsulting, project implementation and management, and other exit costs 3.6 9.8 (12.6) - 0.8\nTotal restructuring activities and related accrual $ 5.5 $ 16.2 $ (18.4) $ (0.8) $ 2.5\nNote 5 - Income Taxes\nAmounts have been revised to reflect the correction of certain immaterial misstatements.Refer to Note 1 of Notes to Consolidated Financial Statements, for further discussion. The provisions for income taxes from continuing operations consisted of the following:\nFiscal Year\n2023 2022 2021\nCurrently payable:\nUnited States - Federal $ 12.5 $ 12.4 $ (2.8)\nState 3.5 6.6 (0.1)\nForeign 21.5 19.4 22.6\nTotal current 37.5 38.4 19.7\nDeferred:\nUnited States - Federal (4.5) (7.6) 7.9\nState (0.6) (0.6) 0.3\nForeign 0.6 (5.6) 1.4\nTotal deferred (4.5) (13.8) 9.6\nIncome tax provision $ 33.0 $ 24.6 $ 29.3\nAmounts have been revised to reflect the correction of certain immaterial misstatements. Refer to Note 1 of Notes to Consolidated Financial Statements, for further discussion. The source of pre-tax earnings was:\nFiscal Year\n2023 2022 2021\nUnited States $ 37.6 $ 2.6 $ (10.4)\nForeign 110.1 121.5 157.5\nPre-tax earnings $ 147.7 $ 124.1 $ 147.1\nAmounts have been revised to reflect the correction of certain immaterial misstatements. Refer to Note 1 of Notes to Consolidated Financial Statements, for further discussion. A reconciliation of income taxes with the amounts computed at the statutory federal income tax rate follows:\nFiscal Year\n2023 2022 2021\nComputed tax at federal statutory rate $ 31.0 21.0 % $ 25.8 21.0 % $ 30.7 21.0 %\nState income taxes, net of federal tax benefit 2.7 1.8 2.7 2.2 0.8 0.6\nForeign tax less than the federal rate (1)\n(1.0) (0.7) (11.7) (9.5) (9.0) (6.2)\nAdjustments to prior years tax accruals (6.1) (4.2) 1.6 1.3 (4.3) (2.9)\nOther taxes including repatriation of foreign earnings\n4.4 3.1 4.6 3.7 8.9 6.1\nOther, net 1.4 0.9 3.9 3.2 2.7 1.8\nUncertain tax positions 0.6 0.4 (2.3) (2.0) (0.5) (0.6)\nTotal $ 33.0 22.3 % $ 24.6 19.9 % $ 29.3 19.8 %\n(1) Includes the impact of foreign valuation allowances.\nThe deferred tax assets and deferred tax liabilities recorded on the balance sheet were as follows, and include current and noncurrent amounts:\nSeptember 30,\n2023 2022\nDeferred tax liabilities:\nDepreciation and property differences $ (20.8) $ (22.8)\nAmortizable assets (230.2) (229.4)\nLease liabilities (15.2) (13.0)\nOther tax liabilities (4.3) (3.9)\nGross deferred tax liabilities (270.5) (269.1)\nDeferred tax assets:\nAccrued liabilities 56.6 55.8\nDeferred and share-based compensation 14.9 13.7\nTax carryforwards and tax credits 37.3 26.0\nPostretirement benefits other than pensions 1.0 1.1\nPension plans 25.0 24.0\nInventory differences 5.0 5.8\nLease right of use assets 15.3 13.1\nDeferred revenue 7.0 9.7\nOther tax assets 8.0 8.1\nGross deferred tax assets 170.1 157.3\nValuation allowance (18.3) (10.3)\nNet deferred tax liabilities $ (118.7) $ (122.1)\nThere were no material tax loss carryforwards that expired in fiscal 2023. Future expirations of tax loss carryforwards and tax credits, if not utilized, are not expected to be material from 2023 through 2040. The remaining tax loss carryforwards and credits have no expiration. The valuation allowance is primarily attributable to tax loss carryforwards, other carryforwards, and certain deferred tax assets impacted by the deconsolidation of the Companys Venezuelan subsidiaries.\nThe Company generally repatriates a portion of current year earnings from select non-US subsidiaries only if the economic cost of the repatriation is not considered material. No provision is made for additional taxes on undistributed earnings of foreign affiliates that are intended and planned to be indefinitely invested in the affiliate. The Company intends to, and has plans to, reinvest these earnings indefinitely in its foreign subsidiaries to, amongst other things, fund local operations, fund pension and other post-retirement obligations, fund capital projects and to support foreign growth initiatives including potential acquisitions. As of September 30, 2023, approximately $897.0 of foreign subsidiary earnings were considered indefinitely invested in those businesses. If the Company repatriated any of the earnings it could be subject to withholding tax and the impact of foreign currency movements. Accordingly, it is not practical to calculate a specific potential tax exposure. Applicable income and withholding taxes will be provided on these earnings in the periods in which they are no longer considered reinvested.\nAmounts have been revised to reflect the correction of certain immaterial misstatements. Refer to Note 1 of Notes to Consolidated Financial Statements, for further discussion. Unrecognized tax benefits activity is summarized below:\n2023 2022 2021\nUnrecognized tax benefits, beginning of year $ 19.4 $ 21.9 $ 22.4\nAdditions based on current year tax positions and acquisitions 1.9 2.1 2.0\nSettlements with taxing authorities and statute expirations (1.6) (4.6) (2.5)\nUnrecognized tax benefits, end of year $ 19.7 $ 19.4 $ 21.9\nIncluded in the unrecognized tax benefits noted above was $18.7 of uncertain tax positions that would affect the Companys effective tax rate, if recognized. The Company does not expect any significant increases or decreases to its unrecognized tax benefits within 12 months of this reporting date. In the Consolidated Balance Sheets, unrecognized tax benefits are classified as Other liabilities (non-current) to the extent that payments are not anticipated within one year.\nThe Company classifies accrued interest and penalties related to unrecognized tax benefits in the income tax provision. The accrued interest and penalties are not included in the table above. The Company accrued approximately $4.4 of interest, (net of the deferred tax asset of $0.8) at September 30, 2023, and $4.1 of interest, (net of the deferred tax asset of $0.7) at September 30, 2022. Interest was computed on the difference between the tax position recognized in accordance with GAAP and the amount previously taken or expected to be taken in the Companys tax returns.\nThe Company files income tax returns in the U.S. federal jurisdiction, various cities and states, and more than 30 foreign jurisdictions where the Company has operations. In general, U.S. federal income tax returns for tax years ended September 30, 2020 and after remain subject to examination by the Internal Revenue Service (the IRS). With few exceptions, the Company is no longer subject to state and local income tax examinations for years before September 30, 2013. The status of international income tax examinations varies by jurisdiction. At this time, the Company does not anticipate any material adjustments to its financial statements resulting from tax examinations currently in progress.\nNote 6 - Earnings per Share\nBasic earnings per share is based on the average number of common shares outstanding during the period. Diluted earnings per share is based on the average number of shares used for the basic earnings per share calculation, adjusted for the dilutive effect of share options, RSE, and PRSE awards.\nThe following is the reconciliation between the number of weighted-average shares used in the basic and diluted earnings per share calculation:\nFiscal Year\n2023 2022 2021\nBasic weighted-average shares outstanding 51.2 53.1 54.4\nEffect of dilutive securities:\nRSE and PRSE awards 0.6 0.5 0.8\nTotal dilutive securities 0.6 0.5 0.8\nDiluted weighted-average shares outstanding 51.8 53.6 55.2\nFor fiscal 2023, 2022 and 2021, the calculation of diluted weighted-average shares outstanding excludes 1.2, 1.0 and 0.9, respectively, of share options because the effect of including these awards was anti-dilutive. For fiscal 2022, the calculation of diluted weighted-average shares outstanding excludes 0.2 of RSE and PRSE awards because the effect of including these awards was anti-dilutive. There were no anti-dilutive RSE and PRSE awards excluded from the calculation for fiscal 2023 and 2021.\nNote 7 - Goodwill and Intangible Assets\nThe following table sets forth goodwill by segment:\nWet\nShave Sun and Skin\nCare Feminine\nCare Total\nGross balance at October 1, 2021 $ 967.5 $ 357.6 $ 208.7 $ 1,533.8\nAccumulated goodwill impairment (369.0) (2.0) - (371.0)\nNet balance at October 1, 2021 $ 598.5 $ 355.6 $ 208.7 $ 1,162.8\nChanges in the twelve months ended September 30, 2022\nBillie acquisition 181.2 - - 181.2\nCumulative translation adjustment (15.2) (3.1) (3.5) (21.8)\nGross balance at October 1, 2022 $ 1,133.5 $ 354.5 $ 205.2 $ 1,693.2\nAccumulated goodwill impairment (369.0) (2.0) - (371.0)\nNet balance at October 1, 2022 $ 764.5 $ 352.5 $ 205.2 $ 1,322.2\nChanges in the twelve months ended September 30, 2023\nCumulative translation adjustment 7.0 1.4 0.8 $ 9.2\nGross balance at September 30, 2023 $ 1,140.5 $ 355.9 $ 206.0 $ 1,702.4\nAccumulated goodwill impairment (369.0) (2.0) - (371.0)\nNet balance at September 30, 2023 $ 771.5 $ 353.9 $ 206.0 $ 1,331.4\nTotal amortizable intangible assets were as follows:\nSeptember 30, 2023 September 30, 2022\nGross\nCarrying\nAmount Accumulated\nAmortization Net Gross\nCarrying\nAmount Accumulated\nAmortization Net\nIndefinite lived\nTrade names and brands $ 592.9 $ - $ 592.9 $ 587.1 $ - $ 587.1\nDefinite lived\nTrade names and brands $ 339.6 $ 88.1 $ 251.5 $ 339.4 $ 72.2 $ 267.2\nTechnology and patents 79.4 76.2 3.2 77.8 75.0 2.8\nCustomer related and other 269.8 143.6 126.2 267.1 127.5 139.6\nAmortizable intangible assets $ 688.8 $ 307.9 $ 380.9 $ 684.3 $ 274.7 $ 409.5\nTotal intangible assets $ 1,281.7 $ 307.9 $ 973.8 $ 1,271.4 $ 274.7 $ 996.6\nAmortization expense for intangible assets was $30.8, $29.4 and $22.0 for fiscal 2023, 2022 and 2021, respectively.\nEstimated amortization expense for amortizable intangible assets is as follows:\nEstimated amortization expense\nFiscal 2024 $ 31.0\nFiscal 2025 $ 31.0\nFiscal 2026 $ 30.6\nFiscal 2027 $ 30.4\nFiscal 2028 $ 30.3\nThereafter $ 227.6\nGoodwill and intangible assets deemed to have an indefinite life are not amortized but are instead reviewed annually in the fourth quarter of each fiscal year for impairment of value or when indicators of a potential impairment are present. The Company continuously monitors changing business conditions, which may indicate that the remaining useful life of goodwill and other intangible assets may warrant revision or carrying amounts may require adjustment.\nIndefinite-lived intangible assets\nThe Companys annual indefinite-lived intangible assets impairment testing was conducted on July 1, 2023 using the Companys strategic plan. The Company elected to perform a qualitative test of impairment for all indefinite lived intangible assets with the exception of the Schick, Bulldog and the Carefree, o.b., Stayfree trade names. For the qualitative test of indefinite lived intangible assets, there were no significant events or adverse trends that could negatively impact the fair value of the intangible assets. For the Schick, Bulldog, and the Carefree, o.b., Stayfree trade names, the Company elected to perform a quantitative impairment test in fiscal 2023 using the Companys strategic plan to calculate a five-year cash flow. The annual impairment assessment of the indefinite-lived intangible assets concluded there was no indication of impairment of the Companys indefinite-lived intangible assets. The Company performed an assessment in the fourth quarter of fiscal 2023 to determine if any significant events or changes in circumstances had occurred that would be considered a potential triggering event. The Company did not identify a triggering event that would indicate the existence of any impairment of the indefinite-lived intangible assets.\nGoodwill\nThe Company performed its annual goodwill impairment analysis as of July 1, 2023. The Company elected to perform a qualitative test of goodwill impairment for the Sun Care and Fem Care reporting units and determined there were no significant events or adverse trends that could negatively impact the fair value of the business. For the Wet Shave and Skin Care reporting units, the Company elected to perform a quantitative impairment test in fiscal 2023 using the Companys strategic plan to calculate a five-year cash flow. The annual impairment assessment of the reporting units concluded there was no indication of impairment of the Companys reporting units.\nNote 8 - Supplemental Balance Sheet Information\nAmounts have been revised to reflect the correction of certain immaterial misstatements. Refer to Note 1 of Notes to Consolidated Financial Statements, for further discussion.\nSeptember 30,\n2023 September 30,\nInventories\nRaw materials and supplies $ 86.3 $ 80.4\nWork in process 91.1 103.2\nFinished products 315.0 265.7\nTotal inventories $ 492.4 $ 449.3\nOther Current Assets\nPrepaid expenses $ 72.5 $ 70.2\nValue added tax receivables 43.7 52.7\nIncome taxes receivable 18.9 19.3\nOther 12.3 25.1\nTotal other current assets $ 147.4 $ 167.3\nPP&E\nLand $ 18.5 $ 18.0\nBuildings 142.6 140.3\nMachinery and equipment 1,105.3 1,050.0\nCapitalized software costs 60.2 56.5\nConstruction in progress 38.5 47.0\nTotal gross property, plant and equipment 1,365.1 1,311.8\nAccumulated depreciation (1,027.2) (966.3)\nTotal PP&E $ 337.9 $ 345.5\nOther Current Liabilities\nAccrued advertising, sales promotion and allowances $ 31.5 $ 34.9\nAccrued trade allowances 29.8 31.4\nAccrued salaries, vacations and incentive compensation 65.4 51.1\nReturns reserve 53.5 47.5\nAccrued interest 25.0 24.7\nIncome taxes payable 11.9 17.4\nOther 92.4 84.7\nTotal other current liabilities $ 309.5 $ 291.7\nOther Liabilities\nPensions and other retirement benefits $ 58.2 $ 57.9\nOther non-current liabilities 121.5 116.8\nTotal other liabilities $ 179.7 $ 174.7\nNote 9 - Leases\nA summary of the Company's lease information is as follows:\nSeptember 30,\n2023 September 30,\nAssets Classification\nRight of use assets Other assets $ 68.5 $ 50.1\nLiabilities\nCurrent lease liabilities Other current liabilities $ 14.0 $ 8.8\nLong-term lease liabilities Other liabilities 53.9 41.5\nTotal lease liabilities $ 67.9 $ 50.3\nOther information\nWeighted-average remaining lease term (years) 8.4 10\nWeighted-average incremental borrowing rate 6.8 % 6.6 %\nFiscal Year Ended September 30, 2023\nFiscal Year Ended September 30, 2022\nFiscal Year Ended September 30, 2021\nStatement of Earnings\nLease cost (1)\n$ 12.5 $ 13.5 $ 14.4\nOther information\nLeased assets obtained in exchange for new lease liabilities $ 25.9 $ 7.6 $ 28.0\nCash paid for amounts included in the measurement of lease liabilities $ 12.2 $ 13.5 $ 14.3\n(1)Lease expense is included in Cost of products sold or SG&A expense based on the nature of the lease. Short-term lease expense and variable lease expense are excluded from this amount and are not material.\nThe Company's future lease payments including reasonably assured renewal options under lease agreements are as follows:\nOperating Leases\nFiscal 2024 $ 16.1\n2025 15.1\n2026 13.3\n2027 10.8\n2028 8.6\n2029 and thereafter 31.5\nTotal future minimum lease commitments 95.4\nLess: Imputed Interest (27.5)\nPresent value of lease liabilities $ 67.9\nNote 10 - Accounts Receivable Facility\nThe Company participates in accounts receivable facility programs both in the United States and Japan. These receivable agreements are between the Company, The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch, as the purchaser (the Accounts Receivable Facility) and the subsidiaries of both parties. Transfers under the Accounts Receivable Facility are accounted for as sales of receivables, resulting in the receivables being derecognized from the Consolidated Balance Sheet. The purchaser assumes the credit risk at the time of sale and has the right at any time to assign, transfer, or participate any of its rights under the purchased receivables to another bank or financial institution. The purchase and sale of receivables under the Accounts Receivable Facility is intended to be an absolute and irrevocable transfer without recourse by the purchaser to the Company for the creditworthiness of any obligor. The Company continues to have collection and servicing responsibilities for the receivables sold and receives separate compensation for their servicing. The compensation received is considered acceptable servicing compensation and, as such, the Company does not recognize a servicing asset or liability.\nEffective February 7, 2022, the Company increased the maximum receivables sold facility amount under the Sixth Amendment to Master Accounts Receivable Purchase Agreement to $180.0 from $150.0 and amended the pricing index used to determine the purchase price for subject receivables from LIBOR to the Bloomberg Short Term Bank Yield Index (BSBY). The applicable margin that is added to the BSBY pricing index specific for each obligor was unchanged. Except as noted above, all other terms, conditions, obligations, covenants or agreements contained in the Accounts Receivable Facility are unmodified in all respects and continue in full force and effect.\nOn August 5, 2022, the Company entered into the Master Receivable Assignment Agreement (the \"Japan Agreement\"). The Japan Agreement was between Schick Japan K.K. and Concerto Receivables Corporation (the Purchaser), Tokyo Branch, a subsidiary of MUFG Bank, LTD., which allows the Company to assign third party accounts receivable to the Purchaser. The Japan Agreement allows for the sale of up to ¥3,000 (approximately $20.0 using the exchange rate as of September 30, 2023) with limits set between individual customers. The terms of the agreement expire one year after the date of execution and will be renewed annually unless either party notifies of its intent not to renew. The assigned receivables will be discounted using the funding rate from the Tokyo Interbank Market plus 1.1%.\nAs of September 30, 2023, the discount rate used to determine the purchase price for the subject receivables is based upon BSBY plus a margin applicable to the specified obligor.\nAccounts receivable sold under the Accounts Receivable Facility for the years ended September 30, 2023 and 2022 were $1,162.7 and $1,046.8, respectively. The trade receivables sold that remained outstanding under the Accounts Receivable Facility as of September 30, 2023 and 2022 were $82.1 and $78.7, respectively. The net proceeds received were included in Cash provided by operating activities in the Consolidated Statement of Cash Flows. The difference between the carrying amount of the trade receivables sold and the sum of the cash received is recorded as a loss on sale of receivables in Other (income) expense, net in the Consolidated Statements of Earnings and Comprehensive Income. For the year ended September 30, 2023 and 2022, the loss on sale of trade receivables was $6.2 and $2.0, respectively.\nNote 11 - Debt\nThe detail of long-term debt was as follows:\nSeptember 30,\n2023 September 30,\nSenior notes, fixed interest rate of 5.5%, due 2028 (1)\n750.0 750.0\nSenior notes, fixed interest rate of 4.1%, due 2029 (1)\n500.0 500.0\nRevolving credit facility (2)\n122.0 155.0\nTotal long-term debt, including current maturities 1,372.0 1,405.0\nLess unamortized debt issuance costs and discount (1)\n11.3 13.6\nTotal long-term debt $ 1,360.7 $ 1,391.4\n(1)At September 30, 2023, the balance for the Senior Notes due 2028 and the Senior Notes due 2029 are reflected net of debt issuance costs of $6.9 and $4.4, respectively. At September 30, 2022, the balance for the Senior Notes due 2028 and the Senior Notes due 2029 are reflected net of debt issuance costs of $8.3 and $5.3, respectively.\n(2)The U.S. revolving credit facility matures in 2025.\nAt September 30, 2023 and 2022, the Company also had outstanding short-term notes payable with financial institutions with original maturities of less than 90 days of $19.5 and $19.0, respectively, with variable weighted-average interest rates of 3.9% for both periods. These notes were primarily outstanding international borrowings.\nIssuance of Senior Notes\nOn March 8, 2021, the Company entered into a new unsecured indenture agreement for 4.125% Senior Notes in the amount of $500 due April 1, 2029 (the 2029 Notes). The Company used the net proceeds from the issuance of the 2029 Notes, together with cash on hand, to satisfy and discharge its obligations outstanding under its 4.70% Senior Notes in the amount of $500 due 2022 (the 2022 Notes) and to pay fees associated therewith. The Company incurred $6.5 in bank, legal, and other fees in connection with the issuance of the 2029 Notes, which has been deferred and is being amortized to interest expense over the term of the 2029 Notes. Interest expense on the 2029 Notes is due semiannually on April 1 and October 1.\nIn connection with the early repayment of the 2022 Notes, the Company recorded expense of $26.1 in fiscal 2021, which is included in Cost of early retirement of long-term debt in the Consolidated Statements of Earnings and Comprehensive Income. This expense included a premium of $25.5 and debt issuance cost write-offs of $0.6.\nDebt Covenants\nThe U.S. revolving credit facility maturing in 2025 (Revolving Credit Facility) governing our outstanding debt at September 30, 2023 contains certain customary representations and warranties, financial covenants, covenants restricting the Companys ability to take certain actions, affirmative covenants and provisions relating to events of default. Under the terms of the Revolving Credit Facility, the ratio of the Companys indebtedness to earnings before interest, taxes, depreciation and amortization (EBITDA), as defined in the agreement and detailed below, cannot be greater than 4.0 to 1.0, however, there is an exception for acquisition activity. In addition, under the Revolving Credit Facility, the ratio of the Companys EBITDA, as defined in the credit agreement, to total interest expense must exceed 3.0 to 1. Under the Revolving Credit Facility, EBITDA is defined as net earnings, as adjusted to add-back interest expense, income taxes, depreciation and amortization, all of which are determined in accordance with GAAP. In addition, the credit agreement allows certain non-cash charges such as stock award amortization and asset write-offs including, but not limited to, impairment and accelerated depreciation, and operating expense reductions or synergies to be added-back in determining EBITDA for purposes of the indebtedness ratio. Total debt and interest expense are calculated in accordance with GAAP. If the Company fails to comply with these covenants or with other requirements of the Revolving Credit Facility, the lenders may have the right to accelerate the maturity of the debt. Acceleration under the Revolving Credit Facility would trigger cross-defaults on its other borrowings.\nAs of September 30, 2023, the Company was in compliance with the provisions and covenants associated with the Revolving Credit Facility.\nDebt Maturities\nAggregate maturities of long-term debt, including current maturities, at September 30, 2023 were as follows: $122.0 in 2025, $750.0 in 2028, and $500.0 in 2029.\nNote 12 - Retirement Plans\nPensions and Postretirement Plans\nThe Company has several defined benefit pension plans covering employees in the U.S. and certain employees in other countries, which are included in the information below. The plans provide retirement benefits based on years of service and earnings. The Company also sponsors or participates in a number of other non-U.S. pension and postretirement arrangements, including various retirement and termination benefit plans, some of which are required by local law or coordinated with government-sponsored plans, which are not significant in the aggregate and, therefore, are not included in the information presented below.\nThe Company initiated the wind-up of its Canadian defined benefit pension plan (Canada Plan) in June 2021. On September 1, 2021, Edgewell Personal Care Canada ULC (EPC Canada) as administrator of the Canada Plan entered into a buy-in annuity purchase agreement (Buy-in Agreement) with Brookfield Annuity Company (Brookfield Annuity) for certain members of the Canada Plan. On January 25, 2023, the Company received approval by the Financial Services Regulatory Authority of Ontario to wind-up the Canada Plan. Upon regulatory approval of the Canada Plan, EPC Canada proceeded with purchasing annuities for the remaining Canada Plan participants and converting the Buy-in Agreement to a buy-out annuity purchase agreement (Buy-out Agreement), which was purchased and funded by the Canada Plan on March 31, 2023. The Company was relieved of its defined benefit pension obligation through its irrevocable commitment under the Buy-out Agreement. As of the settlement date, the Company remeasured its assets and its projected benefit obligation associated with the Canada Plan. Upon settlement, the Company derecognized the assets, projected benefit obligation and losses remaining in accumulated other comprehensive loss (AOCI) associated with the Canada Plan, which resulted in a loss on settlement of $7.9. The loss was recorded in Other expense (income), net in the Consolidated Statements of Earnings and Comprehensive Income for the fiscal year ended September 30, 2023.\nThe Company funds its pension plans in compliance with the Employee Retirement Income Security Act of 1974 (ERISA) or local funding requirements.\nThe following tables present the benefit obligation, plan assets, and funded status of the plans:\nAs of September 30,\nPension Postretirement\n2023 2022 2023 2022\nChange in projected benefit obligation\nBenefit obligation at beginning of year $ 439.4 $ 618.7 $ 4.1 $ 5.5\nService cost 1.9 3.8 - -\nInterest cost 20.6 10.2 0.2 0.2\nActuarial gain (12.9) (141.1) (0.1) (0.9)\nBenefits paid, net (29.6) (26.4) (0.3) (0.3)\nPlan settlements (21.9) (4.3) - -\nExpenses paid - - - -\nForeign currency exchange rate changes 7.4 (21.5) - (0.4)\nProjected benefit obligation at end of year 404.9 439.4 3.9 4.1\nChange in plan assets\nEstimated fair value of plan assets at beginning of year 398.2 570.5 - -\nActual return on plan assets 8.9 (121.0) - -\nCompany contributions 0.9 0.9 0.3 0.3\nPlan settlements (21.9) (4.3) - -\nBenefits paid (29.6) (26.4) (0.3) (0.3)\nExpenses paid - - - -\nForeign currency exchange rate changes 8.2 (21.5) - -\nDivestiture (0.8) - - -\nEstimated fair value of plan assets at end of year 363.9 398.2 - -\nFunded status at end of year $ (41.0) $ (41.2) $ (3.9) $ (4.1)\nThe following table presents the amounts recognized in the Consolidated Balance Sheets and Consolidated Statements of Changes in Shareholders Equity:\nAs of September 30,\nPension Postretirement\n2023 2022 2023 2022\nAmounts recognized in the Consolidated Balance Sheets\nNoncurrent assets $ 13.5 $ 12.0 $ - $ -\nCurrent liabilities (1.0) (0.9) (0.2) (0.2)\nNoncurrent liabilities (53.5) (52.3) (3.7) (3.9)\nNet amount recognized $ (41.0) $ (41.2) $ (3.9) $ (4.1)\nAmounts recognized in Accumulated other comprehensive loss\nNet loss (gain) $ 119.3 $ 128.6 $ (7.3) $ (7.4)\nPrior service credit - - - -\nNet amount recognized, pre-tax $ 119.3 $ 128.6 $ (7.3) $ (7.4)\nPre-tax changes recognized in Other comprehensive income for fiscal 2023 were as follows:\nPension Post-\nretirement\nChanges in plan assets and benefit obligations recognized in Other comprehensive income\nNet (gain) loss arising during the year $ (0.5) $ (0.1)\nEffect of exchange rates 0.8 (0.1)\nAmounts recognized as a component of net periodic benefit cost\nAmortization or settlement recognition of net (loss) gain (9.6) 0.3\nTotal recognized in Other comprehensive income $ (9.3) $ 0.1\nPension contributions required in fiscal 2024 and beyond represent future pension payments to comply with local funding requirements in the U.S. only. The projected contributions for the U.S. pension plans total $7.0 in fiscal 2024, $9.2 in fiscal 2025, $10.4 in fiscal 2026, $10.2 in fiscal 2027, and $10.1 in fiscal 2028. Estimated contributions beyond fiscal 2028 are not determinable. The Company may also elect to make discretionary contributions.\nThe Companys expected future benefit payments are as follows:\nPension Post-\nretirement\nFiscal 2024\n$ 33.3 $ 0.2\nFiscal 2025\n34.0 0.2\nFiscal 2026\n33.6 0.2\nFiscal 2027\n32.8 0.2\nFiscal 2028\n32.6 0.2\nFiscal 2029 to 2032 147.0 1.3\nThe accumulated benefit obligation for defined benefit pension plans was $398.1 and $433.0 at September 30, 2023 and 2022, respectively. The following table shows pension plans with an accumulated benefit obligation in excess of plan assets:\nAs of September 30,\n2023 2022\nProjected benefit obligation $ 309.1 $ 331.0\nAccumulated benefit obligation 309.1 331.0\nEstimated fair value of plan assets 254.6 277.8\nPension plan assets in the U.S. plan represent approximately 70% of assets in all of the Companys defined benefit pension plans. Investment policy for the U.S. plan includes a mandate to diversify assets and invest in a variety of asset classes to achieve that goal. The U.S. plans assets are currently invested in several funds representing most standard equity and debt security classes. The broad target allocations are: (a) equities, including U.S. and foreign: approximately 41% and (b) debt securities, including U.S. bonds: approximately 59%. Actual allocations at September 30, 2023 approximated these targets. The U.S. plan held no shares of Company common stock at September 30, 2023. Investment objectives are similar for non-U.S. pension arrangements, subject to local regulations.\nThe following table presents pension and post-retirement expense:\nFiscal Year\nPension Postretirement\n2023 2022 2021 2023 2022 2021\nService cost $ 1.9 $ 3.8 $ 4.4 $ - $ - $ -\nInterest cost 20.6 10.2 9.6 0.2 0.2 0.2\nExpected return on plan assets\n(21.5) (21.1) (22.4) - - -\nRecognized net actuarial loss (gain)\n1.7 6.4 9.5 (0.3) (0.3) (0.3)\nSettlement loss recognized 7.9 1.8 - - - -\nNet periodic benefit cost (credit) 10.6 1.1 1.1 (0.1) (0.1) (0.1)\nThe service cost component of the net periodic cost associated with the Companys retirement plans is recorded to Cost of products sold and SG&A in the Consolidated Statements of Earnings and Comprehensive Income. The remaining net periodic cost is recorded to Other expense (income), net in the Consolidated Statements of Earnings and Comprehensive Income.\nThe Company utilized the spot discount rate approach, which applies the specific spot rates along the yield curve used in the determination of the benefit obligations to the relevant cash flows.\nThe following table presents assumptions, which reflect weighted-averages for the component plans, used in determining the above information:\nFiscal Year\nPension Postretirement\n2023 2022 2021 2023 2022 2021\nPlan obligations:\nDiscount rate 5.5 % 5.1 % 2.3 % 5.6 % 5.1 % 3.5 %\nCompensation increase rate 2.5 % 2.5 % 2.5 % 4.0 % 4.0 N/A\nNet periodic benefit cost:\nDiscount rate 5.1 % 2.3 % 2.1 % 5.1 % 3.5 % 2.8 %\nExpected long-term rate of return on plan assets 4.9 % 4.2 % 4.5 % N/A N/A N/A\nCompensation increase rate 2.5 % 2.5 % 2.5 % 4.0 % 4.0 N/A\nCash balance interest credit rate 4.2 % 3.3 % 1.9 % N/A N/A N/A\nThe expected return on plan assets was determined based on historical and expected future returns of the various asset classes, using the target allocations described above.\nThe following table sets forth the estimated fair value of the Companys pension assets segregated by level within the estimated fair value hierarchy. Refer to Note 16 of Notes to Consolidated Financial Statements for further discussion on the estimated fair value hierarchy and estimated fair value principles.\nSeptember 30, 2023\nPension assets at estimated fair value Level 1 Level 2 Total\nEquity\nU.S. equity $ 22.7 $ - $ 22.7\nInternational equity 54.4 - 54.4\nDebt\nU.S. government - - -\nOther government - - -\nCorporate 54.9 - 54.9\nCash and cash equivalents 3.0 - 3.0\nOther - - -\nTotal, excluding investments valued at net asset value (NAV) $ 135.0 $ - $ 135.0\nInvestments valued at NAV 228.9\nTotal $ 135.0 $ - $ 363.9\nSeptember 30, 2022\nPension assets at estimated fair value Level 1 Level 2 Total\nEquity\nU.S. equity $ 49.1 $ - $ 49.1\nInternational equity 50.1 - 50.1\nDebt\nU.S. government - 173.3 173.3\nOther government - - -\nCorporate 47.4 - 47.4\nCash and cash equivalents 19.9 - 19.9\nOther 13.8 - 13.8\nTotal, excluding investments valued at NAV $ 180.3 $ 173.3 $ 353.6\nInvestments valued at NAV 44.6\nTotal $ 180.3 $ 173.3 $ 398.2\nThe following table sets forth the estimated fair value of the Companys pension assets valued at NAV:\nAs of September 30,\n2023 2022\nPension assets valued at NAV estimated at fair value\nEquity\nU.S. equity $ 48.9 $ 11.4\nInternational equity 21.4 33.2\nDebt\nU.S. government 158.6 $ -\nTotal investments valued at NAV $ 228.9 $ 44.6\nThere were no Level 3 pension assets as of September 30, 2023 and 2022.\nThe Company had no post-retirement plan assets as of September 30, 2023 and 2022.\nThe Companys investment objective for defined benefit retirement plan assets is to satisfy its current and future pension benefit obligations. The investment philosophy is to achieve this objective through diversification of the retirement plan assets with the goal of earning a suitable return with an appropriate level of risk while maintaining adequate liquidity to distribute benefit payments. The diversified asset allocation includes equity positions as well as fixed income investments. The increased volatility associated with equities is offset with higher expected returns, while long duration fixed income investments help dampen the volatility of the overall portfolio. Risk exposure is controlled by re-balancing the retirement plan assets back to target allocations, as needed. Investment firms managing retirement plan assets carry out investment policy within their stated guidelines. Investment performance is monitored against benchmark indices, which reflect the policy and target allocation of the retirement plan assets.\nDefined Contribution Plan\nThe Company sponsors a defined contribution plan, which extends participation eligibility to the vast majority of U.S. employees. Effective January 1, 2014, the Company matches 100% of participants before-tax or Roth contributions up to 6% of eligible compensation. Amounts charged to expense during fiscal 2023, 2022, and 2021 were $11.3, $10.4, and $10.4, respectively, and are reflected in SG&A and Cost of products sold in the Consolidated Statements of Earnings and Comprehensive Income.\nNote 13 - Share-Based Payments\nAs of September 30, 2023, the Company had three share-based compensation plans: the Amended and Restated 2018 Stock Incentive Plan (the 2018 Plan), the Second Amended and Restated 2009 Incentive Stock Plan (the 2009 Plan) and the 2000 Incentive Stock Plan (the 2000 Plan). The 2000 Plan was superseded by the 2009 Plan, which was then superseded by the 2018 Stock Incentive Plan. New awards granted after January 2018 are issued under the 2018 Plan. The 2018 Plan provides for the award of performance restricted stock, RSEs, or Share Options to purchase the Companys common stock to directors, officers and employees of the Company. The maximum number of shares authorized for issuance under the 2018 Plan is 17.9, of which 4.6 were available for future awards as of September 30, 2023.\nShare options are granted at the market price on the grant date and generally vest ratably over three years. These awards typically have a maximum term of ten years. Performance restricted stock and RSEs may also be granted. Option shares and prices, and restricted stock and RSEs, are adjusted in conjunction with stock splits and other recapitalizations, including our 2015 separation from Energizer, so that the holder is in the same economic position before and after these equity transactions.\nThe Company uses the straight-line method of recognizing compensation cost. Total compensation costs charged against earnings before income taxes for the Companys share-based compensation arrangements were $27.5, $23.9 and $27.3 for fiscal 2023, 2022 and 2021, respectively, and were recorded in SG&A. The total income tax benefit recognized for share-based compensation arrangements was $6.6, $5.7 and $6.6, for fiscal 2023, 2022 and 2021, respectively. Restricted stock issuance and shares issued for share option exercises under the Companys share-based compensation programs are generally issued from treasury shares.\nShare Options\nThe following table summarizes Share Option activity during fiscal 2023:\nShares Weighted-Average Exercise Price Weighted-Average Remaining Contractual Term\n(in years) Aggregate Intrinsic Value\nOutstanding as of October 1, 2022\n1.1 $ 54.05\nGranted 0.1 $ 39.75\nOutstanding as of September 30, 2023\n1.2 $ 46.88 6.2 $ -\nVested and unvested expected to vest as of September 30, 2023\n1.2 $ 46.88 6.2 $ -\nExercisable as of September 30, 2023\n0.8 $ 57.75\nAn immaterial number of share options were exercised in fiscal 2023 and 2022. No share options were exercised in fiscal 2021.\nThe Company estimates the grant-date fair value of share option awards using the Black-Scholes option pricing model. The expected volatility is determined based on historical volatility. The Company utilizes the simplified method in estimating the share option life as the Company does not have sufficient historical share option experience to estimate the share option life. During fiscal 2023 and 2022, the Company granted non-qualified share option awards to certain executives and employees of 0.1 and 0.3, respectively, with a grant-date fair value of $2.2 and $4.6, respectively. The following table presents the Companys weighted average fair value per option and the assumptions utilized in the Black-Scholes option pricing model:\nWeighted-average fair value per share option $ 15.22 $ 14.25\nExpected volatility 40.0 % 39.0 %\nRisk-free interest rate 3.85 % 1.33 %\nExpected share option life (in years) 6.0 6.1\nDividend yield 1.51 % 1.42 %\nAs of September 30, 2023, there was an estimated $3.2 of total unrecognized compensation costs related to share option awards, which will be recognized over a weighted-average period of approximately 1.5 years.\nRestricted Share Equivalents\nThe following table summarizes RSE award activity during fiscal 2023:\nShares Weighted-Average\nGrant Date Estimated Fair\nValue\nNon-vested at October 1, 2022\n1.0 $ 38.09\nGranted 0.5 40.17\nVested (0.5) 39.00\nCanceled (0.1) 36.23\nNon-vested at September 30, 2023\n0.9 39.74\nThe estimated fair value of the award is determined using the closing share price of the Companys common stock on the date of grant.\nAs of September 30, 2023, there was an estimated $24.3 of total unrecognized compensation costs related to RSEs, which will be recognized over a weighted-average period of approximately 2.3 years. The weighted-average estimated fair value per RSE granted in fiscal 2023, 2022 and 2021 was $40.17, $42.49, and $35.16, respectively. The estimated fair value of RSEs vested in fiscal 2023, 2022 and 2021 was $20.2, $15.4, and $13.2, respectively.\nPerformance Restricted Share Equivalents\nThe following table summarizes PRSE award activity during fiscal 2023:\nShares Weighted-Average\nGrant Date Estimated Fair\nValue\nNon-vested at October 1, 2022\n0.5 $ 43.04\nGranted 0.2 58.55\nVested (0.1) 62.09\nCanceled (0.2) 42.63\nNon-vested at September 30, 2023\n0.4 60.56\nAs of September 30, 2023, there was an estimated $9.9 of total unrecognized compensation costs related to PRSEs, which will be recognized over a weighted-average period of approximately 1.8 years. The weighted-average estimated fair value per PRSE granted in fiscal 2023, 2022 and 2021 was $58.55, $56.53, and $29.25, respectively. The estimated fair value of PRSEs vested in fiscal 2023 was $62.09.\nFor PRSE awards granted during fiscal 2020, the Company records estimated expense for performance-based grants based on target achievement of performance metrics for the three-year period for each respective program, unless evidence exists that achievement above or below target for the applicable performance metric is more likely to occur. The PRSE awards will vest with a value of 0% to 200% of the targeted award value based upon the achievement of performance metrics. The estimated fair value of the award is determined using the closing share price of the Companys common stock on the date of grant.\nFor PRSE awards granted during fiscal 2023, 2022 and 2021, awards will vest by comparing the Companys TSR during a certain three year period to the respective TSRs of companies in a selected performance peer group. Based upon the Companys ranking in its performance peer group, a recipient of the PRSE award may earn a total award ranging from 0% to 200% of the target award. The fair value of each PRSE was estimated on the grant date using a Monte Carlo simulation. The assumptions for PRSE awards during the years ended September 30, 2023 and 2022 are summarized in the following table.\n2023 2022\nExpected term (in years) 3.0 3.0\nExpected stock price volatility 48.20 % 48.73 %\nRisk-free interest rate 4.14 % 0.85 %\nFair value (per award granted) 58.55 65.90\nNote 14 - Shareholders Equity\nAt September 30, 2023, there were 300.0 shares of the Companys common stock authorized, of which 4.6 shares were reserved for outstanding awards under the 2018, 2009 and 2000 Plans. The Companys Amended and Restated Articles of Incorporation authorize it to issue up to 10.0 shares of $0.01 par value preferred stock. As of September 30, 2023, there were no shares of preferred stock issued or outstanding.\nShare Repurchases\nDuring fiscal 2023, the Company repurchased 1.9 shares of common stock under the share repurchase Board authorization from January 2018 for $75.2 and has 4.6 shares of its common stock available for repurchase in the future under the Boards authorization. Future share repurchases, if any, would be made in the open market, privately negotiated transactions, or otherwise, in such amounts and at such times as we deem appropriate based upon prevailing market conditions, business needs, and other factors. Additionally, 0.2 shares were purchased related to the surrender of shares of common stock to satisfy tax withholding obligations in connection with the vesting of RSEs.\nSince September 30, 2023, the Company repurchased 0.1 shares of common stock for $3.5 under the share repurchase Board authorization from January 2018 which allows the repurchase of up to 10.0 shares. There are 4.5 common shares remaining available to be purchased.\nDividends\nThe following is a summary of cash dividends paid and declared per share on the Companys Common Stock during the year ended September 30, 2023\nDate Declared Record Date Payable Date Amount Per Share\nJuly 29, 2022 September 2, 2022 October 5, 2022 $ 0.15\nNovember 3, 2022 November 29, 2022 January 4, 2023 $ 0.15\nFebruary 3, 2023 March 8, 2023 April 5, 2023 $ 0.15\nMay 8, 2023 June 7, 2023 July 6, 2023 $ 0.15\nAugust 1, 2023 September 7, 2023 October 4, 2023 $ 0.15\nOn November 2, 2023, the Board declared a quarterly cash dividend of $0.15 per common share for the third fiscal quarter of 2023. The dividend will be paid on January 4, 2024 to shareholders of record as the close of business on December 6, 2023.\nDividends declared during fiscal 2023 totaled $31.7. Payments made for dividends during fiscal 2023 totaled $31.5.\nNote 15 - Accumulated Other Comprehensive Loss\nThe following table presents the changes in accumulated other comprehensive loss (AOCI), net of tax, by component:\nForeign Currency Translation Adjustments Pension and Post-retirement Activity Hedging Activity Total\nBalance at October 1, 2021\n$ (41.8) $ (97.3) $ 2.2 $ (136.9)\nOCI before reclassifications (1)\n(89.4) (1.2) 13.1 (77.5)\nReclassifications to earnings - 5.9 (7.6) (1.7)\nBalance at September 30, 2022\n(131.2) (92.6) 7.7 (216.1)\nOCI before reclassifications (1)\n44.3 (0.3) 0.7 44.7\nReclassifications to earnings - 6.9 (5.5) 1.4\nBalance at September 30, 2023\n$ (86.9) $ (86.0) $ 2.9 $ (170.0)\n(1)OCI is defined as other comprehensive income.\nThe following table presents the reclassifications out of AOCI:\nFiscal Year\nDetails of AOCI Components 2023 2022 Affected Line Item in the Consolidated Statement of Earnings\nGain on cash flow hedges\nForeign exchange contracts $ 8.0 $ 11.2 Other expense (income), net\nIncome tax expense 2.5 3.6 Income tax provision\n$ 5.5 $ 7.6\nAmortization of defined benefit pension and postretirement items\nActuarial losses (1) (1.4) (6.1) Other expense (income), net\nDefined benefit settlement loss (1) (7.9) (1.8) Other expense (income), net\nIncome tax benefit (2.4) (2.0) Income tax provision\n$ (6.9) $ (5.9)\nTotal reclassifications for the period $ (1.4) $ 1.7\n(1)These AOCI components are included in the computation of net periodic benefit cost. See Note 12 of Notes to Consolidated Financial Statements.\nNote 16 - Financial Instruments and Risk Management\nIn the course of ordinary business, the Company enters into contractual arrangements (also referred to as derivatives) to reduce its exposure to foreign currency. The Company has master netting agreements with all of its counterparties that allow for the settlement of contracts in an asset position with contracts in a liability position in the event of default. The Company manages counterparty risk through the utilization of investment grade commercial banks, diversification of counterparties, and its counterparty netting arrangements. The section below outlines the types of derivatives that existed at September 30, 2023 and 2022, respectively, as well as the Companys objectives and strategies for holding derivative instruments.\nForeign Currency Risk\nA significant share of the Companys sales is tied to currencies other than the U.S. dollar, the Companys reporting currency. As such, a weakening of currencies relative to the U.S. dollar can have a negative impact to reported earnings. Conversely, strengthening of currencies relative to the U.S. dollar can improve reported results. The primary currencies to which the Company is exposed include the euro, the Japanese yen, the British pound, the Canadian dollar and the Australian dollar.\nAdditionally, the Companys foreign subsidiaries enter into internal and external transactions that create non-functional currency balance sheet positions at the foreign subsidiary level. These exposures are generally the result of intercompany purchases, intercompany loans and, to a lesser extent, external purchases, and are revalued in the foreign subsidiarys local currency at the end of each period. Changes in the value of the non-functional currency balance sheet positions in relation to the foreign subsidiarys local currency results in an exchange gain or loss recorded in Other expense (income), net in the Consolidated Statements of Earnings and Comprehensive Income. The primary currency to which the Companys foreign subsidiaries are exposed is the U.S. dollar.\nInterest Rate Risk\nThe Company has interest rate risk with respect to interest expense on variable rate debt. At September 30, 2023, the Company had $122.0 of variable rate debt outstanding, which consisted primarily of outstanding borrowings under the Revolving Credit Facility in the U.S.\nOther Risks\nCustomer Concentration. Financial instruments that potentially subject the Company to concentrations of credit risk primarily consist of accounts receivable. The Company generally does not require collateral from customers. The Companys largest customer, Walmart Inc. and its affiliates (collectively, Walmart), accounted for approximately 19% of consolidated net sales in fiscal 2023. No other customer accounted for more than 10% of the Companys consolidated net sales. Purchases by Walmart included products from all of the Companys segments. Additionally, in fiscal 2023, Target Corporation represented approximately 9% of consolidated net sales for the Sun and Skin Care segment and 10% of consolidated net sales for the Feminine Care segment, respectively.\nProduct Concentration. Within the Wet Shave segment, the Companys razor and blades represented 49%, 51% and 52% of consolidated net sales during fiscal 2023, 2022 and 2021, respectively, and within the Sun and Skin Care segment, sun care products represented 20%,19%, and 16% of consolidated net sales during each of fiscal 2023, 2022 and 2021.\nCash Flow Hedges\nAt September 30, 2023, the Company maintained a cash flow hedging program related to foreign currency risk. These derivative instruments have a high correlation to the underlying exposure being hedged and have been deemed highly effective by the Company for accounting purposes in offsetting the associated risk.\nThe Company entered into a series of forward currency contracts to hedge cash flow uncertainty associated with currency fluctuations. These transactions are accounted for as cash flow hedges. The Company had unrealized pre-tax gains of $4.4 and $11.3 at September 30, 2023 and 2022, respectively, on these forward currency contracts, which are accounted for as cash flow hedges included in AOCI. Assuming foreign exchange rates versus the U.S. dollar remain at September 30, 2023 levels over the next 12 months, the majority of the pre-tax gain included in AOCI at September 30, 2023 is expected to be included in Other expense (income), net in the Consolidated Statements of Earnings and Comprehensive Income. Contract maturities for these hedges extend into fiscal year 2025. At September 30, 2023, there were 64 open foreign currency contracts with a total notional value of $105.4.\nDerivatives not Designated as Hedges\nThe Company has entered into foreign currency derivative contracts, which are not designated as cash flow hedges for accounting purposes to hedge balance sheet exposures and, thus, are not subject to significant market risk. The change in estimated fair value of the foreign currency contracts resulted in gains of $3.0, $8.2, and $2.3 for fiscal 2023, 2022, and 2021, respectively, which were recorded in Other expense (income), net in the Consolidated Statements of Earnings and Comprehensive Income. At September 30, 2023, there were five open foreign currency derivative contracts which were not designated as cash flow hedges with a total notional value of $34.5.\nThe following table provides estimated fair values of derivative instruments:\nFair Value of (Liability) Asset (1)\nSeptember 30,\nSeptember 30,\nDerivatives designated as cash flow hedging relationships:\nForeign currency contracts $ 4.4 $ 11.3\nDerivatives not designated as cash flow hedging relationships:\nForeign currency contracts $ 0.9 $ 2.0\n(1)All derivative assets are presented in Other current assets or Other assets. All derivative liabilities are presented in Other current liabilities or Other liabilities.\nThe following table provides the amounts of gains and losses on derivative instruments:\nFiscal Year\n2023 2022 2021\nDerivatives designated as cash flow hedging relationships:\nForeign currency contracts\nGain recognized in OCI (1)\n$ 1.1 $ 19.2 $ 3.1\nGain (loss) reclassified from AOCI into income (effective portion) (1) (2)\n8.0 11.2 (3.2)\nDerivatives not designated as cash flow hedging relationships:\nForeign currency contracts\nGain recognized in income (2)\n$ 3.0 $ 8.2 $ 2.3\n(1)Each of these derivative instruments had a high correlation to the underlying exposure being hedged for the periods indicated and had been deemed highly effective in offsetting associated risk.\n(2)Gain (loss) was recorded in Other expense (income), net.\nThe following table provides financial assets and liabilities for balance sheet offsetting:\nAs of September 30, 2023\nAs of September 30, 2022\nAssets (1)\nLiabilities (2)\nAssets (1)\nLiabilities (2)\nForeign currency contracts\nGross amounts of recognized assets (liabilities) $ 6.1 $ (0.7) $ 13.4 $ (0.5)\nGross amounts offset in the balance sheet (0.2) 0.4 - 0.4\nNet amounts of assets (liabilities) presented in the balance sheet $ 5.9 $ (0.3) $ 13.4 $ (0.1)\n(1)All derivative assets are presented in Other current assets or Other assets.\n(2)All derivative liabilities are presented in Other current liabilities or Other liabilities.\nFair Value Hierarchy\nAccounting guidance on fair value measurements for certain financial assets and liabilities requires that assets and liabilities carried at fair value be classified in one of the following three categories:\nLevel 1: Quoted market prices in active markets for identical assets or liabilities.\nLevel 2: Observable market based inputs or unobservable inputs that are corroborated by market data.\nLevel 3: Unobservable inputs reflecting the reporting entitys own assumptions or external inputs from inactive markets.\nUnder the fair value accounting guidance hierarchy, an entity is required to maximize the use of quoted market prices and minimize the use of unobservable inputs. The following table sets forth the Companys financial assets and liabilities, which are carried at fair value, that are measured on a recurring basis during the period, all of which are classified as Level 2 within the fair value hierarchy:\nAs of September 30,\n2023 2022\n(Liabilities) Assets at estimated fair value:\nDeferred compensation $ (19.4) $ (21.8)\nDerivatives - foreign currency contracts 5.6 13.3\nNet liabilities at estimated fair value $ (13.8) $ (8.5)\nAt September 30, 2023 and 2022, the Company had no Level 1 or Level 3 financial assets or liabilities, other than pension plan assets which contained certain assets classified as Level 1. Refer to Note 12 of Notes to Consolidated Financial Statements for the fair value hierarchy of the pension plan assets.\nAt September 30, 2023 and 2022, the fair market value of fixed rate long-term debt was $1,028.6 and $945.9, respectively, compared to its carrying value of $1,250.0 in each period. The estimated fair value of the fixed-rate long-term debt is estimated using yields obtained from independent pricing sources for similar types of borrowing arrangements. There was no variable rate debt excluding revolving credit facilities as of September 30, 2023. The estimated fair values of long-term debt, excluding the Revolving Credit Facility has been determined based on Level 2 inputs.\nDue to the nature of cash and cash equivalents and short-term borrowings, including notes payable, carrying amounts on the balance sheets approximate fair value. Additionally, the carrying amount of the Revolving Credit Facility, which are classified as long-term debt on the balance sheet, approximate fair value due to the revolving nature of the balances. The estimated fair value of cash and cash equivalents, short-term borrowings and the Revolving Credit Facility have been determined based on Level 2 inputs.\nAs of September 30, 2023, the estimated fair value of foreign currency contracts is the amount that the Company would receive or pay to terminate the contracts, considering first the quoted market prices of comparable agreements or, in the absence of quoted market prices, factors such as interest rates, currency exchange rates and remaining maturities. The estimated fair value of the deferred compensation liability is determined based upon the quoted market prices of the investment options that are offered under the plan.\nNote 17 - Commitments and Contingencies\nLegal Proceedings\nDuring the year ended September 30, 2023, the Company settled a legal matter which resulted in a gain of $4.9 related to an intellectual property claim against a third party. This was included in SG&A in the Consolidated Statements of Earnings and Comprehensive Income. The Company received payment for the intellectual property claim settlement in fiscal 2023.\nAdditionally, during the year ended September 30, 2023, the Company received a favorable court ruling regarding an international VAT matter, which the plaintiff has no ability to appeal. As the Company had previously recorded an accrual for this matter, based on its best estimate of the facts and circumstances at that time, the result of the favorable court ruling was a release of the reserve established which resulted in a gain of $2.2. This was included in SG&A in the Consolidated Statements of Earnings and Comprehensive Income.\nDuring the year ended September 30, 2022, the Company settled certain legal matters which resulted in a gain of $7.5 related to intellectual property claims against a third party. This was included in SG&A in the Consolidated Statements of Earnings and Comprehensive Income. The Company received payment for the settlement in fiscal 2022.\nThe Company and its subsidiaries are subject to a number of legal proceedings in various jurisdictions arising out of its operations during the ordinary course of business. Many of these legal matters are in preliminary stages and involve complex issues of law and fact and may proceed for protracted periods of time. The amount of liability, if any, from these proceedings cannot be determined with certainty. The Company reviews its legal proceedings and claims, regulatory reviews and inspections and other legal proceedings on an ongoing basis and follows appropriate accounting guidance when making accrual and disclosure decisions. The Company establishes accruals for those contingencies when the incurrence of a loss is probable and can be reasonably estimated and discloses the amount accrued and the amount of a reasonably possible loss in excess of the amount accrued if such disclosure is necessary for its financial statements to not be misleading. The Company does not record liabilities when the likelihood that the liability has been incurred is probable, but the amount cannot be reasonably estimated. Based upon present information, the Company believes that its liability, if any, arising from such pending legal proceedings, asserted legal claims, and known potential legal claims which are likely to be asserted, is not reasonably likely to be material to its financial position, results of operations or cash flows, when taking into account established accruals for estimated liabilities.\nGovernment Regulation and Environmental Matters\nThe operations of the Company are subject to various federal, state, local, and foreign laws and regulations intended to protect the public health and environment.\nContamination has been identified at certain of the Companys current and former facilities, as well as third-party waste disposal sites, and the Company is conducting investigation and remediation activities in relation to such properties. In connection with certain sites, the Company has received notices from the U.S. Environmental Protection Agency, state agencies and private parties, that it has been identified as a potentially responsible party (PRP) under the Comprehensive Environmental Response, Compensation and Liability Act of 1980 (CERCLA), and may be required to share in the cost of cleanup with respect to a number of federal Superfund sites. The Company may also be required to share in the cost of cleanup with respect to state-designated sites, and certain international locations, as well as any of its own properties.\nAccrued environmental costs at September 30, 2023 were $9.3 and were recorded in Other Current Liabilities and Other Liabilities within the Consolidated Balance Sheets.The amount of the Companys ultimate liability in connection with those sites may depend on many factors, including the volume and toxicity of material contributed to the site, the number of other PRPs and their financial viability, and the remediation methods and technology to be used. Total environmental capital expenditures and operating expenses are not expected to have a material effect on the Companys total capital and operating expenditures, cash flows, earnings or competitive position. Current environmental spending estimates may be modified as a result of changes in the Companys plans or its understanding of the underlying facts, changes in legal requirements, including any requirements related to global climate change, or other factors.\nMany European countries, as well as the European Union, have been very active in adopting and enforcing environmental regulations. As such, it is possible that new regulations may increase the risk and expense of doing business in such countries.\nCertain of the Companys products are subject to regulation under the U.S. Federal Food, Drug and Cosmetic Act and are regulated by the U.S. Food and Drug Administration.\nNote 18 - Segment and Geographical Data\nSegment performance is evaluated based on segment profit, exclusive of general corporate expenses, share-based compensation costs, and certain costs deemed non-recurring in nature, including restructuring and related costs, acquisition and integration costs, stock keeping unit (SKU) rationalization, Sun Care reformulation, income from resolution of legal matters and other costs or income, pension settlement expense, value-added tax (VAT) settlements, cost of early debt retirement, other costs or income, the amortization of intangible assets, and the related tax effects of these items. Financial items, such as interest income and expense, are managed on a global basis at the corporate level. The exclusion of such charges from segment results reflects managements view on how it evaluates segment performance. Amounts have been revised to reflect the correction of certain immaterial misstatements. Refer to Note 1 of Notes to Consolidated Financial Statements, for further discussion.\nThe Companys operating model includes some shared business functions across the segments, including product warehousing and distribution, transaction processing functions and, in most cases, a combined sales force and management teams. The Company applies a fully allocated cost basis, in which shared business functions are allocated among the segments. Such allocations are estimates and do not represent the costs of such services if performed on a stand-alone basis.\nSegment net sales and profitability are presented below:\nFiscal Year\n2023 2022 2021\nNet Sales\nWet Shave $ 1,230.9 $ 1,242.5 $ 1,215.9\nSun and Skin Care 705.5 638.5 585.3\nFeminine Care 315.2 290.7 286.1\nTotal net sales $ 2,251.6 $ 2,171.7 $ 2,087.3\nSegment Profit\nWet Shave $ 158.3 $ 174.5 $ 221.5\nSun and Skin Care 137.4 108.8 99.0\nFeminine Care 49.7 31.5 37.5\nTotal segment profit 345.4 314.8 358.0\nGeneral corporate and other expenses (68.7) (54.0) (56.5)\nRestructuring and related costs (1)\n(17.1) (16.2) (30.1)\nAcquisition and integration costs (2)\n(7.5) (9.9) (8.4)\nSKU rationalization (3)\n1.7 (22.5) -\nSun Care reformulation (4)\n(1.9) (4.6) (1.1)\nLegal matters, net income (5)\n6.3 7.5 -\nVAT settlement costs (6)\n- (3.4) -\nPension settlement expense (7)\n(7.9) (1.8) -\nCost of early retirement of long-term debt - - (26.1)\nOther (8)\n(0.4) - -\nAmortization of intangibles (30.8) (29.4) (22.0)\nInterest and other expense, net (71.4) (56.4) (66.7)\nTotal earnings before income taxes $ 147.7 $ 124.1 $ 147.1\nDepreciation and amortization\nWet Shave $ 37.1 $ 36.4 $ 39.9\nSun and Skin Care 15.1 15.4 15.6\nFeminine Care 8.4 8.7 9.6\nTotal segment depreciation and amortization 60.6 60.5 65.1\nCorporate 30.8 29.4 22.0\nTotal depreciation and amortization $ 91.4 $ 89.9 $ 87.1\nFiscal Year\n2023 2022 2021\nTotal Assets\nWet Shave $ 724.1 $ 751.4\nSun and Skin Care 316.1 276.8\nFeminine Care 163.2 159.1\nTotal segment assets 1,203.4 1,187.3\nCorporate (9)\n232.1 207.0\nGoodwill and other intangible assets, net 2,305.2 2,318.8\nTotal assets $ 3,740.7 $ 3,713.1\nCapital Expenditures\nWet Shave $ 31.2 $ 36.1 $ 36.1\nSun and Skin Care 12.2 12.4 12.2\nFeminine Care 6.1 7.9 8.5\nTotal capital expenditures 49.5 56.4 56.8\n(1)Includes Restructuring and related costs of $0.2, $0.1 and $0.6 included within COGS and $0.3, $0.8 and $8.7 within SG&A for fiscal 2023, 2022 and 2021, respectively, related to actions to strengthen our operating model.\n(2)Includes SG&A of $7.5, $9.1, and $7.1 for fiscal 2023, 2022, and 2021, respectively, related to integration expenses associated with acquisitions and Cost of products sold of nil, $0.8, and $1.3 related to the valuation of acquired inventory for fiscal 2023, 2022, and 2021, respectively.\n(3)In fiscal 2022, we recorded a charge of $22.5 in COGS for the write-off of certain Wet Ones SKUs and related contract termination charges. In fiscal 2023, we released a reserve of $1.7 related to certain accrued expenses associated with the write-off of inventory related to these SKUs. Wet Ones products are included within the Sun and Skin Care segment.\n(4)Includes pre-tax research and development (R&D) costs of $3.3 for fiscal 2023. In fiscal 2023, we released a reserve of $1.4 related to certain accrued expenses associated with the recall and destruction of certain Sun Care products, within COGS. In fiscal 2022 and 2021 we recorded costs of $3.5 and $1.1 respectively, related to the reformulation, recall, and destruction of certain Sun Care products within COGS.\n(5)Includes pre-tax SG&A of $6.3 and $7.5 for fiscal 2023 and 2022, respectively, related to the resolution of legal matters. See Note 17 of the Notes to Consolidated Financial Statements.\n(6)Includes pre-tax SG&A of $3.4 for the fiscal 2022 related to the estimated settlement of prior years value-added tax audits in Germany.\n(7)Includes pre-tax Other expense (income), net of $7.9 and $1.8 for fiscal 2023 and 2022, respectively, related to pension settlement expenses.\n(8)Includes pre-tax SG&A of $0.4 for fiscal 2023 related to the write off of assets associated with a prior year divestiture.\n(9)Corporate assets include all cash and cash equivalents, financial instruments and deferred tax assets that are managed outside of operating segments.\nThe following table presents the Companys net sales and long-lived assets by geographic area:\nFiscal Year\n2023 2022 2021\nNet Sales to Customers\nUnited States $ 1,326.1 $ 1,306.5 $ 1,183.6\nInternational 925.5 865.2 903.7\nTotal net sales $ 2,251.6 $ 2,171.7 $ 2,087.3\nLong-lived Assets\nUnited States $ 221.6 $ 239.3\nGermany 73.7 61.1\nOther International 75.7 65.7\nTotal long-lived assets excluding goodwill and other intangibles, net, and other assets $ 371.0 $ 366.1\nThe Companys international net sales are derived from customers in numerous countries, with no sales to any individual foreign country exceeding 10% of the Companys total Net sales. For information on customer concentration and product concentration risk, see Note 16 of Notes to Consolidated Financial Statements.\nSupplemental product information is presented below for net sales:\nFiscal Year\n2023 2022 2021\nRazors and blades $ 1,103.6 $ 1,108.8 $ 1,084.6\nSun care products 450.7 401.8 333.6\nTampons, pads and liners 315.2 290.7 286.1\nShaving gels and creams 127.3 133.7 131.3\nGrooming products 172.5 158.7 148.9\nWipes and other skin care 82.3 78.0 102.8\nTotal net sales $ 2,251.6 $ 2,171.7 $ 2,087.3\nNote 19 - Quarterly Financial Information (Unaudited)\nThe following tables present selected unaudited financial data for each of the eight quarters in the two-year period ended September 30, 2023, which have been updated to reflect the revisions discussed in Note 1 of Notes to Consolidated Financial Statements.\nFiscal 2023 Q1 Q2 Q3 Q4\nNet sales $ 469.1 $ 598.4 $ 650.0 $ 534.1\nGross profit 189.6 242.3 280.3 228.6\nNet earnings 12.4 19.4 53.0 29.9\nEarnings per share:\nBasic earnings per share (1)\n0.24 0.38 1.04 0.59\nDiluted earnings per share (1)\n0.24 0.37 1.02 0.58\n(1) Quarterly and annual computations are prepared independently. Therefore, the sum of each quarter may not necessarily total the fiscal period amounts noted elsewhere within this Annual Report on Form 10-K.\nFiscal 2022 Q1 Q2 Q3 Q4\nNet sales $ 463.3 $ 547.7 $ 623.8 $ 536.9\nGross profit 190.2 230.4 240.9 219.0\nNet earnings 11.5 23.5 30.8 33.7\nEarnings per share:\nBasic earnings per share (1)\n0.21 0.43 0.59 0.65\nDiluted earnings per share (1)\n0.20 0.43 0.58 0.64\n(1) Quarterly and annual computations are prepared independently. Therefore, the sum of each quarter may not necessarily total the fiscal period amounts noted elsewhere within this Annual Report on Form 10-K.\nThe impact of the revision on the previously reported unaudited quarterly financial data is as follows:\nThree Months Ended June 30, 2023\nAs Previously Reported Adjustment As Revised\nNet sales $ 650.0 $ - $ 650.0\nGross profit 279.7 0.6 280.3\nNet earnings 52.5 0.5 53.0\nEarnings per share:\nBasic net earnings per share $ 1.03 $ 0.01 $ 1.04\nDilutive net earnings per share 1.01 0.01 1.02\nThree Months Ended March 31, 2023\nAs Previously Reported Adjustment As Revised\nNet sales $ 598.4 $ - $ 598.4\nGross profit 241.7 0.6 242.3\nNet earnings 19.0 0.4 19.4\nEarnings per share:\nBasic net earnings per share $ 0.37 $ 0.01 $ 0.38\nDilutive net earnings per share 0.37 - 0.37\nThree Months Ended December 31, 2022\nAs Previously Reported Adjustment As Revised\nNet sales $ 469.1 $ - $ 469.1\nGross profit 189.0 0.6 189.6\nNet earnings 11.9 $ 0.5 12.4\nEarnings per share:\nBasic net earnings per share $ 0.23 $ 0.01 $ 0.24\nDilutive net earnings per share 0.23 0.01 0.24\nThree Months Ended September 30, 2022\nAs Previously Reported Adjustment As Revised\nNet sales $ 536.9 $ - $ 536.9\nGross profit 218.8 0.2 219.0\nNet earnings 33.7 - 33.7\nEarnings per share:\nBasic net earnings per share $ 0.65 $ - $ 0.65\nDilutive net earnings per share 0.64 - 0.64\nThree Months Ended June 30, 2022\nAs Previously Reported Adjustment As Revised\nNet sales $ 623.8 $ - $ 623.8\nGross profit 240.6 0.3 240.9\nNet earnings 30.5 0.3 30.8\nEarnings per share:\nBasic net earnings per share $ 0.58 $ 0.01 $ 0.59\nDilutive net earnings per share 0.57 0.01 0.58\nThree Months Ended March 31, 2022\nAs Previously Reported Adjustment As Revised\nNet sales $ 547.7 $ - $ 547.7\nGross profit 230.1 0.3 230.4\nNet earnings 23.2 0.3 23.5\nEarnings per share:\nBasic net earnings per share $ 0.43 $ - $ 0.43\nDilutive net earnings per share 0.43 - 0.43\nThree Months Ended December 31, 2021\nAs Previously Reported Adjustment As Revised\nNet sales $ 463.3 $ - $ 463.3\nGross profit 189.9 0.3 190.2\nNet earnings 11.2 0.3 11.5\nEarnings per share:\nBasic net earnings per share $ 0.21 $ - $ 0.21\nDilutive net earnings per share 0.20 - 0.20 Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures designed to ensure that information required to be disclosed in reports filed under the Securities Exchange Act of 1934, as amended (the Exchange Act), is recorded, processed, summarized and reported within the specified time periods, and that such information is accumulated and communicated to management, including our Chief Executive Officer (CEO) and Chief Financial Officer (CFO), as appropriate, to allow timely decisions regarding required disclosure.\nOur management, with the participation of our CEO and CFO, evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) as of September 30, 2023. Based on that evaluation, our CEO and CFO concluded that, as of that date, our disclosure controls and procedures were effective.\nManagements Report on Internal Control Over Financial Reporting\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting, as defined under Exchange Act Rules 13a-15(f) and 15d-15(f). The Companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with generally accepted accounting principles (GAAP) for external purposes. The Companys internal control over financial reporting includes those policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements. Internal control over financial reporting, because of its inherent limitations, may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Management conducted an assessment of the effectiveness of the Companys internal control over financial reporting based on the framework set forth in Internal Control - Integrated Framework (2013), issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on the Companys assessment, management has concluded that internal control over financial reporting as of September 30, 2023 was effective.\nThe Companys internal control over financial reporting as of September 30, 2023 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report that appears herein.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting during the quarter ended September 30, 2023 that have materially affected, or are likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nInformation regarding our directors will be included in our definitive proxy statement for our annual meeting of shareholders, which will be filed with the United States Securities and Exchange Commission (SEC) within 120 days after September 30, 2023.\nInformation regarding our executive officers is included in Item 1. Business of this Annual Report on Form 10-K.\nWe have adopted business practices and standards of conduct that are applicable to all employees, including our CEO and CFO. We have also adopted a code of business conduct applicable to our Board of Directors. The codes have been posted on the Investor section of our website at www.edgewell.com. In the event that an amendment to, or a waiver from, a provision of one of the codes of ethics occurs and it is determined that such amendment or waiver is subject to the disclosure provisions of Item 5.05 of Current Report on Form 8-K, we intend to satisfy such disclosure by posting such information on our website for at least a 12-month period. Item 11. Executive Compensation.\nInformation regarding the compensation of our named executive officers and directors will be included in our definitive proxy statement for our annual meeting of shareholders, which will be filed with the SEC within 120 days after September 30, 2023. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nInformation regarding individuals or groups that own more than five percent of our common shares, as well as information regarding the security ownership of our executive officers and directors, information relating to securities authorized for issuance under equity compensation plans and other shareholder matters will be included in our definitive proxy statement for our annual meeting of shareholders, which will be filed with the SEC within 120 days after September 30, 2023. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nInformation regarding transactions with related parties and director independence will be included in our definitive proxy statement for our annual meeting of shareholders, which will be filed with the SEC within 120 days after September 30, 2023. Item 14. Principal Accounting Fees and Services.\nInformation regarding the services provided by and fees paid to PricewaterhouseCoopers LLP (PCAOB ID 238), our independent auditors, will be included in our definitive proxy statement for our annual meeting of shareholders, which will be filed with the SEC within 120 days after September 30, 2023.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\nDocuments filed as part of this report:\n1)Financial Statements. The following are included within Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\n◦Report of Independent Registered Public Accounting Firm.\n◦Consolidated Statements of Earnings and Comprehensive Income for the fiscal years ended September 30, 2023, 2022 and 2021.\n◦Consolidated Balance Sheets as of September 30, 2023 and 2022.\n◦Consolidated Statements of Cash Flows for the fiscal years ended September 30, 2023, 2022 and 2021.\n◦Consolidated Statements of Changes in Shareholders Equity for the period from October 1, 2020 to September 30, 2023.\n◦Notes to Consolidated Financial Statements.\n2)Financial Statement Schedules.\nSchedule II - Valuation and Qualifying Accounts\nFiscal Year\n2023 2022 2021\nAllowance for Doubtful Accounts\nBalance at beginning of year 3.9 6.9 8.2\nProvision charged to expense, net of reversals 1.7 (2.9) (0.7)\nWrite-offs, less recoveries, translation, other - (0.3) (0.6)\nAllowance for acquired receivables - 0.2 -\nBalance at end of year $ 5.6 $ 3.9 $ 6.9\nIncome Tax Valuation Allowance\nBalance at beginning of year 10.3 9.4 8.5\nProvision charged to expense 6.0 0.7 1.0\nWrite-offs, less recoveries, translation, other 2.0 0.2 (0.1)\nBalance at end of year $ 18.3 $ 10.3 $ 9.4\n3)Exhibits. The exhibits are included in the Exhibit Index that appears at the end of this Annual Report on Form 10-K.\nItem 16. Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nEDGEWELL PERSONAL CARE COMPANY\nBy: /s/ Rod R. Little\nRod R. Little\nPresident and Chief Executive Officer\nDate: November 28, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and as of the date indicated.\nSignature Title\n/s/ Rod R. Little\nRod R. Little (principal executive officer)\nPresident and Chief Executive Officer\n/s/ Daniel J. Sullivan\nDaniel J. Sullivan (principal financial officer)\nChief Financial Officer\n/s/ Robert A. Schmidt\nRobert A. Schmidt (principal accounting officer)\nChief Accounting Officer\n/s/ Robert Black\nRobert Black Director\n/s/ George Corbin\nGeorge Corbin Director\n/s/ Carla C. Hendra\nCarla C. Hendra Director\n/s/ John C. Hunter\nJohn C. Hunter Director\n/s/ James C. Johnson\nJames C. Johnson Director\n/s/ Joseph D. OLeary\nJoseph D. OLeary Director\n/s/ Rakesh Sachdev\nRakesh Sachdev Director\n/s/ Swan Sit\nSwan Sit Director\n/s/ Gary Waring\nGary Waring Director\nNovember 28, 2023\nEXHIBIT INDEX\nExhibit Number Exhibit\n2.1**** Separation and Distribution Agreement by and between the Company and Energizer Holdings, Inc. dated as of June 25, 2015 (incorporated by reference to Exhibit 2.1 to the Company's Current Report on Form 8-K filed June 29, 2015).\n2.2**** Tax Matters Agreement by and between the Company and Energizer Holdings, Inc. dated as of June 26, 2015 (incorporated by reference to Exhibit 2.2 to the Company's Current Report on Form 8-K filed June 29, 2015).\n2.3**** Employee Matters Agreement by and between the Company and Energizer Holdings, Inc. dated as of June 25, 2015 (incorporated by reference to Exhibit 2.3 to the Company's Current Report on Form 8-K filed June 29, 2015).\n2.4**** Transition Services Agreement by and between the Company and Energizer Holdings, Inc. dated as of June 25, 2015 (incorporated by reference to Exhibit 2.4 to the Company's Current Report on Form 8-K filed June 29, 2015).\n2.5**** Contribution Agreement by and between the Company and Energizer Holdings, Inc. dated June 30, 2015 (incorporated by reference to Exhibit 2.1 to the Company's Current Report on Form 8-K filed July 1, 2015).\n2.6 Agreement and Plan of Merger by and among Edgewell Personal Care Company, Callahan Corp., Harrys Inc. and the Person party thereto solely in its capacity as the Stockholder Representative, dated as of May 8, 2019 (incorporated by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K filed May 13, 2019).\n2.7 Membership Interest Purchase Agreement by and among Edgewell Personal Care Company, solely for purposes of Section 13.17, Edgewell Personal Care, LLC, Cremo Holding Company, LLC, the sellers named therein, and the Joint Holder Representatives named therein, dated as of August 1, 2020.\n3.1 Amended and Restated Articles of Incorporation of the Company (incorporated by reference to Exhibit 3.1 to the Company's Quarterly Report on Form 10-Q for the quarter ended December 31, 2013).\n3.2 Articles of Merger effective June 30, 2015 (incorporated by reference to Exhibit 3.1 to the Company's Current Report on Form 8-K filed July 1, 2015).\n3.3 Amended and Restated Bylaws of the Company effective November 5, 2020 (incorporated by reference to Exhibit 3.3 to the Companys Annual Report on Form 10-K filed November 20,2020).\n4.1 Indenture, dated as of May 19, 2011, by and among the Company, the guarantors named therein, and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.1 of the Company's Current Report on Form 8-K, filed May 19, 2011).\n4.2 First Supplemental Indenture, dated as of May 19, 2011, by and among the Company, the guarantors named therein, and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 of the Company's Current Report on Form 8-K, filed May 19, 2011).\n4.3 Second Supplemental Indenture (including the Form of Note), dated as of May 24, 2012, by and among the Company, the guarantors named therein and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to the Company's Current Report on Form 8-K filed May 24, 2012).\n10.1 Credit Agreement, dated June 1, 2015, by and among the Company, as borrower, JPMorgan Chase Bank, N.A., as administrative agent, and Bank of America, N.a., The Bank of Tokyo-Mitsubishi UFJ, Ltd., and Citibank, N.A., as co-syndication agents (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed June 1, 2015).\n10.2 Omnibus Amendment No. 1 dated as of September 25, 2015 to Credit Agreement and Subsidiary Guaranty by and among Edgewell Personal Care Company, as borrower, Edgewell Personal Care Brands, LLC, as new subsidiary borrower, certain other subsidiaries of Edgewell, as subsidiary guarantors, JPMorgan Chase Bank, N.A., as administrative agent, Bank of America, N.A., The Bank of Tokyo-Mitsubishi UFJ, Ltd., and Citibank, N.A., as co-syndication agents, and the various lenders who are a party thereto (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed September 29, 2015).\n10.3 Amendment No. 2 to Credit Agreement by and among Edgewell Personal Care Company, as borrower, Edgewell Personal Care Brands, LLC, as subsidiary borrower, certain other subsidiaries of Edgewell Personal Care Company, as subsidiary guarantors, JPMorgan Chase Bank, N.A., as administrative agent, and the various lenders who are a party thereto (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed April 29, 2016).\n10.4 Amendment No. 3 to Credit Agreement dated as of March 13, 2017, by and among Edgewell Personal Care Company, as borrower, Edgewell Personal Care Brands, LLC, as subsidiary borrower, certain other subsidiaries of Edgewell Personal Care Company, as subsidiary guarantors, JPMorgan Chase Bank, N.A., as administrative agent, Bank of America, N.A., as syndication agent, and the various lenders who are a party thereto (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed March 14, 2017).\n10.5 Increasing Lender Supplement dated as of March 13, 2017, by and among The Bank of Tokyo-Mitsubishi UFJ, Ltd., as increasing lender, Edgewell Personal Care Company, as borrower, and JPMorgan Chase Bank, N.A., as administrative agent (incorporated by reference to Exhibit 10.2 to the Company's Current Report on Form 8-K filed March 14, 2017).\n10.6 Credit Agreement by and among Edgewell Personal Care Netherlands B.V., as borrower, the Company, and The Bank of Tokyo-Mitsubishi UFJ, Ltd., as Administrative Agent (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed June 15, 2015).\n10.7 Amendment No. 1 dated as of September 25, 2015 to Credit Agreement by and among Edgewell Personal Care Netherlands B.V., Edgewell Personal Care Company, the institutions listed on the signature pages thereto and the Bank of Tokyo-Mitsubishi UFJ, Ltd., as the administrative agent for the lenders referred to therein (incorporated by reference to Exhibit 10.2 to the Company's Current Report on Form 8-K filed September 29, 2015).\n10.8 Master Accounts Receivable Purchase Agreement dated as of September 15, 2017 among Edgewell Personal Care, LLC, as the Seller, Edgewell Personal Care Company, as Guarantor, and The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch, as the Purchaser (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed September 19, 2017).\n10.9 Sixth Amendment to Master Accounts Receivable Purchase Agreement, dated as of February 7, 2022, between the Company and MUFG Bank, Ltd. (incorporated by reference to Exhibit 10.4 to the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2022).\n10.10 Credit Agreement, dated as of March 28, 2020, by and among, inter alia, the Company, the subsidiaries of the Company from time to time parties thereto, the lenders from time to time parties thereto, MUFG, as syndication agent, TD as joint lead arranger and BofA, as administrative agent and collateral agent (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed April 2, 2020).\n10.11 Indenture, dated as of May 22, 2020, among Edgewell Personal Care Company, the guarantors party thereto and the Trustee (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed May 22, 2020.\n10.12 Indenture, dated as of March 8, 2021, among Edgewell Personal Care Company, the guarantors party thereto and the Trustee (incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed March 8, 2021).\n10.13 Trademark License Agreement by and between the Company and Energizer Brands, LLC dated June 25, 2015 (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed June 29, 2015).\n10.14 Trademark License Agreement by and between the Company and Wilkinson Sword GmbH, as licensors, and Energizer Holdings, Inc. dated June 25, 2015 (incorporated by reference to Exhibit 10.2 to the Company's Current Report on Form 8-K filed June 29, 2015).\n10.15 Tax Sharing Agreement (incorporated by reference to Exhibit 2.2 of the Companys Post-Effective Amendment No. 1 to Form 10, filed April 19, 2000).\n10.16*** A Summary of the Company's director compensation program (incorporated by reference to the Company's Definitive Proxy Statement for the fiscal year ended September 30, 2016).\n10.17*** Form of Indemnification Agreement (for directors with existing agreements) (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed May 28, 2015).\n10.18*** Form of Indemnification Agreement (for new directors) (incorporated by reference to Exhibit 10.2 to the Company's Current Report on Form 8-K filed May 28, 2015).\n10.19*** Second Amended and Restated 2009 Incentive Stock Plan (incorporated by reference to Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q for the quarter ended December 31, 2013).\n10.20*** Form of Non-Qualified Stock Option Agreement (incorporated by reference to Exhibit 10.2 to the Company's Current Report on Form 8-K filed July 10, 2015).\n10.21*** Form of Change of Control Agreement with certain Executive Officers (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed May 2, 2017).\n10.22*** January 1, 2015 Restatement of the Company's Executive Savings Investment Plan (incorporated by reference to Exhibit 10.21 to the Company's Annual Report on Form 10-K for the year ended September 30, 2015).\n10.23*** Amendment to the Company's Executive Savings Investment Plan, effective July 1, 2015 (incorporated by reference to Exhibit 10.12 to the Company's Quarterly Report on Form 10-Q for the quarter ended June 30, 2015).\n10.24*** 2010 Restatement of the Company's Supplemental Executive Retirement Plan dated October 15, 2010 (incorporated by reference to Exhibit 10.54 of Amendment No. 1 to the Company's Annual Report on Form 10-K/A, filed May 16, 2011).\n10.25*** First Amendment to the 2010 Restatement of the Company's Supplemental Executive Retirement Plan, effective July 1, 2015 (incorporated by reference to Exhibit 10.24 to the Company's Annual Report on Form10-K for the year ended September 30, 2015).\n10.26*** Second Amendment to the 2010 Restatement of the Company's Supplemental Executive Retirement Plan, effective July 1, 2015 (incorporated by reference to Exhibit 10.13 to the Company's Quarterly Report on Form 10-Q for the quarter ended June 30, 2015).\n10.27*** 2009 Restatement of the Company's Deferred Compensation Plan, as amended and restated effective as of January 1, 2009 (incorporated by reference to Exhibit 10 of the Company's Annual Report on Form 10-K for the year ended September 30, 2008).\n10.28*** First Amendment to the 2009 Restatement of the Company's Deferred Compensation Plan (incorporated by reference to Exhibit 4.3 to the Company's Registration Statement on Form S-8 filed November 21, 2012).\n10.29*** Amendment No. 2 to the 2009 Restatement of the Company's Deferred Compensation Plan (incorporated by reference to Exhibit 4.4 to the Company's Registration Statement on Form S-8 filed November 21, 2012).\n10.30*** Amendment No. 3 to 2009 Restatement of the Company's Deferred Compensation Plan, dated November 7, 2011 (incorporated by reference to Exhibit 10.59 to the Company's Annual Report on Form 10-K for the year ended September 30, 2012).\n10.31*** Amendment No. 4 to the 2009 Restatement of the Company's Deferred Compensation Plan (incorporated by reference to Exhibit 10.60 to the Company's Annual Report on Form 10-K for the year ended September 30, 2012).\n10.32*** Amendment to the 2009 Restatement of the Company's Deferred Compensation Plan, effective July 1, 2015 (incorporated by reference to Exhibit 10.14 to the Company's Quarterly Report on Form 10-Q for the quarter ended June 30, 2015).\n10.33*** Executive Group Personal Excess Liability Insurance Plan (incorporated by reference to Exhibit 10.9 of the Company's Post-Effective Amendment No. 1 to Form 10, filed April 19, 2000).\n10.34*** Amended and Restated Executive Officer Bonus Plan (incorporated by reference to Exhibit 10.36 to the Company's Annual Report on Form 10-K for the year ended September 30, 2016).\n10.35*** 2017 Edgewell Personal Care Company Financial Planning Plan (incorporated by reference to Exhibit 10.39 to the Company's Annual Report on Form 10-K for the year ended September 30, 2017.\n10.36*** Edgewell Personal Care Company Executive Severance Plan (incorporated by reference to Exhibit 10.4 to the Company's Quarterly Report on Form 10-Q for the quarter ended March 31, 2017).\n10.37*** Edgewell Personal Care Company Change in Control Plan (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed May 1, 2019).\n10.38*** Separation and General Release Agreement entered into on October 6, 2023 by and between John N. Hill and Edgewell Personal Care Company (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed October 11, 2023).\n21.1* Subsidiaries of Registrant.\n23.1* Consent of PricewaterhouseCoopers LLP, Independent Registered Public Accounting Firm.\n31.1* Certification of the Chief Executive Officer pursuant to Rule 13a-14(a) under the Securities Exchange Act of 1934, as amended, pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2* Certification of the Chief Financial Officer pursuant to Rule 13a-14(a) under the Securities Exchange Act of 1934, as amended, pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1** Certification of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2** Certification of the Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101* The following materials from the Edgewell Personal Care Company Annual Report on Form 10-K formatted in inline eXtensible Business Reporting Language (iXBRL): (i) the Consolidated Statements of Earnings and Comprehensive Income for the years ended September 30, 2021, 2022 and 2023, (ii) the Consolidated Balance Sheets at September 30, 2022 and 2023, (iii) the Consolidated Statements of Cash Flows for the years ended September 30, 2021, 2022 and 2023, (iv) Consolidated Statements of Changes in Shareholders Equity for the period from October 1, 2020 to September 30, 2023, and (v) Notes to Consolidated Financial Statements for the year ended September 30, 2023.\n*Filed herewith.\n**Furnished herewith.\n***Denotes a management contract or compensatory plan or arrangement.\n****The Company hereby undertakes to furnish supplementally a copy of any omitted schedule or exhibit to such agreement to the Securities and Exchange Commission upon request."
}