{
    "cik": "1098009",
    "company": "America Great Health",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "2834",
    "state_of_inc": "CA",
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1098009/0001185185-23-001064-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1098009/000118518523001064/amgreat20230630_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1098009/0001185185-23-001064.txt",
    "filename": "1098009_10K_2023_0001185185-23-001064.htm",
    "content": "ITEM 1. BUSINESS\nHistorical Development\nAmerica Great Health, formerly Crown Marketing, is a Wyoming corporation (the \"Company\"). A change of control of the Company was completed on January 19, 2017 from Jay Hooper, the former officer and director of the Company and its former majority shareholder. Control was obtained by the sale of 16,155,746,000 shares of Company common stock from Mr. Hooper to an investor group led by Mike Q. Wang. In connection with the change of control, the Company sold to its former majority shareholder a subsidiary for $100 and another subsidiary in exchange for the cancellation of all payables and accrued expenses. After December 31, 2016, the Companys operations are determined and structured by the new investor group. As such, the Company accounted for all of its assets, liabilities and results of operations up to January 1, 2017 as discontinued operations.\nOn March 1, 2017, the Company filed with the Secretary of State of the State of Wyoming an Articles of Amendment to change the corporate name from Crown Marketing to America Great Health.\nOn March 9, 2017, the Company formed a wholly owned subsidiary, America Great Health, under the laws of the State of California.\nOn June 24, 2019, the Company registered a wholly owned subsidiary in China, Meizhong Health Industry Development Co., Ltd. The subsidiary is mainly engaged in mergers and acquisitions, investments and financings, and marketing of medical equipment and health products in China.\nOn June 30, 2020, the Company and Purecell Group (Purecell), a leading anti-aging medical institution in Australia, entered into a Cooperation Agreement, in which the Company agreed to acquire 51% of the equity of Purecell. On April 6, 2021, the Company issued 510,000,000 shares of common stock to Purecells nominated trustee. Upon completion of the acquisition transaction, Purecell shall remain autonomous in its day-to-day operations, including recruiting and retaining management team members. Because the Company does not have significant control over Purecell, the acquisition is accounted for as an equity investment. This transaction was completed in May 2021.\nOn December 7, 2020, the Companys wholly owned Californian subsidiary, America Great Health, entered into a Cooperation Agreement with Brilliant Healthcare Limited (Brilliant) pursuant to which the parties will establish a joint venture in China (the JV Company) for the purpose of promoting and developing stem cell related products R&D, production, sales, raw material procurement, mergers and acquisitions, and consulting services. After the formation of the JV company is completed, the Company shall invest US$4.2 million in the JV Company within the next 24 months for a 60% equity ownership in the JV Company. Brilliant shall transfer its patented technology to the JV Company as its capital contribution, to account for a 40% equity interest in the JV Company. In June 2021, the JV Company was established in Hainan, China as Sijinsai (Hainan) Biological Tech Ltd. On July 9, 2021, the Company paid its first investment of $50,000.\nOn May 18 , 2021, the Company and David Tsai (Dr. Tsai), a pioneer in anti-cancer peptide research and invention in the United States, entered into a Cooperation Agreement, in which Dr. Tsai shall provide to the Company theories, technologies, methods, sources of raw materials, processing and production techniques, quality standards, quality control methods and other information and details related to his anti-cancer protein peptides, oral insulin and activation technology. Dr. Tsai shall also be responsible for the whole process of technology and product production, application and implementation, as well as professional technical support, consultation and cooperation in the process of product verification, publicity, promotion and sales. Currently, several patents are in the application process, and several products are in the process of getting ready for production.\nOn September 3, 2021, the Company entered into an Assets Acquisition Agreement with Wangs Property Investment & Management LLC to purchase 53 units in 19 real estate properties appraised at $7,626,286.37 for a purchase price of $7,000,000, The purchase price shall be paid as follows (i) 1,000,000 on execution of the Agreement, (ii) $2,000,000 within 60 days thereof and (iii) the remainder by April 10, 2022. The Agreement is subject to customary closing conditions, including, satisfactory due diligence. On September 9, 2021, the Company entered into a Supplemental Assets Acquisition Agreement with Wangs Property Investment & Management LLC to amend and clarify that (i) it was purchasing 19 real estate properties which includes 53 units appraised at $7,626,286.37 for a purchase price of $7,000,000 and (ii) that it will waive and not conduct due diligence in order for the transaction to proceed. The acquisition had been ceased by both sides without any liabilities and obligations to the Company and Wangs Property Investment & Management LLC.\nOn November 4, 2021, the Company set up a 100% owned subsidiary Nutrature Health LLC. On November 11, 2021, America Great Health (the Company) entered into an Advisory Committee Member Consulting Agreement with Dr. Kevin Buckman MD (Consultant). Pursuant to the Agreement, Consultant is to provide advisory services, as a member to the Advisory Committee to the Board of Directors of the Company, including without limitation, assisting GOF Biotechnologies Inc. in its new drug approval process for oral insulin and Amylase X. Consultant shall be compensated with a warrant to purchase 500,000 shares of the Company at $0.01 per share within 24 months and a warrant at each of the following stages: IND application, Phase I clinical trials, Phase II clinical trials, Phase III clinical trials and the sale of GOF Biotechnologies Inc. the license of oral insulin and Amylase X at Phase I or Phase II clinical trials stages. This Agreement shall be for an initial one year term and shall renew automatically for successive one-year terms up to a maximum of three (3) years unless terminated by either party pursuant to the Agreement. The Company issued 500,000 shares to Dr. Kevin Buckman MD on April 20, 2022.\nOn November 15, 2021, the Company set up a 100% owned subsidiary GOF Biotechnologies Inc. GOF is 75% majority owned (60,000,000 shares of common stock) by the Company and the remaining 25% of its issued and outstanding shares (20,000,000 shares of common stock) are held by Men Hwei, Tsai. On December 31, 2021, the Company entered into a Supplementary Agreement with Zhigong Lin to amend his prior employment agreement with the Company dated August 31, 2021. The Supplement Agreements provides, inter alia, that Zhigong Lin would be appointed Chief Executive Officer of GOF. The employment agreement and the supplement agreement had both been terminated without any liabilities and obligation to the Company and Zhigong Lin.\nOn February 4, 2021, the Company set up a 100% owned subsidiary International Institute of Great Health, Inc. (IIGH) under the laws of the State of California. The Company wholly owned research institute will bring together doctors and professor-level experts from different countries and regions in the world. The research fields involve biomedicine, clinical medicine, health management, information technology, data analysis, software development, artificial intelligence, industrial planning, financial investment, etc.\nOur Business\nPrior to the change in control on January 19, 2017, the Company sold consumer products. It acquired electronic products from manufacturers and then sold them directly to consumers so as to be more competitive in price. As of December 31, 2016, the Company ceased operations in this line of business.\nThe Company under the new management has focused its business in the health industry. With the asset acquisition from Wangs Property Investment &Management LLC, the Company attempted diversify its business into property investment and management. By the early May 2022, the acquisition had been ceased by both sides.\nApart from the acquisition of Purecell and the setting up of the JV Company, the Company is planning to make additional acquisitions. We have approached several health related companies in Asia Pacific and met the management of potential acquisition targets. Rapid economic advances in Asia Pacific in the last 20 years have greatly improved the living standards in Asia Pacific. This in turn brings demand in healthcare products and services. The Company feels strongly that despite the challenges of cross border business, it might be able to acquire some good growth companies and bring good values to our stockholders.\nOur mission is to invest in innovative technologies integrated with business development in the healthcare ecosystem.\nWe are focused on protein and peptide small molecular drugs research and development, diagnostic and medical devices with AI cloud computing, cell therapy, and re-generational medicine and supplements manufacturing and sales.\nEmployees and Outside Services\nThe company has 7 full-time employees as of report date. Remaining administrative (non-policy making) officers and consultants and technical personnel such as marketing specialists are being compensated as independent contractors. We pay these persons on a contract basis as required. ITEM 1A. RISK FACTORS\nThis item is inapplicable because we are a smaller reporting company as defined in Exchange Act Rule 12b-2. ITEM 1B. UNRESOLVED STAFF COMMENTS\nThis item is inapplicable because we are a smaller reporting company as defined in Exchange Act Rule 12b-2. ITEM 2. PROPERTIES\nThe Company currently is leasing an office building property in Los Angeles County California. The Company has entered into an operating leases agreement with GKT, Alhambra, LP. The lease term of the office space is from December 1, 2020 to November 30, 2023. The current monthly rent including monthly management fee is $4,655.64.\nThe Company has entered into an operating lease agreement with SoCal Industrial LLC, Irwindale. The lease term of the office space is from June 1, 2023 to May 31, 2024, after the prior lease expired on May 31, 2023. The current monthly rent including monthly management fee is $1,764.00. ITEM 3. LEGAL PROCEEDINGS\nNo legal proceedings are threatened or pending against us or any of our officers or directors. Further, none of our officers, directors or affiliates are parties against us or have any material interests in actions that are averse to the Companys interests. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is currently listed on the OTC Bulletin Board under the symbol AAGH. There has been limited trading of the common stock from December 2, 2013 (Inception) through June 30, 2023. The last sale price of our common stock on June 30, 2023, was 0.0139 per share.\nThe following table sets forth the high and low transaction price for each quarter within the fiscal years ended June 30, 2023 and 2022, as provided by the NASDAQ Stock Markets, Inc. The information reflects prices between dealers, and does not include retail markup, markdown, or commissions, and may not represent actual transactions.\nFiscal Year Ended\nBid Prices\nJune 30,\nPeriod\nHigh\nLow\nFirst Quarter\n$ 0.0238\n$ 0.0065\nSecond Quarter\n$ 0.0100\n$ 0.0006\nThird Quarter\n$ 0.0120\n$ 0.0011\nFourth Quarter\n$ 0.0250\n$ 0.0011\nFirst Quarter\n$ 0.1850\n$ 0.0300\nSecond Quarter\n$ 0.2299\n$ 0.1010\nThird Quarter\n$ 0.1649\n$ 0.0010\nFourth Quarter\n$ 0.0800\n$ 0.0002\nOur shares are subject to Section 15(g) and Rule 15g-9 of the Securities and Exchange Act, commonly referred to as the penny stock rule. The rule defines penny stock to be any equity security that has a market price less than $5.00 per share, subject to certain exceptions. The rule provides that any equity security is considered to be a penny stock unless that security is:\n-\nregistered and traded on a national securities exchange meeting specified criteria set by the SEC;\n-\nissued by a registered investment company;\n-\nexcluded from the definition on the basis of price (at least $5.00 per share) or the issuers net tangible assets.\nTrading in the penny stocks is subject to additional sales practice requirements on broker-dealers who sell penny stocks to persons other than established customers and accredited investors. Accredited investors, in general, include certain institutional investors and individuals with assets in excess of $1,000,000 or annual income exceeding $200,000 or $300,000 together with their spouse.\nFor transactions covered by these rules, broker-dealers must make a special suitability determination for the purchase of our securities and must have received the purchasers written consent to the transaction prior to the purchase. Additionally, for any transaction involving a penny stock, the rules require the delivery, prior to the first transaction, of a risk disclosure document relating to the penny stock. A broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative, and current quotations for the security. Finally, monthly statements must be sent to the purchaser disclosing recent price information for the penny stocks. Consequently, these rules may restrict the ability of broker-dealers to trade or maintain a market in our common stock and may affect the ability of shareholders to sell their shares.\nHolders\nAs of June 30, 2023, there were approximately 917 shareholders of record holding 21,107,018,148 shares of common stock. The holders of common stock are entitled to one vote for each share held of record on all matters submitted to a vote of stockholders. Holders of the common stock have no preemptive rights and no right to convert their common stock into any other securities. There are no redemption or sinking fund provisions applicable to the common stock.\nDividends\nThe Company has not paid any dividends on its common stock. The Company current intends to retain any earnings for use in its business, and therefore does not anticipate paying cash dividends in the foreseeable future.\nSecurities Authorized Under Equity Compensation Plans\nThe following table lists the securities authorized for issuance under any equity compensation plans approved by our shareholders and any equity compensation plans not approved by our shareholders as of June 30, 2023. This chart also includes individual compensation agreements.\nEQUITY COMPENSATION PLAN INFORMATION\nNumber of securities\nremaining available for\nNumber of securities\nfuture issuance under\nto be issued\nWeighted-average\nequity compensation\nupon exercise\nexercise price of\nplans (excluding\nof outstanding options,\noutstanding options,\nsecurities reflected\nwarrants and rights\nwarrants and rights\nin column (a))\nPlan category\n(a)\n(b)\n(c)\nEquity compensation plans approved by security holders\n$ 0.00\nEquity compensation plans not approved by security holders\n$ 0.00\nTotal\n$ 0.00\nCompany repurchases of common stock during the year ended June 30, 2023\nNone\nPerformance Graphic\nThis item is not required to provide a performance graph since it is a smaller reporting company as defined in Exchange Act Regulation S-K Rule 10(f).\nShare issuances in year ended June 30, 2023\nAll share issuances have been previously reported. ITEM 6. [Reserved] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATION\nForward Looking Statement Notice\nThis Current Report on Form 10-K contains forward-looking statements within the meaning of the federal securities laws. These include statements about our expectations, beliefs, intentions or strategies for the future, which we indicate by words or phrases such as anticipate, expect, intend, plan, will, we believe, believes, management believes and similar language. Except for the historical information contained herein, the matters discussed in this Managements Discussion and Analysis of Financial Condition and Results of Operations, and elsewhere in this report are forward-looking statements that involve risks and uncertainties. The factors listed in the section captioned Risk Factors, as well as any cautionary language in this report; provide examples of risks, uncertainties and events that may cause our actual results to differ materially from those projected. Except as may be required by law, we undertake no obligation to update any forward-looking statement to reflect events after the date of this Form 10-K.\nOverview of Business\nOur mission is to invest in innovative technologies, integrated with business development in the healthcare ecosystem.\nWe are focused on protein and peptide small molecular drugs research and development, diagnostic and medical devices with AI cloud computing, cell therapy and regenerational medicine and supplements manufacturing and sales.\nOn September 3, 2021, the Company entered into an Assets Acquisition Agreement with Wangs Property Investment & Management LLC to purchase 53 units in 19 real estate properties appraised at $7,626, 286.37 for a purchase price of $7,000,000, The purchase price shall be paid as follows: (i) $1,000,000 on execution of the Agreement, (ii) $2,000,000 within 60 days thereof and (iii) the remainder by April 10, 2022. The Agreement is subject to customary closing conditions, including, satisfactory due diligence. On September 9, 2021, the Company entered into a Supplemental Assets Acquisition Agreement with Wangs Property Investment & Management LLC to amend and clarify that (i) it was purchasing 19 real estate properties which includes 53 units appraised at $7,626,286.37 for a purchase price of $7,000,000 and (ii) that it will waive and not conduct due diligence in order for the transaction to proceed. The acquisition has not been consummated. With the asset acquisition from Wangs Property Investment & Management LLC, the Company will diversify its business into property investment and management. By the end of May 2022, the Company ceased the acquisition of Wangs Property Investment & Management LLC.\nResults of Operations\nResults of Operations for the year ended June 30, 2023 compared to the year ended June 30, 2022.\nSales amounted to $204,309 and $104,648 for the years ended June 30, 2023 and 2022, respectively.\nCost of goods sold amounted to $35,720 and $1,588,453 for the years ended June 30, 2023 and 2022, respectively.\nGross profit/(loss) amounted to $168,588 and ($1,483,805) for the years ended June 30, 2023 and 2022, respectively.\nOperating expenses for the year ended June 30, 2023 and 2022 were $661,232 and $3,250,293, respectively. The decrease was mainly due to reduced payroll expenses, rent expenses, advertising, and professional expenses.\nOur net loss for the year ended June 30, 2023 and 2022 was $777,341 and $4,924,936, respectively. The decrease in net loss was mainly due to the decreased cost of goods sold and operating expenses.\nLiquidity and Capital Resources\nLiquidity is the ability of a company to generate funds to support its current and future operations, satisfy its obligations, and otherwise operate on an ongoing basis. Significant factors in the management of liquidity are funds generated by operations, levels of accounts receivable and accounts payable and capital expenditures.\nThe accompanying Consolidated Financial Statements (CFS) were prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities and commitments in the normal course of business. As reflected in the accompanying CFS, the Company has incurred recurring net losses. For the year ended June 30, 2023 the Company recorded a net loss of $777,341, used cash to fund operating activities of $752,902 and at June 30, 2023, had a shareholders deficit of $4,525,835. For the year ended June 30, 2023, the Company recorded a net loss of $4,924,936, used cash to fund operating activities of $1,479,859, and on June 30, 2022, had a shareholders deficit of $3,860,481. These factors create substantial doubt about the Companys ability to continue as a going concern. The financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nThe Company is raising the additional capital to achieve profitable operations.\nOur cash needs for the year ended June 30, 2023 were primarily met by loans and advances from our current majority shareholder. As of June 30, 2023, we had a cash balance of $54,150. Our future majority shareholders will need to provide all of our working capitals going forward.\nPrimarily as a result of our recurring losses and our lack of liquidity, we received a report from our independent registered public accounting firm for our financial statements for the year ended June 30, 2023 that includes an explanatory paragraph describing the uncertainty as to our ability to continue as a going concern.\nFinancial Position\nAs of June 30, 2023, we had $54,150 in cash, a working capital deficit of $2,912,469 and an accumulated deficit of $9,183,110.\nCritical Accounting Policies and Estimates\nEstimates\nThe preparation of these consolidated financial statements (CFS) in accordance with accounting principles generally accepted in the United States of America (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the dates of the consolidated financial statements and the reported amounts of net sales and expenses during the reported periods. Actual results may differ from those estimates and such differences may be material to the financial statements. The more significant estimates and assumptions by management include among others, the fair value of shares of common stock issued for services. The current economic environment has increased the degree of uncertainty inherent in these estimates and assumptions.\nRevenues\nRevenue from sale of goods under Topic 606, Revenue from Contracts with Customers, is recognized in a manner that reasonably reflects the delivery of the Companys products and services to customers in return for expected consideration and includes the following elements:\n●\nexecuted contract(s) with customers that the Company believes is legally enforceable;\n●\nidentification of performance obligation in the respective contract;\n●\ndetermination of the transaction price for each performance obligation in the respective contract;\n●\nallocation of the transaction price to each performance obligation; and\n●\nrecognition of revenue only when the Company satisfies each performance obligation.\nInventories\nInventories are stated at the lower of cost (first-in, first-out) or net realizable value. Adjustments to reduce the cost of inventory to its net realizable value are made, if required, for estimated excess, obsolescence, or impaired balances.\nFair Value Measurements\nFair value measurements are determined using authoritative guidance issued by the FASB, with the exception of the application of the guidance to non-recurring, non-financial assets and liabilities as permitted. Fair value is defined in the authoritative guidance as the price that would be received to sell an asset or paid to transfer a liability in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants at the measurement date. A fair value hierarchy was established, which prioritizes the inputs used in measuring fair value into three broad levels as follows:\nLevel 1-Quoted prices in active markets for identical assets or liabilities.\nLevel 2-Inputs, other than the quoted prices in active markets, are observable either directly or indirectly.\nLevel 3-Unobservable inputs based on the Companys assumptions.\nThe Company is required to use observable market data if available without undue cost and effort.\nThe Companys financial instruments include cash and accounts payable. Management has estimated that the carrying amounts approximate their fair value due to the short-term nature.\nLoss Per Share\nBasic earnings (loss) per share are computed by dividing income available to common shareholders by the weighted-average number of common shares available. Diluted earnings (loss) per share is computed similar to basic earnings per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. The Companys diluted loss per share is the same as the basic loss per share for the years ended June 30, 2023 and 2022, as there are no potential shares outstanding that would have a dilutive effect.\nIncome Taxes\nIncome tax expense is based on pretax financial accounting income. Deferred tax assets and liabilities are recognized for the expected tax consequences of temporary differences between the tax bases of assets and liabilities and their reported amounts. Valuation allowances are recorded to reduce deferred tax assets to the amount that will more likely than not be realized. The Company recorded a valuation allowance against its deferred tax assets as of June 30, 2023 and 2022.\nThe Company accounts for uncertainty in income taxes using a two-step approach to recognizing and measuring uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. The second step is to measure the tax benefit as the largest amount that is more than 50% likely of being realized upon settlement. The Company classifies the liability for unrecognized tax benefits as current to the extent that the Company anticipates payment (or receipt) of cash within one year. Interest and penalties related to uncertain tax positions are recognized in the provision for income taxes.\nRecent Accounting Pronouncements\nSee Footnote 2 of the financial statements for a discussion of recently issued accounting standards.\nContractual Obligations and Off-Balance Sheet Arrangements\nWe do not have any contractual obligations or off-balance sheet arrangements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nOur financial statements appear beginning on page in this Form 10-K. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nBased upon an evaluation of the effectiveness of our disclosure controls and procedures performed by our Chief Executive Officer as of the end of the period covered by this report, our Chief Executive Officer concluded that our disclosure controls and procedures have not been effective as a result of a weakness in the design of internal control over financial reporting identified below.\nAs used herein, disclosure controls and procedures mean controls and other procedures of our company that are designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Securities Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Securities Exchange Act is accumulated and communicated to our management, including our principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (ICFR), as such term is defined in Exchange Act Rule 13a-15(f) under the Securities Exchange Act of 1934. Our Chief Executive Officer/Chief Accounting Officer conducted an evaluation of the effectiveness of our ICFR based on the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO 2013). Based on managements evaluation under the framework, management has concluded that our ICFR was not effective as of June 30, 2023.\nWe identified material weaknesses in our ICFR primarily attributable to (i) lack of segregation of incompatible duties; and (ii) insufficient Board of Directors representation. These weaknesses are due to our inadequate staffing during the period covered by this report and our lack of working capital to hire additional staff. Management has retained an outside, independent financial consultant to record and review all financial data, as well as prepare our financial reports, in order to mitigate this weakness. Although management will periodically re-evaluate this situation, at this point it considers that the risk associated with such lack of segregation of duties and the potential benefits of adding employees to segregate such duties are not cost justified. We intend to hire additional accounting personnel to assist with financial reporting as soon as our finances will allow.\nThis annual report does not include an attestation report of our registered public accounting firm regarding ICFR. Managements report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit us to provide only managements report in this annual report. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nSet forth below are the names of our directors, executive officers and significant employees of our company as of the date of this Form 10-K, their ages, all positions and offices that they hold with us, the periods during which they have served as such, and their business experience during at least the last five years.\nName\nPosition with the Company\nAge\nPeriod\nMike Wang\nChairman of the Board of Directors, President, Chief Executive Officer\n2017 - Present\nRex Chang\nDirector\n2018 - Present\nAihua Guo\nDirector\n2020 - Present\nPeter Britton\nDirector\n2020 - Present\nJiaxin Xue\nDirector\n2018 - Present\nQuinn Chen\nChief Financial Officer\n2022 - Present\nName\nPosition with the Company and Principal Occupations\nMike Wang\nChairman of the Board of Directors, President, Chief Executive Officer and Chief Financial Officer since 2017. Mr. Wang has served as the Chief Financial Officer of our company since 2017. He has been working in the health supplements business for about 20 years. From 2012 to present, he worked as the vice-president of the American Nutrition and Health Association. From 2013 to present, he worked as the president of the Health & Beauty Group Inc. From 2016 to present, he worked as our President, Chief Executive Officer and Chief Financial Officer.\nRex Chang\nDirector Mr. Rex Chang is an experienced GPA Consultant and an international trade specialist. He started in manufacturing facilities, well-trained in commercial and industrial, import-export, QC/QA, marketing development and government procurement. Mr. Chang served as Chief Executive Officer in U. S. Asia Chamber of Commerce, and Chief Executive Officer- Asian Marketing in U.S. Foods International. He also served as Chief Executive Officer of New Cathay International Development Corp. Mr. Chang is consultant to the Center for International Trade Development and Taiwan Trade Center.\nAihua Guo\nDirector Ms. Aihua Guo is an entrepreneur and founder of Hong Kong-based Brilliant Health Co., Ltd., which she founded in 2018. She has been the standing editor of Chinese Journals of Tissue Engineering and Aesthetic Plastic Surgery since 2018. She has also been the visiting professor of Galway Institute of Regenerative Medicine in Ireland and CEO of Pure Athesthetic Co., Ltd. of Hong Kong since 2017. From 2016 to 2018, Ms. Guo served as the business director of China Regenerative Medicine International Co., Ltd. She has been the members of British Blood Transfusion Association, Illouz Foundation France and China Plastic Surgery Association since 2015. Ms. Guo obtained her MD of Plastic Surgery in 2012 and PhD of Immunology of Transplantation and Ophthalmology in 2007.\nPeter Britton\nDirector. Mr. Peter Britton is the founder and board chairman of Purecell Group, co-inventor of UCF (Umbilical Cord Factors) global patent, and international expert on translational cellular regenerative medicine. He is the director and chief scientist of Purcell in the development, commercialization and multiple medical applications of Purecell patented anti-aging products and technologies including UCF, Exosome, NAD+, SKQ1 and Liposome. He currently serves as the chief scientist and director of the joint-venture between Purecell and BoaoYiling Life Care Center in China, which leads the world-first officially-approved medical application and commercialization of UCF technology in the field of degenerative joint disease. He is also the founder of Hong Kong-based N Cell, a leading provider of proteomic analysis for Asian market since 2016, and has been the founding member of the Sino-Australian Stem Cell Centre of Excellence with Peking University since 2015. Mr. Peter Britton graduated with a bachelor's degree from the University of Sydney, and obtained post graduate work at the University of Bern in Switzerland.\nJiaxin Xue\nDirector. Mr. Jiaxin Xue is graduate of Henan Medical University. He also obtain Doctor degree in Natural Medicine from American Naturopathic University, Master's degree in Social Medicine and Health Management from Peking Union Medical College, Mr. Xue obtained PhD degree in Social Economics, School of Philosophy and Sociology from Beijing Normal University. He is an experienced specialist involves comprehensive fields such as medical treatment, medicine, health, rehabilitation, and elderly care. From 2007 to 2008, Mr. Xue was the Deputy Director of the Chinese Red Cross Rescue Training Department, Vice President of the Business Development Department of Haihong Pharmaceutical Holdings; in 2009 Mr. Xue founded Mai Dingsheng International Medical Investment Service Agency. From 2014 to the present, Mr. Xue is the Deputy Dean of the International College of Natural Therapy, Executive Vice President of the Zhongguancun Industry Integration and Transformation Promotion Association and Chairman of the International Medical Care Industry Committee, Deputy Director of the Chronic Disease Prevention Fund Management Committee of the China Medical and Health Development Foundation, Chinese Nationality Deputy Director of the Internet + Medical Work Committee of the Health Association, Deputy Director of the Clinical Medicine Center of the Research Institute of the National Health Commission.\nQuinn Chen\nCFO. Mr. Quinn Chen has more than two decades of practice experience in public and private accounting where he specialized in both private and public company financial audits, oversight over financial reporting, cash management, tax compliance, and mergers and acquisitions. From October 2018 through present date, Mr. Chen was the Chief Financial Officer of NuOrganic Cosmetics. From September 2014 -July 2019, he was a financial controller at Gardiner & Theobald, an independent global consultancy to the construction and property industry. At the same time, he served as the chief tax consultant of real estate investments at 42nd Street Realty, a well- known Times Square Realty Company of New York City, and provided consulting service in asset management and tax planning of trusts and estates to high-profile. Prior to that, Mr. Chen spent about ten years as an auditor and tax accountant with several public accounting firms in the New York City metropolitan area. Mr. Chen holds a Master of Business Administration from Baruch College, Zicklin School of Business.\nAll our directors hold office until the next annual meeting of our shareholders or until their successors have been elected and qualified. The executive officers of our company are appointed by our board of directors and hold office until their death, resignation, or removal from office.\nFamily Relationships\nThere is no family relationship among any of our officers or directors.\nCode of Ethics\nThe Company has not adopted a code of ethics which applies to the chief executive officer, or principal financial and accounting officer, because of our current low level of operations as a public entity. The Company intends to adopt a code of ethics in the near future.\nAudit Committee Financial Expert\nThe Company does not have either an Audit Committee or a financial expert on the BOD. The BOD believes that obtaining the services of an audit committee financial expert is not economically rational at this time in light of the costs associated with identifying and retaining an individual who would qualify as an audit committee financial expert, the limited scope of our operations and the relative simplicity of our financial statements and accounting procedures.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires our executive officers and directors and persons who own more than 10% of a registered class of our equity securities to file with the SEC initial statements of beneficial ownership, reports of changes in ownership and annual reports concerning their ownership of our common stock and other equity securities, on Form 3, 4 and 5 respectively. Executive officers, directors and greater than 10% shareholders are required by the SEC regulations to furnish our Company with copies of all Section 16(a) reports they file.\nBased solely on our review of the copies of such reports received by us and on written representations by our officers and directors regarding their compliance with the applicable reporting requirements under Section 16(a) of the Exchange Act, On the fiscal year ended June 30, 2023, two new board members, Mr. Peter Britton, Ms. Aihua Guo did not file Forms 3. ITEM 11. EXECUTIVE COMPENSATION\nExecutive Officers and Directors\nThe following tables set forth certain information about compensation paid, earned or accrued for services by (i) the Companys Chief Executive Officer and Chief Financial Officer in the years ended June 30, 2023 and 2022 (Named Executive Officers):\nNon-Equity\nIncentive\nNonqualified\nName and\nStock\nOption\nPlan\nDeferred\nAll Other\nPrincipal\nSalary\nBonus\nAwards\nAwards\nCompensation\nCompensation\nCompensation\nTotal\nPosition\nYear\n($)\n($)\n($)\n($)\n($)\n($)\n($)\n($)\nMike Q. Wang\nPresident/Executive\n$ 43,800\n-\n-\n-\n-\n-\n-\n$ 43,8001\n$ 40,711\n-\n-\n-\n-\n-\n-\n$ 40,711\nQuinn Chen\nCFO\n$ 8,308\n-\n-\n-\n-\n-\n-\n$ 8,308\n$ 13,846\n-\n-\n-\n-\n-\n-\n$ 13,846\nEmployment Contracts\nWe currently do not have any written employment agreements with our executive officers.\nDirector Compensation\nNone of our directors was compensated for their services to the board other than Mr. Rex Chang who was paid $- and $50,935 respectively for the years ended June 30, 2023 and 2022.\nDirector Qualifications\nDirectors are responsible for overseeing the Companys business consistent with their fiduciary duty to the shareholders. This significant responsibility requires highly skilled individuals with various qualities, attributes and professional experience. Our BOD believes that there are general requirements for service on the BOD that are applicable to directors and that there are other skills and experience that should be represented on the BOD as a whole but not necessarily by each director. The BOD considers the qualifications of director and director candidates individually and in the broader context of the BODs overall composition and the Companys current and future needs.\nQualifications, Attributes, Skills and Experience to be Represented on the Board as a Whole\nThe BOD has identified particular qualifications, attributes, skills and experience that are important to be represented on the board as a whole, in light of the Companys current needs and its business priorities. The BOD believes that it should include some directors with a high level of financial literacy and some directors who possess relevant business experience as a Chief Executive Officer or a President or like position. Marketing is the core focus of our business, and the Company seeks to develop and deploy the worlds most innovative and effective marketing and technology. Therefore, the Board believes that marketing and technology experience should be represented on the BOD. Since the Company is involved in the healthcare business, the Companys business also requires compliance with a variety of regulatory requirements and relationships with various governmental entities. Therefore, the BOD believes that governmental, political, or diplomatic expertise should be represented on the Board.\nSet forth below are a chart and a narrative disclosure that summarize the specific qualifications, attributes, skills and experiences described above. An X in the chart below indicates that the item is a specific reason that the director has been nominated to serve on the Companys Board. The lack of an X for a particular qualification does not mean that the director does not possess that qualification or skill. Rather, an X indicates a specific area of focus or expertise of a director on which the BOD currently relies.\nHigh level of financial literacy\nMike Q. Wang\nQuinn Chen\nX\nExtensive knowledge of the Companys business\nX\nX\nMarketing/Marketing related technology experience\nX\nRelevant Chief Executive/President or like experience\nX\nX\nCorporate Governance expertise\nX\nX\nDirectors or Executive Officers involved in Bankruptcy or Criminal Proceedings\nTo our knowledge, during the last ten years, none of our directors and executive officers (including those of our subsidiaries), has:\n●\nHad a bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time.\n●\nBeen convicted in a criminal proceeding or been subject to a pending criminal proceeding, excluding traffic violations and other minor offenses.\n●\nBeen subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities.\n●\nBeen found by a court of competent jurisdiction (in a civil action), the SEC, or the Commodities Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended or vacated.\n●\nBeen the subject to, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization, any registered entity, or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nBoard Meetings\nThe BOD held no meetings during FY 2023.\nMaterial Changes to the Procedures by which Security Holders May Recommend Nominees to the Board of Directors\nThere have been no material changes to the procedures by which security holders may recommend nominees to the BOD.\nBoard Leadership Structure and Role in Risk Oversight\nMr. Mike Q. Wang is our Chairman, Chief Executive Officer. As a main officer and director, Mr. Wang, by default, serves as our business and industry leader most capable of identifying strategic priorities and executing our business strategy. In addition, having a single leader eliminates the potential for confusion and provides clear leadership for the Company. We believe that this leadership structure has served the Company well. The Boards role in the risk oversight of the Company includes, among other things:\n●\nappointing, retaining and overseeing the work of the independent auditors, including resolving disagreements between the management and the independent auditors relating to financial reporting;\n●\napproving all auditing and non-auditing services permitted to be performed by the independent auditors;\n●\nreviewing annually the independence and quality control procedures of the independent auditors;\n●\nreviewing and approving all proposed related party transactions;\n●\ndiscussing the annual audited financial statements with the management; and\n●\nmeeting separately with the independent auditors to discuss critical accounting policies, management letters, recommendations on internal controls, the auditors engagement letter and independence letter and other material written communications between the independent auditors and the management.\nOur BOD is responsible for approving all related party transactions. We have not adopted written policies and procedures specifically for related person transactions. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nBeneficial Ownership\nThe following table sets forth, as of the date of this report the outstanding common stock of the Company owned of record or beneficially by each person who owned of record, or was known by the Company to own beneficially, more than 5% of the Companys 21,107,081,148 shares of common stock issued and outstanding, and the name and shareholdings of each director and all of the executive officers and directors as a group.\nUnless otherwise indicated in the footnotes to the following table, each person named in the table has sole voting and investment power and that persons address is c/o 1609 W Valley Blvd., Unit 338A, Alhambra, CA 91803:\nCERTAIN BENEFICIAL OWNERS\nAmount and\nnature of\nbeneficial\nPercent\nName\nOffice\nowner (1)\nof class\nMike Q. Wang\nChief Executive Officer, Director\n999,171,990\n4.73 %\nRex Chang\nDirector\n200,000,000\n0.95 %\nAihua Guo\nDirector\n311,797,747\n1.48 %\nPeter Britton\nDirector\n--\n--\nJianxin Xue\nDirector\n627,000,000\n2.97 %\nAll officer and directors as a group (5 person)\nN/A\n2,137,969,737\n10.13 %\n(1)\nExcept as otherwise noted, shares are owned beneficially and of record, and such record shareholder has sole voting, investment, and dispositive power. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nDuring the year ended June 30, 2023, the Company's current majority shareholder advanced $224,423 to the Company as working capital and the Company repaid $373,140 to the shareholder. As of June 30, 2023 and 2022, the Company owed its current majority shareholder and other related $425,142 and $573,859 respectively. The advances are non-interest bearing and are due on demand.\nDirector Independence\nCurrently, the Company does not have any independent directors. Since the Companys common stock is not currently listed on a national securities exchange, we have used the definition of independence of The NASDAQ Stock Market to make this determination.\nUnder NASDAQ Listing Rule 5605(a)(2), an \"independent director\" is a \"person other than an officer or employee of the company or any other individual having a relationship which, in the opinion of the company's board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director.\"\nWe do not currently have a separately designated audit, nominating or compensation committee. However, we do intend to comply with the independent director and committee composition requirements in the future. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table sets forth the fees paid by the Company for professional services rendered for the audits of the annual financial statements and fees billed for other services rendered by its prior principal accountant, WWC, P.C. and by its current principal accountant, Gries & Associates LLC:\nType of Services Rendered\nAudit Fees\n$ 36,500\n$ 120,158\nAudit-Related Fees\n$ -\n$ -\nTax Fees\n$ -\n$ -\nAll Other Fees\n$ -\n$ -\nPre-approval Policies\nWe do not have a standing audit committee currently serving and as a result our BOD performs the duties of an audit committee. Our BOD evaluates and approves, in advance, the scope and cost of the engagement of an accounting firm before the accounting firm renders audit and non-audit services. We do not rely on pre-approval policies and procedures.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) (1) Financial Statements.\nReport of Independent Registered Public Accounting Firm Gries & Associates, LLC (PCAOB ID # 6778)\nConsolidated Balance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Shareholders Deficit for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street, Suite 1100\nDenver, Colorado 80246\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nAmerican Great Health and Subsidiaries\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheet of American Great Health and Subsidiaries. (the Company) as of June 30, 2023, and the related statement of operations, stockholders deficit and cash flows for the period then ended and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023, and the results of its operations and its cash flows for each of the period then ended in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 1 to the financial statements, the Company has incurred losses since inception of $9,183,110 and a net loss of $777,341. These factors create an uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nEmphasis of Matters-Risks and Uncertainties\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and financial markets of many countries, including the geographical area in which the Company plans to operate.\nWe have served as the Companys auditor since 2023.\nblaze@griesandassociates.com\n400 South Colorado Blvd, Suite 870, Denver, Colorado 80246\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846\nDenver, Colorado\nOctober 12, 2023\nPCAOB ID: 6778\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nAmerica Great Health and Subsidiaries\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheet of America Great Health and Subsidiaries (the Company) as of June 30, 2021, and the related statements of operations, stockholders' deficit, and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2021, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States.\nGoing Concern Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has suffered recurring losses from operations that raises substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion. Our audits included performing procedures to assess the risks of material misstatement, whether due to error fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements.\nOur audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that (i) relate to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial\nInvestment in Purecell Group (Purecell)\nAs described in Note 1,8 and 9 to the consolidated financial statements, the Company issued 545,000,000 shares to acquire 51% of Purecells equity interest. Management reviews its equity investment in Purecell and accounted for under the equity methods because the Company does not have significant control over Purecell. The Company hired an external valuation firm to perform 409A valuation as of the acquisition date to determine the fair value of the Companys common share. The share was valued at $0.00001 per share.\nThe principal considerations for our determination that performing procedures relating to the fair value of the investment in Purecell is a critical audit matter are there was significant judgment by management. This in turn led to a high degree of auditor judgment, subjectivity and effort in performing procedures.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included(i) evaluating the appropriateness of comparable market value and (ii) evaluating the reasonableness of cost to recreate a similar company.\n/s/ TAAD, LLP\nWe have served as the Companys auditor from 2020 through 2022, and we previously served as the Companys auditor from 2016 through 2018\nDiamond Bar, California\nJanuary 20, 2022\nAmerica Great Health and Subsidiaries\nConsolidated Balance Sheets\nAs of June 30,\nAs of June 30,\nASSETS\nCURRENT ASSETS\nCash\n$ 54,150\n$ 62,643\nAccount receivable, net\n-\nInventory\n108,351\n116,060\nOther receivable\n-\n-\nAdvance to supplier\n16,964\n16,964\nTOTAL CURRENT ASSETS\n179,465\n196,585\nRight-of-use asset, net\n41,918\n93,886\nDue from the related parties\n8,218\n8,218\nDeposits\n11,836\n13,836\nProperty and equipment, net\n57,692\n23,618\nTOTAL ASSETS\n$ 299,129\n$ 336,143\nLIABILITIES AND SHAREHOLDERS' DEFICIT\nCURRENT LIABILITIES\nAccounts payable and accrued expense\n$ 1,450,574\n$ 1,437,522\nIncome tax payable\n3,970\nShort term loan\n705,216\n183,932\nOther payable\n241,784\n334,112\nDue to related party\n425,142\n573,859\nDeferred income\n223,331\n157,000\nLease liability - current\n41,918\n70,895\nTOTAL CURRENT LIABILITIES\n3,091,935\n2,757,422\nLease liability - non-current\n-\n22,991\nAccrued interest\n609,892\n384,073\nLong term loan\n1,123,138\n1,032,138\nTotal Non-Current liabilities\n1,733,030\n1,439,202\nTOTAL LIABILITIES\n4,824,965\n4,196,624\nCommitments and Contingencies\n-\n-\nSHAREHOLDERS' DEFICIT\nRedeemable, convertible preferred stock, 10,000,000 shares authorized:\nSeries A voting preferred stock, zero shares issued and outstanding\n-\n-\nCommon stock, no par value, unlimited shares authorized;\n21,107,018,148 and 21,090,218,148 shares issued and outstanding\n-\n-\nAdditional paid-in capital\n4,732,477\n4,619,991\nAccumulated other comprehensive income\n(500\n)\nAccumulated deficit\n(9,183,110 )\n(8,421,849 )\nTotal America Great Health stockholders deficit\n(4,451,133 )\n(3,801,698 )\nNon-controlling interest\n(74,703 )\n(58,783\n)\nTOTAL SHAREHOLDERS' DEFICIT\n(4,525,836 )\n(3,860,481 )\nTOTAL LIABILITIES AND SHAREHOLDERS' DEFICIT\n$ 299,129\n$ 336,143\nThe accompanying notes are an integral part of these consolidated financial statements.\nAmerica Great Health and Subsidiaries\nConsolidated Statements of Operations and\nComprehensive Income\nFor the Years ended June 30,\nSales\n$ 204,308\n$ 104,648\nCost of goods sold\n35,720\n1,588,453\nGross profit\n168,588\n(1,483,805\n)\nSelling, general and administrative expenses\nSelling expense\n3,999\n86,316\nGeneral and administrative expense\n657,233\n3,163,977\n661,232\n3,250,293\nLoss from operations\n(492,644 )\n(4,734,098 )\nOther income (expenses)\nInterest income\nInterest expense\n(319,705 )\n(190,916 )\nLoss on equity investment\n-\n-\nOther income\n34,983\n(284,696 )\n(190,838 )\nLoss before income taxes\n(777,340 )\n(4,924,936 )\nNET LOSS\n$ (777,340 )\n$ (4,924,936 )\nNon-controlling interest share of loss\n15,920\n58,783\nNet loss attributed to the Company\n(761,420 )\n(4,866,153 )\nForeign currency transaction\n(160 )\nComprehensive income or loss\n(760,920 )\n(4,866,313 )\nBASIC AND DILUTED LOSS PER SHARE\n-\n$ -\nWEIGHTED-AVERAGE COMMON SHARES OUTSTANDING\nBASIC AND DILUTED\n21,093,402,806\n21,090,049,276\nThe accompanying notes are an integral part of these consolidated financial statements.\nAmerica Great Health and Subsidiaries\nConsolidated Statements of Changes in Shareholders' Deficit\nFor the Years ended June 30, 2023 and 2022\nAccumulated\nAdditional\ndeficit\nNon-\nOther\nPreferred Stock\nCommon Stock\nPaid in\nduring\ncontrolling\ncomprehensive\nShares\nAmt\nShares\nAmt\nCapital\ndevelopment\ninterest\nincome\nTotal\nBalance June 30, 2021\n-\n-\n21,070,866,399\n-\n3,087,869\n(3,555,696 )\n-\n-\n(467,827 )\nIssuance of common stock for debt\n-\n-\n6,221,840\n-\n-\n-\n-\n-\n-\nIssuance of common stock for equity investment\n-\n-\n1,300,000\n-\n97,500\n-\n-\n-\n97,500\nIssuance of common stock for compensation\n-\n-\n11,829,909\n-\n1,361,133\n-\n-\n-\n1,361,133\nImputed interest\n-\n-\n-\n-\n11,893\n-\n-\n11,893\nGain/loss on exchange rate\n-\n-\n-\n-\n-\n-\n-\nOriginal issue discount on debt\n-\n-\n-\n-\n61,596\n-\n-\n61,596\nNet loss\n-\n-\n-\n-\n-\n(4,866,153 )\n(58,783 )\n(4,924,936 )\nBalance June 30, 2022\n-\n$ -\n21,090,218,148\n$ -\n$ 4,619,991\n$ (8,421,849\n)\n$ (58,783\n)\n$\n$ (3,860,481\n)\nBalance June 30, 2022\n-\n-\n21,090,218,148\n-\n$ 4,619,991\n$ (8,421,849 )\n$ (58,783\n)\n$\n$ (3,860,481 )\nIssuance of common stock for debt\n-\n-\n4,600,000\n-\n26,200\n-\n-\n-\n26,200\nIssuance of common stock for equity investment\n-\n-\n-\n-\n-\n-\n-\n-\n-\nIssuance of common stock for compensation\n-\n-\n12,200,000\n-\n65,880\n-\n-\n-\n65,880\nImputed interest\n-\n-\n-\n-\n5,205\n-\n-\n5,205\nGain/loss on exchange rate\n-\n-\n-\n-\n-\n-\n(659\n)\n(500\n)\nOriginal issue discount on debt\n-\n-\n-\n-\n15,200\n-\n-\n15,200\nNet loss\n-\n-\n-\n-\n-\n(761,420 )\n(15,920 )\n(777,340 )\nBalance June 30, 2023\n-\n$ -\n21,107,018,148\n$ -\n$ 4,732,477\n$ (9,183,110\n)\n$ (74,703\n)\n$ (499\n)\n$ (4,525,836\n)\nThe accompanying notes are an integral part of these consolidated financial statements.\nAmerica Great Health and Subsidiaries\nConsolidated Statements of Cash Flows\nYears Ended June 30,\nCash Flows from Operating Activities\nNet loss\n$ (777,340 )\n$ (4,924,936 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation\n10,346\n5,905\nOriginal issue discount on debt\n15,200\n61,596\nStock compensation\n-\n1,361,133\nFinancing cost\n-\n-\nLoss on equity investment\n-\n-\nImputed interest\n5,205\n11,893\nChanges in operating Assets and Liabilities:\nAccount receivable\n(918\n)\nOther receivable\n-\n61,771\nOther long term asset\n2,000\n(13,138\n)\nOther short term asset\n-\n-\nInventory\n7,709\n(108,211 )\nAccounts payable and accrued expense\n13,050\n1,380,314\nCustomer advances\n66,331\n157,000\nOther liabilities\n(7,863\n)\n194,318\nOther payable\n(88,459\n)\n333,415\nNet cash used in operating activities from continuing operations\n(752,902 )\n(1,479,858 )\nNet cash used in operating activities\n(752,902 )\n(1,479,858 )\nCash Flows from Investing Activities\nPurchase of property and equipment\n(44,420 )\n(16,851 )\nNet cash used in investing activities\n(44,420 )\n(16,851 )\nCash Flows from Financing Activities\nProceeds from issuance of common stock\n92,080\n97,500\nShort term loan\n521,284\n183,932\nLong term loan\n324,682\n639,734\nAdvances from related party\n(148,718 )\n250,109\nRepayment to related party\n-\n(8,219 )\nNet cash provided by financing activities\n789,328\n1,163,056\nNet increase in cash\n(7,994 )\n(333,653 )\nCash beginning of period\n62,643\n396,136\nEffect of foreign currency translation\n(499 )\nCash end of period\n$ 54,150\n$ 62,643\nInterest paid\n$ -\n$ -\nTaxes paid\n$ -\n$ -\nNon-cash transactions\nShares issued for equity investment\n$ -\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nAMERICA GREAT HEALTH AND SUBSIDIARIES\n(FORMERLY KNOWN AS CROWN MARKETING)\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2023 AND 2022\nNOTE 1 - NATURE OF BUSINESS\nHistory and Organization\nAmerica Great Health, formerly Crown Marketing, is a Wyoming corporation (the \"Company\"). A change of control of the Company was completed on January 19, 2017 from Jay Hooper, the former officer and director of the Company and its former majority shareholder. Control was obtained by the sale of 16,155,746,000 shares of Company common stock from Mr. Hooper to an investor group led by Mike Q. Wang. In connection with the change of control, the Company sold to its former majority shareholder a subsidiary for $100 and another subsidiary in exchange for the cancellation of all payables and accrued expenses. After December 31, 2016, the Companys operations are determined and structured by the new investor group. As such, the Company accounted for all of its assets, liabilities and results of operations up to January 1, 2017 as discontinued operations.\nOn March 1, 2017, the Company filed with the Secretary of State of the State of Wyoming an Articles of Amendment to change the corporate name from Crown Marketing to America Great Health.\nOn March 9, 2017, the Company formed a wholly owned subsidiary, America Great Health, under the laws of the State of California.\nOn June 24, 2019, the Company registered a wholly owned subsidiary in China, Meizhong Health Industry Development Co., Ltd. The subsidiary is mainly engaged in merger and acquisition, investment and financing, and marketing of medical equipment and health products in China.\nOn June 30, 2020, the Company and Purecell Group (Purecell), a leading anti-aging medical institution in Australia, entered into a Cooperation Agreement, in which the Company agreed to acquire 51% of the equity of Purecell, as consideration, the Company shall issue 510,000,000 common shares to Purecells nominated trustee. Upon completion of the acquisition transaction, Purecell shall remain autonomy in its day-to-day operation, including recruiting and retaining management team members. On February 10, 2021, the Company completed its financial and legal due diligence. This transaction was completed in May 2021\nOn December 7, 2020, the Companys wholly-owned Californian subsidiary, America Great Health, entered into a Cooperation Agreement with Brilliant Healthcare Limited (Brilliant) pursuant to which the parties will establish a joint venture in China (the JV Company) for the purpose of promoting and developing stem cell related products R&D, production, sales, raw material procurement, mergers and acquisitions, and consulting services. After the formation of the JV company is completed, the Company shall invest US$4.2 million in the JV Company within the next 24 months for a 60% equity ownership in the JV Company. Brilliant shall transfer its patented technology to the JV Company as its capital contribution, to account for a 40% equity interest in the JV Company. As a condition for AAGH to obtain 60% equity in the JV company and a as the founder of Brilliant, Dr. Aihua Guo agrees to transfer its patent to the JV company as its share of contribution, and AAGH also agrees to pay Dr. Aihua Guo additional compensation, which includes: (i) AAGH transfers 300 million original shares of AAGH to Dr. Aihua Guo at no cost, valuing at $15 million; (ii) AAGH pays Dr. Aihua Guo a one-time cash compensation of $3 million with the following payment schedule: AAGH agrees to pay $500,000 to Dr. Aihua Guo six months from the date of signing of this Agreement, $1.5 million to Dr. Aihua Guo 12 months from the date of signing of this Agreement, and $1 million to Dr. Aihua Guo 24 months from the date of signing of this Agreement. In June 2021, the JV Company was established in Hainan, China as Sijinsai (Hainan) Biological Tech Ltd. On July 9, 2021, the Company paid its first investment of $50,000. In July 2021, the Company paid Dr. Aihua Guo $100,000 as prepaid investment.\nOn May 18, 2021, the Company and David Tsai (Dr. Tsai), a pioneer in anti-cancer peptide research and invention in the United States, entered into a Cooperation Agreement, in which Dr. Tsai shall provide to the Company theories, technologies, methods, sources of raw materials, processing and production techniques, quality standards, quality control methods and other information and details related to his anti-cancer protein peptides, oral insulin and activation technology. Dr. Tsai shall also be responsible for the whole process of technology and product production, application and implementation, as well as professional technical support, consultation and cooperation in the process of product verification, publicity, promotion and sales. Currently, several patents are in the application process, and several products are in the process of getting ready for production.\nOn September 3, 2021, the Company entered into an Assets Acquisition Agreement with Wangs Property Investment & Management LLC to purchase 53 units in 19 real estate properties appraised at $7,626,286.37 for a purchase price of $7,000,000. The purchase price shall be paid as follows: (i) $1,000,000 on execution of the Agreement, (ii) $2,000,000 within 60 days thereof and (iii) the remainder by April 10, 2022. The Agreement is subject to customary closing conditions, including, satisfactory due diligence. On September 9, 2021, the Company entered into a Supplemental Assets Acquisition Agreement with Wangs Property Investment & Management LLC to amend and clarify that (i) it was purchasing 19 real estate properties which includes 53 units appraised at $7,626,286.37 for a purchase price of $7,000,000 and (ii) that it will waive and not conduct due diligence in order for the transaction to proceed. The acquisition has not been consummated.\nOn November 4, 2021, the Company set up a 100% owned subsidiary Nutrature Health LLC.\nOn November 11, 2021, America Great Health (the Company) entered into an Advisory Committee Member Consulting Agreement with Dr. Kevin Buckman MD (Consultant). Pursuant to the Agreement, Consultant is to provide advisory services, as a member to the Advisory Committee to the Board of Directors of the Company, including without limitation, assisting GOF Biotechnologies Inc. in its new drug approval process for oral insulin and Amylase X. Consultant shall be compensated with a warrant to purchase 500,000 shares of the Company at $0.01 per share within 24 months and a warrant at each of the following stages: IND application, Phase I clinical trials, Phase II clinical trials, Phase III clinical trials and the sale of GOF Biotechnologies Inc. the license of oral insulin and Amylase X at Phase I or Phase II clinical trials stages. This Agreement shall be for an initial one-year term and shall renew automatically for successive one-year terms up to a maximum of three (3) years unless terminated by either party pursuant to the Agreement. The 500,000 shares were issued free in April 20, 2022.\nOn November 15, 2021, the Company set up a 100% owned subsidiary GOF Biotechnologies Inc. GOF is 75% majority owned (60,000,000 shares of common stock) by the Company and the remaining 25% of its issued and outstanding shares (20,000,000 shares of common stock) are held by Men Hwei, Tsai. On December 31, 2021, the Company entered into a Supplementary Agreement with Zhigong Lin to amend his prior employment agreement with the Company dated August 31, 2021. The Supplement Agreements provides, inter alia, that Zhigong Lin will be appointed Chief Executive Officer of GOF. The employment agreement and supplement agreement were both terminated by the end of July without the issuance of any GOF shares.\nOn February 4, 2021, the Company set up a 100% owned subsidiary, International Institute of Great Healthcare, Inc. (IIGH) under the laws of the State of California. IIGH will bring together doctors and professional-level experts from different countries and regions in the world to the research fields involving biomedicine, clinic medicine, health management, information technology, data analysis, software development, artificial intelligence, industrial planning, financial investment, etc.\nOn November 25,2022, the Company signed a supplementary agreement with Men Hwei, Tsai who is an unrelated party. The Company A agrees that if the patent is sold or transferred, Men Hwei, Tsai or Men Hwei, Tsai's successor may receive a 25% gain on the transfer or sale of the interest. The Company agrees to give Men Hwei, Tsai an additional 20 million AAGH shares. The Company allows Men Hwei, Tsai to use three years (from November 26, 2022 to November 25, 2025) find investors each with more than US$10 million investment. In case that no investor is found within three years, Men Hwei, Tsai agrees to return the patent to the Company, and both parties will continue to cooperate in accordance with the original contract on May 18, 2021. If Men Hwei, Tsai finds an investor with an investment of at least US$10 million within three years, and the process for Men Hwei, Tsai and its investors to apply for a new drug may last for several years, then Men Hwei, Tsai agrees that the Company will use the patented technology to develop dietary supplement that are helpful to Alzheimers disease. The Company will be responsible for marketing the dietary supplement. Men Hwei, Tsai is entitled to commission equaling to 8% of sales price.\nOn November 26, 2022, the Company signed a supplementary agreement with Men Hwei, Tsai who is an unrelated party and transferred pending anti-dementia patent to Men Hwei, Tsai for $34,978.48.\nGoing Concern\nThe accompanying consolidated financial statements (CFS) were prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities and commitments in the normal course of business. As reflected in the accompanying CFS, the Company has incurred recurring net losses. For the year ended June 30, 2023, the Company recorded a net loss of $777,340, used cash to fund operating activities of $752,902, and on June 30, 2023, had a shareholders deficit of $4,525,836. These factors create substantial doubt about the Company's ability to continue as a going concern. These financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nDuring the year ended June 30, 2017, the Companys former majority shareholder sold his shares to an investor group. The new owners plans to continue as a going concern revolve around its ability to achieve profitable operations, as well as raise necessary capital to pay ongoing general and administrative expenses of the Company. The ability of the Company to continue as a going concern is dependent on securing additional sources of capital and the success of the Companys plan. There is no assurance that the Company will be successful in raising the additional capital or in achieving profitable operations.\nOur cash needs for the 12 months ended June 30, 2023 were primarily met by loans and advances from the current majority shareholder. As of June 30, 2023, we had a cash balance of $54,150. We intend to finance operating costs over the next twelve months with existing cash on hand and advance from the current majority shareholder.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying CFS were prepared in conformity with accounting principles generally accepted in the United States of America (US GAAP).\nBasis of Consolidation\nThe Consolidated Financial Statements includes the accounts of the Company and its current wholly owned subsidiaries, America Great Health in California (100%), GOF Biotechnologies in California (75%), International Institute of Great Health in California (100%), Nutrature Health LLC in California (100%), Sijinsai in China (60%), and US-China Mega Beauty Health Industry Development Co., LTD, (100%). Intercompany transactions and accounts were eliminated in consolidation.\nThe following table depicts the identity of the Companys subsidiaries:\nAttributable\nPlace of\nEquity\nName of Subsidiary\nIncorporation\nInterest %\nAmerica Great Health in California\nUSA\nGOF Biotechnologies in California\nUSA\nInternational Institute of Great Health in California\nUSA\nNutrature Health LLC in California\nUSA\nSijinsai in China\nCHINA\nUS-China Mega Beauty Health Industry Development Co., LTD\nCHINA\nEstimates\nThe preparation of the financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, and disclosure of contingent liabilities at the date of the financial statements and the reported amounts of expenses during the reporting period. Significant estimates include accounting for potential liabilities and the assumptions made in valuing stock instruments issued for services, debt and equity investment. Actual results could differ from those estimates.\nForeign Currency Translation\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the statement of operations.\nIn accordance with ASC 830, Translation of Financial Statements the subsidiarys assets and liabilities booked and recorded at the non-US local functional currency are generally translated into USD for consolidation purposes, using the exchange rate on the balance sheet date, and revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of foreign subsidiarys financial statements are recorded as a separate component of accumulated other comprehensive income within the statement of stockholders equity.\nThe Companys reporting currency is the United States Dollar (USD). The Companys wholly owned subsidiary of Meizhong Health Industry Development Co., Ltd. maintains its books and records in its local currency. The Chinese Yuan (RMB), which is the functional currency as being the primary currency of the economic environment in which the subsidiary operates.\nBelow is a table with foreign exchange rates used for translation:\nJune 30,\nAverage Yearly (average rate)\nChinese Renminbi (RMB)\nRMB 6.9632\nUnited States dollar ($)\n$ 1.00\nJune 30,\nYear Ended (Closing rate)\nChinese Renminbi (RMB)\nRMB 7.2537\nUnited States dollar ($)\n$ 1.00\nCash\nThe Company considers all highly liquid debt instruments purchased with maturity periods of three months or less to be cash equivalents. The carrying amounts reported in the accompanying balance sheet for cash and cash equivalents approximate their fair value. The Companys bank account in the United States is protected by FDIC insurance.\nThe Companys bank account in the United States is protected by FDIC insurance. As of June 30, 2023 and 2022, the Companys bank account in the United States had $4,131 and $3,194, respectively, under FDIC insurance of $250,000.\nRevenues\nRevenue from sale of goods under Topic 606, Revenue from Contracts with Customers, is recognized in a manner that reasonably reflects the delivery of the Companys products and services to customers in return for expected consideration and includes the following elements:\n●\nexecuted contract(s) with customers that the Company believes is legally enforceable;\n●\nidentification of performance obligation in the respective contract;\n●\ndetermination of the transaction price for each performance obligation in the respective contract;\n●\nallocation of the transaction price to each performance obligation; and\n●\nrecognition of revenue only when the Company satisfies each performance obligation.\nThe Company sells health-related products through wholesale and retailers. The Company considers purchase orders to be a contract with a customer. Contracts with customers are considered to be short-term when the time between order confirmation and satisfaction of the performance obligations is equal to or less than one year, and virtually all of the Companys contracts are short-term. The Company recognizes revenue for the transfer of promised goods to customers in an amount that reflects the consideration to which the Company expects to be entitled in exchange for those goods. The Company typically satisfies its performance obligations in contracts with customers upon shipment of the goods. The Company usually does not have any contract assets since the Company has an unconditional right to consideration when the Company has satisfied its performance obligation and payment from customers is not contingent on a future event. Generally, payment is due from customers within 40 to 60 days of the invoice date and 180 days for a major customer, and the contracts do not have significant financing components nor variable consideration. Returns and allowances are not a significant aspect of the revenue recognition process as historically they have been immaterial. All of the Companys contracts have a single performance obligation satisfied at a point in time and the transaction price is stated in the contract, usually as a price per unit. All estimates are based on the Companys historical experience; complete satisfaction of the performance obligation, and the Companys best judgment at the time the estimate is made. Historically, sales returns have not significantly impacted on the Companys revenue.\nProduct Revenue\nA majority of the Companys sales are for products sold at a point in time when shipped to customers, for which control is transferred to the customer as goods are delivered to the third-party carrier for shipment. The Company receives payment for the sale of products at the time customers place orders and payment is required prior to shipment. Any payment received prior to shipment is recognized as a contract liability under the account deferred revenue. The Company does not recognize assets associated with costs to obtain or fulfill a contract with a customer.\nShipping and handling activities are performed by third-party carriers for shipment. The Company accounts for these activities as fulfillment costs. Therefore, the Company recognizes the costs of these activities when revenue for the goods is recognized. Shipping and handling costs are included in the cost of sales for all periods presented.\nInventories\nInventories are stated at the lower of cost (first-in, first-out) or net realizable value. Adjustments to reduce the cost of inventory to its net realizable value are made, if required, for estimated excess, obsolescence, or impaired balances. For the year ended June 30, 2023, the Company has non-written-off.\nEquity Method Investments\nWe apply the equity method of accounting to investments when we have significant influence, but not controlling interest in the investee. Judgment regarding the level of influence over each equity method investment includes considering key factors such as ownership interest, representation on the board of directors, participation in policy-making decisions and material intercompany transactions. The Companys proportionate share of the net income (loss) resulting from these investments is reported under the line item captioned equity investment in our Consolidated Statements of Operations. The carrying value of our equity method investments is reported in equity investment in the Consolidated Balance Sheets. The Companys equity method investments are reported at cost and adjusted each period for the Companys share of the investees income or loss and dividend paid, if any. The Companys share of the investees income or loss is recorded on a one quarter lag for all equity method investments. The Company classifies distributions received from equity method investments using the cumulative earnings approach on the Consolidated Statements of Cash Flows. The Company assesses investments for impairment whenever events or changes in circumstances indicate that the carrying value of an investment may not be recoverable. The Company recorded no other-than-temporary impairment charges related to its equity method investments during the year ended June 30, 2023.\nFair Value Measurements\nFair value measurements are determined using authoritative guidance issued by the FASB, with the exception of the application of the guidance to non-recurring, non-financial assets and liabilities as permitted. Fair value is defined in the authoritative guidance as the price that would be received to sell an asset or paid to transfer a liability in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants at the measurement date. A fair value hierarchy was established, which prioritizes the inputs used in measuring fair value into three broad levels as follows:\nLevel 1-Quoted prices in active markets for identical assets or liabilities.\nLevel 2-Inputs, other than the quoted prices in active markets, are observable either directly or indirectly.\nLevel 3-Unobservable inputs based on the Companys assumptions.\nThe Company is required to use observable market data if available without undue cost and effort.\nThe Companys financial instruments include cash and accounts payable. Management has estimated that the carrying amounts approximate their fair value due to the short-term nature.\nLoss Per Share\nBasic earnings (loss) per share are computed by dividing the income available to common shareholders by the weighted-average number of common shares available. Diluted earnings (loss) per share is computed similar to basic earnings per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. The Companys diluted loss per share is the same as the basic loss per share for the years ended June 30, 2023 and 2022, as there are no potential shares outstanding that would have a diluted effect.\nIncome Taxes\nIncome tax expenses are based on pretax financial accounting income. Deferred tax assets and liabilities are recognized for the expected tax consequences of temporary differences between the tax bases of assets and liabilities and their reported amounts. Valuation allowances are recorded to reduce deferred tax assets to the amount that will more likely than not be realized. The Company did not record a valuation allowance against its deferred tax assets as of June 30, 2023 and 2022.\nThe Company accounts for uncertainty in income taxes using a two-step approach to recognizing and measuring uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. The second step is to measure the tax benefit as the largest amount that is more than 50% likely of being realized upon settlement. The Company classifies the liability for unrecognized tax benefits as current to the extent that the Company anticipates payment (or receipt) of cash within one year. Interest and penalties related to uncertain tax positions are recognized in the provision for income taxes.\nRecent Accounting Pronouncements\nIn July 2017, the FASB issued Accounting Standards Update 2017-11, Earnings Per Share (Topic 260); Distinguishing Liabilities from Equity (Topic 480); Derivatives and Hedging (Topic 815): (Part I) Accounting for Certain Financial Instruments with Down Round Features, (Part II), which is the replacement of the Indefinite Deferral for Mandatory Redeemable Financial Instruments of Certain Nonpublic Entities and Certain Mandatory Redeemable Non-Controlling Interests with a Scope Exception. The amendments in Part I of this Update that relate to the recognition, measurement, and earnings per share of certain freestanding equity-classified financial instruments that include down round features affect entities that present earnings per share in accordance with the guidance in Topic 260, Earnings Per Share. The amendments in Part II of this Update do not have an accounting effect. The amendments in Part I of the update are effective for fiscal year, and interim periods within those fiscal years, beginning after December 15, 2018. The Company is assessing the impact to its accounting practices and financial reporting procedures as a result of the issuance of this standard.\nIn December 2019, the FASB issued ASU No. 2019-12, Simplifying the Accounting for Income Taxes, as part of its initiative to reduce complexity in accounting standards. The amendments in the ASU are effective for fiscal years beginning after December 15, 2020, including interim periods therein. Early adoption of the standard is permitted, including adoption in interim or annual periods for which financial statements have not yet been issued. The Company is currently evaluating the effect, if any, that the ASU will have on its consolidated financial statements.\nOther recent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the Securities and Exchange Commission did not or is not believed by management to have a material impact on the Companys present or future consolidated financial statements.\nNOTE 3 - OTHER ASSET\nAs of June 30, 2023 and 2022, other receivable amounted to $11,836 and $13,836, respectively. Other receivable consists of the following:\nJune 30, 2022\nJune 30, 2022\nRent deposits\n11,836\n13,836\nTotal\n11,836\n13,836\nNOTE 4 - RELATED PARTY TRANSACTIONS\nDuring the year ended June 30, 2023, the Company's current majority shareholder advanced $224,423 to the Company as working capital and the Company repaid $373,140 to the shareholder. As of June 30, 2023 and 2022, the Company owed its current shareholder of $389,952 and $538,669 respectively. The advances are non-interest bearing and are due on demand. Imputed interest amounted to $5,206 and $11,893 for the years ended June 30, 2023 and 2022 and was recorded as paid in capital, respectively. Other dues to the related parties are $35,190 as of June 30, 2023.\nNOTE 5 - SHORT TERM LOAN\nAs of June 31, 2023 and 2022, short term loan amounted to $705,216 and $183,932 from unrelated third parties, respectively. On September 15, 2022, the Company paid interest of $3,178 on two short term loans of $50,000 due on July 10, 2022 and $10,000 due on August 1, 2022. The Company then re-entered an agreement of a new short-term loan of $60,000. The loan has an annual interest rate of 18% and the principal and interest are due on February 28, 2023. On January 13, 2023, the Company paid interest of $4,175 on an early-withdrew long-term loan of $100,000. On January 24, 2023, the Company paid interest of $3,178 on a short-term loan of $60,000. On March 2, 2023, the Company paid a first monthly installment of $667 interest on a 7-month short-term loan of $80,000. On September 15, 2022, the Company paid interest of $3,616 on two short term loans, each with $50,000 due on July 26, 2022, and August 1, 2022, and paid $20,000 of principal in January 2023. The Company then re-entered an agreement of a new short-term, interest free loan of $80,000. The principal is due on February 28, 2023. The Company will issue 1,600,000 shares of the Company stocks to the party as a reward. These shares were issued on April 18, 2023. The third loan amount is $2,871 which has an 8-month short term. The latest loan occurred on November 2, 2022, the Company entered an agreement of short-term loan of $25,000. The Company will repay $37,475, with a fixed repayment of $329 every business day from November 10, 2022.\nNOTE 6 - LONG TERM LOAN\nAs of June 30, 2023 and 2022, long term loan amounted to $1,525,600 and $1,221,892, respectively. The loan has an annual interest rate of 20%. The principal and interest are due in five years. Interest expenses incurred for the years ended June 30, 2023 and 2022 amounted to $402,458 and $189,754, respectively.\nAs of June 30, 2023, long term loan consisted of the following:\nPrincipal\nAccrued interest\nBalance\nReceived long term loan on April 27, 2021\n$ 200,000\n$ 87,014\n$ 287,014\nReceived long term loan on June 3, 2021\n290,000\n120,290\n410,290\nReceived long term loan on June 4, 2021\n50,000\n20,740\n70,740\nReceived long term loan on June 23, 2021\n30,000\n12,115\n42,115\nReceived long term loan on July 12, 2021\n10,000\n3,934\n13,934\nReceived long term loan on September 1, 2021\n60,000\n21,929\n81,929\nReceived long term loan on September 22, 2021\n50,000\n17,699\n67,699\nReceived long term loan on September 27, 2021\n50,000\n17,562\n67,562\nReceived long term loan on September 30, 2021\n10,000\n3,496\n13,496\nReceived long term loan on October 29, 2021\n12,138\n4,050\n16,188\nReceived long term loan on November 9, 2021\n50,000\n16,384\n66,384\nReceived long term loan on November 16, 2021\n140,000\n45,337\n185,337\nReceived long term loan on November 18, 2021\n50,000\n16,134\n66,137\nReceived long term loan on November 29, 2021\n20,000\n6,334\n26,334\nReceived long term loan on November 30, 2021\n10,000\n3,161\n13,162\nReceived long term loan on October 13, 2022\n21,000\n2,992\n23,992\nReceived long term loan on March 10, 2023\n10,000\n10,614\nReceived long term loan on March 14, 2023\n10,000\n10,591\nReceived long term loan on March 16, 2023\n10,000\n10,581\nReceived long term loan on April 17, 2023\n30,000\n1,216\n31,216\nReceived long term loan on May 9, 2023\n10,000\n10,285\nTotal\n$ 1,123,138\n$ 402,458\n$ 1,525,600\nOn May 5, 2021, the Company issued 10,000,000 shares to an unrelated party as collateral for a loan of $200,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on April 27, 2021.\nOn May 31, 2021, the Company agreed 500,000 shares to an unrelated party as collateral for loans of $50,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed $20,000 on June 3, 2021 and $30,000 on June 23, 2021 and issued 200,000 shares on June 18, 2021 and 240,000 shares on October 28, 2021 with 60,000 shares unissued.\nOn June 18, 2021, the Company issued an aggregate of 2,850,000 shares to 5 unrelated parties as collateral for loans of $270,000. One party with a loan of $100,000 was also awarded 100,000 bonus shares beside the 1,000,000 shares. The loans have an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on June 3, 2021.\nOn June 18, 2021, the Company issued 500,000 shares to an unrelated party as collateral for a loan of $50,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on June 4, 2021.\nOn October 28, 2021, the Company issued 80,000 shares to an unrelated party as collateral for loans of $10,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on July 12, 2021.\nOn October 28, 2021, the Company issued 1,540,000 shares to an unrelated party as collateral for loans of $60,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on September 1, 2021.\nOn October 28, 2021, the Company issued 500,000 shares to an unrelated party as collateral for loans of $50,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on September 22, 2021.\nOn November 22, 2021, the Company issued 500,000 shares to an unrelated party as collateral for loans of $50,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed in September 27, 2021.\nOn November 22, 2021, the Company issued 100,000 shares to an unrelated party as collateral for loans of $10,000. The loan has an annual interest rate of 20%. The principal and interest are due in one year. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on September 30, 2021.\nOn November 22, 2021, the Company issued 161,840 shares to an unrelated party as collateral for loans of $12,138. The loan has an annual interest rate of 20%. The principal and interest are due in one year. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on October 29, 2021.\nOn November 22, 2021, the Company issued 400,000 shares to an unrelated party as collateral for loans of $40,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on November 16, 2021.\nOn November 22, 2021, the Company issued 500,000 shares to an unrelated party as collateral for loans of $50,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on November 9, 2021.\nOn November 29, 2021, the Company issued 1,000,000 shares to an unrelated party as collateral for a loan of $100,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on November 16, 2021.\nOn February 2, 2022, the Company issued 500,000 shares to an unrelated party as collateral for loans of $50,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on November 19, 2021.\nOn February 2, 2022, the Company issued 200,000 shares to an unrelated party as collateral for loan of $20,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on November 29, 2021.\nOn February 2, 2022, the Company issued 100,000 shares to an unrelated party as collateral for loan of $10,000. The loan has an annual interest rate of 20%. The principal and interest are due in five years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received the proceed on November 30, 2021.\nOn September 9, 2022, the Company signed a loan agreement of $100,000 with a five-year term from an unrelated party for a freeze-dryer. The loan has an annual interest rate of 16% with the payments of $3,000 at the end of every moth starting the fourth month after the Company received the proceed and the final payment of $12,000 on September 9, 2027. The Company received the proceed on September 9, 2022. This loan was returned and $4,953 of accrued interest was paid on January 13, 2023.\nOn October 13, 2022, the Company signed a loan agreement of $21,000 with Lian Chen who is an unrelated party. The loan has an annual interest rate of 20%. Total principal and interest of $42,000 are due in five years. The unrelated party would receive 2,625,000 shares from a shareholder designated by the Company. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loan will be forgiven. The Company received $21,000 loan on October 13, 2022. On October 21, 2022, the Company's current majority shareholder Mike Q. Wang transferred 2,625,000 shares to Lian Chen. If after five years, Lian Chen chooses to use stocks to offset the loan, then the Company will issue 2,625,000 shares of common stock to Mike Wang.\nOn January 13, 2023, the Company signed a loan agreement of $150,000 with a one-year term from an unrelated party. The loan has an annual interest rate of 20%. Total principal and interest of $30,000 are due in one year.\nOn January 24, 2023, the Company signed a loan agreement of $300,000 with a one-year term from an unrelated party. The loan has an annual interest rate of 20%. A total principal and interest of $60,000 are due in one year.\nOn March 10, 2023, the Company signed a loan agreement of $10,000 with a three-year term from an unrelated party. The loan has an annual interest rate of 20%. Total principal and interest of $6,000 are due in three years. The unrelated party would receive 1,000,000 shares from a shareholder designated by the Company. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can normally be traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of the loan will be forgiven. As of the issue of this Form 10Q, the 1,000,000 shares have not been issued.\nOn March 14, 2023, the Company signed a loan agreement of $10,000 with a three-year term from an unrelated party. The loan has an annual interest rate of 20%. Total principal and interest of $6,000 are due in three years. The unrelated party would receive 1,000,000 shares from a shareholder designated by the Company. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can normally be traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of the loan will be forgiven. The 1,000,000 shares were issued on April 18, 2023.\nOn March 16, 2023, the Company signed a loan agreement of $10,000 with a three-year term from an unrelated party. The loan has an annual interest rate of 20%. Total principal and interest of $6,000 are due in three years. The unrelated party would receive 1,000,000 shares from a shareholder designated by the Company. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can normally be traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of the loan will be forgiven. The 1,000,000 shares were issued on April 18, 2023.\nOn April 17, 2023, the Company signed a loan agreement of $30,000 with a three-year term from an unrelated party. The loan has an annual interest rate of 20%. A total principal and interest of $18,000 are due in three years. The unrelated party would receive 6,000,000 shares from a shareholder designated by the Company. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can normally be traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of the loan will be forgiven. As of the issue of this Form 10Q, the 6,000,000 shares have not been issued.\nOn May 9, 2023, the Company signed a loan agreement of $10,000 with a three-year term from an unrelated party. The loan has an annual interest rate of 20%. A total principal and interest of $6,000 are due in three years. The unrelated party would receive 1,000,000 shares from a shareholder designated by the Company. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can normally be traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of the loan will be forgiven. As of the issue of this Form 10Q, the 1,000,000 shares have not been issued.\nNOTE 7 - CONVERTIBLE, REDEEMABLE PREFERRED STOCK\nDuring the year ended June 30, 2016, the Companys Board of Directors authorized the creation of a series of preferred stock consisting of 1,000,000 shares designated as Series A Preferred Stock (the Series A). The Series A is entitled to a dividend of 4%, when and as declared, and is entitled to a liquidation preference of $1 per share plus unpaid dividends. The Series A is redeemable at the option of the Company at any time, in whole or in part, at a price of $1.00 per share, plus 4% per annum thereupon from the date of issuance (the Stated Value). In the event of any liquidation, dissolution or winding up of the Corporation, whether voluntary or involuntary, the Series A shall be entitled to a preferential amount equal to the Stated Value, prior to the holders of common stock receiving any distribution. Each share of Series A is automatically converted on the Conversion Date into a number of shares of common stock of the Company at the initial conversion rate (the Conversion Rate), which shall be the Stated Value as of the date of conversion divided by the Market Price. The Market Price for purposes of this Section 5 shall be equal to the average closing sales price of the Common Stock over the 5 previous trading days.\nThe Series A is also subject to adjustments to the Conversion Rate. If the common stock issuable on conversion of the Series A is changed into the same or a different number of shares of any other class or classes of stock, whether by capital reorganization, reclassification, or otherwise (other than a subdivision or combination of shares provided for above), the holders of the Series A shall, upon its conversion, be entitled to receive, in lieu of the common stock which the holders would have become entitled to receive but for such change, a number of shares of such other class or classes of stock that would have been subject to receipt by the holders if they had exercised their rights of conversion of the Series A immediately before that change.\nIn August 2016, the Company filed an amendment to its Articles of Incorporation to increase the number of authorized shares of Series A Preferred Stock from 1,000,000 to 10,000,000.\nThere were no preferred shares outstanding as of June 30, 2023 and 2022.\nNOTE 8 - SHAREHOLDERS DEFICIT\nOn June 30, 2023 and 2022, the Company had 21,107,018,148 and 21,090,218,148 shares of common stock issued and outstanding, respectively.\n1) Shares issued for equity investment\nOn April 6, 2021, the Company issued 70,000,000 shares to a director of Imediplus as collateral in exchange for getting trust of 2,500,000 shares that is 5% of Imediplus. The transaction has not been completed by the reporting date.\nEquity Investment in Purecell Group:\nOn June 30, 2020, the Company and Purecell Group (Purecell), a leading anti-aging medical institution in Australia, entered into a Cooperation Agreement, in which the Company agreed to acquire 51% of the equity of Purecell, as consideration, the Company shall issue 510,000,000 common shares to Purecells nominated trustee. Because the company does not have significant control over Purecell, this is an equity investment. Upon completion of the acquisition transaction, Purecell shall remain autonomy in its day-to-day operation, including recruiting and retaining management team members. On February 10, 2021, the Company completed its financial and legal due diligence. On April 6, 2021, the Company issued 510,000,000 shares to two shareholders of Purecell Group PTY Ltd (\"Purecell\") in exchange for 51% of ownership of Purecell. On April 6, 2021, the Company issued 50,000,000 shares of common stock to Purecells project introducer as compensation for services, at fair market value of $0.00001 per share.\nOn May 11, 2021, Aussie Produce PTY LTD (AP) signed an agreement with Purecell to invest $2,340,000 in exchange of 6% of total outstanding shares of Purecell and 35,000,000 shares of the Company owned by Purecell. Purecell will issue 6% shares to AP in exchange for the $2,340,000 investment. In addition, Purecell will issue 68,372 shares to AP and issue 71,163 shares to the Company. The Company will also issue an additional 31,212,000 shares to Purecell. Purecell will use the proceeds to acquire VERITA PHARMA, which is a medicine factory. In order to complete the change of 35,000,000 shares of the Company held by Purecell to AP within the agreed time limit, and to meet the conditions that AP investment funds are in place, the Company and Purecell agreed through consultation that in order to gain time, the Company will issue an additional 35,000,000 shares for AP. On May 26, 2021, the Company issued 35,000,000 shares to shareholders of AP, at fair market value of $0.00001 per share.\nOn March 31, 2022, the Company issued 1,300,000 shares of common stock to an US individual at $0.075 per share.\n2) Shares issued for stock compensation\nOn April 25, 2023, the Company issued an aggregate of 12,200,000 shares of common stock to 7 unrelated parties as compensation for services. The issuance of these shares is recorded at a fair market value of $0.0054 per share. 12,200,000 shares were issued at a fair market value of $65,880\n3) Shares issued for short term loan as original issue discount\nNone\n4) Shares issued for loan as collateral\nOn April 17, 2023, the Company issued 3,000,000 shares to three unrelated parties as collateral for three loans of $10,000 each. The loan has an annual interest rate of 20%. The principal and interest are due in three years. The shares issued are restricted and will be returned to the Company after the principal and interest are paid in full. During the investment period, if the stock can be normally traded in the stock market, and the market value of this part of AAGH stock exceeds the principal and interest of loan for 30 consecutive trading days. The remaining principal and interest of loans will be forgiven. The Company received the proceeds between March 10-14, 2023.\n5) Shares issued in exchange for payable balance\nNone\nNOTE 9 - EQUITY INVESTMENT\nOn June 30, 2020, the Company and Purecell Group (Purecell), a leading anti-aging medical institution in Australia, entered into a Cooperation Agreement, in which the Company agreed to acquire 51% of the equity of Purecell, as consideration, the Company shall issue 510,000,000 common shares to Purecells nominated trustee. Becausethe company does not have significant control over Purecell, so this is an equity investment. Upon completion of the acquisition transaction, Purecell shall remain autonomy in its day to day operation, including recruiting and retaining management team members. On February 10, 2021, the Company completed its financial and legal due diligence. On April 6, 2021, the Company issued 510,000,000 shares to two shareholders of Purecell Group PTY Ltd (\"Purecell\" ) in exchange of 51% of ownership of Purecell. On April 6, 2021, the Company issued 50,000,000 shares of common stock to Purecells project introducer as compensation for services, at fair market value of $0.00001 per share.\nOn May 11, 2021, Aussie Produce PTY LTD (AP) signed agreement with Purecell to invest $2,340,000 in exchange of 6% of total outstanding shares of Purecell and 35,000,000 shares of the Company owned by Purecell. Purecell will issue 6% shares to AP in exchange for the $2,340,000 investment. In addition, Purecell will issue 68,372 shares to AP and issue 71,163 shares to the Company. The Company will also issue additional 31,212,000 shares to Purecell. Purecell will use the proceeds to acquire VERITA PHARMA, which is a medicine factory. In order to complete the change of 35,000,000 shares of the Company held by Purecell to AP within the agreed time limit, and to meet the conditions that AP investment funds are in place, the Company and Purecell agreed through consultation that in order to gain time, the Company will issue an additional 35,000,000 shares for AP. On May 26, 2021, the Company issued 35,000,000 shares to shareholder of AP, at fair market value of $0.00001 per share.\nThe following table summarizes the income statement of Purecell.\nFrom date of\nequity\ninvestment to\n06/30/2023\nSales\n$ 270,931\nGross profit\n246,441\nNet loss\n(307,359 )\n51% share\n(156,753 )\nThe following table provides the summary of balance sheet information for Purecell.\nAs of June 30,\nTotal assets\n$ 3,192,224\nNet assets\n2,203,484\n51% ownership\n1,231,113\nBeginning balance of investment\n5,450\nLoss on equity investment\n(5,450 )\nEnding balance of investment\n-\nNOTE 10 - INCOME TAXES\nDeferred taxes represent the net tax effects of the temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes. Temporary differences result primarily from the recording of tax benefits of net operating loss carry forwards.\nAs of June 30, 2023, the Company has an insufficient history to support the likelihood of ultimate realization of the benefit associated with the deferred tax asset. Accordingly, a valuation allowance has been established for the full amount of the net deferred tax asset.\nUnder the Provisional Regulations of The Peoples Republic of China Concerning Income Tax on Enterprises promulgated by the PRC, which took effect on January 1, 2008, domestic and foreign companies pay a unified corporate income tax of 25%, except for a 15% corporate income tax rate for qualified high technology and science enterprises.\nThe Companys effective income tax rate differs from the amount computed by applying the federal statutory income tax rate to loss before income taxes for the years ended June 30, 2023 and 2022 as follows:\nYear Ended June 30,\nIncome tax benefit at federal statutory rate-US\n%\n%\nState tax, net of fed effect-US\n%\n%\nChange in valuation allowance-US\n(28 )%\n(28 )%\nIncome tax benefit at federal statutory rate-PRC\n%\n%\nChange in valuation allowance-PRC\n(25 )%\n(25 )%\nThe components of deferred taxes consist of the following at June 30, 2022 and 2021:\nJune 30, 2023\nJune 30, 2022\nNet operating loss carryforwards\n$ 6,697,872\n$ 5,920,531\nLess: valuation allowance\n(6,697,872 )\n(5,920,531 )\nNet deferred tax assets\n$ -\n$ -\nAs of June 30, 2023, the Company had federal and California income tax net operating loss carryforwards of $6,697,872. These net operating losses originating in tax years beginning prior to Jan. 1, 2018, will begin to expire 20 years from the date the tax returns are filed. The net operating losses originating in tax years beginning after Jan. 1, 2018, will be carry forwarded indefinitely.\nNOTE 11 - LEASE\nThe Company has entered into an operating leases agreement with GKT, Alhambra, LP. The lease term of the office space is from December 1, 2020 to November 30, 2023. The current monthly rent including monthly management fee is $4,655.64. The operating lease is listed as separate line item on the Companys condensed consolidated financial statements and represent the Companys right to use the underlying asset for the lease term. The Companys obligation to make lease payments is also listed as a separate line item on the Companys condensed consolidated financial statements.\nThe Company has entered into an operating lease agreement with SoCal Industrial LLC, Irwindale. The lease term of the office space is from June 1, 2023 to May 31, 2024 after the prior lease expired on May 31, 2023. The current monthly rent including monthly management fee is $1,764.00. The operating lease is listed as a separate line item on the Companys condensed consolidated financial statements and represents the Companys right to use the underlying asset for the lease term. The Companys obligation to make lease payments is also listed as a separate line item on the Companys condensed consolidated financial statements.\nOperating lease right-of-use assets and liabilities commencing after December 1, 2020 are recognized at commencement date based on the present value of lease payments over the lease term. For the year ended June 30, 2023, the Company recognized approximately $36,556 in total lease costs.\nBecause the rate implicit in each lease is not readily determinable, the Company uses its incremental borrowing rate to determine the present value of the lease payments.\nInformation related to the Companys operating ROU assets and related lease liabilities are as follows:\nYear Ended\nJune 30, 2023\nCash paid for operating lease liabilities\n$ 75,706\nWeighted-average remaining lease term\n0.64\nWeighted-average discount rate\n%\nMinimum future lease payments\n$ 42,191\nThe following table presents the amortization of the Companys lease liabilities under ASC 842 for each of the following years ending June 30:\n$ 36,899\n3,528\n1,764\n-\nTotal minimum payments\n42,191\nLess: imputed interest\n(273 )\nTotal lease liability\n41,918\nLess: short-term lease liability\n(41,918 )\nLong-term lease liability\n$ -\nNOTE 12 - CONCENTRATION\nMajor vendors\nFor the year ended June 30, 2023, no vendors accounted for 10% or more of the Companys purchases and its outstanding accounts payable balances as at year-end dates.\nNOTE 13 - SUBSEQUENT EVENTS\nOn July 23, 2023, the Company, SHOWA International Pty Ltd. (SHOWA), and Jeffery Tu & Eric Hsu, entered into a Cooperation Agreement (the Agreement), in which three parties shall establish a strategic partnership in Japan to produce and promoting Bio-active Protein Peptide in Japan. SHOWA, as a Japanese based company, shall use its best effort in promoting the Companys Bio-active Protein Peptide and related products in Japan, and shall be in charge of the overall marketing strategy, day-to-day business operations, products design, public relations, etc. As the Companys exclusive strategic partner in Japan, SHOWA shall be responsible for marketing and promoting all of the Companys Bio-active Protein Peptide and related products within the territory of Japan and other mutually agreed regions. In addition, SHOWA shall achieve the following milestones in sales during the next four-year period of time: 150,000 bottles during year one, 300,000 bottles during year two, 600,000 during year three, 1,000,000 bottles during year four.\nOn October 04, 2023, the Company entered into a New Drugs Application and Joint Venture Agreement (the Agreement), with CIMC Automatic Control System Technology (Liaoning) Co., Ltd. (CIMC), in which both parties agree to establish a joint venture in Beijing, China aiming to develop and promote the Bio-active Protein Peptide supplements and Peptide medicinal in China (New Venture). Upon execution of the Agreement, the Company shall contribute its technologies and marketing assistance, and owns 30% of total outstanding shares of the New Venture; CIMC shall contribute all required working capital and other resources and owns 70% of total outstanding shares of the New Venture. The total registered capital of the New Venture shall be $10 million RMB. CIMC shall also be responsible for all required capital in the new drugs application and approval process which is approximately 200 million RMB. Both parties further agree that the New Venture shall distribute 10% of its net profit to the Company annually for R&D and product productions.\n(b) Exhibits. The following exhibits of the Company are included herein.\n2.1\nAgreement and Plan of Reorganization between the Company and Okra Energy, Inc. dated December 2, 2013 (1).\n3.1\nArticles of Incorporation (2)\n3.2\nArticles of Merger (3)\n3.3\nBylaws (2)\n3.4\nAmended and Restated Articles of Incorporation, as filed June 24, 2016 (4)\n3.5\nAmendment to Articles of Incorporation increasing authorized Series A Preferred, August 20, 2016 (4)\n3.6\nArticles of Amendment (5)\n10.1\nLease Agreement\n31.1\nCertification by the Principal Executive Officer and Principal Accounting and Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertifications by the Principal Executive Officer and Principal Financial Officer Pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nINLINE XBRL Instance Document\n101.SCH\nINLINE XBRL Taxonomy Extension Schema Document\n101.CAL\nINLINE XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nINLINE XBRL Taxonomy Extension Definition Linkbase Definition\n101.PRE\nINLINE XBRL Taxonomy Extension Presentation Linkbase Document\n101.LAB\nINLINE XBRL Taxonomy Extension Label Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n1.\nPreviously filed with Current Report on Form 8-K filed December 5, 2013\n2.\nPreviously filed with Registration Statement on Form S-1 filed September 9, 2011.\n3.\nPreviously filed with Amendment No. 1 to Registration Statement on Form S-1 dated October 14, 2011.\n4.\nPreviously filed with Annual Report on Form 10-K filed December 16, 2016.\n5.\nPreviously filed with Current Report on Form 8-K filed May 17, 2017.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAMERICA GREAT HEALTH\nDate: October 13, 2023\n/s/ Quinn Chen\nQuinn Chen, Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: October 13, 2023\n/s/ Mike Q. Wang\nMike Q. Wang, President, Chief Executive Officer,\nSecretary and Director\nfalse FY\n2022-07-01 2023-06-30\n2023-08-31\n2022-12-31\n2023-06-30\n2022-06-30\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2021-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-06-30\nus-gaap:RetainedEarningsMember\n2021-06-30\n2021-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-07-01 2022-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-07-01 2022-06-30\nus-gaap:RetainedEarningsMember\n2021-07-01 2022-06-30\nus-gaap:NoncontrollingInterestMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-06-30\nus-gaap:RetainedEarningsMember\n2022-06-30\nus-gaap:NoncontrollingInterestMember\n2022-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-06-30\nus-gaap:CommonStockMember\n2022-07-01 2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-07-01 2023-06-30\nus-gaap:RetainedEarningsMember\n2022-07-01 2023-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-07-01 2023-06-30\nus-gaap:NoncontrollingInterestMember\n2022-07-01 2023-06-30\nus-gaap:CommonStockMember\n2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-06-30\nus-gaap:RetainedEarningsMember\n2023-06-30\nus-gaap:NoncontrollingInterestMember\n2023-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2023-06-30\n2017-01-19 2017-01-19\naagh:PurecellGroupMember\n2020-06-30\n2020-06-30 2020-06-30\nus-gaap:CorporateJointVentureMember\n2020-12-07 2020-12-07\naagh:JVCompanyMember\n2020-12-07\naagh:BrilliantHealthcareLimitedMember\n2020-12-07\nus-gaap:CommonStockMember us-gaap:CoVenturerMember\n2020-12-07 2020-12-07\nus-gaap:CashDistributionMember us-gaap:CoVenturerMember\n2020-12-07 2020-12-07\n2021-07-09 2021-07-09\nus-gaap:CoVenturerMember\n2021-07-01 2021-07-31\n2021-09-03\n2021-09-03 2021-09-03\naagh:NutratureHealthLLCMember\n2021-11-04\n2021-11-11 2021-11-11\n2021-11-11\n2022-04-20 2022-04-20\naagh:GofBiotechnologiesIncMember\n2021-11-15\naagh:GofBiotechnologiesIncMember\n2021-11-15\n2021-11-15\naagh:InternationalInstituteOfGreatHealthIncIIGHMember\n2021-02-04\n2022-11-25 2022-11-25\n2022-11-26\naagh:AmericaGreatHealthCaliforniaMember\n2023-06-30\naagh:GOFBiotechnologiesInCaliforniaMember\n2023-06-30\naagh:InternationalInstituteOfGreatHealthMember\n2023-06-30\naagh:NutratureHealthLLCMember\n2023-06-30\naagh:SijinsaiMember\n2023-06-30\naagh:USChinaMegaBeautyHealthIndustryDevelopmentCoLTDMember\n2023-06-30\naagh:AmericaGreatHealthCaliforniaMember\n2022-07-01 2023-06-30\naagh:GOFBiotechnologiesInCaliforniaMember\n2022-07-01 2023-06-30\naagh:InternationalInstituteOfGreatHealthMember\n2022-07-01 2023-06-30\naagh:NutratureHealthLLCMember\n2022-07-01 2023-06-30\naagh:SijinsaiMember\n2022-07-01 2023-06-30\naagh:USChinaMegaBeautyHealthIndustryDevelopmentCoLTDMember\n2022-07-01 2023-06-30\ncurrency:CNY aagh:IncomeStatementItemsMember\n2023-06-30\ncurrency:CNY aagh:BalanceSheetItemsMember\n2023-06-30\nus-gaap:MajorityShareholderMember\n2022-07-01 2023-06-30\nus-gaap:MajorityShareholderMember\n2023-06-30\nus-gaap:MajorityShareholderMember\n2022-06-30\nus-gaap:MajorityShareholderMember\n2021-07-01 2022-06-30\nus-gaap:ShortTermDebtMember\n2022-09-15 2022-09-15\naagh:ShortTermLoan1Member\n2022-09-15\naagh:ShortTermLoan2Member\n2022-09-15\naagh:ShortTermLoan3Member\n2022-09-15\n2022-09-15\nus-gaap:InterestExpenseMember\n2023-01-13 2023-01-13\n2023-01-13\nus-gaap:InterestExpenseMember\n2023-01-24 2023-01-24\n2023-01-24\nus-gaap:InterestExpenseMember\n2023-03-02 2023-03-02\n2023-03-02\n2022-09-15 2022-09-15\naagh:ShortTermLoan4Member\n2022-09-15\n2023-01-01 2023-01-31\naagh:ShortTermLoan5Member\n2022-09-15\nus-gaap:ShortTermDebtMember\n2022-03-18 2022-03-18\naagh:ShortTermLoan3Member\n2023-06-30\naagh:ShortTermLoan3Member\n2022-07-01 2023-06-30\naagh:ShortTermLoan6Member\n2022-11-02\naagh:ShortTermLoan6Member\n2022-11-10 2022-11-10\naagh:Loan1Member\n2021-05-05 2021-05-05\naagh:Loan1Member\n2021-05-05\naagh:Loan2Member\n2021-05-31 2021-05-31\naagh:Loan2Member\n2021-05-31\naagh:Loan2Member\n2021-06-03 2021-06-03\naagh:Loan2Member\n2021-06-23 2021-06-23\naagh:Loan2Member\n2021-06-18 2021-06-18\naagh:Loan2Member\n2021-10-28 2021-10-28\naagh:Loan2Member\n2022-07-01 2023-06-30\naagh:Loan3Member\n2021-06-18 2021-06-18\naagh:Loan3Member\n2021-06-18\naagh:Loan4Member\n2021-06-18\nus-gaap:CommonStockMember aagh:Loan4Member\n2021-06-18 2021-06-18\naagh:Loan4Member\n2021-06-18 2021-06-18\naagh:Loan5Member\n2021-06-18 2021-06-18\naagh:Loan5Member\n2021-06-18\naagh:Loan6Member\n2021-10-28 2021-10-28\naagh:Loan6Member\n2021-10-28\naagh:Loan7Member\n2021-10-28 2021-10-28\naagh:Loan7Member\n2021-10-28\naagh:Loan8Member\n2021-10-28 2021-10-28\naagh:Loan8Member\n2021-10-28\naagh:Loan9Member\n2021-11-22 2021-11-22\naagh:Loan9Member\n2021-11-22\naagh:Loan10Member\n2021-11-22 2021-11-22\naagh:Loan10Member\n2021-11-22\naagh:Loan11Member\n2021-11-22 2021-11-22\naagh:Loan11Member\n2021-11-22\naagh:Loan12Member\n2021-11-22 2021-11-22\naagh:Loan12Member\n2021-11-22\naagh:Loan13Member\n2021-11-22 2021-11-22\naagh:Loan13Member\n2021-11-22\naagh:Loan14Member\n2021-11-29 2021-11-29\naagh:Loan14Member\n2021-11-29\naagh:Loan15Member\n2022-02-02 2022-02-02\naagh:Loan15Member\n2022-02-02\naagh:Loan16Member\n2022-02-02 2022-02-02\naagh:Loan16Member\n2022-02-02\naagh:Loan17Member\n2022-02-02 2022-02-02\naagh:Loan17Member\n2022-02-02\naagh:Loan18Member\n2022-09-09\naagh:Loan18Member\n2022-09-09 2022-09-09\naagh:LoanReturnedMember us-gaap:InterestExpenseMember\n2023-01-13 2023-01-13\naagh:Loan19Member\n2022-10-13\naagh:Loan19Member\n2022-10-13 2022-10-13\naagh:Loan19Member aagh:LianChenMember\n2022-10-13 2022-10-13\naagh:Loan20Member\n2023-01-13\naagh:Loan20Member\n2023-01-13 2023-01-13\naagh:Loan21Member\n2023-01-24\naagh:Loan21Member\n2023-01-24 2023-01-24\naagh:Loan22Member\n2023-03-10\naagh:Loan22Member\n2023-03-10 2023-03-10\naagh:Loan22Member aagh:NotYetIssuedMember\n2023-03-10 2023-03-10\naagh:Loan23Member\n2023-03-14\naagh:Loan23Member\n2023-03-14 2023-03-14\naagh:Loan23Member\n2023-04-18 2023-04-18\naagh:Loan24Member\n2023-03-16\naagh:Loan24Member\n2023-03-16 2023-03-16\naagh:Loan24Member\n2023-04-18 2023-04-18\naagh:Loan25Member\n2023-04-17\naagh:Loan25Member\n2023-04-17 2023-04-17\naagh:Loan25Member aagh:NotYetIssuedMember\n2023-04-17 2023-04-17\naagh:Loan26Member\n2023-05-09\naagh:Loan26Member\n2023-05-09 2023-05-09\naagh:Loan26Member aagh:NotYetIssuedMember\n2023-05-09 2023-05-09\naagh:LoanReceivedOnApril272021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnApril272021Member\n2023-06-30\naagh:LoanReceivedOnJune32021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnJune32021Member\n2023-06-30\naagh:LoanReceivedOnJune42021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnJune42021Member\n2023-06-30\naagh:LoanReceivedOnJune232021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnJune232021Member\n2023-06-30\naagh:LoanReceivedOnJuly122021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnJuly122021Member\n2023-06-30\naagh:LoanReceivedOnSeptember12021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnSeptember12021Member\n2023-06-30\naagh:LoanReceivedOnSeptember222021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnSeptember222021Member\n2023-06-30\naagh:LoanReceivedOnSeptember272021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnSeptember272021Member\n2023-06-30\naagh:LoanReceivedOnSeptember302021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnSeptember302021Member\n2023-06-30\naagh:LoanReceivedOnOctober292021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnOctober292021Member\n2023-06-30\naagh:LoanReceivedOnNovember92021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnNovember92021Member\n2023-06-30\naagh:LoanReceivedOnNovember162021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnNovember162021Member\n2023-06-30\naagh:LoanReceivedOnNovember182021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnNovember182021Member\n2023-06-30\naagh:LoanReceivedOnNovember292021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnNovember292021Member\n2023-06-30\naagh:LoanReceivedOnNovember302021Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnNovember302021Member\n2023-06-30\naagh:LoanReceivedOnOctober132022Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnOctober132022Member\n2023-06-30\naagh:LoanReceivedOnMarch102023Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnMarch102023Member\n2023-06-30\naagh:LoanReceivedOnMarch142023Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnMarch142023Member\n2023-06-30\naagh:LoanReceivedOnMarch162023Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnMarch162023Member\n2023-06-30\naagh:LoanReceivedOnApril172023Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnApril172023Member\n2023-06-30\naagh:LoanReceivedOnMay92023Member\n2022-07-01 2023-06-30\naagh:LoanReceivedOnMay92023Member\n2023-06-30\nus-gaap:SeriesAPreferredStockMember\n2016-06-30\nus-gaap:SeriesAPreferredStockMember\n2015-07-01 2016-06-30\nus-gaap:SeriesAPreferredStockMember\n2016-08-31\naagh:ImediplusIncMember\n2021-04-06 2021-04-06\naagh:ImediplusIncMember\n2021-04-06\naagh:PurecellGroupMember\n2020-06-30 2020-06-30\naagh:PurecellGroupMember\n2021-04-06 2021-04-06\naagh:PurecellGroupMember\n2021-04-06\naagh:PurecellGroupMember\n2021-04-06\naagh:PurecellGroupMember aagh:AussieProducePTYLTDMember\n2021-05-11 2021-05-11\naagh:PurecellGroupMember aagh:AussieProducePTYLTDMember\n2021-05-11\naagh:PurecellGroupMember\n2021-05-11 2021-05-11\naagh:PurecellGroupMember\n2021-05-26\n2022-03-31 2022-03-31\n2022-03-31\n2023-04-25 2023-04-25\n2023-04-25\n2023-04-17 2023-04-17\n2023-04-17\naagh:PurecellGroupMember aagh:AussieProducePTYLTDMember\n2021-05-26 2021-05-26\naagh:PurecellGroupMember aagh:AussieProducePTYLTDMember\n2021-05-26\naagh:PurecellGroupMember\n2022-07-01 2023-06-30\naagh:PurecellGroupMember\n2023-06-30\naagh:PurecellGroupMember\n2023-06-30\naagh:PurecellGroupMember\n2022-06-30\naagh:PurecellGroupMember\n2022-07-01 2023-06-30\nus-gaap:ForeignCountryMember\n2023-06-30\nus-gaap:DomesticCountryMember\n2022-07-01 2023-06-30\nus-gaap:DomesticCountryMember\n2021-07-01 2022-06-30\nus-gaap:ForeignCountryMember\n2022-07-01 2023-06-30\nus-gaap:ForeignCountryMember\n2021-07-01 2022-06-30\nsrt:MinimumMember aagh:GKTAlhambraLPMember\n2022-07-01 2023-06-30\nsrt:MinimumMember aagh:SoCalIndustrialLLCMember\n2022-07-01 2023-06-30\nus-gaap:SubsequentEventMember aagh:JointVentureAgreementMember\n2023-10-04 2023-10-04\nus-gaap:SubsequentEventMember aagh:SHOWAInternationalPtyLtdMember\n2023-07-23 2023-07-23\nxbrli:shares\niso4217:USD\niso4217:USD\nxbrli:shares\nxbrli:pure\niso4217:CNY"
}