{
    "cik": "1099369",
    "company": "DESTINY MEDIA TECHNOLOGIES INC",
    "filing_type": "10-K",
    "filing_date": "2023-11-28",
    "period_of_report": "2023-08-31",
    "sic": "7372",
    "state_of_inc": "NV",
    "state_location": "A1",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1099369/0001062993-23-021487-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1099369/000106299323021487/form10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1099369/0001062993-23-021487.txt",
    "filename": "1099369_10K_2023_0001062993-23-021487.htm",
    "content": "ITEM 1. BUSINESS.\nOVERVIEW AND CORPORATE BACKGROUND\nDestiny Media Technologies Inc. was incorporated in August 1998 under the laws of the State of Colorado and the corporate jurisdiction was changed to Nevada effective October 8, 2014. We carry out our business operations through our wholly owned subsidiaries: Destiny Software Productions Inc., a British Columbia company incorporated in 1992, MPE Distribution, Inc., a Nevada company that was incorporated in 2007, Tonality Inc., a Nevada company that was incorporated in 2021, and Sonox Digital Inc. incorporated under the Canada Business Corporations Act in 2012.\nOur principal executive office is located at Suite 428, 1575 West Georgia Street, Vancouver, British Columbia V6G 2V3. Our telephone number is (604) 609-7736 and our facsimile number is (604) 609-0611.\nOur common stock trades on TSX Venture Exchange in Canada under the symbol \"DSY\", on the OTCQB U.S. (\"OTCQB\") under the symbol \"DSNY\", and on various German exchanges (Frankfurt, Berlin, Stuttgart and Xetra) under the symbol DME, WKN 935 410.\nOur corporate website is located at http://www.dsny.com.\nOUR PRODUCTS AND SERVICES\nDestiny develops and markets software as a service (SaaS) solutions that solve critical digital distribution and promotion problems for businesses in the music industry.\nPlay MPE®\nCurrently, the Company's core business is the Play MPE® online platform. Play MPE® distributes promotional content (broadcast quality audio, video, images, promotional information, metadata and other digital content) from record labels and artists to broadcasting professionals, music curators and music reviewers to discover, download, broadcast and review the content. Curators include radio programmers, digital streaming broadcasters, media reviewers, industry VIP's, DJ's, film and TV personnel, sports stadiums, retailers etc. In providing the distribution, Play MPE® provides several capabilities developed and designed to address the unique needs of both music promoters and broadcasters. Play MPE® was first to market, and is the largest provider of this service and provides the most feature rich platform in the world.\nRecord labels and artists are Play MPE®'s customers. When adding music to the Play MPE® system, clients are targeting specific industry recipients who review and broadcast their music. Play MPE®'s primary value proposition in this marketing effort is a direct increase to record label and artist revenue through on-air broadcast royalties, streaming royalties and synchronization revenue (revenue collected when a song is placed within video advertisements, television, or film), and indirect increases in revenue through growing song and artists' popularity.\nAlso, Play MPE® provides numerous capabilities that dramatically reduce record label costs while providing functionality necessary for certain strategic marketing plans. The platform also provides administrative controls to enhance security for record label content. In doing so, Play MPE® satisfies a broad range of stakeholders representing diverse interests at record labels. Music is protected by Play MPE®'s patented proprietary watermarking system which provides watermarks unique to each recipient.\nDescribed more fully below, features within Play MPE® are grouped into four main categories: local distribution software, global distribution architecture, targeted recipient list curation and recipient players.\nCustomers range from small independent artists to the world's largest record labels (the \"Major Record Labels\"). The Major Record Labels are Universal Music Group (\"Universal\"), Warner Music Group (\"Warner\") and Sony Music Entertainment (\"Sony\"). These record labels directly own numerous sub-labels that include; Capitol Music Group, Def Jam Recordings, Interscope Records, Island Records, Republic Records, Polydor, Deutsche Grammophon, Motown, Verve Label Group, Virgin Music Group, EMI, RCA Records, Epic Records, Columbia Records, Arista Records, Legacy Recordings, Provident Entertainment, Warner Records, Hollywood Records, Atlantic Records Group, 300 Elektra Entertainment, to name only a few. Play MPE® welcomes all of these labels into its customer base.\nCustomers choose Play MPE® for its powerful set of tools, ease of use and its effectiveness in achieving the record label's promotional objectives.\nPlay MPE® CASTER (local distribution software)\nPlay MPE®'s cloud-based Caster software includes local distribution functions that provide capabilities for a client to create and schedule release announcements and select its targeted audience. Play MPE® is designed uniquely to suit music marketing plans and its significant components include:\nRelease Creator includes drag and drop functionality to quickly embed images, social media links, insert video, add promotional files etc. to quickly create effective announcements.\nRelease Scheduling allows numerous scheduling functions for initial announcements, repeated and updated announcements, changes in DRM (a recipient's ability to download or only stream the content) etc.. These schedules can be uniquely edited by recipient or recipient list. Several administrative features here are also available to facilitate and manage release scheduling at scale.\nTemplates facilitate consistent label branding and presentation while reducing release preparation time. Each release announcement can be saved as a template and reused or edited for future announcements. Clients can design and save unlimited templates to provide unique design and branding for individual artists or record labels.\nContacts Management provides features that allow record labels to upload and manage their own targeted distribution lists. There are many features within this platform that provide efficiencies in destination management for all customers of Play MPE®. However, this section of the platform provides numerous functions that are critical for efficient contacts management at scale and is described in Caster's global distribution functionality. Within Contacts Management, users can easily select curated lists of engaged recipients provided by Play MPE® (see description below) or select their own managed recipient lists.\nAssets Management allows users to maintain and manage a repository of assets (single or multitrack releases) outside of the release creation process. This functionality saves users time when creating new releases and allows them to plan for future releases more efficiently. Assets Management also supports Quickshare, a newly designed 1:1 secure file sharing function (see below).\nReporting of release results shows recipient interactions including downloads, streams, clicks and opens.\nIntuitive designs and functionality across all areas of this portion of the platform simplify the distribution process, reduce customer time required to distribute, and facilitate the inclusion of information to improve engagement which ultimately increases record label and artist revenue.\nCaster is currently available in English, Spanish, German, Japanese and French.\nWhen competing with an established service within a local market, it is these features balanced against changing consumer behaviors that determine Play MPE®'s ability to increase and acquire market share. Competing services offer the basic distribution requirements inherent in the service but do so while missing many features that provide efficient delivery, engaged recipients and accurate and complete distribution lists.\nCaster consistently receives high reviews on the platform's ease of use, capabilities and on its ultimate effectiveness. Public reviews can be found at https://www.plaympe.com/testimonials/.\nPlay MPE® Quickshare\nAdded during the year, Play MPE®'s Quickshare provides a simplified distribution tool for Play MPE® customers to promote music directly to anyone inside or outside the Play MPE® platform. Quickshare is a simplified local distribution tool. With this feature, customers can send a link to a dedicated webpage to allow streaming or downloading of content outside of Play MPE® Player. The distribution does not include numerous features included within Caster's full version and distribution is intended only to replace other file sharing services while attracting greater use within the Play MPE® platform. The initial version will provide limited access and sharing capabilities free of charge and is a value added feature within Play MPE® local distribution suite of features.\nPlay MPE® CASTER (global architecture)\nPlay MPE®'s global distribution architecture was developed in close collaboration with our largest client to address the needs of its global approach to release distribution. This architecture provides functionality required for our largest client to conduct their unique approach to music distribution and provides numerous significant competitive advantages for this client. These features improve marketing coordination and revenue generation while reducing overall label staff time and costs.\nSignificant components include:\nStaff role management: Customers can grant varying capabilities or permissions for different staff positions. For example, one staff member can create a release while another can approve the release of this content. In a larger organization, this control ensures accurate and professional distributions are conducted, but allows for segregation of duties to maximize efficiency.\nLabel management: With label management, administrative staff can determine which users have access to which labels and which content. Each label has a unique account environment allowing for its own unique setup, list curation, favorites, staff roles, templates etc. These unique environments also improve release security for a record label with a large global footprint.\nGlobal release sharing (replication): With global release sharing, distribution centers can share a release to a territory. That territory then can reuse the release while localizing it to suit the particular needs of that jurisdiction (editing language, artist information, local concert dates, local contacts etc). This eliminates duplication of upload and data entry while reducing errors. In the context of global distribution, across multiple territories, multiple labels, and thousands of unique releases, savings of staff time is significant. Metadata completeness and accuracy are also increased. When complete metadata is conveyed, recipient engagement is higher. Higher recipient engagement, increases record label revenue. Within the included metadata are ISRC codes which are unique codes used to remit track royalties globally. When ISRC codes are communicated, royalty remittances are complete and timely. These aspects provide significant competitive advantages.\nRelease embargos: When marketing and promotion departments create global campaigns for highly anticipated music releases, staff restrict access to this content until the public release time. Here, record labels can permit early access to the relevant content so local offices can edit, localize and schedule releases but controls are added to restrict certain permissions and prevent premature release. Our largest client enjoys competitive advantages with these capabilities derived through cost savings and improved marketing campaigns. Absent these functions, global release coordination is more costly, less coordinated and often delayed.\nAsset repository integration: With this integration, Play MPE® automatically captures music, art, and associated metadata from an archival repository of our largest client, vastly reducing errors in release creation and data entry while making the process quicker. This further expands the competitive advantages enjoyed in global release sharing.\nRelease management: There are numerous capabilities within release management that are necessary for efficient global release management. Content owners can change DRM for specific recipient groups within a release and quickly remove content globally if necessary etc.\nAsset management: Assets include music tracks, album art, metadata etc. Within the assets management portion, several features allow assets to be used, recomposed, combined, recombined etc. Features here allow efficient and quick delivery of new releases. Various aspects of assets management are used in global distribution situations.\nRelease scheduling: While release scheduling is available for local distribution, many additional administrative features are designed to facilitate actions that reduce staff time in a global environment.\nContacts management: Critically important to all promotions is the distribution of content to an interested and engaged audience. As introduced in the local distribution discussion, Caster provides a contacts management system with numerous features that facilitate efficient updates and maintenance actions that are critically important where users maintain a large recipient database, across multiple users, and multiple recipient lists. Absent these features, list maintenance becomes overly cumbersome, inefficient and ultimately inaccurate.\nCollectively, functionality in global release management provides numerous competitive advantages that reduce overall costs, and improve marketing collaboration while increasing record label revenue and cash flow. We are unaware of any other service that provides these global distribution functions.\nPlay MPE® CASTER (targeted list management services)\nRecipient lists are bundles of active and engaged recipients with an interest in specific music types or genres. Lists are sold as a fixed price per list (or package). As recipient lists are adjusted in real time, changes in gross recipient numbers or active recipients does not directly or immediately impact revenue.\nFundamental to our customers' success in music marketing is reaching music curators capable of, and actively engaged in, remarketing the promoted content to a wider consumer audience. To limit unwanted access to new music and to increase recipient engagement, targeted and limited distribution is a vital component in music promotion. Thus, Play MPE® is a permissions-only access system and only recipients designated or targeted to receive content obtain access to that content. Current and correct identification of engaged recipients is therefore critical to our customers' success. While targeted distribution limits access to new content, this aspect also improves recipient side engagement by eliminating unwanted content.\nPlay MPE® actively manages curated and targeted distribution lists or \"packages\". List creation and list maintenance involve several proprietary processes that are designed to create complete, active, accurate, and targeted lists to facilitate efficient marketing campaigns. Play MPE® provides more than 400 unique targeted lists comprising of more than 17,000 unique and active recipients over 30 countries. To facilitate targeted music marketing campaigns, these lists are grouped by territory (typically by country), by genre of music, and by recipient type (see recipient player discussion). Relying on proprietary technical innovations and processes, these recipient lists are updated in real time. With an annual churn averaging between 27-34%, these recipient lists would quickly become inaccurate absent Play MPE®'s active curation. Play MPE® regularly monitors activity levels and recipients through proprietary analytics. Play MPE® provides the widest and most accurate distribution channels available in the industry.\nFor smaller record labels and independent artists, the provision of a list of destinations is a requirement for sale as these customers do not know who to contact. For larger record labels, promotions staff can upload their own contact lists. However, proprietary processes ensure Play MPE® lists are more accurate, complete and engaged. The majority of releases distributed through Play MPE®, include at least one targeted distribution list, curated by Play MPE®.\nPlay MPE® Player\nMusic curators review and download content through a cloud-based player and mobile apps (iOS and Android). Web players are currently available in 15 different languages: English, Spanish, Swedish, Finnish, Italian, Dutch, Portuguese, French, Japanese, German, Norwegian, Latvian, Lithuanian, Estonian, and Danish.\nRecipients on the Play MPE® platform have a wide variety of personas and include programming directors for internet streaming, satellite or terrestrial radio, retail store curators, sports stadium DJs, clubs, events, music reviews in newspapers or magazines, on-air personalities, music supervisors who program TV, movies, commercials or video games, or \"A&R\" representatives at larger record labels. Each recipient within the Play MPE® platform has a unique library of music catered to, and appropriate for, that recipient.\nRecipients enjoy many features that make it easy to access, collaborate, review, and search for content. Play MPE®'s mobile apps offer off-line listening capabilities, the ability to utilize Google Chromecast and Apple Airplay streaming capabilities, creation of playlists, sorting, flagging and archiving features, and easier access to release metadata. Recipient side satisfaction directly increases activity which directly improves the effectiveness of promotional efforts of record label customers.\nMTR™\nMTR™ (or \"Music Tracking Radar\" or \"Meter\" https://www.musicmtr.com) is a digital tracking service that tracks and reports the number and times an individual track is played. MTR™ uses a proprietary algorithm to uniquely identify and match a track. The Company launched MTR™ in beta in fourth quarter of 2023. During the beta phase of this new product, the Company will test monitoring uptime, customer acquisition activities and is adding functionality for sale at scale. The beta version of the platform will initially monitor digital broadcasts of 800 stations in Canada.\nDigital transmission of music has provided the music industry new opportunities to reach and target its audience. These opportunities include digital streaming providers, social media, radio broadcasting, narrowcasting, and other transmissions. Traditional terrestrial radio and newer internet only stations now stream to digital receivers. With this industry change, a product like MTR™ is now possible.\nMTR™ is a standalone business distinct from the Play MPE® platform. The Company expects that MTR™'s initial customers will overlap with the Play MPE® customer base. Play MPE® customers have expressed an interest in this type of service.\nClipstream®\nThe Company also developed Clipstream® for the online video industry for which it is pursuing strategic alternatives. The Clipstream® Online Video Platform (OVP) is a self-service system, for encoding, hosting and reporting on video playback which can be embedded in third party websites or emails. Playback is currently through the Company's proprietary JavaScript codec engine, which is only available on the internet through the Company. The unique software-based approach to rendering video, has patents claiming initial priority to 2011. This product has incidental revenues and is not supported or marketed.\nProducts under development\nDestiny is currently developing additional functionality and complimentary services that are expected to expand the Company's addressable market, or act as catalysts to the Company's sales activities for Play MPE®. These are described more fully in business development.\nBUSINESS DEVELOPMENT\nPlay MPE®\nThe Company's immediate term objective is to expand its global market share of promotional distribution of music by expanding the use of the Play MPE® platform in new market segments and well-established markets. Management believes that its current competitive advantages and market dynamics will lead to an increased market share for Play MPE® worldwide. In addition to currently existing competitive advantages, management is currently investing in new features and processes to grow activity and users both sides of the transactions that generate revenue for Play MPE® and improved marketing processes. Management believes that growth in Play MPE® market share will come from new territory acquisition, and growth in established territories through the addition of value added services, complementary products, expanded destinations (larger average sales), and growth in retained clients.\nWhen developing a new territory, services are initially provided free of charge in order to establish recipient activity. At this stage, Play MPE® is focused on growing content and growing active recipient engagement. When sufficient active users are engaging within a new segment, commercial use of the relevant list begins. Initial charges can take the form of pilot agreements with nominal fees to larger customers or by introductory list pricing for customers that do not yet have frequent and predictable use.\nTargeted list management services\nPlay MPE®'s curated destination lists are selected on the majority of releases sent through the platform. Customers range from those that have the capacity to curate their own customer contacts to those that have no capacity to do so. Play MPE® lists are carefully curated, targeted and current. Where provided, Play MPE® curated lists generate significantly greater activity than seen on lists maintained solely by our clients and provide significant value to all customers of the platform.\nWhere Play MPE® can provide more active and engaged recipient list options, Play MPE® will grow revenue. During the year, the Company increased pricing for certain curated lists, expanded list options and modified the list selection process to encourage greater list selection.\nThe Company expanded its commercially available destinations with a series of international distribution lists by genre. These lists initially comprise existing active user lists that were previously listed solely in the specific jurisdictions. Throughout the year the Company added eleven new international genre lists for Alternative, Dance/EDM/Rhythmic, Jazz & Classical, Country, Christian, Rock, Urban, Metal, Classic Hits, Non-Commercial/Community and a Holiday list at the conclusion of the fiscal year. As Play MPE® adds more territories, these international lists become more valuable and revenue will increase. International lists provide the ability for certain record labels and artists to promote their music more broadly. Typically, international recipient lists are selected only by labels without an international presence. Play MPE® also began a series of technical adjustments designed to increase the rate of new recipient additions in order to expand recipient list options. As yet, these technical adjustments have not materially added to our recipient lists.\nIn the fourth quarter, the Company improved its list selection process during release creation. These improvements contributed to an increase in the average number of distribution lists selected per release.\nDeveloped markets\nPlay MPE® has long standing and well-established use in several genres of music within the United States, and all music genres in Australia, New Zealand, Sweden, Finland, Norway, and Denmark. Within the United States, Play MPE® has a very long history and strong user base within the Christian, Country, Non - Commercial/NPR, College, Adult Album Alternative (aka Triple A), and Americana music genres.\nIn these core markets, high customer retention results in a persistent revenue growth. Towards the end of the Company's second quarter, Play MPE® increased marketing resources to increase new customer acquisition through paid on-line advertising, search engine optimization strategies and improved website flows. These adjustments led to recovery of revenue in the latter half of the fiscal year.\nGlobal\nPlay MPE® has maintained its global distribution agreement with our largest client. Play MPE® has been providing distribution to our largest client since 2004 and has had a global distribution agreement since 2009. Our largest client's distributions have grown dramatically since 2018 from expanded use in new territories and growing use of the online version of the platform.\nThis client regularly uses Play MPE® for distribution in over 40 countries around the globe. Both a PC application and the online Caster platform are available. Caster's local distribution tools were launched in 2018, while the global architecture platform was launched in January 2022.\nAs described above, Play MPE® has several global distribution features that provide competitive advantages that enhance label revenue and provide substantial efficiencies in the process. However, while Play MPE® has Major Record Label and international independent commercial use in several territories, Play MPE® does not currently have other global agreements in place.\nDeveloping markets\nDeveloping markets include twenty Latin American or Spanish-speaking countries, additional genres of music within the USA, Canada, South Africa, and international distributions for independents.\nManagement's strategy in new developing markets starts with providing access to the system without commercial arrangements to seed the platform with desirable content. This content is required to directly engage recipient activity. Content that normally facilitates recipient activity comes from the Major Record Labels or larger multi-national independent record labels (\"Major Independent Labels\"). To establish initial use in a new market, our business development and marketing staff collaborate to expand brand awareness, educate customers and establish trial use. Establishing a foothold in a new market therefore requires substantial face to face direct interaction with knowledgeable business development staff.\nAs recipient activity builds, our business development and operations teams adds saleable distribution lists in these new territories.\nLatin\nThe Company's Latin initiative refers to music curators of Latin music and all territories where Spanish is predominant. This includes the United States, Spain, the Caribbean, Central America, and South America. This segment is currently highly fragmented and does not benefit from any one well established system for distribution and review. As a result, the Company believes its focussed business development effort and market leading advantages will result in considerable growth in this segment. These territories include active Play MPE® users in the United States (and Puerto Rico), Mexico, Colombia, Dominican Republic, Cuba, Guatemala, Honduras, Nicaragua, Costa Rica, Panama, Ecuador, Peru, Brazil, Bolivia, Chile, Uruguay, Argentina, and Spain.\nThroughout the fiscal year the business development team has worked to individually onboard both critical recipients and independent label users in the region. The marketing team has executed partnerships with important industry events such as the Latin Alternative Music Conference and Dominican Music Week in order to aid this education process.\nThe Company's Caster and Player software, product website, and supporting tutorial video library are all available in Spanish.\nUnited States\nWhile Play MPE® enjoys a market dominate position in the aforementioned genres of music within the United States, the Company has stronger competition in various Rock genres, Urban, Rhythmic and Pop/Top 40 formats. While we were first to the market, we did not expand to these genres and competitors filled this space. With greater investments in product and business development staff than competitive platforms, Play MPE® is hoping to expand and displace competitive platforms.\nCanada\nIn 2019, the Company saw an opportunity to expand into Canada due to the relative strengths of Play MPE® over an established system which operates within Canada. While the competing system in Canada has numerous competitive weaknesses, it benefits from brand awareness and process inertia. In order to attract users to the Play MPE® platform, the Company initially focused its business development efforts on garnering Major Label and Major Independent content.\nStronger Play MPE® recipient list management processes and a superior recipient experience helped Play MPE® make inroads in active use.\nInitial revenue within Canada was derived from record labels sending content outside of Canada. This customer led desire in part influenced the Company's international list creation discussed above. With growing success and adoption at Canadian radio, the Company has begun to grow revenue within the Canadian market. The growing recipient engagement has helped the Company secure several exclusive agreements with independent record labels within the territory.\nSouth Africa\nPlay MPE® has been in active use by Universal Music South Africa within South Africa since 2016. Play MPE® has now developed an established user base and brand recognition. Warner Music South Africa entered into an exclusive two-year renewable agreement with Play MPE® at the beginning of fiscal 2022. South African total revenue was immaterially up over prior year.\nRadio monitoring (MTR™)\nThe Company beta launched MTR™ one month prior to the end of the fiscal year. Play MPE® customer feedback initially drove the creation of MTR™. While MTR™ operates as a distinct business, its customer base is expected to initially be existing Play MPE® customers. The beta launch was open only to customer tracking content play in Canada. Immediately following the beta launch the Company began investigating various customer acquisition strategies as the product development team continue to test various technical aspects and grow necessary features.\nClipstream®\nIn fiscal 2018, after completing a detailed review of the resources required to progress Clipstream further, the Company stopped development. Business development efforts are focused on identifying strategic alternatives for this product, business, and intellectual property outside the Company.\nSignificant Customers\nDuring the year ended August 31, 2023, we generated 41.9% of total revenue from one customer (2022 - 41.3%).\nOUR BUSINESS OPERATIONS\nIn 2017, the Company entered into a lease agreement commencing July 1, 2017, and expiring June 30, 2022 consisting of approximately 6,600 square feet of office space. The Company terminated the lease agreement on January 31, 2022. Since then, the Company has secured a one-year renewable annual lease for office space in downtown Vancouver, British Columbia, scheduled to expire in April 2024.\nAs of November 28, 2023, the Company had 35 full-time employees and 5 full-time consultants.\nCOMPETITION\nPlay MPE®\nWhere a specific platform or method of distribution dominates a particular market segment, there are significant barriers to entry. This aspect applies where Play MPE® dominates a market segment or where a competitive platform dominates a segment in which Play MPE® is attempting to expand. Customers are reluctant to move to a new method and abandoning established processes in favor of an improved platform. This creates a resistance to change at both the recipient and sender level.\nPlay MPE® has numerous regional competitors isolated to a specific segment. Competitive alternatives include physical delivery, one-time digital deliveries providers or digital archives. Digital archives are libraries of browsable music content that keep music in an organized database that can be accessed over a period of time. Play MPE® is a digital archive.\nDigital archives have numerous advantages over both physical and simply digital delivery services. In many cases these options are not designed for the industry, do not provide integrations, do not provide reporting, artist information and metadata are unavailable or less accessible and produce a lower rate of transfer. While these options are typically less expensive, they also provide significantly lower value.\nPlay MPE®'s advantages over competing archival platforms can be grouped into functionality that is either necessary to efficiently manage global marketing processes, or functionality that is isolated to local promotions campaigns or a more intuitive, improved user experience.\nNo other competing system provides the breadth of international distribution recipient lists or active recipients. The Company is also unaware of any system that provides the unique global distribution functionality that provides significant competitive advantages in a cross market, cross label, global music marketing environment. Play MPE®'s features that facilitate global marketing campaigns are critical to the Company's global agreement with our largest client and a significant barrier to entry for a competitive offering. This agreement facilitates use by this client in numerous territories globally but does not guarantee it.\nPlay MPE® provides a superior user experience with its local distribution platform and on its players. The superior user experience and accurate and engaged recipient lists that Play MPE® provides results in increased activity on both sides of the platform. With increased activity, a marketing campaign's effectiveness increases.\nWhen targeting a specific and incremental territory, the Company either has a dominant competitor or the market is fragmented. In both cases, it is critical that Play MPE® establish a network of activity on both sides of the platform by gathering content and obtaining recipient activity.\nMTR™\nMTR™ is designed to track a small number of tracks across a broad number of broadcasting stations. In this respect, there is no established competitor with a significant market share and this is an underserved and undeveloped market. Initial digital marketing campaigns suggest that MTR™'s potential customers are unaware that a service like MTR™ exists. Typically, the information that MTR™ is designed to produce, is provided by costly charting services that monitor a limited number of stations, in a limited number of territories. In providing this information, however, charting services provide a comprehensive report showing a much broader list of tracks and has greater information than MTR™ currently provides.\nIt is expected that MTR™'s initial customers will be those that need information from either a broader list of stations or a limited number of tracks at a lower access price.\nSEASONALITY AND CYCLICALITY\nOur operating results and operating cash flows have been subject to significant seasonal variations where holidays around late December typically result in lower than average sales. The Company has recently begun promoting archival distributions to take advantage of staff capacity and to provide greater value to both clients and recipients and to increase revenue around this time.\nGOVERNMENT REGULATION\nWe are not currently subject to direct regulation by any governmental agency other than laws and regulations generally applicable to businesses. It is possible that a number of laws and regulations may be adopted in both the United States and Canada with particular applicability to the Internet. Governments have and may continue to enact legislation applicable to us in areas such as content distribution, performance and copying, other copyright issues, network security, encryption, the use of key escrow data, privacy protection, caching of content by server products, electronic authentication or \"digital\" signatures, illegal or obscene content, access charges and retransmission activities. The applicability to the Internet of existing laws governing issues such as property ownership, content, taxation, defamation, and personal privacy is also uncertain. Export or import restrictions, new legislation or regulation or governmental enforcement of existing regulations may limit the growth of the Internet, increase our costs of doing business or increase its legal exposure.\nThe Company owns proprietary algorithms, source code, web domain addresses, patents, trademarks and other intellectual property.\nPatents\n1. Digital Locking \"Digital Media Distribution Method and System\" (US Patent No. 7466823)\nThis patent provides a method of locking digital content which prevents play back on unauthorized machines and devices. Claims include separating security from the content, so that content files can be shared securely over peer-to-peer networks. This is one of the earliest patents for securing peer-to-peer distributed content.\nOne of the more important claims in this patent is the ability to uniquely recognize a particular computer. Uniquely identifying a person's computer is a common issue which is usually approached by saving cookies or beacons to the user's computer or by tracking IP addresses. These are not reliable solutions as cookies are easily deleted and IP addresses easily changed. The Company's proprietary hash code process creates a serial number that can be used to recognize the user on subsequent visits without ever saving anything to that user's computer.\nWatermarking \"Methods for Watermarking Media Data\"\ni. US Patents No. 7983441,8300885, 9165560, 9679574\nii. US pending application No. 15/358834\nWe have developed a watermarking technology which can uniquely identify the individual who originally accessed a particular song. Our watermark is unique as it can be embedded and identified rapidly, it is inaudible, it survives on air broadcast, compression and conversion to other formats and is virtually impossible to remove. Our watermarking technology is used in the Play MPE® distribution system when songs are exported or when streaming a track. Other watermarking technologies are slow and provide a trade-off between a destruction of audio quality and the ease that they can be filtered out. When the original patent claims were granted in the US, the Company filed a set of new additional, broader claims in a continuation application in Canada and the US to further protect the technology.\n2. Cross Platform Streaming Video \"Script Based Video Rendering\"\na. US Patents No. 9143826, 9137567, 9215499, 9571886, 9380338, 9432726 and 9432727\nb. China Patent No. 201280050754.7\nc. Pending India Application No. 1961/DELNO/2014\nThis solution enables publishers to serve streaming video from their web site without the need for a separate streaming server. The solution will play instantly in all recent browsers, including mobile devices, without the need for a separate video player.\nRegistered Trademarks\nPlay MPE®\nGranted: USA, Canada, Japan, European Union, China and Australia\nMPE®\nGranted: Canada, Japan,\nSonox Digital®\nGranted: China, Canada\nClipstream®\nGranted: USA, Canada, Japan, Israel, European Union, China and Australia\nMTR™\nDomain Names\nWe own a large number of domain names, including many valuable four-letter domain names (dice.net, dsny.com) and URL's featuring common words (radio-play.com, streamingaudio.com, pirateradio.com and many others). ITEM 1A. RISK FACTORS.\nYou should carefully consider the following risk factors, together with the other information contained in this annual report on Form 10-K, including our financial statements and the related notes and \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" before making a decision to purchase or sell shares of our common stock. We cannot assure you that any of the events discussed in the risk factors below will not occur. These risks could have a material and adverse impact on our business, results of operations, financial condition and growth prospects. If that were to happen, the trading price of our common stock could decline. Additional risks and uncertainties not presently known to us or that we currently deem immaterial also may impair our business operations or financial condition. In this section, we first provide a summary of the more significant risks and uncertainties we face and then provide a full set of risk factors and discuss them in greater detail.\nIf revenues decline, then our financial condition and results of operations will be adversely affected.\nOur revenue is predominantly generated from our Play MPE® distribution service. Competitors may arise and/or customers may not renew distribution contracts. This factor could cause our revenue to decrease with the result that our financial condition and operating results would be adversely affected. Competitors have been small, regionally based, have limited resources, and have yet to capture a material share of the market. If a competitor were to develop a comparable or superior product, our market share could be reduced.\nIf we are not able to control our operating expenses, then our financial condition may be adversely affected.\nOur ability to maintain profitability is conditional upon our ability to control our operating expenses. There is a risk that we will have to increase our operating expenses in the future. Factors that could cause our operating expenses to increase include: our determination to spend more on sales, marketing, and business development to increase product sales, our determination that more research and development expenditures are required to keep our current software products competitive, or to develop new products for the market. To the extent that our operating expenses increase without a corresponding increase in revenue, our financial condition would be adversely impacted.\nIf we are not successful in legal proceedings against us, then our business and financial condition could be adversely affected.\nThe Company is subject to claims and legal proceedings that arise in the ordinary course of business. Such matters are inherently uncertain, and there can be no guarantee that the outcome of any such matter will be decided favorably to the Company or that the resolution of any such matter will not have a material adverse effect upon the Company's financial statements. The Company does not believe that any of such pending claims and legal proceedings will have a material adverse effect on its consolidated financial statements, however if we are not successful in these legal proceeding and are forced to make payments of damages to the plaintiffs, then our business and our financial condition would be adversely affected.\nOur financial results may be adversely impacted by currency fluctuations.\nOur revenues are primarily in United States dollars and Euros while our operating expenses are primarily in Canadian dollars. An increase in the value of the Canadian dollar in relation to the United States dollar and/or Euro could have the effect of decreasing our income from operations. We do not currently hedge our foreign currency exposures.\nIf our products are defective or contain errors, we may become subject to product liability claims.\nAs a result of their complexity, our software products may contain undetected errors or failures when first introduced or as new versions are released. There can be no assurance that, despite testing we undertake and testing and use by current and potential customers, errors will not be found in new products after commencement of commercial use. The occurrence of such errors could result in loss of or delay in market acceptance of our products, which could have a material adverse effect on our business, financial condition, and results of operations. Our products also may be vulnerable to break-ins and similar disruptive problems caused by Internet or other users.\nSuch computer break-ins and other disruptions would jeopardize the security of information stored in and transmitted through the computer systems of our customers, which may result in significant liability to us and deter potential customers. The sale and support of our products may entail the risk of liability claims. A product liability claim brought against us could have a material adverse effect on our business, financial condition, and results of operations.\nSuccessful expansion of our business will depend on our ability to manage growth.\nShould we be successful in the sales, marketing, and business development efforts of our software products, we will experience significant growth in operations. If this occurs, management anticipates that additional expansion will be required to continue our product development. Any expansion of our business would place further demands on our management, operational capacity, and financial resources. We anticipate that we may need to recruit qualified personnel in all areas of operations, including management, sales, marketing, delivery, and software development. There can be no assurance that we will be effective in attracting and retaining additional qualified personnel, expanding operational capacity or otherwise managing growth. In addition, there can be no assurance that our current systems, procedures, or controls will be adequate to support any expansion of our operations. The failure to manage growth effectively could have a material adverse effect on our business, financial condition, and results of operations.\nOur network infrastructure could be vulnerable to system failure and/or security risks.\nDespite the implementation of security measures, our network infrastructure could be vulnerable to unforeseen computer problems. Although we believe we have taken steps to mitigate much of the risk, we may in the future experience interruptions in service as a result of the accidental or intentional actions of Internet users, current and former employees, or others. Unknown security risks may result in liability to us and may also deter new customers from purchasing our software and services, and individuals from utilizing it. Although we intend to continue to implement and establish security measures, there can be no assurance that measures implemented by us will not be circumvented in the future, which could have a material adverse effect on our business, financial condition, or results of operations.\nOur business depends on continued development of the internet and intranets as mediums of commerce and communications, and our ability to evolve along with these mediums.\nThe market for our streaming media products and services is new and evolving rapidly. It depends on increased use of the Internet and intranets. If the Internet and intranets are not adopted as methods for commerce and communications, or if the adoption rate slows, the market for our products and services may not grow or may develop more slowly than expected.\nSales of our products depend in large part on the continued development of the Internet as a viable commercial marketplace. There are now substantially more users and much more \"traffic\" over the Internet than ever before, use of the Internet is growing faster than anticipated, and the technological infrastructure of the Internet may be unable to support the demands placed on it by continued growth. Delays in development or adoption of new technological standards and protocols, or increased government regulation, could also affect Internet use. In addition, issues related to use of the Internet and intranets, such as security, reliability, cost, ease of use and quality of service, remain unresolved and may affect the amount of business that is conducted over the Internet and intranets.\nWe could experience product delays and errors, which could affect our ability to adapt to technological changes and evolving industry standards.\nWe have experienced development delays and cost overruns associated with our product development efforts. We may encounter such problems in the future. Delays and cost overruns could affect our ability to respond to technological changes, evolving industry standards, competitive developments, or customer requirements. Our products also may contain undetected errors that could cause adverse publicity, reduced market acceptance of the products, or lawsuits by customers.\nOur business could be adversely affected by online commerce security failures.\nOnline commerce and communications depend on the ability to transmit confidential information securely over public networks. Any compromise of our ability to transmit confidential information securely, and costs associated with the prevention or elimination of such problems, could have a material adverse effect on our business.\nOur business is international and could be affected by unexpected changes in international regulatory standards and laws.\nWe market and sell our products in the United States, Canada, Europe, Asia, South America, Africa and Australia. As such, we are subject to the normal risks of doing business abroad. Risks include unexpected changes in regulatory requirements, export and import restrictions, tariffs and trade barriers, difficulties in staffing and managing foreign operations, longer payment cycles, problems in collecting accounts receivable, potential adverse tax consequences, exchange rate fluctuations, increased risks of piracy, limits on the our ability to enforce our intellectual property rights, discontinuity of our infrastructures, limitations on fund transfers and other legal and political risks. Such limitations and interruptions could have a material adverse effect on our business.\nCustomer concentration.\nDuring the year ended August 31, 2023, 41.9% of the Company's revenue is derived from one customer with operations in numerous countries. This customer is currently of key importance to our operations and any adverse change to the revenue from this customer would have a material adverse effect on our results of operations. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone. ITEM 2. PROPERTIES.\nUp until January 31, 2022, our head office was located in a leased premises of approximately 6,600 square feet at Suite 1110, 885 West Georgia Street, Vancouver, British Columbia, Canada V6C 3E8. Rent paid was approximately $21,000 per month. The Company terminated the lease agreement on January 31, 2022. Since then, the Company has secured a one-year renewable annual lease for office space in downtown Vancouver, British Columbia, scheduled to expire in April 2024.\nFor additional information, see Note 5, Right-of-Use Asset and Lease Liability included in Item 8 of this Annual Report on Form 10-K. ITEM 3. LEGAL PROCEEDINGS.\nFrom time to time, we may become involved in various lawsuits and legal proceedings which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. Except as described below, we are not aware of any such legal proceedings or claims against us.\nOn September 5, 2017, the Company's former President and Chief Executive Officer filed a Notice of Civil Claim in the Supreme Court of British Columbia against the Company, its subsidiaries, independent directors, and current Chief Executive Officer, claiming damages for conspiracy, breach of contract, wrongful dismissal, defamation and aggravated and punitive damages. The Company believes the claims are without merit and is defending itself against the claims. The quantum of loss, if any, is not determinable at this time and management believes it is unlikely that the outcome of this matter will have an adverse impact on its results of operations, cash flows and financial condition. ITEM 4. MINE SAFETY DISCLOSURES.\nNot Applicable.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nOur shares are currently trading on the OTCQB under the stock symbol DSNY. The average high and the low trading prices for our shares for each quarter of the last two fiscal years were:\nQUARTER\nHIGH ($)\nLOW ($)\n1st Quarter 2022\n$1.55\n$1.23\n2ndQuarter 2022\n$1.32\n$1.04\n3rd Quarter 2022\n$1.08\n$0.85\n4th Quarter 2022\n$0.71\n$0.54\n1st Quarter 2023\n$0.64\n$0.39\n2nd Quarter 2023\n$0.70\n$0.52\n3rd Quarter 2023\n$0.94\n$0.59\n4th Quarter 2023\n$0.92\n$0.65\nThe trades reflect inter-dealer prices, without retail mark-up, markdown or commission and may not represent actual transactions.\nOur shares are also traded on the TSX Venture Exchange under the symbol DSY.\nHolders of Common Stock\nAs of November 28, 2023 our shareholders' list for our common stock showed 60 registered shareholders and 9,924,610 shares of our common stock outstanding.\nDividends\nWe have neither declared nor paid any cash dividends on our capital stock and do not anticipate paying cash dividends in the foreseeable future. Our current policy is to retain any earnings to finance the expansion of our operations. Our Board of Directors will determine future declaration and payment of dividends, if any, in light of the then-current conditions they deem relevant and in accordance with applicable corporate law.\nRecent Sales of Unregistered Securities\nFor a description of our equity compensation plans, please see Item 12 of this report on Form 10-K.\nRepurchases of Equity Securities by the Issuer and Affiliated Purchasers\nDuring the year ended August 31, 2023, the Company repurchased and cancelled 25,651 common shares for $21,135 (2022 - 143,100 common shares for $179,401).\nSecurities Authorized for Issuance Under Equity Compensation Plans\nPursuant to the Company's 2015 Stock Option Plan (the \"2015 Plan\"), 530,000 shares of common stock have been reserved for issuance. A total of 420,000 common shares remain eligible for issuance under the 2015 Plan. On February 18, 2022, our Board of Directors approved the Company's 2022 Stock Option Plan (the \"2022 Plan\"), (together with the 2015 Plan, the \"Plans\"), whereby 1,000,000 common shares are reserved for issuance. A total of 361,000 common shares remain eligible for issuance under the 2022 Plan.\nSee Item 11 \"Executive Compensation - Equity Compensation Plan Information\" for additional information regarding the Plan. ITEM 6. SELECTED FINANCIAL DATA.\nPer §229.301 of Regulation S-K, the Company, designated a Smaller Reporting Company as defined in Section §229.10(f)(1) of Regulation S-K, is not required to provide selected financial data. Management's Discussion and Analysis of Financial Condition and Results of Operations is intended to help the reader understand the results of operations and financial condition of the Company and should be read in conjunction with our audited consolidated financial statements and notes thereto for the year ended August 31, 2023. ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following discussion and analysis of our financial condition and results of operations should be read together with our consolidated financial statements and related notes appearing elsewhere in this Annual Report on Form 10-K. Some of the information contained in this discussion and analysis or set forth elsewhere in this Annual Report on Form 10-K, including information with respect to our plans and strategy for our business and financing needs, includes forward-looking statements that involve risks and uncertainties and should be read together with the \"Risk Factors\" section of this Annual Report on Form 10-K for a discussion of important factors that could cause actual results to differ materially from the results described in or implied by the forward-looking statements contained in the following discussion and analysis. Our actual results could differ materially from those anticipated in these forward-looking statements as a result of various factors, including those discussed below and elsewhere in this Annual Report and in other reports we file with the SEC, particularly those under \"Risk Factors.\"\nComponents of Results of Operations\nService revenue\nThe majority of the Company's revenue is generated from digital media distribution service. The service is billed either based on usage or on a fixed fee which is based on the volume and size of distributions provided. All revenues are recognized as the services are rendered to customers.\nCost of revenue\nCost of revenue primarily consists of personnel costs for our operations service and technical support employees and engineering support staff, cloud infrastructure costs, incremental transaction costs such as merchant and processing fees, and costs of external customer support software and services. In each case, personnel costs include salaries, benefits and any other compensation paid to such staff.\nOperating expenses\nOur technologies and products are developed and maintained in-house, the majority of our expenditures are contributed towards salaries, wages and benefits. Our operations are primarily conducted in Canada and therefore, our costs are primarily incurred in Canadian dollars while our revenues are primarily denominated in Euros and US dollars. Thus, operating expenses and the results of operations are impacted, to the extent they are not hedged, by the rise and fall of the relative values of the Canadian dollar to these currencies. The Company maintains a large portion of its financial reserves in Canadian dollars to mitigate the downside risk of adverse exchange rates on its operating expenditures.\nGeneral and administrative expenses consist of salaries and related personnel costs including overhead, office rent, professional fees, shareholder relations, and general office expenses.\nSales and marketing expenses consist of salaries and related personnel costs including overhead, office rent, and telecommunications costs. Sales and marketing expenses also include advertising and marketing expenditures, which consist of promotional materials, online or print advertising, business development tools, and marketing or business development related travel costs, including attendance at conference or trade shows, and record label and client visits.\nProduct development expenses consist primarily of salaries and related personnel costs including overhead and consulting fees with respect to product development and deployment.\nRESULTS OF OPERATIONS FOR THE YEARS ENDED AUGUST 31, 2023 AND 2022\nRevenue\nTotal revenue for the year ended August 31, 2023 increased by 0.3% to $4,034,384 compared to the revenue of $4,023,910 for the year ended August 31, 2022. Adjusted for impacts of foreign currency translation, Play MPE® revenue increased 1.9% year over year. The negative impact of foreign currency translation is attributed to the decline in the value of the Euro and the Australian dollar relative to the US dollar.\nThe Company experienced a 6.1% growth in revenue in the second half of the year recovering from a slow start to the year. This growth came as the result expanded distribution list options, increased investments in digital marketing that commenced at the beginning of our third quarter, in-platform list selection improvements that took effect in our fourth quarter and improvements in foreign exchange rates which eliminated the negative impact to revenue experienced in the first half of the year.\nThe Company's revenues are denominated predominantly in US Dollars, Euros and Australian Dollars.\n% of Total Revenue\nCurrency 2023 2022\nUS Dollar 46.9% 45.6%\nEuro 45.2% 45.6%\nAustralian Dollar 3.9% 4.3%\nOther 4.0% 4.5%\nGross Margin\nGross margin for the year ended August 31, 2023 was 87.2% of revenue, which represents an increase of 3.5% from the year ended August 31, 2022. The Company's cost of revenue consists of data hosting and processing charges, third party transaction related costs, and engineering, technical and customer support costs. These costs are driven by the size and volume of customer transactions processed, as well as the relative proportion of \"full-service\" versus \"self-service\" revenue. Our self-service sales are derived from customers who have been provided with a customer account to access our encoder to independently upload and publish releases. Our full-service revenue is derived from customers who are fully serviced by our internal staff, who prepare and publish releases on their behalf. During the year ended August 31, 2023, our gross margin increased over the comparative year predominately due to a decrease in costs associated with the hosting services and a decrease of staffing in technical and customer support departments.\nOperating Expenses\nOperating costs during the year ended August 31, 2023 decreased by 0.5% to $3,218,092 (2022 - $3,233,860). The decrease in operating costs was primarily the result of the following:\nFavorable foreign exchange rates reduced the overall operating costs by approximately 3.7%. The majority of our operating costs are denominated in Canadian dollars. As the US dollar strengthened on average relative to the Canadian dollar, our operating costs as expressed in US dollars declined.\nWhile total salaries and wages remained relatively consistent with the prior year, we increased the amount capitalized to capital software assets and software under development intangible asset resulting in a decrease to total operating expenses of approximately 1.6%.\nWith the growing capitalization of salaries and wages, amortization expense grew overall expenditures by 3.0%.\nOne-time professional fees associated with resolving outstanding litigation grew overall expenditures by 1.6%.\nFor ease of reference the following table has been prepared to present operating results had the Company not capitalized software for fiscal years 2023 and 2022.\n2023 2022\nNet Income for the Year $ 335,098 $ 149,047\nCapitalized Software Development (682,617 ) (626,778 )\nAdjustment to Amortization of Capitalized Software 166,235 65,937\nAdjusted net income (loss) for the year $ (181,284 ) $ (411,794 )\nGeneral and Administrative Expenses\n2023 2022 $ Change % Change\nWages and benefits $ 384,213 $ 455,343 (71,130 ) (15.6%)\nProfessional fees 240,254 145,578 94,676 65.0%\nOffice and miscellaneous 92,157 102,124 (9,967 ) (9.8%)\nShareholder relations 75,670 77,416 (1,746 ) (2.3%)\nRent 49,231 59,631 (10,400 ) (17.4%)\nForeign exchange loss (118,228 ) 58,299 (176,527 ) (302.8%)\nTelecommunications 10,882 8,391 2,491 29.7%\nBad debt 3,129 44,304 (41,175 ) (92.9%)\nOther 32,305 29,295 3,010 10.3%\nTotal general and administrative expenses $ 769,613 $ 980,381 (210,768 ) (21.5%)\nThe decrease in salaries and wages can be explained by a temporary decrease in full time equivalent staffing for August 31, 2023 and one-time staff recruitment fees. Professional fees were temporarily increased due to one-time litigation expenses, which were subsequently resolved through a favorable judgment in the Company's favour. The Company was awarded costs and has only partially recognized the collection of those costs.\nSales and Marketing Expenses\n2023 2022 $ Change % Change\nWages and benefits $ 724,297 $ 825,551 (101,254 ) (12.3%)\nAdvertising and marketing 97,129 121,981 (24,852 ) (20.4%)\nRent 41,755 57,814 (16,059 ) (27.8%)\nTelecommunications 9,498 5,853 3,645 62.3%\nTotal sales and marketing expenses $ 872,679 $ 1,011,199 (138,520 ) (13.7%)\nThe decrease in wages and benefits is the result of a temporary decrease in full time equivalent staffing for August 31, 2023. The decrease in advertising and marketing expenses is related to timing of sponsorship, advertising, and attendance at industry events in the fiscal year 2023.\nProduct Development Expenses\nProduct development expenses 2023 2022 $ Change % Change\nWages and benefits $ 1,045,492 $ 846,737 198,755 23.5%\nSoftware services 89,131 81,615 7,516 9.2%\nRent 79,690 84,991 (5,301 ) (6.2%)\nTelecommunications 123,132 83,592 39,540 47.3%\nOther - 2,683 (2,683 ) 100.0%\nProduct development expenses $ 1,337,445 $ 1,099,618 237,827 21.6%\nThe rise in wages and benefits can be attributed to the recruitment of additional development staff, aimed at accelerating the implementation of new additions to the product roadmap. Additionally, for the year ended August 31, 2023, the Company increased the amount of capitalized product development wages, reflecting a continued significant investment in product development to expand its addressable market. The increase in telecommunications costs is directly associated with the expansion of product development activities.\nDepreciation and Amortization\nDepreciation and amortization expense increased to $238,355 for the year ended August 31, 2023 from $142,662 for the year ended August 31, 2022, an increase of 67.1% was due to depreciation of additionally capitalized software development costs associated with Play MPE® recipient player applications during the year.\nOther Income\nInterest income earned on the Company's Guaranteed Investment Certificates was $36,498 for the year ended August 31, 2023 (2022 - $9,153). The interest income more than doubled year over year due to increased interest rates in Canada.\nAdditionally, the Company terminated its lease agreement for the office space on January 31, 2022. Upon termination the Company disposed of leasehold fixtures and fittings and recorded a gain on lease termination of $11,018 for the year ended August 31, 2022.\nNet Income\nFor the year ended August 31, 2023, we reported a net income of $335,098 (2022 - $149,074).\nFor the year ended August 31, 2023, adjusted EBITDA was $687,463 (2022 - $435,507). Adjusted EBITDA is not defined under U.S. GAAP, and it may not be comparable to similarly titled measures reported by other companies. We used Adjusted EBITDA, along with other GAAP measures, as a measure of our profitability because Adjusted EBITDA helps us to compare our performance on a consistent basis by removing from our operating results the impact of our capital structure, the effect of operating in different tax jurisdictions, the impact of our asset base, which can differ depending on the book value of assets, the accounting methods used to compute depreciation and amortization, the existence or timing of asset impairments and the effect of non-cash stock-based compensation expense.\nWe believe Adjusted EBITDA is useful to investors as it is a widely used measure of performance and the adjustments we make to Adjusted EBITDA provide further clarity on our profitability. We remove the effect of non-cash stock-based compensation from our earnings which can vary based on share price, share price volatility, and expected life of the equity instruments we grant. In addition, this stock-based compensation expense does not result in cash payments by the Company. Adjusted EBITDA has limitations as a profitability measure in that it does not include provisions for income taxes, the effect of our expenditures on capital assets, the effect of non-cash stock-based compensation expense and the effect of asset impairments. The following is a reconciliation of net income from operations to Adjusted EBITDA:\n2023 2022\nNet income $ 335,098 $ 149,074\nCurrent income tax 2,576 4,348\nStock-based compensation 147,932 148,576\nDepreciation and amortization 238,355 142,662\nInterest income (36,498 ) (9,153 )\nAdjusted EBITDA $ 687,463 $ 435,507\nLIQUIDITY, FINANCIAL CONDITION\nAs of August 31, 2023, we held $2,002,769 (2022 - $2,095,928) in cash and cash equivalents. The Company's cash equivalents consist of investments in mutual funds with a major Canadian financial institution that earn interest at variable interest rates ranging from 4.55% - 4.90%.\nOn August 31, 2023, we had working capital of $2,185,960 compared to $2,268,778 as at August 31, 2022. The decrease in our working capital was primarily due to operating results.\nCash Flows\nThe following table sets forth a summary of the net cash flow activity for each of the years indicated:\nNet cash and cash equivalents provided by (used in) 2023 2022 $ Change % Change\nOperating activities $ 705,634 $ 307,198 398,436 129.7%\nInvesting activities (716,024 ) (692,846 ) (23,178 ) 3.3%\nFinancing activities (21,135 ) (190,676 ) 169,541 (88.9%)\nEffect of foreign exchange rate changes on cash (61,634 ) (80,410 ) 18,776 (23.4%)\nNet increase (decrease) in cash and cash equivalents $ (93,159 ) $ (656,734 ) 563,575 (85.8%)\nOperating Activities\nNet cash provided by operating activities during the year ended August 31, 2023 was $705,634 (2022 - $307,198). The cash used in operating activities for the year ended August 31, 2023 was due to approximately $2.3 million spent on salaries and wages, $0.2 million in professional expenses, $0.15 million on telephone communications and cloud infrastructure, and approximately $0.1 million spent on research and development. The net cash used in operating activities for the year ended August 31, 2022 was due to approximately $2.4 million spent on salaries and wages, $0.1 million in professional expenses, $0.1 million on office expenses, $0.1 million on telephone communications and cloud infrastructure, and approximately $0.08 million spent on research and development. In 2023, the notable rise in net cash provided by operating activities compared to 2022 can be attributed primarily to the increased revenue of the Company and its proactive efforts to optimize and rightsize expenses.\nInvesting Activities\nNet cash used in investing activities for the year ended August 31, 2023 was $716,024, compared to cash used by investing activities of $692,846 for the year ended August 31, 2022. The year-over-year increase was mainly driven by the higher proportion of software development salaries and wages being capitalized this year.\nFinancing Activities\nNet cash used in financing activities during the year ended August 31, 2023 was $21,135 (2022 - $190,676) - this cash was used to repurchase and retire 25,651 shares of common stock (2022 - 143,100 shares of common stock) of the Company under the Normal Course Issuer Bid (\"NCIB\") and to repurchase stock options. The decrease in net cash used in financing activities was driven by the lower number of shares repurchased in the year.\nCAPITAL RESOURCES\nThe Company does not have any material commitments for capital expenditures and the Company is able to meet current and expected growth with income from operations.\nOFF-BALANCE SHEET ARRANGEMENTS\nAs of August 31, 2023, the Company has no off-balance sheet arrangements that have or are reasonably likely to have a current or future material effect on its financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nCRITICAL ACCOUNTING POLICIES AND SIGNIFICANT JUDGEMENTS AND ESTIMATES\nOur management's discussion and analysis of our financial condition and results of operations is based on our financial statements, which have been prepared in accordance with generally accepted accounting principles in the United States, or GAAP. The preparation of our financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities and expenses and the disclosure of contingent assets and liabilities in our financial statements and accompanying notes. We evaluate these estimates and judgments on an ongoing basis. We base our estimates on historical experience and on various other factors that we believe are reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWhile our significant accounting policies are more fully described in Note 2 to our financial statements, we believe that the following accounting policies are the most critical for fully understanding and evaluating our financial condition and results of operations:\nRevenue Recognition\nThe Company's revenue is derived from software as a service (SaaS) arrangements. The Company accounts for revenue in accordance with ASC 606. The core principle of ASC 606 is to recognize revenue upon the transfer of products or services to customers in an amount that reflects the consideration the Company expects to be entitled to in exchange for those products or services. ASC 606 prescribes a five-step model for recognizing revenue from contracts with customers: (1) identify the contract(s) with customers; (2) identify the separate performance obligations in the contract; (3) determine the transaction price; (4) allocate the transaction price to the separate performance obligations in the contract; and (5) recognize revenue when (or as) the performance obligations are satisfied. The majority of our revenue is generated from digital media distribution service. The service is billed either based on usage or on a fixed fee which is based on the volume and size of distributions provided. All revenues are recognized on a monthly basis as the services are delivered to customers.\nResearch and Development Expense for Software Products\nOur software solutions are offered to our customers through software as a service delivery models. Development costs associated with the certain solutions offered exclusively through a software as a service model are accounted for in accordance with ASC 350-40 \"Internal-Use Software\". All other client solution development costs, which represent a significant majority of development costs, are accounted for in accordance with ASC 985-20 \"Costs of Software to be Sold, Leased or Marketed\". Under ASC 985-20, software development costs incurred in creating computer software solutions are expensed until technological feasibility has been established upon completion of a detailed program design. Thereafter, all software development costs incurred through the software's general release date are capitalized and subsequently recorded at the lower of amortized cost or net realizable value. Capitalized costs are amortized based on current and expected future revenue for each software solution with minimum annual amortization equal to the straight-line amortization over the estimated economic life of the solution. We amortize capitalized costs over two years. Under ASC 350-40, software development costs related to preliminary project activities and post-implementation and maintenance activities are expensed as incurred. We capitalize direct costs related to application development activities that are probable to result in additional functionality. We test for impairment whenever events or changes in circumstances that could impact recoverability occur.\nStock-Based Compensation\nWe recognize the costs of employee services received in stock-based payment transactions according to the fair value provisions of the current stock-based payment guidance. The fair value of employee services received in stock-based payment transactions is estimated at the grant date and recognized over the requisite service period. Determining the appropriate fair value model and calculating the fair value of stock-based awards requires judgment, including estimating stock price volatility, forfeiture rates and expected life. We selected the Black-Scholes option pricing model as the most appropriate method for determining the estimated fair value of our stock-based awards. The Black-Scholes model requires the use of highly subjective and complex assumptions which determine the fair value of stock-based awards, including the option's expected term and the price volatility of the underlying stock. Our current estimate of volatility is based on historical and market-based implied volatilities of our stock price. To the extent volatility of our stock price increases in the future, our estimates of the fair value of options granted in the future could increase, thereby increasing stock-based compensation cost recognized in future periods. We derive the expected term assumption primarily based on our historical settlement experience, while giving consideration to options that have not yet completed a full life cycle. Stock-based compensation cost is recognized only for awards ultimately expected to vest. Our estimate of the forfeiture rates is based primarily on our historical experience. The estimated forfeiture rates may differ from actual forfeiture rates which would affect the amount of expense recognized during the period. In the future, as empirical evidence regarding these input estimates is available to provide more directionally predictive results, we may change or refine our approach of deriving these input estimates.\nIncome Taxes\nDeferred income tax assets and liabilities are computed based on differences between the carrying amount of assets and liabilities on the balance sheet and their corresponding tax values using the enacted income tax rates by tax jurisdiction at each balance sheet date. Deferred income tax assets also result from unused loss carryforwards and other deductions. The valuation of deferred income tax assets is reviewed annually and adjusted, if necessary, by use of a valuation allowance to reflect the estimated realizable amount. Significant management judgment is required in determining our provision for income taxes, our deferred tax assets and liabilities and any valuation allowance recorded against our net deferred tax assets. We evaluate all available evidence, such as recent and expected future operating results by tax jurisdiction, and current and enacted tax legislation and other temporary differences between book and tax accounting to determine whether it is more likely than not that some portion or all of the deferred income tax assets will not be realized. There is a risk that management estimates for operating results could vary significantly from actual results, which could materially affect the valuation of the future income tax asset. Although the Company has tax loss carryforwards and other deferred income tax assets, management has determined certain of these deferred tax assets do not meet the more likely than not criteria, and accordingly, these deferred income tax asset amounts have been completely offset by a valuation allowance as disclosed in Note 7 of our consolidated financial statements. If management's estimates of the cash flows or operating results do not materialize due to errors in estimates or unforeseen changes to the economic conditions affecting the Company, it could result in an impairment adjustment in future periods.\nAccounts Receivable and Allowance for Doubtful Accounts\nWe extend credit to our customers based on evaluation of an individual customer's financial condition and collateral is generally not required. Accounts outstanding beyond the contractual payment terms are considered past due. We determine our allowance for doubtful accounts by considering a number of factors, including the length of time accounts receivable are beyond the contractual payment terms, our previous loss history, and a customer's current ability to pay its obligation to us. We write off accounts receivable when they are identified as uncollectible. All outstanding accounts receivable accounts are periodically reviewed for collectability on an individual basis.\nContingencies\nAs discussed under \"Item 3. Legal Proceedings\" and in Note 8 - \"Commitments and Contingencies\" in notes to consolidated financial statements, the Company is subject to various legal proceedings and claims that arise in the ordinary course of business. In accordance with US GAAP, the Company records a liability when it is probable that a loss has been incurred and the amount can be reasonably estimated. There is significant judgment required in both the probability determination and as to whether an exposure can be reasonably estimated. In management's opinion, the Company does not have a potential liability related to any current legal proceedings and claims that would individually or in the aggregate materially adversely affect its financial condition or operating results. However, the outcomes of legal proceedings and claims brought against the Company are subject to significant uncertainty. Should the Company fail to prevail in any of these legal matters or should several of these legal matters be resolved against the Company in the same reporting period, the operating results of a particular reporting period could be materially adversely affected.\nImpairment of Long-Lived Assets\nWe evaluate the recoverability of our long-lived assets including tangible assets in accordance with authoritative guidance. When events or changes in circumstances indicate that the carrying amount of long-lived assets may not be recoverable, we recognize such impairment in the event the carrying amount of such assets exceeds the future undiscounted cash flows attributable to such assets. Intangible assets that are not subject to amortization are tested for impairment annually and more frequently if events or changes in circumstances indicate that it is more likely than not that the asset is impaired. We have not recorded any impairment losses to date.\nNew Accounting Pronouncements\nSee Note 2 to the Financial Statements included in Item 8 of this Annual Report. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nForeign Exchange Risk\nOur revenues are denominated primarily in United States dollars and Euros while our operating expenses are incurred primarily in Canadian dollars. Thus, operating expenses and the results of operations are impacted, to the extent they are not hedged, by the rise and fall of the relative values of the Canadian dollar to these currencies. We do not believe aggregated foreign exchange fluctuations in the Euro, and the Australian, Canadian, and US dollars have had a material effect on our results of operations during the years presented. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nDESTINY MEDIA TECHNOLOGIES, INC.\nReport of Independent Registered Public Accounting Firm (PCAOB ID No. 995)\nConsolidated Balance Sheets as of August 31, 2023 and 2022\nConsolidated Statements of Comprehensive Income for the years ended August 31, 2023 and 2022\nConsolidated Statements of Stockholders' Equity for the years ended August 31, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended August 31, 2023 and 2022\nNotes to Consolidated Financial Statements for the years ended August 31, 2023 and 2022\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Directors of Destiny Media Technologies Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying balance sheets of Destiny Media Technologies Inc. (the \"Company\") as of August 31, 2023 and 2022, and the related consolidated statements of comprehensive income, cash flows, and stockholders equity for each of the years in the two years in the period ended August 31, 2023, and the related notes (collectively referred to as the \"consolidated financial statements\").\nIn our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as at August 31, 2023 and 2022, and the results of its operations and its cash flows for each of the two years in the period ended August 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of this critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEvaluation of labour costs capitalized to computer software and software under development\nAs discussed in note 2 of the consolidated financial statements, the Company capitalizes costs related to application development activities that results in additional functionality. As discussed in note 3 and 4 of the consolidated financial statements, labour costs of $682,617 were capitalized to software under development in intangible assets, of which $559,044 was subsequently reclassified to computer software in property and equipment.\nWe identified the evaluation of labour costs capitalized to computer software and software under development as a critical audit matter. The complexity in determining whether the costs were incurred for software enhancement activities resulting in additional functionality required significant audit effort.\nOur audit procedures related to the evaluation of labour costs capitalized to computer software and software under development included the following, among others:\nWe reviewed the underlying software enhancement project plans and assessed the nature of the activities performed to determine whether recognition criteria for internal-use software are met.\nWe evaluated managements calculation of the labour costs to be capitalized by performing the following:\nWe tested the completeness of the data used in managements calculation by agreeing the total time shown in the data set to the task tracking software for the entire fiscal year, including non-capitalizable time and capitalizable tasks.\nWe tested the accuracy of the data used in managements calculation by agreeing the entry details to the details exported from the task tracking software.\nWe recalculated a sample of labour costs capitalized to computer software and software under development using data from the task tracking software.\nWe compared the completion date of the software enhancement projects to the projects completion report to verify the appropriateness of transferring certain assets from intangible assets to property and equipment during the fiscal year.\n/s/ Smythe LLP\nSmythe LLP\nChartered Professional Accountants\nWe have served as the Company's auditor since 2022.\nVancouver, Canada\nNovember 28, 2023\nDESTINY MEDIA TECHNOLOGIES, INC.\nConsolidated Balance Sheets\nNotes\nAugust 31,\nAugust 31,\nASSETS\nCash and cash equivalents\n$ 2,002,769\n$ 2,095,928\nAccounts receivable, net of allowance for doubtful accounts of $41,331 (2022 - $39,518)\n432,501\n483,774\nOther receivables\n58,519\n29,600\nPrepaid expenses\n72,014\n83,242\nDeposits\n32,214\n33,305\nTotal current assets\n2,598,017\n2,725,849\nProperty and equipment, net\n642,207\n311,792\nIntangible assets, net\n645,474\n529,717\nTotal assets\n$ 3,885,698\n$ 3,567,358\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent\nAccounts payable\n$ 110,203\n$ 116,290\nAccrued liabilities\n267,144\n319,738\nDeferred revenue\n34,710\n21,043\nTotal current liabilities\n412,057\n457,071\nTotal liabilities\n412,057\n457,071\nCommitments and contingencies\n-\n-\nStockholders' equity\nCommon stock, par value $0.001, authorized 20,000,000 shares.\nIssued and outstanding - 10,096,610 shares (2022 - 10,122,261 shares)\n10,096\n10,122\nAdditional paid-in capital\n9,242,671\n9,115,848\nAccumulated deficit\n(5,304,367 )\n(5,639,465 )\nAccumulated other comprehensive loss\n(474,759 )\n(376,218 )\nTotal stockholders' equity\n3,473,641\n3,110,287\nTotal liabilities and stockholders' equity\n$ 3,885,698\n$ 3,567,358\nThe accompanying notes are an integral part of these consolidated financial statements.\nDESTINY MEDIA TECHNOLOGIES, INC.\nConsolidated Statements of Comprehensive Income\nFor the years ended December 31,\nNotes\nService revenue $ 4,034,384\n$ 4,023,910\nCost of revenue\nHosting costs\n114,881\n178,567\nInternal engineering support\n49,353\n61,793\nCustomer support\n279,667\n350,161\nThird-party and transactions costs\n71,215\n66,278\n515,116\n656,799\nGross margin\n3,519,268\n3,367,111\n87.2%\n83.7%\nOperating expenses\nGeneral and administrative\n769,613\n980,381\nSales and marketing\n872,679\n1,011,199\nProduct development\n1,337,445\n1,099,618\nDepreciation and amortization 3,4\n238,355\n142,662\n3,218,092\n3,233,860\nIncome from operations\n301,176\n133,251\nOther income\nInterest and other income\n36,498\n9,153\nGain on disposal of assets 3,5\n-\n11,018\nNet income before income tax\n$ 337,674\n$ 153,422\nCurrent income tax expense\n(2,576 )\n(4,348 )\nNet income\n$ 335,098\n$ 149,074\nForeign currency translation adjustments\n(98,541 )\n(115,085 )\nTotal comprehensive income\n$ 236,557\n$ 33,989\nNet income per common share\nBasic and diluted $ 0.03\n$ 0.01\nWeighted average common shares outstanding:\nBasic and diluted\n10,119,454\n10,169,426\nThe accompanying notes are an integral part of these consolidated financial statements.\nDESTINY MEDIA TECHNOLOGIES, INC.\nConsolidated Statements of Stockholders' Equity\nCommon stock\nNotes\nShares\nAmount\nAdditional\nPaid-in\nCapital\nAccumulated\nDeficit\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nTotal\nStockholders'\nEquity\nBalance, August 31, 2021\n10,265,361\n$ 10,266\n$ 9,157,804\n$ (5,788,539 ) $ (261,133 ) $ 3,118,398\nTotal comprehensive income\n-\n-\n-\n149,074\n(115,085 )\n33,989\nStock-based compensation\n-\n-\n148,576\n-\n-\n148,576\nStock options repurchased and retired\n-\n-\n(11,275 )\n-\n-\n(11,275 )\nCommon shares retired\n(143,100 )\n(144 )\n(179,257 )\n-\n-\n(179,401 )\nBalance, August 31, 2022\n10,122,261\n$ 10,122\n$ 9,115,848\n$ (5,639,465 ) $ (376,218 ) $ 3,110,287\nBalance, August 31, 2022\n10,122,261\n$ 10,122\n$ 9,115,848\n$ (5,639,465 ) $ (376,218 ) $ 3,110,287\nTotal comprehensive income\n-\n-\n-\n335,098\n(98,541 )\n236,557\nStock-based compensation 6(b)\n-\n-\n147,932\n-\n-\n147,932\nStock options repurchased and retired\n-\n-\n-\n-\n-\n-\nCommon shares retired 6(a)\n(25,651 )\n(26 )\n(21,109 )\n-\n-\n(21,135 )\nBalance, August 31, 2023\n10,096,610\n$ 10,096\n$ 9,242,671\n$ (5,304,367 ) $ (474,759 ) $ 3,473,641\nThe accompanying notes are an integral part of these consolidated financial statements.\nDESTINY MEDIA TECHNOLOGIES, INC.\nConsolidated Statements of Cash Flows\nFor the years ended August 31,\nNotes\nOperating Activities\nNet income\n$ 335,098\n$ 149,074\nAdjustments to reconcile net income to net cash provided (used) in operations:\nDepreciation and amortization 3, 4\n238,355\n142,662\nStock-based compensation 6(b)\n147,932\n148,576\nAllowance for doubtful accounts\n3,129\n39,518\nGain on disposal of assets 3, 5\n-\n(11,018 )\nImpairment expense\n2,683\nUnrealized foreign exchange gain/(loss)\n(148 )\n29,517\nChanges in non-cash working capital:\nAccounts receivable\n120,729\n(178,935 )\nOther receivables\n(29,692 )\n22,589\nPrepaid expenses and deposits\n9,982\n19,373\nAccounts payable\n(99,329 )\n(26,843 )\nAccrued liabilities\n(34,861 )\n(33,747 )\nDeferred revenue\n14,439\n13,247\nOperating lease liability\n(9,498 )\nNet cash provided by operating activities\n705,634\n307,198\nInvesting Activities\nDevelopment of software\n(130,516 )\n(366,508 )\nPurchase of property, equipment, and intangibles 3, 4\n(585,508 )\n(326,338 )\nNet cash used in investing activities\n(716,024 )\n(692,846 )\nFinancing Activities\nCommon stock repurchased for cancellation 6(a)\n(21,135 )\n(179,401 )\nRepurchase of stock options for retirement\n-\n(11,275 )\nNet cash used in financing activities\n(21,135 )\n(190,676 )\nEffect of foreign exchange rate changes on cash and cash equivalents\n(61,634 )\n(80,410 )\nNet decrease in cash and cash equivalents\n(93,159 )\n(656,734 )\nCash and cash equivalents, beginning of year\n2,095,928\n2,752,662\nCash and cash equivalents, end of year\n$ 2,002,769\n$ 2,095,928\nSupplementary disclosure:\nInterest paid\n$ -\n$ -\nIncome taxes paid\n$ 2,576\n$ 4,348\nThe accompanying notes are an integral part of these consolidated financial statements.\nDESTINY MEDIA TECHNOLOGIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAUGUST 31, 2023\n1. ORGANIZATION AND BASIS OF PRESENTATION\nDestiny Media Technologies Inc. (the \"Company\") was incorporated in August 1998 under the laws of the State of Colorado and the corporate jurisdiction was changed to Nevada effective October 8, 2014. The Company develops technologies that allow for the distribution over the internet of digital media files in either a streaming or digital download format. The technologies are proprietary. The Company operates out of Vancouver, BC, Canada and serves customers predominantly located in the United States, Europe, and Australia.\nThe Company's stock is listed for trading under the symbol \"DSNY\" on the OTCQB U.S. in the United States, under the symbol \"DSY\" on the TSX Venture Exchange (the \"TSXV\") and under the symbol \"DME\" on the Berlin, Frankfurt, Xetra and Stuttgart exchanges in Germany.\nBasis of Presentation and Principles of Consolidation\nThe Company's consolidated financial statements are prepared in accordance with U.S. generally accepted accounting principles (\"GAAP\"). The accompanying consolidated financial statements include the consolidated accounts of the Company and its wholly owned subsidiaries: Destiny Software Productions, Inc. (\"DSNY\"), MPE Distributions, Inc. (\"MPE\"), Tonality, Inc. (\"Tonality\"), and Sonox Digital Inc. (\"Sonox\"). All intercompany transactions and balances have been eliminated on consolidation.\nUse of Estimates\nThe preparation of the consolidated financial statements in accordance with U.S. GAAP requires management to make use of certain estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities as of the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reported periods. The Company bases its estimates on historical experience and on various other assumptions that management believes are reasonable under the circumstances, the results of which form the basis for making judgments about carrying values of assets and liabilities that are not readily apparent from other sources. Actual results could differ from those estimates. Significant estimates are related to the labour capitalized to software under development and computer software, the recoverability of long-term assets including property and equipment, intangible assets, amortization expense, and valuation of stock-based compensation.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nCash and cash equivalents\nThe Company's cash include cash in readily available checking accounts. The Company's cash equivalents consist of investments in mutual funds with a major Canadian financial institution that earn interest at variable interest rates ranging from 4.55% - 4.90%.\nConcentrations of credit risk\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist primarily of cash and cash equivalents. The Company maintains deposits in federally insured financial institutions in excess of federally insured limits. The Company has not experienced any losses in such accounts and management believes that the Company is not exposed to significant credit risk due to the financial position of the depository institutions in which those deposits are held.\nAccounts receivable\nTrade receivables are amounts due from customers for services rendered in the ordinary course of business. Accounts receivable are non-interest bearing and are due for settlement in full within 30-60 days, depending on a contract. Trade receivables are shown net of allowance for bad or doubtful accounts.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES CONT'D\nAllowance for doubtful accounts\nThe Company establishes an allowance for doubtful accounts to ensure trade and other receivables are not overstated due to non-collectability. The Company's allowance is based on a variety of factors, including age of the receivable, significant one-time events, historical experience, and other risk considerations. The amount ultimately realized from trade accounts receivable may differ from the amount estimated in the consolidated financial statements based on collection experience. The Company had $41,331 and $39,518 in allowance at August 31, 2023 and 2022, respectively. The Company recorded $3,129 and $44,304 in bad debt for the years ended August 31, 2023 and 2022, respectively.\nProperty and equipment, net\nProperty and equipment are recorded at cost, less accumulated depreciation. Depreciation and amortization are recognized using the straight-line method over the estimated useful lives of the asset and is calculated using the following rates, commencing upon utilization of the assets:\nFurniture and fixtures\n20%\nComputer hardware\n30%\nComputer software\n50%\nExpenditures for repairs and maintenance of assets are charged to expense as incurred. Upon retirement or sale, the cost and related accumulated depreciation of assets disposed of are removed from the accounts and any resulting gain or loss is included in net income (loss).\nIntangible assets, net\nOur software solutions are offered to our customers through software as a service delivery models. Development costs associated with the certain solutions offered exclusively through a software as a service model are accounted for in accordance with ASC 350-40 Internal-Use Software.\nUnder ASC 350-40, software development costs related to preliminary project activities and post-implementation and maintenance activities are expensed as incurred. We capitalize direct costs related to application development activities that are probable to result in additional functionality.\nCapitalization is limited to costs that are directly attributable to the specific software application and incurred during the application development stage. These costs may include but are not limited to:\nDirect costs of materials and services consumed in developing or obtaining internal-use software.\nCosts of employees directly associated with the development project, including employee compensation and benefits.\nCosts of third-party services utilized in the development process.\nCosts associated with maintenance, training, and general and administrative activities are expensed as incurred.\nThe Company assesses the probability of completing the software development and the intended use of the software application to determine the eligibility of costs for capitalization. Once a project reaches the stage where it is probable that the software will provide additional functionality, capitalization begins, and costs are capitalized until the project is substantially complete and ready for its intended use. The capitalized costs are amortized on a straight-line basis over the estimated useful life of the software, typically not exceeding two years.\nPatents, trademarks and lists are stated at cost. Depreciation and amortization of patents, trademarks and lists are taken over the estimated useful lives of the assets and is calculated using the straight-line method over 3 years, commencing upon utilization of the assets.\nImpairment of long-lived assets\nThe Company reviews long-lived assets, including property and equipment and intangible assets, for impairment whenever events or changes in business circumstances indicate that the carrying amount of the assets may not be fully recoverable. Intangible assets that are not subject to amortization are tested for impairment annually and more frequently if events or changes in circumstances indicate that it is more likely than not that the asset is impaired. An impairment loss would be recognized when estimated undiscounted future cash flows expected to result from the use of the asset and its eventual disposition are less than the carrying amount. The impairment loss, if recognized, would be based on the excess of the carrying value of the impaired asset over its respective fair value. No impairment losses have been recorded for the years ended August 31, 2023 and 2022.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES CONT'D\nLeases\nAt the inception of a contractual arrangement, the Company determines whether the contract contains a lease by assessing whether there is an identified asset and whether the contract conveys the right to control the use of the identified asset in exchange for consideration over a period of time. If both criteria are met, the Company records the associated lease liability and corresponding right-of-use asset upon commencement of the lease using the implicit rate or a discount rate based on a credit-adjusted secured borrowing rate commensurate with the term of the lease. The Company additionally evaluates leases at their inception to determine if they are to be accounted for as an operating lease or a finance lease. A lease is accounted for as a finance lease if it meets one of the following five criteria: the lease has a purchase option that is reasonably certain of being exercised, the present value of the future cash flows is substantially all of the fair market value of the underlying asset, the lease term is for a significant portion of the remaining economic life of the underlying asset, the title to the underlying asset transfers at the end of the lease term, or if the underlying asset is of such a specialized nature that it is expected to have no alternative uses to the lessor at the end of the term. Leases that do not meet the finance lease criteria are accounted for as an operating lease. Operating lease assets represent a right to use an underlying asset for the lease term and operating lease liabilities represent an obligation to make lease payments arising from the lease. Operating lease liabilities with a term greater than one year and their corresponding right-of-use assets are recognized on the balance sheet at the commencement date of the lease based on the present value of lease payments over the expected lease term. Certain adjustments to the right-of-use asset may be required for items such as initial direct costs paid or incentives received. As the Company's leases do not typically provide an implicit rate, the Company utilizes the appropriate incremental borrowing rate, determined as the rate of interest that the Company would have to pay to borrow on a collateralized basis over a similar term and in a similar economic environment. Lease cost is recognized on a straight-line basis over the lease term and variable lease payments are recognized as operating expenses in the period in which the obligation for those payments is incurred. Variable lease payments primarily include common area maintenance, utilities, real estate taxes, insurance, and other operating costs that are passed on from the lessor in proportion to the space leased by the Company. The Company has elected the practical expedient to not separate between lease and non-lease components.\nRevenue recognition\nThe Company's revenue is derived from software as a service (SaaS) arrangement. The Company accounts for revenue in accordance with ASC 606, Revenue from Contracts with Customers.\nThe core principle of ASC 606 is to recognize revenue upon the transfer of products or services to customers in an amount that reflects the consideration the Company expects to be entitled to in exchange for those products or services. ASC 606 prescribes a five-step model for recognizing revenue from contracts with customers: (1) identify the contract(s) with customers; (2) identify the separate performance obligations in the contract; (3) determine the transaction price; (4) allocate the transaction price to the separate performance obligations in the contract; and (5) recognize revenue when (or as) the performance obligations are satisfied.\nThe Company applies the five-step model to recognize revenue as follows:\n(1) Identification of the contract, or contracts, with the customer\nThe Company considers the terms and conditions of written contracts and its customary business practices in identifying its contracts under ASC 606. The Company determines that it has a contract with a customer when the contract is executed, the Company can identify each party's rights regarding the services to be transferred, the Company can identify the payment terms for the services, the Company has determined that the customer has the ability and intent to pay, and the contract has commercial substance. In general, contract terms will be reflected in a written document that is signed by both parties.\n(2) Identification of the performance obligation in the contract\nPerformance obligations are promises in a contract to transfer distinct products or services to a customer and is the unit of account under ASC 606. A contract's transaction price is allocated to each distinct performance obligation and revenue is recognized when the performance obligation is satisfied. A product or service is a distinct performance obligation if the customer can both benefit from the product or service either on its own or together with other resources that are readily available to the customer, and it is separately identifiable from other items within the context of the contract. Performance obligations are satisfied by transferring control of the product or service to the customer. Control of the product or service is transferred either at a point in time or over time depending on the performance obligation.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES CONT'D\nTo the extent a contract includes multiple promised services or products, the Company applies judgment to determine whether promised services or products are capable of being distinct and distinct in the context of the contract. If these criteria are not met, the promised services are accounted for as a combined performance obligation.\nThe Company generates revenue primarily from usage fees for the Company's digital media distribution service. Usage fees are generally recognized as they are billed based on volume and size of distribution services provided in a given month. The Company's other performance obligations include maintenance services, email and phone support, and unspecified software updates released when, and if, available. Under the guidance of ASC 606, the Company has concluded that maintenance services and unspecified software upgrades are not distinct in the context of the Company's contracts because the Company's service is considered a multi-tenant software environment, and these activities represent a single combined performance obligation in connection with the Company's digital media distribution service, recognized at a point in time when the service is delivered to the customer.\nSupport activities are considered a separate performance obligation which is satisfied over time; however, such activities are performed substantially concurrently with the satisfaction of digital media distribution services. From time to time, certain of the Company's contracts contain additional separate performance obligations, including specific enhancements and upgrades.\n(3) Determination of the transaction price\nThe transaction price is determined based on the consideration to which the Company expects to be entitled in exchange for providing services to the customer.\nDigital media distribution services may be subject to either fixed or variable pricing. Variable consideration is allocated entirely to distinct service periods when it can be tied to a single performance obligation. Variable consideration is estimated and included in the transaction price if, in the Company's judgment, it is probable that there will not be a significant future reversal of cumulative revenue under the contract. When variable consideration is contingent and cannot be tied to a single performance obligation performed in a particular billing period, the Company estimates contingent variable consideration using the most likely method and recognizes consideration to the extent that the estimate for variable consideration is not constrained pursuant to the guidance provided in ASU 606.\nA significant financing component generally does not exist under the Company's standard contracting and billing practices.\n(4) Allocation of the transaction price to the performance obligations in the contract\nIf the contract contains a single combined performance obligation, the entire transaction price is allocated to the single combined performance obligation. Contracts that contain multiple performance obligations require an allocation of the transaction price to each performance obligation based on its standalone selling price (\"SSP\") in relation to the total fair value of all performance obligations in the arrangement. The majority of the Company's contracts contain two separate performance obligations that are performed concurrently. The Company allocates consideration to each performance obligation under the guidance of ASC 606 on a relative standalone selling price basis. Where SSP is not directly observable, the Company determines the SSP using information that may include market conditions and other observable inputs.\nConsideration associated with support activities, specified enhancements and upgrades are estimated using a cost-plus reasonable margin approach, as there is no observable SSP.\n(5) Recognition of revenue when, or as, the Company satisfies a performance obligation\nThe Company recognizes revenue when the services are delivered to its customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those services. The Company is principally responsible for the satisfaction of its distinct performance obligations, which are satisfied either at a point in time or over a period of time.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES CONT'D\nPerformance obligations satisfied at a point in time\nMedia distribution services comprise the majority of distinct performance obligations that are satisfied at a point in time, and revenue is recognized at the point in which the distribution service has been completed. Consideration for these services is typically billed in the same period that the service has been delivered to the customer.\nPerformance obligations satisfied over a period of time\nCustomer support activities comprise the majority of distinct performance obligations that are satisfied over a period of time. Revenue from support activities is recognized over an estimated support period since this activity is considered a 'stand-ready obligation'. This support period is substantially concurrent with the performance of media distribution services, as these services are performed substantially in conjunction with the related distribution. Any support activities provided outside of this billing period are not considered material. Revenue from specified enhancements and upgrades is recognized over an estimated performance period.\nContract Costs\nContract costs consists of two components, customer acquisition costs and costs to fulfill a contract. Customer acquisition costs are capitalized only if the costs are incrementally incurred to obtain a customer contract and may consist of sales commissions paid to sales personnel or third-party resellers. Generally, the Company does not incur any contract costs outside of the period that the related revenue is recognized.\nContract Modifications\nContract modifications may create new, or change existing, enforceable rights and obligations of the parties to the contract. We generally modify an existing contract using an addendum or signed change order. A contract modification is accounted for as a new contract if it reflects an increase in scope that is regarded as distinct from the original contract and is priced in-line with the standalone selling price for the related product or services obligated. If a contract modification is not considered a new contract, the modification is combined with the original contract and the impact on the revenue recognition profile depends on whether the remaining products and services are distinct from the original contract. If the remaining goods or services are distinct from those in the original contract, all remaining performance obligations will be accounted for on a prospective basis with unrecognized consideration allocated to the remaining performance obligations. If the remaining goods or services are not distinct, the modification will be treated as if it were a part of the existing contract, and the effect that the contract modification has on the transaction price, and on our measure of progress toward satisfaction of the performance obligations, is recognized as an adjustment to revenue (either as an increase in or a reduction of revenue) at the date of the contract modification on a cumulative catch-up basis.\nCost of revenue\nCost of revenue primarily consists of personnel costs for our operations service and technical support employees and engineering support staff, cloud infrastructure costs, incremental transaction costs such as merchant and processing fees, and costs of external customer support software and services. In each case, personnel costs include salaries, benefits and any other compensation paid to such staff.\nTranslation of foreign currencies\nThe Company's functional currency is the U.S. dollar. Financial statements of foreign operations for which the functional currency is the local currency are translated into U.S. dollars with assets and liabilities translated at the rate of exchange in effect at the balance sheet date and revenue and expense items translated at the average rates for the period. Unrealized gains and losses resulting from the translation of the financial statements into the reporting currency are deferred and accumulated in a separate component of stockholders' equity as a foreign currency translation gain (loss) in accumulated other comprehensive income (loss).\nTransactions denominated in foreign currencies are translated into the reporting currency at the exchange rate in effect on the transaction date. These foreign currency gains and losses are included as a component of general and administrative expenses in the consolidated statements of comprehensive income.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES CONT'D\nThe Company operates internationally, which gives rise to the risk that cash flows may be adversely impacted by exchange rate fluctuations. The Company has not entered into contracts for foreign exchange hedges.\nIncome taxes\nThe Company utilizes the liability method of accounting for income taxes as set forth in ASC 740, Income Taxes. Under the liability method, deferred taxes are determined based on the temporary differences between the financial statement and tax basis of assets and liabilities using tax rates expected to be in effect during the years in which the basis that give rise to the differences reverse. A valuation allowance is recorded when it is more likely than not that some of the deferred tax assets will not be realized. In determining the need for valuation allowances, we consider projected future taxable income and the availability of tax planning strategies. If in the future we determine that we would not be able to realize our recorded deferred tax assets, an increase in the valuation allowance would be recorded, decreasing earnings in the period in which such determination is made.\nWe assess our income tax positions and record tax benefits for all years subject to examination based upon our evaluation of the facts, circumstances, and information available at the reporting date. For those tax positions where there is a greater than 50% likelihood that a tax benefit will be sustained, we have recorded the largest amount of tax benefit that may potentially be realized upon ultimate settlement with a taxing authority that has full knowledge of all relevant information. For those income tax positions where there is 50% or less likelihood that a tax benefit will be sustained, no tax benefit has been recognized in the consolidated financial statements.\nThe Company has concluded that there are no significant uncertain tax positions requiring recognition in the Company's consolidated financial statements. The Company's evaluation was performed for the tax years which remain subject to examination by major tax jurisdictions. The Company may from time to time be assessed interest or penalties by major tax jurisdictions, although any such assessments historically have been minimal and immaterial to the Company's financial results. In the event the Company has received an assessment for interest and/or penalties, it has been classified in the consolidated financial statements as general and administrative expense.\nStock-based compensation\nStock-based compensation expense for employees and directors is recognized in the consolidated statements of comprehensive income based on estimated amounts, including the grant date fair value and the expected service period. For stock options, we estimate the grant date fair value using a Black-Scholes valuation model, which requires the use of multiple subjective inputs including estimated future volatility, expected forfeitures and the expected term of the awards. We estimate the expected future volatility based on the Company's historical price volatility. The stock's future volatility may differ from the estimated volatility at the grant date. Our estimate of the forfeiture rate is based primarily on our historical experience. The estimated forfeiture rates may differ from actual forfeiture rates which would affect the amount of expense recognized during the period. When awards are forfeited because non-market based vesting conditions are not satisfied, the expense previously recognized is proportionately reversed. We recognize the value of the awards over the awards' requisite service or performance periods. The requisite service period is generally the time over which our stock-based awards vest.\nSegment reporting\nOperating segments are identified as components of an enterprise about which separate discrete financial information is available for evaluation by the chief operating decision maker in making decisions on how to allocate resources and assess performance. The Company views its operations and manages its business as one operating segment.\nComprehensive income (loss)\nComprehensive income (loss) includes all changes in equity except those resulting from investments by owners and distributions to owners. Accumulated other comprehensive income (deficit) consists only of accumulated foreign currency translation adjustments for all years presented.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES CONT'D\nEarnings per share\nNet income per common share (basic) is calculated by dividing net income by the weighted average number of common shares outstanding during the period. Net income per common share (diluted) is calculated by dividing net income for the period by the weighted average number of common shares outstanding during the period, plus the dilutive effect of outstanding common share equivalents. This method requires that the dilutive effect of outstanding options and warrants issued be calculated using the treasury stock method. Under the treasury stock method, all common share equivalents have been exercised at the beginning of the period (or at the time of issuance, if later), and that the funds obtained thereby were used to purchase common shares of the Company at the average trading price of common shares during the period, but only if dilutive.\nFair value measurements\nThe Company uses the fair value hierarchy to measure the value of its financial instruments. The fair value hierarchy is based on inputs to valuation techniques that are used to measure fair value that are either observable or unobservable. Observable inputs reflect assumptions market participants would use in pricing an asset or liability based on market data obtained from independent sources, while unobservable inputs reflect a reporting entity's pricing based upon its own market assumptions. The basis for fair value measurements for each level within the hierarchy is described below:\nLevel 1 - Quoted prices for identical assets or liabilities in active markets.\nLevel 2 - Quoted prices for identical or similar assets and liabilities in markets that are not active; or other model-derived valuations whose inputs are directly or indirectly observable or whose significant value drivers are observable.\nLevel 3 - Valuations derived from valuation techniques in which one or more significant inputs to the valuation model are unobservable and for which assumptions are used based on management estimates.\nThe Company utilizes valuation techniques that maximize the use of observable inputs and minimize the use of unobservable inputs to the extent possible as well as considers counterparty credit risk in its assessment of fair value.\nThe book value of cash and cash equivalents, accounts receivable, other receivables, deposits, accounts payable and accrued liabilities, and deferred revenue liabilities approximate their fair values due to the short-term maturity of those instruments.\nRecently Issued Accounting Pronouncements\nThe Company assesses the adoption impacts of recently issued accounting standards by FASB or other standard setting bodies on the Company's consolidated financial statements as well as material updates to previous assessments. There were no new material accounting standards issued in years of 2022 and 2023 that impacted the Company.\n3. PROPERTY AND EQUIPMENT, NET\nAugust 31, 2023\nProperty and Equipment\nCost\nAccumulated\nAmortization\nNet Book Value\nFurniture and fixtures $ 131,892\n$ (120,990 ) $ 10,902\nComputer hardware\n316,619\n(269,733 )\n46,886\nComputer software\n811,374\n(226,955 )\n584,419\nTotal property and equipment $ 1,259,885\n$ (617,678 ) $ 642,207\nAugust 31, 2022\nProperty and Equipment\nCost\nAccumulated\nAmortization\nNet Book Value\nFurniture and fixtures $ 136,369\n$ (122,279 ) $ 14,090\nComputer hardware\n320,260\n(259,339 )\n60,921\nComputer software\n673,691\n(436,910 )\n236,781\nTotal property and equipment $ 1,130,320\n$ (818,528 ) $ 311,792\nDuring the year ended August 31, 2023, the Company capitalized a total of $559,044 in salaries and wages related to computer software development (2022 - $269,777). During the year ended August 31, 2023, $399,935 in Computer Software cost was fully depreciated and subsequently eliminated from the continuity schedule presented above.\nDepreciation on property and equipment for the year ended August 31, 2023 was $227,488 (2022 - $128,968).\nOn January 31, 2022, the Company terminated the lease for the office space (Note 5). Accordingly, leasehold fixtures and fittings were disposed of and a loss of $9,035 was recognized in the consolidated statement of comprehensive income for the year ended August 31, 2022.\n4. INTANGIBLE ASSETS, NET\nAugust 31, 2023\nIntangible Assets\nCost\nAccumulated\nAmortization\nNet Book Value\nSoftware under development $ 624,539\n$ -\n$ 624,539\nPatents, trademarks, and lists\n467,852\n(446,917 )\n20,935\nTotal intangible assets $ 1,092,391\n$ (446,917 ) $ 645,474\nAugust 31, 2022\nIntangible Assets\nCost\nAccumulated\nAmortization\nNet Book Value\nSoftware under development $ 516,397\n$ -\n$ 516,397\nPatents, trademarks, and lists\n464,285\n(450,965 )\n13,320\nTotal intangible assets $ 980,682\n$ (450,965 ) $ 529,717\nDuring the year ended August 31, 2023, the Company capitalized a total of $682,617 in salaries and wages related to software under development (2022 - $626,778), out of this amount, $559,044 (2022 - $269,777) was subsequently reclassified to Computer software assets as the projects were completed (Note 3).\nAmortization on intangible assets for the year ended August 31, 2023 was $10,867 (2022 - $13,694).\n5. RIGHT-OF-USE ASSET AND LEASE LIABILITY\nIn 2017, the Company entered into a lease agreement commencing July 1, 2017 and expiring June 30, 2022 consisting of approximately 6,600 square feet of office space. The Company terminated the lease agreement on January 31, 2022.\nOn adoption of ASC 842, Lease Accounting, the Company recognized right-of-use assets and a corresponding increase in lease liabilities, in the amount of $671,911 which represented the present value of future lease payments using a discount rate of 8% per year. Property tax and insurance payments paid to the lessor were included in the calculation of future lease payments.\nRight-of-Use Assets\nBalance, August 31, 2021 $ 190,253\nDepreciation\n(95,010 )\nTermination\n(94,210 )\nForeign currency translation adjustment\n(1,033 )\nBalance, August 31, 2023 and 2022 $ -\nOperating Lease Liabilities\nBalance, August 31, 2021 $ 226,978\nLease interest expense\n6,036\nPayments\n(117,548 )\nTermination\n(114,263 )\nForeign currency translation adjustment\n(1,203 )\nBalance, August 31, 2023 and 2022 $ -\nDuring the year ended August 31, 2023 the Company recorded depreciation expense of $nil (2022 - $95,010) which has been allocated between general and administrative, sales and marketing, and product development expenses on the consolidated statements of comprehensive income. The total rent commitment, net of the leasehold improvement allowance, was amortized to rent expense on a straight-line basis over the term of the lease. On January 31, 2022, upon exit of the lease a gain of $20,053 was recognized in the consolidated statements of comprehensive income.\nAs of August 31, 2023 and 2022, the Company had no outstanding commitments related to the operating lease payments.\n6. STOCKHOLDERS' EQUITY\n[a] Common stock issued and authorized\nThe Company is authorized to issue up to 20,000,000 shares of common stock, par value $0.001 per share.\nDuring the year ended August 31, 2023, the Company did not issue any common stock (2022 - Nil). During the year ended August 31, 2023, the Company repurchased and cancelled 25,651 common shares for $21,135 (2022 - 143,100 common shares for $179,401).\n[b] Stock option plans\nPursuant to the Company's 2015 Stock Option Plan (the \"2015 Plan\"), 530,000 shares of common stock have been reserved for issuance. A total of 420,000 common shares remain eligible for issuance under the 2015 Plan. On February 18, 2022 the Company received shareholder approval for the 2022 Stock Option Plan (the \"2022 Plan\") (together with the 2015 Plan, the \"Plans\"), whereby 1,000,000 common shares are reserved for issuance. As of August 31, 2023, 361,000 common shares remain eligible for issuance under the 2022 Plan.\nThe options generally vest over a range of periods from the date of grant, some are immediate, and others vest over 24 months. Any options that do not vest as the result of a grantee leaving the Company are forfeited and the underlying common shares are returned to the reserve. The options generally have a contractual term of five years.\n6. STOCKHOLDERS' EQUITY CONT'D\nStock-Based Payment Award Activity\nDuring the year ended August 31, 2023, the Company granted 228,000 (2022 - 561,000) share purchase options to directors, officers, employees, and consultants of the Company. The weighted-average assumptions used to estimate the fair value of stock options using the Black-Scholes option valuation model were as follows:\nRisk-free interest rate\n5.00%\n1.20%\nVolatility\n84.89%\n72.34%\nExercise price $ 0.85\n$ 1.50\nDividend yield\n0%\n0%\nForfeiture rate\n0%\n0%\nExpected life (years)\n2.13\n3.50\nThe summary of option activity for the years ended August 31, 2023 and 2022 were as follows:\nNumber of Options\nWeighted Average\nExercise Price\nWeighted Average\nContractual Term\n(Years)\nOutstanding at August 31, 2021\n410,000\n$ 1.34\n2.26\nGranted\n561,000\n$ 1.50\n5.00\nForfeited\n(91,583 ) $ 1.38\n3.85\nRepurchased\n(82,500 ) $ 1.00\n2.25\nExpired\n(203,917 ) $ 1.46\n0.50\nOutstanding at August 31, 2022\n593,000\n$ 1.49\n3.79\nGranted\n228,000\n$ 0.85\n5.00\nForfeited\n(72,000 ) $ 1.41\n3.41\nOutstanding at August 31, 2023\n749,000\n$ 1.30\n3.37\nExercisable at August 31, 2023\n480,017\n$ 1.47\n2.76\nThe aggregate intrinsic value is calculated as the difference between the exercise price of the underlying awards and the quoted price of the Company's common stock for the options that were in-the-money as of August 31, 2023. In all cases, the aggregate intrinsic value was $nil. There were no stock options repurchased during the year ended August 31, 2023. During the year ended August 31, 2022, the Company repurchased 82,500 stock options for $11,275.\nThe following table summarizes information regarding the non-vested options outstanding as of August 31, 2023 and changes during the period:\nNumber of Options\nWeighted Average Exercise\nPrice\nNon-vested options at August 31, 2021\n98,750\n$ 0.48\nGranted\n561,000\n$ 1.50\nForfeited\n(91,583 ) $ 1.38\nVested\n(239,958 ) $ 1.44\nExpired\n(7,667 ) $ 1.50\nNon-vested options at August 31, 2022\n320,542\n$ 1.50\nGranted\n228,000\n$ 0.85\nForfeited\n(41,791 ) $ 1.36\nVested\n(237,768 ) $ 1.46\nNon-vested options at August 31, 2023\n268,983\n$ 1.01\nAs of August 31, 2023, there was $107,208 (2022 - $179,620) of total unrecognized compensation cost related to non-vested stock-based compensation awards. The unrecognized compensation cost is expected to be recognized over a weighted average period of 0.92 years (2022 - 1.25 years).\n6. STOCKHOLDERS' EQUITY CONT'D\nDuring the years ended August 31, 2023 and 2022, the total stock-based compensation expense was reported in the consolidated statement of comprehensive income as follows:\nStock-based compensation\nGeneral and administrative $ 75,997\n$ 74,868\nSales and marketing\n20,790\n33,015\nProduct development\n51,145\n40,693\nTotal stock-based compensation $ 147,932\n$ 148,576\n[c] Employee Stock Purchase Plan\nThe Company's 2011 Employee Stock Purchase Plan (the \"ESPP\") became effective on February 22, 2011. Under the ESPP, employees of the Company can contribute up to 5% of their annual salary into a pool which is matched equally by the Company in order to purchase the Company's common shares under certain terms. Directors can contribute a maximum of $12,500 each for a combined maximum annual purchase of $25,000. The maximum annual combined contributions will be $400,000. All purchases are made through the TSXV by a third-party plan agent. The third-party plan agent is also responsible for the administration of the ESPP on behalf of the Company and the participants.\nDuring the year ended August 31, 2023, the Company recognized compensation expense of $111,800 (2022 - $109,637) in salaries and wages on the consolidated statement of comprehensive income in respect of the ESPP, representing the Company's employee matching of cash contributions to the ESPP. The shares were purchased on the open market at an average price of $0.69 (2022 - $1.24). The shares are held in trust by the Company for a period of one year from the date of purchase. As of August 31, 2023, 237,184 shares were held in trust by the Company.\n7. INCOME TAXES\nThe Company is subject to United States federal and state income taxes at an approximate rate of 21.0% and to Canadian federal and British Columbia provincial taxes in Canada at an approximate rate of 27.0%. The reconciliation of the provision for income taxes at the United States federal statutory rate compared to the Company's income tax expense is as follows:\nTax at U.S. statutory rates $ 70,000\n$ 32,000\nPermanent differences\n33,000\n33,000\nEffect of higher foreign tax rates in Canada\n59,000\n50,000\nForeign exchange and other adjustments\n128,000\n190,000\nChange in valuation allowance\n(290,000 )\n(305,000 )\nProvision for income taxes $ -\n$ -\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. The Company has recognized a valuation allowance for those deferred tax assets for which realization is not likely to occur.\nSignificant components of the Company's deferred tax assets as of August 31 are as follows:\nDeferred tax assets\nNet operating loss carryforwards $ 851,000\n$ 745,000\nExcess of book over tax depreciation\n365,000\n740,000\nTax credit carryforwards\n615,000\n636,000\nTotal deferred tax assets\n1,831,000\n2,121,000\nValuation allowance\n(1,831,000 )\n(2,121,000 )\nNet deferred tax assets $ -\n$ -\nNet income (loss) before income tax by geographic region is as follows:\nUnited States $ (653,991 ) $ (684,775 )\nCanada\n991,665\n838,197\nTotal $ 337,674\n$ 153,422\nIf not utilized to reduce future taxable income, the Company's net operating loss carryforwards will expire as follows:\n2023 and thereafter\nUnited States $ 4,055,000\nCanada\n-\nTotal $ 4,055,000\nIf not utilized to reduce future taxes payable, the Company's investment tax credit carryforwards will expire as follows:\n2031 and thereafter\nUnited States $ -\nCanada\n764,000\nTotal $ 764,000\n8. COMMITMENTS AND CONTINGENCIES\nThe Company is subject to claims and legal proceedings that arise in the ordinary course of business. Such matters are inherently uncertain, and there can be no guarantee that the outcome of any such matter will be decided favorably to the Company or that the resolution of any such matter will not have a material adverse effect upon the Company's financial statements. The Company does not believe that any of such pending claims and legal proceedings will have a material adverse effect on its consolidated financial statements.\nOn September 5, 2017, the Company's former President and Chief Executive Officer filed a Notice of Civil Claim in the Supreme Court of British Columbia against the Company, its subsidiaries, independent directors, and current Chief Executive Officer, claiming damages for conspiracy, breach of contract, wrongful dismissal, defamation and aggravated and punitive damages. The Company believes the claims are without merit and is defending itself against the claims. The quantum of loss, if any, is not determinable at this time and management believes it is unlikely that the outcome of this matter will have an adverse impact on its results of operations, cash flows and financial condition.\n9. CONCENTRATIONS, ECONOMIC DEPENDENCE AND SEGMENTS\nThe Company operates solely in the digital media software segment and all revenue from its products and services are made in this segment.\nRevenue from external customers earned during the years ended August 31, 2023 and 2022, by product and location of customer, was as follows:\nPlay MPE®\nNorth America $ 1,990,075\n$ 1,957,722\nEurope\n1,837,517\n1,851,291\nAustralasia\n179,960\n185,941\nAfrica\n26,832\n26,516\nTotal Play MPE®\n4,034,384\n4,021,470\nClipstream®\nNorth America\n-\n2,440\nTotal $ 4,034,384\n$ 4,023,910\nRevenue presented above is based on location of the customer's billing address. Some of these customers have distribution centers located around the globe and distribute around the world. During the year ended August 31, 2023, the Company generated 41.9% of total revenue from one customer (2022 - 41.3%).\nAs at August 31, 2023, one customer represented $143,689 (or 36%) of the trade receivables balance (2022, one customer represented $283,144 (or 59%)). Subsequent to the year ended August 31, 2023 this customer paid the outstanding balance in full.\nThe Company has substantially all its assets in Canada and its current and planned future operations are, and will be, located in Canada. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nDisclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to provide reasonable assurance that material information required to be disclosed in our periodic reports filed under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SEC's rules and forms and to provide reasonable assurance that such information is accumulated and communicated to our management, our Chief Executive Officer and our Chief Financial Officer, to allow timely decisions regarding required disclosure.\nWe carried out an evaluation, under the supervision and with the participation of our management, including our principal executive and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rule 13(a)-15(e) under the Exchange Act. Based on this evaluation, our principal executive officer and principal financial officer concluded that our disclosure controls and procedures were effective, as of August 31, 2023.\nInternal Controls Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting, as defined in Rule 13a-15(f) and 15d-15(f) of the Exchange Act, is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with U.S. generally accepted accounting principles. Internal control over financial reporting includes policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company, (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the Company are transacted in accordance with authorizations of management and directors of the Company, and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with existing policies or procedures may deteriorate. A material weakness is defined as \"a deficiency, or a combination of deficiencies in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Company's annual or interim financial statements will not be prevented or detected on a timely basis.\nOur management, under the supervision of our Chief Executive Officer and Chief Financial Officer, conducted an assessment of the effectiveness of our internal control over financial reporting as of August 31, 2023 based on the criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\"). Based on this assessment, management concluded that our internal controls over financial reporting were effective as of August 31, 2023.\nThis annual report does not include an attestation report of the Company's independent registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by the Company's independent registered public accounting firm pursuant to the rules of the SEC that permit the Company to provide only management's report in this annual report.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting identified in management's evaluation pursuant to Rules 13a-15(d) or 15d-15(d) of the Exchange Act during the quarter ended August 31, 2023 that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION.\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nAll directors hold office for a term of approximately one year, or until the next annual meeting of shareholders, until the election and qualification of their successors. Officers are appointed by our board of directors and serve at the discretion of the board, subject to applicable employment agreements. The following table sets forth information regarding our executive officers and the members of our board of directors.\nName Position Held with the Company Date First Elected or Appointed\nFrederick Vandenberg Director, President, Corporate Secretary, Chief Executive Officer CEO since June 2017\nCFO since July 2007\nHyonmyong Cho(1) Chairman of the Board, Director February 2017\nSamuel Jay Graber(1) Director February 2017\nDave Summers(1) Director February 2019\nDavid Mossberg Director November 2021\nOlya Massalitina Chief Financial Officer and Treasurer April 2022\n(1) Member of our Audit Committee\nSet forth below is a brief description of the background and business experience of each of our executive officers and directors for the past five years:\nFred Vandenberg, B. Comm. MBA, CPA, CA - Mr. Vandenberg has been our Chief Executive Officer since June 2017 and was our Chief Financial Officer from July 2007 to December 2017. Mr. Vandenberg's core responsibilities include strategic planning and coordinating strategic planning, marketing and product development functions of the Company. Mr. Vandenberg has been with the Company for 19 years, heading up the finance group and managing the majority of Play MPE® operations, including the initial transition of our customers to commercial agreements in 2008. Mr. Vandenberg oversees the business development and operational functions of Play MPE®, expanding into new markets while ensuring we continue to lead the industry in customer service. Mr. Vandenberg obtained a Bachelor of Commerce from McMaster University in 1991 and a Master of Business Administration (Finance) from McMaster University in 1993. In 1996, Mr. Vandenberg was designated as a Chartered Professional Accountant in Ontario and completed the CICA In-depth Tax program.\nHyonmyong Cho - Mr. Cho has been a director of the Company since February 2017. Hyonmyong Cho is currently a managing member of Greenlaw International Management Company LLC which manages Greenlaw International LP, a fund which invests in microcap stocks. From 2002 to 2008, Mr. Cho was a Managing Director of Forum Partners which managed several real estate private equity funds in Europe and Asia. At Forum Partners, Mr. Cho managed a worldwide team tasked with private equity deal structuring, analysis and negotiation. Prior to Forum Partners, Mr. Cho was a senior associate at Nassau Capital, whose only limited partner was Princeton University, and he was responsible for the due diligence, negotiation, documentation and monitoring of private equity transactions. Prior to that, Mr. Cho was a partner in Novalis Ventures, a venture capital fund focused on early-stage investments in the real estate industry. Before that, Mr. Cho was a Vice President at Cahill, Warnock & Company, a private equity firm focused on making direct investments in micro-cap public companies. Mr. Cho began his career as a financial analyst for Alex Brown & Sons, Inc. in the mergers and acquisitions, real estate and health care groups. Mr. Cho was a Morehead Scholar at the University of North Carolina, graduating with a B.A. in English Literature.\nSamuel Jay Graber - Mr. Graber has been a director of the Company since February 2017. In 2016, Mr. Graber retired as VP of Business Development from Apex Software, LLC, but remained a business partner in the company. Apex Software LLC was a privately-owned developer of building drawing and area calculation software for jurisdictional mass appraisal at the municipal, county, province and statewide level as well as for the real estate mortgage appraisal industry. In 2020, the assets of Apex Software, LLC were sold to a long-term business partner with an approximate 1-year wind down of Mr. Graber's continued involvement. Prior to 20 years in the software/technology arena, Mr. Graber worked in direct sales/sales management for various manufacturing entities including automotive and decorative lighting, plastic extrusion, art glass and architectural flooring. Mr. Graber earned a BS degree in both Business Management and in Psychology from Eastern Mennonite College (now EMU).\nDr. David Summers Ph.D., BSc., MBA - Since 2016, Dr. Summers has been a business development and technology commercialization consultant. From 2008 through 2016, Dr. Summers was a director for Chemetics Inc., a global leader in technology-based engineering design for the pulp & paper, and mining & minerals industries. Dr. Summers was responsible for technology development, the electrolyzer business group, and global technical customer service. From 2007 to 2008 Dr. Summers was Vice President, Business Operations for Carbon Credit Corp, a private technology and consulting company. In this role, Dr. Summers helped position the company for acquisition by Ledcor Group. From 1998 to 2007 Dr. Summers worked at Ballard Power Systems, where he spent ten years in progressively senior leadership positions in Research and Development, Product Development and Business Development. He is the author of 12 publications and 5 patents. Dr. Summers holds a Bachelor of Science degree (honours chemistry) from Queen's University, a Ph.D. in Chemistry from the University of British Columbia, and a dual Master of Business Administration degree from Queen's University and Cornell University's Johnson School.\nDavid Mossberg - Mr. Mossberg was appointed a director in November 2021. Mr. Mossberg is a seasoned capital markets executive with more than 25 years of experience analyzing companies and advising public company executives in multiple industries. Mr. Mossberg currently is the CEO of Three Part Advisors, LLC, a strategic investor relations advisory firm. Prior to founding Three Part Advisors, Mr. Mossberg was a sell-side analyst at Southwest Securities and was Director of Research at Hodges Capital Management. Mr. Mossberg holds a MBA from Southern Methodist University and BBA in Finance and BBA in International Business from University of Texas - Arlington. Mr. Mossberg also served in the United States Army Reserves as an interrogator/Russian linguist.\nOlya Massalitina BSc., CPA - Mrs. Massalitina was appointed our Chief Financial Officer in April of 2022, replacing the Company's former CFO - Samuel Ritchie. Mrs. Massalitina is a Chartered Professional Accountant with over 10 years of experience working with a variety of publicly traded multinational companies in different industries. During that time, she has provided foundational financial services to clients including auditing, financial reporting, budgeting and forecasting, controls and processes, and more. Through her experience dealing with large international companies Mrs. Massalitina acquired considerable experience in finance, governance, and regulatory compliance. Mrs. Massalitina holds a Bachelor of Science, Mathematics degree from a well-recognized Ukrainian University and a Diploma in Accounting from British Columbia Institute of Technology.\nCORPORATE GOVERNANCE\nThe Company promotes accountability for adherence to honest and ethical conduct; endeavors to provide full, fair, accurate, timely and understandable disclosure in reports and documents that the Company files with the SEC and in other public communications made by the Company; and strives to be compliant with applicable governmental laws, rules and regulations.\nELECTION OF DIRECTORS AND OFFICERS\nOur Board has the responsibility for selecting the appropriate leadership structure for the Company. In making leadership structure determinations, the Board considers many factors, including the specific needs of the business and what is in the best interests of the Company's stockholders. Currently, Mr. Hyonmyong Cho serves as Chairman of the Board. The Board believes that its programs for overseeing risk, as described below, would be effective under a variety of leadership frameworks and therefore do not materially affect its choice of structure.\nThe Board of Directors is led by the Chairman. The Company has five directors, and its Chief Executive Officer and Chief Financial Officer report to the Board of Directors. Our structure provides the Company with multiple leaders who represent the Company to our stockholders, regulators, business partners and other stakeholders, among other reasons set forth below.\nThis structure creates efficiency in the preparation of the meeting agendas and related Board materials as the Company's Chief Executive Officer works directly with those individuals preparing the necessary Board materials and is more connected to the overall daily operations of the Company. Agendas are also prepared with the permitted input of the full Board of Directors allowing for any concerns or risks of any individual director to be discussed as deemed appropriate. The Board believes that the Company has benefited from this structure and is in the best interest of the stockholders.\nThe Company believes this structure allows for efficient and effective oversight, given the Company's relatively small size, its corporate strategy and focus.\nOur directors are elected by our shareholders at our annual general meetings. Each director holds office until our next annual general meeting or until the director resigns or is removed in accordance with our bylaws.\nTHE BOARD'S AND ITS COMMITTEES' ROLE AND RISK OVERSIGHT\nEffective risk oversight is an important priority of the Board. Because risks are considered in virtually every business decision, the Board discusses risk throughout the year generally or in connection with specific proposed actions. The Board's approach to risk oversight includes understanding the critical risks in the Company's business and strategy, evaluating the Company's risk management processes, allocating responsibilities for risk oversight, and fostering an appropriate culture of integrity and compliance with legal responsibilities.\nThe Board exercises direct oversight of strategic risks to the Company. The Audit Committee reviews and assesses the Company's processes to manage business and financial risk and financial reporting risk. It also reviews the Company's policies for risk assessment and assesses steps management has taken to control significant risks. The management periodically reports to our Board or relevant committee, which provides the relevant oversight on risk assessment and mitigation.\nAUDIT COMMITTEE\nOur audit committee currently consists of Dr. David Summers, Mr. Hyonmyong Cho, and Mr. Samuel Jay Graber. Each of Mr. Summers, Mr. Cho and Mr. Graber are non-employee directors of the Company and are considered independent as that term is defined by TSX rules and NASDAQ 5605(a)(2) and the applicable rules of the Securities and Exchange Commission. Our Board of Directors has currently designated Mr. Summers and Mr. Cho as \"audit committee financial experts\" as defined in Item 407(d)(5)(ii) of Regulation S-K. We believe that the audit committee members are capable of analyzing and evaluating our financial statements and understanding internal controls over financial reporting.\nOur Board adopted a charter for the Audit Committee in November 2013, a copy of which is available on our corporate website www.dsny.com.\nCOMPLIANCE WITH SECTION 16(a) OF THE EXCHANGE ACT\nSection 16(a) of the Exchange Act requires the Company's directors, executive officers and persons who beneficially own 10% or more of a class of securities registered under Section 12 of the Exchange Act to file reports of beneficial ownership and changes in beneficial ownership with the SEC. Directors, executive officers and greater than 10% stockholders are required by the rules and regulations of the SEC to furnish the Company with copies of all reports filed by them in compliance with Section 16(a).\nBased solely on our review of certain reports filed with the SEC pursuant to Section 16(a) of the Exchange Act, or Section 16(a), we believe that during the fiscal year ended August 31, 2022 all such filing requirements were complied with.\nDIRECTORS' AND OFFICERS' LIABILITY INSURANCE\nDestiny Media Technologies, Inc. has directors' and officers' liability insurance insuring our directors and officers against liability for acts or omissions in their capacities as directors or officers.\nCODE OF ETHICS\nThe Company's code of ethics is available on our website at https://investors.dsny.com/investors/documents/.\nWe have adopted a code of ethics that applies to our principal executive officer, principle financial and accounting officer, or persons performing similar functions.\nFAMILY RELATIONSHIPS\nThere are no family relationships among our officers and directors. ITEM 11. EXECUTIVE COMPENSATION.\nThe following table presents information regarding the total compensation awarded to, earned by, or paid to each person serving as Chief Executive Officer during the year ended August 31, 2023 and other individuals as required by Item 402(m)(2) of Regulation S-K, during the noted periods. These individuals are our named executive officers for 2023.\nName and Principal Position Year Salary ($) Bonus ($) Stock\nAwards\n($) Option\nAwards ($)\n(1) Other Annual\nCompensation\n($) (2) Total ($)\nFrederick Vandenberg (3) , Director, President, Chief Executive Officer, and former Chief Financial Officer 2023 189,287 - - 8,363 16,173 213,823\n2022 200,139 3,475 - 52,986 22,071 278,671\nOlya Massalitina (3)(4) 2023 17,320 - - 12,545 - 29,865\nChief Financial Officer 2022 42,969 - - - 796 43,765\nSamuel Ritchie (3)(5) 2023 - - - - - -\nFormer Chief Financial Officer 2022 58,844 - - - 16,937 75,781\n(1) Option awards shown here represent the aggregate grant date fair value of all options granted.\n(2) The value of prerequisites and other personal benefits, securities and property for the individuals included in the summary compensation table that does not exceed $10,000 is not reported herein. Other compensation includes participation in the employee share purchase plan described below under long term incentive plans.\n(3) Compensation is stated in United States dollars. Where compensation was provided in Canadian dollars, compensation is based on an exchange rate of 0.7423 US dollars for each 1.00 Canadian dollar during the 2023 fiscal year and 0.7862 US dollars for each 1.00 Canadian dollar during the 2022 fiscal year.\n(4) Appointed April 2022.\n(5) Resigned effective March 2022.\nEMPLOYMENT AGREEMENT WITH OUR NAMED EXECUTIVE OFFICERS\nWe are not party to any written employment agreement or change in control arrangements with Mr. Vandenberg and Mrs. Massalitina. We do not have any agreements with Mr. Vandenberg and Mrs. Massalitina regarding the payments of bonus or other performance incentives. Mr. Vandenberg and Mrs. Massalitina are eligible to receive stock options as and when approved by our Board of Directors.\nOUTSTANDING EQUITY AWARDS AT FISCAL YEAR END\nThe following table summarizes equity awards granted to our named executive officers that were outstanding as of August 31, 2023:\nName and Principal Position Number of\nSecurities\nUnderlying\nUnexercised\nOptions #\nExercisable # Unexercisable Incentive Plan\nAwards:\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions Weighted\nAverage\nOption\nExercise Price\n$ Option\nExpiration\nDate\nFrederick Vandenberg,\nChief Executive Officer 58,333 21,667 - 1.50 31-Oct-2026\n1,668 18,332 0.85 23-Jul-2028\nOlya Massalitina,\nChief Financial Officer - 30,000 - 0.85 23-Jul-2028\nLONG-TERM INCENTIVE PLANS\nThe Company has an Employee Stock Purchase Program whereby all employees of the Company are eligible to contribute up to 5% of their annual salary into a pool which is matched equally by the Company. Independent directors are able to contribute a maximum of $12,500 each annually, for a combined maximum annual purchase of $25,000. The aggregate maximum annual contributions is limited to $400,000. Money in the pool is used to purchase shares out of the market on a semi-monthly basis. All purchases are made through the Exchange by a third-party plan agent and no purchases are made on the OTC or German exchanges. The third-party plan agent is also responsible for the administration of the Plan on behalf of the Company and the participants.\nAdditionally, the Company has the 2015 Stock Option Plan and 2022 Stock Option Plan, under which up to an aggregate of 1,530,000 shares of the common stock have been reserved for issuance. As at August 31, 2023, an aggregate of 781,000 common shares remained eligible for issuance under the plans. The options generally vest over a range of periods from the date of grant, some are immediate, and others are 12 or 24 months. Any options that do not vest as the result of a grantee leaving the Company are forfeited and the common shares underlying them are returned to the reserve. The options generally have a contractual term of five years.\nCOMPENSATION OF DIRECTORS\nOur directors are reimbursed for reasonable out-of-pocket expenses in connection with attendance at Board of Director and committee meetings. In addition, our directors are eligible for grants of options to purchase shares of our common stock at the discretion of our Board of Directors.\nThe following table summarizes compensation paid to all of our directors who were not our named executive officers during the fiscal year ended August 31, 2023:\nName Fees Earned\nor Paid in\nCash ($) Stock Awards ($) Option Awards ($) All Other\nCompensation ($) (1) Total ($)\nHyonmyong Cho - - 4,182 - 4,182\nSamuel Jay Graber - - 4,182 12,500 16,682\nDavid Summers - - 4,182 - 4,182\nDavid Mossberg - - 4,182 12,500 16,682\n(1) Other compensation includes participation in the employee share purchase plan described above under long term incentive plans. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth certain information concerning the number of shares of our common stock owned beneficially as of November 28, 2023 by: (i) each person (including any group) known to us to own more than five percent (5%) of any class of our voting securities, (ii) each of our directors and each of our named executive officers, and (iii) officers and directors as a group. Unless otherwise indicated, the shareholders listed possess sole voting and investment power with respect to the shares shown.\nCommon Stock Beneficially\nOwned Percentage of Shares\nBeneficially Owned (1)\nName of beneficial owner # of Shares %\nHyonmyong Cho (2) 547,622 5.52%\nSamuel Jay Graber (3) 262,362 2.64%\nFrederick Vandenberg (4) 513,002 5.15%\nDavid Summers(5) 116,715 1.18%\nDavid Mossberg (6) 97,357 *\nOlya Massalitina(7) 3,750 *\nAll directors and executive officers as a group (4 persons) 1,540,808 15.51%\nMark Graber (8) 2,085,779 21.02%\n*Owning less than 1%.\n(1) Under Rule 13d-3 of the Exchange Act, a beneficial owner of a security includes any person who, directly or indirectly, through any contract, arrangement, understanding, relationship, or otherwise has or shares: (i) voting power, which includes the power to vote, or to direct the voting of shares; and (ii) investment power, which includes the power to dispose or direct the disposition of shares. Certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire the shares (for example, upon exercise of an option) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares outstanding is deemed to include the amount of such shares beneficially owned by such person (and only such person) by reason of these acquisition rights. As a result, the percentage of outstanding shares of any person as shown in this table does not necessarily reflect the person's actual ownership or voting power with respect to the number of shares of common stock actually outstanding as of November 28, 2023. As of November 28 , 2023, there were 9,924,610 shares of our common stock issued and outstanding.\n(2) Consists of 142,735 shares held by Mr. Cho and 43,334 shares that may be acquired upon the exercise of stock options held by Mr. Cho within 60 days of November 28, 2023 and includes 361,553 shares held through Mr. Cho's indirect pecuniary ownership held through Greenlaw International LP, a Delaware limited partnership (the \"Fund\"), and Greenlaw International GP LLC, a Delaware limited liability company and the general partner of the Fund which has the right to receive an allocation of a portion of the profits of the Fund.\n(3) Consists of 219,028 shares held by Mr. Graber, and 43,334 shares that may be acquired upon the exercise of stock options held by Mr. Graber within 60 days of November 28, 2023.\n(4) Consists of 437,584 shares held by Mr. Vandenberg and 75,418 shares that are acquirable upon the exercise of stock options held by Mr. Vandenberg within 60 days of November 28, 2023.\n(5) Consists of 23,381 shares held by Mr. Summers and 93,334 shares that are acquirable upon the exercise of stock options held by Mr. Summers within 60 days of November 28, 2023.\n(6) Consists of 54,023 shares held by Mr. Mossberg and 43,334 shares that are acquirable upon the exercise of stock options held by Mr. Mossberg within 60 days of November 28, 2023.\n(7) Consists of 3,750 shares that are acquirable upon the exercise of stock options held by Mrs. Massalitina within 60 days of November 28, 2023.\n(8) Consists of (i) 1,933,809 shares of the Company's common stock directly held by Mark Graber; (ii) 145,970 shares beneficially owned by Four Star Investments, a Texas partnership over which Mr. Graber has shared voting and disposition power; and (iii) 6,000 shares held by Mr. Graber's spouse.\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS\nThe following table summarizes information about our equity compensation plans as of August 31, 2023.\nPlan Category Number of Shares of\nCommon Stock to be\nIssued upon Exercise of\nOutstanding Options (a) Weighted-Average\nExercise Price of\nOutstanding Options\n(b) Number of Options\nRemaining Available for\nFuture Issuance Under\nEquity Compensation\nPlans (excluding\nsecurities reflected in\ncolumn (a)) (c)\nEquity compensation plans approved by stockholders 639,000 $ 1.28 361,000\nEquity compensation plans not approved by stockholders 110,000 $ 1.45 420,000\nTotal 749,000 $ 1.30 781,000 ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nExcept as described under \"Item 11. Executive Compensation\" and under \"Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\" none of the following persons has any direct or indirect material interest in any transaction to which we were or are a party during the past two years, or in any proposed transaction to which the Company proposes to be a party:\nany director or officer;\nany person who beneficially owns, directly or indirectly, shares carrying more than 5% of the voting rights attached to our common stock; or\nany immediate family member of any of the foregoing persons.\nSHARE ISSUANCES\nNone.\nAll of our non-employee directors are our independent directors as that term is defined by TSX rules and NASDAQ 5605(a)(2) and the applicable rules of the Securities and Exchange Commission. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nAudit Fees\nThe aggregate audit and review fees incurred for the fiscal years ended August 31, 2023 and 2022 were $64,500 and $52,800, respectively. Such fees included work completed for our annual audit and for the review of our consolidated financial statements included in our Forms 10-K and 10-Q.\nThe 2023 and 2022 audits were performed by Smythe LLP, the Company's current auditor, appointed as the Company's new independent registered public accounting firm on September 15, 2022.\nAudit Related Fees\nNone.\nTax Fees\nFor the fiscal year ended August 31, 2023 the Company incurred $7,800 in fees billed for tax compliance services provided by Smythe LLP. For the fiscal year ended August 31, 2022 the Company incurred $16,500 in fees billed for tax compliance services provided by other consultants.\nAll Other Fees\nNone.\nPre-Approval Policies and Procedures\nAll auditing services and permitted non-audit services (including the fees and terms thereof) to be performed for the Company by our independent auditor must be approved by the Audit Committee in advance, except non-audit services (other than review and attestation services) if such services fall within exceptions established by the SEC. The Audit Committee will pre-approve any permissible non-audit services to be provided by the Company's independent auditors on behalf of the Company that do not fall within any exception to the pre-approval requirements established by the SEC. The Audit Committee may delegate to one or more members the authority to pre-approve permissible non-audit services, but any such delegate or delegates must present their pre-approval decisions to the Audit Committee at its next meeting. All of our accountants' services described above were pre-approved by the Audit Committee or by one or more members under the delegate authority described above.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nLIST OF DOCUMENTS FILED AS PART OF THE REPORT\nThe following documents are filed as part of this report:\n(a)(1) Financial Statements:\n1. Report of Independent Registered Public Accounting Firm (PCAOB ID No. 995);\n2. Consolidated Balance Sheets;\n3. Consolidated Statements of Comprehensive Income (loss);\n4. Consolidated Statements of Cash Flows;\n5. Consolidated Statement of Changes in Stockholders' Equity; and\n6. Notes to the Consolidated Financial Statements.\n(a)(2) Financial Statement Schedules:\n(a)(3) Exhibits:\n3.1 Amended Articles of Incorporation (incorporated by reference to Exhibit 3.2 to our Current Report on Form 8-K filed on October 8, 2014).\n3.2 Amended and Restated Bylaws (incorporated by reference to Exhibit B to the Plan of Conversion as filed in our Definitive Proxy Statement on Form DEF14A on August 18, 2014)\n3.3 Certificate of Amendment (incorporated by reference to Exhibit 3.1 to our Current Report on Form 8-K filed on September 13, 2019)\n4.1 Description of Capital Stock\n4.2 2015 Stock Option Plan\n10.1 Employee Stock Purchase Plan (incorporated by reference to our Other Definitive Proxy Statements on Form DEF 14A filed on February 04, 2011).\n21.1* Subsidiaries of the Registrant.\n24* Power of Attorney (included in Signature pages)\n31.1* Section 302 Certification of Chief Executive Officer\n31.2* Section 302 Certification of Chief Financial Officer\n32.1* Section 906 Certification of Chief Executive Officer and Chief Financial Officer\n100* XBRL-Related Documents\n101* Inline XBRL Instance Document-the instance document does not appear in the Interactive Data File as its XBRL tags are embedded within the Inline XBRL document\n101.SCH* Inline XBRL Taxonomy Extension Schema Document\n101.CAL* Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF* Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB* Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE* Inline XBRL Taxonomy Extension Presentation Linkbase Document\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n* Filed herewith\nManagement contract or compensatory plan or arrangement\nITEM 16. FORM 10-K SUMMARY.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDESTINY MEDIA TECHNOLOGIES, INC.\nBy: /s/Frederick Vandenberg\nFrederick Vandenberg\nChief Executive Officer, President\n(Principal Executive Officer)\nDate: November 28, 2023\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS that each individual whose signature appears below constitutes and appoints Frederick Vandenberg, his true and lawful attorney-in-fact and agent with full power of substitution, for him and in his name, place and stead, in any and all capacities, to sign any and all amendments to this Annual Report on Form 10-K, with all exhibits thereto and all documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorney-in-fact and agent, full power and authority to do and perform each and every act and thing requisite and necessary to be done in and about the premises, as fully to all intents and purposes as he might or could do in person, hereby ratifying and confirming all that said attorney-in-fact and agent, or his substitute or substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nBy: /s/Frederick Vandenberg\nFrederick Vandenberg\nChief Executive Officer, President\n(Principal Executive Officer)\nDate: November 28, 2023\nBy: /s/Olya Massalitina\nOlya Massalitina, CPA\nChief Financial Officer, Treasurer\n(Principal Financing and Accounting Officer)\nDate: November 28, 2023\nBy: /s/Hyonmyong Cho\nHyonmyong Cho\nDirector\nDate: November 28, 2023\nBy: /s/Samuel Jay Graber\nSamuel Jay Graber\nDirector\nDate: November 28, 2023\nBy: /s/David Summers\nDavid Summers\nDirector\nDate: November 28, 2023\nBy: /s/David Mossberg\nDavid Mossberg\nDirector\nDate: November 28, 2023"
}