{
    "cik": "1101396",
    "company": "DELTA APPAREL, INC",
    "filing_type": "10-K",
    "filing_date": "2022-11-21",
    "period_of_report": "2022-10-01",
    "sic": "5130",
    "state_of_inc": "GA",
    "state_location": "GA",
    "fiscal_year_end": "1001",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1101396/0001437749-22-027827-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1101396/000143774922027827/dla20220913_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1101396/0001437749-22-027827.txt",
    "filename": "1101396_10K_2022_0001437749-22-027827.htm",
    "content": "Item 1. Business\nOverview\nDelta Apparel, Inc. (collectively with DTG2Go, LLC, Salt Life, LLC, M.J. Soffe, LLC, and other subsidiaries, \"Delta Apparel,\" \"we,\" \"us,\" \"our,\" or the \"Company\") is a vertically-integrated, international apparel company with approximately 8,600 employees worldwide. We design, manufacture, source, and market a diverse portfolio of core activewear and lifestyle apparel products under our primary brands of Salt Life®, Soffe®, and Delta. We are a market leader in the on-demand, digital print and fulfillment industry, bringing DTG2Go's proprietary technology and innovation to our customers' supply chain. We specialize in selling casual and athletic products through a variety of distribution channels and tiers, including outdoor and sporting goods retailers, independent and specialty stores, better department stores and mid-tier retailers, mass merchants, eRetailers, the U.S. military, and through our business-to-business digital platform. Our products are also made available direct-to-consumer on our ecommerce sites and in our branded retail stores. Our diversified go-to-market strategy allows us to capitalize on our strengths to provide our activewear and lifestyle apparel products to a broad and evolving customer base whose shopping preferences may span multiple retail channels.\nWe design and internally manufacture the majority of our products with more than 90% of the apparel units that we sell are sewn in our own facilities. This allows us to offer a high degree of consistency and quality, leverage scale efficiencies, and react quickly to changes in trends within the marketplace. We have manufacturing operations located in the United States, El Salvador, Honduras, and Mexico, and we use domestic and foreign contractors as additional sources of production. Our distribution facilities are strategically located throughout the United States to better serve our customers with same-day shipping on our catalog products and weekly replenishments to retailers.\nWe were incorporated in Georgia in 1999, and our headquarters is located in Duluth, Georgia. Our common stock trades on the NYSE American under the symbol DLA.\" We operate on a 52-53 week fiscal year ending on the Saturday closest to September 30. All references to \"2022\" refer to the 52-week fiscal year ended October 1, 2022. All references to \"2021\" relate to the 52-week fiscal year ended October 2, 2021. We are filing as a smaller reporting company for 2022 as our public float was less than the applicable $250 million threshold on the last day of our second quarter.\nWe make available copies of materials we file with, or furnish to, the SEC free of charge at https://ir.deltaapparelinc.com. The information found on our website is not part of this, or any other, report that we file with or furnish to the SEC. In addition, we will provide upon request, at no cost, paper or electronic copies of our reports and other filings made with the SEC. Requests should be directed to: Investor Relations Department, Delta Apparel, Inc., 2750 Premiere Parkway, Suite 100, Duluth, Georgia 30097. Requests can also be made by telephone to 864-232-5200, or via email at investor.relations@deltaapparel.com.\nSegments, Products, Brands, and Customers\nOur operations are managed and reported in two segments, Delta Group and Salt Life Group, which reflect the manner in which the business is managed, and results are reviewed by the Chief Executive Officer, who is our chief operating decision maker.\nDelta Group\nThe Delta Group is comprised of the following business units primarily focused on core activewear styles: DTG2Go and Delta Activewear.\nDTG2Go\nWe are a market leader in the on-demand, direct-to-garment digital print and fulfillment industry, bringing technology and innovation to the supply chains of our many customers. Our ‘On-Demand DC digital solution provides retailers and brands with immediate access to utilize DTG2Gos broad network of print and fulfillment facilities, while offering the scalability to integrate digital fulfillment within the customer's own distribution facilities. We use highly-automated factory processes and our proprietary software to deliver on-demand, digitally printed apparel direct to consumers on behalf of our customers. Via our eight fulfillment facilities throughout the United States, DTG2Go offers a robust digital supply chain, shipping custom graphic products within 24 to 48 hours to consumers in the United States and to over 100 countries worldwide. DTG2Go has made significant investments in its digital-first retail model, providing digital graphic prints that meet the high-quality standards required for brands, retailers and intellectual property holders. Throughout fiscal 2022, we continued to invest in our proprietary software, new digital print equipment, and in research and development initiatives related to the setups, formulas and processes needed to serve our customers. Through integration with Delta Activewear, DTG2Go also services the eRetailer, ad-specialty, promotional and screen print marketplaces, among others.\nDelta Activewear\nDelta Activewear is a preferred supplier of activewear apparel to regional and global brands as well as direct to retail and wholesale markets. The Activewear business is organized around three key customer channels - Delta Direct, Global Brands, and Retail Direct - that are distinct in their go-to-market strategies and how their respective customer bases source their various apparel needs. Our Delta Direct channel services the screen print, promotional, and eRetailer markets as well as retail licensing customers that sell through to many mid-tier and mass market retailers. Delta Direct products include a broad portfolio of apparel and accessories under the Delta, Delta Platinum, and Soffe brands as well as sourced items from select third party brands. Our fashion basics line includes our Platinum Collection, which offers fresh, fashionable silhouettes with a luxurious look and feel, as well as versatile fleece offerings. We offer innovative apparel products, including the Delta Dri line of performance shirts built with moisture-wicking material to keep athletes dry and comfortable; ringspun garments with superior comfort, style and durability; and Delta Soft, a collection with an incredible feel and price. We also offer our heritage, mid- and heavier-weight Delta Pro Weight® and Magnum Weight® tee shirts.\nThe iconic Soffe brand offers activewear for spirit makers and record breakers and is widely known for the original \"cheer short\" with the signature roll-down waistband. Soffe carries a wide range of activewear for the entire family. Soffe's heritage is anchored in the military, and we continue to be a proud supplier to both active duty and veteran United States military personnel worldwide. The Soffe men's assortment features the tagline \"anchored in the military, grounded in training\" and offers everything from physical training gear certified by the respective branches of the military, classic base layers that include the favored 3-pack tees, and the iconic \"ranger panty.\" Complementing the Delta and Soffe brand apparel, we provide our customers with a broad range of product categories with nationally recognized branded products including polos, outerwear, headwear, bags and other accessories. Our Soffe products are also available direct to consumers at www.soffe.com.\nOur Global Brands channel serves as a key supply chain partner to large multi-national brands, major branded sportswear companies, trendy regional brands, and all branches of the United States armed forces, providing services ranging from custom product development to shipment of branded products with retail-ready value-added services including embellishment, hangtags, and ticketing.\nOur Retail Direct channel serves brick and mortar and online retailers by providing our portfolio of Delta, Delta Platinum, and Soffe products directly to the retail locations and ecommerce fulfillment centers of a diversified customer base including sporting goods and outdoor retailers, specialty and resort shops, farm and fleet stores, department stores, and mid-tier retailers.\nAs a key element of the integrated Delta Group segment, each of Activewears primary channels offers a seamless solution for small-run decoration needs with on-demand digital print services, powered by DTG2Go.\nSalt Life Group\nSalt Life\nSalt Life is an authentic, aspirational lifestyle brand that represents a passion for the ocean, the salt air, and, more importantly, a way of life and all it offers, from surfing, fishing, and diving to beach fun and sun-soaked relaxation. The Salt Life brand combines function and fashion with a tailored fit for the active lifestyles of those that live the Salt Life. With increased worldwide appeal, Salt Life has continued to provide the cotton graphic tees and logo decals that originally drove awareness for the brand, and expanded into performance apparel, swimwear, board shorts, sunglasses, bags, and accessories. In fiscal 2022, Salt Life grew its retail footprint to include twenty-one stores across the U.S. coastline from Southern California to Key West and up the eastern seaboard to Rehoboth Beach, Delaware. Consumers can also seamlessly experience the Salt Life brand through one of our retail partners which include surf shops, specialty stores, department stores, and outdoor merchants or by accessing our Salt Life ecommerce site at www.saltlife.com.\nSee Note 13 to the Consolidated Financial Statements and \"Management's Discussion and Analysis of Financial Condition and Results of Operation\" for additional information regarding reportable segments.\nManufacturing, Sourcing, and Distribution\nThe vast majority of our products are manufactured or sewn in facilities that we own or lease and operate to support both the Delta Group and Salt Life Group. To a lesser extent, we also use third-party contractors and suppliers to supplement our requirements. Our vertically-integrated manufacturing operations include a textile facility and multiple sew and decoration facilities.\nOur manufacturing operations begin with the purchase of yarn and other raw materials from third-party suppliers. We have operated with a supply agreement with Parkdale Mills, Inc. and Parkdale America, LLC (collectively \"Parkdale\") to supply our yarn requirements since 2005, with our existing agreement running through December 31, 2024. Under the supply agreement, we purchase all of our yarn requirements for use in our manufacturing operations from Parkdale, excluding yarns that Parkdale does not manufacture or cannot manufacture due to temporary capacity constraints. The purchase price of yarn is based upon the cost of cotton, as reported by the New York Cotton Exchange, plus a fixed conversion cost. We set future cotton prices with purchase commitments as a component of the purchase price in advance of the shipment of finished yarn from Parkdale.\nWe manufacture fabrics in our leased textile facility located near San Pedro Sula, Honduras. We also purchase fabric sourced in Mexico for use in our Campeche, Mexico sew facility, purchase specialized fabrics that we currently do not have the capacity or capability to produce, and may purchase other fabrics when it is cost-effective to do so. In 2022 and 2021, we manufactured approximately 80% of fabrics used in our internally-produced garments. The manufacturing process continues at one of our six apparel manufacturing facilities where fabric is cut and sewn into finished garments. These owned or leased facilities are located domestically (two in North Carolina) and internationally (two in Honduras, one in El Salvador and one in Mexico). In 2022 and 2021, approximately 95% or more of our manufactured products were sewn in our owned or leased manufacturing facilities. The remaining products were sewn by third-party contractors located primarily in the Caribbean Basin. To supplement our internal manufacturing platform, we purchase products from third-party global suppliers. In 2022 and 2021, we sourced less than 10% of our total products from third parties.\nMany of the garments we produce will be decorated using screen printing or digital printing technology, and will be retail-packaged, including ticketing, hang tags, and hangers. These services can be performed domestically for quick-turn service or internationally in our facilities in El Salvador and Mexico. We offer digital fulfillment services, powered by DTG2Go, at eight domestic facilities, including five such facilities that are integrated with Delta Group distribution centers. These facilities support our strategy of establishing integrated fulfillment locations that combine our DTG2Go state-of-the-art digital platform with our Delta Activewear supply of fashion and core basic garments. Furthermore, these facilities create a seamless nationwide footprint allowing us to reach approximately 95% of all U.S. consumers with two-day shipping.\nWe operate eight distribution facilities strategically located throughout the United States that carry in-stock inventory for shipment to customers, with most shipments made via third-party carriers. To better serve customers, we allow products to be ordered by the piece, dozen, or full case quantity, and we aggressively leverage our strengths and efficiencies to meet the quick-turn needs of our customers. Because a significant portion of our business consists of at-once replenishment orders, we believe that backlog order levels do not provide a general indication of future sales.\nSee Item 2. Properties for more information about each of our primary manufacturing and distribution facilities.\nSales & Marketing\nOur sales and marketing functions consist of both employed and independent sales representatives and agencies located throughout the country. Our sales teams service specialty and resort shops; department, mid-tier and mass retailers; sporting goods stores; eRetailers and the U.S. military. Our brands leverage both in-house and outsourced marketing communication professionals to amplify their lifestyle statements.\nThe majority of our apparel products are produced based on forecasts to permit quick shipments to our customers; however, our custom programs are generally made only to order. During 2022, we shipped our products to approximately 7,300 customers, many of whom have numerous retail doors. No single customer accounted for more than 10% of our sales in 2022 or 2021, and our strategy is to not become dependent on any single customer. Revenues attributable to sales of our products in foreign countries represented less than 1% of consolidated net sales in both 2022 and 2021.\nTrademarks and License Agreements\nWe own several well-recognized trademarks that are important to our business. Salt Life® is an authentic, aspirational lifestyle brand that embraces those who love the ocean and everything associated with living the \"Salt Life\". Soffe® has stood for quality and value in the athletic and activewear market for more than sixty years. Our other registered trademarks include Intensity Athletics®, Kudzu®, Pro Weight®, Magnum Weight®, and the Delta Design logo trademark. Our trademarks are valuable assets that differentiate the marketing of our products. We vigorously protect our trademarks and other intellectual property rights against infringement. While our strategy is to own the intellectual property we use within our business, we are an official intellectual property licensee for branches of the United States military which is used within the Soffe brand. We believe these license agreements are important given the military heritage of Soffe.\nEnvironmental, Sustainability, and Governance\nWe aim to disclose and communicate transparently any material risks that could affect our investors, and we strive to implement policies and practices that continuously improve the transparency and sustainability of our supply chain. The Environmental, Sustainability, and Governance (ESG) disclosures within this Annual Report and our definitive Proxy Statement align with the standards issued by the Sustainability Accounting Standards Board (SASB) for the Apparel, Accessories, and Footwear industry and with regulations and guidance issued by the Securities and Exchange Commission. The indicators in the Annual Report and definitive Proxy Statement have been carefully selected to show the most relevant aspects of our performance in the areas of environmental impact, health and safety, responsible raw material sourcing, safe chemical management, and responsible corporate governance.\nConserving the Environment\nWe believe that efficiently and sustainably managing natural resources is a smart business practice and a responsible decision for the planet. By effectively and safely managing the materials used to manufacture our apparel products, we also protect the health and safety of our customers and employees. Our commitment to environmental sustainability includes compliance with safe chemistry practices and implementing technology and processes that reduce energy and water consumption, reuse and effectively treat wastewater, and reduce and recycle waste. We are committed to full compliance with local, regional, and national environmental laws and regulations.\nReducing our Environmental Impact\nEnvironmental problems such as climate change and resource depletion are escalating worldwide. Therefore, understanding and managing greenhouse gas emissions is important to effectively mitigate our impact to the environment. We are committed to monitoring our greenhouse gas emissions and adopting innovative technologies to improve the energy efficiency of our facilities and reduce our overall energy intensity, which is measured as primary energy consumption in kilowatt-hours per unit of gross domestic product.\nThe focus on reducing our overall energy intensity is driven by our goal to establish an energy efficient operation and reduce greenhouse gas emissions, which will contribute to lowering our operating costs as well as reducing our carbon footprint. The operations at our Ceiba Textiles facility account for a significant portion of the fuel and electricity used in our manufacturing network and, as such, are our largest contributors of carbon dioxide (CO2) emissions. In May 2022 Ceiba Textiles began receiving 100 percent clean, renewable energy from a 14.7-megawatt solar power array installed by the industrial park in which the facility is located. Not only is solar energy sustainable, it does not emit greenhouse gases, air, or water pollution when producing electricity, contributing to our goal to establish an energy efficient operation and reduce greenhouse gas emissions.\nWhen comparing 2022 to our 2018 baseline year, we have reduced our total greenhouse gas emissions by 3.5 percent and reduced our emissions intensity by 12 percent in 2022. These reductions avoid the equivalent of 1,637 metric tons of CO2 emissions, which is comparable to the energy used by approximately 206 homes for one year or the carbon sequestered by 1,937 acres of U.S. forests in one year.\nIn recent years we implemented several energy efficiency projects such as installing a heat exchanger at our Ceiba Textiles facility in Honduras that plays an essential role in reducing the environmental impact of manufacturing processes by recovering and reusing energy. We also continue to replace compact florescent light bulbs with LED lighting, which is known to emit less heat and use less energy than conventional bulbs, decrease the temperature on factory floors, and thus potentially raise productivity, particularly on hot days. In the sewing area, we improved the performance of our sewing machines by installing new motors that use significantly less energy due to advanced technology. In the knitting operations area, we modified the cooling system to turn off automatically when the outside temperature and humidity reaches the optimum environment inside.\nIn February 2022, we removed 27 older model circular knitting machines and installed 18 large capacity knitting machines. Each new machine is much more energy efficient in addition to being more productive; with each new machine capable of knitting one and one-half times more greige fabric in less time than one of the older knitting machines. The new knitting machines were directly responsible for reducing our electricity usage by approximately 393,000 kilowatt hours in 2022. Additional energy saving initiatives at Ceiba Textiles included the purchase of a new steam textile dryer that replaced two existing thermal oil dryers. The steam dryer is capable of drying 66 percent more pounds of fabric per week than the thermal dryers and uses 25 percent less energy. Over a four-month service period in 2022, the new steam dryer was responsible for reducing our electricity usage by approximately 250,000 kilowatt hours and we anticipate its energy savings to double next year. Together, these two energy-saving initiatives reduced our total electricity usage by 641,875 kilowatt hours and avoided 455 metric tons of carbon dioxide (CO2) emissions, which is comparable to the carbon sequestered by 538 acres of forest in one full year. In addition, compared to our 2018 baseline year, we produced 9.7 percent more finished fabric in 2022 while using 7.5 percent less fuel and 8.6 percent less electricity. Overall, this has improved our fuel intensity by approximately 16 percent and electricity intensity by approximately 17 percent compared to the 2018 baseline year.\nManaging Water\nWater is one of the worlds most precious and vital resources. Access to water is essential to Delta Apparels manufacturing operations, and we are committed to managing our water use in an efficient and responsible manner. Treating textile wastewater is necessary not only to protect the local ecosystems, but also to make the recycled water available to reuse in manufacturing processes or irrigation. To properly treat problematic substances before the water is discharged, our vertically integrated manufacturing facilities, as well as our third-party fabric suppliers, comply with wastewater discharge requirements through currently active licenses and permits issued by local governments. In each of the last five years, none of these wastewater treatment facilities have received a compliance citation or violation.\nDuring manufacturing the most significant amount of water consumption occurs during the fabric washing, dyeing, and rinsing processes. To reduce our water consumption at Ceiba Textiles, we implemented a system in 2018 that reuses the leftover dye water for use in future batches of similar-colored fabric. This system saves approximately 4 million gallons or 15,000 cubic meters of water per year while maintaining the quality of our dyed fabrics. We also improved our dye formulas to further reduce water consumption and reduce the amount of contaminates remaining in the wastewater. Compared to our 2018 baseline, these initiatives reduced our water intensity by 9.1 percent in 2021 and 7.3 percent in 2022.\nWastewater from Ceiba Textiles is transferred to the Green Valley water treatment facility, which operates on an environmental license issued by the Honduras Ministry of Energy, Natural Resources, Environment, and Mines. Over 87 percent of our 2022 water consumption at Ceiba Textiles was recycled. The Green Valley wastewater treatment facility uses the industry standard primary, secondary, and tertiary water treatment methods based on the types of effluents being discharged as well as regulatory and environmental standards. Treatment procedures are also in place to neutralize and remove additional substances that may potentially be harmful, but are not necessarily regulated. The following information describes the primary, secondary, and tertiary water treatment methods.\n●\nPrimary - Primary treatment methods include screening, sedimentation, homogenization, pH neutralization, and mechanical and chemical flocculation, which is a chemical added to the water that binds suspended solids into heavier particles that are easier to remove. Nano and cross-flow nano filtration techniques are also used to reduce the vast majority of sodium chloride and dyes.\n●\nSecondary - Secondary treatment is designed to substantially degrade the biological content of the wastewater by using a combination of physical and aerobic biological processes. Secondary treatment methods include various types of filtration along with an activated sludge process, which stabilizes and converts potentially toxic contaminates into less harmful forms such as carbon dioxide and water, which are safe for the environment.\n●\nTertiary - Tertiary treatment is the final cleaning process that purifies wastewater before it is reused, recycled, or discharged into the environment. Treatment methods include a combination of physical and chemical techniques to decontaminate and purify the water.\nManaging Waste\nOur waste management strategy is to reduce, reuse, and recycle, which increases the likelihood that the waste materials we generate during the manufacturing process never reach landfills, lakes, rivers, streams, or municipal water systems. We are committed to full compliance with local, regional, and national environmental laws and regulations in the countries in which we operate as it relates to responsible recycling and disposal of hazardous and non-hazardous waste.\nPre-consumer textile waste is created during the cutting and sewing processes and includes small pieces of fabric trimmed away and other fabric scraps. We have modified sewing patterns to significantly reduce fabric waste during cutting. We also invested in sewing machines capable of folding excess fabric inside the sleeve and bottom hems to eliminate trimming. This initiative not only reduces textile waste but also lowers fabric production needs, which saves water, electricity, and fuel.\nWe have multiple reuse and recycle programs that help limit the waste that would otherwise be disposed in landfills:\n●\nWe partner with several companies that collect our fabric waste and sell it to manufacturers in the automotive industry, among others, that can mix the fabric with other materials to create alternate applications for the fabric, such as for automotive seats and windshield wipers.\n●\nOur offshore screen-printing facilities recycle colors of ink that remain at the end of a production project for use in future production. In one year, this recycling program can recover as much as 75 percent of the residual plastisol ink and 50 percent of the residual water-based ink that otherwise would have been discarded.\n●\nAll of our manufacturing, sewing, and distribution facilities participate in cardboard recycling programs. Each facility flattens and places all cardboard in an outside container for recycling companies to then collect on a regular schedule.\nUsing Safe Chemistry\nTextile operations use various chemicals, cleaners, dyes, and inks throughout the manufacturing, finishing, and decorating processes. We strive to use non-hazardous, bioeliminable ingredients in our apparel products and throughout our manufacturing processes to protect the safety of our customers and employees as well as reduce negative impacts on the environment. For example, our DTG2Go digital printing facilities use water-based biodegradable inks that are 100 percent non-hazardous and adhere to the strictest human health and environmental standards.\nWe have a robust, hazard-based chemicals management system throughout our manufacturing processes. Our commitment to safe chemistry begins in the design and development stage of our products, which are conceived from the latest fashion trends and are fully compliant with statutory, industry, and customer-specific safety requirements. We are proud that the chemicals we use comply with the restricted substance list (RSL) published by the American Apparel & Footwear Association (AAFA). AAFA is the industrys leading resource for maintaining and publishing banned and restricted substances lists for finished apparel products around the world. We continuously monitor our RSL, which includes additional substances that may be harmful, but are not necessarily regulated. We also control against the procurement of restricted substances through our purchase approval processes and arrangements with dye and chemical vendors.\nThe dyes and chemicals used in our manufacturing facilities are tested annually by a third-party laboratory that uses a scoring system to determine the level of compliance. Since 2017 we have maintained a Green status, which is the highest level of compliance. Annual tests are also conducted by a third-party laboratory to ensure our compliance with The Consumer Product Safety Improvement Act (CPSIA) of 2008 and The Safe Drinking Water and Toxic Enforcement Act of 1986 (Proposition 65 of California State Law), in addition to adherence to any customer-supplied RSL. Our manufacturing employees are provided training on compliance with our RSL as well as training on how to safely handle potentially hazardous substances throughout the manufacturing process.\nIt is also important to us that all our significant third-party yarn and fabric suppliers share our high compliance standards and operate in a legal and responsible manner. We require these suppliers to provide, at least annually, certification or self-declaration documents that demonstrate compliance with industry standard parameters for safe chemistry. We take immediate corrective actions in instances where non-compliance may be identified.\nResponsible Sourcing\nAs a vertically-integrated apparel company, we believe it is important to have a high degree of oversight into all aspects of sourcing, manufacturing, and distribution. To that end, the lifecycle of a Delta Apparel garment begins with high quality, sustainable cotton, which is the primary ingredient for the majority of apparel products across our brand portfolio. Over 90 percent of our garments are created with U.S. cotton, which is known for both the quality of its fibers as well as the sustainability practices of the cotton farmers who harvest it. Cotton is not considered a water-intensive crop and more than 60 percent of the cotton grown in the U.S. is produced without irrigation. Cotton is also highly tolerant of soil and water salinity levels, so it can be grown with water and soil resources unsuitable for most other crops. We do not source cotton from regions that regularly experience water stress, and we do not source conflict minerals in the production of our products.\nDelta Apparel is a member of the Cotton LEADS program, which is committed to sustainable and traceable cotton production. This partnership enables us to broaden our support of the cotton farmers who supply our Company with high-quality cotton, allowing us to continue transforming sustainably-sourced cotton into high quality, responsible apparel products for our customers. We serve as a supply chain partner for many customers who expect high quality raw materials and require the ability to trace those raw materials back to the source. With cotton traceability, we are now able to trace the fiber used in our garments all the way back to harvest.\nThe vast majority of the yarn we use in our textile operations is sourced from Parkdale Mills, whose products are independently certified to Standard 100 established by the International Oeko-Tex Association (\"OEKO-TEX\"), which is one of our industry's most well-known and trusted certifications for product safety. In addition, our significant suppliers of external fabric are certified to Standard 100 by OEKO-TEX.\nMonitoring Progress\nWe use the Sustainable Apparel Coalitions Higg Index to measure the environmental impact of all our offshore manufacturing facilities and the facilities of our key external fabric suppliers. The Higg Index tool provides transparency of our efforts to reduce our environmental impact, and it identifies areas for continued improvement. Our Ceiba Textiles facility has been using this tool for several years, and our 2021 self-assessment resulted in a total score in the upper quartile as compared to our industry competitors. Our most recent self-assessment was completed in April 2022 and the results will be available in April 2023. We retain the services of an external consultant to verify our assessments for a sample of facilities and to provide guidance for any areas of improvement.\nSocial Responsibility and Human Capital Management\nOur employees are our most important and valuable asset. Our diverse and talented workforce helps drive our culture of high performance, close teamwork, and deep caring for each other across geographies and functions. We have an impact on the lives of over 8,600 employees across the globe as well as their families and communities. We support the livelihoods of our people through competitive wages and benefits, providing them with a safe and healthy workspace, supporting the communities in which they live, and, most importantly, treating all employees with dignity and respect.\nOur People\nThe table below provides an overview of the approximate number of our employees by geographic location as well as the tenure of that employee base as of September 2022:\nTenure\nCountry\nNumber of Employees\n5 Years or Less\n6 - 10 Years\n10 Years or More\nEl Salvador\n3,245\n62%\n20%\n19%\nHonduras\n3,229\n53%\n27%\n21%\nMexico\n59%\n15%\n27%\nUnited States\n1,163\n74%\n9%\n18%\nTotal\n8,623\n60%\n20%\n20%\nOur employee base fluctuates based on seasonal labor requirements within our distribution and fulfillment centers, as well as based on production levels within our manufacturing facilities. These personnel changes generally trend with the overall demand for our products and services.\nApproximately 80 percent of the employees at two of our facilities in San Pedro Sula, Honduras, are party to multi-year collective bargaining agreements. We have historically conducted our operations without significant labor disruptions and believe that our relations with our employees are positive.\nThe table below provides an overview of the approximate percentage of our employees by gender and region as of September 2022:\nRegion\nMale\nFemale\nOffshore\n49%\n51%\nUnited States\n35%\n65%\nTotal\n47%\n53%\nDiversity and Inclusion\nWe are committed to fostering an inclusive culture where every employee is treated with dignity and respect, regardless of their gender, age, race, abilities, sexual orientation, or other legally protected characteristic. We believe that our employees contributions are richer because of their diverse backgrounds and experiences, which strengthens the collaboration of our cross-functional, global teams and leads to improved performance.\nWages and Benefits\nInvesting in our people is critical for their personal and professional success, and we believe this investment enhances engagement and performance levels. Our compensation philosophy is to provide a fair living wage that is also scalable to the performance of the business. We provide our employees with at least the legal minimum wage or the prevailing industry wage in the countries where we operate, whichever is higher, complying with all legal requirements. We also provide fringe benefits, some of which are required by law, contract, or as per established collective bargaining agreements, while others are more favorable than required.\nIn recognition of the importance of raising the standard of living in certain communities in which we operate, we provide additional benefits, such as free onsite medical care from fully licensed physicians and nurses that encompass clinics and wellness programs. In these locations, we also provide subsidized meal assistance as well as free transportation to and from our facilities.\nWe invest in the professional development of our employees through various training programs. In 2022, we provided more than 230,400 hours of professional development and safety training for our employees, which is a 6 percent increase from the previous year.\nHealth and Safety\nOur responsibility is to provide our employees with a safe and healthy work environment that meets or exceeds the applicable environmental and health and safety laws and regulations. All our manufacturing facilities in El Salvador, Honduras, and Mexico are Worldwide Responsible Accredited Production (WRAP) certified. We are a Category C affiliate with the Fair Labor Association (FLA), an organization that supports human rights compliance monitoring for our plants and our third-party contractors.\nBecause textile manufacturing can contain various hazards and risks to workers, we have proactive programs in place to promote workplace safety, personal health, and employee wellness. Our culture promotes and rewards safety-first in all aspects of manufacturing, materials handling, and distribution of our apparel products. Safety training and awareness is embedded in employee orientation and onboarding, job performance and evaluation, and ongoing training based on a set safety training calendar by topic. We standardize, document, and improve our manufacturing and distribution safety procedures that require activities to be performed in the safest manner possible.\nWe are proud that our safety records are consistently better than OSHAs benchmarks for the apparel manufacturing sector. For example, Delta Apparels 2022 incident rate for total recordable cases dropped to 0.19 percent compared to the apparel industry average incident rate of 1.7 percent.\nOur production and distribution processes incorporate ergonomic material handling equipment to reduce physical risks, protect employee health, and optimize productivity. In our cut and sew facilities, we use ergonomically-friendly chairs and floor mats in addition to facilitating frequent group stretching and movement exercises. In several of our manufacturing and distribution facilities we provide lightweight slip sheet material handling equipment, which has the dual benefit of reducing manual labor and potential back strain on employees.\nAt the onset of the COVID-19 pandemic, we quickly implemented a comprehensive series of protocols and safety measures across all our facilities to protect the health and safety of our employees and contractors. We also created our own COVID-19 safety videos to promote healthy behaviors at home and in the workplace. Today, these COVID-19 safety measures are still in place at our offshore facilities, including maintaining plexiglass partitions to separate cafeteria seating areas and requiring all employees to observe safe distancing. We also continue to provide all employees with personal protective equipment, sanitizing products, and COVID-19 informational materials.\nMonitoring\nWe conduct annual audits of all our internal manufacturing facilities as well as our significant third-party fabric suppliers to evaluate compliance with the FLA Workplace Code of Conduct. These audits cover labor topics, such as forced or child labor, compensation policies, and nondiscrimination, as well as environmental health and safety topics, such as fire safety, processes for safe chemistry, and environmental permits. These audits are important in identifying and preventing human rights and environmental health and safety violations.\nThe annual audits are conducted by Delta Apparel employees in our human resources or compliance departments, and they follow predefined audit programs and checklists that involve a mix of in-person site visits and walkthroughs of the facility, observations of processes, interviews with employees, and inspection of records and applicable permits. The audit results are documented with supporting photographs for any non-conformance findings. The internal auditors then report the findings to management, including the recommended corrective actions, and the date by which the corrective actions must be complete. The audits performed in 2022 resulted in no priority non-conformance findings, which are defined as severe violations of code of conduct in the areas of labor or environmental health and safety. For minor violations identified, we put corrective action plans in place to remediate the findings.\nCommunity Outreach\nDelta Apparel is committed to giving back to the communities where our employees live and work through volunteer service and community outreach. In 2022, our employees were involved in programs to promote environmental responsibility and improve the way of life for nearby communities. For example, Salt Life sponsored a number of national organizations, in addition to offering a variety of t-shirts for which donations were collected for various relief efforts. In addition, our US employees were directly involved with the community through both the donation of merchandise to fundraisers and sponsorship of individual volunteer efforts with nearby organizations. Additionally, our offshore employees in Mexico, Honduras, and El Salvador were involved in numerous activities throughout the year including the following:\n●\nOur facilities in Mexico and Honduras continue to support COVID-19 campaigns in local communities by donating personal protection items such as sanitizing gel and face masks. Schools in Mexico that received donations were the 21 de Agosto Primary School in the town of Villa Madero, which is south of Seybaplaya, Campeche, and the Lazaro Cardenas Primary School in Seybaplaya where some of our employees children attend. Our Mexico facilities employ 210 people who live in these communities. In Honduras, donations of items such as bleach, sanitizing gel, alcohol, and face masks were made to the San Raphael Orphanage located in Villanueva, Cortes, and Dos Caminos Health Care Center located in Dos Caminos, Cortes. The Delta Honduras and Delta Cortes facilities employ 203 people who live in Dos Caminos.\n●\nFor the second year, Mexico employees joined with the Together We Will Win civil association and the Una Caricia Humana, IAP organization to collect and donate thousands of plastic bottle caps that are sold to companies that grind and reuse the plastic to make new products. The proceeds from the sale of the caps are used to help cover the cost of comprehensive treatment for children with cancer. Una Caricia Humana provides free support to families of children with cancer such as food, lodging, medicines, treatment supplies, and transportation.\n● For the second year, Delta Campeche employees participated in the Campeche Turtle Project to help save the critically endangered Hawksbill sea turtle by cleaning the plastic waste from beaches in Seybaplaya where the turtles come to lay their eggs for six months per year. On average, a sea turtle lays around 100 eggs; however, only 1 percent of the hatchlings actually makes its way out into the ocean and survives, making it critical to remove any obstacles that would prevent the hatchling from reaching the water. The beach cleanup resulted in one full trash bag for approximately every five yards of beach.\n● Delta Cortes employees installed trash cans and environmental signs, and cleaned litter in an area of the Mico Quemado mountain range, which is an ecological reserve located in the department of Yoro. More than 280 square kilometers of this mountain chain are protected by the Central Government of Honduras due to its ecological importance to surrounding communities. Not only are the forests and valleys filled with rare plants and exotic animals, this area contains rivers and natural springs that are the primary water source for over 450,000 people in the cities of Santa Rita and El Negrito.\n● Employees at Ceiba Textiles donated a gas-powered trimmer to the Quimistán Municipal Environmental Unit to support the maintenance of the area reforested as a result of the annual United for a Greener Honduras campaign in which Ceiba Textiles employees previously participated. Reforestation in this area of western Honduras was a critical factor in increasing the regions water retention capacity as it reduced the impact to nearby communities when rivers would overflow during the rain and hurricane seasons.\n● In the town of Santiago Nonualco in the department of La Paz, Textiles La Paz employees painted the entrance of the Caserio Ojo de Agua school and installed four fans in two classrooms. Out of the approximately 270 children who attend this school, 50 of those are the children of employees at the Textiles La Paz facility.\nCompetition\nAs a vertically-integrated apparel company, we have numerous competitors in both domestic and international markets, many of which are larger and have more brand recognition and greater marketing budgets. Some of these competitors may benefit from lower production costs that can result from greater operational scale, a differing supply chain footprint, or trade-related agreements and other macroeconomic factors that may enable them to compete more effectively.\nCompetition in our Delta Group segment is generally based upon price, service, delivery time, and quality, with the relative importance of each factor dependent upon the needs of the particular customer and the specific product offering. Our Delta Direct products generally are highly price competitive, and competitor actions can greatly influence pricing and demand for our products. While price is still important in our Global Brands and Retail Direct channels, quality and service are generally more important factors for customer choice. Our ability to consistently service the needs of our Global Brand and Retail Direct customers greatly impacts future business in these channels. We believe our U.S. market-adjacent manufacturing platform enables us to compete with our competitors by providing an outlet for customers to diversify their sourcing footprints and reduce time to market. Furthermore, as an integrated entity with design, manufacturing, sourcing, and marketing capabilities, we believe the interdependencies within our portfolio provide cost, quality, and speed to market advantages that enable us to be more competitive.\nWe believe that competition within our Salt Life Group segment is based primarily upon brand recognition, design, and consumer preference. We focus on sustaining the strong reputation of our lifestyle brands by adapting our product offerings to changes in fashion trends and consumer preferences. We aim to keep our merchandise offerings fresh with unique artwork and new designs and support the integrated lifestyle statement of our products through effective consumer marketing. We believe that our favorable competitive position stems from strong consumer recognition and brand loyalty, the high quality of our products, and our flexibility and process control, which drive product consistency. We believe that our ability to remain competitive in the areas of quality, price, design, marketing, product development, manufacturing, technology and distribution will, in large part, determine our future success.\nSeasonality\nAlthough our various product lines are sold on a year-round basis, the demand for specific products or styles reflects some seasonality. By diversifying our product lines and go-to-market strategies over the years, we have reduced the overall seasonality of our business. Consumer demand for apparel is cyclical and dependent upon the overall level of demand for soft goods, which may or may not coincide with the overall level of discretionary consumer spending. These levels of demand change as regional, domestic and international economic conditions change. Therefore, the distribution of sales by quarter in 2022 may not be indicative of the distribution in future years.\nEnvironmental and Other Regulatory Matters\nWe are subject to various federal, state and local environmental laws and regulations concerning, among other things, wastewater discharges, storm water flows, air emissions and solid waste disposal. The labeling, distribution, importation, marketing, and sale of our products are subject to extensive regulation by various federal agencies, including the Federal Trade Commission, Consumer Product Safety Commission and state attorneys general in the United States. Our international operations are also subject to compliance with the U.S. Foreign Corrupt Practices Act (the FCPA) and other anti-bribery laws applicable to our operations.\nThe environmental and other regulations applicable to our business are becoming increasingly stringent, and we incur capital and other expenditures annually to achieve compliance with these environmental standards and regulations. We currently do not expect that the amount of expenditures required to comply with these environmental standards or other regulatory matters will have a material adverse effect on our operations, financial condition or liquidity. There can be no assurance, however, that future changes in federal, state, or local regulations, interpretations of existing regulations or the discovery of currently unknown problems or conditions will not require substantial additional expenditures. Similarly, while we believe that we are currently in compliance with all applicable environmental and other regulatory requirements, the extent of our liability, if any, for past failures to comply with laws, regulations and permits applicable to our operations cannot be determined and could have a material adverse effect on our operations, financial condition and liquidity. Item 1A. Risk Factors\nWe operate in a rapidly changing, highly competitive business environment that involves substantial risks and uncertainties, including, but not limited to, the risks identified below. The following risks, as well as risks described elsewhere in this report or in our other filings with the SEC, could materially affect our business, financial condition or operating results and the value of Company securities held by investors and should be carefully considered in evaluating our Company and the forward-looking statements contained in this report or future reports. The risks described below are not the only risks facing Delta Apparel. Additional risks not presently known to us or that we currently do not view as material may become material and may impair our business operations. Any of these risks could cause, or contribute to causing, our actual results to differ materially from expectations.\nRisks Related to our Strategy\nThe price and availability of purchased yarn and other raw materials is prone to significant fluctuations and volatility. Cotton is the primary raw material used in the manufacture of our apparel products. As is the case with other commodities, the price of cotton fluctuates and is affected by weather, consumer demand, speculation on the commodities market, inflation, the cost of labor and transportation, and other factors that are generally unpredictable and beyond our control. As described under the heading Manufacturing, Sourcing, and Distribution, the price of yarn purchased from Parkdale, our key supplier, is based upon the cost of cotton plus a fixed conversion cost. We set future cotton prices with purchase commitments as a component of the purchase price of yarn in advance of the shipment of finished yarn from Parkdale. Prices are set according to prevailing prices, as reported by the New York Cotton Exchange, at the time we enter into the commitments. Thus, we are subject to the commodity risk of cotton prices and cotton price movements, which could result in unfavorable yarn pricing for us. In the past, the Company, and the apparel industry as a whole, has experienced periods of increased cotton costs and price volatility. By way of example, the price of cotton increased to almost 50% in a five-month period and reached a high of over $1.50 in our fiscal 2022. In some instances, we were unable to pass through these higher costs to our customers, with the gross margins in our Activewear and other businesses negatively impacted as a result. In addition, sudden decreases in the price of cotton and other raw materials may result in the cost of inventory exceeding the cost of new production, which may result in downward selling price pressures, negatively impacting the gross margins in our Activewear and other businesses by significant amounts.\nIn addition, if Parkdales operations are disrupted and Parkdale is not able to provide us with our yarn requirements, we may need to obtain yarn from alternative sources. We may not be able to enter into short-term arrangements with substitute suppliers on terms as favorable as our current terms with Parkdale, which could negatively affect our business. In addition, we may not be able to obtain sufficient quantities of yarn from alternative sources, which could require us to adjust manufacturing levels, negatively impacting our business and results of operations.\nWe also source fabric in Mexico for use in our Campeche, Mexico sew facility, purchase specialized fabrics that we currently do not have the capacity or capability to produce and may purchase other fabrics when it is cost-effective to do so. While these fabrics typically are available from various suppliers, there are times when certain yarns become limited in quantity, causing some fabrics to be difficult to source. This can result in higher prices or the inability to provide products to customers, which could negatively impact our results of operations.\nDyes and chemicals are also purchased from several third-party suppliers. While historically we have not had difficulty obtaining sufficient quantities of dyes and chemicals for manufacturing, the availability of products can change, which could require us to adjust dye and chemical formulations. In certain instances, these adjustments can increase manufacturing costs, negatively impacting our business and results of operations.\nEconomic conditions may adversely impact demand for our products. The apparel industry is cyclical and dependent upon the overall level of demand for soft goods, which may or may not coincide with the overall level of discretionary consumer spending. These levels of demand change as regional, domestic and international economic conditions change. These economic conditions include, but are not limited to, employment levels, energy costs, interest rates, tax rates, inflation, personal debt levels, and uncertainty about the future, with many of these factors outside of our control. Recent distress in global credit markets, rising interest rates, foreign exchange rate fluctuations, significant geopolitical conflicts, volatility in energy prices, constraints on the global supply chain and other factors continue to affect the global economy and adversely impact demand for our products. In 2022, the U.S. experienced significantly heightened inflationary pressures which we expect to continue into 2023. We may not be able to fully mitigate the impact of inflation through price increases, productivity initiatives and cost savings, which could have a material adverse effect on our financial results. In addition, if the U.S. economy enters a recession, we may experience sales declines and may have to decrease prices, all of which could have a material adverse impact on our financial results. Historically, during recessionary periods, the demand for casual and activewear apparel has been strong and our business has performed well. However, there can be no assurances that this correlation will continue in future recessions. Sometimes, the timing of increases or decreases in consumer purchases of soft goods can differ from the timing of increases or decreases in the overall level of economic activity. Weakening sales may require us to reduce manufacturing operations to match our output to demand or expected demand. Reductions in our manufacturing operations may increase unit costs and lower our gross margins, causing a material adverse effect on our results of operations.\nThe apparel industry is highly competitive, and we face significant competitive threats to our business. The market for athletic and activewear apparel and the related accessory and other items we provide is highly competitive and includes many new competitors as well as increased competition from established companies, some of which are larger or more diversified and may have greater financial resources. Many of our competitors also have larger sales forces, stronger brand recognition among consumers, bigger advertising budgets, and greater economies of scale. We compete with these companies primarily on the basis of price, quality, service and brand recognition, all of which are important competitive factors in the apparel industry. Our ability to maintain our competitive edge depends upon these factors, as well as our ability to deliver new products at the best value for the customer, maintain positive brand recognition, and obtain sufficient retail floor space and effective product presentation at retail. If we are unable to compete successfully with our competitors, our business and results of operations will be adversely affected.\nOur success depends, in part, on our ability to predict or effectively react to changing consumer preferences and trends. The success of our businesses depends on our ability to anticipate and respond quickly to changing consumer demand and preferences in apparel and other items we provide. We believe that our brands are recognized by consumers across many demographics and geographies. The popularity for particular products can change significantly from year-to-year based on prevailing fashion trends (particularly in our lifestyle businesses) and on other factors and, accordingly, our ability to adapt to fashion trends in designing products is important to the success of our brands. If we are unable to quickly adapt to changes in consumer preferences in the design of products, our results of operations could be adversely affected. Moreover, because we and our customers project demand for our products based on estimated sales and fashion trends, the actual demand for our products sometimes falls short of what was projected. This can lead to higher inventory levels than desired. Excess inventory levels increase our working capital needs, and sometimes excess inventory must be sold at discounted prices, all of which could have an adverse impact on our business, financial condition and results of operations.\nOur strategy to grow our direct-to-consumer retail business depends upon our ability to successfully open and operate new stores in a timely and cost-effective manner. Our strategy to grow our brick and mortar retail footprint depends on many factors including, among others, our ability to: identify desirable store locations; negotiate acceptable lease terms; hire, train and retain a growing workforce of store managers, sales associates and other personnel; successfully integrate new stores into our existing control structure and operations, including our information technology systems; and coordinate well with our digital platforms and wholesale customers to minimize the competition within our sales channels. As we expand into new geographic areas, we need to successfully identify and satisfy the consumer preferences in these areas. In addition, we need to address competitive, merchandising, marketing, distribution and other challenges encountered in connection with any expansion. Finally, we cannot ensure that any newly-opened stores will be received as well as, or achieve net sales or profitability levels comparable to those of, our existing stores in our estimated time periods, or at all. If our stores fail to achieve, or are unable to sustain, acceptable net sales and profitability levels, our business overall may be materially harmed and we may incur significant costs associated with closing or relocating stores.\nRisks Related to our Operations\nThe COVID-19 pandemic has had, and could continue to have, a material adverse effect our ability to operate, results of operations, financial condition, liquidity, and capital investments. The COVID-19 pandemic has had an adverse effect and could continue to adversely affect our performance, results of operations, financial condition, liquidity, and capital investments. The virus has impacted all regions around the world, resulting in restrictions and shutdowns implemented by national, state, and local authorities. During fiscal 2020, these requirements resulted in temporary closures of all of our branded retail locations and, our manufacturing facilities in El Salvador, Honduras Mexico, and North Carolina. Throughout fiscal years 2022 and 2021, the vast majority of our branded retail locations and manufacturing facilities have continued to operate.\nMany of our customers and suppliers also face these and other challenges, which has resulted in ongoing supply chain and logistic constraints, closure of certain third-party manufacturers and increased freight cost at various stages of the pandemic. Any further material temporary or long-term disruption in our supply chain could lead to reduced demand for our products and services and could impair our customers' ability to pay all or portion of the amounts owed to us. We rely on suppliers and third-parties to deliver raw materials and transport our finished goods. Prolonged inventory shortages may result in significant lost business or delay in shipments which could have a material adverse effect on our results of operations and financial condition.\nThe extent to which COVID-19 impacts our business will depend on future developments, which are highly uncertain and cannot be predicted, including the ultimate duration, severity and sustained geographic resurgence of the virus, the emergence of new variants and strains of the virus, and the success of actions to contain the virus and its variants, or treat its impact. The COVID-19 pandemic has and will likely continue to result in social, economic, and labor instability in the countries in which we, or the third parties with whom we engage, operate. The long-term economic impact and near-term financial impacts of the COVID-19 pandemic, including but not limited to, possible impairment, restructuring, and other charges, as well as overall impact on our business, results of operations, financial condition, liquidity, or capital resources and investments, cannot be reliably quantified or estimated at this time due to the uncertainty of future developments.\nOur operations are subject to political, social, and economic risks in Honduras, El Salvador and Mexico. The majority of our products are manufactured in Honduras, El Salvador and Mexico, with concentrations in Honduras and El Salvador. These countries from time-to-time experience political, social and economic instability, and we cannot be certain of their future stability. Instability in a country can lead to protests, riots and labor unrest. Governments have changed, and may continue to change, and employment, wage and other laws and regulations may change, thereby increasing our costs to operate in those countries. Any of these political, social, or economic events or conditions could disrupt our supply chain or increase our costs, adversely affecting our financial position and results of operations. For example, in fiscal years 2021 and 2022, our operations in and around San Pedro Sula, Honduras, were partially disrupted by the protests and strikes related to increasing fuel costs and the impact related to higher ticket prices on public transportation. These disruptions temporarily restricted the ability of our employees and suppliers to access our manufacturing facilities as well as our ability to ship products from our facilities, and negatively impacted our operations from a cost standpoint.\nIf we experience disruptions or interruptions within any of our facilities, operations, or distribution networks, we may be unable to deliver our products to the market and may lose sales and customers. We own or lease manufacturing facilities in the United States, Honduras, Mexico and El Salvador. We also own or lease distribution facilities located throughout the United States and maintain inventory at certain third-party locations. Any casualty or other circumstance that damages or destroys any of these material facilities or significantly limits their ability to function could have a material adverse effect on our business. Similarly, any significant interruption in the operation of any of these facilities or our related sourcing and transportation logistics functions, whether within or outside of our control, may delay shipment of merchandise to our customers, potentially damaging our reputation and customer relationships and causing a loss of revenue. Moreover, in the event of a regional disruption where we manufacture our products, we may not be able to shift our operations to a different geographic region, and we may have to cease or curtail our operations in a selected area. This may cause us to lose sales and customers. The types of disruptions that may occur include foreign trade disruptions, import restrictions, labor disruptions, embargoes, government intervention, natural disasters, regional or global pandemics and political disruptions such as those referenced in the immediately-preceding risk section. In addition, if we are unable to successfully coordinate the planning of inventory across these facilities and the related distribution activities, it could have a material adverse effect on our business, financial condition and results of operations.\nThe talents and continued contributions of our key management are important to our success. We believe our future success depends on our ability to retain and motivate our key management, our ability to attract and integrate new members of management into our operations, and the ability of all personnel to work together effectively as a team and to execute our business strategy. Our inability to accomplish any of these goals could have a material adverse effect on our results of operations.\nWe rely on third parties to provide us with certain key equipment and services for our business. If any of these third parties fails to perform their obligations to us or declines to provide properly functioning equipment or services to us in the future, we may suffer a disruption to our business. We rely on certain key equipment and services provided by various third parties, including logistics partners and equipment suppliers. For example, we rely on third parties to provide certain inbound and outbound transportation and delivery services and other third parties to provide us with key equipment to support our manufacturing and fulfillment platforms, including our DTG2Go digital platform. If any of these or other third parties fails to perform their obligations to us or declines to provide properly functioning equipment or services to us in the future, we may suffer a disruption to our business or increased costs. Furthermore, we may be unable to implement substitute arrangements on a timely and cost-effective basis on terms favorable to us.\nEnergy, fuel and related costs are prone to significant fluctuations and volatility, which could adversely affect our results of operations. Our manufacturing operations require high inputs of energy, and therefore changes in energy prices directly impact our gross profits. In addition, we incur significant freight costs to transport goods between our offshore facilities and the United States, along with transportation expenses to ship products to our customers. The cost of energy and fuel fluctuates due to a number of factors outside of our control, including government policy and regulation, supply disruptions, inflation, and weather conditions. Many of these factors impacted such cost in fiscal year 2022 and are expected to have an impact in the near term. We continue to focus on methods that will reduce the amount of energy used in the manufacture of products to mitigate risks of fluctuations in the cost of energy. However, significant increases in energy and fuel prices, may have a material adverse effect on our financial position and results of operations, especially if such increases make us less competitive compared to others in the industry.\nOur business operations rely on our information systems and any material disruption or slowdown of our systems could cause operational delays, reputational harm, or loss of revenue. We depend on information systems to, among other things, manage our inventory, process transactions, operate our websites, respond to customer inquiries, purchase, sell and ship goods on a timely basis, and maintain cost-effective operations. Management uses information systems to support decision-making and to monitor business performance. If we experience any disruptions or slowdowns with our information systems, we may fail to generate accurate and complete financial and operational reports essential for making decisions at various levels of management, which could lead to decisions being made that have adverse results. We have invested significant capital and expect future capital expenditures associated with the implementation and integration of our information technology systems across our businesses. This process involves the replacement and consolidation of technology platforms so that our businesses are served by fewer platforms, resulting in operational efficiencies and reduced costs. Our inability to effectively implement or convert our operations to the new systems could cause delays in product fulfillment and reduced efficiency in our operations. Further, if changes in technology cause our information systems to become obsolete, or if our information systems are inadequate to handle our growth, we could lose customers. We are also subject to risks and uncertainties associated with the internet, including changes in required technology interfaces, website downtime and other technical failures. Our failure to successfully respond to these risks and uncertainties could reduce sales, increase costs and damage the reputation of our brands. In addition, we interact with many of our customers through our websites. Customers increasingly utilize our online platforms to purchase our merchandise. If we are unable to continue to provide consumers a user-friendly experience and evolve our platforms to satisfy consumer preferences, the growth of our ecommerce and other businesses and our sales may be negatively impacted. If our websites contain errors or other vulnerabilities which impede or halt service, it could result in damage to our brands images and a loss of revenue. In addition, we may experience operational problems with our information systems as a result of system failures, \"cyber-attacks,\" computer viruses, security breaches, disasters or other causes. Any material disruption or slowdown of our information systems could cause operational delays and increased costs that could have a material adverse effect on our business and results of operations.\nCompromises of our data security could lead to liability and reputational damage. In the ordinary course of our business, we often collect, retain, transmit, and use sensitive and confidential information regarding customers and employees, and we process customer payment card and check information. There can be no assurance that we will not suffer a data compromise, that unauthorized parties will not gain access to personal information, or that any such data compromise or access will be discovered in a timely manner. Further, the systems currently used for transmission and approval of payment card transactions, and the technology utilized in payment cards themselves, all of which can put payment card data at risk, are determined and controlled by the payment card industry, not by us. Our computer systems, software and networks may be vulnerable to breaches (including via computer hackings), unauthorized access, misuse, computer viruses, phishing or other failures or disruptions that could result in disruption to our business or the loss or theft of confidential information, including customer information. Any failure, interruption, or breach in security of these systems, could result in the misappropriation of personal information, payment card or check information or confidential business information of our Company. In addition, there may be non-technical issues, such as our employees, contractors or third parties with whom we do business or to whom we outsource business operations may attempt to circumvent our security measures in order to misappropriate such information, and may purposefully or inadvertently cause a breach involving such information.\nThe methods used by third parties to obtain unauthorized access change frequently and may not be anticipated or immediately detected. Thus, despite the security measures we may have in place, an actual or perceived information security breach, whether due to \"cyber-attack,\" computer viruses or other malicious software code, or human error or malfeasance, could occur. Actual or anticipated attacks may cause us to incur significant costs to rectify the consequences of the security breach or cyber-attack, including costs to deploy additional personnel and protection technologies, repair damage to our systems, train employees and engage third-party experts and consultants. The collection, retention, transmission, and use of personal information is subject to contractual requirements and is highly regulated by a multitude of state, federal, and foreign laws. Privacy and information security laws are complex and constantly changing. Compliance with these laws and regulations may result in additional costs due to new systems and processes, and our non-compliance could lead to legal liability. Any compromise of our customer, employee or company data, failure to prevent or mitigate the loss of personal or business information, or delay in detecting or providing prompt notice of any such compromise could attract media attention, damage our customer or other business relationships and reputation, result in lost sales, fines, liability for stolen assets or information, costs of incentives we may be required to offer to our customers or business partners to retain their business, significant litigation or other costs and involve the loss of confidential company information, any or all of which could have a material adverse effect on our business, financial condition and results of operations.\nExtreme weather conditions, natural disasters, and other catastrophic events, including those caused by climate change, could negatively impact our results of operations and financial condition. Extreme weather conditions in the areas in which our manufacturing facilities, retail stores, suppliers, customers, distribution centers, data centers, and offices are located could adversely affect our results of operations and financial condition. Moreover, natural disasters such as earthquakes, hurricanes, floods, or wildfires, public health crises, such as pandemics and epidemics (including, for example, the COVID-19 pandemic), political crises, such as terrorist attacks, war and other political instability, or other catastrophic events, whether occurring in the United States or abroad, and their related consequences and effects, including energy shortages, could disrupt our operations, the operations of our suppliers or customers or result in economic instability that could negatively impact customer spending, any or all of which would negatively impact our results of operations and financial condition. In addition, fire and other natural disasters such as hurricanes, earthquakes, or floods have occurred and can recur in the countries in which we operate. These types of events could impact our global supply chain, including the ability of suppliers to provide raw materials where and when needed, the ability of third parties to ship merchandise, and our ability to ship products from or to the impacted region(s).\nIn addition, climate change and the increased focus by governments, organizations, customers, and investors on sustainability issues, including those related to climate change and socially responsible activities, may adversely affect our reputation, business, and financial results. Investor advocacy groups, certain institutional investors, investment funds, other market participants, shareholders, and stakeholders have focused increasingly on environmental, social, and governance, or ESG, and related sustainability practices of companies. These parties have placed increased importance on the implications of the social cost of their investments. If our ESG practices do not meet investor or other stakeholder expectations and standards (which are continually evolving and may emphasize different priorities than the ones we choose to focus on), then our brand, reputation, and potential employee retention may be negatively impacted. We could also incur additional costs and require additional resources to monitor, report, and comply with various ESG practices and regulations. Also, our failure, or perceived failure, to manage reputational threats and meet expectations with respect to socially responsible activities and sustainability commitments could negatively impact our brand credibility, employee retention, and the willingness of our customers and suppliers to do business with us.\nRisks Related to Legal and Regulatory Matters\nChanges in U.S. or other tax laws or regulations may cause us to incur additional tax liability. We are subject to income tax in the United States and in certain foreign jurisdictions where we generate net operating profits. We generally benefit from a lower overall effective income tax rate due to the majority of our manufacturing operations being located in foreign tax-free jurisdictions or foreign jurisdictions with tax rates that are lower than those in the United States. Our U.S. legal entity contracts with our foreign subsidiaries to manufacture products on its behalf, with the intercompany prices paid for the manufacturing services and manufactured products based on an arms-length standard and supported by an economic study.\nThe December 22, 2017, Tax Cuts and Jobs Act of 2017 (the New Tax Legislation) significantly revised the U.S. corporate income tax code by, among other things, lowering federal corporate income tax rates, implementing a modified territorial tax system and imposing a repatriation tax (\"transition tax\") on deemed repatriated cumulative earnings of foreign subsidiaries. In addition, new taxes were imposed related to foreign income, including a tax on global intangible low-taxed income (\"GILTI\") as well as a limitation on the deduction for business interest expense (\"Section 163(j)\"). GILTI is the excess of the shareholder's net controlled foreign corporations (CFCs) net tested income over the deemed tangible income. The Section 163(j) limitation does not allow the amount of deductible interest to exceed the sum of the taxpayer's business interest income, of 30% of the taxpayer's adjusted taxable income. The Coronavirus Aid, Relief, and Economic Security Act (CARES Act), which was enacted on March 27, 2020, provided temporary changes to income and non-income-based tax laws, including some provisions which were previously enacted under the New Tax Legislation. The CARES Act revised the U.S. corporate income tax code on a temporary basis by, among other things, eliminating the 80% of taxable income limitation on net operating loss (NOL) carryforwards, allowing NOL carrybacks, and increasing the Section 163(j) interest limitation deduction from 30% to 50% of adjusted taxable income.\nOur effective tax rate could be adversely affected by changes in the mix of earnings between the U.S. and tax-free or lower-tax foreign jurisdictions. We may be limited in our ability to deduct 50% of applicable foreign earnings under the GILTI income inclusion or to deduct U.S. interest expense based on the amount of U.S. taxable income earned in a particular fiscal year. In addition, the future impact of the CARES Act and New Tax Legislation may differ from historical amounts, possibly materially, due to, among other things, changes in interpretations and assumptions made regarding the CARES Act and New Tax Legislation, guidance that may be issued, and actions we may take as a result of the CARES Act and New Tax Legislation.\nFurther changes to U.S. tax laws impacting how U.S. multinational corporations are taxed on U.S. and foreign earnings, including any potential increase in the U.S. corporate income tax rate, the doubling of the rate of tax on certain earnings of foreign subsidiaries, and a 15% minimum tax on worldwide book income, among other things, could have a material adverse effect on our tax expense and cash flow.\nWe are subject to periodic litigation in both domestic and international jurisdictions that may adversely affect our financial condition and results of operations. From time to time, we may be involved in legal or regulatory actions regarding product liability, employment practices, intellectual property infringement, bankruptcies and other litigation or enforcement matters. Due to the inherent uncertainties of litigation in both domestic and foreign jurisdictions, we cannot accurately predict the ultimate outcome of any such proceedings. These proceedings could cause us to incur costs and may require us to devote resources to defend against these claims and could ultimately result in a loss or other remedies such as product recalls, which could adversely affect our financial condition and results of operations. For a description of current material legal proceedings, see Part I, Item 3, Legal Proceedings.\nProduct liability issues could lead to recalls, claims and negative publicity, and adversely affect our results of operations. Our operations are subject to certain product liability risks common to most brands and manufacturers and our ability to maintain consumer confidence in the safety and quality of our products is vital to our success. We have implemented product safety and quality programs and standards that we follow and we expect our supplier partners to strictly adhere to applicable requirements and best practices. In addition to selling apparel and accessory products, we participate in a joint venture involving the sale of a branded alcoholic beverage, and we also license one of our brands for use in connection with restaurant, food and beverage services. Selling products intended for human consumption carries inherent risks and uncertainties. If we or our supplier or license partners fail to comply with applicable product safety and quality standards and our products or those otherwise associated with our brands are, or become, unsafe, non-compliant, contaminated or adulterated, we may be required to recall our products and encounter product liability claims and negative publicity. Any of these events could adversely affect our reputation, business or results of operations.\nWe rely on the strength of our trademarks and could incur significant costs to protect these trademarks and our other intellectual property. Our trademarks, including Salt Life®, Soffe®, Intensity Athletics®, Kudzu®, Pro Weight®, Magnum Weight®, and the Delta Design, among others, are important to our marketing efforts and have substantial value. We aggressively protect these trademarks and have incurred legal costs in the past to establish and protect these trademarks. We may in the future be required to expend significant additional resources to protect these trademarks and our other intellectual property. Intellectual property litigation may be costly and may divert management's attention from the operation of our business. Adverse determinations in any litigation may result in the loss of our proprietary rights, subject us to significant liabilities or require us to seek licenses from third parties, which may not be available on commercially reasonable terms, if at all. Any of these outcomes may have a material adverse effect on our financial condition, results of operations or cash flows.\nSignificant changes to international trade regulations could adversely affect our results of operations. The majority of our products are manufactured in Honduras, El Salvador and Mexico. We therefore benefit from current free trade agreements and other duty preference programs, including the U.S.-Mexico-Canada Agreement (USMCA), and the Central America Free Trade Agreement (CAFTA). Our claims for duty free or reduced duty treatment under CAFTA, USMCA and other available programs are largely conditioned on our ability to produce or obtain accurate records (some of which are provided to us by third parties) about production processes and sources of raw materials. Trade partnerships and treaties can be subjected to negotiations and modifications by domestic and foreign governments, which could result in new or increased tariffs on goods we import into the United States. Subsequent repeal or further modification of USMCA or CAFTA, further increases to tariffs on goods imported into the United States, or the inadequacy or unavailability of supporting records, could have a material adverse effect on our results of operations.\nIn addition, our products are subject to foreign competition, which in the past has been faced with significant U.S. government import restrictions. The extent of import protection afforded to domestic apparel producers has been, and is likely to remain, subject to political considerations. The reduction or elimination of import protections for domestic apparel producers could significantly increase global competition, which could adversely affect our business and results of operations.\nOur failure to comply with trade and other regulations could lead to investigations or actions by government regulators and negative publicity. The labeling, distribution, importation, marketing, and sale of our products are subject to extensive regulation by various federal agencies, including the Federal Trade Commission, Consumer Product Safety Commission and state attorneys' general in the United States. Any failure to comply with such regulations could cause us to become subject to investigation and enforcement actions resulting in significant penalties or claims or in our inability to conduct business, adversely affecting our results of operations.\nOur international operations are also subject to compliance with the U.S. Foreign Corrupt Practices Act (the FCPA) and other anti-bribery laws applicable to our operations. In many foreign countries, particularly in those with developing economies, it may be a local custom that businesses operating in such countries engage in business practices that are prohibited by the FCPA or other U.S. and foreign laws and regulations applicable to us. Although we have implemented procedures designed to ensure compliance with the FCPA and similar laws, some of our agents or other channel partners, as well as those companies to which we outsource certain of our business operations, could take actions in violation of our policies. Any such violation could have a material and adverse effect on our business.\nChanges in domestic or foreign employment regulations, changes in our relationship with our employees, and changes in our ability to attract and retain employees could adversely affect our results of operations. As of October 1, 2022, we employed approximately 8,600 employees worldwide, with approximately 7,500 of these employees located in Honduras, El Salvador and Mexico. Changes in domestic and foreign laws and regulations governing our relationships with our employees, including wage and human resources laws and regulations, labor standards, overtime pay, unemployment tax rates, workers' compensation rates, and payroll taxes could impact our relationship with our employees and adversely impact the productivity and ultimate cost of our manufacturing operations. A total of approximately 2,600 employees at two of our facilities in San Pedro Sula, Honduras, are party to multi-year collective bargaining agreements. We have historically conducted our operations without significant labor disruptions and believe that our relations with our employees are generally good. However, a change in labor relations could adversely affect the productivity and ultimate cost of our manufacturing operations.\nOur business is dependent on attracting and retaining a large number of quality employees with staffing needs especially high during the holiday season. Competition for personnel is highly competitive, and there is no assurance we will be able to attract and retain a sufficient number of qualified personnel in future periods. Our ability to meet our labor needs is subject to many factors, such as prevailing wage rates, minimum wage legislation, unemployment levels, and actions by our competitors in compensation levels. Wage rates have recently increased significantly in the U.S. and wage increases have also occurred in foreign countries in which we operate. Any further significant increases in wage rates in these countries in which we operate could have a material adverse impact on our operating results. In addition, changes in federal, state, or local laws and regulations relating to employee benefits, including, but not limited to, sick time, paid time off, leave of absence, wage-and-hour, overtime, and meal-and-break time could cause us to incur additional costs. Competitive and regulatory pressures have already significantly increased our labor costs and we may be unable to fully pass these costs to our customers through increased selling prices, which could deteriorate our profitability. In addition, further changes that hurt our ability to attract and retain personnel could adversely affect our results of operations in the future.\nThe value of our brands, sales of our products and our licensing relationships could be impacted by negative publicity resulting from violations of manufacturing or employee safety standards or labor laws, or unethical business practices, by our suppliers and independent contractors. We are committed to ensuring that all of our manufacturing facilities comply with our strict internal code of conduct, applicable laws and regulations, and the codes and principles to which we subscribe. In addition, we require our suppliers and independent contractors to operate their businesses in compliance with the laws and regulations that apply to them. However, we do not control these suppliers and independent contractors. A violation of our policies, applicable manufacturing or employee safety standards and codes of conduct, labor laws or other laws or regulations by our suppliers or independent contractors could interrupt or otherwise disrupt our operations. Negative publicity regarding the production or operating methods of any of our suppliers or independent contractors or their failure to comply with our policies, applicable manufacturing or employee safety standards and codes of conduct, labor laws or other laws or regulations could adversely affect our reputation, brands, sales and licensing relationships, which could adversely affect our business and results of operations.\nRisks Related to Financial Matters\nWe may be restricted in our ability to borrow under our revolving credit facility or service our indebtedness. Significant operating losses or significant uses of cash in our operations could cause us to default on our asset-based revolving credit facility. We rely on our credit facility, as well as on cash generated by our operations, to fund our working capital and capital expenditure needs, to make acquisitions, to fund repurchases under our share repurchase program and to pay dividends should we choose to do so in the future. Our working capital needs are generally greater in advance of the spring and summer selling seasons. Availability under our credit facility is primarily a function of the levels of our accounts receivable and inventory, as well as the uses of cash in our operations. A significant deterioration in our accounts receivable or inventory levels could restrict our ability to borrow additional funds or service our indebtedness. Cash on hand and availability under our U.S. revolving credit facility totaled $34.6 million at October 1, 2022, well above the minimum thresholds specified in our credit agreement. In addition, we were above our credit facility's 1.0 fixed charge coverage ratio (\"FCCR\") threshold for the preceding 12-month period. A significant deterioration in our business could cause our availability to fall below minimum thresholds, thereby requiring us to maintain the minimum FCCR specified in our credit agreement, which we may not be able to maintain. The covenants in our credit facility include, among other things, limitations on asset sales, consolidations, mergers, liens, indebtedness, loans, investments, guaranties, acquisitions, dividends, stock repurchases, and transactions with affiliates. If an event of default under our credit facility occurred or became imminent, we may request our credit agreement lenders to provide a waiver. If we were unsuccessful in that endeavor, we could explore alternative sources of capital, whether debt or equity, which would likely be more expensive than the costs we incur under our credit facility and may not be available. If we were unable to cure an un-waived event of default under our credit facility, we would be unable to borrow additional amounts under the facility, we could be unable to make acquisitions, fund share repurchases or pay dividends, and our lenders thereunder could accelerate our obligations under the agreement and foreclose on our assets subject to the liens in their favor. This circumstance would have a material adverse effect on our financial position and results of operations.\nDeterioration in the financial condition of our customers or suppliers and changes in the operations and strategies of our customers or suppliers could adversely affect our financial position and results of operations. We extend credit to our customers, generally without requiring collateral. The extension of credit involves considerable judgment and is based on an evaluation of each customers financial condition and payment history. We monitor credit risk exposure by periodically obtaining credit reports and updated financial statements on our customers. Deterioration in the economy, declines in consumer purchases of apparel, disruption in the apparel retail environment, or the inability of our customers to access liquidity could have an adverse effect on the financial condition of our customers. During the past several years, various retailers and other customers have experienced significant difficulties, including consolidations, restructurings, bankruptcies and liquidations as well as retail shutdowns as a result of the COVID-19 pandemic. The inability of retailers and other customers to overcome these difficulties may continue or even increase due to the current economic and retail market conditions. We maintain an allowance for doubtful accounts for potential credit losses based upon current conditions, historical trends, estimates and other available information, which involves judgments and uncertainties. During fiscal year 2022, customers generally paid on the credit extended to them, and we ended fiscal year 2022 with days sales outstanding at 51.7 days, up from 47.4 days at September 2021. Although our historical allowances have been materially accurate, if market conditions change, additional reserves may be required. The inability to collect on sales to significant customers or a group of customers could have a material adverse effect on our financial condition and results of operations. Significant changes in the financial condition of any of our suppliers or other parties with which we do business could result in disruption to our business and have a material adverse effect on our financial condition and results of operations.\nIn addition, significant changes in the retail, merchandising and/or operational strategies employed by our customers may result in decreased sales of our products to such customers and could have a material adverse effect on our financial condition and results of operations. Likewise, significant changes in the operations of any of our suppliers or other parties with which we do business could result in disruption to our business and have a material adverse effect on our financial condition and results of operations.\nOur variable rate debt subjects us to interest rate risk that could cause our debt service obligations to increase significantly. The debt we incur under our asset-based revolving credit facility is at variable rates of interest, which exposes us to interest rate risk. Reference rates used to determine the applicable interest rates for our variable rate debt began to rise significantly in the second half of fiscal 2022. If interest rates continue to increase, the debt service obligations on such indebtedness will continue to increase even if the amount borrowed remains the same, and our net income and cash flows, including cash available for servicing our indebtedness, will correspondingly decrease. In addition, as a result of our latest debt amendment certain of the variable rate indebtedness extended to us uses the Secured Overnight Financing Rate (SOFR) as a benchmark for establishing the interest rate. While we believe we will continue to use SOFR through fiscal 2022 and into fiscal 2023, other factors may impact SOFR including factors causing SOFR to cease to exist, new methods of calculating SOFR to be established, or the use of an alternative reference rate(s). These consequences are not entirely predictable and could have an adverse impact on our financing costs, returns on investments, valuation of derivative contracts and our financial results.\nWe may need to raise additional capital to grow our business. The rate of our growth, especially through acquisitions, depends, in part, on the availability of debt and equity capital. We may not be able to raise capital on terms acceptable to us or at all. If new sources of financing are required, but are insufficient or unavailable, we may be required to modify our growth and operating plans based on available funding, which could adversely affect our ability to grow the business.\nWe may be subject to the impairment of acquired intangible assets. When we acquire a business, a portion of the purchase price of the acquisition may be allocated to goodwill and other identifiable intangible assets. The amount of the purchase price that is allocated to goodwill is determined by the excess of the purchase price over the net identifiable assets acquired. At September 2022 and September 2021, our goodwill and other intangible assets were approximately $61.9 million and $64.2 million, respectively. We conduct an annual review, and more frequent reviews if events or circumstances dictate, to determine whether goodwill is impaired. We also determine whether impairment indicators are present related to our identifiable intangible assets. If we determine that goodwill or intangible assets are impaired, we would be required to write down the value of these assets. We complete our annual impairment test of goodwill on the first day of our third fiscal quarter. For fiscal year 2022, we concluded based on the assessment performed that there was no indication of impairment on the goodwill recorded on our financial statements. We also concluded that there are no additional indicators of impairment related to our intangible assets. There can, however, be no assurance that we will not be required to take an impairment charge in the future, which could have a material adverse effect on our results of operations.\nWe are subject to foreign currency exchange rate fluctuations. We manufacture the majority of our products outside of the United States, exposing us to currency exchange rate fluctuations. In addition, movements in foreign exchange rates can affect transaction costs because we source products from various countries. We may seek to mitigate our exposure to currency exchange rate fluctuations but our efforts may not be successful. Accordingly, changes in the relative strength of the United States dollar against other currencies could adversely affect our business.\nThe market price of our shares is affected by the illiquidity of our shares, which could lead to our shares trading at prices that are significantly lower than expected. Various investment banking firms have informed us that public companies with relatively small market capitalizations have difficulty generating institutional interest, research coverage, and trading volume. This illiquidity can translate into price discounts as compared to industry peers or to the shares inherent value. We believe that the market perceives us to have a relatively small market capitalization. This has led and could continue to lead to our shares trading at prices that are significantly lower than our estimate of their inherent value.\nAs of November 14, 2022, we had 6,915,663 shares of common stock outstanding. We believe that approximately 37% of our stock is beneficially owned by entities and individuals who each own more than 5% of the outstanding shares of our common stock. Institutional investors that each beneficially own more than 5% of the outstanding shares collectively own approximately 25% of the outstanding shares of our common stock. Sales of substantial amounts of our common stock in the public market by any of these large holders could adversely affect the market price of our common stock, especially in light of the limited trading volumes.\nThe market price of our shares may be highly volatile, and the stock market in general can be highly volatile. Fluctuations in our stock price may be influenced by, among other things, general economic and market conditions, conditions or trends in our industry, changes in the market valuations of other apparel companies, announcements by us or our competitors of significant acquisitions, strategic partnerships or other strategic initiatives, and trading volumes. Many of these factors are beyond our control, but may cause the market price of our common stock to decline, regardless of our operating performance. Item 1B. Unresolved Staff Comment\nNone. Item 2. Properties\nOur principal executive office is located in a leased facility in Duluth, Georgia. We own and lease properties supporting our manufacturing, distribution, direct retail, and administrative activities. The majority of our products are manufactured through a combination of facilities that we either own or lease and operate. The following listing summarizes the significant categories as of September 2022:\nOwned\nLeased\nOther\nTotal\nManufacturing\n-\nDistribution\nDecoration/distribution\nRetail stores/showroom\n-\nOffices\n-\n-\nTotal\nOur primary manufacturing locations as of September 2022, are as follows:\nName\nLocation\nUtilization\nSegment\nCeiba Textiles\nNaco, Quimistan, Santa Barbara Honduras\nKnit/dye/finish/cut\nDelta Group\nHonduras Plant\nSan Pedro Sula, Honduras\nSew\nDelta Group\nCortes Plant\nSan Pedro Sula, Honduras\nSew\nDelta Group\nCampeche Plant\nSeybaplaya, Campeche Mexico\nCut/sew\nDelta Group/Salt Life Group\nCampeche Sportswear\nCampeche, Mexico\nDecoration\nDelta Group/Salt Life Group\nTextiles LaPaz\nLa Paz, El Salvador\nCut/sew/decoration\nDelta Group\nFayetteville Plant\nFayetteville, North Carolina\nCut/sew/decoration\nDelta Group/Salt Life Group\nRowland Plant\nRowland, North Carolina\nSew\nDelta Group\nAs of September 2022 and 2021, our long-lived assets in Honduras, El Salvador and Mexico collectively encompassed approximately 27% and 25%, respectively, of our consolidated net property, plant and equipment, of which 18% was in Honduras. See Item 1A. Risk Factors for a description of risks associated with our operations located outside of the United States.\nOur primary distribution centers, including those integrated with decoration operations, as of September 2022, are as follows:\nLocation\nUtilization\nSegment\nClinton, TN\nDistribution\nDelta Group\nFayetteville, NC\nDistribution\nSalt Life Group\nHebron, OH\nDistribution\nDelta Group\nOpelika, AL\nDistribution\nDelta Group\nClearwater, FL\nDecoration/distribution\nDelta Group\nCranbury, NJ\nDecoration/distribution\nDelta Group\nFayetteville, NC\nDecoration/distribution\nDelta Group\nLewisville, TX\nDecoration/distribution\nDelta Group\nMiami, FL\nDecoration/distribution\nDelta Group\nNashville, TN\nDecoration/distribution\nDelta Group\nPhoenix, AZ\nDecoration/distribution\nDelta Group\nStorm Lake, IA\nDecoration/distribution\nDelta Group\nWe believe that all of our facilities are suitable for the purposes for which they are designed and are generally adequate to allow us to remain competitive. We continue to maintain a sharp focus on improving our supply chain, lowering our product costs and reducing the operating capital required in our business. We will continue to take the necessary actions to balance capacities with demand as needed. Substantially all of our assets are subject to liens in favor of our lenders under our U.S. asset-based secured credit facility, our Honduran credit facility, and our Salvadoran credit facility. ITEM 3. Legal Proceedings\nAt times, we are party to various legal claims, actions and complaints. There are currently no material pending legal proceedings to which we are a party or of which any of our property is subject, and we are not aware of any such proceedings that are contemplated by any governmental authority. Item 4. Mine Safety Disclosures\nNot applicable.\nPart II Item 5. Market for Registrant's Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities\nMarket Information for Common Stock: The common stock of Delta Apparel, Inc. is listed and traded on the NYSE American under the symbol DLA. As of November 14, 2022, there were approximately 782 record holders of our common stock.\nDividends: Our Board of Directors did not declare, nor were any dividends paid, during 2022 or 2021. Subject to certain restrictions, our credit facility allows stock repurchases and cash dividends from two sources: (1) legally available funds other than cash from certain sale/leaseback transactions, (2) legally available funds solely from certain recent sale/leaseback transactions. In each case, at least 15% of the maximum revolver amount and borrowing base must be available both for 30 days before the transaction and after giving effect to it. There is also a restriction on the total amount of such payments from April 3, 2016 to the date of determination. For payments from funds other than sale/lease backs, the amount is $10,000,000 plus 50% of net income since April 3, 2016. For payments solely from sale/leasebacks, the amount is limited to $10,000,000 since April 3, 2016. Also, payments from sale/leasebacks must be in excess of the subject real propertys contribution to the borrowing base. Subsidiaries of the Borrowers (as defined in the credit facility) are not subject to these restrictions on dividends to the Borrowers. At September 2022, and September 2021, there was $24.9 million and $19.0 million, respectively, of retained earnings free of restrictions to make cash dividends or stock repurchases. Any future cash dividend payments will depend upon our earnings, financial condition, capital requirements, compliance with loan covenants and other relevant factors.\nPurchases of our Own Shares of Common Stock: See Note 14- Repurchase of Common Stock - Debt, in Item 15, which is incorporated herein by reference.\nSecurities Authorized for Issuance Under Equity Compensation Plans: The information required by Item 201(d) of Regulation S-K is set forth under Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters of this Annual Report, which information is incorporated herein by reference. Item 6. Reserved Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nFinancial measures included herein have been presented on a generally accepted accounting principles (\"GAAP\") basis.\nBusiness Outlook\nFiscal year 2022 marked another year of strong organic growth for Delta Apparel and highlighted the collective reach of our multiple go-to-market strategies. The combination of our vertically integrated manufacturing and service platforms with our diversified distribution allowed us to successfully navigate what was a dynamic business and economic environment throughout the year. All five of our market channels - Delta Direct, Global Brands, Retail Direct, DTG2Go, and Salt Life - delivered year-over-year sales increases and drove overall sales growth of 11%. For the year, we achieved a 6.6% operating margin on $484.7 million in net sales, and earnings of $2.80 per diluted share.\nOur Delta Group segments fully integrated Activewear and DTG2Go businesses continue to offer solutions to a broadening spectrum of customers across the apparel industry. Our Activewear business is organized around three key customer channels - Delta Direct, Global Brands, and Retail Direct - that are distinct in their market approaches and customer bases. Our Delta Direct channel offers the screen print, promotional, eRetailer and retail licensing markets a broad portfolio of apparel and accessories under the Delta, Delta Platinum, and Soffe brands, including basic, performance, fashion basic and other elevated product offerings, as well as sourced items from select third party brands.\nOur Global Brands channel serves as a key supply chain partner to large multi-national brands, providing services ranging from custom product development to value-added retail-ready enhancements, and our Retail Direct channel provides our portfolio of Delta, Delta Platinum, and Soffe products with value-added retail-ready enhancements directly to the brick and mortar retail locations and ecommerce fulfillment centers of a customer base ranging from sporting goods and outdoor retailers, specialty and resort shops, and farm and fleet stores to department stores and mid-tier retailers. Our onshore and nearshore manufacturing and fulfillment platforms, coupled with a distribution network spanning the United States, continue to become more integral to brand and retailer sourcing strategies and generate new interest from customers looking to reach the United States market more efficiently and manage supply chain risks associated with international trade policy, ESG priorities, inflationary pressures, and supply chain disruptions.\nOur DTG2Go business and its leadership position in digital print and fulfillment give us the unique ability to offer customers across all of our channels a seamless make-on-demand solution. DTG2Go continues to grow through its digital first strategy, achieving strong double-digit sales growth in fiscal year 2022, including increased units and revenue. More and more customers across the apparel industry see the compelling economics of DTG2Gos digital make-on-demand model as a desirable alternative to traditional make-to-forecast models, particularly when integrated with our Delta Direct channels vertical supply of blank garments.\nProfitability at DTG2Go was impacted during the year by additional costs for equipment to further its digital first model and the tight domestic labor market, but we expect operating margins to improve materially over time. We see more exciting growth potential at DTG2Go going forward as the apparel industry migrates more towards the DTG2Go model, selling prices continue to grow, and we increase our output to meet elevating demand.\nOur Delta Group segment achieved significant overall growth for the year even as demand between its various market channels shifted, with strong order flow in our Global Brands and DTG2Go channels helping to offset slowness in our Delta Direct channel to end the year. Our Delta Direct channel was heavily impacted by strong inflationary pressures on both input and labor costs that resulted in some downward pressure on gross margins in the second half of year. We expect this market fluidity and inflationary cost environment to continue in fiscal year 2023, and we will continue to leverage the flexibility of our vertical platform and adjust production levels to manage inventory, mitigate higher input costs, and stay aligned with customer demand.\nOur Salt Life Group segment continued to excel in fiscal year 2022, producing record revenues of $60.3 million and a strong double-digit sales increase of 21% percent over the prior year. Growing consumer awareness and engagement with the Salt Life lifestyle brand, together with the Salt Life teams ability to manage supply chain issues and shipping delays, culminated in organic growth across all three Salt Life omnichannel markets - wholesale, retail, and ecommerce - in the fourth quarter of fiscal year 2022. We look for that growth trend to continue in fiscal year 2023.\nWith the milestone achievement of eight new store openings in fiscal year 2022, there are now 21 Salt Life branded retail doors open for business across the United States coastline from Southern California to Key West and up the eastern seaboard to Rehoboth Beach, Delaware. We expect to continue to expand Salt Lifes retail footprint with six to eight planned store openings in 2023, including a new location in Long Branch, New Jersey in the coming months to further Salt Lifes geographic reach in the northeast.\nWe continue to invest in marketing initiatives designed to elevate the Salt Life brand and drive increased engagement. Salt Lifes YouTube channel reached 7.1 million views in fiscal 2022, a 36% increase over the prior year. Beyond YouTube, Salt Lifes social media channel net audience spanning Facebook, Instagram, Twitter, LinkedIn and Pinterest grew nearly 85% on the year. Salt Life also continues to interact with consumers through its online content portal, The Daily Salt, and its Salt Life-branded podcast, Above and Below.\nOverall fiscal 2022 was another excellent year for Delta Apparel. Our performance highlights the strong foundation across our business segments and the benefits of our broad channels of distribution, the demand for our unique product and service offerings, the efficiencies of our vertically integrated operations, and the emotional connection our lifestyle brand, Salt Life, has with a broad range of consumers. Although we move into fiscal year 2023 with some unsettled economic conditions, we believe that we continue to be well-positioned to take advantage of opportunities as they arise and win additional market share.\nResults of Operations\nNet sales for 2022 were $484.9 million, up 11.0% from $436.8 million in the prior year. Our growth was broad-based with sales increasing year-over year in both the Delta Group and Salt Life Group segments.\nDelta Group segment net sales increased 10% to $424.8 million in 2022 compared to prior year net sales of $387.0 million. Within the Activewear business, our Global Brand and Retail Direct channels both achieved double-digit year over year growth, and our Delta Direct channel achieved single-digit year over year growth. Our DTG2Go business achieved both unit and sales dollar growth, resulting in sales growth of 17% over the prior year.\nSalt Life Group segment net sales were $60.1 million in 2022, increasing 21% from $49.7 million in the prior year. During fiscal 2022, the segment saw both wholesale and direct-to-consumer retail channel growth over the prior year. Salt Life also opened eight new branded retail doors, bringing our total retail store locations to 21.\nOverall gross profit increased by 7% to $108.8 million from $101.9 million in the prior year. Gross margins were 22.4% of sales, a decline of 90 basis points from prior year gross margins of 23.3% of sales. The decline from the prior year is a result of increased input costs in the Delta Group, offset by favorable sales mix in the Salt Life group.\nDelta Group segment gross margins were 18.3% compared to 20.2% in the prior year. Margins were negatively impacted by increasing input costs and labor costs.\nSalt Life Group segment gross margins improved by 370 basis points to 51.6% compared to 47.9% in 2021. Margins were favorably impacted by a stronger mix of direct-to-consumer sales and favorable mix of higher profit products.\nSelling, general and administrative (SG&A) expenses in 2022 were $79.5 million, or 16.4% of sales, compared to $70.7 million, or 16.2% of sales, in 2021. Expenses increased in 2022 due to higher selling costs associated with the expansion of Salt Lifes retail footprint and higher distribution labor costs.\nOther income of $2.4 million in 2022 included $0.9 million in profits related to our equity investment in Green Valley Industrial Park, S.A. de C.V., the Honduran entity that owns and operates the industrial park in Naco, Quimistan, Santa Barbara Honduras, where our Ceiba Textiles facility is located (\"Honduran Equity Method Investment\"), as well as $1.9 million in income from the net reduction in contingent consideration liabilities, offset by a loss on the disposal of fixed assets of $0.4 million. In the prior year, other income of $1.6 million included $0.5 million of profits related to our Honduran Equity Method investment as well as $2.4 million income from the net reduction in contingent consideration liabilities, partially offset by $1.3 million of expenses related to the impact of the two hurricanes that disrupted our Honduran manufacturing facilities in the December quarter.\nOperating income for 2022 was $31.8 million. This compares to an operating income of $32.7 million in the prior year.\nDelta Group segment operating income for 2022 was $38.0 million, or 9.0% of sales, compared to $40.0 million, or 10.3% of sales, in 2021. The decline in operating income is attributable to gross margin decline from increasing input costs.\nSalt Life Group segment operating income was $8.2 million for 2022 compared to prior year operating income of $5.8 million. Operating income improved due to higher sales volume coupled with favorable product mix.\nInterest expense for 2022 was $7.7 million compared to $6.8 million in 2021. The increase is primarily due to higher average debt levels.\nOur 2022 effective income tax rate is 17.9% compared to 21.9% in the prior year. See Note 9-Income Taxes for more information.\nNet income attributable to shareholders in 2022 was $19.7 million, or $2.80 per diluted share. Our prior year net income was $20.3 million, or $2.86 per diluted share.\nLiquidity and Capital Resources\nOperating Cash Flows\nCash used by operating activities in 2022 was $20.1 million, compared to cash provided by operating activities of $25.5 million in 2021. The lower operating cash flows in 2022 primarily relate to increasing input costs and higher ending inventory levels at year-end.\nInvesting Cash Flows\nCash used in investing activities in 2022 and 2021 was $13.0 million. Capital expenditures during 2022 and 2021 were $19.9 and $15.8 million, respectively. Capital expenditures in both periods primarily related to investments in our distribution expansion, digital print equipment, information technology, and retail stores. There were $10.4 million in expenditures financed under capital lease arrangements and $1.0 million in unpaid expenditures as of September 2022.\nWe currently expect to spend less on capital expenditures in 2023 as compared to 2022. These projects would be focused on digital print equipment, information technology, manufacturing efficiency, and direct-to-consumer investments, including new Salt Life retail store openings.\nFinancing Activities\nCash provided by financing activities was $24.1 million in 2022 compared to cash used of $19.5 million in 2021. In 2022, we increased the amount outstanding on our U.S credit facility and utilized cash proceeds to fund operating activities and certain capital investments, as well as the required payments on our capital lease financing. Additionally, in the current year we entered into a new Honduran term loan with a principal of $3.7 million and a new term loan related to our El Salvador facility for $3.0 million, both with five-year terms. We repurchased $4.0 million shares of our common stock during 2022 compared to no share repurchases in 2021.\nFuture Liquidity and Capital Resources\nSee Note 8 - Long-Term Debt to the Consolidated Financial Statements for discussion of our various financing arrangements, including the terms of our revolving U.S. credit facility.\nOur asset-based U.S. revolving credit facility, as amended on June 2, 2022, as well as cash flows from operations, are intended to fund our day-to-day working capital needs, along with capital lease financing arrangements, to fund our planned capital expenditures. However, any material deterioration in our results of operations may result in the loss of our ability to borrow under our U.S. revolving credit facility and to issue letters of credit to suppliers, or may cause the borrowing availability under that facility to be insufficient for our needs. Availability under our credit facility is primarily a function of the levels of our accounts receivable and inventory. A significant deterioration in our accounts receivable or inventory levels could restrict our ability to borrow additional funds or service our indebtedness.\nOur credit facility includes a financial covenant that if the availability under our credit facility falls below the amounts specified in our credit agreement, our Fixed Charge Coverage Ratio (FCCR) (as defined in our credit agreement) for the preceding 12-month period must not be less than 1.0. Our availability at September 2022, was above the minimum thresholds specified in our credit agreement, and we were above the 1.0 FCCR for the preceding 12-month period. A significant deterioration in our business could cause our availability to fall below minimum thresholds, thereby requiring us to maintain the minimum FCCR specified in our credit agreement, which we may not be able to maintain.\nDerivative Instruments\nFrom time to time, we may purchase cotton option contracts to economically hedge the risk related to market fluctuations in the cost of cotton used in our operations. We do not receive hedge accounting treatment for these derivatives. As such, the realized gains and losses associated with them were recorded within cost of goods sold on the Consolidated Statement of Operations. There were no material option agreements that were outstanding at September 2022.\nFrom time to time, we may use interest rate swaps or other instruments to manage our interest rate exposure and reduce the impact of future interest rate changes. These financial instruments are not used for trading or speculative purposes. We have designated our interest rate swap contracts as cash flow hedges of our future interest payments. As a result, the gains and losses on the swap contracts are reported as a component of other comprehensive income and are reclassified into interest expense as the related interest payments are made. As of September 2022, all of other comprehensive income was attributable to shareholders and; none related to the non-controlling interest. The changes in fair value of the interest rate swap agreements resulted in other comprehensive gain, net of taxes, of $0.9 million for the year ended September 2022, and other comprehensive gain, net of taxes, of $0.5 million for the year ended September 2021.\nOff-Balance Sheet Arrangements\nAs of September 2022, we did not have any off-balance sheet arrangements that were material to our financial condition, results of operations or cash flows as defined by Item 303(a)(4) of Regulation S-K promulgated by the SEC other than letters of credit, and purchase obligations. We have disclosed letters of credit and purchase obligations in Note 15-Commitments and Contingencies.\nDividends and Purchases of our Own Shares\nPursuant to the terms of our credit facility, we are allowed to make cash dividends and stock repurchases if (i) as of the date of the payment or repurchase and after giving effect to the payment or repurchase, we have availability on that date of not less than 15% of the lesser of the borrowing base or the commitment, and average availability for the 30-day period immediately preceding that date of not less than 15% of the lesser of the borrowing base or the commitment; and (ii) the aggregate amount of dividends and stock repurchases after May 10, 2016, does not exceed $10 million plus 50% of our cumulative net income (as defined in the Amended Credit Agreement) from the first day of the third quarter of 2016 to the date of determination. At September 2022, and September 2021, there was $24.9 million and $19.0 million, respectively, of retained earnings free of restrictions to make cash dividends or stock repurchases.\nOur Board of Directors did not declare, nor were any dividends paid, during 2022 and 2021. Any future cash dividend payments will depend upon our earnings, financial condition, capital requirements, compliance with loan covenants and other relevant factors.\nAs of September 2022, our Board of Directors had authorized management to use up to $60.0 million to repurchase stock in open market transactions under our Stock Repurchase Program. During 2022, we purchased 136,181 shares of our common stock for a total cost of $4.0 million. There were no repurchases of our common stock in 2021. As of September 2022, we had purchased 3,735,114 shares of common stock for an aggregate of $56.4 million since the inception of the Stock Repurchase Program. All purchases were made at the discretion of management and pursuant to the safe harbor provisions of SEC Rule 10b-18. As of September 2022, $3.6 million remained authorized by our Board of Directors for future purchases under our Stock Repurchase Program, which does not have an expiration date.\nCritical Accounting Policies\nThe discussion and analysis of our financial condition and results of operations are based upon our Consolidated Financial Statements, which were prepared in accordance with U.S. GAAP. The preparation of our Consolidated Financial Statements requires us to make estimates and judgments that affect the reported amounts of assets and liabilities and disclosure of contingent liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. We base our estimates and judgments on historical experience and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions. We have no reason to believe that our past estimates have not been appropriate. Our most critical accounting estimates, discussed below, pertain to revenue recognition, accounts receivable and related reserves, inventories and related reserves, the carrying value of goodwill, and the accounting for income taxes.\nNote 2 to our Consolidated Financial Statements includes a summary of the significant accounting policies or methods used in the preparation of our Consolidated Financial Statements.\nRevenue Recognition\nRevenue is recognized when performance obligations under the terms of the contracts are satisfied. Our performance obligations primarily consist of delivering products to our customers. Control is transferred upon providing the products to customers in our retail stores, upon shipment of our products to the consumers from our ecommerce sites, and upon shipment from our distribution centers to our customers in our wholesale operations. Once control is transferred to the customer, we have completed our performance obligation.\nIn certain areas of our wholesale business, we offer discounts and allowances to support our customers. Some of these arrangements are written agreements, while others may be implied by customary practices in the industry. Wholesale sales are recorded net of discounts, allowances, and operational chargebacks. As certain allowances and other deductions are not finalized until the end of a season, program or other event which may not have occurred, we estimate such discounts, allowances, and returns that we expect to provide.\nWe record reductions to revenue for estimated customer returns, allowances, markdowns and discounts. We estimate these reductions based on historical rates of customer returns and allowances as well as the specific identification of outstanding returns, markdowns and allowances that have not yet been received by us. The actual amount of customer returns and allowances, which is inherently uncertain, may differ from our estimates. If we determine that actual or expected returns or allowances are significantly higher or lower than the reserves we established, we would record a reduction or increase, as appropriate, to net sales in the period in which we make such a determination. Reserves for returns, allowances, markdowns and discounts are included within accrued expenses as refund liabilities, and the value of inventory associated with reserves for sales returns are included within prepaid expenses and other current assets on the Consolidated Balance Sheets. As of September 2022, and September 2021, there was $1.1 million and $1.0 million, respectively, in refund liabilities for customer returns, allowances, markdowns and discounts included within accrued expenses.\nAccounts Receivable and Related Reserves\nAccounts receivable consists primarily of receivables from our customers arising from the sale of our products, and we generally do not require collateral from our customers. We actively monitor our exposure to credit risk through the use of credit approvals and credit limits. Accounts receivable is presented net of reserves for doubtful accounts.\nWe estimate the net collectability of our accounts receivable and establish an allowance for doubtful accounts based upon this assessment. In situations where we are aware of a specific customers inability to meet its financial obligation, such as in the case of a bankruptcy filing, we assess the need for a specific reserve for bad debts. Reserves are determined through analysis of the aging of accounts receivable balances, historical bad debts, customer concentrations, customer credit-worthiness, current economic trends and changes in customer payment terms. Although our historical allowances have been materially accurate, if market conditions change, additional reserves may be required. Bad debt expense was less than 1% of net sales in each of 2022 and 2021.\nInventories and Related Reserves\nWe state inventories at the lower of cost and net realizable value using the first-in, first-out method. Inventory cost includes materials, labor and manufacturing overhead on manufactured inventory and all direct and associated costs, including inbound freight, to acquire sourced products. We regularly review inventory quantities on hand and record reserves for obsolescence, excess quantities, irregulars and slow-moving inventory based on historical selling prices, current market conditions, and forecasted product demand to reduce inventory to its net realizable value. Although our historical reserves have been materially accurate, if actual selling prices are less favorable than those projected or if sell-through of the inventory is more difficult than anticipated, additional inventory reserves may be required.\nGoodwill\nGoodwill and definite-lived intangibles were recorded in conjunction with our acquisitions of Salt Life, DTG2Go, and Silk Screen Ink, Ltd. d/b/a SSI Digital Print Services, (SSI). We did not record any separately identifiable indefinite-lived intangibles associated with any of these acquisitions. Goodwill represents the excess of the purchase price and related costs over the value assigned to net tangible and identifiable intangible assets acquired and liabilities assumed. Goodwill must be tested for impairment at least annually or more frequently if events or changes in circumstances indicate that the carrying amount may be impaired, and goodwill is required to be written down when impaired. The Company tests goodwill for impairment annually on the first day of our third fiscal quarter, or more often if events occur or changes in circumstances indicate that the carrying amount of goodwill may not be recoverable. We assess the value of our goodwill under either a qualitative or quantitative approach. Under a qualitative approach, the Company evaluates various market and other factors to determine whether it is more likely than not that the Companys goodwill has been impaired. In performing the qualitative assessment, the Company considers the carrying value of its reporting units compared to its fair value as well as events and changes in circumstances that could include, but are not limited to, a significant adverse change in customer demand or business climate, an adverse action or assessment by a regulator, and significant adverse changes in the price of the Companys common stock. If such qualitative assessment indicates that impairment may have occurred, an additional quantitative assessment is performed by comparing the carrying value of the assets to their respective estimated fair values. If the recorded carrying value of goodwill exceeds its estimated fair value, an impairment charge is recorded to write the asset down to its estimated fair value.\nThe Companys goodwill impairment loss calculations contain uncertainties because they require management to make significant judgments in estimating the fair value of the Companys reporting units, including the projection of future cash flows and the selection of discount rates. These calculations contain uncertainties because they require management to make assumptions such as estimating economic factors, including the profitability of future business operations and, if necessary, the fair value of the reporting units assets and liabilities. Further, the Companys ability to realize the future cash flows used in its fair value calculations is affected by factors such as changes in economic conditions, changes in the Companys operating performance, and changes in the Companys business strategies. Significant changes in any of the assumptions involved in calculating these estimates could affect the estimated fair value of the Companys reporting units and could result in impairment charges in a future period.\nIncome Taxes\nWe account for income taxes under the liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases, as well as operating loss, interest deductions, and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. A valuation allowance is required to reduce the carrying value of deferred tax assets to the amount that is more-likely-than-not to be realized. In making this final determination, we follow the Accounting Standards Codification 740, Income Taxes (\"ASC 740\"), and look to taxable income in prior carryback years, reversals of existing temporary book/tax differences, tax planning strategies and future taxable income exclusive of reversals of existing temporary differences. By its very nature, future taxable income requires estimates and judgments about future events that may be predictable, but are far less certain than past events that can be objectively measured.\nWe established a valuation allowance related to certain of our state operating loss carryforward amounts in accordance with the provisions of ASC 740. We continually review the adequacy of the valuation allowance and recognize the benefits of deferred tax assets if reassessment indicates that it is more likely than not that the deferred tax assets will be realized based on earnings forecasts in the respective state tax jurisdictions. As of September 2022, we had state NOLs of approximately $41.6 million, with deferred tax assets of $2.0 million related to these state NOLs, and related valuation allowances against them of approximately $0.6 million. These state net loss carryforwards expire at various intervals from 2027 through 2040.\nRecent Accounting Standards\nFor information regarding recently issued accounting standards, refer to Note 2(ad) and Note 2(ae) to our Consolidated Financial Statements. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 (the \"Exchange Act\") and are not required to provide the information under this item. Item 8. Financial Statements and Supplementary Data\nOur Consolidated Financial Statements for each of our periods ended September 2022, and September 2021, together with the Reports of Independent Registered Public Accounting Firms thereon, are included in this report commencing on page and are listed under Part IV, Item 15 in this report. Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of our disclosure controls and procedures as of September 2022, and, based on their evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that these controls and procedures were effective at the evaluation date.\nDisclosure controls and procedures are controls and other procedures that are designed to reasonably assure that information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information that we are required to disclose in the reports that we file or submit under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement of Delta Apparel, Inc. is responsible for establishing and maintaining effective internal control over financial reporting as defined in Rules 13a-15(f) under the Securities Exchange Act of 1934. Our internal control over financial reporting is designed to provide reasonable assurance regarding the preparation and fair presentation of published financial statements. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 2022. In this evaluation, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework) (\"COSO\") in Internal Control - Integrated Framework. The scope of our efforts to comply with the internal requirements of Section 404 of the Sarbanes-Oxley Act of 2002 with respect to fiscal year 2022 included all of our operations. Based on our evaluation, our management has concluded that, as of September 2022, our internal control over financial reporting is effective.\nThe effectiveness of our internal control over financial reporting as of September 2022, has been audited by Ernst & Young, LLP (\"EY\"), our independent registered public accounting firm, who also audited our Consolidated Financial Statements. EYs attestation report on our internal controls over financial reporting is included herein.\nChanges in Internal Control over Financial Reporting\nThere was no change in our internal control over financial reporting during the fourth quarter of 2022 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Delta Apparel, Inc. and Subsidiaries\nOpinion on Internal Control over Financial Reporting\nWe have audited Delta Apparel, Inc. and Subsidiaries internal control over financial reporting as of October 1, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Delta Apparel, Inc. and Subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of October 1, 2022, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of October 1, 2022, and October 2, 2021, and the related consolidated statements of operations, comprehensive income, shareholders equity and cash flows for each of the two years in the period ended October 1, 2022, and the related notes and our report dated November 21, 2022 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nAtlanta, Georgia\nNovember 21, 2022 Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPart III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this Item is incorporated herein by reference from the portions of the definitive Proxy Statement to be filed with the Securities and Exchange Commission within 120 days following the end of our 2022 fiscal year under the headings \"Proposal No. 1: Election of Directors\", Corporate Governance, Executive Officers and Delinquent Section 16(a) Reports.\nAll of our employees, including our Chief Executive Officer, Chief Financial Officer, and Chief Accounting Officer, are required to abide by our business conduct policies so that our business is conducted in a consistently legal and ethical manner. We have adopted a code of business conduct and ethics known as our Ethics Policy Statement. The Ethics Policy Statement is available without charge on our website. In the event that we amend or waive any of the provisions of the Ethics Policy Statement applicable to our Chief Executive Officer, Chief Financial Officer, or Chief Accounting Officer, we intend to disclose the same on our website at www.deltaapparelinc.com. Item 11. Executive Compensation\nThe information required by this Item is incorporated herein by reference from the portions of the definitive Proxy Statement to be filed with the Securities and Exchange Commission within 120 days following the end of our 2022 fiscal year under the headings Executive Compensation, Compensation Tables, and \"Director Compensation.\" Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information relating to security ownership by certain beneficial owners and management is incorporated herein by reference from the portion of the definitive Proxy Statement to be filed with the Securities and Exchange Commission within 120 days following the end of our 2022 fiscal year under the headings Equity Compensation Plan Information\" and Stock Ownership of Management and Principal Shareholder.\nOn February 6, 2020, our shareholders approved the Delta Apparel, Inc. 2020 Stock Plan (\"2020 Stock Plan\") to replace the 2010 Stock Plan, which was previously re-approved by our shareholders on February 4, 2015, and was scheduled to expire by its terms on September 14, 2020. The 2020 Stock Plan is substantially similar in both form and substance to the 2010 Stock Plan. The purpose of the 2020 Stock Plan is to continue to give our Board of Directors and its Compensation Committee the ability to offer a variety of compensatory awards designed to enhance the Companys long-term success by encouraging stock ownership among its executives, key employees and directors. Under the 2020 Stock Plan, the Compensation Committee of our Board of Directors has the authority to determine the employees and directors to whom awards may be granted and the size and type of each award and manner in which such awards will vest. The awards available under the plan consist of stock options, stock appreciation rights, restricted stock, restricted stock units, performance stock, performance units, and other stock and cash awards. If a participant dies or becomes disabled (as defined in the 2020 Stock Plan) while employed by the Company or serving as a director, all unvested awards become fully vested. The Compensation Committee is authorized to establish the terms and conditions of awards granted under the 2020 Stock Plan, to establish, amend and rescind any rules and regulations relating to the 2020 Stock Plan, and to make any other determinations that it deems necessary. The aggregate number of shares of common stock that may be delivered under the 2020 Stock Plan is 449,714 plus any shares of common stock subject to outstanding awards under the 2010 Stock Plan that are subsequently forfeited or terminated for any reason before being exercised. Similar to the 2010 Stock Plan, the 2020 Stock Plan limits the number of shares that may be covered by awards to any participant in a given calendar year and also limits the aggregate awards of restricted stock, restricted stock units and performance stock granted in a given calendar year. The 2010 Stock Plan terminated and the 2020 Stock Plan became effective on February 6, 2020, the date of shareholders approval.\nSet forth in the table below is certain information about securities issuable under our equity compensation plans as of September 2022.\nPlan Category\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights (1)\nWeighted-average exercise price of outstanding options, warrants and rights (2)\nNumber of securities remaining available for future issuance under equity compensation plans (excluding those currently outstanding)\nEquity compensation plans approved by security holders\n274,625\n$ -\n276,464\nEquity compensation plans not approved by security holders\n-\n-\n-\nTotal\n274,625\n$ -\n276,464\n(1) Includes all outstanding restricted stock units that have a performance-based vesting condition that would vest in equity shares, and assumes 100% vesting of performance-based targets.\n(2) Not applicable, as there are no outstanding stock options at period end.\nFor additional information on our stock-based compensation plans, see Note 12 - Stock-Based Compensation to the Consolidated Financial Statements. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item is incorporated herein by reference from the portion of the definitive Proxy Statement to be filed with the Securities and Exchange Commission within 120 days following the end of our 2022 fiscal year under the heading \"Corporate Governance\". Item 14. Principal Accountant Fees and Services\nThe information required by this Item is incorporated herein by reference from the portion of the definitive Proxy Statement to be filed with the Securities and Exchange Commission within 120 days following the end of our 2022 fiscal year under the heading Proposal No. 3: Ratification of Appointment of Independent Registered Public Accounting Firm.\nPart IV Item 15. Exhibits and Financial Statement Schedules\nFinancial Statements:\nReport of Independent Registered Public Accounting Firms.\nConsolidated Balance Sheets as of September 2022, and September 2021.\nConsolidated Statements of Operations for the years ended September 2022, and September 2021.\nConsolidated Statements of Comprehensive Income for the years ended September 2022, and September 2021.\nConsolidated Statements of Shareholders Equity for the years ended September 2022, and September 2021.\nConsolidated Statements of Cash Flows for the years ended September 2022, and September 2021.\nNotes to Consolidated Financial Statements.\nAll other schedules for which provision is made in the applicable accounting regulation of the Securities and Exchange Commission are not required under the related instructions or are inapplicable, and therefore have been omitted. Columns omitted from schedules filed have been omitted because the information is not applicable.\n(a)(3) Listing of Exhibits*\n2.1\nAsset Purchase Agreement dated as of August 27, 2013, among To The Game, LLC, Salt Life Holdings, LLC, Roger L. Combs, Sr., Donald R. Combs, Richard Thompson, and Michael T. Hutto (excluding schedules and exhibits): Incorporated by reference to Exhibit 2.1 to the Companys Form 8-K filed on August 29, 2013.\n3.1.1\nArticles of Incorporation of the Company: Incorporated by reference to Exhibit 3.1 to the Companys Form 10-12B filed on December 30, 1999.\n3.1.2\nAmendment to Articles of Incorporation of the Company dated September 18, 2003: Incorporated by reference to Exhibit 3.1.2 to the Companys Form 10-Q filed on November 5, 2003.\n3.1.3\nAmendment to Articles of Incorporation of the Company dated April 28, 2005: Incorporated by reference to Exhibit 3.1.3 to the Companys Form 8-K filed on April 29, 2005.\n3.1.4\nAmendment to Articles of Incorporation of the Company dated November 8, 2007: Incorporated by reference to Exhibit 3.1.4 to the Companys Form 10-K filed on August 28, 2009.\n3.2.1\nBylaws of the Company: Incorporated by reference to Exhibit 3.2.1 to the Companys Form 10-K filed on August 28, 2009.\n3.2.2\nAmendment to Bylaws of the Company adopted January 20, 2000: Incorporated by reference to Exhibit 3.2.2 to the Companys Form 10-K filed on August 28, 2009.\n3.2.3\nAmendment to Bylaws of the Company adopted February 17, 2000: Incorporated by reference to Exhibit 3.2.3 to the Companys Form 10-K filed on August 28, 2009.\n3.2.4\nAmendment to Bylaws of the Company adopted June 6, 2000: Incorporated by reference to Exhibit 3.2.4 to the Companys Form 10-K filed on August 28, 2009.\n3.2.5\nAmendment to Bylaws of the Company dated August 17, 2006: Incorporated by reference to Exhibit 3.2.5 to the Companys Form 10-K filed on August 28, 2009.\n3.2.6\nAmendment to Bylaws of the Company dated August 12, 2009: Incorporated by reference to Exhibit 3.2.6 to the Companys Form 10-K filed on August 28, 2009.\n4.1\nSee Exhibits 3.1.1, 3.1.2, 3.1.3, 3.1.4, 3.2.1, 3.2.2, 3.2.3, 3.2.4, 3.2.5, and 3.2.6.\n4.2\nSpecimen certificate for common stock, par value $0.01 per share, of the Company: Incorporated by reference to Exhibit 4.2 to the Companys Form 10-12 B/A filed on May 3, 2000.\n4.3 Description of Securities: Incorporated by reference to Exhibit 4.3 to the Company's Form 10-K filed on November 21, 2019.\n10.1\nSee Exhibit 2.1.\n10.2.4\nFifth Amended and Restated Credit Agreement, dated May 10, 2016, among Delta Apparel, Inc., M.J. Soffe, LLC, Junkfood Clothing Company, Salt Life, LLC (f/k/a To The Game, LLC), and Art Gun, LLC, the financial institutions named therein as Lenders, and Wells Fargo Bank, National Association, as Administrative Agent, Sole Lead Arranger, and Sole Book Runner: Incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q filed on May 12, 2016.\n10.2.5\nFirst Amendment to Fifth Amended and Restated Credit Agreement, dated November 27, 2017, among Delta Apparel, Inc., M.J. Soffe, LLC, Junkfood Clothing Company, Salt Life, LLC, and Art Gun, LLC, the financial institutions named therein as Lenders, and Wells Fargo Bank, National Association, as Administrative Agent, Sole Lead Arranger, and Sole Book Runner: Incorporated by reference to Exhibit 10.2.5 to the Companys Annual Report on Form 10-K filed on November 28, 2017.\n10.2.6\nConsent and Second Amendment to Fifth Amended and Restated Credit Agreement, dated March 9, 2018, among Delta Apparel, Inc., M.J. Soffe, LLC, Culver City Clothing Company, Salt Life, LLC, and Art Gun, LLC, the financial institutions named therein as Lenders, and Wells Fargo Bank, National Association, as Administrative Agent, Sole Lead Arranger, and Sole Book Runner: Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on March 13, 2018.\n10.2.7\nConsent and Third Amendment to Fifth Amended and Restated Credit Agreement, dated October 8, 2018, among Delta Apparel, Inc., M.J. Soffe, LLC, Culver City Clothing Company, Salt Life, LLC, and DTG2Go, LLC, the financial institutions named therein as Lenders, and Wells Fargo Bank, National Association, as Administrative Agent, Sole Lead Arranger, and Sole Book Runner: Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on October 9, 2018.\n10.2.8 Fourth Amendment to Fifth Amended and Restated Credit Agreement, dated November 19, 2019, among Delta Apparel, Inc., M.J. Soffe, LLC, Culver City Clothing Company, Salt Life, LLC, and DTG2Go, LLC, the financial institutions named therein as Lenders, and Wells Fargo Bank, National Association, as agent for Lenders. Incorporated by reference to Exhibit 10.2.8 to the Company's Annual Report on Form 10-K filed on November 23, 2019.\n10.2.9 Fifth Amendment to Fifth Amended and Restated Credit Agreement dated April 27, 2020, among Delta Apparel, Inc., M.J. Soffe, LLC, Culver City Clothing Company, Salt Life, LLC, and DTG2Go, LLC, the financial institutions named therein as Lenders, and Wells Fargo Bank, National Association as agent for Lenders. Incorporated by reference to Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q filed on April 30, 2020.\n10.2.10 Sixth Amendment to Fifth Amended and Restated Credit Agreement dated August 28, 2020, among Delta Apparel, Inc., M.J. Soffe, LLC, Culver City Clothing Company, Salt Life, LLC, and DTG2Go, LLC, the financial institutions named therein as Lenders, and Wells Fargo Bank, National Association as agent for Lenders. Incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed on August 31, 2020.\n10.2.11 Seventh Amendment to Fifth Amended and Restated Credit Agreement dated June 2, 2022, among Delta Apparel, Inc., M.J. Soffe, LLC, Culver City Clothing Company, Salt Life, LLC, and DTG2Go, LLC, the financial institutions named therein as Lenders, and Wells Fargo Bank, National Association as agent for Lenders. Incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed on June 3, 2022.\n10.3\nDelta Apparel, Inc. 2000 Stock Option Plan, Effective as of February 15, 2000, Amended & Restated March 15, 2000: Incorporated by reference to Exhibit 10.4 to the Companys Form 10-12B/A filed on March 31, 2000.***\n10.4\nDelta Apparel, Inc. Incentive Stock Award Plan, Effective February 15, 2000, Amended & Restated March 15, 2000: Incorporated by reference to Exhibit 10.5 to the Companys Form 10-12B/A filed on March 31, 2000.***\n10.5\nDelta Apparel, Inc. 2010 Stock Plan: Incorporated by reference to Exhibit 99.2 to the Companys Form 8-K filed on November 4, 2010, and Exhibit 1 to the Company's Proxy Statement filed on December 19, 2014.***\n10.5.1 Delta Apparel, Inc. 2020 Stock Plan: Incorporated by reference to Exhibit 1 to the Company's Proxy Statement filed on December 17, 2019.***\n10.6\nYarn Supply Agreement dated as of January 5, 2005, between Delta Apparel, Inc. and Parkdale Mills, LLC and Parkdale America, LLC: Incorporated by reference to Exhibit 10.6 to the Companys Form 10-K filed on November 22, 2021+\n10.6.1\nFirst Amendment to Yarn Supply Agreement dated as of June 26, 2009 between Delta Apparel, Inc. and Parkdale Mills, LLC, and Parkdale America, LLC: Incorporated by reference to Exhibit 10.6.1 to the Companys Form 10-K filed on November 22, 2021.+\n10.6.2\nSecond Amendment to Yarn Supply Agreement dated as of October 21, 2011 between Delta Apparel, Inc. and Parkdale Mills, LLC, and Parkdale America, LLC: Incorporated by reference to Exhibit 10.6.2 to the Companys Form 10-K filed on November 22, 2021.+\n10.6.3\nThird Amendment to Yarn Supply Agreement dated as of March 11, 2013, between Delta Apparel, Inc. and Parkdale Mills, LLC, and Parkdale America, LLC: Incorporated by reference to Exhibit 10.6.3 to the Companys Form 10-K filed on November 22, 2021.+\n10.6.4\nFourth Amendment to Yarn Supply Agreement dated as of December 11, 2015, between Delta Apparel, Inc. and Parkdale Mills, LLC, and Parkdale America, LLC: Incorporated by reference to Exhibit 10.6.4 to the Companys Form 10-K filed on November 22, 2021.+\n10.6.5 Fifth Amendment to Yarn Supply Agreement dated as of December 27, 2018, between Delta Apparel, Inc. and Parkdale Mills, LLC, and Parkdale America, LLC: Incorporated by reference to Exhibit 10.6.5 to the Companys Quarterly Report on Form 10-Q filed on February 8, 2022.+\n10.6.6\nSixth Amendment to Yarn Supply Agreement dated as of December 27, 2021, between Delta Apparel, Inc. and Parkdale Mills, LLC, and Parkdale America, LLC: Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on January 3, 2022.+\n10.7\nEmployment Agreement between Delta Apparel, Inc. and Deborah H. Merrill dated January 1, 2019: Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on January 2, 2019.***\n10.8\nEmployment Agreement between Delta Apparel, Inc. and Robert W. Humphreys dated June 10, 2009: Incorporated by reference to Exhibit 10.11 to the Companys Annual Report on Form 10-K filed on August 28, 2009.***\n10.8.1\nFirst Amendment to Employment Agreement between Delta Apparel, Inc. and Robert W. Humphreys dated August 17, 2011: Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on August 19, 2011.***\n10.8.2\nSecond Amendment to Employment Agreement between Delta Apparel, Inc. and Robert W. Humphreys dated June 6, 2012: Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on June 8, 2012.***\n10.8.3\nThird Amendment to Employment Agreement between Delta Apparel, Inc. and Robert W. Humphreys dated December 5, 2014: Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on December 8, 2014.***\n10.8.4\nFourth Amendment to Employment Agreement between Delta Apparel, Inc. and Robert W. Humphreys dated April 27, 2017: Incorporated by reference to Exhibit 99.1 to the Companys Current Report on Form 8-K filed on April 28, 2017.***\n10.8.5 Fifth Amendment to Employment Agreement between Delta Apparel, Inc. and Robert W. Humphreys dated May 11, 2020: Incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed on May 12, 2020.***\n10.8.6 Sixth Amendment to Employment Agreement between Delta Apparel, Inc. and Robert W. Humphreys dated January 13, 2022: Incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed on January 18, 2022.***\n10.9 Employment Agreement between Delta Apparel, Inc. and Simone Walsh dated November 30, 2021: Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on November 30, 2021.***\n10.10 Employment Agreement between Delta Apparel, Inc. and Justin M. Grow dated September 6, 2022.***\n10.11 Employment Agreement between Delta Apparel, Inc. and Matthew J. Miller dated April 4, 2022: Incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q filed on May 3, 2022.***\n10.12 Employment Agreement between Delta Apparel, Inc. and Jeffery N. Stillwell dated January 1, 2022: Incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q filed on August 4, 2022.***\n10.13 Employment Agreement between Delta Apparel, Inc. and Jeffery N. Stillwell dated January 1, 2019: Incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed on January 2, 2019.***\n10.14\nDelta Apparel, Inc. Short-Term Incentive Compensation Plan, Effective June 1, 2000, Amended and Restated Effective November 19, 2019: Incorporated by reference to Exhibit A to the Company's Proxy Statement filed on September 28, 2011, and Exhibit 1 to the Company's Proxy Statement filed on December 29, 2015.***\n10.15\nAgreement between Delta Apparel, Inc. and IMG Worldwide, Inc. dated December 6, 2013: Incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed on December 6, 2013.\n10.16\nForm of Restricted Stock Unit and Performance Unit Award Agreement: Incorporated by reference to Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q filed on February 9, 2016.***\n10.17\nForm of Restricted Stock Unit Award Agreement: Incorporated by reference to Exhibit 10.2 to the Company's Quarterly Report on Form 10-Q filed on February 9, 2016.***\n10.18\nForm of Performance Unit Award Agreement: Incorporated by reference to Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q filed on May 8, 2017.***\n10.19\nForm of Restricted Stock Unit and Performance Unit Award Agreement: Incorporated by reference to Exhibit 10.23 to the Company's Annual Report on Form 10-K filed on November 28, 2017.***\n10.20\nForm of Restricted Stock Unit Award Agreement: Incorporated by reference to Exhibit 10.23 to the Company's Quarterly Report on Form 10-Q filed on May 7, 2018.***\n10.21 Form of Restricted Stock Unit and Performance Unit Award Agreement: Incorporated by reference to Exhibit 10.22 to the Company's Annual Report on Form 10-K filed on November 21.2019.***\n10.22 Form of Restricted Stock Unit and Performance Unit Award Agreement.***\n10.23 Form of Restricted Stock Unit Award Agreement.***\nSubsidiaries of the Company.\n23.1\nConsent of Independent Registered Public Accounting Firm.\n31.1\nCertification of the Chief Executive Officer pursuant to Rule 13a-14(a) under the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of the Chief Financial Officer pursuant to Rule 13a-14(a) under the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification of the Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS Inline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH Inline XBRL Taxonomy Extension Schema\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n*\nAll reports previously filed by the Company with the Commission pursuant to the Securities Exchange Act, and the rules and regulations promulgated thereunder, exhibits of which are incorporated to this Report by reference thereto, were filed under Commission File Number 1-15583.\n+ Portions of this exhibit (indicated therein by asterisk) have been omitted for confidential treatment.\n***\nThis is a management contract or compensatory plan or arrangement.\nThe registrant agrees to furnish supplementally to the Securities and Exchange Commission a copy of any omitted schedule or exhibit to any of the above filed exhibits upon request of the Commission.\n(b) Exhibits\nSee Item 15(a)(3) above.\nItem 16. Form 10-K Summary\nNone.\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDELTA APPAREL, INC.\n(Registrant)\n11/21/22\n/s/Simone Walsh\nDate\nSimone Walsh\nChief Financial Officer\n(principal financial and accounting officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and as of the dates indicated.\n/s/Anita D. Britt\n11/21/22\n/s/Sonya E. Medina 11/21/22\nAnita D. Britt\nDate\nSonya E. Medina\nDate\nDirector\nDirector\n/s/J. Bradley Campbell\n11/21/22\n/s/A. Alexander Taylor, II\n11/21/22\nJ. Bradley Campbell\nDate\nA. Alexander Taylor, II Date\nDirector\nDirector\n/s/G. Jay Gogue\n11/21/22\n/s/Simone Walsh 11/21/22\nG. Jay Gogue Date\nSimone Walsh Date\nDirector\nChief Financial Officer\n(principal financial and accounting officer)\n/s/Glenda E. Hood\n11/21/22\n/s/David G. Whalen 11/21/22\nGlenda E. Hood\nDate\nDavid G. Whalen Date\nDirector\nDirector\n/s/Robert W. Humphreys\n11/21/22\nRobert W. Humphreys Date\nChairman and Chief Executive Officer\n(principal executive officer)\nDelta Apparel, Inc. and Subsidiaries\nIndex to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 42)\nConsolidated Balance Sheets as of September 2022, and September 2021\nConsolidated Statements of Operations for the years ended September 2022, and September 2021\nConsolidated Statements of Comprehensive Income for the years ended September 2022, and September 2021\nConsolidated Statements of Shareholders Equity for the years ended September 2022, and September 2021\nConsolidated Statements of Cash Flows for the years ended September 2022, and September 2021\nNotes to Consolidated Financial Statements\nNote 1-The Company\nNote 2-Significant Accounting Policies\nNote 3-Revenue Recognition\nNote 4-Inventories\nNote 5-Property, Plant and Equipment\nNote 6-Goodwill and Intangible Assets\nNote 7-Accrued Expenses\nNote 8-Long-Term Debt\nNote 9-Income Taxes\nNote 10-Leases\nNote 11-Employee Benefit Plans\nNote 12-Stock-Based Compensation\nNote 13-Business Segments\nNote 14-Repurchase of Common Stock\nNote 15-Commitments and Contingencies\nNote 16-Subsequent Events\nF - 1\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Delta Apparel, Inc. and Subsidiaries\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Delta Apparel, Inc. and Subsidiaries (the Company) as of October 1, 2022 and October 2, 2021, the related consolidated statements of operations, comprehensive income, shareholders equity and cash flows for each of the two years in the period ended October 1, 2022, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at October 1, 2022 and October 2, 2021, and the results of its operations and its cash flows for each of the two years in the period ended October 1, 2022, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of October 1, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated November 21, 2022 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosures to which it relates.\nInventory Reserve Valuation\nDescription of the Matter\nAs described in Note 4 to the Companys consolidated financial statements, the Companys inventories totaled approximately $248.5 million as of October 1, 2022, net of approximately $17.7 million of inventory reserves. As discussed in Note 2 to the consolidated financial statements, the Company states inventories at the lower of cost or net realizable value. In connection with this policy, the Company periodically reviews inventory quantities on hand and records reserves for obsolescence, excess quantities, irregulars and slow-moving inventory based on historical selling prices, current market conditions, and forecasted product demand to reduce inventory to its net realizable value. The Companys evaluation of inventory valuation includes consideration of the life cycle of the individual products and historical sales and margin information based on such life cycles.\nAuditing managements estimate of certain inventory reserves was complex and required significant judgment due to estimation uncertainty in the assumptions about the life cycle of the individual products. Changes in these assumptions can lead to a material effect of the amount of recorded inventory reserves.\nF - 2\nHow We Addressed\nthe Matter in Our Audit\nWe obtained an understanding, evaluated design, and tested the operating effectiveness of controls over the Companys process to determine the valuation of the Companys inventory reserves. This included internal controls over the Companys review of significant assumptions underlying the inventory reserve estimate.\nTo test the adequacy of the Companys inventory reserve, our substantive audit procedures included, among others, assessing methodologies and assumptions used, testing the accuracy and completeness of the underlying data used in managements estimation calculations, including aging of inventory and historical margins, and performing sensitivity analysis on the significant assumptions used.\n/s/ Ernst & Young, LLP\nWe have served as the Companys auditor since 2016.\nAtlanta, Georgia\nNovember 21, 2022\nF - 3\nDelta Apparel, Inc. and Subsidiaries\nConsolidated Balance Sheets\n(Amounts in thousands, except share amounts and per share data)\nSeptember 2022\nSeptember 2021\nAssets\nCash and cash equivalents\n$ 300 $ 9,376\nAccounts receivable, less allowances of $109 and $251, respectively\n68,215 66,973\nOther receivables\n1,402 761\nIncome tax receivable\n1,969 356\nInventories, net\n248,538 161,703\nPrepaid expenses and other current assets\n2,755 3,794\nTotal current assets\n323,179 242,963\nProperty, plant and equipment, net\n74,109 67,564\nGoodwill\n37,897 37,897\nIntangible assets, net\n24,026 26,291\nDeferred income taxes\n1,342 1,854\nOperating lease assets\n50,275 45,279\nEquity method investment\n9,886 10,433\nOther assets\n2,967 2,007\nTotal assets\n$ 523,681 $ 434,288\nLiabilities and Equity\nLiabilities:\nAccounts payable\n$ 83,553 $ 52,936\nAccrued expenses\n27,414 29,949\nIncome taxes payable\n379 379\nCurrent portion of finance leases\n8,163 6,621\nCurrent portion of operating leases\n8,876 8,509\nCurrent portion of long-term debt\n9,176 7,067\nTotal current liabilities\n137,561 105,461\nLong-term income taxes payable\n2,841 3,220\nLong-term finance leases, less current maturities\n16,776 15,669\nLong-term operating leases, less current maturities\n42,721 38,546\nLong-term debt, less current maturities\n136,750 101,680\nLong-term contingent consideration\n- 1,897\nDeferred income taxes\n4,310 1,520\nOther liabilities\n- 2,101\nTotal liabilities\n$ 340,959 $ 270,094\nShareholders equity:\nPreferred stock-$0.01 par value, 2,000,000 shares authorized, none issued and outstanding\n- -\nCommon stock -$0.01 par value, 15,000,000 shares authorized, 9,646,972 shares issued, and 6,915,663 and 6,974,660 shares outstanding as of September 2022, and September 2021, respectively\n96 96\nAdditional paid-in capital\n61,961 60,831\nRetained earnings\n166,600 146,860\nAccumulated other comprehensive gain (loss)\n141 (786 )\nTreasury stock -2,731,309 and 2,672,312 shares as of September 2022, and September 2021, respectively\n(45,420 ) (42,149 )\nEquity attributable to Delta Apparel, Inc.\n183,378 164,852\nEquity attributable to non-controlling interest\n(656 ) (658 )\nTotal equity\n182,722 164,194\nTotal liabilities and equity\n$ 523,681 $ 434,288\nSee accompanying Notes to Consolidated Financial Statements.\nF - 4\nDelta Apparel, Inc. and Subsidiaries\nConsolidated Statements of Operations\n(Amounts in thousands, except per share data)\nYear Ended\nSeptember 2022\nSeptember 2021\nNet sales\n$ 484,859\n$ 436,750\nCost of goods sold\n376,016\n334,870\nGross profit\n108,843\n101,880\nSelling, general and administrative expenses\n79,455\n70,743\nOther income, net\n(2,393 )\n(1,574 )\nOperating income\n31,781\n32,711\nInterest expense\n7,732\n6,844\nEarnings before provision for income taxes\n24,049\n25,867\nProvision for income taxes\n4,307\n5,705\nConsolidated earnings, net\n$ 19,742\n$ 20,162\nNet income (loss) attributable to non-controlling interest\n(134 )\nNet earnings attributable to shareholders\n19,740\n20,296\nBasic earnings per share\n$ 2.84\n$ 2.92\nDiluted earnings per share\n$ 2.80\n$ 2.86\nWeighted average number of shares outstanding\n6,953\n6,961\nDilutive effect of stock options and awards\nWeighted average number of shares assuming dilution\n7,047\n7,093\nSee accompanying Notes to Consolidated Financial Statements.\nF - 5\nDelta Apparel, Inc. and Subsidiaries\nConsolidated Statements of Comprehensive Income\n(Amounts in thousands)\nYear Ended\nSeptember 2022\nSeptember 2021\nNet earnings attributable to shareholders\n$ 19,740\n$ 20,296\nOther comprehensive income related to unrealized gain on derivatives, net of income tax\nConsolidated comprehensive income\n$ 20,667\n$ 20,832\nSee accompanying Notes to Consolidated Financial Statements\nF - 6\nDelta Apparel, Inc. and Subsidiaries\nConsolidated Statements of Shareholders Equity\n(Amounts in thousands, except share amounts)\nAccumulated\nAdditional\nOther\nNon-\nCommon Stock\nPaid-In\nRetained\nComprehensive\nTreasury Stock\nControlling\nShares\nAmount\nCapital\nEarnings\nIncome (Loss)\nShares\nAmount\nInterest\nTotal\nBalance at September 2020\n9,646,972\n$\n$ 61,005\n$ 126,564\n$ (1,322 )\n2,756,854\n$ (43,133 )\n$ (524 )\n$ 142,686\nNet earnings\n-\n-\n-\n20,296\n-\n-\n-\n-\n20,296\nOther comprehensive income\n-\n-\n-\n-\n-\n-\n-\nNet loss attributable to non-controlling interest\n-\n-\n-\n-\n-\n-\n-\n(134 )\n(134 )\nVested stock awards\n-\n-\n(2,117 )\n-\n-\n(84,542 )\n-\n(1,133 )\nStock based compensation\n-\n-\n1,943\n-\n-\n-\n-\n-\n1,943\nBalance at September 2021\n9,646,972\n$\n$ 60,831\n$ 146,860\n$ (786 )\n2,672,312\n$ (42,149 )\n$ (658 )\n$ 164,194\nNet earnings\n-\n-\n-\n19,740\n-\n-\n-\n-\n19,740\nOther comprehensive income\n-\n-\n-\n-\n-\n-\n-\nNet income attributable to non-controlling interest\n-\n-\n-\n-\n-\n-\n-\nStock buyback\n-\n-\n-\n-\n-\n136,181\n(3,957 )\n-\n(3,957 )\nVested stock awards\n-\n-\n(1,783 )\n-\n-\n(77,184 )\n-\n(1,097 )\nStock based compensation\n-\n-\n2,913\n-\n-\n-\n-\n-\n2,913\nBalance at September 2022\n9,646,972\n$\n$ 61,961\n$ 166,600\n$\n2,731,309\n$ (45,420 )\n$ (656 )\n$ 182,722\nSee accompanying Notes to Consolidated Financial Statements.\nF - 7\nDelta Apparel, Inc. and Subsidiaries\nConsolidated Statements of Cash Flows\n(Amounts in thousands)\nYear Ended\nSeptember 2022\nSeptember 2021\nOperating activities:\nConsolidated net earnings\n$ 19,742\n$ 20,162\nAdjustments to consolidated net earnings attributable to net cash (used in) provided by operating activities:\nDepreciation\n12,636\n11,913\nAmortization of intangibles\n2,396\n1,841\nAmortization of deferred financing fees\nProvision for deferred income taxes\n2,988\n3,542\nProvision for market reserves\n1,804\nNon-cash stock compensation\n2,913\n1,943\nLoss (gain) on disposal of equipment\n(54 )\nContingent consideration earn out adjustment\n(1,897 )\n(2,413 )\nOther, net\n(848 )\n(615 )\nChanges in operating assets and liabilities, net of effect of acquisitions:\nAccounts receivable, net\n(1,438 )\n(6,734 )\nInventories, net\n(88,639 )\n(17,086 )\nPrepaid expenses and other current assets\n1,593\n(1,307 )\nOther non-current assets\n1,368\nAccounts payable\n30,435\n3,030\nAccrued expenses\n(415 )\n8,039\nChange in net operating lease liabilities\nIncome taxes\n(1,992 )\nOther liabilities\n(1,049 )\n(126 )\nNet cash (used in) provided by operating activities\n(20,115 )\n25,467\nInvesting activities:\nPurchases of property and equipment\n(12,378 )\n(5,586 )\nProceeds from sale of property and equipment\nProceeds from equipment under financed leases\n-\n2,312\nCash paid for intangible asset\n(131 )\n(6,567 )\nCash paid for business\n(583 )\n(3,665 )\nNet cash used in investing activities\n(13,052 )\n(13,053 )\nFinancing activities:\nProceeds from long-term debt\n542,613\n453,830\nRepayment of long-term debt\n(504,851 )\n(463,092 )\nPayment of capital financing\n(7,732 )\n(6,991 )\nPayment of contingent consideration\n-\n(2,110 )\nRepurchase of common stock\n(3,957 )\n-\nPayment of deferred financing costs\n(890 )\n-\nPayment of withholding taxes on stock awards\n(1,092 )\n(1,133 )\nNet cash provided by (used in) financing activities\n24,091\n(19,496 )\nNet decrease in cash and cash equivalents\n(9,076 )\n(7,082 )\nCash and cash equivalents at beginning of period\n9,376\n16,458\nCash and cash equivalents at end of period\n$\n$ 9,376\nSupplemental cash flow information:\nCash paid during the period for interest\n$ 7,404\n$ 6,554\nCash paid during the period for income taxes, net of refunds received\n$ 3,044\n$ 1,759\nSee accompanying Notes to Consolidated Financial Statements.\nF - 8\nDelta Apparel, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nSeptember 2022\nNote 1-The Company\nDelta Apparel, Inc. (collectively with DTG2Go, LLC, Salt Life, LLC, M.J. Soffe, LLC, and other subsidiaries, \"Delta Apparel,\" \"we,\" \"us,\" \"our,\" or the \"Company\") is a vertically-integrated, international apparel company. With approximately 8,600 employees worldwide, we design, manufacture, source, and market a diverse portfolio of core activewear and lifestyle apparel products under our primary brands of Salt Life®, Soffe®, and Delta. We are a market leader in the on-demand, digital print and fulfillment industry, bringing DTG2Go's proprietary technology and innovation to our customers' supply chains. We specialize in selling casual and athletic products through a variety of distribution channels and tiers, including outdoor and sporting goods retailers, independent and specialty stores, department stores and mid-tier retailers, mass merchants and eRetailers, the U.S. military, and through our business-to-business digital platform. Our products are also made available direct-to-consumer on our ecommerce sites and in our branded retail stores. Our diversified go-to-market strategies allow us to capitalize on our strengths to provide our activewear and lifestyle apparel products to a broad and evolving customer base whose shopping preferences may span multiple retail channels.\nWe design and internally manufacture the majority of our products, with more than 90% of the apparel that we sell sewn in our own facilities. This allows us to offer a high degree of consistency and quality, leverage scale efficiencies, and react quickly to changes in trends within the marketplace. We have manufacturing operations located in the United States, El Salvador, Honduras, and Mexico, and we use domestic and foreign contractors as additional sources of production. Our distribution facilities are strategically located throughout the United States to better serve our customers with same-day shipping on our catalog products and weekly replenishments to retailers.\nNote 2-Significant Accounting Policies\n(a) Basis of Presentation: Our consolidated financial statements are prepared in conformity with accounting principles generally accepted in the United States of America (\"GAAP\") and include the accounts of Delta Apparel and its wholly-owned domestic and foreign subsidiaries, as well as its majority-owned subsidiary, Salt Life Beverage, LLC (\"Salt Life Beverage\"). All significant intercompany accounts and transactions have been eliminated in consolidation.\nWe operate our business in two distinct segments: Delta Group and Salt Life Group. Although the two segments are similar in their production processes and regulatory environments, they are distinct in their economic characteristics, products, marketing, and distribution methods.\n(b) Fiscal Year: We operate on a 52-53 week fiscal year ending on the Saturday closest to September 30. All references to \"2022\" and \"2021\" relate to the 52-week fiscal year ended on September 2022, and the 52-week fiscal year ended on September 2021.\n(c) Use of Estimates: The preparation of financial statements in conformity with GAAP requires management to make certain estimates and assumptions that affect the reported amounts and disclosures of assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Estimates are adjusted to reflect actual experience when necessary. Significant estimates and assumptions affect many items in our financial statements, such as allowance for doubtful accounts receivable, refund liabilities, inventory obsolescence, the carrying value of goodwill, income tax assets, and their related valuation allowance. Our actual results may differ from our estimates.\n(d) Cash and Cash Equivalents: Cash and cash equivalents consist of cash and temporary investments with original maturities of three months or less.\n(e) Accounts Receivable: Accounts receivable consists primarily of receivables from our customers arising from the sale of our products, and we generally do not require collateral from our customers. We actively monitor our exposure to credit risk through the use of credit approvals and credit limits. Accounts receivable is presented net of reserves for doubtful accounts.\nWe estimate the net collectability of our accounts receivable and establish an allowance for doubtful accounts based upon this assessment. In situations where we are aware of a specific customers inability to meet its financial obligation, such as in the case of a bankruptcy filing, we assess the need for a specific reserve for bad debts. Reserves are determined through analysis of the aging of accounts receivable balances, historical bad debts, customer concentrations, customer credit-worthiness, current economic trends and changes in customer payment terms. Bad debt expense was less than 1% of net sales in each of the twelve months ended September 2022 and 2021.\nF -\n(f) Inventories: We state inventories at the lower of cost or net realizable value using the first-in, first-out method. Inventory cost includes materials, labor and manufacturing overhead on manufactured inventory, and all direct and associated costs, including inbound freight, to acquire sourced products. See Note 2 for further information regarding yarn procurements. We regularly review inventory quantities on hand and record reserves for obsolescence, excess quantities, irregulars and slow-moving inventory based on historical selling prices, current market conditions, and forecasted product demand to reduce inventory to its net realizable value. Our evaluation includes consideration of the life cycle of individual products and historical sales and margin information based on such life cycle.\n(g) Property, Plant and Equipment: Property, plant and equipment are stated at cost. We depreciate and amortize our assets on a straight-line method over the estimated useful lives of the assets, which range from three to twenty-five years. Leasehold improvements are amortized over the shorter of the lease term or the estimated useful life of the improvements. Right of use assets that we acquire under non-cancelable leases that meet the criteria of finance leases are capitalized in property, plant and equipment and amortized over the useful lives of the related assets. When we retire or dispose of assets, the costs and accumulated depreciation or amortization are removed from the respective accounts, and we recognize any related gain or loss. Repairs and maintenance costs are expensed as incurred. Major replacements that substantially extend the useful life of an asset are capitalized and depreciated.\n(h) Internally Developed Software Costs: We account for internally developed software in accordance with ASC 350-40, Intangibles-Goodwill and Other, Internal-Use Software. After technical feasibility has been established, we capitalize the cost of our software development process, including payroll and payroll benefits, by tracking the software development hours invested in the software projects. We amortize our software development costs in accordance with the estimated economic life of the software, which is generally three to ten years.\n(i) Impairment of Long-Lived Assets (Including Amortizable Intangible Assets): In accordance with ASC 360, Property, Plant, and Equipment, our long-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the assets may not be recoverable. When evaluating assets for potential impairment, we compare the carrying amount of the asset to the undiscounted future net cash flows expected to be generated by the asset. If impairment is indicated, the asset is permanently written down to its estimated fair value and an impairment loss is recognized.\n(j) Goodwill and Intangible Assets: We recorded goodwill and intangible assets with definite lives, including trade names and trademarks, customer relationships, technology, and non-compete agreements, as a result of several acquisitions. Intangible assets are amortized based on their estimated economic lives, ranging from four to twenty years. Goodwill represents the excess of the purchase price over the fair value of net identified tangible and intangible assets acquired and liabilities assumed, and is not amortized. The total amount of goodwill is deductible for tax purposes. See Note 6 - Goodwill and Intangible Assets for further details.\n(k) Impairment of Goodwill: We evaluate the carrying value of goodwill annually or more frequently if events or circumstances indicate that an impairment loss may have occurred. Such circumstances could include, but are not limited to, a significant adverse change in business climate, increased competition or other economic conditions.\nWe complete our annual impairment test of goodwill on the first day of our third fiscal quarter and whenever events or changes in circumstances indicate the carrying value may not be recoverable utilizing the one-step qualitative assessment. We assess the value of our goodwill under either a qualitative or quantitative approach. Under a qualitative approach, the Company evaluates various market and other factors to determine whether it is more likely than not that the Companys goodwill has been impaired. In performing the qualitative assessment, the Company considers the carrying value of its reporting units compared to its fair value as well as events and changes in circumstances that could include, but are not limited to, a significant adverse change in customer demand or business climate, an adverse action or assessment by a regulator, and significant adverse changes in the price of the Companys common stock. If such qualitative assessment indicates that impairment may have occurred, an additional quantitative assessment is performed by comparing the carrying value of the assets to their respective estimated fair values. If the recorded carrying value of goodwill exceeds its estimated fair value, an impairment charge is recorded to write the asset down to its estimated fair value.\nDuring the third quarter of fiscal 2022, the Company qualitatively assessed whether it was more likely than not that goodwill was impaired. Based on this assessment, the Company determined that its goodwill was not impaired as of April 3, 2022. No events or changes in circumstances have occurred since the date of the Company's most recent annual impairment test that would more likely than not reduce the fair value of the reporting unit below its carrying amount.\nThe Companys goodwill impairment loss calculations contain uncertainties because they require management to make significant judgments in estimating the fair value of the Companys reporting units, including the projection of future cash flows and the selection of discount rates. These calculations contain uncertainties because they require management to make assumptions such as estimating economic factors, including the profitability of future business operations and, if necessary, the fair value of the reporting units assets and liabilities. Further, the Companys ability to realize the future cash flows used in its fair value calculations is affected by factors such as changes in economic conditions, changes in the Companys operating performance, and changes in the Companys business strategies. Significant changes in any of the assumptions involved in calculating these estimates could affect the estimated fair value of the Companys reporting units and could result in impairment charges in a future period.\nF -\n(l) Contingent Consideration: At the end of each reporting period, we are required to remeasure the fair value of the contingent consideration related to the DTG2Go acquisition in March 2018. We remeasure contingent consideration in accordance with ASC 805, Business Combinations based on historical operating results and projections for the future. At September 2022, no amount was accrued for contingent consideration related to the acquisition of DTG2Go, compared to the accrual of $1.9 million at September 2021. See Note 15-Commitments and Contingencies for further details.\n(m) Revenue Recognition: Revenue is recognized when performance obligations under the terms of the contracts are satisfied. Our performance obligation primarily consists of transferring control of our products to our customers. Control is transferred upon providing the products to customers in our retail stores, upon shipment of our products to the consumers from our ecommerce sites, and upon shipment from our distribution centers to our customers in our wholesale operations. Once control is transferred to the customer, we have completed our performance obligation.\nOur receivables resulting from wholesale customers are generally collected within three months, in accordance with our established credit terms. Our direct-to-consumer ecommerce and retail store receivables are collected within a few days. Our revenue, including freight income, is recognized net of applicable taxes in our Consolidated Statements of Operations.\nIn certain areas of our wholesale business, we offer discounts and allowances to support our customers. Some of these arrangements are written agreements, while others may be implied by customary practices in the industry. Wholesale sales are recorded net of discounts, allowances, and operational chargebacks. As certain allowances and other deductions are not finalized until the end of a season, program or other event which may not have occurred, we estimate such discounts, allowances, and returns that we expect to provide.\nWe only recognize revenue to the extent that it is probable that we will not recognize a significant reversal of revenue due to the resolution of variable uncertainties at the time of sale. In determining our estimates for discounts, allowances, chargebacks, and returns, we consider historical and current trends, agreements with our customers and retailer performance. We record these discounts, returns and allowances as a reduction to net sales in our Consolidated Statements of Operations and as a refund liability in our accrued expenses in our Consolidated Balance Sheets, with the estimated value of inventory expected to be returned in prepaid and other current assets in our Consolidated Balance Sheets. As of September 2022, and September 2021, there was $1.1 million and $1.0 million, respectively, in refund liabilities for customer returns, allowances, markdowns and discounts included within accrued expenses.\nWe record shipping and handling charges incurred by us before and after the customer obtains control as a fulfillment cost rather than an additional promised service. Our customers' terms are less than one year from the transfer of goods, and we do not adjust receivable amounts for the impact of the time value of money. We do not capitalize costs of obtaining a contract which we expect to recover, such as commissions, as the amortization period of the asset recognized would be one year or less.\n(n) Sales Tax: Sales tax collected from customers and remitted to various government agencies are presented on a net basis (excluded from revenues) in the Consolidated Statements of Operations.\n(o) Cost of Goods Sold: We include all manufacturing and sourcing costs incurred prior to the receipt of finished goods at our distribution facilities in cost of goods sold. The cost of goods sold principally includes product costs, manufacturing labor costs, purchasing costs, inbound freight charges, insurance, inventory write-downs, and depreciation and amortization expense associated with our manufacturing and sourcing operations. Our gross margins may not be comparable to other companies, since some entities may include costs related to their distribution network in cost of goods sold, and we include them in selling, general and administrative expenses.\n(p) Selling, General and Administrative Expense: We include in selling, general and administrative expenses costs incurred subsequent to the receipt of finished goods at our distribution facilities, such as the cost of stocking, warehousing, picking and packing, and shipping goods for delivery to our customers. Distribution costs included in selling, general and administrative expenses totaled $22.2 million and $20.5 million in 2022 and 2021, respectively. In addition, selling, general and administrative expenses include costs related to sales associates, administrative personnel, advertising and marketing expenses, royalty payments on licensed products, and other general and administrative expenses.\n(q) Advertising Costs: All costs associated with advertising and promoting our products are expensed during the period in which they are incurred and are included in selling, general and administrative expenses in the Consolidated Statements of Operations. We participate in cooperative advertising programs with some of our customers. Depending on the customer, our defined cooperative programs allow the customer to use from 2% to 5% of its net purchases from us towards advertisements of our products. Because our products are being specifically advertised, we are receiving an identifiable benefit resulting from the consideration for cooperative advertising. We record cooperative advertising costs as a selling expense and the related cooperative advertising reserve as an accrued liability. Advertising costs totaled $5.6 million and $3.7 million in 2022 and 2021, respectively. In 2022 and 2021, cooperative advertising costs of $0.7 million and $0.6 million, respectively, were included in these advertising costs.\nF -\n(r) Stock-Based Compensation: Stock-based compensation is accounted for under the provisions of ASC 718, Compensation - Stock Compensation, which requires all stock-based payments to employees, including grants of employee stock awards, to be recognized as expense over the vesting period using a fair value method. The fair value of our restricted stock awards is the quoted market value of our stock on the grant date. For performance-based stock awards, in the event we determine it is no longer probable that we will achieve the minimum performance criteria specified in the award, we reverse all of the previously recognized compensation expense in the period such a determination is made. We recognize the fair value, net of estimated forfeitures, as a component of selling, general and administrative expense in the Consolidated Statements of Operations over the vesting period.\n(s) Income Taxes: We account for income taxes pursuant to ASC 740, Income Taxes, under the liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases as well as operating loss, interest deduction limitations, and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\n(t) Earnings per Share: We compute basic earnings per share (\"EPS\") by dividing net income by the weighted average number of common shares outstanding during the year pursuant to ASC 260, Earnings Per Share (ASC 260). Diluted EPS is calculated, as set forth in ASC 260, by dividing net income by the weighted average number of common shares outstanding adjusted for the issuance of potentially dilutive shares. Potentially dilutive shares consist of common stock issuable under the assumed exercise of outstanding stock awards using the treasury stock method. This method assumes that the potential common shares are issued and the proceeds from the exercise, along with the amount of compensation expense attributable to future services, are used to purchase common stock at the exercise date. The difference between the number of potential shares issued and the number of shares purchased is added as incremental shares to the actual number of shares outstanding to compute diluted EPS. Outstanding stock awards that result in lower potential shares issued than shares purchased under the treasury stock method are not included in the computation of diluted EPS since their inclusion would have an anti-dilutive effect on EPS.\n(u) Foreign Currency Translation: Our functional currency for our foreign operated manufacturing facilities is the United States dollar. We remeasure those assets and liabilities denominated in foreign currencies using exchange rates in effect at each balance sheet date. Property, plant and equipment and the related accumulated depreciation or amortization are recorded at the exchange rates in effect on the date we acquired the assets. Revenues and expenses denominated in foreign currencies are remeasured using average exchange rates during the period transacted. We recognize the resulting foreign exchange gains and losses as a component of other income, net in the Consolidated Statements of Operations. These gains and losses are immaterial for all periods presented.\n(v) Fair Value of Financial Instruments: We use financial instruments in the normal course of our business. The carrying values approximate fair values for financial instruments that are short-term in nature, such as cash, accounts receivable and accounts payable. We estimate that the carrying value of our long-term fixed rate debt approximates fair value based on the current rates offered to us for debt of the same remaining maturities.\n(w) Other Comprehensive Income: Other Comprehensive Income consists of net earnings and unrealized gains from cash flow hedges, net of tax. Accumulated other comprehensive income contained in the shareholders equity section of the Consolidated Balance Sheets related to interest rate swap agreements and was a gain as of September 2022 of $0.1 million and a loss as of September 2021 of $0.8 million.\n(x) Yarn and Cotton Procurements: We have a supply agreement with Parkdale Mills, Inc. and Parkdale America, LLC, (collectively \"Parkdale\"), to supply our yarn requirements that has been in place since 2005, with our existing agreement running through December 31, 2024. Under the supply agreement, we purchase from Parkdale all of our yarn requirements for use in our manufacturing operations, excluding yarns that Parkdale does not manufacture or cannot manufacture due to temporary capacity constraints. The purchase price of yarn is based upon the cost of cotton plus a fixed conversion cost. Thus, we are subject to the commodity risk of cotton prices and cotton price movements, which could result in unfavorable yarn pricing for us. We fix the cotton prices as a component of the purchase price of yarn, pursuant to the supply agreement, in advance of the shipment of finished yarn from Parkdale. Prices are set according to prevailing prices, as reported by the New York Cotton Exchange, at the time we elect to fix specific cotton prices.\n(y) Derivatives: From time to time, we enter into forward contracts, option agreements or other instruments to limit our exposure to fluctuations in interest rates and raw material prices with respect to long-term debt and cotton purchases, respectively. We determine at inception whether the derivative instruments will be accounted for as hedges.\nWe account for derivatives and hedging activities in accordance with ASC 815, Derivatives and Hedging, as amended. ASC 815 establishes accounting and reporting standards for derivative instruments, including certain derivative instruments embedded in other contracts and hedging activities. It requires the recognition of all derivative instruments as either assets or liabilities in the Consolidated Balance Sheets and measurement of those instruments at fair value. The accounting treatment of changes in fair value depends upon whether or not a derivative instrument is designated as a hedge and, if so, the type of hedge. We include all derivative instruments at fair value in our Consolidated Balance Sheets. For derivative financial instruments related to the production of our products that are not designated as a hedge, we recognize the changes in fair value in cost of sales. For derivatives designated as cash flow hedges, to the extent effective, we recognize the changes in fair value in accumulated other comprehensive income (loss) until the hedged item is recognized in income. We formally document all relationships between hedging instruments and hedged items, as well as risk management objectives and strategies for undertaking various hedge transactions, at the inception of the transactions.\nF -\nWe are exposed to counterparty credit risks on all derivatives. Because these amounts are recorded at fair value, the full amount of our exposure is the carrying value of these instruments. We only enter into derivative transactions with well-established institutions, and, therefore, we believe the counterparty credit risk is minimal.\nFrom time to time, we may purchase cotton option contracts to economically hedge the risk related to market fluctuations in the cost of cotton used in our operations. We do not receive hedge accounting treatment for these derivatives. As such, the realized gains and losses associated with them were recorded within cost of goods sold on the Consolidated Statement of Operations. There were no raw material option agreements outstanding at September 2022 or September 2021.\n(z) Equity Method Accounting: As of September 2022, we owned 31% of the outstanding capital stock in our Honduran Equity Method Investment. We apply the equity method of accounting for our investment, as we have less than a 50% ownership interest and can exert significant influence. We do not exercise control over this company and do not have substantive participating rights. As such, this entity is not considered a variable interest entity.\n(aa) Net Income Attributable to Non-Controlling Interest: The net income attributable to non-controlling interest represents the share of net income allocated to members of our consolidated affiliates. In January 2018, Delta Apparel, Inc. established Salt Life Beverage, LLC, (\"Salt Life Beverage\"), of which Delta Apparel, through its subsidiary, holds a 60% ownership interest. Salt Life Beverage was formed to manufacture, market and sell Salt Life-branded alcoholic beverage products. We have concluded we have a controlling financial interest in Salt Life Beverage and have consolidated its results in accordance with Accounting Standards Codification (\"ASC\") ASC-810, Consolidations, and Accounting Standards Update (\"ASU\") No. 2015-02, Consolidation (Topic 810); Amendments to Consolidations. The non-controlling interest represents the 40% proportionate share of the results of Salt Life Beverage. All significant intercompany accounts and transactions have been eliminated in consolidation.\n(ab) Business Combinations: Business combinations completed by Delta Apparel have been accounted for under the acquisition method of accounting. The acquisition method requires the assets acquired and liabilities assumed, including contingencies, to be recorded at the fair value determined at the acquisition date and changes thereafter recorded in income. We generally obtain independent third-party valuation studies for certain assets acquired and liabilities assumed to assist us in determining the fair value. Goodwill represents the purchase price over the fair value of tangible and intangible assets acquired and liabilities assumed. The results of acquired businesses are included in our results of operations from the date of acquisition.\n(ac) Recently Adopted Accounting Pronouncements: In December 2019, the FASB issued ASU No. 2019-12, Simplifying the Accounting for Income Taxes (ASU 2019-12), which simplifies the accounting for income taxes, eliminates certain exceptions within Accounting Standards Codification (\"ASC\") 740, Income Taxes, and clarifies certain aspects of the current guidance to promote consistency among reporting entities. Most amendments within the standard are required to be applied on a prospective basis, while certain amendments must be applied on a retrospective or modified retrospective basis. We adopted ASU 2019-12 as of the beginning of fiscal 2022, and the provisions did not have a material effect on our financial condition, results of operations, cash flows, or disclosures.\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848) Facilitation of the Effects of Reference Rate Reform on Financial Reporting. ASU 2020-04 provides optional guidance for a limited period of time to ease potential accounting and financial reporting impacts of reference rate reform, including the expected transition from the London Interbank Offered Rate (LIBOR) and other interbank offered rates to alternative reference rates. This new guidance includes temporary optional practical expedients and exceptions for applying U.S. GAAP to transactions affected by reference rate reform if certain criteria are met. These transactions include contract modifications, hedging relationships and the sale or transfer of debt securities classified as held-to-maturity. Entities may apply the provisions of the new standard at the beginning of the reporting period when the election is made. This guidance may be applied through December 31, 2022. The Company transitioned their LIBOR based loans to an alternative reference rate during the fiscal year. This change did not have a material effect on our financial condition, results of operations, cash flows or disclosures. See Note 8-Long-Term Debt for further information.\n(ad) Recently Issued Accounting Pronouncements Not Yet Adopted: In June 2016, the FASB issued ASU No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments (ASU 2016-13), which requires an entity to assess impairment of its financial instruments based on the entity's estimate of expected credit losses. Since the issuance of ASU 2016-13, the FASB released several amendments to improve and clarify the implementation guidance. These standards have been collectively codified within ASC Topic 326, Credit Losses (ASC 326). As a smaller reporting company as defined by the SEC, the provisions of ASC 326 are effective as of the beginning of our fiscal year 2024. We are currently evaluating the impacts of the provisions of ASC 326 on our financial condition, results of operations, cash flows, and disclosures.\nF -\nNote 3-Revenue Recognition\nOur revenue streams consist of wholesale, direct-to-consumer ecommerce and retail stores which are included in our Consolidated Statements of Operations. The table below identifies the amount and percentage of net sales by distribution channel (in thousands):\nYear Ended\nSeptember 2022\nSeptember 2021\n$\n%\n$\n%\nRetail\n$ 13,970\n%\n$ 11,222\n%\nDirect-to-consumer ecommerce\n4,647\n%\n6,662\n%\nWholesale\n466,242\n%\n418,866\n%\nNet Sales\n$ 484,859\n%\n$ 436,750\n%\nThe table below provides net sales by reportable segment (in thousands) and the percentage of net sales by distribution channel for each reportable segment:\nYear Ended September 2022\nNet Sales\nRetail\nDirect-to-Consumer ecommerce\nWholesale\nDelta Group\n$ 424,799\n0.1 %\n0.3 %\n99.6 %\nSalt Life Group\n60,060\n22.6 %\n5.6 %\n71.8 %\nTotal\n$ 484,859\nYear Ended September 2021\nNet Sales\nRetail\nDirect-to-Consumer ecommerce\nWholesale\nDelta Group\n$ 387,015\n0.2 %\n0.3 %\n99.5 %\nSalt Life Group\n49,735\n20.8 %\n11.0 %\n68.2 %\nTotal\n$ 436,750\nNote 4-Inventories\nInventories, net of reserves of $17.7 million and $15.9 million as of September 2022, and September 2021, respectively, consist of the following (in thousands):\nSeptember 2022\nSeptember 2021\nRaw materials\n$ 22,603\n$ 17,204\nWork in process\n23,501\n20,954\nFinished goods\n202,434\n123,545\n$ 248,538\n$ 161,703\nRaw materials include finished yarn and direct materials for the Delta Group, undecorated garments for the DTG2Go business, and direct embellishment materials for the Salt Life Group.\nF -\nNote 5-Property, Plant and Equipment\nProperty, plant and equipment consist of the following (in thousands, except economic life data):\nEstimated Useful Life (in years)\nSeptember 2022\nSeptember 2021\nLand and land improvements\n$\n$\nBuildings\n4,002\n3,741\nMachinery and equipment\n128,937\n113,193\nComputers and software\n3-10\n24,420\n24,373\nFurniture and fixtures\n7-25\n12,410\n11,493\nLeasehold improvements\n3-10\n7,876\n7,366\nVehicles and related equipment\nConstruction in progress\nN/A\n3,899\n5,477\n182,674\n166,835\nLess accumulated depreciation and amortization\n(108,565 )\n(99,271 )\nTotal property, plant and equipment, net\n$ 74,109\n$ 67,564\nNote 6-Goodwill and Intangible Assets\nGoodwill and components of intangible assets consist of the following (in thousands):\nSeptember 2022\nSeptember 2021\nCost\nAccumulated Amortization\nNet Value\nCost\nAccumulated Amortization\nNet Value\nEconomic Life\nGoodwill\n$ 37,897 $ - $ 37,897 $ 37,897 $ - $ 37,897 N/A\nIntangibles:\nTradename/trademarks\n$ 16,000 $ (4,851 ) $ 11,149 $ 16,000 $ (4,317 ) $ 11,683 20 - 30 yrs\nCustomer relationships\n7,400 (3,213 ) 4,187 7,400 (2,473 ) 4,927 20 yrs\nTechnology\n10,083 (2,610 ) 7,473 9,952 (1,715 ) 8,237 10 yrs\nLicense agreements\n2,100 (940 ) 1,160 2,100 (837 ) 1,263 15 - 30 yrs\nNon-compete agreements\n1,657 (1,600 ) 57 1,657 (1,476 ) 181 4 - 8.5 yrs\nTotal intangibles, net\n$ 37,240 $ (13,214 ) $ 24,026 $ 37,109 $ (10,818 ) $ 26,291\nGoodwill represents the acquired goodwill net of the cumulative impairment losses recorded in fiscal year 2011 of $0.6 million. As of September 2022, the Delta Group segment assets include $18.0 million of goodwill, and the Salt Life Group segment assets include $19.9 million of goodwill.\nDepending on the type of intangible assets, amortization is recorded under cost of goods sold or selling, general and administrative expenses. Amortization expense for intangible assets was $2.4 million for the year ended September 2022, and $1.8 million for the year ended September 2021. Amortization expense is estimated to be approximately $2.3 million for the years ended September 2023, 2024, and 2025, and approximately $2.2 million for the years ended September 2026 and 2027.\nF -\nNote 7-Accrued Expenses\nAccrued expenses consist of the following (in thousands):\nSeptember 2022\nSeptember 2021\nAccrued employee compensation and benefits\n$ 18,550\n$ 17,374\nTaxes accrued and withheld\n1,856\n2,960\nRefund liabilities\n1,067\nAccrued freight\n2,272\n1,662\nAccrued capital expenditures\n2,299\nDeferred purchase price (1)\n1,500\nAccrued interest\nOther\n2,382\n2,657\n$ 27,414\n$ 29,949\n(1) Unsecured liability associated with the purchase of intangible technology, of which the final quarterly installment of $500 was paid in the first quarter of fiscal 2023.\nNote 8-Long-Term Debt\nLong-term debt consists of the following (in thousands):\nSeptember 2022 September 2021\nRevolving U.S. credit facility, interest at base rate or adjusted SOFR rate plus an applicable margin (interest at 5.3% on September 2022) due June 2027\n$ 129,024 $ 98,575\nRevolving credit facility with Banco Ficohsa, a Honduran bank, interest at 7.25% as of September 2022 and 7.7% as of September 2021, due August 2025\n3,300 667\nTerm loan with Banco Ficohsa, a Honduran bank, interest at 7.5%, quarterly installments beginning September 2021 through December 2025\n6,593 8,621\nTerm loan with Banco Ficohsa, a Honduran bank, interest at 7.5%, quarterly installments beginning March 2023 through May 2027\n3,656 -\nTerm loan with Banco Ficohsa, a Panamanian bank, interest at the prevailing market rate within the Panamanian Banking Market (interest at 8.6% on September 2022), monthly installments beginning October 2022 through August 2027\n3,000 -\nDTG2Go, LLC acquisition promissory note, interest at 6.0%, quarterly payments beginning January 2019 through October 2021\n- 583\nSalt Life Beverage, LLC promissory note, interest at 4.0%\n353 301\n145,926 108,747\nLess current portion of long-term debt\n(9,176 ) (7,067 )\nLong-term debt, excluding current maturities\n$ 136,750 $ 101,680\nCredit Facility\nOn May 10, 2016, we entered into a Fifth Amended and Restated Credit Agreement (as further amended, the Amended Credit Agreement) with Wells Fargo Bank, National Association (Wells Fargo), as Administrative Agent, the Sole Lead Arranger and the Sole Book Runner, and the financial institutions named therein as Lenders, which are Wells Fargo, PNC Bank, National Association and Regions Bank. Our subsidiaries M.J. Soffe, LLC, Culver City Clothing Company (f/k/a Junkfood Clothing Company), Salt Life, LLC, and DTG2Go, LLC (f/k/a Art Gun, LLC) (collectively, the \"Borrowers\"), are co-borrowers under the Amended Credit Agreement. The Borrowers entered into amendments to the Amended Credit Agreement with Wells Fargo and the other lenders on November 27, 2017, March 9, 2018, October 8, 2018, November 19, 2019, April 27, 2020, August 28, 2020 and June 2, 2022.\nOn November 19, 2019, the Borrowers entered into a Consent and Fourth Amendment to the Fifth Amended and Restated Credit Agreement with Wells Fargo and the other lenders set forth therein (the \"Fourth Amendment\"). The Fourth Amendment, among other things, (i) increased the borrowing capacity under the Amended Credit Agreement from $145 million to $170 million (subject to borrowing base limitations), (ii) extended the maturity date from May 21, 2021 to November 19, 2024, (iii) reduced pricing on the revolver and first-in last-out \"FILO\" borrowing components by 25 basis points, and (iv) added 25% of the fair value of eligible intellectual property to the borrowing base calculation. In addition, the Fourth Amendment amended the definition of Fixed Charge Coverage Ratio to exclude up to $10 million of capital expenditures incurred by the Borrowers in connection with the expansion of their distribution facility located within the Town of Clinton, Anderson County, Tennessee.\nF -\nOn April 27, 2020, the Borrowers entered into a Fifth Amendment to the Fifth Amended and Restated Credit Agreement with Wells Fargo Bank (the Agent) and the other lenders set forth therein (the Fifth Amendment). The Fifth Amendment amends the financial covenant provisions from the amendment date through September 2020, including effectively lowering the minimum availability thresholds and removing the requirement that our Fixed Charge Coverage Ratio (FCCR) for the preceding 12-month period must not be less than 1.1 to 1.0. The Fifth Amendment also, among other things, (i) allowed for an additional 30 days of aged receivables from customers in the borrowing base through August 1, 2020, (ii) ceased amortization of real estate and machinery and equipment assets in the borrowing base through August 1, 2020, (iii) postponed amortization of trademark assets in the borrowing base until October 4, 2020; (iv) amends the definition of Fixed Charge Coverage Ratio to reference the monthly amortization of the borrowing bases that were amended as part of the Fourth Amendment to the Fifth Amended and Restated Credit Agreement on November 19, 2019, (v) amends the LIBOR rate definition to include a floor rate of 1.0%, and (vi) required weekly reporting of accounts receivable to the Agent through October 3, 2020.\nOn August 28, 2020, the Borrowers entered into a Sixth Amendment to the Fifth Amended and Restated Credit Agreement with Wells Fargo Bank (the Agent) and the other lenders set forth therein (the Sixth Amendment). The Sixth Amendment, (i) maintained lower minimum availability thresholds from the amendment date through July 3, 2021, (ii) allowed for an additional 30 days of aged receivables from customers in the borrowing base through April 3, 2021, (iii) increased the advance rate to 70% of real estate assets in the borrowing base and commences amortization on October 4, 2020, (iv) ceased amortization of machinery and equipment assets in the borrowing base through April 3, 2021, (v) postponed amortization of trademark assets in the borrowing base until April 4, 2021, (vi) required the Applicable Margin to be set at Level III through July 3, 2021 and increased the Applicable Margin by 50 basis points across all Levels within the Applicable Margin table for the remaining term of the Amended Credit Agreement, and (vii) required continued weekly reporting of accounts receivable to the Agent through July 3, 2021.\nOn June 2, 2022, the Borrowers entered into a Seventh Amendment to the Fifth Amended and Restated Credit Agreement with Wells Fargo Bank (the Agent) and the other lenders set forth therein (the Seventh Amendment). The Seventh Amendment, (i) removes obsolete LIBOR based borrowing and replaces it with SOFR (Secured Overnight Financing Rate) as an alternative elective pricing structure, (ii) amends the pricing structure based on SOFR plus a CSA (Credit Spread Adjustment) defined as 10 bps for 1 month and 15 bps for 3-month tenors, (iii) sets the SOFR floor to 0 bps, (iv) reloads the fair market value of real estate and intellectual property within the borrowing base calculation and resets their respective amortization schedules, (v) sets the maturity date to 5 years from the closing date, and (vi) reduces our Fixed Charge Coverage Ratio (FCCR) for the preceding 12-month period, if and when applicable, from 1.1 to 1.0.\nThe Amended Credit Agreement allows us to borrow up to $170 million (subject to borrowing base limitations), including a maximum of $25 million in letters of credit. Provided that no event of default exists, we have the option to increase the maximum credit to $200 million (subject to borrowing base limitations), conditioned upon the Administrative Agent's ability to secure additional commitments and customary closing conditions. The Amended Credit Agreement contains a subjective acceleration clause and a springing lockbox arrangement (as defined in ASC 470, Debt) whereby remittances from customers will be forwarded to our general bank account and will not reduce the outstanding debt until and unless a specified event or an event of default occurs. We classify borrowings under the Amended Credit Agreement as long-term debt with consideration of current maturities.\nOur U.S. revolving credit facility is secured by a first-priority lien on substantially all of the real and personal property of Delta Apparel, Junkfood, Soffe, Salt Life, and DTG2Go. All loans bear interest at rates, at the Company's option, based on either (a) an adjusted SOFR rate, subject to a floor of 0%, plus an applicable margin or (b) a base rate plus an applicable margin, with the base rate equal to the greater of (i) the Floor, (ii) the federal funds rate plus 0.5%, (iii) the Adjusted Term SOFR for a one month tenor in effect on such day plus 1.0%, or (iii) the prime rate announced by Wells Fargo, National Association. The facility requires monthly installment payments of approximately $0.2 to $0.3 million beginning October 4, 2020, in connection with fixed asset and intellectual property amortizations, and these amounts reduce the amount of availability under the facility. Annual facility fees are 0.25% or 0.375% (subject to average excess availability) of the amount by which $170 million exceeds the average daily principal balance of the outstanding loans and letters of credit accommodations. The annual facility fees are charged monthly based on the principal balances during the immediately preceding month.\nAt September 2022, we had $129.0 million outstanding under our U.S. revolving credit facility at an average interest rate of 5.3%. Our cash on hand combined with the availability under the U.S. credit facility totaled $34.6 million.\nOur credit facility includes a financial covenant that if the availability under our credit facility falls below the amounts specified in our credit agreement, our Fixed Charge Coverage Ratio (FCCR) (as defined in our credit agreement) for the preceding 12-month period must not be less than 1.0. Our availability at September 2022, was above the minimum thresholds specified in our credit agreement, and we were above the 1.0 FCCR for the preceding 12-month period.\nF -\nProceeds of the loans made pursuant to the Amended Credit Agreement may be used for permitted acquisitions (as defined in the Amended Credit Agreement), general operating expenses, working capital, other corporate purposes, and to finance credit facility fees and expenses. Pursuant to the terms of our credit facility, we are allowed to make cash dividends and stock repurchases if (i) as of the date of the payment or repurchase and after giving effect to the payment or repurchase, we have availability on that date of not less than 15% of the lesser of the borrowing base or the commitment, and average availability for the 30-day period immediately preceding that date of not less than 15% of the lesser of the borrowing base or the commitment; and (ii) the aggregate amount of dividends and stock repurchases after May 10, 2016, does not exceed $10 million plus 50% of our cumulative net income (as defined in the Amended Credit Agreement) from the first day of the third quarter of fiscal year 2016 to the date of determination. At September 2022, and September 2021, there was $24.9 million and $19.0 million, respectively, of retained earnings free of restrictions to make cash dividends or stock repurchases.\nPromissory Notes\nOn October 8, 2018, we acquired substantially all of the assets of Silk Screen Ink, Ltd. d/b/a SSI Digital Print Services. In conjunction with this acquisition, we issued a promissory note in the principal amount of $7.0 million. The promissory note bears interest of 6% with quarterly payments that began January 2, 2019, with the final installment paid October 4, 2021. As of September 2022, there was no amount outstanding for this note.\nHonduran Debt\nSince March 2011, we have entered into term loans and a revolving credit facility with Banco Ficohsa, a Honduran bank, to finance both the operations and capital expansion of our Honduran facilities. In December 2020, we entered into a new term loan and revolving credit facility with Banco Ficohsa, both with five-year terms, and simultaneously settled the prior term loans and revolving credit facility with outstanding balances at the time of settlement of $1.1 million and $9.5 million, respectively. In May 2022, we entered into a new term loan with a five-year term with a principal amount of $3.7 million. Each of these loans are secured by a first-priority lien on the assets of our Honduran operations and is not guaranteed by our U.S. entities. These loans are denominated in U.S. dollars, and the carrying value of the debt approximates its fair value. Information about these loans and the outstanding balance as of September 2022, is listed as part of the long-term debt schedule above.\nEl Salvador Debt\nIn September 2022 we entered into a new term loan with a five-year term with a principal amount of $3.0 million with Banco Ficohsa, a Panamanian bank, to finance our El Salvador operations. This loan is secured by a first-priority lien on the assets of our El Salvador operations and is not guaranteed by our U.S. entities. The loan is denominated in U.S. dollars, and the carrying value of the debt approximates its fair value. Information about this loan and the outstanding balance as of September 2022, is listed as part of the long-term debt schedule above.\nTotal Debt\nThe aggregate maturities of debt at September 2022, are as follows (in thousands):\nSeptember\nAmount\n$ 9,176\n7,702\n6,853\n5,450\n116,745\nThereafter\n-\n$ 145,926\nNote 9-Income Taxes\nThe Tax Cuts and Jobs Act of 2017 (the New Tax Legislation) was enacted on December 22, 2017, which significantly revised the U.S. corporate income tax code by, among other things, lowering federal corporate income tax rates, implementing a modified territorial tax system and imposing a repatriation tax, (\"transition tax\"), on deemed repatriated cumulative earnings of foreign subsidiaries which will be paid over eight years. In addition, new taxes were imposed related to foreign income, including a tax on global intangible low-taxed income (GILTI) as well as a limitation on the deduction for business interest expense (Section 163(j)\"). GILTI is the excess of the shareholders net controlled foreign corporations, (\"CFC\") net tested income over the net deemed tangible income. The Section 163(j) limitation does not allow the amount of deductible interest to exceed the sum of the taxpayer's business interest income or 30% of the taxpayers adjusted taxable income. We have included in our calculation of our effective tax rate the estimated impact of GILTI and Section 163(j) which were effective for us beginning fiscal year 2019. We have elected to account for the tax on GILTI as a period cost and, therefore, do not record deferred taxes related to GILTI on our foreign subsidiaries.\nF -\nThe Coronavirus Aid, Relief, and Economic Security Act (CARES Act), which was enacted on March 27, 2020, provided temporary changes to income and non-income-based tax laws, including some provisions which were previously enacted under the New Tax Legislation. The CARES Act revised the U.S. corporate income tax code on a temporary basis by, among other things, eliminating the 80% of taxable income limitation on net operating loss (NOL) carryforwards, allowing NOL carrybacks, and increasing the Section 163(j) interest limitation deduction from 30% to 50% of adjusted taxable income. We have included the estimated impact of these provisions in our effective tax rate calculation.\nThe provision for income taxes consists of the following (in thousands):\nYear Ended\nSeptember 2022\nSeptember 2021\nCurrent:\nFederal\n$ 921 $ 1,579\nState\n203 449\nForeign\n195 135\nTotal current\n$ 1,319 $ 2,163\nDeferred:\nFederal\n$ 2,532 $ 3,327\nState\n456 215\nTotal deferred\n2,988 3,542\nProvision for income taxes\n$ 4,307 $ 5,705\nFor financial reporting purposes our income before provision for income taxes includes the following components (in thousands):\nYear Ended\nSeptember 2022\nSeptember 2021\nUnited States, net of (income) loss attributable to non-controlling interest\n$ 10,746 $ 15,505\nForeign\n13,301 10,496\n$ 24,047 $ 26,001\nOur effective income tax rate on operations for 2022 was 17.9% compared to a rate of 21.9% in the prior year. We generally benefit from having income in foreign jurisdictions that are either exempt from income taxes or have tax rates that are lower than those in the United States. As such, changes in the mix of U.S. taxable income compared to profits in tax-free or lower-tax jurisdictions can have a significant impact on our overall effective tax rate. In addition, the future impact of the CARES Act and New Tax Legislation may differ from historical amounts, possibly materially, due to, among other things, changes in interpretations and assumptions made regarding the CARES Act and New Tax Legislation, guidance that may be issued, and actions we may take as a result of the CARES Act and New Tax Legislation.\nA reconciliation between the actual provision for income taxes and the provision for income taxes computed using the federal statutory income tax rate of 21.0% for fiscal years 2022 and 2021 is as follows (in thousands):\nYear Ended\nSeptember 2022\nSeptember 2021\nIncome tax expense at the statutory rate of 21.0%\n$ 5,050 $ 5,460\nState income tax benefits, net of federal income tax benefit\n553 653\nImpact of foreign earnings in tax-free zone\n(2,598 ) (2,070 )\nGILTI inclusion\n1,237 1,063\nOther permanent differences\n(179 ) (69 )\nImpact of state rate changes\n10 (70 )\nPermanent reinvestment of foreign earnings\n178 728\nOther\n56 10\nProvision for income taxes\n$ 4,307 $ 5,705\nF -\nSignificant components of our deferred tax assets and liabilities are as follows (in thousands):\nSeptember 2022\nSeptember 2021\nDeferred tax assets:\nState net operating loss carryforwards\n$ 1,997 $ 2,239\nReceivable allowances and reserves\n300 314\nInventories and reserves\n1,649 883\nAccrued compensation and benefits\n2,948 3,002\nOperating lease liabilities\n10,039 8,801\nOther\n4,670 4,258\nGross deferred tax assets\n$ 21,603 $ 19,497\nLess valuation allowance - state net operating loss carryforwards\n(640 ) (586 )\nNet deferred tax assets\n$ 20,963 $ 18,911\nDeferred tax liabilities:\nDepreciation\n$ (7,242 ) $ (4,647 )\nGoodwill and intangibles\n(6,038 ) (4,943 )\nOperating lease assets\n(9,720 ) (8,367 )\nOther\n(931 ) (620 )\nGross deferred tax liabilities\n$ (23,931 ) $ (18,577 )\nNet deferred tax (liabilities) assets\n$ (2,968 ) $ 334\nAs of September 2022, we had state net operating losses of approximately $41.6 million, with deferred tax assets of $2.0 million related to these state NOLs, and related valuation allowances against them of approximately $0.6 million. These state net loss carryforwards expire at various intervals from 2027 through 2040. Our deferred tax asset related to state net operating loss carryforwards is reduced by a valuation allowance to result in net deferred tax assets we consider more likely than not to be realized.\nFor both federal and state purposes, the ultimate realization of deferred tax assets depends upon the generation of future taxable income or tax planning strategies during the periods in which those temporary differences become deductible or when the carryforwards are available.\nASC 740, Income Taxes requires that a position taken or expected to be taken in a tax return be recognized in the financial statements when it is more-likely-than-not (i.e., a likelihood of more than fifty percent) that the position would be sustained upon examination by tax authorities. A recognized tax position is then measured at the largest amount of benefit that is greater than 50% likely of being realized upon ultimate settlement. Accrued interest and penalties related to unrecognized tax benefits would also be recorded. We did not have any material unrecognized tax benefits as of September 2022 or September 2021.\nAs of September 2022, we are indefinitely reinvested in the cumulative undistributed earnings of and original investments in our foreign subsidiaries, with the exception of our equity method investment, which has been properly accounted for. Future remittances could be subject to additional foreign withholding taxes, U.S. state taxes, and certain tax impacts relating to foreign currency exchange effects. It is not practicable to estimate the amount of any unrecognized tax effects on these reinvested earnings and original investments in foreign subsidiaries.\nWe file income tax returns in the U.S. federal jurisdiction and various state, local and foreign jurisdictions. Tax years 2018, 2019, 2020, and 2021, according to statute and with few exceptions, remain open to examination by various federal, state, local, and foreign jurisdictions.\nNote 10-Leases\nWe lease property and equipment under operating lease arrangements, most of which relate to distribution centers and manufacturing facilities in the U.S., Honduras, El Salvador, and Mexico. We also lease machinery and equipment in the U.S. under finance lease arrangements. We include both the contractual term as well as any renewal option that we are reasonably certain to exercise in the determination of our lease terms. For leases with a term of greater than 12 months, we value lease liabilities and the related assets as the present value of the lease payments over the related term. We apply the short-term lease exception to leases with a term of 12 months or less and exclude such leases from our Condensed Consolidated Balance Sheet. Payments related to these short-term leases are expensed on a straight-line basis over the lease term and are reflected as a component of lease cost within our Condensed Consolidated Statements of Operations. Our operating lease agreements for buildings generally include provisions for the payment of our proportional share of operating costs, property taxes, and other variable payments. These incremental payments are excluded from our calculation of operating lease liabilities and right of use assets. We have elected to use the practical expedient present in ASC 842 to not separate lease and non-lease components for all significant underlying asset classes and instead account for them together as a single lease component in the measurement of our lease liabilities.\nF -\nGenerally, the rate implicit in our operating leases is not readily determinable. Therefore, we discount future lease payments using our estimated incremental borrowing rate at lease commencement. We determine this rate based on a credit-adjusted risk-free rate, which approximates a secured rate over the lease term. The weighted average discount rate for operating leases was 4.6% and 4.3% as of September 2022 and September 2021, respectively. We discount our finance lease payments based on the rate implicit and stated in the lease. The weighted average discount rate for finance leases was 5.7% and 5.8% as of September 2022 and September 2021, respectively.\nThe following table presents the future undiscounted payments due on our operating and finance lease liabilities as well as a reconciliation of those payments to our operating and finance lease liabilities, recorded as of September 2022 (in thousands):\nOperating\nFinance\nLeases\nLeases\n$ 10,919 $ 9,339\n9,891 7,859\n9,855 5,944\n8,195 3,342\n6,589 881\nThereafter\n14,368 -\nUndiscounted fixed lease payments\n$ 59,817 $ 27,365\nDiscount due to interest\n(8,220 )\n(2,426 )\nTotal lease liabilities\n$ 51,597 $ 24,939\nLess current maturities\n(8,876 )\n(8,163 )\nLease liabilities, excluding current maturities\n$ 42,721 $ 16,776\nAs of September 2022, we have entered into certain operating leases that have not yet commenced, but the annual fixed lease payments are not significant.\nOur Ceiba Textiles manufacturing facility is leased under an operating lease arrangement with a Honduran company, of which we own 31% of the outstanding capital stock of the lessor at September 2022. During 2022 and 2021, we paid approximately $1.8 million respectively in lease payments under this arrangement.\nAs of September 2022, and September 2021, we had $50.3 million and $45.3 million, respectively, of operating lease ROU assets which were reflected within Operating lease assets in our Consolidated Balance Sheet, and $32.1 million and $26.7 million, respectively, of finance lease ROU assets, which were reflected within Property, plant, and equipment, net in our Consolidated Balance Sheet.\nThe weighted average remaining lease terms for our operating leases and finance leases were approximately 6 years and 3 years, respectively, as of September 2022. As of September 2021, the average remaining lease terms were 7 years and 3 years, respectively.\nThe components of total lease expense were as follows for the period ended September 2022 (in thousands):\nOperating lease fixed expense\n$ 11,568\nOperating lease variable cost expense\n2,536\nFinance lease amortization of ROU assets expense\n4,468\nFinance lease interest expense\n1,391\nTotal lease expense\n$ 19,963\nCash outflows for operating lease payments were $12.0 million during 2022 and $11.0 million during 2021. Cash outflows for interest payments on finance leases were $1.4 million and $1.2 million during 2022 and 2021, respectively. These outflows are classified within net cash provided by (used in) operating activities on the Consolidated Statement of Cash Flows. Cash outflows for finance lease payments during 2022 and 2021 were $7.7 million and $7.0 million, respectively, and are classified within net cash used in financing activities on the Consolidated Statement of Cash Flows.\nROU assets obtained in exchange for operating lease liabilities during 2022 and 2021 were $13.9 million and $1.2 million, respectively. ROU assets obtained in exchange for finance lease liabilities during 2022 and 2021 were $10.4 million and $12.3 million, respectively.\nWe do not have significant leasing transactions in which we are the lessor.\nF -\nNote 11-Employee Benefit Plans\nWe sponsor and maintain a 401(k) retirement savings plan (the 401(k) Plan) for our employees who meet certain requirements. The 401(k) Plan permits participants to make pre-tax contributions by salary reduction pursuant to Section 401(k) of the Internal Revenue Code, as well as a Roth Plan that allows for after tax contributions. The 401(k) Plan requires for us to make a guaranteed match of a defined portion of the employees contributions. We contributed $0.9 million to the 401(k) Plan during 2022 and 2021, respectively.\nWe provide post-retirement life insurance benefits for certain retired employees. The plan is noncontributory and is unfunded, and therefore, benefits and expenses are paid from our general assets as they are incurred. All of the employees in the plan are fully vested, and the plan was closed to new employees in 1990. The discount rate used in determining the liability was 6.0% for 2022 and 2021. The following table presents the benefit obligation, which is included in accrued expenses in the accompanying balance sheets (in thousands).\nSeptember 2022\nSeptember 2021\nBalance at beginning of year\n$ 271 $ 289\nInterest expense\n- -\nBenefits paid\n(7 ) (18 )\nBalance at end of year\n$ 264 $ 271\nNote 12-Stock-Based Compensation\nOn February 6, 2020, our shareholders approved the Delta Apparel, Inc. 2020 Stock Plan (\"2020 Stock Plan\") to replace the 2010 Stock Plan, which was previously re-approved by our shareholders on February 4, 2015, and was scheduled to expire by its terms on September 14, 2020. The 2020 Stock Plan is substantially similar in both form and substance to the 2010 Stock Plan. The purpose of the 2020 Stock Plan is to continue to give our Board of Directors and its Compensation Committee the ability to offer a variety of compensatory awards designed to enhance the Companys long-term success by encouraging stock ownership among its executives, key employees and directors. Under the 2020 Stock Plan, the Compensation Committee of our Board of Directors has the authority to determine the employees and directors to whom awards may be granted and the size and type of each award and manner in which such awards will vest. The awards available under the plan consist of stock options, stock appreciation rights, restricted stock, restricted stock units, performance stock, performance units, and other stock and cash awards. If a participant dies or becomes disabled (as defined in the 2020 Stock Plan) while employed by the Company or serving as a director, all unvested awards become fully vested. The Compensation Committee is authorized to establish the terms and conditions of awards granted under the 2020 Stock Plan, to establish, amend and rescind any rules and regulations relating to the 2020 Stock Plan, and to make any other determinations that it deems necessary. The aggregate number of shares of common stock that may be delivered under the 2020 Stock Plan is 449,714 plus any shares of common stock subject to outstanding awards under the 2010 Stock Plan that are subsequently forfeited or terminated for any reason before being exercised. Similar to the 2010 Stock Plan, the 2020 Stock Plan limits the number of shares that may be covered by awards to any participant in a given calendar year and also limits the aggregate awards of restricted stock, restricted stock units and performance stock granted in a given calendar year. The 2010 Stock Plan terminated and the 2020 Stock Plan became effective on February 6, 2020, the date of shareholders approval.\nShares are generally issued from treasury stock upon the vesting of the restricted stock units, performance units or other awards under the 2020 Stock Plan.\nCompensation expense is recorded on the selling, general and administrative expense line item in our Consolidated Statements of Operations over the vesting periods. Total employee stock-based compensation expense for 2022 and 2021 was $3.2 million and $2.5 million, respectively. Associated with the compensation cost are income tax benefits recognized of $0.6 million for 2022 and $0.6 million for 2021.\nF -\nThe following table summarizes the restricted stock unit and performance unit award activity during the periods ended September 2022 and September 2021:\nYear Ended\nSeptember 2022\nSeptember 2021\nNumber of Units\nWeighted average grant date fair value\nNumber of Units\nWeighted average grant date fair value\nUnits outstanding, beginning of fiscal period\n260,000 $ 20.38 406,000 $ 20.16\nUnits granted\n319,950 $ 30.09 12,000 $ 30.80\nUnits issued\n(144,700 ) $ 19.42 (116,000 ) $ 18.96\nUnits forfeited\n(50,000 ) $ 27.72 (42,000 ) $ 25.17\nUnits outstanding, end of fiscal period\n385,250 $ 27.85 260,000 $ 20.38\nDuring 2022, performance units and restricted stock units representing 47,700 and 95,000 shares of our common stock, respectively, vested upon the filing of our Annual Report on Form 10-K for the year ended September 2021, and were issued in accordance with their respective agreements. Of these vested units, 96,350 were paid in common stock and 46,350 were paid in cash.\nDuring 2022, restricted stock units and performance units representing 1,000 and 1,000 shares of our common stock, respectively, anticipated to vested upon the filing of our Annual Report on Form 10-K for the year ended September 2022, vested immediately due to a change in employee status and were issued. Of these units, 1,000 were paid in common stock and 1,000 were paid in cash. Additionally, during the fiscal year, previously issued restricted stock awards representing 50,000 shares of our common stock were forfeited due to the failure to achieve the performance criteria specified in the award agreement.\nDuring 2021, restricted stock units representing 12,000 shares of our common stock were granted and are eligible to vest upon the filing of our Annual Report on Form 10-K for the year ended September 2022. These restricted stock units are payable in common stock.\nDuring 2022, restricted stock units representing 15,000 shares of our common stock were granted and are eligible to vest upon the filing of our Annual Report on Form 10-K for the year ended September 2022. These restricted stock units are payable in common stock.\nDuring 2022, restricted stock units and performance units representing 110,625 and 68,625 shares of our common stock were granted and are eligible to vest upon the filing of our Annual Report on Form 10-K for the year ended September 2023. These restricted stock units and performance units are payable pone-half in common stock and one-half in cash.\nDuring 2022, restricted stock units and performance units representing 52,000 and 10,000 shares of our common stock were granted and are eligible to vest upon the filing of our Annual Report on Form 10-K for the year ended September 2024. These restricted stock units and performance units are payable one-half in common stock and one-half in cash. In addition, restricted stock units representing 59,000 shares were granted and are eligible to vest upon the filing of our Annual Report on Form 10-K for the year ended September 2024. These restricted stock units are payable in common stock.\nAs of September 2022, there was $4.7 million of total unrecognized compensation cost related to unvested restricted stock units and performance units under the 2020 Stock Plan. This cost is expected to be recognized over a period of 2.2 years.\nThe following table summarizes information about the unvested restricted stock units and performance units as of September 2022.\nRestricted Stock Units/Performance Units\nNumber of Units\nAverage Market Price on Date of Grant\nVesting Date*\nFiscal Year 2022 Restricted Units\n105,000 $ 21.04 November 2022\nFiscal Year 2023 Restricted Units\n98,126 $ 30.07 November 2023\nFiscal Year 2023 Performance Units\n61,124 $ 27.94 November 2023\nFiscal Year 2024 Restricted Units\n111,000 $ 30.07 November 2024\nFiscal Year 2024 Performance Units\n10,000 $ 30.15 November 2024\n385,250\n* These awards are eligible to vest upon the filing of our Annual Report on Form 10-K for the applicable fiscal year, which is anticipated to be during the month and year indicated in this column.\nF -\nNote 13-Business Segments\nOur operations are managed and reported in two segments, Delta Group and Salt Life Group, which reflect the manner in which the business is managed, and results are reviewed by the Chief Executive Officer, who is our chief operating decision maker.\nThe Delta Group is comprised of the following business units, which are primarily focused on core activewear styles: DTG2Go and Delta Activewear.\nDTG2Go a market leader in the on-demand, direct-to-garment digital print and fulfillment industry, bringing technology and innovation to the supply chains of our many customers. Our ‘On-Demand DC digital solution provides retailers and brands with immediate access to utilize DTG2Gos broad network of print and fulfillment facilities, while offering the scalability to integrate digital fulfillment within the customer's own distribution facilities. We use highly-automated factory processes and our proprietary software to deliver on-demand, digitally printed apparel direct to consumers on behalf of our customers. Via our eight fulfillment facilities throughout the United States, DTG2Go offers a robust digital supply chain, shipping custom graphic products within 24 to 48 hours to consumers in the United States and to over 100 countries worldwide. DTG2Go has made significant investments in its digital-first retail model providing digital graphic prints that meet the high-quality standards required for brands, retailers and intellectual property holders. In fiscal 2022, we continued to invest in our proprietary software, new digital print equipment, and research and development initiatives related to the setups, formulas and processes needed to serve our customers. Through integration with Delta Activewear, DTG2Go also services the eRetailer, ad-specialty, promotional and screen print marketplaces, among others.\nDelta Activewear is a preferred supplier of activewear apparel to regional and global brands as well as direct to retail and wholesale markets. The Activewear business is organized around three key customer channels - Delta Direct, Global Brands, and Retail Direct - that are distinct in their go-to-market strategies and how their respective customer bases source their various apparel needs. Our Delta Direct channel services the screen print, promotional, and eRetailer markets as well as retail licensing customers that sell through to many mid-tier and mass market retailers. Delta Direct products include a broad portfolio of apparel and accessories under the Delta, Delta Platinum, and Soffe brands as well as sourced items from select third party brands. Our fashion basics line includes our Platinum Collection, which offers fresh, fashionable silhouettes with a luxurious look and feel, as well as versatile fleece offerings. We offer innovative apparel products, including the Delta Dri line of performance shirts built with moisture-wicking material to keep athletes dry and comfortable; ringspun garments with superior comfort, style and durability; and Delta Soft, a collection with an incredible feel and price. We also offer our heritage, mid- and heavier-weight Delta Pro Weight® and Magnum Weight® tee shirts.\nThe iconic Soffe brand offers activewear for spirit makers and record breakers and is widely known for the original \"cheer short\" with the signature roll-down waistband. Soffe carries a wide range of activewear for the entire family. Soffe's heritage is anchored in the military, and we continue to be a proud supplier to both active duty and veteran United States military personnel worldwide. The Soffe men's assortment features the tagline \"anchored in the military, grounded in training\" and offers everything from physical training gear certified by the respective branches of the military, classic base layers that include the favored 3-pack tees, and the iconic \"ranger panty.\" Complementing the Delta and Soffe brand apparel, we provide our customers with a broad range of product categories with nationally recognized branded products including polos, outerwear, headwear, bags and other accessories. Our Soffe products are also available direct to consumers at www.soffe.com.\nOur Global Brands channel serves as a key supply chain partner to large multi-national brands, major branded sportswear companies, trendy regional brands, and all branches of the United States armed forces, providing services ranging from custom product development to shipment of branded products with retail-ready value-added services including embellishment, hangtags, and ticketing.\nOur Retail Direct channel serves brick and mortar and online retailers by providing our portfolio of Delta, Delta Platinum, and Soffe products directly to the retail locations and ecommerce fulfillment centers of a diversified customer base including sporting goods and outdoor retailers, specialty and resort shops, farm and fleet stores, department stores, and mid-tier retailers.\nAs a key element of the integrated Delta Group segment, each of Activewears primary channels offer a seamless solution for small-run decoration needs with on-demand digital print services, powered by DTG2Go.\nThe Salt Life Group is comprised of our Salt Life business, which is built on the authentic, aspirational Salt Life lifestyle brand that represents a passion for the ocean, the salt air, and, more importantly, a way of life and all it offers, from surfing, fishing, and diving to beach fun and sun-soaked relaxation. The Salt Life brand combines function and fashion with a tailored fit for the active lifestyles of those that live the Salt Life. With increased worldwide appeal, Salt Life has continued to provide the cotton graphic tees and logo decals that originally drove awareness for the brand, and expanded into performance apparel, swimwear, board shorts, sunglasses, bags, and accessories. In fiscal 2022, Salt Life grew its retail footprint to include 21 stores across the U.S. coastline from Southern California to Key West and up the eastern seaboard to Rehoboth Beach, Delaware. Consumers can also seamlessly experience the Salt Life brand through retail partners including surf shops, specialty stores, department stores, and outdoor merchants or by accessing our Salt Life ecommerce site at www.saltlife.com.\nOur Chief Operating Decision Maker and management evaluate performance and allocate resources based on profit or loss from operations before interest, income taxes and special charges (\"segment operating earnings\"). Our segment operating earnings may not be comparable to similarly titled measures used by other companies. The accounting policies of our reportable segments are the same as those described in Note 2. Intercompany transfers between operating segments are transacted at cost and have been eliminated within the segment amounts shown in the following table (in thousands).\nF -\nYear Ended\nSeptember 2022\nSeptember 2021\nSegment net sales:\nDelta Group\n$ 424,799 $ 387,015\nSalt Life Group\n60,060 49,735\nTotal net sales\n$ 484,859 $ 436,750\nSegment operating income:\nDelta Group\n$ 38,045 $ 39,956\nSalt Life Group\n8,187 5,793\nTotal segment operating income\n$ 46,232 $ 45,749\nPurchases of property, plant and equipment:\nDelta Group\n$ 8,400 $ 5,115\nSalt Life Group\n3,978 471\nTotal purchases of property, plant and equipment\n$ 12,378 $ 5,586\nDepreciation and amortization:\nDelta Group\n$ 13,376 $ 12,133\nSalt Life Group\n1,656 1,621\nTotal depreciation and amortization\n$ 15,032 $ 13,754\nThe following reconciles the segment operating income to the consolidated income before provision for income taxes (in thousands):\nYear Ended\nSeptember 2022\nSeptember 2021\nSegment operating income\n$ 46,232 $ 45,749\nUnallocated corporate expenses\n14,451 13,038\nUnallocated interest expense\n7,732 6,844\nConsolidated income before provision for income taxes\n$ 24,049 $ 25,867\nOur revenues include sales to domestic and foreign customers. Foreign customers are composed of companies whose headquarters are located outside of the United States. Sales to foreign customers represented less than 1% of our consolidated net sales for both fiscal years 2022 and 2021.\nF -\nOur total assets and equity investment by segment are as follows (in thousands):\nAs of\nSeptember 2022\nSeptember 2021\nTotal assets by segment:\nDelta Group\n$ 426,406 $ 366,518\nSalt Life Group\n90,580 63,184\nCorporate\n6,695 4,586\nTotal assets\n$ 523,681 $ 434,288\nEquity investment in joint venture:\nDelta Group\n$ 9,886 $ 10,433\nSalt Life Group\n- -\nTotal equity investment in joint venture\n$ 9,886 $ 10,433\nWe attribute our property, plant and equipment to a particular country based on the location of these assets. Summarized financial information by geographic area is as follows (in thousands):\nAs of\nSeptember 2022\nSeptember 2021\nUnited States\n$ 54,200 $ 50,945\nHonduras\n13,366 12,247\nEl Salvador\n5,381 3,253\nMexico\n1,162 1,119\nAll foreign countries\n19,909 16,619\nTotal property, plant and equipment, net\n$ 74,109 $ 67,564\nNote 14-Repurchase of Common Stock\nOur Board of Directors has authorized management to use up to $60.0 million to repurchase stock in open market transactions under our Stock Repurchase Program. During 2022, we purchased 136,181 shares of our common stock for a total cost of $4.0 million. There were no purchases of our common stock during 2021. As of September 2022, we have purchased 3,735,114 shares of common stock for an aggregate of $56.4 million since the inception of the Stock Repurchase Program. All purchases were made at the discretion of management and pursuant to the safe harbor provisions of SEC Rule 10b-18. As of September 2022, $3.6 million remained available for future purchases under our Stock Repurchase Program, which does not have an expiration date.\nNote 15-Commitments and Contingencies\n(a) Litigation\nAt times, we are party to various legal claims, actions and complaints. We believe that, as a result of legal defense, insurance arrangements, and indemnification provisions with parties believed to be financially capable, such actions should not have a material adverse effect on our operations, financial condition, or liquidity.\nF -\n(b) Purchase Contracts\nWe have entered into agreements, and have fixed prices, to purchase yarn, finished fabric, and finished apparel and headwear products. At September 2022, minimum payments under these contracts were as follows (in thousands):\nYarn\n$ 23,677\nFinished fabric\n7,823\nFinished products\n31,580\n$ 63,080\n(c) Letters of Credit\nAs of September 2022, we had outstanding standby letters of credit totaling $0.4 million.\n(d) Fair Value Measurements\nFrom time to time, we may use interest rate swaps or other instruments to manage our interest rate exposure and reduce the impact of future interest rate changes. These financial instruments are not used for trading or speculative purposes. The following financial instruments were outstanding as of September 2022:\nEffective Date\nNotional Amount\nLIBOR Rate\nMaturity Date\nInterest Rate Swap\nJuly 25, 2018\n$20 million\n3.18%\nJuly 25, 2023\nFrom time to time, we may purchase cotton option contracts to economically hedge the risk related to market fluctuations in the cost of cotton used in our operations. We do not receive hedge accounting treatment for these derivatives. As such, the realized and unrealized gains and losses associated with them are recorded within cost of goods sold on the Consolidated Statement of Operations. No such cotton contracts were outstanding as of September 2022, or September 2021.\nASC 820, Fair Value Measurements and Disclosures defines fair value, establishes a framework for measuring fair value and expands disclosures about fair value measurements. Assets and liabilities measured at fair value are grouped in three levels. The levels prioritize the inputs used to measure the fair value of the assets or liabilities. These levels are:\n○\nLevel 1 - Quoted prices (unadjusted) in active markets for identical assets or liabilities.\n○\nLevel 2 - Inputs other than quoted prices that are observable for assets and liabilities, either directly or indirectly. These inputs include quoted prices for similar assets or liabilities in active markets and quoted prices for identical or similar assets or liabilities in market that are less active.\n○\nLevel 3 - Unobservable inputs that are supported by little or no market activity for assets or liabilities and includes certain pricing models, discounted cash flow methodologies and similar techniques.\nThe following financial liabilities are measured at fair value on a recurring basis (in thousands):\nFair Value Measurements Using\nPeriod Ended\nTotal\nQuoted Prices in Active Markets for Identical Assets (Level 1)\nSignificant Other Observable Inputs (Level 2)\nSignificant Unobservable Inputs (Level 3)\nInterest Rate Swap\nSeptember 2022\n$ 189 $ - $ 189 $ -\nSeptember 2021\n$ (1,052 ) $ - $ (1,052 ) $ -\nContingent Consideration\nSeptember 2022\n$ - $ - $ - $ -\nSeptember 2021\n$ (1,897 ) $ - $ - $ (1,897 )\nThe fair value of the interest rate swap agreements was derived from a discounted cash flow analysis based on the terms of the contract and the forward interest rate curves adjusted for our credit risk, which fall in Level 2 of the fair value hierarchy. At September 2022 and September 2021, book value for fixed rate debt approximates fair value based on quoted market prices for the same or similar issues or on the current rates offered to us for debt of the same remaining maturities (a Level 2 fair value measurement).\nF -\nThe following table summarizes the fair value and presentation in the Consolidated Balance Sheets for derivatives as of September 2022, and September 2021.\nSeptember 2022\nSeptember 2021\nDeferred tax asset\n$ (48 ) $ 266\nOther assets\n189 -\nOther liabilities\n- (1,052 )\nAccumulated other comprehensive gain (loss)\n$ 141 $ (786 )\nThe DTG2Go acquisition purchase price consisted of additional payments contingent on the combined businesses' achievement of certain performance targets related to sales and earnings before interest, taxes, depreciation and amortization for the period from April 1, 2018, through September 29, 2018, as well as for fiscal years 2019, 2020, 2021 and 2022. At September 2022, no amount was accrued for contingent consideration related to the acquisition of DTG2Go, compared to the accrual of $1.9 million at September 2021.\nNote 16-Subsequent Events\nNone.\nF -\nF - 29"
}