{
    "cik": "1106861",
    "company": "FLASHZERO CORP.",
    "filing_type": "10-K",
    "filing_date": "2022-11-21",
    "period_of_report": "2008-12-31",
    "sic": "7372",
    "state_of_inc": "WY",
    "state_location": "2M",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1106861/0001683168-22-007923-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1106861/000168316822007923/flash_10k-123108.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1106861/0001683168-22-007923.txt",
    "filename": "1106861_10K_2008_0001683168-22-007923.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\n(Note: The following constituted our business plan during the 2007, and up to the end of fiscal 2009. After an analysis of the lack of progress, the Company filed a Form 15 with the SEC on July 28, 2010. The new Board has determined to seek other opportunities, and so the following plan is no longer effective.)\nBusiness Development\nWe were incorporated in the State of Nevada on September 25, 1996 as D.W.C. Installations, Inc. We changed our name to The Childrens Internet, Inc. on December 27, 2002. We are a development stage company and currently have no significant revenues, no marketing budget, only minimal assets, and have incurred losses since our inception. The Company is currently authorized to conduct business in California, and as of July 15, 2007 the Company is located in San Ramon, California.\nThe Company was primarily inactive until July 3, 2002 when Shadrack Films, Inc. (Shadrack) purchased 2,333,510 newly-issued shares of the Companys common stock for $150,000, thereby obtaining a majority ownership interest in the Company. Our former Chief Executive Officer and the Chairman of our Board of Directors, Sholeh Hamedani, is the sole officer, director and shareholder of Shadrack.\nThe Company is considered to be a development stage company even though its planned principal operations have commenced, because there have been no significant revenues earned by the Company to date. Through December 31, 2007, the Company devoted the majority of its efforts to activities focused on marketing, on financial planning, raising capital, developing sales strategies and new marketing materials and implementing its business plan. The Company markets, sells, and administers a secure Internet service and safe online community for children. The system, known as The Childrens Internet®, is not owned by the Company, but is owned by a related party, Two Dog Net, Inc. (Two Dog Net or TDN). Sholeh Hamedani was President of TDN until she resigned on August 1, 2002. Ms. Hamedani, currently owns approximately 10% of the total outstanding shares of common stock of TDN. Ms. Hamedanis father, Nasser Hamedani, is the Chief Executive Officer, Chairman and majority shareholder of TDN and has been since TDNs inception in July of 1995.\nThe Companys marketing, selling and administration rights derive from a Wholesale Sales and Marketing Agreement the Company entered into with Two Dog Net on September 10, 2002, which was amended in February 2005 (the Licensing Agreement). The Licensing Agreement gives us the exclusive worldwide right to market, sell, and distribute The Childrens Internet® service and wholesale dial-up Internet service of Two Dog Net. The Licensing Agreement is effective through the year 2013 and includes the ability to obtain five year extensions. It is a condition to the closing of the DSPA (as defined below), that the Licensing Agreement be cancelled and that Two Dog Net transfer to the Company the intellectual property related to The Childrens Internet®.\nOn October 19, 2007, the Company entered into the Definitive Stock Purchase Agreement (the DSPA or the Definitive Stock Purchase Agreement) between the Company, Shadrack, The Childrens Internet Holding Company, LLC (TCI Holding), Sholeh Hamedani, and Richard Lewis, the Companys Acting Chief Executive Officer and Chief Financial Officer, as reported in the Companys Form 8-K filed on October 25, 2007. Pursuant to the DSPA, as amended from time to time, TCI Holding has agreed to purchase a controlling interest in the Company. In the event the transaction contemplated under the DSPA is not consummated, a pending suit against the Company by the Securities and Exchange Commission (the SEC), which is further described below, raises substantial doubt concerning the Companys ability to continue as a going concern. The ability of the Company to continue as a going concern is dependent on its ability to generate profitable operations in the future by implementing its business plan and/or to obtain the necessary financing to meet its obligations, and to repay its liabilities arising from normal business operations when they come due. The outcome of these matters cannot be predicted with any certainty at this time. Management plans to provide for the Companys capital needs over the course of the next year through equity financing, primarily from the contemplated purchase of the Company pursuant to the DSPA, with the net proceeds to be used to fund continuing operations.\nAs a result of streamlining business operations, in January 2008 the Company closed down the co-location facility and Internet hosting services for the Childrens Internet® provided by Evocative Data Center. Since the product was taken offline, sales efforts have been suspended until the Company closes the DSPA. Additionally, the Company has terminated the Childrens Internet® support and content staff during this time. Prior to taking the Childrens Internet® service offline, the product was not being aggressively marketed due to the Companys lack of resources to promote the product. The number of users was exceedingly small, and the high cost of hosting was creating a cash drain on the Company which led to the Companys decision to reduce its overall operating costs until the closing of the DSPA. ITEM 1A. RISK FACTORS\nSmaller reporting companies are not required to provide the information required by this Item 1A. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nOur business office is located at Stresemannallee 4c, Neuss 41460, Germany. Our telephone number is +49 (0)2131-151 08. Our leased office space consists of 4736 square feet in an office facility. We pay $5,000 per month on a month -to- month basis. Our facilities are adequate for our present needs. ITEM 3. LEGAL PROCEEDINGS\nOswald & Yap\nOn November 24, 2004, Oswald & Yap, a Professional Corporation (O&Y), formerly counsel to the Company, filed a complaint in the Superior Court of California, County of Orange, Case No. 04CC11623, against the Company, seeking recovery of allegedly unpaid legal fees in the amount of $50,984.86 in connection with the legal representation of the Company. Subsequently the amount claimed of unpaid legal fees was reduced to $37,378.43 because it was discovered that O&Y did not properly credit all of the payments that were made by the Company to O&Y. The amount of $37,378.43 was deposited in an escrow account by the Company on July 5, 2005. The complaint includes causes of action for breach of contract. The Company disputes the amounts claimed alleging that O&Ys services were otherwise unsatisfactory. On May 9, 2005, O&Y submitted an Offer to Compromise for a $0 payment by the Company to O&Y in exchange for mutual releases which the Company rejected.\nOn February 14, 2005, a cross-claim was filed in the Superior Court of California, County of Orange, Case No. 04CC11623 by the Company against O&Y alleging breach of contract, professional negligence, negligent representation, and breach of good faith and fiduciary duty. The basis of the allegations is that O&Y was retained to assist the Companys predecessor company in the purchase and acquisition of D.W.C. Installations (D.W.C.) with the expectation that D.W.C. had available free-trading shares such that the Company could immediately raise capital on the relevant markets and that in advising the Company through the purchase, O&Y failed to properly advise the Company as to the status of D.W.C. and its shares, which in fact were not free-trading. As a result of this conduct, the Company alleges damages in an unspecified amount but including purchase costs of D.W.C., extended operation costs, refiling costs, audit costs, legal fees, loan fees, lost market share, and costs for registration. O&Y has vigorously disputed the claims set forth in the cross-complaint and has indicated its intention, should it prevail in its defense, to institute a malicious prosecution action against the Company, Nasser Hamedani, Sholeh Hamedani and Company counsel. Litigation of this matter is currently stayed pending the SEC Complaint below.\nSEC Complaint\nOn September 27, 2006, the Commission filed a complaint (Complaint) against The Childrens Internet, Inc. (TCI) and its principles, Nasser Hamedani and Sholeh Hamedani (collectively, the Hamedanis) and Two Dog Net, Inc. (TDN) and two of its stock promoters, Peter Perez (Perez) and Cort Poyner (Poyner). In the Complaint, the Commission alleged that, from February 2002 through June 2005, the Hamedanis purportedly on behalf of TCI, fraudulently obtained approximately $5.5 million from public investors. The Hamedanis diverted a significant amount of the investors money to pay personal expenses and also hundreds of thousands of dollars in undisclosed commissions to two stock promoters, Perez and Poyner.\nOn March 19, 2008, the Court entered a final judgment against Perez directing him to pay $85,000 in disgorgement and prejudgment interest.\nWilliam Arnold v The Childrens Internet, Inc., Case No. RG 07-359949\nOn April 18, 2008, William Arnold filed suit against the Company for breach of contract relating to his written employment agreement commencing on December 2005. Mr. Arnold claims the Company agreed to pay a salary of $120,000 per annum, a performance bonus, and 1,000,000 shares of TCI common stock. Mr. Arnold is seeking $600,000 plus interest and punitive damages. As of December 31, 2008, the Company does not have legal counsel and has not filed an answer in this complaint and at the Status Conference neither the Company or counsel for William Arnold appeared at the hearing.\nStonefield Josephson, Inc\nOn June 13, 2006, the Company became subject to an arbitration demand from Stonefield Josephson, Inc., its former accountant, seeking reimbursement costs for legal fees spent in connection with the SEC inquiry of the Company. Stonefield Josephson, Inc.s claim seeks recovery of $29,412.74. The Company disputes any amounts owed because of a settlement agreement entered into between the respective parties in December 2004 effectively terminating their relationship. This matter was submitted to binding arbitration through AAA in January 2007.\nThe Arbitrators decision was issued on February 2, 2007, awarding Stonefield Josephson, Inc. the sum of $19,000 plus costs and fees in the amount of $1,425 due and payable March 15, 2007. The decision also awarded Stonefield Josephson, Inc. interest at the rate of 10% per annum on $19,000 from March 15, 2007. On August 30, 2007, an additional $2,500 in post-arbitration attorneys fees and costs was awarded by the Los Angeles Superior Court. No amounts have been paid to Stonefield Josephson since the date of the Arbitrators decision.\nOn August 25, 2006, the Company filed a complaint against its former accountants, Stonefield Josephson, Inc., and its principal Dean Skupen, in the Superior Court of California, County of Alameda, Case No. VG06286054 alleging breach of contract, promissory estoppel, breach of implied covenant of good faith and fair dealing, negligent misrepresentation, fraud, and unfair business practices arising out of defendants alleged failure to properly perform contractual obligations. The Company seeks damages resulting from defendants actions, including recovering costs expended for a subsequent audit and the resultant loss in stock price following the Companys inability to file necessary reports with the NASD. The matter was subsequently transferred to Los Angeles Superior Court. Mediation on this matter took place on February 29, 2008 in Los Angeles, California but was unsuccessful.\nNote: This 10-K filing is being made on the current date. The current management does not have the legal files and it has been reported the entire case file for this action has been deleted and no records are available. On September 25, 2013 the Court reported the Paper File Destroyed and there are no records subsequent to the docket entries up to April 16, 2007. There is no further information available on this action.\nLumber & Company\nOn April 8, 2008, Lumer & Company filed a claim in the Superior Court of California, City and County of San Francisco for breach of contract related to unpaid accounting service fees, CGC 08-474007. On June 25, 2008, a judgment was entered against the Company for $58,175.66, including prejudgment interest and cost. ITEM 4. MINE SAFETY DISCLOSURE.\nNot applicable.\nPART II ITEM 5. MARKET FOR THE REGISTRANTS COMMON EQUITY AND RELATED STOCKHOLDER MATTERS\nThe Companys common stock was approved for trading on the OTC Bulletin Board on December 23, 2004 under the trading symbol CITC Actual trading of our shares began on February 23, 2005. The following are the approximate high and low closing bid quotations on the OTC Bulletin Board since the first quarterly period of trading as reported on the online resources of Market Watch and Yahoo! Finance. The quotations reflect inter-dealer prices, without retail mark-up, mark-down, or commission and may not represent actual transactions.\nPeriod\nHigh Closing Bid\nLow Closing Bid\n1st Quarter 2007\n$ 0.17\n$ 0.08\n2nd Quarter 2007\n$ 0.18\n$ 0.16\n3rd Quarter 2007\n$ 0.15\n$ 0.13\n4th Quarter 2007\n$ 0.18\n$ 0.17\n1st Quarter 2008\n$ 2.28\n$ 0.58\n2nd Quarter 2008\n$ 2.20\n$ 1.55\n3rd Quarter 2008\n$ 1.60\n$ 1.30\n4th Quarter 2008\n$ 0.88\n$ 0.65\nHolders\nAs of December 31, 2008, there were 263 shareholders of record. The Companys transfer agent is Transfer Online, 317 SW Alder Street, 2nd Floor, Portland, OR 97204.\nDividend Policy\nThe Company has not paid any cash dividends on its common stock since its inception and does not anticipate or contemplate paying cash dividends in the foreseeable future.\nSecurities Authorized For Issuance Under Equity Compensation Plans\nNone.\nRecent Sales of Unregistered Securities\nOn April 30, 2007, subject to the terms of the Companys 2007 Equity Incentive Plan, the Company granted qualified stock options to two employees, Tim Turner, pursuant to the terms of Mr. Turners Executive Employee Agreement, and John Heinke, the Companys Controller. Mr. Turner was granted options to purchase 2,687,374 shares of the Companys common stock at the purchase price of $0.081 per share. Of the total options, 300,000 shares vested immediately and the balance of 2,387,374 shares vest at the rate of one thirty-sixth per month of employment. Mr. Turner resigned effective on December 15, 2007 and a total of 796,300 shares subject to his option had vested. Mr. Heinke was granted options to purchase 300,000 shares of the Companys common stock at the purchase price of $0.081 per share. Mr. Heinkes options vest at the rate of one thirty-sixth per month of employment. The purchase price of $0.081 per share for Mr. Turner and Mr. Heinkes options was the fair market value of the shares at the date of the grant. The options granted to Tim Turner and John Heinke were issued in reliance upon the exemption provided by Section 4(2) of the Securities Act for the offer and sale of securities not involving a public offering.\nOn April, 30, 2007, subject to the terms of the Companys 2007 Equity Incentive Plan, the Company granted non-qualified stock options to three of the Companys four directors, Roger Campos, Jamshid Ghosseiri and Tyler Wheeler. Each director was granted options to purchase 125,000 shares of the Companys common stock at the purchase price of $0.081 per share which was the fair market value of the shares at the date of the grant. The options for the three directors vested immediately upon grant. In light of the on-going obligations of the Board of Directors of the Company and in order to provide incentives to the Companys directors to continue as Board members until the closing of the DSPA, the Company resolved to use its best efforts to cause the registration of the shares of common stock underlying the options held by the independent directors under the Securities Act as soon as commercially possible after the closing under the DSPA. The options granted to the directors were issued in reliance upon the exemption provided by Section 4(2) of the Securities Act for the offer and sale of securities not involving a public offering.\nThe value of the options granted on April 30, 2007 and discussed in the preceding two paragraphs, was based on a fair market value of $0.08 per share at the grant date, which was computed using the Black-Scholes option pricing model.\nOn October 19, 2007, TCI Holding Company, LLC entered into a Definitive Stock Purchase Agreement (the DSPA) with the Company to purchase a controlling interest in the Company. The DSPA expired on March 31, 2008 and was subsequently terminated by action of the Board of Directors on May 9, 2008, as explained in Note 4.\nOn December 6, 2007, the Company issued a warrant (the TCI Holding Warrant) to purchase 128,040,988 shares of the Companys common stock (the Warrant Shares) at an exercise price of $0.0625 per share to TCI Holding. The TCI Holding Warrant may only be exercised after the closing of the DSPA, and then, only until April 30, 2008. The TCI Holding Warrant provides for adjustment in its exercise price and the Warrant Shares in case the Company engages in a recapitalization, authorizes dividends or distributions, or engages in a reorganization. The TCI Holding Warrant was issued in reliance upon the exemption provided by Section 4(2) of the Securities Act for the offer and sale of securities not involving a public offering.\nOn August 18, 2008, 2,000,000 shares were issued in the name of Randick, ODea & Tooliatos, LLP, a law firm representing TCI in various matters, as a pledge to cover up to $250,000 in services provided in the litigation with the Securities & Exchange Commission explained in Note 4, in accordance with the Pledge Agreement and Promissory Note for $250,000 dated August 6, 2008 and due on August 6, 2009, also explained in Note 4. The 2,000,000 shares are being held by Randick, ODea & Tooliatos as security for repayment of the loan, and are not deemed to carry voting rights under Nevada law as they are held for the benefit of the Company until released in payment at the maturity of the loan. The issuance of the 2,000,000 shares, increased the Companys total issued and outstanding shares of common stock to 33,373,738 as of September 30, 2008 for the purposes of financial reporting.\nNo other new shares were issued by the Company during the period from January 1, 2007 through the date of this report.\nDefinitive Stock Purchase Agreement\nOn June 15, 2007, the Company entered into the Interim Stock Purchase Agreement (the Interim Stock Purchase Agreement or the ISPA) with TCI Holding and Shadrack, which holds approximately 52.2% of the voting power of the Companys outstanding common stock, pursuant to which, TCI Holding, subject to certain conditions, agreed to purchase from the Company a total of 120 million authorized but unissued shares of the Companys common stock, and from Shadrack, an additional 10 million shares of the Companys common stock. The purchase price for the shares was to be an aggregate of $8 million, of which $1.5 million was to be used by the Company to pay down certain indebtedness, and $500,000 was to be paid to Shadrack for the purchase of the 10,000,000 shares of the Companys Common Stock held by Shadrack, and the balance would have been paid to the Company.\nAn escrow agreement was signed and became effective on July 3, 2007, under which TCI Holding agreed to place $500,000 of the purchase price into an escrow account, with the first $300,000 deposited on July 6, 2007, and the balance to be deposited after completion of due diligence and upon TCI Holding notifying the Company that TCI Holding elects to proceed with the final Definitive Stock Purchase Agreement (FSPA). The Company agreed to place 7,500,000 of its currently authorized but unissued shares of common stock into the escrow account, with the first 4,500,000 deposited on July 3, 2007 and the balance to be deposited after completion of due diligence and upon TCI Holding notifying the Company that TCI Holding elects to proceed with the FSPA. The escrowed cash and shares would be the sole remedy of the parties if an event of default under the ISPA, or the FSPA, occurs. The certificate for the 4,500,000 shares deposited on July 3, 2007 was issued by the Companys transfer agent on June 29, 2007. Because such shares are held for the benefit of the Company in escrow until released, these shares have not been considered voting shares under Nevada law. However, such shares are considered outstanding for financial reporting purposes. On August 9, 2007, the Company and TCI Holding amended the ISPA. Under the amendment, $300,000 which was placed in escrow by TCI Holding pursuant to the ISPA was released from escrow, $150,000 to TCI to be used to pay down certain specified current payables and $150,000 was released back to TCI Holding. The Amendment also made certain changes to the events of default and SEC settlement provisions of the ISPA as reported in a Form 8-K filed with the Securities and Exchange Commission on August 15, 2007.\nOn October 19, 2007, the Company and TCI Holding entered into the Definitive Stock Purchase Agreement. The DSPA supersedes the ISPA and constitutes the FSPA that was contemplated by the ISPA. Under the terms of the DSPA, TCI Holding will purchase 120 million newly issued shares of the Companys common stock for $7.5 million from the Company and 8,040,988 shares of the Companys common stock from Shadrack for $500,000. Of the $8 million total purchase price, the $500,000 payable to Shadrack plus up to an additional $2.2 million is expected to be paid directly to the SEC as part of a proposed settlement of SEC Complaint. The proposed settlement with the SEC is subject to approval by the SEC in Washington, D.C.\nAdditionally, as a condition of the DSPA, the Company shall be fully and completely released from all obligations that are owed to Sholeh Hamedani, Nasser Hamedani, Shadrack, TDN or any of their affiliates.\nThe Company has also agreed, as a condition of the DSPA, to cause TDN to transfer to the Company, as part of the closing of the DSPA, The Childrens Internet® and Safe Zone Technology® software and related trademarks, registrations and software applications, as such software, trademarks, registrations, and software applications relate solely to the business of The Childrens Internet. After the closing of the DSPA, the Company has agreed to pay to TDN or its designee a one-time royalty fee of $1 for each subscriber of The Childrens Internet® secure on-line service during the two-year period commencing on the closing of the DSPA, which is to be paid 30 days after receipt by the Company of its first monthly user fee from each subscriber. The terms of the assignment of the technology from TDN to the Company and the payment of the royalty fee to TDN by the Company is set forth in the Assignment and Royalty Agreement, dated as of October 19, 2007 (the Assignment and Royalty Agreement), by and between TCI and TDN. The Assignment and Royalty Agreement was attached as Exhibit A to the DSPA and to the Companys Form 8-K filed on October 25, 2007 available at the SECs web site, www.sec.gov.\nUnder the terms of the DSPA, Sholeh Hamedani resigned as Chief Executive Officer and Chief Financial Officer of the Company and the Board of Directors appointed Richard J. Lewis, III to be the Companys Acting CEO and CFO. The Companys Board of Directors will continue to represent the Company in the transactions contemplated by the DSPA.\nUnder the terms of the DSPA, the TDN Option will be cancelled without any further action or any payment by TDN or the Company upon the closing of the Definitive Stock Purchase Agreement. However, after the closing of the Definitive Stock Purchase Agreement, the Company shall set aside 12,857,142 shares of its common stock solely for the purpose of offering such shares to certain stockholders of TDN at a price of $.07 per share. The shares will be made available only to TDN stockholders who receive cash payments from the SEC from an escrow fund of $900,000 set aside for those stockholders under a final judgment to be entered into in connection with the SEC Complaint (as defined in Item 3, Legal Proceedings). This offering will be held open for a period of ninety days following the date of the $900,000 cash distribution by the SEC.\nUnder the terms of the DSPA, completion of the purchase transaction is subject to a number of conditions, including, amendment of the Companys articles of incorporation to increase its authorized shares of common stock to 250 million (which will require consent of a majority of the shareholders) and settlement of all litigation by the SEC against the Company to the satisfaction of TCI Holding.\nOn March 18, 2008, The Childrens Internet, Inc. (TCI) entered into Amendment No. 4 (the Amendment) to the DSPA. Under the Amendment, the date upon which the parties are permitted to terminate the DSPA if the closing of the DSPA did not occur was extended from March 15, 2008 to March 31, 2008.\nOn May 9, 2008, because TCI Holding was unable to secure the necessary funding in order to close the deal under the terms of the DSPA and the parties were unable to reach a new agreement and, therefore, the Companys Board of Directors, voted unanimously to terminate the DSPA. Also, on May 9, 2008, the Board of Directors unanimously voted to remove Richard J. Lewis III as the Companys Chief Executive Officer and Chief Financial Officer, and subsequently replaced Mr. Lewis with Mr. Tyler Wheeler as acting Chief Executive Officer and Chief Financial Officer.\nOn October 24, 2008, TCI Holding caused to be filed against the Company and its board members the Petition and Application for Order Compelling Shareholders Meeting and Order to Show Cause and/or Petition for Writ of Mandamus to Compel Shareholders Meeting, and the Order to Show Cause (Case No.: 08 OC 00367 1B) (the Petition ). As described in greater detail in Footnote 7 below, the Company and TCI Holding have agreed that upon the occurrence of certain events as set forth in the Control Agreement (as such term is defined in Footnote 7) that TCI Holding would cause the Petition to be dismissed with prejudice ITEM 6. SELECTED FINANCIAL DATA.\nSmaller reporting companies are not required to provide the information required by this Item 6. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION OR PLAN OF OPERATIONS\n(Note: The following Plan of Operations constituted our business plan during the 2007, and up to the end of fiscal 2009. After an analysis of the lack of progress, the Company filed a Form 15 with the SEC on July 28, 2010. The new Board has determined to seek other opportunities, and so the following Plan of Operations is no longer effective.)\nThis report contains forward-looking statements within the meaning of Section 21E of the Securities and Exchange Act of 1934 and Section 27A of the Securities Act of 1933. These forward-looking statements involve a number of risks and uncertainties that may cause actual results to differ materially from those discussed in, or implied by, such forward-looking statements. The Companys future operating results are dependent upon many factors, including but not limited to: (i) whether the Company is able to complete its sale to The Childrens Internet Holding Company, LLC; (ii) whether the Company will settle the SEC Complaint (as defined below); (iii) whether the Company is able to obtain sufficient funding to fund its operations and business; (iv) whether the Company is able to build the management and human resources and infrastructure necessary to support the growth of its business; (v) competitive factors and developments in the industry in which the Company competes; (vi) intellectual property protection; and (vii) any economic conditions that would negatively affect the Companys business and expansion plans. Forward-looking statements within this Form 10-KSB are identified by words such as believes, anticipates, expects, intends, may, will and other similar expressions. However, these words are not the only means of identifying such statements. We are not obligated and expressly disclaim any obligation to publicly release any update to any forward-looking statement. Our actual results could differ materially from those anticipated in, or implied by, forward-looking statements as a result of various factors. Readers are urged to carefully review and consider the various disclosures made by the Company in this report and in our other reports filed with the SEC, and available on its website at www.sec.gov, that attempt to advise interested parties of the risks and factors that may affect our business.\nPlan of Operations\nThis plan of future operations contains forward-looking statements that involve risks, uncertainties, and assumptions. The actual results may differ materially from those anticipated in these forward-looking statements as a result of certain factors, including, but not limited to, those described elsewhere in this report.\nThis plan of future operations provides a summary of the intended operations of the Companys interim management following the closing of the DSPA.\nThe Product-The Childrens Internet®\nOn September 10, 2002, we entered into the Licensing Agreement with Two Dog Net for an exclusive worldwide license to market and sell The Childrens Internet® service. The agreement provides for us to be the exclusive marketers of Two Dog Nets proprietary secured Internet service for pre-school to junior high school aged children called The Childrens Internet®. The Company released The Childrens Internet®, version 9.0, to the market on March 2, 2006, but as discussed in this report, took the product offline in January 2008 to streamline business operations until we have the resources to market and operate it effectively. We believe The Childrens Internet® provides a comprehensive, smart solution to the problems inherent to a childs unrestricted and unsupervised Internet access. It offers a protected online service and educational super portal specifically designed for children, pre-school to junior high, providing them with safe, real-time access to the World Wide Web; access to hundreds of thousands of the best pre-selected, pre-approved educational and entertaining web pages accessed through a secure propriety browser and search engine.\nUnder the terms of the DSPA, TCI Holding commenced funding the Companys operations in October 2007, and as a result, the technology on which the product is based was updated and the functionality of the service was improved. The Company, through Two Dog Net also substantially upgraded the underlying system infrastructure by increasing redundant servers and improving control procedures which in turn increased the reliability of the service. Additionally, during 2007, where appropriate, the Company contracted with third party companies to outsource administrative support services and effectively put in place the infrastructure to support operations.\nWe intend to sell the product for $9.95 per month to the consumer. The user must already have internet access, either through dial-up, DSL or cable broadband. We utilize both retail and wholesale channels of distribution.\nSales and Marketing Plan\nAlthough The Childrens Internet® service is not currently being offered, upon closing the DSPA, we intend to affect a broad based Sales and Marketing Plan. We will focus on establishing long term, value-driven relationships with:\n· Parents and Kids\n· The School Market: School Administrators and Teachers\n· Major ISPs such as Comcast, Yahoo, AOL, etc.\n· Non-profit organizations such as religious groups, Boy Scouts and Girl Scouts, etc.\n· ISP customers with an interest in protecting their families\nWe will focus our sales and marketing programs on five distinct areas where we can produce revenue:\n1. Consumer Sales- We intend to sell monthly subscriptions of the service directly to consumers via a nationwide Sales Agent program. Consumers may also acquire the product directly from the Company via our website at: www.thechildrensinternet.com. Previously, through grassroots efforts during 2006 the Company entered into sales agent agreements with ten individuals. In 2007, these agreements automatically terminated.\n2. Wholesalers- We intend to sell the Childrens Internet® to independent distributors, resellers and ISPs who will sell it as a value-added service to their current customer base. Targets would include companies such as Comcast, AT&T, EarthLink and the hundreds of local ISPs throughout the United States. In these situations, the business model changes dramatically as we would not be engaged in billing, collecting, customer service or level one technical support.\n3. Charitable organizations- We intend to partner with non-profit organizations to have them market the product. Targets would include large religious organizations, various scout programs, Internet safety activists, law enforcement agencies, etc. Moreover, we may offer any age-appropriate school, public or private, 20 free licenses for a year. From there, we expect Parent Teacher Associations to use the product as a fund raiser, deepening our penetration into the homes of children.\nChannels of Distribution\nThe Childrens Internet, Inc. will also employ both direct and indirect sales channels.\nSubject to securing financing in addition to the funds raised under the DSPA, we will hire a direct sales force. The primary targets of our direct sales force will be the largest Internet Service Providers as well as other national organizations that market to the most appropriate demographic for our service. We believe one or more of the largest ISPs in the United States will recognize the first mover advantage opportunity and will use The Childrens Internet to not only offer this product to their existing customers, but also to take significant market share from their competition. We also believe that almost any company that markets to our demographic will want to seize the public relations good will that will accrue to any company offering our service.\nThe indirect channel, composed of non-salaried independent sales agents and wholesale distributors, will target a wide range of opportunities, from local charities to national organizations where they may have an influential contact. These sales agents may have the opportunity to employ secondary resellers to work for them, but we will not market using a multi-level marketing plan.\nFuture products and services\nIn the future, we anticipate generating revenues via advertising sold to the purveyors of children goods and services. After successfully distributing our core service, we intend to engage in the merchandising of The Childrens Internet® themed products, from clothing to toys to books.\nFuture Staff and Employees\nWhere practicable we plan to contract with third party companies to outsource administrative support services that effectively support the growth of the business. These outsource providers will handle technical support, telemarketing and the order taking process and media placement. We intend to hire employees where their contributions to our business will be the most significant, such as in technology development and management.\nMarket Share, Cash Flow and Profitability\nAlthough market data is not exact, and varies depending on the source, with a mix of business generated from the respective channels of distribution, we believe that, subject to the closing of the DSPA, we can be cash flow positive and profitable within eighteen months of closing the DSPA. This estimate is based on data that indicates that in the United States alone, there are approximately 48 million homes with internet access with children under the age of 16. However, as discussed in the MD&A section above, if the DSPA fails to close or we are unsuccessful in securing the additional capital needed to continue operations within the time required, we will not be in a position to continue operations. In this event, we would attempt to sell the Company or file for bankruptcy.\nWe accomplished none of these goals in the fiscal year 2008.\nManagements Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nManagements discussion and analysis of financial condition and results of operations, or MD&A, is provided as a supplement to the consolidated financial statements and notes included elsewhere in this Form 10-K and are designed to provide an understanding of our results of operations, financial condition and changes in financial condition. Our MD&A is comprised of:\n· Introduction. This section provides a general description of our business. This section also includes a table of selected financial data.\n· Results of Operations. This section provides our analysis of the significant line items on our consolidated statements of operations.\n· Going Concern Uncertainty. This section provides a discussion of our uncertainty to continue as a going concern.\n· Critical Accounting Policies. This section discusses the accounting policies we consider important to our financial condition and results of operations and that require us to exercise subjective or complex judgments in their application. This section also includes a discussion about recent accounting pronouncements and the impact those pronouncements are expected to have on our financial condition and results of operations.\n· Liquidity and Capital Resources, Debt and Lease Obligations. This section provides an analysis of our liquidity and cash flows as well as a discussion of our outstanding debt and commitments as of December 31, 2008.\nIntroduction\nWe were incorporated in the State of Nevada on September 25, 1996 as D.W.C. Installations, Inc. We changed our name to The Childrens Internet, Inc. on December 27, 2002. After an analysis of the lack of progress, the Company filed a Form 15 with the SEC on July 28, 2010. On October 20, 2010, the Company applied for a Certificate of Domestication and filed Articles of Domestication in the office of the Secretary of State of Wyoming. On February 15, 2015, the Company filed an Articles of Amendment for a change of name to FLASHZERO CORP. We are a development stage company and currently have no significant revenues, no marketing budget, only minimal assets, and have incurred losses since our inception.\nResults of Operations\nThe Company has no revenue for the year ended December 31, 2008, as compared to $664 for the year ended December 31, 2007. For the year ended December 31, 2008, the Company has accumulated deficit of $5,717,998 compared to $5,316,374 for the year ended December 31, 2007. As of December 31, 2008, the Company lacks business operation, Management or offices.\nOur total expenses decreased by $767,405 for the year ended December 31, 2008, as compared to the year ended December 31, 2007. The decrease was primarily due to the decrease of $767,405 in general and administrative expenses.\nNet loss for the year ended December 31, 2008 was $401,629 compared to $1,165,988 for the year ended December 31, 2007.\nGoing Concern Uncertainty\nBased on our financial history since inception, our auditor has expressed substantial doubt as to our ability to continue as a going concern. As reflected in the accompanying financial statements, as of December 31, 2008, we had an accumulated deficit totaling $5,717,998. This raises substantial doubts about our ability to continue as a going concern.\nCritical Accounting Policies and Estimates\nThe Companys financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America, which contemplate continuation of the Company as a going concern. The preparation of these financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nLiquidity and Capital Resources, Debt and Lease Obligations\nCash flows generated from operating activities were not enough to support all working capital requirements for the years ended December 31, 2008 and 2007.\nWe used ($727,607) and $14,649, respectively, in cash for operating activities for the years ended December 31, 2008 and 2007.\nCash flows provided from investing activities were ($14,956) and ($838), respectively, for the years ended December 31, 2008 and 2007 primarily related to the acquisition of equipment.\nCash flows from financing activities were $742,463 and $14,485 for the years ended December 31, 2008 and 2007, respectively.\nOff-Balance Sheet Arrangements\nNone. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Act of 1934 and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nFLASHZERO CORP.\nfka The Childrens Internet, Inc.\nAUDITED FINANCIAL STATEMENTS\nFor the years ended December 31, 2008 and 2007\nReport of Independent Registered Public Accounting Firm (PCAOB #5968)\nBalance Sheets as of December 31, 2008, and 2007\nStatements of Operations for the Years ended December 31, 2008, and 2007\nStatements of Stockholders Deficit for the Years ended December 31, 2008, and 2007\nStatements of Cash Flows for the Years ended December 31, 2008, and 2007\nNotes to the Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of FLASHZERO CORP.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Flashzero Corp. (the \"Company\") as of December 31, 2008, and the related statements of operations, changes in shareholders' equity and cash flows, for the period ended December 31, 2008, and the related notes collectively referred to as the \"financial statements. The financial statement of FlashZero Corp. As of December 31, 2007, were audited by other auditors whose report dated March 31, 2008, expressed an unqualify opinion on those statement.\nIn our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2008, and the results of its operations and its cash flows for the years ended December 31, 2008, in conformity with U.S. generally accepted accounting principles.\nGoing Concern\nThe accompanying financial statements have been prepared assuming the company will continue as a going concern as disclosed in Note 3 to the financial statement, the Company incurred a net loss of $401,629 for the year ended December 31, 2008, and an accumulated deficit of $5,717,998 at December 31, 2008. The continuation of the Company as a going concern through December 31, 2008, is dependent upon improving the profitability and the continuing financial support from its stockholders. Management believes the existing shareholders or external financing will provide the additional cash to meet the Companys obligations as they become due.\nThese factors raise substantial doubt about the company ability to continue as a going concern. These financial statements do not include any adjustments that might result from the outcome of the uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. The company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion\nOLAYINKA OYEBOLA & CO.\n(Chartered Accountants)\nWe have served as the Company's auditor since February 2022.\nMay 19th, 2022.\nLagos Nigeria\nFLASHZERO CORP.\n(Formerly Childrens Internet Inc)\nBALANCE SHEETS\nDecember 31,\nDecember 31,\nASSETS\nCurrent Assets:\nCash and cash equivalent $ 37,381 $ 37,482\nTotal Current Assets 37,381 37,482\nFixed Assets 21,836 3,613\nTotal Fixed Assets, net 59,217 3,613\nOther Assets\nDeposit - State Board of Equalization - 2,000\nUtility Deposit -\nTotal Assets $ 59,217 $ 43,213\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent Liabilities:\nAccount Payables $ 854,570 $ 791,622\nAccrued Salaries 749,319 729,319\nNotes payable to TCI Holding Co., LLC - 264,504\nLoan Payable to Related Parties - 101,518\nAccrued Payroll Taxes - 42,942\nTaxes Payable - 4,817\nTotal Liabilities 1,603,889 1,934,722\nLong Term Liabilities\nDue to related parties - 1,028,831\nTotal Liabilities 1,603,889 2,963,553\nStockholders' Deficit:\nCommon stock, $0.001 par value; 75,000,000 shares authorized, 48,286,306, and 31,373,738 shares issued and outstanding 48,286 31,374\nAdditional paid-in capital 4,125,040 2,364,660\nAccumulated deficit (5,717,998 ) (5,316,374 )\nTotal Stockholders Deficit (1,544,672 ) (2,920,340 )\nTotal Liabilities and Stockholders' Deficit $ 59,217 $ 43,213\nThe accompanying notes are an integral part of these financial statements.\nFLASHZERO CORP.\n(Formerly Childrens Internet Inc)\nSTATEMENTS OF OPERATIONS\nFor the Years Ended\nDecember 31,\nRevenue $ - $ 766\nCost of Revenue -\n-\nOperating Expenses:\nGeneral & administrative expenses 355,195 1,122,600\nTotal operating expenses 355,195 1,122,600\nLoss from operations (355,195 ) (1,121,936 )\nOther Income / (Expense) (46,429 ) (43,252 )\nLoss before income tax -\nNet Income / (loss) $ (401,629 ) $ (1,165,988 )\nBasic and diluted loss per share $ (0.012 ) $ (0.04 )\nBasic and diluted weighted average shares 48,286,306 26,873,738\nThe accompanying notes are an integral part of these financial statements.\nFLASHZERO CORP.\n(Formerly Childrens Internet Inc)\nSTATEMENT OF CHANGES IN EQUITY (DEFICIT)\nFor the Year Ended December 31, 2008, and 2007\nAdditional\nTotal\nCommon Stock Paid in Accumulated Shareholders\nShares Amount Capital Deficit Deficit\nBalance - January 1, 2007 26,873,738 $ 26,874 $ 2,262,622 $ (4,150,386 ) $ (1,860,890 )\nStock issue to TCI Holdings 4,500,000 4,500 (4,500 ) - -\nAdditional paid in capital - - 106,538 - 106,538\nLoss for the year 137,284 - (1,165,988 )\nBalance - December 31, 2007 31,373,738 $ 31,374 $ 2,364,660 $ (5,316,374 ) $ (2,920,340 )\nCommon stock issue for services 14,775,284 14,775 - - 14,775\nStock issue for cash 2,000,000 2,000 7,750 9,755\nExtinguishment of debts to adjudged parties - - 1,752,630 - 1,752,630\nStock issue for services 137,284 - -\nNet loss for the year - - - (401,629 ) (401,629 )\nBalance - December 31, 2008 48,286,306 $ 48,286 $ 4,125,040 $ (5,717,998 ) $ (1,544,672 )\nThe accompanying notes are an integral part of these financial statements.\nFLASHZERO CORP.\n(Formerly Childrens Internet Inc)\nSTATEMENTS OF CASH FLOWS\nFor the Years Ended\nDecember 31,\nCash flows from operating activities:\nNet loss $ (401,629 ) $ (1,165,988 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation 3,267 4,321\nAmortization - 1,260\nStock compensation - 99,038\nServices perform as capital contribution - 7,500\nUtility Deposit 2,118 (118 )\n- -\nChanges in assets and liabilities:\nAccount payable and accrued expense 14,658 393,271\nAccrued salary 20,000 280,045\nNote payable to TCI Holding company (264,504 ) 264,504\nLoan payable to related parties (101,518 ) 101,518\nNet cash used in operating activities (727,607 ) 14,649\nCash flows from investing activities:\nAcquisition of Equipment (14,956 ) (838 )\n(14,956 ) (838 )\nCash flows from financing activities:\nCommon stock 10,914 -\nAdditional paid in capital 1,760,380 -\nAdvance from majority shareholder (1,028,831 ) 14,485\nNet cash provided by financing activities 742,463 14,485\nNet increase (decrease) in cash (101 ) (1,002 )\nCash, beginning of year 37,482 38,484\nCash, end of year $ 37,381 $ 37,482\nThe accompanying notes are an integral part of these financial statements.\nFLASHZERO CORP.\n(Formerly Childrens Internet Inc)\nNotes to the Financial Statements\nDecember 31, 2008 and 2007\nNOTE 1 - ORGANIZATION AND DESCRIPTION OF BUSINESS\nChildren's Internet, Inc. (the Company) was incorporated under the laws of the State of Nevada on September 25, 1996 under the name D.W.C. Installations. At that date, 2,242,000 shares were issued to a small group of shareholders. The Company was primarily inactive until July 3, 2002 when Shadrack Films, Inc. (Shadrack) purchased 2,333,510 newly-issued shares of the Companys common stock for $150,000, thereby obtaining a majority ownership interest. The total issued and outstanding shares of the Company was increased to 4,575,510 shares as a result of this sale to Shadrack. On December 27, 2002, the Companys name was changed from D.W.C. Installations to The Childrens\nInternet, Inc.\nOn 15th day of February 2015, the company filed an article of amendment for a change of name to FLASHZERO CORP\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe Companys financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant estimates include the estimated useful lives of property and equipment. Actual results could differ from those estimates.\nConcentrations of Credit Risk\nFinancial instruments that potentially expose the Company to concentration of credit risk consist primarily of cash and accounts receivable. The Companys cash is deposited with major financial institutions. At times, such deposits may be in excess of the Federal Deposit Insurance Corporation insurable amount.\nCash and Cash Equivalents\nThe Company considers all cash accounts, which are not subject to withdrawal restrictions or penalties, and all highly liquid debt instruments purchased with a maturity of three months or less as cash and cash equivalents. The carrying amount of financial instruments included in cash and cash equivalents approximates fair value because of the short maturities for the instruments held. There were $37,381 and $37,482 cash equivalents for the years ended December 31, 2008, and 2007.\nFair Value of Financial Instruments\nFair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. ASC Topic No. 820 establishes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value into three broad levels, as described below:\nLevel 1: Level 1 inputs are unadjusted quoted prices in active markets for identical assets or liabilities.\nLevel 2: Level 2 inputs are inputs other than quoted prices included in Level 1 that are observable, either directly or indirectly. Level 2 inputs include quoted prices for similar assets, quoted prices in markets that are not considered to be active, and observable inputs other than quoted prices such as interest rates.\nLevel 3: Level 3 inputs are unobservable inputs.\nThe following required disclosure of the estimated fair value of financial instruments has been determined by the Company using available market information and appropriate valuation methodologies. However, considerable judgment is required to interpret market data to develop the estimates of fair value. Accordingly, the use of different market assumptions and/or estimation methodologies may have a material effect on the estimated fair value amounts.\nThe methods and assumptions used to estimate the fair values of each class of financial instruments are as follows: Accounts Receivable, and Accounts Payable. The items are generally short-term in nature, and accordingly, the carrying amounts reported on the consolidated balance sheets are reasonable approximations of their fair values.\nThe carrying amounts of Notes Payable approximate the fair value as the notes bear interest rates that are consistent with current market rates.\nIncome Taxes\nWe follow ASC 740-10-30, which requires recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns. Under this method, deferred tax assets and liabilities are based on the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the fiscal year in which the differences are expected to reverse. Deferred tax assets are reduced by a valuation allowance to the extent management concludes it is more likely than not that the assets will not be realized. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the fiscal years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the Statements of Income in the period that includes the enactment date.\nWe adopted ASC 740-10-25 (ASC 740-10-25) with regard to uncertainty income taxes. ASC 740-10-25 addresses the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the financial statements. Under ASC 740-10-25, we may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. ASC 740-10-25 also provides guidance on derecognition, classification, interest and penalties on income taxes, and accounting in interim periods and requires increased disclosures. We had no material adjustments to our liabilities for unrecognized income tax benefits according to the provisions of ASC 740-10-25.\nNet income (loss) per common share\nNet income (loss) per common share is computed pursuant to section 260-10-45 of the FASB Accounting Standards Codification. Basic net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock outstanding during the period. Diluted net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock and potentially outstanding shares of common stock during the period. The weighted average number of common shares outstanding and potentially outstanding common shares assumes that the Company incorporated as of the beginning of the first period presented. For the years ended December 31, 2008 and 2007, the diluted loss per share is the same as the basic loss per shares as the inclusion of any potentially dilutive shares would result in anti- dilution due to the net loss incurred by the Company\nRecent Accounting Pronouncements\nThe Company has implemented all applicable accounting pronouncements that are in effect. These pronouncements did not have any material impact on the financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations.\nNOTE 3 - GOING CONCERN\nThe accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. The Company has no revenue and has accumulated deficit of $5,717,998 as of December 31, 2008. The Company requires capital for its contemplated operational activities. The Companys ability to raise additional capital through the future issuances of common stock is unknown. The obtainment of additional financing, the successful development of the Companys contemplated plan of operations, and its transition, ultimately, to the attainment of profitable operations are necessary for the Company to continue operations. These conditions and the ability to successfully resolve these factors raise substantial doubt about the Companys ability to continue as a going concern. The financial statements of the Company do not include any adjustments that may result from the outcome of these uncertainties.\nNOTE 4 - INCOME TAXES\nDeferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss, and tax credit carryforwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. The U.S. federal income tax rate of 21% is being used.\nNet deferred tax assets consist of the following components as of:\nDecember 31,\nDecember 31,\nFederal income tax benefit attributable to:\nCurrent Operations $ - $ -\nLess: valuation allowance - -\nNet provision for Federal income taxes $ - $ -\nThe income tax provision differs from the amount of income tax determined by applying the U.S. federal income tax rate to pretax income from continuing operations for the fiscal years ending, due to the following:\nDecember 31,\nDecember 31,\nDeferred tax asset attributable to:\nNet operating loss carryover $ (5,717,998 ) $ (5,316,374 )\nLess: valuation allowance 5,717,998 5,316,374\nNet deferred tax asset $ - $ -\nAt December 31, 2008, the Company had net operating loss carry forwards of approximately $401,624 that may be offset against future taxable income. No tax benefit has been reported in the December 31, 2008 financial statements since the potential tax benefit is offset by a valuation allowance of the same amount.\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards for Federal Income tax reporting purposes are subject to annual limitations. Should a change in ownership occur, net operating loss carry forwards may be limited as to use in future years. With few exceptions, the Company is no longer subject to U.S. federal, state and local income tax examinations by tax authorities for years before 2015.\nNOTE 5 - SUBSEQUENT EVENTS\nIn accordance with SFAS 165 (ASC 855-10) management has performed an evaluation of subsequent events through the date that the financial statements were issued and has identified the following events to disclose in these financial statements.\nOn 15th day of February 2015, the company filed an article of amendment for a change of name to FLASHZERO CORP\nOn April 1, 2022, CS Diagnosis of Germany acquired the majority control of FlashZero. CS Diagnostics is a pharmaceutical international wholesaler and manufacturer of medical technology with all necessary licenses. For more than 10 years we have been supplying national and international specialists, practices, clinics as well as ministries of health and working close with universities, experts and opinion leaders. CS Diagnostics is offering access to international pharmaceutical markets and the service of approval of medical products. Furthermore, CS Diagnostics is developing own products with the aim of maximizing patient benefit. We guarantee the fulfillment of our product promises by means of our own post-market studies and by providing support to customers and users through our experts. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nAs of the end of the period covered by this report, we carried out an evaluation, under the supervision and with participation of management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of our disclosure controls and procedures, as such term is defined under Rules 13a-15(e) and 15d-15(e) promulgated under the Exchange Act. Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were ineffective, as of the end of the period covered by this report, to provide reasonable assurance that material information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms.\nIn making this evaluation, our Chief Executive Officer and Chief Financial Officer considered the material weaknesses discussed in Managements Report on Internal Control Over Financial Reporting. Based on this evaluation, we concluded that our disclosure controls and procedures were not effective at a reasonable assurance level as of December 31, 2008 because of the identification of material weaknesses in our internal control over financial reporting. The lack of an effective control environment has been identified as a material weakness contributing to the inadequacy of the Companys disclosure controls and procedures as further discussed below with respect to the weaknesses in the Companys internal control over financial reporting.\nManagements Annual Report on Internal Control Over Financial Reporting\nManagement of The Childrens Internet, Inc. is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Exchange Act Rules 13a-15(f) and 15d-15(f)). Internal control over financial reporting is the process designed by, or under the supervision of, our CEO and CFO, and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles (GAAP).\nAll internal control systems, no matter how well designed, have inherent limitations, including the possibility of the circumvention or overriding of controls. Therefore, even a system determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Further, because of changes in conditions, internal control effectiveness may vary over time.\nInterim management conducted an assessment of the effectiveness of the companys internal control system as of December 31, 2008. In making this assessment, interim management used the criteria set forth in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, interim management has concluded that internal control over financial reporting was not effective as of December 31, 2008.\nA material weakness is a deficiency, or a combination of deficiencies, that results in a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected. Interim management identified the following material weaknesses in our internal control over financial reporting as of December 31, 2008:\nIneffective Control Environment\nThe Company did not maintain an effective control environment based on criteria established in the COSO framework. Specifically, the Company:\n(1) did not effectively train personnel on compliance with the companys Code of Ethics.\n(2) did not create or implement a written fraud prevention policy.\n(3) did not establish an audit committee.\n(4) did not maintain a majority of independent directors.\n(5) did not ensure the Board of Directors understood and exercised oversight and responsibility related to financial reporting and related internal control.\n(6) did not establish clearly articulated financial reporting objectives including those related to internal controls.\n(7) did not establish and implement written human resource policies and procedures.\nOur evaluation concluded that, although policies and procedures appropriate for operating control activities were designed, and in large part instituted, the Company has not been successful in designing and implementing polices for the control environment. The control environment sets the tone of an organization, influences the control consciousness of its people, and is the foundation of all other components of internal control over financial reporting. A material weakness in the control environment affects all other internal control components.\nManagement believes these deficiencies in internal control did not result in material inaccuracies or omissions of material fact and, to the best of its knowledge, believes that the consolidated financial statements for the year ended December 31, 2008 fairly present in all material respects the financial condition and results of operations for the Company in conformity with generally accepted accounting principles. There is however, a reasonable possibility that a material misstatement of the annual or interim financial statements would not have been prevented or detected as a result of the control environment weaknesses.\nManagements assessment of the effectiveness of the Companys internal control over financial reporting has not been audited by OLAYINKA OYEBOLA & CO., an independent registered public accounting firm, as stated in their report which is included herein.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in the Companys internal control over financial reporting as of December 31, 2008 that materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting.\nInterim management is currently taking corrective action to remedy the internal control weaknesses. See Remediation of Material Weaknesses in Internal Control over Financial Reporting described below.\nRemediation of Material Weaknesses in Internal Control over Financial Reporting\nInterim management is committed to remediating each of the material weaknesses identified above by implementing changes to the Companys internal control over financial reporting. Interim management has implemented, or is in the process of implementing, the following changes to the Companys internal control systems and procedures:\n· Formation of a new Board of Directors containing a majority of members who are independent directors as set forth by SEC Corporate Governance Standards.\n· Establishment of an audit committee per Sarbanes Oxley requirements including implementing audit committee best practices as recommended by the Treadway Commission, NASDAQ, AMEX and the NYSE.\n· Updating of the company code of ethics including the creation of an active anti-fraud program. Creation of a written, clearly articulated statement of the companys core values and mission.\n· Creation of education and training programs for all employees covering ethics, company policies and procedures, and good business practices in general.\n· Creation of additional guidelines with respect to senior managements responsibilities for SEC filings, financial reports, budgets and maintenance of controls over assets and expenditures.\n· Establishment of a Human Resource department.\nInterim management is committed to creating and implementing an effective internal control system for each of the five internal control components set forth in the Internal Control - Integrated Framework issued by COSO. In this regard, we are consulting with legal and accounting professionals to support us in the development of internal controls that are built into our business infrastructure and part of the every day consciousness of our organization.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this annual report. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\n(Note: The following information relates to our business in the fiscal year 2008. New Officers and Board members were appointed on March 28, 2022.)\nOUR DIRECTORS AND EXECUTIVE OFFICERS AS OF DECEMBER 31, 2008 WERE AS FOLLOWS:\nName\nAge\nPosition\nSholeh Hamedani\nChairman of the Board of Directors\nRichard J. Lewis, III\nActing Chief Executive Officer and Acting Chief Financial Officer\nJamshid Ghosseiri\nSecretary, Director\nTyler Wheeler\nDirector\nRoger Campos, Esq.\nDirector\nMs. Sholeh Hamedani currently serves as the Chairman of the Board. From August 23, 2002 to October 2007, Ms. Hamedani also served as Chief Executive Officer, Chief Financial Officer and Chairman of the Board. From May 2002 through the present, she has served as the President, CEO and founder of Shadrack, the Companys majority shareholder. From July 1995 to August 2002, she was President and Co-Founder of Two Dog Net, a security solutions provider and software developer and an affiliate of the Company. She was responsible for managing product development of new technologies, as well as creating and implementing Two Dog Nets marketing strategies. Ms. Hamedanis experience includes local and national advertising campaigns on television, radio and print, as well as producing, scripting and directing educational video programs and television infomercials. Prior to joining Two Dog Net, Ms. Hamedani was part of the founding team at SyberVision Systems in the Production and TV Media Department from 1985 to 1989.\nMr. Richard J. Lewis, III became our Acting Chief Executive Officer and Acting Chief Financial Officer in October 2007. Mr. Lewis became licensed to practice law in California in 1985. He has practiced with Wall Street law firms, including Mudge Rose Guthrie Alexander & Ferdon and Whitman Breed Abbott & Morgan. In 1996, Mr. Lewis stopped practicing law full time to act as the Chief Executive Officer of EcoTechnology, Inc., a waste-to-energy start-up company. Mr. Lewis was the CEO for EcoTechnology, Inc. for ten years where he oversaw the funding, construction and installation of the first gasification plant in the municipal wastewater treatment industry at Philadelphia, Pennsylvania.\nMr. Jamshid Ghosseiri has been a director since August 23, 2002 and Secretary since January 2, 2003. From January 9, 1989 through the present, he has served as Chief of the Microbiology Department at Mt. Diablo Medical Center. Mr. Ghosseiri has over 36 years of experience in the field of clinical microbiology and research in infectious diseases. He received a B.S. from San Jose State University in 1966 and completed his Post Graduate Studies in Infectious Diseases at Stanford University in 1969.\nMr. Tyler Wheeler has been our Chief Software Architect and a director since August 23, 2002. He co-founded Micro Tech Systems in 1989. In 1993, he and his father founded Integrative Systems, Inc., a hardware and software computer consulting firm. From January 1996 to August 2002, Mr. Wheeler served as Vice President of Technology at Two Dog Net. Mr. Wheeler completed a B.A. in Finance and Business Law at California State University, Fresno in 1996.\nMr. Roger Campos, Esq. has been a director since August 23, 2002. Mr. Campos received his B.A. in 1969 from the University of California at Santa Barbara and received his J.D. (law) degree in June 1972 from the United States International University (San Diego, CA). From February 2002 through the present, he has served as President and CEO of the Minority Business Roundtable, a national membership organization, based in Washington DC, for CEOs of the nations largest minority-owned companies. From January 2000 to February 2002, Mr. Campos was Executive Director of the Minority Business Roundtable. From January 1997 to January 2000, he served as Vice President of government relations for the Hispanic Association of Colleges and Universities. Mr. Campos provides consulting services in the areas of contracting, marketing, and business transactions.\nKey Staff\nJohn J. Heinke, C.P.A. has been our Controller since September 2004. He received his B.A. Degree in Economics from California State University, Chico, and became a Certified Public Accountant in the District of Columbia in 1967. From 1996 to 2004, he was Accounting Manager at HighSoft, Inc., a software development company and reseller of computer products and services. Previously, Mr. Heinke served as Controller of SyberVision Systems where he directed the accounting and management information systems, as SyberVision grew from a startup to a $100 million company in four years. Other experience includes managing the accounting for a $1.7 billion investment portfolio at Prudentials Real Estate Investment Department in San Francisco from 1978 through 1982. Previously, he was with Price Waterhouse, serving as Manager of the El Salvador office from 1974 through 1977.\nDirectors are elected to serve until the next annual meeting of stockholders or until their successors have been elected. Officers are appointed to serve until the meeting of the Board of Directors following the next annual meeting of stockholders, or continue as composed at the pleasure of the Board of Directors.\nOUR DIRECTORS AND EXECUTIVE OFFICERS AS OF MARCH 28, 2022.\nName\nAge\nPosition\nThomas Fahrhöfer\nChief Executive Officer and Chairman of the Board of Directors\nThomas J. Migotsch\nChief Financial Officer\nThomas Graus\nSecretary and Director\nThomas Fahrhöfer, Chief Executive Officer and Chairman of the Board of Directors\nMr. Fahrhoefer has exeperience in the field of pharmaceutical wholesaling and business development in the health care industry. In 2002, he received his diploma as a state-certified pharmaceutical sales representative after working for several years in the management of various German companies. In 2001, he joined Pfizer Germany and started his career in the pharmaceutical business. He was with Pfizer Germany from 2001 to 2003 before joining Sanochemia AG in 2003 in the global management of the Diagnostics business unit. In 2009, he founded CS Diagnostics GmbH Germany which over the years has grown into the CS Diagnostics Group which includes CS Diagnostics GmbH, Lapharm GmbH, CS Interpharm LLC and CS Diagnostics Corp.\nThomas J. Migotsch, Chief Financial Officer\nMr. Migotsch received his university degree in business administration from the Otto-Friedrich University of Bamberg in 2002. After an internship at Sanofi Winthrop GmbH, he joined DaimlerChrysler in the Mercedes Benz Motorsport Division. Until 2006, he was responsible for press releases of the DTM, Formula 3 and Formula 1 (McLaren Mercedes) for DaimlerChrysler. From 2006 to the present day, he has taken a leading role in various projects in connection with professional motorsport and Formula 1 drivers. In 2012, he founded the Swiss consulting company SGM AG, with which he still develops strategy concepts and business plans for renowned companies.\nThomas Graus, Secretary and Director\nMr. Graus has experience in the field of medical technology and in the development of distribution networks. In 2002, he received his diploma as an accountant from the commercial college in Sterzing, Italy. His professional career started in the field of industrial hall construction with the German company Wolf System GmbH. From 2005, he was assigned with the company EUROMET LTD in the field of road and tunnel construction in Poland and Italy, he fulfilled this role until 2011 and then moved to EURO GUS GROUP A.S. which is active in the field of trade in metals and precious metals. At the beginning of 2018, he moved to the Swiss company PERISO SA, a technology developer in the field of medical technology, air purification and energy storage systems. At PERISO SA, he is still in charge in the installation of an international distribution network in his role as Head of Medical Division.\nInvolvement in Certain Legal Proceedings\nOswald & Yap\nOn November 24, 2004, Oswald & Yap, a Professional Corporation (O&Y), formerly counsel to the Company, filed a complaint in the Superior Court of California, County of Orange, Case No. 04CC11623, against the Company, seeking recovery of allegedly unpaid legal fees in the amount of $50,984.86 in connection with the legal representation of the Company. Subsequently the amount claimed of unpaid legal fees was reduced to $37,378.43 because it was discovered that O&Y did not properly credit all of the payments that were made by the Company to O&Y. The amount of $37,378.43 was deposited in an escrow account by the Company on July 5, 2005. The complaint includes causes of action for breach of contract. The Company disputes the amounts claimed alleging that O&Ys services were otherwise unsatisfactory. On May 9, 2005, O&Y submitted an Offer to Compromise for a $0 payment by the Company to O&Y in exchange for mutual releases which the Company rejected.\nOn February 14, 2005, a cross-claim was filed in the Superior Court of California, County of Orange, Case No. 04CC11623 by the Company against O&Y alleging breach of contract, professional negligence, negligent representation, and breach of good faith and fiduciary duty. The basis of the allegations is that O&Y was retained to assist the Companys predecessor company in the purchase and acquisition of D.W.C. Installations (D.W.C.) with the expectation that D.W.C. had available free-trading shares such that the Company could immediately raise capital on the relevant markets and that in advising the Company through the purchase, O&Y failed to properly advise the Company as to the status of D.W.C. and its shares, which in fact were not free-trading. As a result of this conduct, the Company alleges damages in an unspecified amount but including purchase costs of D.W.C., extended operation costs, refiling costs, audit costs, legal fees, loan fees, lost market share, and costs for registration. O&Y has vigorously disputed the claims set forth in the cross-complaint and has indicated its intention, should it prevail in its defense, to institute a malicious prosecution action against the Company, Nasser Hamedani, Sholeh Hamedani and Company counsel. Litigation of this matter is currently stayed pending the SEC Complaint below.\nSEC Complaint\nOn September 27, 2006, the Commission filed a complaint (Complaint) against The Childrens Internet, Inc. (TCI) and its principles, Nasser Hamedani and Sholeh Hamedani (collectively, the Hamedanis) and Two Dog Net, Inc. (TDN) and two of its stock promoters, Peter Perez (Perez) and Cort Poyner (Poyner). In the Complaint, the Commission alleged that, from February 2002 through June 2005, the Hamedanis purportedly on behalf of TCI, fraudulently obtained approximately $5.5 million from public investors. The Hamedanis diverted a significant amount of the investors money to pay personal expenses and also hundreds of thousands of dollars in undisclosed commissions to two stock promoters, Perez and Poyner.\nOn March 19, 2008, the Court entered a final judgment against Perez directing him to pay $85,000 in disgorgement and prejudgment interest.\nWilliam Arnold v The Childrens Internet, Inc., Case No. RG 07-359949\nOn April 18, 2008, William Arnold filed suit against the Company for breach of contract relating to his written employment agreement commencing on December 2005. Mr. Arnold claims the Company agreed to pay a salary of $120,000 per annum, a performance bonus, and 1,000,000 shares of TCI common stock. Mr. Arnold is seeking $600,000 plus interest and punitive damages. As of December 31, 2008, the Company does not have legal counsel and has not filed an answer in this complaint and at the Status Conference neither the Company or counsel for William Arnold appeared at the hearing.\nStonefield Josephson, Inc\nOn June 13, 2006, the Company became subject to an arbitration demand from Stonefield Josephson, Inc., its former accountant, seeking reimbursement costs for legal fees spent in connection with the SEC inquiry of the Company. Stonefield Josephson, Inc.s claim seeks recovery of $29,412.74. The Company disputes any amounts owed because of a settlement agreement entered into between the respective parties in December 2004 effectively terminating their relationship. This matter was submitted to binding arbitration through AAA in January 2007.\nThe Arbitrators decision was issued on February 2, 2007, awarding Stonefield Josephson, Inc. the sum of $19,000 plus costs and fees in the amount of $1,425 due and payable March 15, 2007. The decision also awarded Stonefield Josephson, Inc. interest at the rate of 10% per annum on $19,000 from March 15, 2007. On August 30, 2007, an additional $2,500 in post-arbitration attorneys fees and costs was awarded by the Los Angeles Superior Court. No amounts have been paid to Stonefield Josephson since the date of the Arbitrators decision.\nOn August 25, 2006, the Company filed a complaint against its former accountants, Stonefield Josephson, Inc., and its principal Dean Skupen, in the Superior Court of California, County of Alameda, Case No. VG06286054 alleging breach of contract, promissory estoppel, breach of implied covenant of good faith and fair dealing, negligent misrepresentation, fraud, and unfair business practices arising out of defendants alleged failure to properly perform contractual obligations. The Company seeks damages resulting from defendants actions, including recovering costs expended for a subsequent audit and the resultant loss in stock price following the Companys inability to file necessary reports with the NASD. The matter was subsequently transferred to Los Angeles Superior Court. Mediation on this matter took place on February 29, 2008 in Los Angeles, California but was unsuccessful.\nNote: This 10-K filing is being made on the current date. The current management does not have the legal files and it has been reported the entire case file for this action has been deleted and no records are available. On September 25, 2013 the Court reported the Paper File Destroyed and there are no records subsequent to the docket entries up to April 16, 2007. There is no further information available on this action.\nLumber & Company\nOn April 8, 2008, Lumer & Company filed a claim in the Superior Court of California, City and County of San Francisco for breach of contract related to unpaid accounting service fees, CGC 08-474007. On June 25, 2008, a judgment was entered against the Company for $58,175.66, including prejudgment interest and cost.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires the Companys executive officers, directors, and persons who beneficially own more than ten percent of a registered class of the Companys equity securities, to file with the SEC initial reports of ownership and reports of changes in ownership of the Companys common stock. Such officers, directors, and persons are required by SEC regulation to furnish the Company with copies of all Section 16(a) forms that they file with the SEC.\nTo the Companys knowledge, all persons who, during the fiscal year ended December 31, 2008, were directors or officers of the Company, or beneficial owner of more than ten percent of the Companys Common Stock, failed to file reports required by Section 16(a) of the Act during such fiscal year.\nCode of Ethics\nOn March 20, 2003, the Board of Directors of the Company adopted a written Code of Ethics designed to deter wrongdoing and promote honest and ethical conduct, full, fair and accurate disclosure, compliance with laws, prompt internal reporting and accountability to adherence to the Code of Ethics. The code applies to every officer, director and employee of the Company. The Code of Ethics was filed with the Securities and Exchange Commission as an Exhibit to the Companys Form 10-QSB for the period ended March 31, 2003.\nAudit Committee\nThe Company does not have a designated audit committee. The Company does not have an audit committee financial expert serving on its audit committee because it does not have an audit committee. ITEM 11. EXECUTIVE COMPENSATION\n(Note: The following information relates to our business in the fiscal year 2008. New Officers and Board members were appointed on March 28, 2022.\nSummary Compensation Table\nThe following table sets forth the total compensation earned by or paid to the executive officers for the fiscal years ended December 31, 2008 and 2007.\nSUMMARY COMPENSATION TABLE\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nStock Awards\n($)\nOption Awards ($)\nNon-Equity Incentive Plan Compensation\n($)\nAll Other Compensation\n($)\nTotal\n($)\nSholeh Hamedani,\n$ 180,000 (1) $\n$\n$\n$\n$\n$ 180,000\nFormer CEO and CFO\n144,194 (2) $\n$\n$\n$\n$\n$ 144,194\nRichard J. Lewis, III\n$\n$\n$\n$\n$\n$\n$\nActing CEO and CFO\n$\n$\n$\n$\n$\n$\n$\n____________\n(1) The officers salary was accrued but has not been paid through the date of this report.\n(2) Ms. Hamedani resigned as Chief Executive Officer and Chief Financial Officer as of October 19, 2007.\nOutstanding Equity Awards\nNo named executive officer had equity awards outstanding as of the end of the Companys 2008 fiscal year.\nAll decisions regarding compensation for our executive officers and executive compensation programs are reviewed, discussed, and approved by the Board of Directors. All compensation decisions are determined following a detailed review and assessment of external competitive data, the individuals contributions to our success, any significant changes in role or responsibility, and internal equity of pay relationships.\nThe Company did not maintain a written employment agreement with Sholeh Hamedani during her service as Chief Executive Officer and Chief Financial Officer and does not maintain a written employment agreement with Richard Lewis for his role as acting Chief Executive Officer and Chief Financial Officer. Mr. Lewis served on an at-will basis at the pleasure and discretion of the Board of Directors of the Company.\nCompensation of Directors\n(Note: The following information relates to our business in the fiscal year 2008. New Officers and Board members were appointed on March 28, 2022.)\nThe following table sets for the compensation of the Companys directors for the Companys 2008 fiscal year:\nDIRECTOR COMPENSATION TABLE\nName\nFees Earned or Paid in Cash\n($)\nStock Awards\n($)\nOption Awards\n($)\nNon-Equity Incentive Plan Compensation\n($)\nNonqualified Deferred Compensation Earnings\n($)\nAll Other Comp-ensation\n($)\nTotal\n($)\nJamshid Ghosseiri(1)\n$\n$\n$ 10,125\n$\n$\n$\n$ 10,125\nTyler Wheeler(2)\n$\n$\n$ 10,125\n$\n$\n$\n$ 10,125\nRoger Campos, Esq.(1)\n$\n$\n$ 10,125\n$\n$\n$\n$ 10,125\nSholeh Hamedani\n$\n$\n$\n$\n$\n$\n$\n____________\n(1) The director is entitled to purchase an aggregate of 125,000 shares of the Companys common stock pursuant to an option grant which was made to the director under the Companys 2007 Equity Incentive Plan on April 30, 2007 with an exercise price of $0.081 and which is outstanding and fully exercisable as of the fiscal year end.\n(2) The director is entitled to purchase an aggregate of 1,125,000 shares of the Companys common stock pursuant to option awards granted to the director outstanding as of the fiscal year end. The director is entitled to purchase 125,000 of these shares pursuant to an option grant which was made to the director under the Companys 2007 Equity Incentive Plan on April 30, 2007 with an exercise price of $0.081 and which is outstanding and fully exercisable as of the fiscal year end.\nThe Company is not under any obligation to provide any compensation to directors, except for reimbursement of their reasonable expenses incurred in attending directors meetings. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\n(Note: The following information relates to our business in the fiscal year 2008. New Officers and Board members were appointed on March 28, 2022.)\nThe following table sets forth information with respect to the number of shares of common stock beneficially owned by (i) each of our directors, (ii) each named executive officer, (iii) all executive officers and directors as a group, and (iv) each person known by us to be a beneficial owner of more than 5% of any class of our common stock as of December 31, 2008. The percent of common stock outstanding in the table below is based on 48,286,306 shares of the outstanding Common Stock of the Company with voting power and does not include the 4,500,000 shares held in escrow for the benefit of the Company until released pursuant to the DSPA.\nName and Address of Beneficial Owner(1) Amount and Nature of Beneficial Ownership (#) Percent of Common Stock Outstanding\n(Approximations)\nSholeh Hamedani, Chairman of the Board(2) 14,040,988 29.07%\nRichard J. Lewis, Acting Chief Executive Officer and Chief Financial Officer(3) 14,040,988 29.0%\nJamshid Ghosseiri, Ph.D., Secretary, Director(4) 125,000 0.2%\nRoger Campos, Director(4) 125,000 0.2%\nTyler Wheeler, CTO, Director(5) 1,125,000 2.32%\nAll Officers and Directors as a group (5 people) 15,415,988 31.92%\nShadrack Films, Inc. 14,040,988 29.07%\nTwo Dog Net, Inc.(6) 18,000,000 37.27%\nThe Childrens Internet Holding Company, LLC(3) 14,040,988 29.07%\n____________\n(1) Except as otherwise indicated, we believe that the beneficial owners of common stock listed above, based on information furnished by such owners, have sole investment and voting power with respect to such shares, subject to community property laws where applicable. Beneficial ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities. Shares of common stock subject to options or warrants currently exercisable, or exercisable within 60 days, are deemed outstanding for purposes of computing the percentage of the person holding such options or warrants, but are not deemed outstanding for purposes of computing the percentage of any other person.\n(2) Consists of 14,040,988 post-split shares of common stock owned by Shadrack Films, Inc. formerly known as The Childrens Internet, Inc., a California corporation, of which Sholeh Hamedani is the sole shareholder.\n(3) TCI Holding, and Richard Lewis, TCI Holdings Manager, can be deemed to beneficially own 14,040,988 shares of the Companys common stock under Rule 16a-1(a)(1) because, pursuant to the DSPA, Shadrack, which directly owns 14,040,988 shares of the Companys common stock, must engage in certain actions in order to close the DSPA and consummate the transactions contemplated thereby. These actions include, without limitation, approving an amendment to the Articles of Incorporation of the Company to increase the number of authorized shares of the Companys common stock from 75,000,00 shares to 250,000,000 shares and approving the appointment of the directors to the Companys board of directors designated by TCI Holding. TCI Holding and Richard Lewis disclaim beneficial ownership of these securities and this report shall not be deemed an admission that TCI Holding or Richard Lewis are the beneficial owner of these securities for purposes of Section 16 of the Exchange Act or for any other purpose.\n(4) Consists of 125,000 shares of the Companys common stock underlying options which are exercisable within 60 days of March 31, 2008.\n(5) Consists of 1,125,000 shares of the Companys common stock underlying options which are exercisable within 60 days of March 31, 2008.\n(6) Consists of 18,000,000 shares of the Companys common stock underlying options which are exercisable within 60 days of March 31, 2008. Such options shall be canceled pursuant to the terms of the DSPA upon the closing of the DSPA.\nSecurities Authorized For Issuance Under Equity Compensation Plans\nInformation regarding securities authorized for issuance under equity compensation plans can be found in Part II, Item 5 of this Report. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nWe have not entered into any transaction nor is there any proposed transactions in which any of the founders, directors, executive officers, shareholders or any members of the immediate family of any of the foregoing had or is to have a direct or indirect material interest. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe Companys independent accountant for the year 2007 was Hunter & Renfro, LLP. The Companys independent accountant for the year 2008 is OLAYINKA OYEBOLA & CO.\nAudit Fees\nHunter & Renfro, LLP billed fees of $89,056 through March 31, 2008 for the review of the Companys Quarterly Reports on Form 10-QSB from first through third quarters of 2007 and audit of the financial statements for the year ended December 31, 2007.\nOLAYINKA OYEBOLA & CO. billed fees of $2,500 through March 31, 2009 for the review of the Companys Quarterly Reports on Form 10-Q from first through third quarters of 2008 and audit of the financial statements for the year ended December 31, 2008.\nAudit-Related Fees\nNeither Hunter & Renfro, LLP (formerly known as Hunter, Flemmer, Renfro & Whitaker, LLP) nor OLAYINKA OYEBOLA & CO. did not provide or bill for any audit-related services for the year ended December 31, 2008 or 2007.\nTax Fees\nNeither Hunter & Renfro, LLP nor OLAYINKA OYEBOLA & CO. provided or billed for any professional services during the two years ended December 31, 2008 and 2007 in connection with tax advice, tax compliance or tax planning.\nAll Other Fees\nNeither Hunter & Renfro (formerly known as Hunter, Flemmer, Renfro & Whitaker, LLP) nor OLAYINKA OYEBOLA & CO. provided any other professional services for the Company during the years ended December 2008 and 2007. ITEM 15. EXHIBITS\nThe following exhibits are incorporated herein by reference or are filed with this report as indicated below.\nExhibit Number\nExhibit Description\nLease Agreement entered into by Shadrack Films, Inc. dated March 11, 2004(8)\n1.1\nDefinitive Stock Purchase Agreement dated as of October 19, 2007(9)\n1.1\nDefinitive Interim Stock Purchase Agreement dated as of June 15, 2007(10)\n1.1\nAmendment No. 4 to the Definitive Stock Purchase Agreement dated March 18, 2008(11)\n1.1\nAmendment No. 3 to the Definitive Stock Purchase Agreement dated February 29, 2008(12)\n1.1\nAmendment No. 2 to the Definitive Stock Purchase Agreement dated February 6, 2008(13)\n1.1\nAmendment No. 1 to the Definitive Stock Purchase Agreement dated December 6, 2007(14)\n1.2\nWarrant to Purchase Common Stock of The Childrens Internet, Inc. dated December 6, 2007(14)\n1.2\nAssignment And Royalty Agreement(9)\n1.3\nServices Agreement entered into on December 6, 2007, but made effective as of October 19, 2007(14)\n3.1\nArticles of Incorporation, dated September 25, 1996(1)\n3.2\nCertificate of Amendment of Articles of Incorporation, dated February 10, 2000(1)\n3.3\nCertificate of Amendment of Articles of Incorporation, dated December 27, 2002(1)\n3.4\nCertificate of Designation of Series A Preferred Stock, dated November 8, 2002(1)\n3.5\nArticles of Domestication to Wyoming (17)\n3.6\nArticles of Amendment - Name change to FlashZero Corp. (17)\n3.7\nBylaws(1)\n10.1\nPlan of Reorganization and Acquisition, July 3, 2002(1)\n10.2\nConsulting Agreement with Alan Schram, dated June 28, 2002(1)\n10.3\nLicense Agreement dated September 10, 2002(1)\n10.4\nAmendment to License Agreement, dated November 5, 2002(1)\n10.5\nWholesale Sales & Marketing Agreement, dated March 3, 2003(2)\n10.6\nStock Purchase Agreement, dated October 11, 2002(3)\n10.7\nCo-Location Agreement, dated July 11, 2003(4)\n10.8\nIndependent Sales Agreement with Infolink, dated August 14, 2003(3)\n10.9\nLicensing Agreement with Infolink, dated August 14, 2003(3)\n10.10\nCo-Location Agreement, dated September 26, 2003(5)\n10.12\nAgreement between the Company and Crosslink Financial Communications dated February 25, 2005(6)\n10.13\nLoan Agreement, dated October 11, 2002(7)\n10.14\nTCI 2007 Equity Incentive Plan dated April 30, 2007(15)\nCode of Ethics(16)\n31.1\nCertification of Chief Executive Officer Pursuant to the Securities Exchange Act of 1934, Rules 13a-14 and 15d-14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification of Chief Financial Officer Pursuant to the Securities Exchange Act of 1934, Rules 13a-14 and 15d-14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification of Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification of Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n____________\n(1) Incorporated by reference to the Companys Registration Statement on Form SB-2, filed on February 10, 2003, as amended (Registration No. 333-103072).\n(2) Incorporated by reference to the Companys Annual Report on Form 10-KSB for the fiscal year ended December 31, 2002, filed on March 31, 2003 (SEC File No. 000-29611).\n(3) Incorporated by reference to Amendment 2 to the Companys Registration Statement on Form SB-2, filed on September 11, 2003, as amended (Registration No. 333-103072).\n(4) Incorporated by reference to the Companys Quarterly Report on Form 10-QSB for the quarter ended June 30, 2003 (File No. 000-29611) filed on August 14, 2003.\n(5) Incorporated by reference to Amendment 4 to the Companys Registration Statement on Form SB-2, filed on February 13, 2004, as amended (Registration No. 333-103072).\n(6) Incorporated by reference to the Companys Annual Report on Form 10-KSB for the fiscal year ended December 31, 2004, filed on June 9, 2005 (SEC File No. 000-29611).\n(7) Incorporated by reference to the Companys Quarterly Report on Form 10-QSB for the quarter ended June 30, 2005 (File No. 000-29611) filed on August 15, 2005.\n(8) Incorporated by reference to Exhibit 10.11 to Amendment No. 5 to the Form SB-2 filed by the Company on April 6, 2004.\n(9) Incorporated by reference to the Form 8-K filed by the Company (File No. 000-29611) on October 25, 2007.\n(10) Incorporated by reference to the Form 8-K filed by the Company (File No. 000-29611) on June 21, 2007.\n(11) Incorporated by reference to the Form 8-K filed by the Company (File No. 000-29611) on March 21, 2008.\n(12) Incorporated by reference to the Form 8-K filed by the Company (File No. 000-29611) on March 6, 2008.\n(13) Incorporated by reference to the Form 8-K filed by the Company (File No. 000-29611) on February 12, 2008.\n(14) Incorporated by reference to the Form 8-K filed by the Company (File No. 000-29611) on December 12, 2007.\n(15) Incorporated by reference to the Form 10-KSB filed by the Company (File No. 000-29611) on May 18, 2007.\n(16) Incorporated by reference to the Form 10-QSB filed by the Company (File No. 000-29611) on May 15, 2003.\n(17) Incorporated by reference to the Form 10-Q filed by the Company (File No. 000-29611) on November 17, 2022.\nITEM 16. FORM 10-K SUMMARY\nNot Applicable.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant caused this report to be signed on its behalf by the undersigned, duly authorized.\nFLASHZERO CORP.\nfka THE CHILDRENS INTERNET, INC.\nDate: November 21, 2022 By: /s/ Thomas Fahrhöfer\nThomas Fahrhöfer\nChief Executive Officer and Principal Executive Officer\nDate: November 21, 2022 By: /s/ Thomas J. Migotsch\nThomas J. Migotsch\nChief Financial Officer and Principal Accounting Officer\nIn accordance with the Securities Exchange Act of 1934, this Report has been signed by the following persons on behalf of the registrant in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Thomas Fahrhöfer\nCEO, Chairman of the Board\nNovember 21, 2022\nThomas Fahrhöfer\n/s/ Thomas J. Migotsch\nCFO, Director\nNovember 21, 2022\nThomas J. Migotsch\n/s/ Thomas Graus\nSecretary, Director\nNovember 21, 2022\nThomas Graus"
}