{
    "cik": "1121795",
    "company": "GHST World Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "NY",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1121795/0001553350-23-000446-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1121795/000155335023000446/ghst_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1121795/0001553350-23-000446.txt",
    "filename": "1121795_10K_2023_0001553350-23-000446.htm",
    "content": "ITEM 1. BUSINESS.\nCautionary Note Regarding Forward Looking Statements\nThis annual report on Form 10-K (this Report) contains forward-looking statements including statements regarding the Companys patents, the development, marketing and sale of its products including its Smart Shin Guard, the implementation of its business plan and expected timelines for meeting its objectives, the intended launch of a new business line focused on clean energy infrastructure and services and our initial four solar plants and anticipated revenue and projections for that business, the need for capital to fund and grow its operations, and liquidity. Forward-looking statements can be identified by words such as anticipates, intends, plans, seeks, believes, estimates, expects and similar references to future periods. Forward-looking statements are based on our current expectations and assumptions regarding our business, the economy and other future conditions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Our actual results may differ materially from those contemplated by the forward-looking statements. We caution you therefore against relying on any of these forward-looking statements. They are neither statements of historical fact nor guarantees or assurances of future performance. The results anticipated by any or all of these forward-looking statements might not occur. Important factors, uncertainties and risks that may cause actual results to differ materially from these forward-looking statements are summarized in the Summary of Risk Factors below and are more particularly described in ITEM 1A. RISK FACTORS.\nInvesting in our common stock involves a high degree of risk. You should carefully consider the following risk factors before deciding whether to invest in the common stock. If any of the events discussed in the risk factors below occur, our business, financial condition, results of operations or prospects could be materially and adversely affected. In such case, the value and marketability of the common stock could decline, and you might lose all or part of your investment.\nSummary of Risk Factors\nOur business is subject to numerous risks and uncertainties that you should consider before investing in our common stock. Some of the principal risk factors that make an investment in the Company speculative or risky are summarized as follows:\n· We have generated no material revenue during the last three fiscal years or current fiscal year, and in order to continue as a going concern we require additional capital either through a debt or equity financing.\n· We are still in the process of developing our Smart Shin Guard, which is our principal product the development of which has been a lengthy and uncertain process for which we have failed to meet internal forecasts on multiple occasions, and there can be no assurance we will be successful in completing such development or that we can successfully market this product once developed.\n· We have a limited operating history and our likelihood of success is contingent upon the problems, expenses, and complications frequently encountered by development stage companies.\n· We may have or discover in the future material weaknesses in our internal controls and may face difficulties remediating any such weaknesses;\n· In order to generate material revenue, we will need to successfully develop and market our products and services, including the Smart Shin Guard which is our principal product and is still under development;\n· Our business is dependent upon our intellectual property which we may be unable to obtain or protect without incurring significant expenses or at all.\n· We may become involved in litigation to defend our intellectual property or to defend against infringement claims from third parties, which would be expensive and time consuming and could materially adversely affect our business.\n· We are highly dependent on a small number of key personnel, the loss of whom would materially adversely affect our business.\n· The industry in which we principally operate is highly competitive, and most of our competitors have greater financial and other resources and capital raising abilities than we do, which will render our efforts to establish a market for our brand and products, including our Smart Shin Guard, particularly challenging.\n· Because we will be reliant on a single product, if we are unable to establish a market for our product and generate material revenue, this lack of diversification will be difficult to overcome and investors could lose some or all of their investment.\n· There is currently no active market for our securities, there can be no assurance that such a market will ever develop, and the future prices and liquidity of our securities could be unpredictable and volatile.\n· Certain events have caused and may continue to cause disruptions in our business and industry, which may hinder our progress and growth prospects.\nRisks Related to the Company\nOur ability to continue as a going concern is in doubt absent obtaining adequate new debt or equity financing.\nWe have limited capital and have accumulated losses through June 30, 2023, of $13,370,665 since inception. Because we do not have sufficient working capital and cash flows for continued operations for at least the next 12 months, our auditors have issued an opinion with an explanatory paragraph regarding our ability to continue as a going concern. Our continued existence is dependent upon us or obtaining the necessary capital to meet our expenditures. We cannot assure you that we will be able to raise adequate capital to meet our future working capital needs.\nBecause we expect to need additional capital to fund our growing operations, we may not be able to obtain sufficient capital and may be forced to limit the scope of our operations.\nWe currently need substantial working capital. The slowdown in the global economy or any subsequent or further financial hardship caused by the war in Ukraine, inflation and central banks interest rate increases in response, along with any recession or market downturn which result, could adversely affect our ability to raise capital. If adequate additional debt and/or equity financing is not available on reasonable terms or at all, we may not be able to remain in business, and we will have to cease operations.\nEven if we secure the necessary working capital, we may not be able to negotiate terms and conditions for receiving the additional capital that are acceptable to us. Any future equity capital investments will dilute existing shareholders. In addition, new equity or convertible debt securities issued by us to obtain financing could have rights, preferences and privileges senior to our common stock. We cannot give you any assurance that any additional financing will be available to us, or if available, will be on terms favorable to us.\nIf we are not successful, you may lose your entire investment.\nProspective investors should be aware that if we are not successful in our new business, their entire investment in the Company could become worthless. Even if the Company is successful, we can provide no assurances that investors will derive a profit from their investment. Even if we can raise sufficient capital or generate revenue, we cannot guarantee any resulting proceeds to us will be sufficient for us to grow our operations and become profitable. In past periods we have failed to meet anticipated or desired milestones for our product development within the timelines originally projected, in part due to our limited capital and other resources as well as external factors. These delays and limitations raise questions as to our ability to achieve our goals within the time periods desired or at all. If we are not successful, you may lose your entire investment.\nBecause we have a limited operating history to evaluate our company, the likelihood of our success must be considered in light of the problems, expenses, difficulties, complications and delay frequently encountered by a new company.\nSince we have a limited operating history under our current business model, which we are frequently adjusting in pursuit of new business opportunities, it is difficult for investors to evaluate our business and prospects. You must consider our prospects in light of the risks, expenses and difficulties we face as an early stage company with a limited operating history. Investors should evaluate an investment in our company in light of the uncertainties encountered by start-up companies in a highly competitive industry such as ours, which contains significant barriers to market entry. There can be no assurance that our efforts will be successful or that we will be able to attain profitability.\nBecause GHST is in the development stage of each of its planned businesses and its business plan is unproven, we may fail to generate material revenue or achieve profitability.\nGHST is relying primarily upon its U.S. patented sports equipment technology which we intend to market and sell in the U.S. and foreign athletic markets to individual players, teams and organizations interested in the Smart Shin Guards data collecting capabilities. We have not sold our products, and do not presently have inventory available for sale. Our development process for the Smart Shin Guard has repeatedly been delayed from original projected timeframes due to our small size and lack of capital. If this trend continues and we fail to commercialize the product before our patents expires in our target markets, we could fail to generate material revenue or establish brand recognition necessary to achieve our goals and provide value to our shareholders. We cannot assure you that assuming we obtain sufficient financing, we will be able to successfully market our product in any of the target countries, derive any material revenue or attain profitability. Further, with the addition of InSSIDe World which is in its very early stages as a solar energy and intelligence and defense company, in addition to our legacy focus on the Smart Shin Guard and the other early stage businesses we are developing or considering as described in this Report, our management team will be divided among multiple projects, and may be unable to allocate and use our limited resources in an efficient or effective manner. Further, each industry in which we seek to operate through the aforementioned businesses and business plans poses unique challenges, including intense competition, regulatory requirements, and limitations on qualified personnel and market opportunity, which gives rise to further risks and uncertainties that are particularly present for us as we continue in the early development stage of each prospective business. If we are not successful in marketing the Smart Shin Guard and/or developing other business as presently intended, it is likely that you will lose your entire investment.\nBecause our business model is new, our growth strategy may not be achievable and may not result in profitability.\nWe may not be able to implement our growth strategy reflected in our business plan rapidly enough as to achieve profitability. Our growth strategy is dependent on a number of factors, including market acceptance of the Smart Shin Guard. We cannot assure you that consumers and others will purchase the Smart Shin Guard or that a sufficient market demand for our product will develop for us to generate revenue or become profitable.\nAmong other things, implementation of our growth strategy would be adversely affected by the following:\n· we may not be able to attract sufficient customers/subscribers for our product(s);\n· our research and development, manufacturing and marketing costs may be materially more than we anticipate which will affect our future gross profit margins;\n· a decline in general market conditions may prevent us from successfully establishing a customer base or raising capital as required;\n· if our product proceeds to the commercialization phase, we may fail to adequately protect or maintain our intellectual property, especially if the development phase continues to be delayed or prolonged; and\n· we may face significant litigation from competitors with intellectual property rights for products that are similar to ours, the occurrence of which would not only divert our managements time and attention, but involve prohibitive legal and other defense costs.\nOur business will depend, to a large extent, upon our intellectual property.\nWe rely on our patents in certain jurisdictions to protect our Smart Shin Guard technology. These patents and any future patent(s) we can obtain will be critical to our ability to market our product in applicable jurisdictions without the risk of reverse engineering of our technology. In the event that we are unable to secure, maintain or enforce such patents, the marketability and viability of our product could be adversely affected, including by being vulnerable to reverse engineering in any jurisdiction where the patent did not issue. While we received the patent grants in U.S., Italy, France, Spain, Germany and the United Kingdom, there can be no assurance that other patents needed to pursue our goals and achieve our objectives will be secured or maintained. For example, while in October 2022 we received approval of our European patent application covering up to 36 countries, in 2023 we made the decision to limit payment of the corresponding fees to receive the official patent grant to select jurisdictions within Europe, while allowing the patents to lapse in other European jurisdictions for failure to pay the fee, in order to manage costs. Further, we were granted a patent in Hong Kong in March 2023 but subsequently abandoned that patent. We cannot predict with certainty the potential consequences of this course of action for our future operations in Europe and Asia. In the event we are unable to obtain, maintain or protect our patents and the intellectual property related to our technology, the value of our intellectual property and our ability to generate revenue therefrom could be materially adversely affected.\nIf we cannot protect intellectual property rights related to our current or future products, we may not be able to compete effectively in our markets.\nWe rely upon a combination of patents, trade secret protection and confidentiality agreements to protect the intellectual property related to our current or future products. The strength of our patent in the sports logistics and technology field involves complex legal questions and can be uncertain. Our international patents may fail to result in adequate protection in the countries in which we desire to market and sell our products. Even for our issued patents, third parties may challenge their validity, enforceability or scope, which may cause such patents to be narrowed or invalidated. Even if unchallenged, our patents and may not adequately protect our intellectual property or prevent others from designing around our claims.\nIf we fail to maintain, monitor or enforce patents we hold or if their breadth or strength of protection is threatened, it could threaten our ability to commercialize our products. Issued patents may be found invalid and unenforceable or challenged by third parties. Patents have a limited lifespan. In the United States, the natural expiration of a patent is 20 years after it is filed, although various extensions may be available. The life of a patent, and the protection it affords, is limited. When the patent life has expired for a product, we will become vulnerable to competition from similar products or generic versions attempting to replicate our Smart Shin Guard or other products we may develop or acquire in the future. Further, if we continue to experience delays in our product development efforts, and/or encounter delays in production, distribution or in regulatory or league approvals, the time during which we will be able to market and commercialize a product candidate under patent protection could be significantly reduced, and as a result we may be unable to establish material or consistent revenue streams, brand recognition or markets for our product before competitors use our designs or processes to market similar products.\nIn addition to patent protection, we rely on trade secret protection and confidentiality agreements to protect proprietary know-how that is not patentable, processes for which patents are difficult to enforce and any other elements of our product development processes that involve proprietary know-how, information or technology not covered by patents. As a general practice, our employees, consultants, advisors and any third parties who have access to our proprietary know-how, information or technology enter into confidentiality agreements. Nonetheless, our trade secrets and other confidential proprietary information may be disclosed and competitors may otherwise gain access to our trade secrets or independently develop substantially equivalent information and techniques.\nThe laws of some foreign countries do not protect proprietary rights to the same extent or in the same manner as the laws of the United States. We may encounter significant problems in protecting and defending our intellectual property both in the United States and abroad, particularly given our present business plan to primarily focus our marketing and sales efforts on countries located outside of the United States. If we are unable to prevent material disclosure of the non-patented intellectual property related to our technologies to third parties, and there is no guarantee we will have any such enforceable trade secret protection, we may not be able to establish or maintain a competitive advantage in our market, which could materially adversely affect our business, results of operations and financial condition.\nThird-party intellectual property infringement claims may prevent or delay our development and commercialization efforts.\nOur commercial success depends in part on our avoiding infringement on the patents and proprietary rights of third parties. There is substantial technology litigation, both within and outside the United States, involving patent and other intellectual property rights, including patent infringement lawsuits, interferences, oppositions, and reexaminations and other post-grant proceedings before the U.S. Patent and Trademark Office, and corresponding foreign patent offices. U.S. and foreign issued patents and pending patent applications, which are owned by third parties, may exist in the fields in which we are pursuing patents for our product. As the sports logistics and technology industries expand and more patents are issued, the risk increases that our products may be subject to claims of infringement of the patent rights of third parties.\nThird parties may assert that we are employing their proprietary technology without authorization. There may be third-party patents or patent applications with claims to materials, concepts, or methods of manufacture related to the use or manufacture of our products. Because patent applications can take many years to issue, there may be patent applications currently pending that may later result in patents that our products may infringe. Third parties may obtain patents in the future and claim that use of our technologies infringes on these patents. If any third-party patents were to be held by a court of competent jurisdiction to cover the manufacturing process of our products, the holders of any such patents may be able to block our ability to commercialize such products unless we obtained a license under the applicable patents, or until such patents expire. Similarly, if any third-party patents were to be held by a court of competent jurisdiction to cover aspects of our concepts, processes for manufacture or methods of use, the holders of any such patents may be able to block our ability to develop and commercialize the applicable product unless we obtained a license or until such patent expires. In either case, such a license may not be available on commercially reasonable terms or at all.\nParties making intellectual property claims against us may obtain injunctive or other equitable relief, which could block our ability to further develop and commercialize our products. Defense of these claims, regardless of their merit, involves substantial litigation expense and would involve a substantial diversion of our managements attention from our business. Because of the costs involved in defending patent litigation, we currently lack and may in the future lack the capital to defend our intellectual property rights. If a claim of infringement against us succeeds, we may have to pay substantial damages, possibly including treble damages and attorneys fees for willful infringement, pay royalties, redesign our infringing products or obtain one or more licenses from third parties, which may be impossible or require substantial time and monetary expenditure.\nWe may be involved in lawsuits to protect or enforce our patents or other intellectual property rights, which could be expensive, time-consuming and unsuccessful.\nWe rely on a patent on the Smart Shin Guard to protect our intellectual property rights. In the United States, we have a patent and also have patents in certain jurisdictions in Europe. If we do not maintain these patents, we may be subject to significant competition. Competitors may infringe our patents or otherwise take action against our intellectual property rights. To counter such infringement, interference or similar adverse occurrence, we may be required to file infringement or similar claims, or we may be required to defend the validity or enforceability of our intellectual property rights, including our patents, which can be expensive and time-consuming and may force us to divert our limited resources. In an infringement proceeding, a court may decide that either one or more of our patents is not valid or is unenforceable, or may refuse to stop the other party from using the technology at issue because our patents do not cover that technology. An adverse result in any litigation or defense proceedings could put one or more of our patents at risk of being invalidated or interpreted narrowly and could put our patent applications at risk of not issuing. Any difficulties or inability to obtain or maintain a patent in a jurisdiction for which we hold or seek patent protection would materially adversely harm our business.\nInterference proceedings provoked by third parties or brought by us may be necessary to determine the priority of inventions regarding our patents. An unfavorable outcome could require us to cease using the related technology or to license rights to it from the prevailing party. Our business could be harmed if the prevailing party does not offer us a license on commercially reasonable terms or at all. Our defense of litigation or interference proceedings may fail and, even if successful, may cause us to incur substantial costs and distract the attention of our management and other employees. We may not be able to prevent misappropriation of our intellectual property rights, particularly in countries where the laws may not protect those rights as fully as in the United States.\nBecause of the substantial amount of discovery required in intellectual property litigation, there is a risk that some of our confidential information could be compromised by disclosure during this type of litigation. There could also be public announcements of the results of hearings, motions or other interim proceedings or developments. If investors perceive these results to be negative, it could have a material adverse effect on the price of our securities.\nWe may be subject to claims that our employees, consultants or independent contractors have wrongfully used or disclosed confidential information of third parties.\nWe may be subject to claims asserting that we or our employees, consultants or independent contractors have inadvertently or otherwise used or disclosed confidential information of our employees former employers or other third parties. We may also be subject to claims that former employers or other third parties have an ownership interest in our patents. Litigation may be necessary to defend against these claims. There is no guarantee of success in defending these claims, and if we succeed, litigation could cause substantial cost and be a distraction to our management and other employees.\nIf we cannot manage our growth effectively, we may not become profitable.\nBusinesses, including development stage companies such as ours which often grow rapidly, tend to have difficulty managing their growth. If we are able to successfully market our products and services, we will likely need to expand our management team and other key personnel by recruiting and employing experienced executives and key employees and/or consultants capable of providing the necessary support.\nAs described elsewhere in this Report, in addition to our Smart Shin Guard the development of which remains our principal business focus, we are in the process of developing and/or pursuing business plans for GHST Art, IoTT, and InSIDDe World, each of which involves a unique business model and would take substantial time and resources to execute and develop into a revenue generating enterprise. We cannot assure you that our management will be able to manage our growth effectively or successfully. Our failure to meet these challenges could cause us to lose money, and your investment could be lost.\nIt may be difficult to predict our financial performance because our quarterly operating results may fluctuate.\nOur revenue and operating results may vary significantly from quarter-to-quarter due to a variety of factors, many of which are beyond our control. You should not rely on period-to-period comparisons of our results of operations as an indication of our future performance. Our results of operations may fall below the expectations of market analysts and our own forecasts. If this happens, the market price of our common stock may fall significantly. The factors that may affect our quarterly operating results include the following:\n· the rate at which we are able to develop and distribute our product;\n· the usage by subscribers of our interactive technology;\n· seasonal patterns in the athletic and sporting goods industry and other industries we target;\n· worsening economic conditions such as those caused by inflation and interest rate hikes in response which cause customers to reduce spending of goods and services such as those we intend to offer;\n· changes in the regulatory environment, including regulation of advertising, that may negatively impact our marketing practices;\n· the adoption of new accounting pronouncements, or new interpretations of existing accounting pronouncements, that impact the manner in which we account for, measure or disclose our results of operations, financial position or other financial measures; and\n· costs related to the launch or acquisition of new technologies or businesses.\nExpenditures by customers also tend to be cyclical, reflecting overall economic conditions as well as budgeting and buying patterns of athletes, teams, leagues and the general public. Any decline in the economy may alter teams and players current or prospective spending abilities or priorities and limit our sales, or may delay sales with such prospective customers, and could materially and adversely affect our business, results of operations and financial condition. For example, leagues operate on a seasonal basis, and may reduce or suspend their periods of activity due to factors beyond our control, as has taken place in the past during calendar years 2020 and 2021 due to COVID-19 when many public venues including sporting events ceased or limited public attendance in an effort to reduce the spread of the pandemic.\nIf we fail to retain our key personnel and grow our human resources, we may not be able to achieve our anticipated level of growth and our business could suffer.\nOur future depends, in part, on our ability to attract and retain key personnel and the continued contributions of our executive officers, each of whom may be difficult to replace. In particular, Mr. Esterino Castellazzi, our President and Chairman of our Board of Directors, plays an important role in moving our business ahead and obtaining financing. In recent periods, our personnel have served us for no compensation, and none of our key personnel have any agreements to continue serving us. The loss of the services of Mr. Castellazzi or other key personnel and the process to replace any key personnel would involve significant time and expense and may significantly delay or prevent the achievement of our business objectives.\nWe expect to rely on outside consultants and employees who may be difficult to control and may expose to liability and/or limit our ability to grow our operations as desired or at all.\nDue to our limited capital, we will rely on the outside consultants and employees to develop and market our product and/or expand our business models. In the event that one or more of these consultants or employees terminates their services to with the Company, fails to follow managements instructions or becomes unavailable, we may see adverse effects to our business and face difficulty locating and retaining suitable replacements. Further, because we will operate in multiple countries, language barriers and complications with respect to monitoring our personnel is more likely than a more localized approach. There can no assurance that our employees or consultants will stay with us or can be adequately controlled, or that we will be able to retain replacements on favorable terms or at all, in which case our business could be harmed.\nWe will rely on third parties to sell our products, and if any of these third parties alter, restrict access to or discontinue their relationships with us, or experience technical difficulties, our ability to market our product(s) would be diminished and our business, revenue and financial results could be harmed.\nWe will rely on a combination of direct sales, licensing agreements, and the use of our website to sell our Smart Shin Guard and any other products or services we have or may develop or acquire. If our website or one or more of these third parties experiences a security breach or outage, or any third party through which we sell or to whom we license our product terminates or adversely modifies the terms of their engagement with us, our ability to develop and grow a customer base decline and our ability to reach potential customers would be negatively affected, causing our revenues and financial results to be harmed.\nEconomic downturns and market conditions beyond our control could adversely affect our business, financial condition and results of operations.\nOur business depends on the overall demand for our Smart Shin Guard, which can be characterized as a non-essential product, and on the economic health of the markets we aim to access and that we believe would benefit from our technology. Economic downturns or unstable market conditions may cause prospective customers to decrease or pause their budgets, or decline to incur expenditures on non-essential items, which could reduce spending on our product and adversely affect our business, financial condition and results of operations. In recent times, certain events have begun to affect the global and United States economy including continued inflation, interest rate increases by the Federal Reserve and central banks of other countries in response, substantial increases in the prices of certain products and services, and declines in the capital markets. In addition, the duration of Ukrainian war and its impact are at best uncertain, and continuation may result in Internet access issues if Russia, for example, began illicit cyber activities. Because our management team is based in Italy, our operations may face enhanced exposure to risks arising from the Ukraine war than our competitors in North America. The U.S. and global economies appear to be potentially be approaching a recession with uncertain and potentially severe impacts upon public companies and us. We cannot predict how this will affect our ability to continue and complete the development of and/or market for our product, but the impact may be adverse and the duration of any such consequences are unpredictable. Among other adverse consequences, our prospective vendors or customers, in response to a reduced access to capital or anticipated or actual reduction and consumer spending, could elect not to engage in business with us, which would materially adversely harm our ability to generate revenue and financial condition.\nIf we are unable to meet competitive challenges, we may not successfully market our patented product.\nThere are several companies that have developed products and technology that collect, analyze and transmit physical and performance-based information about players and teams. While we believe our product is unique in that it is both wearable while playing and collects and quickly transmits a greater depth of information and analysis than most comparable devices currently in the market, there can be no assurance that this feature will be adequate to attract new customers or convince players and teams using similar or related technology from switching to the Smart Shin Guard. Further, we will be competing for a limited number of prospective customers in the area of professional and amateur soccer, many of whom may not be willing or able to purchase our products at the prices we desire or at all. Our competitors will include major sports apparel firms with greater name recognition and/or existing relationships with prospective customers, such as Nike, Adidas and Puma. We will also compete with lesser known brands who have had a significant head start offering data collection devices, technology or services to customers, including Soccerment, TibTop and Catapult Sport, each of which offer wearable devices that are similar to ours. While we believe the Smart Shin Guard to have unique attributes that will render it attractive to customers, we cannot guarantee this alone will enable us to effectively compete for the limited number of consumers in the soccer world. Further, while the development process for our Smart Shin Guard continues and until we can adequately establish and scale production and sales capabilities, our competitors will continue to have a time advantage over us to continue to develop, improve upon and market their competing or alternative products and reduce or limit our ability to compete with them.\nSpecifically, most of our competitors have longer operating histories and greater resources than us, and could focus their substantial financial resources to develop or sustain a competing business model and develop products or services that are more attractive to potential customers than what we offer. Our competitors may also offer similar products and services at prices below cost and/or devote significant sales forces to competing with us for customers, endorsements, or key personnel, any of which could improve their competitive positions. Any of these competitive factors could make it more difficult for us to attract and retain customers or personnel or force us to lower our prices in order to compete, which would in turn reduce our market share and revenue. We can provide no assurance our management will be successful in navigating this complex competitive landscape, in which case our financial condition would be adversely affected.\nBecause we will be reliant primarily on a single product to be sold to a limited number of prospective customers, we will face significant risks associated with a lack of diversification.\nWe anticipate that the majority of our operations will be focused on the marketing and sale of our Smart Shin Guard, a product with relatively limited application and a narrow group of potential customers, namely soccer teams and players. Any unexpected developments with respect to these prospective customers or the leagues in which they play would therefore materially harm our ability to establish, maintain or grow a significant market position. Demand for our product may fluctuate in response to new products that emerge or changes to the way the game is played, officiated or regulated, or due to unexpected natural or uncontrollable events. For example, the COVID-19 pandemic previously forced worldwide shutdowns of sports leagues, and some leagues delayed or suspended play for indeterminate periods of time in response. Any of these or related events affecting the sports and entertainment markets could result in a decline in the demand for our product or the price point at which prospective customers will be willing to purchase it, and in such event we will not have material alternative products or services to offset such negative effects to our business. If we fail to generate material sales of our Smart Shin Guard for any of the foregoing reasons, your investment in us would be materially harmed.\nBecause our success will depend to a large extent on our ability to develop and grow a market for our Smart Shin Guard, you may lose your investment.\nIn order to be successful, we will need to establish a market for our product. There can be no assurance that anyone will purchase our product at the prices we need to generate material revenue or at all. Further, even if we do attract some customers, there can be no assurance that enough customers will purchase our products or that they will continue to purchase our products in sufficient volumes to produce the cash flow needed to sustain our operations, in which case your entire investment could be lost.\nWe may encounter difficulty obtaining approval for our product for in-game use by soccer leagues, which could hinder or eliminate any competitive advantage with respect to our Smart Shin Guard.\nA material aspect of the Smart Shin Guards potential attractive features for consumers, particularly professional and amateur soccer players and teams, is its relatively small size and integration into a shin guard, which is already used in games and therefore does not add additional bulk or weight to a players normal in-game apparel. However, many soccer leagues impose restrictions and policies on the apparel and equipment that players may wear during games. As such, we will likely need to obtain approval for the Smart Shin Guards use by the soccer leagues of teams we market the product to in order for those teams to use the product in-game. There can be no assurance we will obtain such approval in any or a sufficient number of leagues. Leagues may be hesitant to allow our product to be used in games for a variety of reasons, including potential safety concerns, concerns that such use would confer on certain teams an unfair advantage at the expense of others, or simply reluctance to change. If we are unable to obtain approval for in-game use in leagues, soccer teams and players in those leagues may be unable to use our product in-game or in real-time, which would reduce the usefulness of our product to them and limit our ability to sell our product or generate material revenue therefrom. If we are unable to convince soccer leagues to allow players and teams in-game use of our product, it could materially harm our business and results of operations.\nThe failure to obtain endorsements from athletes or teams could significantly impair our ability to market our products.\nA key component of our business plan and marketing strategy currently contemplates obtaining endorsements from prominent athletes or teams to market our products. As of the date of this filing, we have not obtained any such endorsements. Our ability to obtain any such endorsements will likely be dependent on future funding. Because of our limited capital, there can be no assurance that we can procure any endorsements, in which case our business could be adversely affected.\nWe may be exposed to liabilities under the Foreign Corrupt Practices Act, and any determination that we violated the Foreign Corrupt Practices Act could have a material adverse effect on our business.\nBecause we intend to operate in foreign markets, we will be subject to the Foreign Corrupt Practice Act (the FCPA), and other laws that prohibit improper payments or offers of payments to foreign governments (as well as similar laws in the United States). We expect to have operations and distribution channels in jurisdictions creating the potential for corrupt practices by our employees, consultants or agents. We may employ sales personnel or independent contractors who may be viewed as our agents or otherwise expose us to liability under the FCPA. For example, in addition to the Smart Shin Guard for which we would pursue sales internationally, the business contemplated by InSSIDe World involves heavily regulated industries, clean energy and intelligence, security and defense, requiring various permits and certifications from government agencies, including potentially for government funded or subsidized projects. While we intend to comply fully with the FCPA and similar anti-bribery laws in conducting our business abroad, we cannot guarantee that we will be able to control the conduct of our employees and contractors to prevent corrupt practices. The potential penalties for violating the FCPA include anti-bribery laws and criminal or civil sanctions, including a fine of up to $2 million per violation. If we were to be found in violation of the FCPA or local anti-bribery laws, the resultant penalties and collateral consequences could negatively affect our business, operating results and financial condition.\nWe plan to conduct a substantial portion of our business in foreign markets, which will expose us to the risks of trade or foreign exchange restrictions, increased tariffs, foreign currency fluctuations, disruptions or conflicts with our third-party importers and similar risks associated with foreign operations.\nOur current business plan includes expansion into multiple foreign markets exposing our Company to risks associated with foreign operations. For example, a foreign government may impose trade or foreign exchange restrictions or increased tariffs, or otherwise limit or restrict our ability to import products into a country, any of which could negatively impact our operations. We are also exposed to risks associated with foreign currency fluctuations by selling our products to consumers in foreign markets. Accordingly, strengthening of the Euro which is our primary currency versus a foreign currency could have a negative impact on us. Additionally, we may be negatively impacted by conflicts with or disruptions caused or faced by third-party importers, as well as conflicts between such importers and local governments or regulating agencies. Our operations in some markets also may be adversely affected by political, economic and social instability in foreign countries, as well as economic tensions between governments, the implementation of new or increased tariffs and other changes in international trade policies. Finally, since we plan to operate in the European Union, the impact of the war between Russia and Ukraine, the more recent hostilities in Israel, and/or economic sanctions between or among countries, as well as general geopolitical issues in Europe, may adversely affect our operations in the European Union.\nAnother risk associated with our international operations is the possibility that a foreign government may impose foreign currency remittance restrictions. Due to the possibility of government restrictions on transfers of cash out of the country and control of exchange rates, we may not be able to immediately repatriate cash at the official exchange rate. If this should occur, or if the official exchange rate devalues, it may have a material adverse effect on our business, assets, financial condition, liquidity, results of operations or cash flows.\nSome of our contracts have been and are expected to be in foreign jurisdictions and currencies, and if we do not comply with transfer pricing, customs duties, value added taxes, and similar regulations, then we may be subjected to additional taxes, duties, interest and penalties in material amounts, which could harm our operating results and financial condition.\nBecause we operate and plan to operate in countries outside of the United States, we will be subject to transfer pricing and other tax regulations designed to ensure that our intercompany transactions are consummated at prices that have not been manipulated to produce a desired tax result, that appropriate levels of income are reported as earned by our United States or local entities, and that we are taxed appropriately on such transactions. In addition, our operations will be subject to regulations designed to ensure that appropriate levels of customs duties are assessed on the importation of our products. Further, we have executed and expect to continue to enter into contracts with third parties in foreign jurisdictions and involving foreign currencies, and we therefore face the risk of foreign currency fluctuations which could cause increased operating expenses and reduced revenues, in addition to other uncertainties and contingencies incident to doing business in another country some of which are described elsewhere in these Risk Factors.\nThe imposition of new taxes, even pass-through taxes such as value added taxes, could have an impact on our perceived product pricing and will likely require that we increase prices in certain jurisdictions, and therefore could have a potential negative impact on our business and results of operations. If they arise, the ultimate resolution of these matters may take several years, and the outcome is uncertain. If the Internal Revenue Service or any foreign taxing authorities were to successfully challenge our transfer pricing practices or our positions regarding the payment of income taxes, customs duties, value added taxes, withholding taxes, sales and use taxes, and other taxes, we could become subject to higher taxes, we may determine it is necessary to raise prices in certain jurisdictions accordingly, and our revenue and earnings and our results of operations could be adversely affected.\nIf we fail to comply with U.S. and foreign laws related to privacy, data security, and data protection, it could adversely affect our operating results and financial condition.\nWe are or may become subject to a variety of laws and regulations including the European Unions General Data Protection Regulation (the GDPR) regarding privacy, data protection, and data security. These laws and regulations are continuously evolving and developing. The scope and interpretation of the laws that are or may be applicable to us are often uncertain and may be conflicting, particularly with respect to foreign laws.\nIn particular, there are numerous U.S. federal, state, and local laws and regulations and foreign laws and regulations regarding privacy and the collection, sharing, use, processing, disclosure, and protection of personal data. Such laws and regulations often vary in scope, may be subject to differing interpretations, and may be inconsistent among different jurisdictions. For example, the GDPR includes operational requirements for companies that receive or process personal data of residents of the European Union that are broader and more stringent than those previously in place in the European Union and in most other jurisdictions around the world. The GDPR includes significant penalties for non-compliance, including fines of up to €20 million or 4% of total worldwide revenue. Additionally, in June 2018, California enacted the California Consumer Privacy Act (the CCPA). The CCPA requires covered companies to provide California consumers with new disclosures and will expand the rights afforded consumers regarding their data. Fines for noncompliance may be up to $7,500 per violation. Since the CCPA was enacted, many other states have enacted similar legislation designed to protect the personal information of consumers and penalize companies that fail to comply, and other states have proposed similar legislation. The costs of compliance with, and other burdens imposed by, the GDPR, CCPA, and similar laws may limit the use and adoption of our products and services and/or require us to incur substantial compliance costs, which could have an adverse impact on our business.\nWe intend to strive to comply with all applicable laws, policies, legal obligations, and industry codes of conduct relating to privacy, data security, and data protection. Our limited resources may adversely affect our compliance effort. Given that the scope, interpretation, and application of these laws and regulations are often uncertain and may be in conflict across jurisdictions, it is possible that these obligations may be interpreted and applied in a manner that is inconsistent from one jurisdiction to another and may conflict with other rules or our practices. Any failure or perceived failure by us or third party service providers to comply with our privacy or security policies or privacy-related legal obligations, or any compromise of security that results in the unauthorized release or transfer of personal data, may result in governmental enforcement actions, litigation, or negative publicity, and could have an adverse effect on our operating results and financial condition.\nGovernments are continuing to focus on privacy and data security, and it is possible that new privacy or data security laws will be passed or existing laws will be amended in a way that is material to our business. Any significant change to applicable laws, regulations, or industry practices regarding the personal data of our employees, agents or customers could require us to modify our practices and may limit our ability to expand or sustain our salesforce or bring our products to market. Changes to applicable laws and regulations in this area could subject us to additional regulation and oversight, any of which could significantly increase our operating costs and materially affect our operating results and financial condition.\nRisks Related to Our Common Stock\nBecause of our lack of liquidity, we have funded our operations and expenditures primarily through the incurrence of debt and the satisfaction of such debt through the issuance of shares of our common stock, the result of which is continued dilution to existing shareholders and downward pressure on our stock price.\nAs disclosed under Item 7 - Managements Discussion and Analysis of Financial Condition and Results of Operations, due to our lack of revenue and continued capital requirements, in recent years we have relied heavily on incurring indebtedness from shareholders and other third parties and repaying that indebtedness in shares of our common stock. We expect this trend to continue unless we are able to fund another source of capital, which may include issuing other forms of securities with terms that could limit our operational flexibility, subordinate the rights of shareholders or have other negative features. Further, we have in the past and may in the future issue shares for consideration that is well below the market price of our common stock as reflected on the OTC Pink. For example, in December 2021 and February 2022, following a 1-for-100 reverse split and an agreement with certain of our lenders, we issued a total of 118,663,761 shares to lenders in satisfaction of $225,259 in indebtedness at a per share price of approximately $0.0019 per share, below the fair market value of the shares based on accounting principles.\nThe result of our continuing to fund our operations through the issuance of shares of common stock has been and will continue to be the dilution of our shareholders ownership interest in the Company. In addition, the introduction of additional shares imposes downward pressure on our stock price, particularly given the limited and sporadic nature of trading in our common stock. Unless we are unable to raise sufficient capital by non-dilutive mean which is unlikely, or generate material revenue from our operations which may not come to fruition in the near term or at all, we expect we will need to continue to issue shares of common stock causing further dilution and potentially cause our stock price to decline further, which would have a material adverse effect on existing shareholders.\nOur registration under the Exchange Act could be revoked by the SEC if we fail to file required reports.\nFollowing the registration of our common stock with the SEC on May 8, 2021 pursuant to the registration statement on Form 10, if we fail to file reports as required under the Exchange Act, we may lose our registration. While we intend to comply with the Exchange Acts reporting requirements moving forward, and we may be unable to comply in the future as we did in the past. For example, in June 2009, the SEC revoked our registration under the Exchange Act for failure to file required reports. Following that action, the Company expended resources to again become a reporting company with the SEC in 2010; however, it was never able to file an annual report on Form 10-K and ultimately withdrew its registration in 2013. Following our registration in 2021, the heightened expenditures of being a public reporting company continue to impose challenges to us and strain our very limited resources.\nMore recently, as disclosed in the explanatory note at the beginning of this Report and the Current Report on Form 8-K referenced therein, our financial statements for FY 2022 were restated (the restated version of which is contained in this Report) due to certain material adjustments in connection with the re-audit of those financial statements by a different accounting firm. As a result of this development, which also impacted certain interim periods in FY 2022 and FY 2023, we expect we will be required to file amendments to certain of our prior periodic reports, specifically quarterly reports on Form 10-Q, to include the restated financial information and related disclosure for those interim periods.\nIf we are unable to comply with the SEC reporting provisions in the future, such failure will affect the liquidity of our common stock and act as a depressant to the price, particularly if in such event we are also unable to maintain our OTC Pink listing using the alternative reporting system, which would result in the loss of a two-way trading market for our common stock. We cannot assure you we will not become delinquent and/or withdraw or have our reporting status revoked again.\nCurrently there is no active public market for our common stock, and we cannot predict the future prices or the amount of liquidity.\nCurrently, there is no active public market for our common stock and one may never develop. Our common stock trades sporadically on the OTC Pink Open Market under the symbol GHST. We do not know if an active market will develop even if are successful in completing the development of our Smart Shin Guard and commercializing that product, or if we are able to further develop and execute other aspects of our business plan.\nThe OTC Pink Open Market generally is not an active market. Further, our common stock has only traded sporadically. In order to move to a higher market, such as the OTCQB, we are required to pay $10,000 per year. Even if our common stock begins trading on the OTCQB, investors should be aware that the OTCQB is not as liquid as major national securities exchanges.\nThese stock market and industry factors may adversely affect the market price of our common stock.\nBecause of our limited working capital, we lack required internal controls and unless we remediate them, we may be hampered in a number of ways, which could materially and adversely affect us.\nOur management and directors are based in Italy and other European countries. Although our accounting and legal professionals, as well as our auditors, are based in the United States, our lack of familiarity with United States federal and Delaware law has adversely affected us and may continue to adversely affect us as follows:\n· Due to our limited size, we do not segregate our accounting functions which creates a material weakness;\n· The lack of controls may ultimately cause errors in our financial statements;\n· As we expand our business, we may fail to comply with local laws that could result in fines and the inability to do business; and\n· Once our common stock publicly trades, investors may react to our lack of internal controls by selling our stock and depressing the price.\nAs a public company in the United States, we are required to maintain internal control over financial reporting and disclosure controls and procedures. These controls and other procedures are designed to ensure that information required to be disclosed by us in the reports that we file with the SEC is disclosed accurately and is recorded, processed, summarized and reported within the time periods specified in SEC rules.\nEnsuring that we have adequate controls and procedures in place to help produce accurate financial statements on a timely basis is a costly and time-consuming effort that needs to be evaluated frequently. We will incur increased costs and demands upon management as a result of complying with the laws and regulations affecting public companies relating to internal controls, which could materially adversely affect our results of operations.\nOnce we raise sufficient capital, we plan to take steps to remediate our material weaknesses, including hiring a principal financial officer with knowledge of generally accepted accounting principles as well as reporting and disclosure obligations. As our business expands we intend to retain additional consultants as required. If we fail to maintain proper and effective internal controls in future periods, we could become subject to potential review by the SEC or other regulatory authorities, which could require additional financial and management resources, could compromise our ability to run our business effectively and could cause investors to lose confidence in our financial reporting.\nThe SEC has sued multiple public companies in the past alleging in part that they had violated Section 13(b) of the Exchange Act resulting from their failure to remediate material weaknesses in their internal control over financial reporting over an extensive period of time. Three of these companies had remediated their material weaknesses at the time the lawsuits were filed. If the SEC Staff investigates us and following that investigation a lawsuit is filed alleging that we have and/or have not remediated our material weaknesses, we will face the following risks:\n· It will divert our managements attention from our core business of developing, marketing and selling the Smart Shin Guard;\n· We will incur substantial legal fees in connection with both the investigation and the lawsuit if it is filed;\n· If we are sued, we may be required to pay a civil monetary penalty in addition to other remedies the SEC or a court may impose;\n· Any public disclosure may cause investors to sell our stock which may result in a material decline in our stock price that will cause investors to lose money; and\n· Our existing stockholders will experience more dilution as we are required to raise capital at a lower price per share.\nBecause all of our officers and directors reside outside of the United States, it will be difficult for investors to sue them personally in the United States and may be difficult to enforce any judgment against their assets, which are located outside of the United States.\nOur officers and directors reside in and are based in Italy and other European countries. In the event that investors sue them in the United States alleging that any registration statement, report or proxy filed with the SEC or other disclosure in connection with the purchase or sale of our common stock violates the United States federal and/or state securities laws, they may claim that they are not subject to suit individually in the United States. If a court later determines that these individuals may be sued in the United States and there is an adverse judgment against all or some of these directors, it may be difficult to enforce a United States judgment in the home countries of the defendants.\nDue to recent changes to Rule 15c2-11 under the Exchange Act, our common stock may become subject to limitations or reductions on stock price, liquidity or volume.\nOn September 16, 2020, the SEC adopted amendments to Rule 15c2-11 under the Exchange Act. This Rule applies to broker-dealers who quote securities listed on over-the-counter markets such as our common stock. The Rule as amended prohibits broker-dealers from publishing quotations on OTC markets for an issuers securities unless they are based on current publicly available information about the issuer. The amended Rule became effective on September 28, 2021; the amended Rule also limits the Rules piggyback exception, which allows broker-dealers to publish quotations for a security in reliance on the quotations of a broker-dealer that initially performed the information review required by the Rule, to issuers with current publicly available information or issuers that are up-to-date in their Exchange Act reports.\nThe Rule changes could harm the liquidity and/or market price of our common stock by either preventing our shares from being quoted or driving up our costs of compliance. We became subject to filing reports under the Exchange Act following the effectiveness of our Form 10 in May 2021. If we cannot or do not provide or maintain current public information about our Company our stockholders may face difficulties in selling their shares of our common stock at desired prices, quantities or times, or at all, as a result of the amendments to the Rule.\nWe are subject to the penny stock rules which will adversely affect the liquidity of our common stock.\nThe SEC has adopted regulations which generally define penny stock to be an equity security that has a market price of less than $5.00 per share, subject to specific exemptions. The market price of our common stock on the OTC Pink Open Market is presently less than $5.00 per share and therefore we are considered a penny stock company according to SEC rules. Further, we do not expect our stock price to rise above $5.00 in the foreseeable future. The penny stock designation requires any broker-dealer selling our securities to disclose certain information concerning the transaction, obtain a written agreement from the purchaser and determine that the purchaser is reasonably suitable to purchase the securities. These rules limit the ability of broker-dealers to solicit purchases of our common stock and therefore reduce the liquidity of the public market for our shares.\nBroker-dealers are increasingly reluctant to permit investors to buy or sell speculative unlisted stock and often impose costs which make it uneconomical for small shareholders to do so. Moreover, as a result of apparent regulatory pressure from the SEC and the Financial Industry Regulatory Authority (FINRA), a growing number of broker-dealers decline to permit investors to purchase and sell or otherwise make it difficult to sell shares of penny stocks. The penny stock designation may have a depressive effect upon our common stock price.\nOur stock price may be volatile because of factors beyond our control.\nAny of the following factors could affect the market price of our common stock:\n· our failure to generate revenue;\n· our failure to achieve and maintain profitability;\n· actual or anticipated variations in our quarterly results of operations;\n· announcement by us of the commencement of or the progress of any litigation;\n· our failure to meet anticipated results with respect to the development and distribution of the Smart Shin Guard to consumers and others;\n· the failure of the Smart Shin Guard or other products or services we may offer in the future to operate as expected;\n· complaints received from consumers and other users; and\n· our failure to remain current with our Exchange Act filing requirements.\nIn the past, following periods of volatility in the market price of a companys securities, securities class action litigation has often been instituted. A securities class action suit against us could result in substantial costs and divert our managements time and attention, which would otherwise be used to benefit our business.\nBecause of FINRA sales practice requirements which affect broker-dealers, the market price for our common stock will be adversely affected.\nFINRA has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy shares of our common stock, which may limit your ability to buy and sell our common stock and have an adverse effect on the market for our shares.\nWe have in the past and may in the future face difficulty in effecting certain corporate actions we deem necessary or appropriate to raise capital due to FINRA or SEC rules and processes.\nIn 2019, FINRA declined to process a 1-for-100 reverse stock split of our outstanding common stock because we did not maintain current public information. This action was taken by FINRA based on perceived deficiencies under FINRA Rule 6490, which is based on SEC Rule 10b-17 and is designed to prevent fraudulent and deceptive practices in connection with certain corporate actions including a reverse stock split. A primary reason for our filing the Form 10 is to comply with these rules and effect the reverse stock split, as well as having the ability to take such other action in the future as may be needed and to have access to the U.S. capital markets. While the reverse stock split took effect in September 2021, there can be no assurance that our status as an Exchange Act reporting company will be sufficient for FINRA to process a reverse stock split or allow us to take other action in the future, including such actions as may be necessary to conduct a financing on favorable terms or at all. If this were to occur with respect to actions currently contemplated or that we may in the future determine to undertake, it could have a material adverse effect on our Company.\nIn the future, we may issue preferred stock which could make it more difficult for a third party to acquire us and could depress our stock price.\nOur Board of Directors may issue one or more series of preferred stock that have more than one vote per share. This could permit our Board of Directors to issue preferred stock to investors who support our management and us and permit our management to retain control of our business. Additionally, issuance of preferred stock could block an acquisition resulting in both a drop in our stock price and a decline in interest of our common stock.\nSince we intend to retain any earnings for development of our business for the foreseeable future, you will likely not receive any dividends for the foreseeable future.\nWe have not and do not intend to pay any dividends in the foreseeable future, as we intend to retain any earnings for development and expansion of our business operations. As a result, you will not receive any dividends on your investment for an indefinite period of time. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone. ITEM 2. PROPERTIES\nGHST maintains its headquarters in New York, NY. The headquarters are in an executive suite environment where services are provided on an as-needed basis. Our officers spend limited time in the United States. ITEM 3. LEGAL PROCEEDINGS.\nNone. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nOur common stock is not listed on any securities exchange, and is quoted on the OTC Pink Market under the symbol GHST. Because our common stock is not listed on a securities exchange and its quotations on OTC Pink are limited and sporadic, there is currently no established public trading market for our common stock.\nThe following table reflects the high and low closing sales information for our common stock for each fiscal quarter during the fiscal years ended June 30, 2023 and 2022. This information was obtained from OTC Pink and reflects inter-dealer prices without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nCOMMON STOCK\nMARKET PRICE\nHIGH LOW\nFiscal Year Ended June 30, 2023:\nFirst Quarter $ 0.10 $ 0.034\nSecond Quarter $ 0.09 $ 0.022\nThird Quarter $ 0.065 $ 0.026\nFourth Quarter $ 0.09 $ 0.023\nCOMMON STOCK\nMARKET PRICE\nHIGH LOW\nFiscal Year Ended June 30, 2022:\nFirst Quarter $ 0.14 $ 0.26\nSecond Quarter $ 0.735 $ 0.1001\nThird Quarter $ 0.29 $ 0.101\nFourth Quarter $ 0.29 $ 0.074\nHolders\nAs of October 6, 2023, there were approximately 617 shareholders of record of the Company's common stock. We believe that additional beneficial owners of our common stock hold shares in street name.\nShares Eligible for Future Sale\nAll of the outstanding shares of common stock of the Company are restricted securities and cannot be sold under Rule 144 until at least six months have passed since payment, and the other requirements of Rule 144(i)(1)(ii) have been satisfied, including the Company being current in its SEC periodic reporting obligations.\nIn general, Rule 144 provides that any non-affiliate of the Company, who has held restricted common stock for at least six-months, is entitled to sell their restricted stock freely, provided that the Company stays current in its SEC filings.\nAn officer, director or other person in control of the Company may sell after six months with the following restrictions: (i) the Company is current in its SEC filings, (ii) certain manner of sale provisions, (iii) the filing of a Form 144, and (iv) volume limitations limiting the sale of shares within any three-month period to a number of shares that does not exceed 1% of the total number of outstanding shares. A person who has ceased to be an affiliate at least three months immediately preceding the applicable sale and who has owned such shares of common stock for at least one year may sell the shares under Rule 144 without regard to any of the limitations described above.\nSuch shares may be sold outside of the United States. Further, such shares may be sold to purchasers in the United States under Section 4(a)(1) of the Securities Act if paid for more than two years ago and if the seller is not an affiliate of the Company. However, some broker-dealers and transfer agents will not accept legal opinion relying on Section 4(a)(1).\nEquity Compensation Plan Information\nThe Company does not have any securities authorized for issuance or outstanding under an equity compensation plan or equity compensation grants made outside of such a plan.\nDividend Policy\nWe have not paid cash dividends on our common stock and do not plan to pay such dividends in the foreseeable future. Our Board of Directors will determine our future dividend policy on the basis of many factors, including results of operations, capital requirements, and general business conditions.\nUnregistered Sales of Equity Securities\nDuring the fiscal year ended June 30, 2023, we have sold securities which are not registered under the Securities Act. These unregistered sales are set forth in the following table:\nName or Class\nDate Sold\nNo. of Securities\nConsideration\nCommon Stock\nFebruary 3, 2023\n33,333\nIssuances of shares in exchange for $2,000 in subscription payments\nCommon Stock\nJune 27, 2023\n469,600\nIssuances of shares in exchange for $21,132 in subscription payments\nAs more particularly described in Item 1 - Business at page 3, on September 23, 2023, the Company entered an agreement with a service provider pursuant to which the Company agreed, among other things, to issue shares of the Companys common stock valued at 180,000 Swiss Francs (approximately $198,169 U.S. Dollars) based on a price per share of $0.0455 U.S. dollars. Pursuant to this agreement, on October 2, 2023 we issued the service provider 4,476,176 shares of our common stock.\nEach of the foregoing transactions was exempt from registration under the Securities Act under Regulation S of the Securities Act as the securities were issued in offshore transactions to persons who are not U.S. Persons as defined by Regulation S under the Securities Act and there were no directed selling efforts made in the United States, and/or under Section 4(a)(2) of the Securities Act and Regulation D promulgated thereunder. ITEM 6. [Reserved] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nCertain statements in Managements Discussion and Analysis and Plan of Financial Condition and Results of Operations are forward-looking statements that involve risks and uncertainties. Words such as may, will, should, would, anticipates, expects, intends, plans, believes, seeks, estimates and similar expressions identify such forward-looking statements. Readers are cautioned not to place undue reliance on these forward-looking statements, which reflect managements analysis only as of the date hereof. You should read the following discussion in conjunction with our financial statements, which are included elsewhere in this Report. We assume no obligation to update these forward-looking statements to reflect actual results or changes in factors or assumptions affecting forward-looking statements. Our actual results could differ materially from those discussed in the forward-looking statements. See Cautionary Note Regarding Forward Looking Statements and Summary of Risk Factors contained in the forepart of this Report for more information.\nOverview\nOur principal business focus is seeking to exploit a patent and obtain and exploit future patents for the Smart Shin Guard. We also have early development stage businesses for IoTT, an internet technology business, and InSSIDe World, a clean energy and intelligence, security and defense, as well as GHST Art which to date has been limited to holding 119 pieces of artwork. We have generated nominal revenue and need substantial additional financing to market our services.\nPlan of Operation\nOn June 30, 2020 we obtained the intellectual property rights to the Smart Shin Guard and began efforts to implement our new business model of developing and marketing advanced wearable sports tracking and analysis devices, with an initial focus on soccer. In June 2020 we were issued the U.S. patent for our product, in 2022 we obtained a European patent for Italy, France, Spain, Germany and the United Kingdom and in March 2023 we obtained a Hong Kong patent. While we believe we have sufficient capital to fund our initial operations, we anticipate we will need additional funding to expand our operations and market and sell our product, including for the following expenses:\n· Develop, test, and improve upon our Smart Shin Guard;\n· Compensating out management and key personnel;\n· Obtain the raw materials needed for our manufacturing of our products, including pursuant to contracts with third party suppliers we may enter into to procure the same;\n· Arrange for the production of Smart Shin Guards and factory and warehouse space for the such production (which we may be required to outsource to a third party or parties);\n· Develop relationships with soccer leagues, teams and players in order to both locate potential customers and establish business relationships to assist with advertising to the general public;\n· Develop, maintain and protect our intellectual property rights including patent(s) in applicable jurisdictions;\n· Communicate with and advocate for our product to FIFA and other soccer leagues and regulators to allow for widespread in-game use of our product in professional settings.\nWe are currently in the process of developing our product, including by developing software for the artificial intelligence component of the products data collection and transmission capabilities. While we expect development to be completed by the end of 2023, this projection is subject to change as our development efforts and previous projections have been delayed over the past three years due to our very limited capital and human resources. Additionally, the smart phone application and the professional kit version of our product are expected to take a longer time to develop than the consumer kit due to the increased complexity of its functionality. These elements of our product continue to be the focal point of our development efforts as of the date of this Report.\nFollowing our product development efforts (and assuming successful completion of the same), we intend to then turn our attention during the next 12 months towards manufacturing the product and establishing a market for selling our product. Because our product focuses on soccer, or football, we plan to focus these efforts on countries located in Europe, where the sport is most popular and well-funded, and teams and players may be more likely to subscribe to our offerings. We expect that our ability to have success during this stage will depend on a number of factors which may be beyond our control, including our ability to have patents issued in target jurisdictions, our ability to complete product development and manufacturing efforts on schedule, and our ability to obtain strategic partnerships from professional teams or athletes to assist us in our marketing efforts.\nMarketing Plan\nOur goal is to develop and expand a market for our Smart Shin Guard both to professional and casual soccer players and teams. With the right people on our side, we intend and hope for the market for our product to grow to a global scale. However, we will need to raise additional capital to fund these business plans, which we may face difficulty doing on acceptable terms or at all. See below under Liquidity and Capital Resources for more information.\nHeadquarters\nWe are currently headquartered in New York, NY; however our directors and officers are located in Italy and other European countries. We believe our presence in these locations will be useful in initiating our marketing strategy, in which we plan to focus our efforts on European countries and access the U.S. capital markets to fund our operations.\nNeed for League Approval\nAs discussed in Risk Factors, the Smart Shin Guards value, particularly with respect to professional teams and players, will in large part be determined by our ability to obtain approval for in-game use of the product from FIFA, UEFA Champions League, Serie A (Italy), Ligue 1 (France), and the English Premier League, as well as other prominent international and national soccer leagues that attract a significant number of viewers. Management believes that due to our products small size and design to be used as a wearable shin guard, which equipment is already used in games, we should be able to obtain such approval, but any difficulties or delays in obtaining this consent from target leagues could result in limitations to the prospective market for our product and/or require us to allocate capital and time towards obtaining such approval.\nCritical Accounting Estimates\nThe methods, estimates, and judgments that we use in applying our accounting policies have a significant impact on the results that we report in our financial statements. Some of our accounting policies require us to make difficult and subjective judgments, often as a result of the need to make estimates regarding matters that are inherently uncertain. These estimates, which are discussed below, involve certain assumptions that if incorrect could create a material adverse impact on GHSTs results of operations and financial condition.\nSuch estimates and assumptions impact, among others, the following: the valuation of due from a related party, the valuation of other assets and patents, the fair value of share-based payments and deferred taxes. See Note 2 to the financial statements contained in this Report.\nResults of Operations\nThe following discussion should be read in conjunction with the financial statements and notes thereto included elsewhere in this report.\nFiscal Year Ended June 30, 2023 Compared to the Fiscal Year Ended June 30, 2022.\nWe had nominal revenue in the fiscal year ended June 30, 2023 and none in the fiscal year ended June 30, 2022, and we sustained net losses of $116,574 and $3,987,027, respectively, in those periods. Our expenses consisted of general and administrative costs. We do not expect to generate material revenue unless and until we can implement our business plan and begin marketing and selling our product(s) in sufficient quantities, which has been delayed due to a combination of our limited capital resources and external forces resulting in delays in the development of our product, which has and until completed will continue to adversely affect our marketing capabilities. In order to become profitable, we will need to complete the development of a functional product and thereafter establish a sufficient market for our product, including internationally, to offset our development, manufacturing and advertising costs, and our ability to do so will be subject to a number of factors, many of which will be beyond our control.\nThe FY 2022 net loss resulted from certain adjustments resulting in charges for the period, including a non-cash expense arising from the issuance of approximately 118,663,761 shares of common stock during FY 2022 in satisfaction of indebtedness at an average price per share of approximately $0.0019, below the fair market value of the shares, and a $151,181 impairment of long-lived assets in the 2022 period related to the write-off of patent costs, among other charges.\nLiquidity and Capital Resources\nNet Cash used by Operating Activities:\nFor the fiscal year ended June 30, 2023, the Company used net cash of $93,308 in operating activities as compared to $163,028 for the fiscal year ended June 30, 2022. The decrease in cash used in operations was primarily due to deferred revenue of $23,841 in the 2023 period, and a $3,666,441 loss on debts conversion, and a $151,181 impairment of long-lived assets.\nCash Flows from Investing Activities:\nFor the years ended June 30, 2023 and 2022, the Company had no cash flows from investing activities.\nCash Flows from Financing Activities:\nCash flows from financing activities for the fiscal year ended June 30, 2023 were $132,596 compared to $155,884 for the fiscal year ended June 30, 2022. The decrease primarily related to a reduction in advances from related parties year-over-year.\nWe have approximately $12,000 in available cash as of October, 12, 2023, and for the past two years we have been relying on loans and stock purchases from our current investors and related parties to fund our operations. As reflected in the Financial Statements contained elsewhere in this Report, management has expressed substantial doubt about our ability to continue as a going concern during the fiscal year ended June 30, 2023 unless we can raise the required capital or generate material revenue to fund our operations.\nWe do not have sufficient capital to support our operations for the next 12 months and will dependent upon on the proceeds from a financing, which may consist of sales of our common stock, the issuance of debt securities and/or issuance of securities convertible into shares of our common stock, any of which could have a dilutive effect on our existing shareholders. We intend to continue to raise capital from existing investors and/or to obtain funding from the sale of a minority interest in our subsidiaries if and to the extent possible. We estimate that we will need to raise at least $300,000 in order to meet our working capital needs for the next 12 months. As described elsewhere in this Report, we plan to phase in our expenses and grow our business as working capital is available.\nThere can be no assurances that we will be able to raise additional capital. The inability to raise capital would adversely affect our ability to achieve our business objectives. In addition, if our operating performance during the next 12 months is below our expectations, our liquidity and ability to operate our business could be adversely affected. We continue to monitor macro-economic factors such as inflationary pressures, continued Federal Reserve interest rate hikes and recessionary fears, as well as trends within our industry, all of which may affect our working capital requirements and ability to raise funding for our operations within the timeframes desired, on favorable terms or at all. See Risk Factors.\nSignificant Accounting Policies and Recent Accounting Pronouncements\nPlease see the notes to our Financial Statements for information about our Significant Accounting Policies and Recent Accounting Pronouncements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nThe consolidated financial statements and the other information required by this Item can be found beginning on page. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNot applicable. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nWe carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officers, of the effectiveness of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act as of the end of the period covered by this report. Based on that evaluation, our Chief Executive Officer and Chief Financial Officers have concluded that our disclosure controls and procedures as of June 30, 2023 were not effective to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms because of a material weakness in the Companys internal control over financial reporting. Specifically, the Company did not maintain effective controls and procedures to support the identification of, accounting for, and the evaluation and disclosure of the valuation for impairment of intangible and other assets, the valuation for stock-based non-cash issuances, and revenue recognition including with respect to material contingencies related to the revenue and the deferred liabilities. These weaknesses contributed to certain material adjustments to and the restatement of the Companys financial statements for FY 2022 and certain periods in FY 2023.\nIn addition, the Company did not maintain effective controls to identify, and maintain segregation of duties to authorize and approve, support the identification of, accounting for, and the disclosure of related-party transactions and non-routine transactions, as one individual, the Chief Executive Officer, initiates related-party transactions and non-routine transactions and also reviews, evaluates and approves these same transactions.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting as defined in Rule 13a-15(f) or 15d-15(f) under the Exchange Act that occurred during the period covered by this report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION.\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following is a list of our directors and executive officers. All directors serve one-year terms or until each of their successors are duly qualified and elected. The officers are elected by the Board of Directors.\nName\nAge\nPosition(s)\nEdoardo Berti Riboli\nChief Executive Officer\nPaolo Sangiovanni\nChief Financial Officer\nMarcello Appella\nChief Financial Officer\nMassimiliano Stella\nChief Information Officer\nEsterino Castellazzi\nPresident and Chairman of the Board of Directors\nGiovanni Lavati\nSecretary, Treasurer and Director\nPierangelo Negri\nDirector\nEdoardo Berti Riboli has been the Companys Chief Executive Officer since 2017. Mr. Riboli is a lawyer practicing in Rimond Group since 2017 located in Milan and Rome, Italy. From 2010 to 2016, Mr. Riboli practiced in Studio Legale Pettinello law firm.\nPaolo Sangiovanni has been the Companys Chief Financial Officer since 2017. Mr. Sangiovanni is the Chief Executive Officer and Chairman of the Board of Alchemy Business Management Ltd. Since September 2009, he has been the Managing Director of Management Asset Planning Ltd. Since 2014, he has been the Chairman of the Board of Mapbiz Holdings SA. From September 2013 to January 2017, he was the Managing Director of Ozone Int. Ltd. Since September 2012 he has been the Managing Director of Mapleton Films Ltd. On May 2016, he was the Chairman of the Board of Acorn Global Partners Ltd.\nMarcello Appella has been the Companys Chief Financial Officer since March 19, 2019. Since 1996, Mr. Appella is the Chief Executive Officer and owner of ADI Sarl.\nMassimiliano Stella has been the Companys Chief Information Officer since February 2021. Since July 2020, he has provided services to businesses as a management and software consultant. From July 2016 to May 2020, he served as President of E-Win S.r.l., a software company focused on enterprise resource planning (ERP) applications. From January 2005 until May 2020, he served as Chief Executive Officer at GoodWorks S.r.l., a software development and distribution company.\nEsterino Castellazzi is President and Chairman of the Board of Directors of the Company. Formerly, Mr. Castellazzi served as the Companys Vice President from July 28, 2008 to 2017. Mr. Castellazzi is the President and Chairman of the Board of Directors since 2017. Since 2016, Mr. Castellazzi has been the liquidator for Contractor Spa. From 2006 to 2016, Mr. Castellazzi served as the Chief Executive Officer of the advertising company Ghost Technology Spa of the European Union. From 2004 to 2016, he was the Chief Executive Officer of Gaved Srl. a publishing company. Mr. Castellazzi was also an officer and part owner of the DVD recording company In Service Media Video, Srl from 2002 to 2016, and was the Chief Executive Officer of the multimedia company M.C. Video Srl from 1997 to 2015. Mr. Castellazzi was appointed a director because of his knowledge of the Company and its business.\nGiovanni Lavati has been a director of the Company since May 13, 2016. Since 2016, Mr. Lavati is the Project Manager for Expertise SRL. Mr. Lavati was appointed a director because of his experience and skill in managing businesses.\nPierangelo Negri has been a director of GHST since 2017. Since 2000, Mr. Negri has been the Chief Executive Officer and owner of FAPI Service Ltd. Mr. Negri was appointed a director because of his experience and expertise in capital markets.\nFamily Relationships\nThere are no family relationships among our directors or officers. However, Roberto Castellazzi, the Companys Operations Manager and Chief Executive Officer and Chairman of the Board of Directors of GHST Sport Inc., is the son of Esterino Castellazzi, the Companys President and Chairman of the Board of Directors.\nDirector Independence\nOur Board has determined that each of our directors with the exception of Mr. Castellazzi are independent under the Nasdaq Stock Market listing rules.\nCommittees of the Board of Directors\nWe presently do not have an audit committee, compensation committee, or other committee or committees performing similar functions, as our board of directors and management believe that until recently it has been premature at the early stage of our Companys business development to form an audit, compensation or other committees. Each member of our Board considers candidates for directorship and executive officer and director compensation. Presently, our full Board of Directors fill the role of the audit committee.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires our directors, executive officers, and persons who own more than 10% of our common stock to file initial reports of ownership and changes in ownership of our common stock and other equity securities with the SEC. These individuals are required by the regulations of the SEC to furnish us with copies of all Section 16(a) forms they file. Based solely on a review of the copies of the forms furnished to us, and written representations from reporting persons, we believe that all filing requirements applicable to our officers, directors and 10% beneficial owners were complied with for the fiscal year ended June 30, 2023.\nCode of Ethics\nOur Board has adopted a Code of Ethics that applies to all of our employees, including our Chief Executive Officer and Chief Financial Officers. Although not required, the Code of Ethics also applies to our directors. The Code of Ethics provides written standards that we believe are reasonably designed to deter wrongdoing and promote honest and ethical conduct, including the ethical handling of actual or apparent conflicts of interest between personal and professional relationships, full, fair, accurate, timely and understandable disclosure and compliance with laws, rules and regulations, including insider trading, corporate opportunities and whistleblowing or the prompt reporting of illegal or unethical behavior. A copy of our Code of Ethics is filed as Exhibit 14.1, and copy of our Insider Trading Policy is filed as Exhibit 19.1, to this Report. .\nShareholder Communications\nAlthough we do not have a formal policy regarding communications with the Board, shareholders may communicate with the Board by writing to us at GHST World, Inc., 667 Madison Avenue, 5th Floor, New York, NY 10065. Shareholders who would like their submission directed to a member of the Board may so specify, and the communication will be forwarded, as appropriate. ITEM 11. EXECUTIVE COMPENSATION.\nSummary Compensation Table\nThe officers of the Company have not received any compensation paid, distributed nor accrued from the Company for the last two fiscal years.\nDirector Compensation\nThe directors of the Company have not received any compensation paid, distributed nor accrued from the Company for the last two fiscal years. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth the number of shares of GHSTs voting stock beneficially owned as of October 5, 2023 by (i) those persons known by GHST to be owners of more than 5% of GHSTs common stock, (ii) each director of GHST, (iii) all Named Executive Officers (as defined in Item 6), and (iv) all executive officers and directors of GHST as a group:\nTitle of Class\nName and Address of Beneficial Owner\nAmount and\nNature of Beneficial\nOwner(1)\nPercentage of Common Stock+\nPercent of\nVoting Power (1)\nDirectors and Executive Officers:\nCommon Stock and Preferred Stock\nEsterino Castellazzi(2)(3)(4)\n124,939,535\n19.2%\n44.6%\nCommon Stock\nEdoardo Berti Riboli(3)\n*\n*\nCommon Stock\nPaolo Sangiovanni(3)(5)\n100,000\n*\n*\nCommon Stock\nGiovanni Lavati(2)(3)\n17,085,762\n13.1%\n6.1%\nCommon Stock\nMarcello Appella(3)\n*\n*\nCommon Stock\nPierangelo Negri(2)\n1,000\n*\n*\nCommon Stock\nMassimiliano Stella(3)\n*\n*\nCommon Stock\nAll directors and executive officers as a group (6 persons)\n142,126,297\n64.7%\n50.7%\n5% Shareholders:\nCommon Stock\nAlessandro Cristiano(6)\n9,461,388\n7.3%\n3.4%\nPreferred Stock\nBank Investments Inc.(7)\n1,800\n*\n16.1%\n-------\n* Less than 1%\n+ N/A to the Series A (as defined in footnote (1)). As such, shares of Series A and underlying voting power are not included in this percentage.\n(1) Represents voting power. Applicable percentages are based on 130,201,179 shares of common stock and 6,000 shares of Series A Preferred Stock (the Series A) with 150,000,000 votes outstanding, adjusted as required by rules of the SEC beneficial ownership is determined under the rules of the SEC and generally includes voting or investment power with respect to securities. Shares of common stock subject to options, warrants and convertible notes currently exercisable or convertible, or exercisable or convertible within 60 days are deemed outstanding for computing the percentage of the person holding such securities but are not deemed outstanding for computing the percentage of any other person. It does not include options held by our management, which are subject to performance standards. Unless otherwise indicated in the footnotes to this table, GHST believes that each of the shareholders named in the table has sole voting and investment power with respect to the shares indicated as beneficially owned by them.\n(2) A director.\n(3) An executive officer.\n(4)\nIncludes 4,000 shares of Series A. Each share of Series A is entitled to 25,000 votes per share. Does not include 2,000 shares of Series B Preferred Stock which has a liquidation preference of $27.50 per share.\n(5) Represents 100,000 shares of common stock held by Palmetum Business SL, an entity owned and controlled by Mr. Sangiovanni.\n(6) Address is Via Righi 10, Novara (NO) 28010, Italy.\n(7) Consists of 1,800 shares of Series A. Each share of Series A is entitled to 25,000 votes per share. Address is 45 Rockefeller Plaza Suite 2000 NY. Francesco Pegioani is the President of this entity and holds voting and dispositive control of the securities. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nFrom May 7, 2021 to September 20, 2021, the Company borrowed a total of $8,199.26 from Esterino Castellazzi, the Companys President and Chairman of the Board of Directors. Prior to that, beginning in 2016 through June 30, 2020 the Company borrowed a total of $60,013.14 from Mr. Castellazzi. As of February 23, 2022, the Company issued Mr. Castellazzi 32,495,535 shares of common stock in satisfaction of this indebtedness.\nBeginning in 2016 through June 30, 2020 the Company borrowed a total of $32,538 including $9,975 on July 7, 2019 from Giovanni Lavati, the Companys director. As of February 23, 2022, the Company issued Mr. Lavati 17,579,562 shares of common stock in satisfaction of this indebtedness. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nAll of the services provided and fees charged by Salberg & Company, P.A. (the Auditor) our principal accountant, were approved by our Board of Directors. The following table shows the fees paid to the Auditor for the fiscal years ended June 30, 2023 and 2022.\nYear Ended June 30,\nAudit Fees (1) $ 62,000 $ 0\nAudit Related Fees - -\nTax Fees - -\nAll Other Fees - -\nTotal $ 62,000 $ 0\n-------\n(1) Audit fees - these fees relate to the annual audits and quarterly reviews of our consolidated financial statements. The above table does not include fees totaling $35,000 paid to our former auditor for FY 2022, which former auditor was replaced by the Auditor. In addition to the audit for FY 2023, the Auditor re-audited the Companys financial statements for FY 2022. The fees reflected as paid in FY 2023 represent both the FY 2023 audit and FY 2022 re-audit.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nIncorporated by Reference\nFiled or\nFurnished\nExhibit #\nExhibit Description\nForm\nDate\nNumber\nHerewith\n2.1\nCertificate of Merger\n10-K\n2/18/2010\n3.2\n3.1\nAmended and Restated Certificate of Incorporation\n10-12G\n3/9/2021\n3.1\n3.1(a)\nCertificate of Amendment to Certificate of Incorporation (Reverse Stock Split)\n10-Q\n11/15/2021\n3.2\n3.1(b)\nCertificate of Amendment to Certificate of Incorporation (Decrease in Authorized Capital)\n10-Q\n11/15/2021\n3.3\n3.1(c)\nCertificate of Designation\n10-K\n2/18/2010\n3.3\n3.3\nAmended and Restated Bylaws\n10-12G\n3/9/2021\n3.3\n10.1\nSecurities Exchange Agreement dated June 29, 2019+\n10-12G\n3/9/2021\n10.1\n10.2\nDevelopment Agreement between the Company and Hemar AG dated January 4, 2021**\n10-12G/A\n4/21/2021\n10.2\n10.3\nDevelopment Agreement between the Company and Applica srl dated February 2, 2021**\n10-12G/A\n4/21/2021\n10.3\n14.1\nCode of Ethics\nFiled\n16.1\nLetter from Ciro E. Adams, CPA, LLC, dated October 7, 2022\n8-K\n10/11/2022\n16.1\n19.1\nInsider Trading Policy\nFiled\n21.1\nList of Subsidiaries\n10-12G\n3/9/2021\n21.1\n31.1\nCertification of Principal Executive Officer (302)\nFiled\n31.2(a)\nCertification of Principal Financial Officer (302)\nFiled\n31.2(b)\nCertification of Principal Financial Officer (302)\nFiled\n32.1\nCertification of Principal Executive and Principal Financial Officers (906)\nFurnished*\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\nFiled\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nFiled\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nFiled\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nFiled\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nFiled\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nFiled\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*This exhibit is being furnished rather than filed and shall not be deemed incorporated by reference into any filing, in accordance with Item 601 of Regulation S-K.\n** Portions of this exhibit have been omitted as permitted by the rules of the SEC. The information excluded is both (i) treated by the Company as private or confidential and (ii) not material. The Company undertakes to submit a marked copy of this exhibit for review by the SEC staff, to the extent it has not been previously provided, and provide supplemental materials to the SEC staff promptly upon request.\n+ Certain schedules, appendices and exhibits to this agreement have been omitted in accordance with Item 601(b)(2) of Regulation S-K. A copy of any omitted schedule and/or exhibit will be furnished supplementally to the Securities and Exchange Commission staff upon request.\nCopies of the exhibits referred to above will be furnished at no cost to our shareholders who make a written request to GHST World Inc., 667 Madison Avenue, 5th Floor, New York, NY 10065.\nITEM 16. FORM 10-K SUMMARY.\nNot applicable.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nGHST World Inc.\nDated: October 13, 2023 By: /s/ Edoardo Berti Riboli\nEdoardo Berti Riboli, Chief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDated: October 13, 2023 By: /s/ Edoardo Berti Riboli\nEdoardo Berti Riboli, Chief Executive Officer\n(Principal Executive Officer)\nDated: October 13, 2023 By: /s/ Marcello Appella\nMarcello Appella, Chief Financial Officer\n(Principal Financial Officer)\nDated: October 13, 2023 By: /s/ Paolo Sangiovanni\nPaolo Sangiovanni, Chief Financial Officer\n(Principal Financial Officer)\nDated: October 13, 2023 By: /s/ Giovanni Lavati\nGiovanni Lavati, Chief Accounting Officer\n(Principal Accounting Officer), Director\nDated: October 13, 2023 By: /s/ Esterino Castellazzi\nEsterino Castellazzi, Director\nDated: October 13, 2023 By: /s/ Pierangelo Negri\nPierangelo Negri, Director\nGHST WORLD, INC.\nCONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED\nJUNE 30, 2023 AND 2022 (As Restated)\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID 106) -\nConsolidated Balance Sheets -\nAs of June 30, 2023 and 2022 (As Restated)\nConsolidated Statements of Operations -\nFor the Years Ended June 30, 2023 and 2022 (As Restated)\nConsolidated Statements of Changes in Stockholders Deficit -\nFor the Years Ended June 30, 2023 and 2022 (As Restated)\nConsolidated Statements of Cash Flows -\nFor the Years Ended June 30, 2023 and 2022 (As Restated)\nNotes to Consolidated Financial Statements (As Restated) \t -\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of:\nGHST World, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of GHST World, Inc. and Subsidiaries (the Company) as of June 30, 2023 and 2022, the related consolidated statements of operations, changes in stockholders deficit, and cash flows, for each of the two years in the period ended June 30, 2023, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of June 30, 2023 and 2022, and the consolidated results of its operations and its cash flows for each of the two years in the period ended June 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nRestatement\nAs discussed in Note 9 to the consolidated financial statements, the 2022 consolidated financial statements, as originally audited by a predecessor auditor, have been restated to correct certain errors.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the consolidated financial statements, the Company has a net loss and cash used in operations of $116,574 and $93,308, respectively, in 2023 and a working capital deficit, shareholders deficit and accumulated deficit of $121,513, $121,513 and $13,370,665 respectively, at June 30, 2023. These matters raise substantial doubt about the Companys ability to continue as a going concern. Managements Plan in regard to these matters is also described in Note 2. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over\n2295 NW Corporate Blvd., Suite 240 Boca Raton, FL 33431\nPhone: (561) 995-8270 Toll Free: (866) CPA-8500 Fax: (561) 995-1920\nwww.salbergco.com info@salbergco.com\nMember National Association of Certified Valuation Analysts Registered with the PCAOB\nMember CPAConnect with Affiliated Offices Worldwide Member Center for Public Company Audit Firms\nfinancial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined there were no critical audit matters.\n/s/ Salberg & Company, P.A.\nSALBERG & COMPANY, P.A.\nWe have served as the Companys auditor since 2022.\nBoca Raton, Florida\nOctober 13, 2023\nGHST World Inc.\nConsolidated Balance Sheets\nJune 30, 2023 June 30, 2022\n(As Restated)\nAssets\nCurrent Assets\nCash $ 39,495 $ 206\nTotal Current Assets 39,495\nTotal Assets $ 39,495 $ 206\nLiabilities and Stockholders Deficit\nCurrent Liabilities\nAccounts payable and accrued expenses $ 1,112 $ 1,686\nAdvances from related parties 126,496 89,967\nCommon stock payable 9,559 9,559\nDeferred revenue 23,841 -\nTotal Current Liabilities 161,008 101,212\nCommitments and Contingencies (Note 8) - -\nStockholders Deficit\nPreferred stock, $0.001 par value; 10,000,000 shares authorized;\nSeries A, 6,000 shares issued and outstanding at June 30, 2023 and 2022\nSeries B, 2,200 shares issued and outstanding at June 30, 2023 and 2022\nCommon stock, $0.001 par value, 300,000,000 shares authorized;125,725,003 and 124,430,534 shares issued at June 30, 2023 and 2022 125,725 124,431\nAdditional paid-in-capital 13,123,419 13,028,646\nAccumulated deficit (13,370,665 ) (13,254,091 )\nTotal Stockholders Deficit (121,513 ) (101,006 )\nTotal Liabilities and Stockholders' Deficit $ 39,495 $ 206\nThe accompanying notes are an integral part of these consolidated financial statements.\nGHST World Inc.\nConsolidated Statements of Operations\nFor the Years Ended\nJune 30,\n(As Restated)\nRevenues $ 3,078 $ -\nOperating expenses:\nGeneral and administrative expenses 114,622 165,223\nImpairment of long-lived assets (Notes 3 and 4) - 154,181\nPatent development costs 4,803 -\nTotal operating expenses 119,425 319,404\nOther Income(expense):\nForeign exchange gain (loss) (227 )\nInterest Expense - (150 )\nLoss on change in fair value of debts - (1,700 )\nLoss on debt conversion (Note 5) - (3,666,441 )\nTotal Other Income (expense) (227 ) (3,667,623 )\nNet loss $ (116,574 ) $ (3,987,027 )\nNet loss per common share\n- basic $ (0.00 ) $ (0.07 )\n- diluted $ (0.00 ) $ (0.07 )\nWeighted average number of common shares outstanding\n- basic 125,042,819 54,032,711\n- diluted 125,042,819 54,032,711\nThe accompanying notes are an integral part of these consolidated financial statements.\nGHST World Inc.\nConsolidated Statement of Changes in Stockholders' Deficit\nFor the Years Ended June 30, 2023 and 2022 (as Restated)\nPreferred Stock Preferred Stock\nAdditional\nTotal\nSeries A Series B Common Stock Paid in Accumulated Stockholders'\nShares Amount Shares Amount Shares Amount Capital Deficit Deficit\nBalance June 30, 2021 6,000 $ 6 2,200 $ 2 5,239,832 $ 5,240 $ 9,174,792 $ (9,267,064 ) $ (87,024 )\nIssuance of common stock in exchange for debt - - - - 118,663,761 118,664 3,773,036 - 3,891,700\nIssuance of common stock for cash - - - - 526,941 80,818 - 81,345\nNet loss for the year ended June 30, 2022 - - - - - - - (3,987,027 ) (3,987,027 )\nBalance June 30, 2022 (As Restated) 6,000 $ 6 2,200 $ 2 124,430,534 $ 124,431 $ 13,028,646 $ (13,254,091 ) $ (101,006 )\nIssuance of common stock for cash - - - - 1,294,469 1,294 94,773 - 96,067\nNet loss for the year ended June 30, 2023 - - - - - - - (116,574 ) (116,574 )\nBalance June 30, 2023 6,000 $ 6 2,200 $ 2 125,725,003 $ 125,725 $ 13,123,419 $ (13,370,665 ) $ (121,513 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nGHST World Inc.\nConsolidated Statements of Cash Flows\nFor the Years Ended\nJune 30,\n(As Restated)\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss $ (116,574 ) $ (3,987,027 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nImpairment of long-lived assets - 154,181\nLoss on debt conversion - 3,666,441\nLoss on change in fair value of debt - 1,700\nBad debt - related party\n14,521\nChanges in operating assets and liabilities:\nAccounts payable and accrued expenses (574 ) (12,844 )\nDeferred revenue 23,841 -\nNet Cash Used In Operating Activities (93,308 ) (163,028 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nAdvances from related parties 36,529 59,205\nIncrease in common stock payable - 15,334\nIssuance of common stock for cash 96,067 81,345\nNet Cash Provided By Financing Activities 132,596 155,884\nNet increase (decrease) in cash 39,288 (7,144 )\nCash - beginning of year 7,350\nCash - end of year $ 39,494 $ 206\nSUPPLEMENTARY DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid during the year/period for:\nInterest $ - $ -\nTaxes $ - $ -\nSUPPLEMENTARY DISCLOSURE OF NON-CASH INVESTING AND FINANCING ACTIVITIES:\nIssuance of common stock in exchange for debt $ - $ 225,259\nThe accompanying notes are an integral part of these consolidated financial statements.\nGHST WORLD, INC.\nNotes to Consolidated Financial Statements\nJune 30, 2023 and 2022 (As Restated)\nNOTE 1- ORGANIZATION AND DESCRIPTION OF BUSINESS\nBackground\t\nGHST World Inc. (the Company), is a Delaware corporation that was incorporated on November 12, 1999. The Company is a holding company for various technology and other activities. The Company has acquired and is developing several patents in the technology sector.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nLiquidity and Going Concern\nThe consolidated financial statements have been prepared on a going concern basis which assumes the Company will be able to realize its assets and discharge its liabilities in the normal course of business for the foreseeable future. The Company had net losses of $116,574 and $3,987,027 for the years ended June 30, 2023 and 2022. The Company has accumulated deficits of $13,370,665 and $13,254,091 at June 30, 2023 and 2022, respectively and a stockholders deficit of $121,513 and $101,006 as of June 30, 2023 and 2022. The Company used $93,308 and $163,028 in cash flow from operating activities for the years ended June 30, 2023 and 2022.\nManagement believes these conditions raise substantial doubt about the Companys ability to continue as a going concern for the next twelve months from the date these financial statements were issued. The ability to continue as a going concern is dependent upon profitable future operations, positive cash flows, and additional financing. These consolidated financial statements do not include any adjustments related to the recovery and classification of recorded asset amounts and classifications of liabilities that might be necessary should the Company be unable to continue as a going concern.\nManagement intends to raise money through investors as needed to support its working capital needs. Currently the Company intends to raise capital from its existing shareholders. Management cannot provide any assurances that the Company will be successful in completing these undertakings and accomplishing any of its plans.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the following wholly owned subsidiaries:\n· GHST Art World, Inc\n· GHST Sport Inc.\n· IoTT World Inc.\n· Insside World Inc.\nAll intercompany balances and transactions have been eliminated in consolidation.\nConcentrations\nThe Companys financial instruments that are exposed to concentrations of credit risk primarily consist of its cash. The Company places its cash with financial institutions of high credit worthiness. At times, its cash with a particular financial institution may exceed any applicable government insurance limits. The Companys management plans to assess the financial strength and credit worthiness of any parties to which it is a credit counterparty, and as such, it believes that any associated credit risk exposures are limited.\nThe Company currently receives all its revenues from one customer and all the deferred revenues from another customer. The company is dependent on it chairman of the Board for short term funding, who has provided a significant portion of the funding through June 30, 2023.\nGHST WORLD, INC.\nNotes to Consolidated Financial Statements\nJune 30, 2023 and 2022 (As Restated)\nForeign Currency\nTransaction gains and losses are recognized in earnings. The Company is subject to foreign exchange rate fluctuations in connection with the Companys international transactions as certain vendor payments and repayments of related party advances are done in foreign currency.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period.\nSuch estimates and assumptions impact, among others, the following: the valuation of due from a related party, the valuation of other assets and patents, the fair value of share-based payments and deferred taxes.\nMaking estimates requires management to exercise significant judgment. It is at least reasonably possible that the estimate of the effect of a condition, situation or set of circumstances that existed at the date of the financial statements, which management considered in formulating its estimate could change in the near term due to one or more future confirming events. Accordingly, the actual results could differ significantly from estimates.\nCash\nCash are amounts held at banks. The Company had no cash equivalents at June 30, 2023 or 2022.\nRisks and Uncertainties\nThe Company is undertaking a new business venture that is inherently subject to significant risks and uncertainties, including financial, operational, technological and other risks that could potentially have a risk of business failure.\nRevenue Recognition\nThe Company recognizes revenue in accordance with Accounting Standards Codification (ASC) 606, the core principle of which is that an entity should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled to receive in exchange for those goods or services. The Company recognizes revenue for its services for contracts with customers at a point in time when the services are completed. Payments received from customers in advance of when services are completed are reflected as deferred revenue on the accompanying consolidated balance sheets.\nFair Value\nThe carrying value of cash, other asset, accounts and other payable approximate their fair value based on the liquidity or the short-term maturities of these instruments. The fair value hierarchy promulgated by GAAP consists of three levels:\n· Level one - Quoted market prices in active markets for identical assets or liabilities;\n· Level two - Inputs other than level one inputs that are either directly or indirectly observable; and\n· Level three - Unobservable inputs developed using estimates and assumptions, which are developed by the reporting entity and reflect those assumptions that a market participant would use.\nGHST WORLD, INC.\nNotes to Consolidated Financial Statements\nJune 30, 2023 and 2022 (As Restated)\nDetermining which category an asset or liability falls within the hierarchy requires significant judgment. The Company evaluates its hierarchy disclosures each quarter. The Company has no assets or liabilities that are measured at fair value on a recurring and/or non-recurring during the years ended June 30, 2023 and 2022.\nIntangible Assets\nThe Company capitalizes external costs, such as filing fees, associated attorney fees, and patent acquisition fees, incurred to obtain issued patents and patent license rights. The Company expenses costs associated with maintaining and defending patents subsequent to their issuance in the period incurred. Once a patent is granted, the Company will amortize capitalized patent costs for internally generated patents on a straight-line basis over seven years, which represents the estimated useful lives of the patents. Amortization is recorded on a straight-line basis over the seven-year estimated useful life. The seven-year estimated useful life for internally generated patents is based on managements assessment of such factors as the integrated nature of the portfolios being licensed, the overall makeup of the portfolio over time, and the length of license agreements for such patents. The Company assesses the potential impairment to all capitalized net patent cost when events or changes in circumstances indicate that the carrying amount of its patent portfolio may not be recoverable.\nImpairment of Long-Lived Assets\nThe Company accounts for impairment of long-lived assets in accordance with Accounting Standards Codification (ASC) 360, Property, Plant and Equipment, (ASC 360). Long-lived assets for the Company consist primarily of other assets and patents. In accordance with ASC 360, the Company periodically evaluates long-lived assets whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. When triggering event indicators are present, the Company obtains appraisals on an asset by asset basis and will recognize an impairment loss when the sum of the appraised values is less than the carrying amounts of such assets. The appraised values, based on reasonable and supportable assumptions and projections, require subjective judgments. Depending on the assumptions and estimates used, the appraised values projected in the evaluation of long-lived assets can vary within a range of outcomes. The appraisals consider the likelihood of possible outcomes in determining the best estimate for the value of the assets.\nResearch and Development\nAfter impairment of patents, the Company is expensing all additional patent cost as Patent development costs.\nIncome Taxes\nDeferred tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and the respective tax bases. Deferred tax assets, including tax loss and credit carryforwards, and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Deferred income tax expense represents the change during the period in the deferred tax assets and deferred tax liabilities. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized.\nThe effect of income tax positions is recognized only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized. Changes in recognition or measurement are reflected in the period in which the change in judgment occurs.\nGHST WORLD, INC.\nNotes to Consolidated Financial Statements\nJune 30, 2023 and 2022 (As Restated)\nStock Based Compensation\nThe Company applies the fair value method of ASC 718, Share Based Payment, in accounting for its stock-based compensation. This accounting standard states that compensation cost is measured at the measurement date which is typically the grant date. For stock based conversions or stock based debt settlements, the value is based on the conversion or settlement date.\nNet Loss Per Share\nBasic net loss per share is computed by dividing the net loss by the weighted average number of shares of common stock outstanding during the periods presented. Diluted net loss per common share is computed using the weighted average number of common shares outstanding for the period, and, if dilutive, potential common shares outstanding during the period. Potential common shares consist of incremental common shares issuable upon the exercise of stock options, stock warrants, convertible debt instruments or other common stock equivalents. Potentially dilutive securities are excluded from the computation if their effect is anti-dilutive. The Company had no potentially dilutive securities outstanding for the years ended June 30, 2023 and 2022.\nRecent Accounting Pronouncements\nThere are no recent accounting pronouncements that are expected to have a material effect on the Company's financial statements.\nNOTE 3 - OTHER ASSETS\nOn June 29, 2019, the Company acquired all the stock of GHST Art World, Inc, a Florida corporation, whose primary assets consisted of 119 art paintings and reproductions. The Company issued 434,780 shares of common stock and paid $15,000 in cash to effectuate the acquisition. The Company valued the stock at the fair market value of the stock on the date of issuance or approximately $0.23 per share for a total purchase price of $115,000. The entire purchase price was allocated to the art and no goodwill was recorded.\nOn June 30, 2022, the Companys management determined that the carrying value of the assets were impaired as there had been no third-party sales of such artwork since acquisition and the planned business activity relating to such art work has been delayed. As a result, the Company has recorded an impairment loss of $115,000 for the year ended June 30, 2022. (See Note 9)\nNOTE 4 - PATENTS\nThe Company obtained a US patent dated June 30, 2020, which is a protection device used in sporting activity with monitoring capabilities. The Company has also obtained a European patent in October 2022 and Hong Kong patent in March 2023 for the same device, although the Hong Kong patent was subsequently abandoned. The Company has accumulated costs of $39,181 through June 30, 2022, to acquire and register the patents and had additional costs of $4,803 for the year ended June 30, 2023. The Company executed a joint venture agreement (see Note 10) to monetize the patents, however as the Company has not generated any revenues to date from the use of the patents the Company has recorded an impairment totaling $39,181 as of June 30, 2022. All future costs including the costs incurred during the fiscal year ended June 30, 2023 will be expensed as incurred as patent development expense until any capitalization is deemed appropriate. (See Note 9)\nNOTE 5 - COMMON STOCK PAYABLE\nThe Company had agreements dated January 4, 2021 with certain investors to convert their debt investments into common stock of the Company at a price equal to the average value of the stock over the previous six months. The conversion was contingent on the Company effectuating a 1-for-100 reverse stock split which was effected on September 30, 2021. As of June 30, 2023, and 2022, the Company has a total of $9,559 that has not been converted to common stock, which is included on the consolidated balance sheet as common stock payable.\nGHST WORLD, INC.\nNotes to Consolidated Financial Statements\nJune 30, 2023 and 2022 (As Restated)\nDuring the year ended June 30, 2022 certain investors accepted a total of 118,663,761 shares at an average price of approximately $0.0019 in exchange for $225,259 of debt which was previously classified as common stock payable. The Company determined that the fair market value of the stock on the January 4, 2021 grant date, which was also the measurement date, was $3,891,700 based on a dribble out valuation method with a marketable discount rate of 25%. As a result, the Company recorded a loss on the conversion of $3,666,441 in the fiscal year 2022.\nNOTE 6 - RELATED PARTY TRANSACTIONS\nAt June 30, 2023 and 2022, the Company owed related parties a total of $126,496 and $89,967, respectively. These loans are unsecured, non-interest bearing and are due on demand.\nAs of June 30, 2022, the Company determined that an advance to a related party totaling $14,521 was uncollectable and recorded it as a bad debt.\nAs shown in Note 5, the Company has committed to converting certain debts to equity. Included in the debts is $9,559 as of June 30, 2023, of amounts due to related parties that will be converted as described in Note 5.\nNOTE 7 - STOCKHOLDERS DEFICIT\nOn August 7, 2021, the board approved amending its articles of incorporation to reduce the number of authorized shares from 700,000,000 to 310,000,000 of which 300,000,000 are reserved for common stock and 10,000,000 for preferred stock. The amendment was effective on September 9, 2021. Effective on September 30, 2021, the Company effectuated a 100-1 reverse stock split. All share and per share amounts in the accompanying consolidated financial statements and footnotes have been retroactively adjusted to reflect the split.\nPreferred Stock Series A and B\nThere are currently 6,000 shares of Series A Preferred Stock and 2,200 shares of Preferred Series B Stock issued and outstanding, Series A Preferred Stock is entitled to 25,000 votes per share and Series B Preferred Stock has a special liquidation preference equal to $27.50 per share.\nCommon Stock Issuances\nDuring the year ended June 30, 2023, the Company issued 1,294,469 shares of common stock in exchange for $96,067 at an average price of approximately $0.07.\nDuring the year ended June 30, 2022, the Company issued 118,663,761 shares of common stock at an average price of approximately $0.0019 in exchange for $225,259 of debt which was previously classified as common stock payable (See Note 5) and sold 526,941 shares in exchange for $81,345 at an average price of $0.15.\nNOTE 8 - COMMITMENTS AND CONTINGENCIES\nLegal Matters\nFrom time to time, we may be involved in litigation relating to claims arising out of our operations in the normal course of business. As of June 30, 2023, there were no pending or threatened lawsuits that could reasonably be expected to have a material effect on the results of our operations.\nGHST WORLD, INC.\nNotes to Consolidated Financial Statements\nJune 30, 2023 and 2022 (As Restated)\nOn February 7, 2023, the Company entered into an agreement with a vendor to develop the technology associated with the Companys patent for shin guards used in sports. The contract was for $46,000, but management decided to cancel the contract in favor of other potential vendors that the Company is studying closely. There was no accounting effect to this transaction.\nNOTE 9 - IMPACT OF RESTATEMENT\nSee below for a reconciliation from the previously reported June 30, 2022 consolidated financial statement to the restated amounts in the consolidated statements of operations for the years ended June 30, 2022 and in the consolidated balance sheets as of June 30, 2022. The previously reported amounts were derived from the Company's Annual Report on Form 10-K for the year ended June 30, 2022 as filed with the SEC on September 28, 2022 (the Original Report). These amounts are labeled as As Previously Reported in the tables below. The amounts labeled Restatement Adjustment represent the effects of this restatement described above.\nThe correction of these misstatements resulted in an increase in net loss of $3.8 million for the year ended June 30, 2022 and a decrease in total assets of $154,181 as of June 30, 2022. The following presents a reconciliation of the impacted consolidated financial statement line items as previously reported to the restated amounts as of June 30, 2022:\nSchedule of reconciliation of impacted consolidated financial statement\nAs of June 30, 2022\nAs previously reported Restatement Adjustment As restated\nConsolidated Balance Sheet\nOther asset $ 115,000 $ (115,000 ) $ -\nPatent costs 39,181 (39,181 ) -\nTotal $ 154,181 $ (154,181 ) $ -\nFor The Year Ended June 30, 2022\nAs previously reported Restatement Adjustment As restated\nConsolidated Statement of Operations\nGeneral and administrative expenses $ 150,702 $ 14,521 $ 165,223\nImpairment of long-lived assets - $ 154,181 $ 154,181\nLoss on debt conversion - $ (3,666,441 ) $ (3,666,441 )\nNet Loss $ (151,885 ) $ (3,835,142 ) $ (3,987,027 )\nNet Loss per common share\n- basic $ (0.00 ) $ (0.07 ) $ (0.07 )\n- diluted $ (0.00 ) $ 0.07 ) $ (0.07 )\nConsolidated Statement of Changes in Stockholders Deficit\nAccumulated deficit $ (9,418,947 ) $ (3,835,144 ) $ (13,254,091 )\nTotal stockholders equity (deficit) $ 67,697 $ (168,703 ) $ (101,006 )\nConsolidated Statement of Cash Flow\nNet cash used in operating activities $ (163,028 ) $ - $ (163,028 )\nNet cash provided by financing activities $ 155,884 $ - $ 155,884\nNOTE 10 - INCOME TAXES\nThe company accounts for income taxes under ASC 740, Income Taxes, which requires the recognition of deferred tax assets and liabilities based on the difference between the financial statement basis and tax basis of assets and liabilities by using enacted tax rates in effect for the year. The company had no unrecognized tax benefits at June 30, 2023 or 2022.\nGHST WORLD, INC.\nNotes to Consolidated Financial Statements\nJune 30, 2023 and 2022 (As Restated)\nThe Company has accumulated losses of approximately $13.3 13,370,665 million since its inception. For income tax purposes, the Company has operating loss carryforwards of approximately $3.1 million from tax years beginning in 2007, that begin to expire in 2027. These operating losses are subject to the limitations which were enacted in the Tax Cuts and Jobs Act (TCJA). These operating losses can offset only 80% of taxable income in any given tax year. The carryover period for these operating losses is indefinite. No federal or state tax asset has been reported in the financial statements because the Company believes there is a 50% or greater chance that the carryforwards will expire unused. Accordingly, the potential tax benefits of the loss carryforwards (approximately $781,000 based on an a effective combined federal and state tax rate of 25.35%) have been offset by a valuation allowance of the same amount.\nThe following is a reconciliation of income tax rate:\nSchedule of reconciliation of income tax rate\nJune 30, 2023 June 30, 2023\nFederal tax rate 21.00 % 21.00 %\nState tax rate 5.50 % 5.50 %\nFederal tax benefit of State Taxes (1.15 %) (1.15 %)\nCombined effective tax rate 25.35 % 25.35 %\nLess valuation allowance (25.35 )% (25.35 %)\nTax rate 0.00 % 0.00 %\nNOTE 11 - SUBSEQUENT EVENTS\nOn September 23, 2023, the company entered into a joint venture agreement with cross-ING AG, an artificial intelligence development entity in Switzerland. The joint venture was formed to create and deliver the software package tailored for GHST Sport Inc. The start of the project was October 2, 2023, with the initial payment due upon each milestones endorsement by the Steering Group, totaling 40,000 CHF (approximately 45,272 USD). In connection with the agreement the Company issued 4,476,176 shares of common stock on October 2, 2023, which the recipient agreed not to sell for a period of two years. This issuance was based on an agreed upon fixed value of 180,000 CHF (approximately 203,724 USD) and based on the average quoted price of the Company of $0.0455. For accounting purposes the value of the shares on the date of issuance was $324,523 based on the closing price of the Companys stock on September 23, 2023. Royalties will also be due under this agreement amounting to 1 CHF ($1.10 USD) per unit sold up to 150,000 units.\nThe Companys Chairman of the Board has provided funds for operations subsequent to year end of approximately $15,000 through October 8, 2023."
}