{
    "cik": "1127475",
    "company": "Digital Brand Media & Marketing Group, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-11-29",
    "period_of_report": "2022-08-31",
    "sic": "7389",
    "state_of_inc": "FL",
    "state_location": "NY",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1127475/0001185185-22-001360-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1127475/000118518522001360/dbmm20220831_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1127475/0001185185-22-001360.txt",
    "filename": "1127475_10K_2022_0001185185-22-001360.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nABOUT OUR BRAND DIGITAL CLARITY\nDigital Clarity is the trading brand for Stylar Limited, a wholly owned subsidiary of Digital Brand Media & Marketing Group, Inc (DBMM), through its office in London, England. The Company is a multi-service digital marketing advisory business that specializes in creating effective strategies and campaigns for clients across a range of vertical markets, working in four key areas:\nSEO & Paid Media - marketing on platforms like Google, LinkedIn & Meta\nAnalytics - measuring and analyzing web traffic to optimize performance.\nStrategy & Consulting - digital transformation and marketing strategy.\nSocial Media - planning and measuring social metrics digitally in order to diagnose strategy.\nDBMM Group can leverage its teams experience in digital media and provide leading strategy, deployment and measurement to its core markets in many industry sectors, from creative to traditional corporate. The vertical B2B sectors encompass areas such as B2B eCommerce, SaaS, Blockchain, Fintech, Software Sales and Technology.\nThe Company is rolling out the services of both the technology and marketing services offerings from its operating base in the UK with a plan to increase its presence into the larger markets in the US. namely Los Angeles and New York. The intent in fiscal year 2023 will be a strategy of a cash infusion to immediately correlate to increased revenues. Growth is clearly a function of available capital. Fiscal year 2022 reflected the Company's continued progress by being awarded contracts for a number of new clients, in the midst of a very challenging year because of external factors beyond the Companys control, specifically the pandemic and the SEC Matter awaiting the Commissions final affirmation of the dismissal. The contract model strategy results in a full digital technology and marketing consultancy from design following an analysis of the client's analytics, then executing and stewarding the evolution of the model. The Company's mantra is \"ROI is our DNA,\" the underlying focus for business development.\nEMPLOYEES\nAs of August 31, 2022, the Company had 7 full-time employees.\nCOMPETITION\nThere is strong competition in the digital marketing arena, though with the right level of investment and marketing, Digital Clarity has a confident outlook in using its experience to win new business in both local and international markets. DBMM has significant business relationships in place because it has a differentiating model. ITEM 1A. RISK FACTORS\nSmaller reporting companies are not required to provide the information required by this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. DESCRIPTION OF PROPERTY\nDBMM's Corporate address is 845 Third Avenue, 6th Floor, New York, NY 10022. The operating headquarters is located in the UK as Stylar Ltd., trading as Digital Clarity. is on a month-to-month lease as it is evaluating larger quarters post-pandemic. ITEM 3. LEGAL PROCEEDINGS\nThe U.S. Securities & Exchange Commission instituted an Administrative Proceeding, File No. 3-17990, on May 16, 2017 to revoke the Company's registration statement because of delinquent filings. A hearing was held on August 9, 2017 and the Initial Decision to revoke the registration was dated November 16, 2017. The order was subsequently remanded by order of the U.S. Supreme Court in December 2017. The Company responded to the Remand with evidence of mitigating circumstances under a Protective Order and filed all its delinquent filings: a Super 10-K for 2015-2016-2017 on May 31, 2018 and 10-Q's for 2018 1Q, 2Q on June 22, 2018 and 3Q on July 15, 2018, its due date.\nThe Hearing for January 15, 2019 was re-scheduled because of government shutdown. Digital Brand entered a Motion to Dismiss the Proceedings on March 19, 2019 based on being current as of July 2018, and all filings to date have been filed on time for the 2019 fiscal year. The facts were presented at the hearing. The Division did not support the dismissal in a response to which Digital Brand filed two Amendments to the Consolidated 10-K for 2015- 2016-2017 and the 10-K for 2018 on April 23 and 24, 2019 respectively, and Amendments No. 2 on October 1, 2019 to supersede language in Part II, Item 9A. On November 12, 2019, Carol Fox Foelak, Administrative Law Judge, Securities & Exchange Commission ordered an Initial Decision/Dismissal of the Proceeding. The Dismissal would have become effective under Rule 360 of the Commission's Rules of Practice, 17 C.F.R., Section 201.360, following the Commissions Order of Finality. Unfortunately, on December 3, 2019 The Division of Enforcement Submitted a Petition for Review of Judge Carol Fox Foelaks Initial Decision dismissing the Administrative Proceedings rendered on November 12, 2019. The Company filed a Motion for summary affirmance of the Initial Decision on December 20, 2019. The Motion for Summary Affirmance was not opposed by Enforcement, nevertheless the Petition for Review (PFR) was filed earlier.\n.\nOn January 25, 2021, the Commission denied the Companys Motion for Summary Affirmance of Judge Carol Fox-Foelaks Dismissal of November 12, 2019 and granted the Divisions Petition for Review and set a briefing schedule beginning February 24, 2021. The Commission concluded that briefing in the ordinary course would...assist the Commission. This appeal raises issues as to which we have an interest in articulating our views and important matters of public interest, including the proper application of the standard that governs determination of sanctions in a Section 12(j) proceeding. Both parties have briefed and concluded April, 2021. The Company is disappointed that so much time has been lost and continues to vociferously support the original Dismissal three years ago.\nThe Commission notified the Company on December 9, 2021 that an extension of 90 days to issue a decision has been ordered. The Commission ordered a fourth 90-day extension to issue a decision to conclude December 5, 2022.\nShareholders have been significantly damaged by the protracted SEC matter. The delays were further exacerbated by the unnecessary PFR requested by the Division of Enforcement while the Company continues to meet its reporting compliance in good faith as committed to the court and contained in its cured SEC filings and thereafter. The Company continues to review options to bring this matter to conclusion as soon as possible.\nFrom time to time, the Company has become or may become involved in certain lawsuits and legal proceedings which arise in the ordinary course of business. The Company intends to vigorously defend its positions. However, litigation is subject to inherent uncertainties and an adverse result in those or other matters may arise from time to time that may harm its financial position, or our business and the outcome of these matters cannot be ultimately predicted. ITEM 4. MINE SAFETY DISCLOSURES\nN/A\nPART II ITEM 5. MARKET FOR COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMARKET INFORMATION\nOur common stock is currently listed for quotation on the OTC under the symbol DBMM.\nPER SHARE MARKET PRICE DATA\nThe following table sets forth, for the fiscal quarters indicated, the high and low closing bid prices per share for our common stock, as reported by on PinkSheets.com. Such quotations reflect inter-dealer prices, without retail markup, markdown or commission and may not represent actual transactions.\nYear Ended August 31, 2022:\nHigh\nLow\nFirst Quarter\n$ 0.01\n$ 0.002\nSecond Quarter\n$ 0.0074\n$ 0.0056\nThird Quarter\n$ 0.0041\n$ 0.0005\nFourth Quarter\n$ 0.0015\n$ 0.0004\nYear Ended August 31, 2021:\nHigh\nLow\nFirst Quarter\n$ 0.009\n$ 0.002\nSecond Quarter\n$ 0.0074\n$ 0.0025\nThird Quarter\n$ 0.0041\n$ 0.0005\nFourth Quarter\n$ 0.0015\n$ 0.0004\nThe last reported sale price of the common stock on the OTC Electronic Bulletin Board on August 31, 2022 and 2021 were $0.0005 and $0.0015 per share, respectively. As of August 31, 2022, and 2021, there were 119 holders of record of our common stock, respectively.\nOn October 26, 2022, FINRA processed a Form 211 relating to the initiation of priced quotations of our shares of common stock, which means that the submitting broker-dealer has demonstrated to FINRA compliance with FINRA Rule 6432 and therefore has met the requirements under that rule to initiate a quotation for our shares of common stock within four days of October 26, 2022. FINRAs processing of a Form 211 in no way constitutes FINRAs approval of the security, the issuer, or the issuers business and relates solely to the submitting broker-dealers obligation to comply with FINRA Rule 6432 and SEA Rule 15c2-11 when quoting a security. (FINRA TO Glendale Securities)\nGlendale Securities, Inc. is the designated Market Maker.\nDIVIDENDS\nWe have never declared any cash dividends with respect to our common stock. Future payment of dividends is within the discretion of our board of directors and will depend on our earnings, capital requirements, financial condition and other relevant factors. Although there are no material restrictions limiting, or that are likely to limit our ability to pay dividends on our common stock, we presently intend to retain future earnings, if any, for use in our business and have no present intention to pay cash dividends on our common stock. ITEM 6. SELECTED FINANCIAL DATA\nAs a smaller reporting company, as defined by Rule 10(f)(1) of Regulation S-K, the Company is not required to provide this information. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCertain statements contained herein are forward-looking statements and should be read in conjunction with our disclosures under the heading \"Forward-Looking Statements\" above. These statements are based on current expectations and assumptions that are subject to risks and uncertainties. This discussion also should be read in conjunction with the notes to our consolidated financial statements contained in Item 8. \"Financial Statements and Supplementary Data\" of this Report.\nOPERATIONS OVERVIEW/OUTLOOK\nThe Company developed a document called the Creds Deck which provides a description to prospective clients of Digital Claritys value proposition http://www.dbmmgroup.com/wp-content/uploads/2020/11/Digital-Clarity-Creds-Deck_DB64F.pdf.\nThe fiscal year 2022 has focused on a slow return to normalcy though businesses have faced enormous challenges over the past few years, and DBMM's operating business Digital Clarity, is no exception. However, for context, it is worth reminding investors and shareholders, that Digital Clarity was acquired by DBMM as a cash-flow positive business with a great reputation and industry network, winning industry awards.\nAs stated in the MD&As for many years, the operating business is cash flow positive, but the costs of maintaining a public company far exceed the profit in those early days. That was expected. That is the digital business model, though many digital companies do not have any operating revenues while they build the business.\nThough the post-pandemic era still leaves scars, there is also an opportunity for lean organizations to take advantage of the new and challenging landscape that will no doubt still impact the overall economy.\nMost analysts are clear that as we head toward the end of 2022, the challenges globally though different from the pandemic will still have an impact in 2023.\nBusinesses will have to deal with the after-effects of not only the global pandemic but new challenges. The backdrop as we enter 2023, it is clear that B2B leaders are bracing for economic upheaval. Concerns about inflation, higher interest rates, supply chain shortages, and the prospect of a looming recession are already forcing go-to-market leaders to rethink their growth strategies.\nThough the general business sentiment is pessimistic, Digital Clarity has adapted its model to continually seek to focus on areas that will allow the business not only to survive during the turmoil but thrive as we come out of the challenging economic backdrop.\nDigital Clarity has been pivoting during these challenging headwinds and working to build upon its experience in the B2B space and engaging with prospects in the SaaS and Tech market. The company is also looking to develop business in Web3 and Ai sectors as companies look to adapt to a changing business customer base.\nWHY DIGITAL EXPERTS CONTINUE TO BE IN DEMAND\nThe world has changed. Digital is now within the fabric of everyday life. As consumer markets plateau and come under pressure, the move by Digital Clarity to meet the needs of the business-to-business sector, is both timely and has commercial growth potential.\nThe B2B buyer journey is complex. This is why experts like Digital Clarity need to be involved from the start.\nSavvy communication experts like Digital Clarity produce ideas that shape perceptions and grow markets. There has never been a better time to navigate into the B2B Marketplace as demand for an experienced, safe pair of hands is required. This sector is growing rapidly and the demand for expertise and skill to help businesses in marketing their services and products is sought after. B2B digital ad spending is projected to reach $18.47 billion by 2024, it will account for nearly 50% of total B2B ad spending that year according to Insider Intelligence.\nA hybrid approach to marketing in line with hybrid sales departments is expected to be the most dominant sales strategy by 2024 due to shifts in customer preferences and remote-first engagement according to the McKinsey, The future of B2B sales Report 2022. Hybrid will drive up to 50 percent more revenue by enabling broader, deeper customer engagement and unlocking a more diverse talent pool than more traditional models.\nWinning B2B organizations are shifting to a more hybrid sales force by implementing actions that support success.\nTo keep up with the ever-changing scene, digital marketing experts need to stay in step with the evolving tech trends. Social media marketing companies like ours work tirelessly to research consumers and what makes them engage with brands. We try to find the best online solutions that will cater to our clients end-users queries in the easiest and most cost-efficient way possible -- be it by developing new technology or adapting to trends.\nRELENTLESS DIGITAL GROWTH POSITIONS DIGITAL CLARITY AS A LEADER\nThe need for seasoned expertise and insight is in huge demand. Digital Claritys strength, heritage, and reach in digital marketing puts the DBMM brand in an excellent position for investment and growth. As the consumer-facing market becomes even more commoditized, the companys move to serving the business sector (B2B) will see it leveraging experience for growth.\nThough the pandemic is certainly not over, the business world entered into a period of recovery in 2022. In the process, its become apparent that even if the ongoing shift toward digital and mobile advertising in B2B might slow down to a degree, its not going to stop.\nTHE SHIFT TO DIGITAL IS PERMANENT\nDespite slower growth, digital will continue to command a greater overall share as more B2B marketers make the permanent shift from traditional advertising to online activities.\nOne of the most pronounced effects the pandemic had on B2B marketing was exponentially accelerating its transition into digital. As the business world begins recovering from the pandemic and returning to more traditional models, this transition has slowed down. The past year has affirmed, however, that it will not stop.\nHOW MACHINE LEARNING IS ENHANCING DIGITAL MARKETING STRATEGY\nDigital Clarity applies strategy to algorithmic based machine learning tools. The launch of Googles new machine learning tool, RankBrain which contributes to search engine results, left many people wondering what impact machine learning would have in the realm of Search Engine Optimization (SEO).\nWith the tech industry going crazy for all things Artificial Intelligence (AI), Natural Language Processing (NLP), machine learning, and chatbots - companies like Digital Clarity help brands make sense of this ever-changing landscape.\nMACHINE LEARNING AND DIGITAL MARKETING\nBecause machine learning is being used to solve a huge set of diverse problems with the help of data, channels, content, and context, as marketers, Digital Clarity stands to benefit from this information and phenomenon as a whole. But, as the information we gather grows, digital marketing as we know it is set to change. Digital Clarity will be at the forefront of this change.\nPAY PER CLICK (PPC) CAMPAIGNS\nWith Google launching new smart features such as Google Smart Bidding, Smart Display Campaigns, and In-Market Audience to help businesses maximize conversions, it is clear that the future of PPC lies in machine learning.\nTo become more strategic and take PPC campaigns to the next level for its clients, Digital Clarity:\n●\nGet to grips with the metrics that are most valuable to your business\n●\nUnderstand obstacles that could get in the way of meeting your goals\n●\nKnow the underlying performance drivers to make more strategic decisions\nSEARCH - OVERALL\nSearch makes up half (52%) of advertising spend, increasing on par at 15% to $4.3bn, next is non-video display at $1.73bn (+9%), then video display $1.2bn (40%). Classifieds remains at $949m and other remained at $53.3m.\nDIGITAL CLARITY EMBRACE GOOGLES MACHINE LEARNING MARKETING SUITE\nMachine learning and AI have grown at a rapid pace and are an integral part of day to day search advertising management and planning. Though machine learning has been an integral part of the ad world, what has been more significant has been the addition of Artificial Intelligence or AI. According to a recent report in The Harvard Business Review by Deloitte, AI in Digital Marketing is not just getting bigger, its getting far more persuasive\nMIT researchers recently unveiled a chip that can perform inference using neural network computations three to seven times faster than previous chips, and with up to 95 percent less power consumption. Dozens of companies working on new generations of AI chips-for use both in and outside of data centers-are attracting significant investment. These companies raised more than $1.5 billion in funding last year, nearly twice the amount they raised the year before.\nDIGITAL CLARITY PERFECTLY POSITIONED FOR THE FUTURE\nAccording to Gartner's Digital Business Acceleration report: Where to Focus Now, Enterprises have the intention of becoming more digital due to COVID-19.\nSALES ARE GOING DIGITAL\nDisruptive buyer dynamics are rewriting the rulebook for B2B sales, demanding digital-first engagement with customers. The rise in digital sales will be driven by marketing that creates demand and trust in brands.\nThis doesnt portend the eventual death of the sales rep, but it does signal drastic changes needed in the seller role. Sales leaders must deliver significant value through digital and omnichannel sales models, aided by sales professionals who can steer self-learning customers toward more confident decisions. Digital delivers this.\nTHE GROWTH OF THE DIGITAL OMNICHANNEL\nGartner research shows a steady shift of customer preferences from in-person sales interactions to digital channels. B2B buyers spend only 17% of the total purchase journey with sales reps.\nBecause the average deal involves multiple suppliers, a sales rep gets roughly 5% of a customers total purchase time. And 44% of millennials prefer no sales rep interaction at all in a B2B setting.\nSales leaders must deliver significant value through digital and omnichannel sales models, aided by sales professionals who can steer self-learning customers toward more confident decisions.\nOMNICHANNEL IS THE STANDARD, NOT THE EXCEPTION\nDigital Clarity can help organizations adopt the B2B Omnichannel. Eight in ten B2B leaders say that omnichannel is as or more effective than traditional methods, a sentiment that has grown sharply in the last 2 years. Even as in-person engagement re-emerged as an option, buyers made clear they prefer a cross-channel mix, choosing in-person, remote, and digital self-serve interactions in equal measure.\nIncreasing demands from customers, the proliferation of sales channels, the increase in data availability, and the need to personalize content have driven the need for sales and marketing teams to work as one. In fact, 89 percent of respondents now say that marketing and sales need to work closely together, more so than ever before.\nTo help enable and drive increased sales, marketing teams have been busy. Fifty-two percent of respondents say their companies have conducted extensive primary research to improve customer experience. Another 51 percent have invested in new capabilities to enable personalized marketing, while 45 percent say their companies have recently re-evaluated the role of marketing in their organization overall.\nMcKinsey says that the equilibrium is no accident. As B2B buyers flexed to remote and digital ways of engaging, they found much to like. The use and preference for e-commerce-self-serve, for example-has continually grown year on year.\nOmnichannel is more effective than traditional sales models alone. As more companies enable face-to-face, remote, and e-commerce interactions, satisfaction with the sales model has grown exponentially. More than 90 percent of B2B companies say their go-to-market model is just as or more effective than before the pandemic began.\nDIGITAL CLARITY PERFECTLY POSITIONED FOR GROWTH\nOrganizations will have to fight hard to retain loyalty if customer needs are not met: for example, eight in ten B2B decision makers say they will actively look for a new supplier if performance guarantees.\nBuyers are more willing than ever before to spend big through remote or online sales channels, with 35 percent willing to spend $500,000 or more in a single transaction. Seventy-seven percent of B2B customers are also willing to spend $50,000 or more.\nB2B customers now regularly use ten or more channels to interact with suppliers.\nDigital Clarity is a specialist in many of these channels and has been for a number of years. This expertise, experience, and trust will put Digital Clarity front of mind for organizations as they seek professional advice.\nSome of the channels of focus are:\nB2B DIGITAL MARKETING SERVICES\nThere is no denying the last year has proved challenging for Digital Marketing Services.\nThat said, the need for specialist marketing advisors is in demand. Google still dominates as part of the buying journey for both top and bottom of the buying funnel. SEO and Googles algorithm has become more complex. Digital Clarity are perfectly positioned to help companies navigate the complexities.\nCONTENT MARKETING\nContent has become a critical tool in the marketing mix for almost every B2B brand. Nine out of ten B2B marketers are using content marketing strategies to pull in new customers. This year, the most successful marketers were already spending 40% or more of their budget on their content strategy.\nAt its simplest, B2B content marketing is when a brand uses stories, ideas, and insights to engage and influence a business audience.\nThere is a realization amongst B2B brands that rather than being faceless organizations, they need to tell their brands story and show a more human side to their business, endear and promote demand from other businesses and customers. The best content marketing campaigns back up these stories and ideas with robust insights: interesting data points, original research, and real-world examples that help their customers understand a new trend or challenge and equip them with the tools and best practices to respond and thrive.\nThese data points and research is an area in that Digital Clarity can help companies shape their content strategy. Typically, areas that Digital Clarity help clients are:\n●\nBlog posts - marketers who make blogging a priority are 13x more likely to see a positive ROI for their efforts.\n●\nWhite papers - favored by 22% of business leaders, these longer research-based reports provide more in-depth information. Learn more about writing a compelling B2B marketing white paper here.\n●\nShort-form articles - enjoyed by 37% of execs, these have to research-based if they are to stand out.\n●\nCase studies - these provide buyers with reassurance further down the buying funnel and can be made sector-specific. Nearly half of all business leaders appreciate them.\n●\nInfographics - these have become one of the most popular content marketing tools in recent years.\n●\nPodcasts - increasingly popular lead generation tools with marketers looking to deliver thought leadership content to buyers on the move.\n●\nVideos - companies using video, experience clickthrough rates that are 27% higher and web conversion rates 34% greater than those that dont.\n●\nEmail - nearly eight out of 10 marketers report see g an increase in email engagement over the past 12 months of 2022.\n●\nLinkedIn - generates more than 50% of all social traffic to B2B websites & blogs.\nCONTENT IS INFORMATION, AND DISCOVERABLE INFORMATION DRIVES REVENUE\nInformation drives purchase ease and high-quality sales\nAll of this looping around and bouncing from one job to another means that buyers value suppliers that make it easier for them to navigate the purchase process.\nIn fact, Gartner research found that customers who perceived the information they received from suppliers to be helpful in advancing across their buying jobs were 2.8 times more likely to experience a high degree of purchase ease, and three times more likely to buy a bigger deal with less regret.\nDigital Clarity has a process that helps shape their clients content to become more discoverable information, and this increases revenues.\nBuyer enablement, or the provisioning of information to customers in a way that enables them to complete information online, like gathering information or making a purchase, is an area that Digital Clarity are helping organizations.\nKEY MILESTONES\nAs the market conditions in the consumer market cool slightly, the team at Digital Clarity has been busy pivoting their business model to address the need in the 2b2 business sector. This is a more strategic offering for prospective customers.\nDigital Clarity has started offering a wider array of services to it fast-growing S company in the US. Services include, LinkedIn strategy, content positioning and SEO.\nDigital Clarity has attended a major convergence summit with its client in the Unified Communication and Digital Transformation arena. This allowed the team to meet with the likes of SaaS CX providers, 8x8, Five9, and Mitel, amongst others. This will be an area of focus for the company into 2023.\nIn October, Digital Clarity was part of a select group that part of a panel that discussed the impact of NFTs, Blockchain and the growth of Web 3 and the Metaverse. The event was arranged by leading law firm Memery Crystal, part of Rosenblatt.\nDigital Clarity has been on a large business development push and attended various networking events in London. The events include Enterprise Cyber Security hosted at the London Stock Exchange as well as diverse events in DeFi and InsureTech.\nOther examples are representative of the diversity of client base. DBMM's approach using a client's analytics and executing an individualized model to increase ROI as the prime objective, spans a wide range of industries.\nCore industry verticals for Digital Clarity include: B2B, SaaS, Digital Transformation, FinTech, Unified Communication Companies and discretionary advice for professional service providers and consultants.\nTHE GROWTH OF DIGITAL MARKETING & CONSULTANCY SERVICES\nThe skill set historically owned by agencies offering disciplines such as UX, design, creativity, customer-centric data analytics and customer engagement is now being immersed with large consultancy businesses whose traditional bread and butter was Digital Transformation.\nAccenture, Deloitte, IBM, KPMG, McKinsey and PricewaterhouseCoopers rank among the most aggressive players in acquiring and partnering with agencies such as Digital Clarity. They present not only an opportunity for Digital Clarity but also a prospective exit and investment opportunity.\nDigital Clarity have continued to develop their Digital Consulting and Strategy Planning offering. The forward looking program is to be a recognized leader in this field and fulfill companies seeking Digital Transformation for their originations.\nTHE NEED FOR PROFESSIONAL CONSULTANCY AND THE OPPORTUNITY FOR MASSIVE GROWTH\nFour consultancies lead Ad Age's ranking of the 10 largest agency companies in the world. With combined revenue of $13.2 billion, the marketing services units of Accenture, PwC, IBM and Deloitte sit just below WPP, Omnicom, Publicis Groupe, Interpublic and Dentsu. Last year, only two consultancies-Accenture Interactive and IBM iX-made the top 10. IBM iX was the first to break into the top 10.\nGiven the experience of the team, Digital Claritys advisory and consultancy is in demand. With the recent growth in these business areas, and the rise of consultancies, it is confirmation that Digital Clarity is headed in the right direction for growth\nTHE GROWTH OF DIGITAL TRANSFORMATION WORLDWIDE\nThe Global Digital Transformation Market size is expected to reach $1.3 billion by 2027, rising at a market growth of 20.8% CAGR during the forecast period. Digital transformation is considered as the utilization of digital technology. Digitally transformed enterprises can be flexible to the changing technological landscape and can address abrupt shifts in the industry, particularly the one presently created by the COVID-19 pandemic; studies show that the efficiency and rate of adaptation of digitally transformed companies to a post-pandemic era are relatively larger than conventional businesses. Source\nDigital Clarity can help various businesses that have been considerably affected by the global outbreak of the COVID-19 pandemic. One of the significant challenges for the global economy in 2020 was to facilitate business continuity in the midst of social distancing guidelines, lockdowns norms, work-from-home culture, and other operational challenges. The lack of availability of digital strategies, infrastructure, or tools worsens the challenges for various companies that were needed to abruptly shift operations online or allow workers to work from their homes.\nThe situation, on the other hand, resulted in a considerable surge in awareness regarding the urgent requirement for digital transformation across a majority of the industries and created some lucrative opportunities for the global market. Companies are getting more aware of the advantages of digital transformation, particularly in the work-from-home culture that needs a business to allow the employees to easily learn, collaborate and perform organizational functions across remote locations.\nTHE IMPORTANCE OF STRATEGIC MARKETING CONSULTANCY\nThe fundamentals of marketing may not have changed, but everything else has: goals, roles, expectations, talent needs, and more. B2B marketing leaders need to navigate this new terrain and build the capabilities needed to win. Digital Clarity helps these organizations win.\nAcross industries, organizations are accelerating digital transformation processes for long-term growth and profitability. Yet: 53% of the organizations surveyed remain untested in the face of digital challenge and their digital transformation readiness therefore uncertain. This report from Gartner highlights the need embrace change.\nBusinesses had no choice but to respond quickly to challenging conditions. Although not formally classed as ‘agile, the twists and turns of the pandemic have required executives to innovate on the fly and collaborate to get things done. This has been compounded by working from home, which has cut out distractions and created more time for ‘deep thinking. Regardless of headcount, a return to more stable trading conditions shouldnt mean running back to the standard practices and silos that previously slowed marketers down.\nAdobe says that Business-to-business (B2B) commerce will continue to undergo a major transformation as companies adopt the latest technologies to find new customers, improve their supply-chain efficiencies, and provide a more personalized user experience to their clientele.\nDigital Clarity has created a unique Diagnosis Workshop that helps brands identify needs as well as assess the opportunity available. The core focus is to help reduce wastage and increase results.\nAreas of focus include:\n●\nCost analysis\n●\nAudit current channels\n●\nDigital strategy planning\n●\nROI projection planning\n●\nDigital consulting and training\nCOMPETITIVE LANDSCAPE\nDigital advertising is the fastest-growing segment of the global market for advertising spending. The increasing use of smartphones and the availability of cheap internet services are the two major factors propelling the growth prospects for this market. More than 30% of the companies are planning to spend around 75% of their advertising expenditures on digital marketing within the next five years.\nU. S. Marketers are expected to spend $110.1 billion on digital ads this year, or 51% of the $214.6 billion total U.S. advertising spending forecast, excluding political ads. Newspapers, radio, magazines, and local television now account for just 21% of the U.S. ad market. From The Wall Street Journal\nDIGITAL CLARITY HAS A COMPETITIVE ADVANTAGE\nDigital Clarity operate in a highly commoditized market but have over the years build a stellar reputation that makes it different from its competitors. Some of these areas include:\n1.\nOur DNA is Strategically Driven\nWe believe the path to successful customer acquisition lies in understanding a clients business - not just running a campaign. We seek to help clients understand that success has to be objective and measurable.\n2.\nWe are Business Led\nDigital marketing is not a cost but an asset. Not a line in a spreadsheet but an emotive force that if done right, will bring real business change and growth.\n3.\nWe are Digital Thinkers\nMarketing has to be at the heart of the business. Delivering real innovation in digital marketing requires not just knowledge but authority and bravery. We think digital. We drive results.\n4.\nOur goal is to deliver Digital Performance\nWe help our clients to understand their goals and objectives, using digital marketing to drive new business opportunities and retain their current customers.\nHIS Markit, a research firm, reported: Each dollar that companies spent on advertising in the United States last year, led to $9 in sales.\nTHE GROWTH OF B2B SOCIAL MEDIA\n2020 will go down as the year that marketing was pulled into the boardroom. 80% of senior executives said the role of marketing in setting strategy has expanded since the pandemic. Traditional consumers have moved online, making the digital environment even more important right now.\nThis priority has raised the profile of marketing as companies scramble to understand the digital-first consumer. The battleground for 2023 will be about speed and agility. Now that many companies have treasure troves of data, the difference is how fast they can personalize the experience and respond to consumer behaviors. Expect to see more investment and innovation in technology infrastructure alongside marketing.\n●\n76% of B2B organizations use social media analytics to measure content performance.\n●\nBy 2025, 80% of B2B sales interactions will occur on digital channels.\n●\nU.S. B2B business will spend an estimated $1.99 billion in 2022, and $2.33 billion in 2023.\nGROWTH IN LINKEDIN ADVERTISING SET TO SOAR BEYOND 2023\nAlmost all B2B content marketers (96%) use LinkedIn. They also rated it as the top-performing organic platform.\nFor paid social posts, the picture is similar but not identical.\nDigital Clarity help business organization make the most of LinkedIn. We help customers understand and build campaigns around the 95-5 rule. The 95-5 rule advises you market mostly to buyers who are not likely to buy from you today.\nTHE NEW NORMAL IS DIGITAL\nIn just one-year, since the pandemic. digital adoption has happened at five to ten times the projected rate.\nLockdown periods, economic uncertainty and loss of predictability have forced customers and businesses online in previously unseen numbers. This migration has upset the power balance, with customers now more in control of the relationship and less loyal to brands and products. On top of that, 60% of companies have seen new buying behaviors such as changes to average basket size and product interests.\nPandemic disruption is also causing many businesses to demand a similar level of convenience to consumers. When we return to normal, theres no question that the new normal will be digital.\nGROWTH IN INVESTOR AWARENESS AND OUTREACH.\nDuring 2022, Digital Brand Media & Marketing Group, Inc. intended to initiate a significant effort to raise positive awareness of DBMM's growth potential on a global basis. The Company had to continue to defer its 2020/21 plans until certain SEC Matters regarding the delinquent filings brought current in July 2018, remain open into 2022. The global pandemic made it impossible to initiate any Investor Awareness Program and the SEC matter remains open, so the planning remains in neutral for now.\nHopefully in 2023 the strategic outreach will be directed at investors around the world who understand the digital marketplace and its expanding influence on consumer decisions. DBMM will target new investors through a global digital and traditional integrated investor outreach campaign which will be run by Digital Clarity, with third parties, as required, for distribution. In all areas, the Company will act in the interests of all stakeholders.\nIn the full industry context of dramatic expansion of digital footprints, there has been no direct correlation between DBMM's revenues and its share price. Economic and industry analysts have opined that the industry multiple continues to grow to, in some cases, 25-30 times revenues. DBMM will expand its client and geographic scale, thus increasing revenues. There were matters outside of DBMM's control which caused growth to be in neutral, and in 2020/21 the pandemic threw all planning into disarray. With capital infusion following the closure of the SEC review with a final order of the earlier dismissal, 2023 will follow the model of a growing client base and geographic reach until it achieves a TBD level of profitability. We anticipate the benchmark will replicate successful industry models in digital technology, marketing and company transformation.\nFINANCIAL OVERVIEW/OUTLOOK\nDBMM has been honing its commercial model since the acquisition of Digital Clarity (DC) in 2011, and has been cashflow-positive as an operating company since then. Unfortunately, external events outside of DBMMs control have precluded the growth expected to this point; however, its margins of 35-50% are accurate. Aspirationally, when the Company reaches appropriate scale and profitability TBD, the business will meet all stakeholder expectations.\nThe growth trajectory anticipated during 2022 remains deferred until the Company returns to normal business and normal trading. When that occurs, the clients benefit immediately due to a wider range of resources, and the shareholders will benefit as the market cap grows. The media market multiple far exceeds the old manufacturing multiples, as digital technology and marketing has become one of fastest growing industries in the world today.\nDBMMs place in the industry reputationally is strong, particularly for its size. The industry environment continues to grow exponentially, and digital marketing and company transformation is an essential strategy for any commercial activity, and thus has become embedded in planning.\nSince 2020, revenues have slowed down temporarily due to a number of factors: 1) client uncertainty caused by Brexit trade issues, 2) COVID-19 global slowdown with some clients pausing as lockdowns stopped and started, 3) clients needing to extend or double down lacked the resources. To address the changing environment, the business development model has evolved and, as such, Digital Clarity has earned a seat at the table, client by client. With precision, the revenues are turning around.\nSeveral years ago, the Company received a commitment for future working capital to grow the Company in key markets. Growth capital will be directed to support a client base rebalancing and leveraging of a very dynamic, transformational, digital landscape. DCs mantra remains the same: ROI is our DNA.\nGoing forward, there will be an emphasis on investor awareness as soon as normal business and normal trading has recommenced. DBMM intends to make significant strides in aggressively broadening its brand exposure. There are investors around the globe who understand the digital marketplace and its increasing influence on commercial decisions. DBMM will be targeting new shareholders in the public market through a global digital and traditional, integrated campaign run by DC, with third parties, as required for distribution.\nThe expectations for fiscal year 2023 is to return to normal trading first, and then move ahead to a scaled growth plan in multiple geographies. The result will benefit all stakeholders.\nThe Company resolved in 2015 to eliminate any consideration of using convertible debentures as a financing vehicle. Accordingly, the Company has not issued convertible debentures since 2015.\nAdditionally, we have demonstrated our adherence to such philosophy by renegotiating its obligations with lenders at fixed settlement amounts with no conversion terms. Furthermore, such renegotiations lead to the derecognition of derivative liabilities overhanging our balance sheet. The Company intends to continue its debt negotiation and modification program.\nThis has been a successful strategy thus far:\nDuring fiscal year 2021 and so far in 2022, and to a lesser extent in fiscal 2020, we successfully reached agreements with certain lenders resulting in a gain on extinguishment for loans payable which amounted to the difference between the carrying value and the revised amount of the obligations. The gain on extinguishment of principal and accrued interest amounted to $169,837 and $57,802 during fiscal 2021 and 2020, respectively.\nWe also successfully reached an agreement with a holder of convertible debentures aggregating $249,800 to modify its terms. Such debentures are no longer convertible, are now non-interest bearing, and have been reclassified to loans payable. It also resulted in a decrease in derivative liabilities and an increase in additional paid-in capital of approximately $260,000 during fiscal 2021.\nLastly, in March 2022, we reached an agreement with a holder of convertible debentures to satisfy obligations aggregating $85,000 in consideration of 30 million shares of the Companys common stock.\nFiscal Year 2022\nWe had $9,000 in cash and our working capital deficiency amounted to approximately $5.9 million at August 31, 2022.\nDuring fiscal 2022, we used cash in our operating activities amounting to $389,000. Our cash used in operating activities was comprised of our net loss of $626,000 adjusted primarily for the following:\nChange in fair value of derivative liability of $201,000 and loss on extinguishment of debt of $83,000;\nAdditionally, the following variations in operating assets and liabilities during fiscal 2022 impacted our cash used in operating activity:\nIncrease in accounts payable, accrued expenses, accrued interest, and accrued compensation, of $362,000, resulting from a short fall in liquidity and capital resources.\nWe generated cash from financing activities of $389,000 which primarily consists of the proceeds from the issuance of loans payable.\nFiscal Year 2021\nWe had approximately $10,000 in cash and our working capital deficiency amounted to approximately $5.5 million at August 31, 2021.\nDuring fiscal 2021, we used cash in our operating activities amounting to approximately $437,000. Our cash used in operating activities was comprised of our net loss of approximately $701,000 adjusted primarily for the following:\nAccounts payable, accrued expenses, accrued interest, and accrued compensation, of approximately $444,000, resulting from a short fall in liquidity and capital resources, which is net of gain on extinguishment of debt of approximately $170,000.\nDuring fiscal 2021, we generated cash from financing activities of approximately $411,000 which primarily consists of the proceeds from demand notes payable of approximately $398,000.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared on a going concern basis. The financial statements do not reflect any adjustments that might result if The Company is unable to continue as a going concern.\nThe Company has outstanding loans and convertible notes payable aggregating $2.5 million at August 31, 2022 and doesnt have sufficient cash on hand to satisfy such obligations. The preceding raise substantial doubt about the ability of the Company to continue as a going concern. However, the Company generated proceeds of approximately $389,000 from financing activities during fiscal 2022. The Company also has a non-binding Commitment Letter from an investor of $250,000 which also includes a right of first refusal on additional capital raise up to $3 million which will contribute to satisfying such obligations and fund any potential cash flow deficiencies from operations for the foreseeable future.\nAccordingly, the accompanying consolidated financial statements have been prepared in conformity with U.S. GAAP, which contemplates continuation of the Company as a going concern and the realization of assets and satisfaction of liabilities in the normal course of business. The carrying amounts of assets and liabilities presented in the financial statements do not necessarily purport to represent realizable or settlement values. The financial statements do not include any adjustment that might result from the outcome of this uncertainty.\nRESULTS OF OPERATIONS\nComparison of Results for fiscal 2022 and 2021\nFor the Years Ended\nIncrease/\nIncrease/\n(Decrease)\n(Decrease)\nAugust 31, 2022\nAugust 31, 2021\n$\n%\nSALES\n$ 225,842\n$ 171,712\n$ 54,130\n%\nCOST OF SALES\n131,272\n167,669\n(36,397\n)\n%\nGROSS PROFIT\n94,570\n4,043\n90,527\n%\nCOSTS AND EXPENSES\nSales, general and administrative\n553,042\n557,429\n(4,387\n)\n%\nTOTAL OPERATING (GAIN) EXPENSES\n553,042\n557,429\n(4,387\n)\n%\nOPERATING GAIN (LOSS)\n(458,472\n)\n(553,386\n)\n94,914\n%\nOTHER (INCOME) EXPENSE\nInterest expense\n384,615\n327,271\n57,334\n%\nOther income\n(98,265\n)\n-\n98,265\nNM\nLoss (gain) on extinguishment of debt\n82,845\n(169,837\n)\n252,682\nNM\nChange in fair value of derivative liability\n(201,239\n)\n(9,170\n)\n192,069\nNM\nTOTAL OTHER EXPENSE\n167,956\n148,264\n19,692\n%\nNET LOSS\n$ (626,428\n)\n$ (701,650\n)\n$ 75,222\n%\nNM: not meaningful\nWe currently generate revenue through our Pay-Per-Click Advertising, Search Engine Marketing, Search Engine Optimization Services, Web Design, Social Media, Digital analytics and Advisory Services.\nOur primary sources of revenue are Advisory Services (including Web design) and Per-Click Advertising which amounted to 59% and 36% of our revenues, respectively, during fiscal 2022 and 54% and 38%, respectively, during fiscal 2021.\nRevenue is recognized upon transfer of control of promised or services to customers in an amount that reflects the consideration the Company expect to receive in exchange for those services. The Company enter into contracts that can include various combinations of services, which are generally capable of being distinct and accounted for as separate performance obligations. Revenue is recognized net of any taxes collected from customers, which are subsequently remitted to governmental authorities.\nGeopolitical conflicts and uncertainties as well as risks of recession, high inflation alongside energy costs, and interest rate rises and means global conditions remain downbeat going into 2023.\nOur revenues increased during fiscal 2022 when compared to the prior year, primarily as a result of increased advisory services revenues.\nCost of sales during fiscal 2022 decreased when compared to the prior year, primarily from streamlined service delivery process in service delivery.\nThe general and administrative costs during fiscal 2022, when compared to the prior year, is at comparable levels.\nThe increase in interest expense, which include interest accrued on certain notes and loans, is primarily due to greater weighted average interest-bearing debt obligations.\nAdditionally, the Companys loss or gain on extinguishment of debt is a function of the terms at which we can settle our obligations and the fair value of the stock price at the measurement date.\nThe increase in change of fair value of derivative liability during fiscal 2022 when compared to the prior year is primarily a function of lower volatility during fiscal 2022, which is one of the primary assumptions in computing the fair value of such liability.\nThe other income reflects the recognition of tax credits related to expenses incurred in the UK. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nAs a smaller reporting company, as defined by Rule 10(f)(1) of Regulation S-K, the Company is not required to provide this information. ITEM 8. CONSOLIDATED FINANCIAL STATEMENTS\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID 2738)\nConsolidated Balance Sheets as of August 31, 2022 and 2021\nConsolidated Statements of Operations and Comprehensive Loss for the years ended August 31, 2022 and 2021\nConsolidated Statements of Changes in Stockholders Deficit for the years ended August 31, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended August 31, 2022 and 2021\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Digital Brand Media & Marketing Group, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Digital Brand Media & Marketing Group, Inc. (the Company) as of August 31, 2022 and 2021, and the related consolidated statements of operations and comprehensive loss, changes in stockholders deficit, and cash flows for each of the years in the two-year period ended August 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended August 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has suffered net losses from operations and has a net capital deficiency, which raises substantial doubt about its ability to continue as a going concern. Managements plans regarding those matters are discussed in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB .\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and the significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinion on the critical audit matters or on the accounts or disclosures to which they relate.\nAs discussed in Note 7 to the financial statements, the company has a derivative liability due to a tainted equity environment.\nTo evaluate the appropriateness of the fair value determined by management, we examined and evaluated the inputs management used in calculating the fair value of the stock-based compensation. To evaluate the appropriateness of the estimates used by the derivative specialist, we examined and evaluated the inputs the specialist used in calculating the value of the derivatives.\n/s/ M&K CPAS, PLLC\nM&K CPAS, PLLC\nWe have served as the Companys auditor since 2020\nHouston, TX\nNovember 29, 2022\nDIGITAL BRAND MEDIA & MARKETING GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nAugust 31,\nAugust 31,\nASSETS\nCURRENT ASSETS\nCash\n$ 9,364\n$ 9,787\nAccounts receivable, net\n20,383\n16,251\nPrepaid expenses and other current assets\nTotal current assets\n30,217\n26,508\nProperty and equipment - net\n1,420\n1,420\nTOTAL ASSETS\n$ 31,637\n$ 27,928\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCURRENT LIABILITIES\nAccounts payable and accrued expenses\n$ 799,720\n$ 657,275\nAccrued interest\n890,708\n643,331\nAccrued compensation\n1,377,136\n1,439,886\nDerivative liability\n281,932\n506,360\nLoans payable, net\n1,945,071\n1,648,248\nOfficers loans payable\n79,169\n89,709\nConvertible debentures, net\n546,571\n590,991\n5,920,307\n5,575,800\nLoan payable, net of short-term portion\n34,360\n46,192\nTOTAL LIABILITIES\n5,954,667\n5,621,992\nSTOCKHOLDERS' DEFICIT\nPreferred stock, Series 1, par value .001; authorized 2,000,000\nshares; 1,995,185, and 1,995,185 shares issued and outstanding\n1,995\n1,995\nPreferred stock, Series 2, par value .001; authorized 2,000,000\nshares; 0 and 0 shares issued and outstanding\n-\n-\nCommon stock, par value .001; authorized 2,000,000,000\nshares; 787,718,631, and 757,718,631, shares issued and outstanding\n787,718\n757,718\nAdditional paid in capital\n9,666,590\n9,528,590\nOther comprehensive loss\n93,478\n(35,984\n)\nAccumulated deficit\n(16,472,811\n)\n(15,846,383\n)\nTOTAL STOCKHOLDERS' DEFICIT\n$ (5,923,030\n)\n$ (5,594,064\n)\nTOTAL LIABILITIES AND STOCKHOLDERS' DEFICIT\n$ 31,637\n$ 27,928\nSee Notes to Consolidated Financial Statements\nDIGITAL BRAND MEDIA & MARKETING GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME (LOSS)\nFor the year ended\nAugust 31, 2022\nAugust 31, 2021\nREVENUES\n$ 225,842\n$ 171,712\nCOST OF REVENUES\n131,272\n167,669\nGROSS PROFIT (LOSS)\n94,570\n4,043\nCOSTS AND EXPENSES\nSales, general and administrative\n553,042\n557,429\nTOTAL OPERATING EXPENSES\n553,042\n557,429\nOPERATING LOSS\n(458,472\n)\n(553,386\n)\nOTHER (INCOME) EXPENSE\nInterest expense\n384,615\n327,271\nOther income\n(98,265\n)\n-\nLoss (gain) on extinguishment of debt\n82,845\n(169,837\n)\nChange in fair value of derivative liability\n(201,239\n)\n(9,170\n)\nTOTAL OTHER (INCOME) EXPENSES\n167,956\n148,264\nNET LOSS\n$ (626,428\n)\n$ (701,650\n)\nOTHER COMPREHENSIVE INCOME (LOSS)\nForeign exchange translation\n129,462\n(19,197\n)\nCOMPREHENSIVE LOSS\n(496,966\n)\n(720,847\n)\nNET LOSS PER SHARE\nBasic and diluted\n$ (0.00\n)\n$ (0.00\n)\nWEIGHTED AVERAGE NUMBER OF SHARES\nBasic and diluted\n771,280,275\n757,718,631\nSee Notes to Consolidated Financial Statements\nDIGITAL BRAND MEDIA & MARKETING GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS' DEFICIT\nFor the Year Ended August 31,\nSeries 1\nPreferred Stock\nShares, beginning and end of period\n1,995,185\n1,995,185\nPreferred Stock\nBalance, beginning and end of period\n$ 1,995\n$ 1,995\nSeries 2\nPreferred Stock\nShares, beginning and end of period\n-\n-\nPreferred Stock\nBalance, beginning and end of period\n$ -\n$ -\nCommon Stock\nShares, beginning of period\n757,718,631\n757,718,631\nIssuance of shares pursuant to satisfaction of convertible debt obligations\n30,000,000\n-\nShares, end of period\n$ 787,718,631\n$ 757,718,631\nBalance, beginning of period\n$ 757,718\n$ 757,718\nIssuance of shares pursuant to satisfaction of convertible debt obligations\n30,000\nBalance, end of period\n$ 787,718\n$ 757,718\nAdditional paid-in capital\nBalance, beginning of period\n$ 9,528,590\n$ 9,270,444\nReclassification of liability contracts from liability to equity contracts\n-\n258,146\nIssuance of shares pursuant to satisfaction of convertible debt obligations\n138,000\n-\nBalance, end of period\n$ 9,666,590\n$ 9,528,590\nOther Comprehensive Income (Loss)\nBalance, beginning of period\n$ (35,984\n)\n$ (16,787\n)\nOther comprehensive income (loss)\n129,462\n(19,197\n)\nBalance, end of period\n$ 93,478\n$ (35,984\n)\nAccumulated Deficit\nBalance, beginning of period\n$ (15,846,383\n)\n$ (15,144,733\n)\nNet loss\n(626,428\n)\n(701,650\n)\nBalance, end of period\n$ (16,472,811\n)\n$ (15,846,383\n)\nTotal Stockholders' Deficit\n$ (5,923,030\n)\n$ (5,594,064\n)\nSee Notes to Consolidated Financial Statements\nDIGITAL BRAND MEDIA & MARKETING GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Year Ended\nAugust 31,\nAugust 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$ (626,428\n)\n$ (701,650\n)\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation\n-\nChange in fair value of derivative liability\n(201,239\n)\n(9,170\n)\nLoss (gain) on extinguishment of debt\n82,845\n(169,837\n)\nChanges in operating assets and liabilities:\nAccounts receivable\n(7,198\n)\n(386\n)\nAccounts payable and accrued expenses\n160,626\n214,790\nAccrued interest\n264,924\n225,773\nAccrued compensation\n(62,750\n)\n3,200\nNET CASH USED IN OPERATING ACTIVITIES\n(389,220\n)\n(436,722\n)\nCASH FLOWS FROM INVESTING ACTIVITIES\nPurchase of equipment\n-\n-\nNET CASH USED IN INVESTING ACTIVITIES\n-\n-\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from loan payable\n399,202\n398,497\nOfficer loans payable\n(7,601\n)\n12,240\nPrincipal repayments loans payable\n(2,712\n)\n-\nNET CASH PROVIDED BY FINANCING ACTIVITIES\n388,889\n410,737\nEFFECT OF VARIATION OF EXCHANGE RATE OF CASH\nHELD IN FOREIGN CURRENCY\n(92\n)\n1,311\nNET INCREASE/(DECREASE) IN CASH\n(423\n)\n(24,674\n)\nCASH - BEGINNING OF PERIOD\n9,787\n34,461\nCASH - END OF PERIOD\n9,364\n9,787\nSupplemental disclosures of cash flow information:\nCash paid for interest\n$ -\n$ -\nCash paid for taxes\n$ -\n$ -\nNon-cash investing and financing activities:\nIssuance of shares pursuant to satisfaction of convertible debt obligations\n$ 64,137\n$ -\nReclassification of liability contracts\n$ 23,189\n$ 258,146\nSee Notes to Consolidated Financial Statements\nDIGITAL BRAND MEDIA & MARKETING GROUP, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION, BASIS OF PRESENTATION AND GOING CONCERN\nNature of Business and History of the Company\nDigital Brand Media & Marketing Group, Inc. (The Company) is an OTC:PK listed company. The Company was organized under the laws of the State of Florida on September 29, 1998.\nThe Company strategically focuses on developing the business of its wholly owned and revenue generating online marketing services company, Digital Clarity. With deep DNA in its operating market, blending the services of an experienced professional workforce leveraging a technology offering positions the Company in a strong, forward looking structure. Digital Clarity operates in the growing area of digital marketing that helps companies make the most of the digital economy focusing on areas such as Search Engine Marketing (Google, Yahoo! & Bing), Social Media (Twitter, Facebook & LinkedIn) and Internet Strategy Planning including Design, Analytics and Mobile Marketing.\nFollowing the acquisition of Digital Clarity in 2011 the Company has been honing its business model to be the differentiating service provider in digital marketing space to its clients and prospective business as DBMM grows into one of the leaders in the industry going forward.\nToday, DBMM Group crafts, designs and executes digital marketing strategies across multiple ad platforms and social media networks for a broad array of clients to help each of them establish a uniform brand identity across the digital universe. The product offering is a unique value proposition of intelligent analytics provided by an experienced digital marketing and technology team. Therefore, DBMM Group is a blend of data, strategy and creative execution.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared on a going concern basis. The financial statements do not reflect any adjustments that might result if the Company is unable to continue as a going concern.\nThe Company has outstanding loans and convertible notes payable aggregating $2.5 million at August 31, 2022 and doesnt have sufficient cash on hand to satisfy such obligations. The preceding raise substantial doubt about the ability of the Company to continue as a going concern. However, the Company generated proceeds of approximately $389,000 from financing activities during fiscal 2022. The Company also has a non-binding Commitment Letter from an investor of $250,000 which also includes a right of first refusal on additional capital raise up to $3 million which will contribute to satisfying such obligations and fund any potential cash flow deficiencies from operations for the foreseeable future.\nAccordingly, the accompanying consolidated financial statements have been prepared in conformity with U.S. GAAP, which contemplates continuation of the Company as a going concern and the realization of assets and satisfaction of liabilities in the normal course of business. The carrying amounts of assets and liabilities presented in the financial statements do not necessarily purport to represent realizable or settlement values. The financial statements do not include any adjustment that might result from the outcome of this uncertainty.\nNOTE 2 - SIGNIFICANT ACCOUNTING POLICIES\nBasis of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiary Stylar Ltd (DBA Digital Clarity). All significant inter-company transactions are eliminated.\nCash and Cash Equivalents\nCash and cash equivalents consist primarily of cash in banks. The Company considers cash equivalents to include all highly liquid investments with original maturities of three months or less to be cash equivalents. The Company had no cash equivalents as of August 31, 2022 or 2021.\nAccounts Receivable and Allowance for Doubtful Accounts\nAccounts receivable are recorded at the invoiced amount and do not bear interest. Accounts receivable are presented net of allowance for doubtful accounts.\nThe Company has a policy of reserving for uncollectible accounts based on its best estimate of the amount of probable credit losses in its existing accounts receivable. The Company periodically reviews its accounts receivable to determine whether an allowance is necessary based on an analysis of past due accounts and other factors that may indicate that the realization of an account may be in doubt. Account balances deemed to be uncollectible are charged to the bad debt expense after all means of collection have been exhausted and the potential for recovery is considered remote. At August 31, 2022 and 2021, the Company recognized $0 as the allowance for doubtful accounts.\nProperty and Equipment\nProperty and equipment are stated at cost, less accumulated depreciation. Depreciation is provided using the straight-line method over the estimated useful lives of the related assets (primarily three to five years).\nRevenue Recognition\nRevenue is recognized upon transfer of control of promised or services to customers in an amount that reflects the consideration the Company expect to receive in exchange for those services. The Company enter into contracts that can include various combinations of services, which are generally capable of being distinct and accounted for as separate performance obligations. Revenue is recognized net of any taxes collected from customers, which are subsequently remitted to governmental authorities.\nNature of Services\nThe Company generally provides its services to companies with international exposure, primarily located in Europe but with international exposure. The Company generally provides its services ratably over the terms of the contract and bills such services at a monthly fixed rate. Some of the services are billed quarterly. The Companys services are sold without guarantees.\nSignificant Judgments\nOur contracts with customers sometimes often include promises to provide multiple services to a customer. Determining whether services are considered distinct performance obligations that should be accounted for separately versus together may require significant judgment.\nJudgment is required to determine Standalone Selling Price (SSP) for each distinct performance obligation. The Company uses a single amount to estimate SSP for items that are not sold separately, including set-up services, monthly search advertising services, and monthly optimization and management.\nContract Balances\nTiming of revenue recognition may differ from the timing of invoicing to customers. The Company records a receivable when revenue is recognized prior to invoicing, or unearned revenue when revenue is recognized subsequent to invoicing.\nThe allowance for doubtful accounts reflects our best estimate of probable losses inherent in the accounts receivable balance. We determine the allowance based on known troubled accounts, historical experience, and other currently available evidence.\nAdvertising Costs\nAdvertising costs, which are included in cost of sales and general and administrative expenses in the accompanying statements of operations, are expensed when incurred. Total advertising expenses amounted to $0 and $10,895, during fiscal 2022 and 2021, respectively.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, and disclosure of contingent assets and liabilities, at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Included in these estimates are assumptions about the collection of its accounts receivable, converted amount of cash denominated in a foreign currency, and estimated amounts of cash, the derivative liability could settle, if not in common shares. Actual results could differ from those estimates.\nIncome Taxes\nThe Company follows the provisions of the ASC 740 -10 related to, Accounting for Uncertain Income Tax Positions. When tax returns are filed, it is highly certain that some positions taken would be sustained upon examination by the taxing authorities, while others are subject to uncertainty about the merits of the position taken or the amount of the position that would be ultimately sustained. In accordance with the guidance of ASC 740-10, the benefit of a tax position is recognized in the financial statements in the period during which, based on all available evidence, management believes it is more likely than not that the position will be sustained upon examination, including the resolution of appeals or litigation processes, if any. Tax positions taken are not offset or aggregated with other positions. Tax positions that meet the more-likely-than-not recognition threshold are measured as the largest amount of tax benefit that is more than 50 percent likely of being realized upon settlement with the applicable taxing authority. The portion of the benefits associated with tax positions taken that exceeds the amount measured as described above should be reflected as a liability for uncertain tax benefits in the accompanying balance sheet along with any associated interest and penalties that would be payable to the taxing authorities upon examination. The Company believes its tax positions are all highly certain of being upheld upon examination. As such, the Company has not recorded a liability for uncertain tax benefits.\nThe Company has adopted ASC 740-10-25 Definition of Settlement, which provides guidance on how an entity should determine whether a tax position is effectively settled for the purpose of recognizing previously unrecognized tax benefits and provides that a tax position can be effectively settled upon the completion of an examination by a taxing authority without being legally extinguished. For tax positions considered effectively settled, an entity would recognize the full amount of tax benefit, even if the tax position is not considered more likely than not to be sustained based solely on the basis of its technical merits and the statute of limitations remains open.\nEarnings (loss) per common share\nThe Company utilizes the guidance per FASB Codification ASC 260 \"Earnings Per Share\". Basic earnings per share is calculated on the weighted effect of all common shares issued and outstanding and is calculated by dividing net income available to common stockholders by the weighted average shares outstanding during the period. Diluted earnings per share, which is calculated by dividing net income available to common stockholders by the weighted average number of common shares used in the basic earnings per share calculation, plus the number of common shares that would be issued assuming conversion of all potentially dilutive securities outstanding, is not presented separately as it is anti- dilutive. Such securities have been excluded from the per share computations as of August 31, 2022 and 2021.\nDerivative Liabilities\nThe Company assessed the classification of its derivative financial instruments as of August 31, 2021, which consist of convertible instruments and rights to shares of the Companys common stock and determined that such derivatives meet the criteria for liability classification under ASC 815.\nASC 815 generally provides three criteria that, if met, require companies to bifurcate conversion options from their host instruments and account for them as free-standing derivative financial instruments. These three criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument subject to the requirements of ASC 815. ASC 815 also provides an exception to this rule when the host instrument is deemed to be conventional, as described.\nDuring fiscal 2022 and 2021, the Company had notes payable outstanding in which the conversion rate was variable and undeterminable. Accordingly, the Company has recognized a derivative liability in connection with such instruments. The Company uses judgment in determining the fair value of derivative liabilities at the date of issuance at every balance sheet thereafter and in determining which valuation is most appropriate for the instrument (e.g., Binomial method), the expected volatility, the implied risk-free interest rate, as well as the expected dividend rate.\nFair Value of Financial Instruments\nEffective January 1, 2008, the Company adopted FASB ASC 820-Fair Value Measurements and Disclosures, or ASC 820, for assets and liabilities measured at fair value on a recurring basis. ASC 820 establishes a common definition for fair value to be applied to existing generally accepted accounting principles that require the use of fair value measurements establishes a framework for measuring fair value and expands disclosure about such fair value measurements. The adoption of ASC 820 did not have an impact on the Companys financial position or operating results but did expand certain disclosures.\nASC 820 defines fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Additionally, ASC 820 requires the use of valuation techniques that maximize the use of observable inputs and minimize the use of unobservable inputs. These inputs are prioritized below.\nLevel 1\nObservable inputs such as quoted market prices in active markets for identical assets or liabilities.\nLevel 2\nObservable market-based inputs or unobservable inputs that are corroborated by market data.\nLevel 3\nUnobservable inputs for which there is little or no market data, which require the use of the reporting entitys own assumptions.\nThe Company did not have any Level 2 or Level 3 assets or liabilities as of August 31, 2022, and 2021, with the exception of its derivative liability which are valued based on Level 3 inputs.\nCash is considered to be highly liquid and easily tradable as of August 31, 2022 and 2021 and therefore classified as Level 1 within our fair value hierarchy.\nIn addition, FASB ASC 825-10-25 Fair Value Option, or ASC 825-10-25, was effective January 1, 2008. ASC 825-10-25 expands opportunities to use fair value measurements in financial reporting and permits entities to choose to measure many financial instruments and certain other items at fair value. The Company did not elect the fair value options for any of its qualifying financial instruments.\nConvertible Instruments\nThe Company evaluates and accounts for conversion options embedded in its convertible instruments in accordance with professional standards for Accounting for Derivative Instruments and Hedging Activities.\nProfessional standards generally provide three criteria that, if met, require companies to bifurcate conversion options from their host instruments and account for them as free-standing derivative financial instruments. These three criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument. Professional standards also provide an exception to this rule when the host instrument is deemed to be conventional as defined under professional standards as The Meaning of Conventional Convertible Debt Instrument.\nThe Company accounts for convertible instruments (when it has determined that the embedded conversion options should not be bifurcated from their host instruments) in accordance with professional standards when Accounting for Convertible Securities with Beneficial Conversion Features, as those professional standards pertain to Certain Convertible Instruments. Accordingly, the Company records, when necessary, discounts to convertible notes for the intrinsic value of conversion options embedded in debt instruments based upon the differences between the fair value of the underlying common stock at the commitment date of the note transaction and the effective conversion price embedded in the note. Debt discounts under these arrangements are amortized over the term of the related debt to their earliest date of redemption. The Company also records when necessary deemed dividends for the intrinsic value of conversion options embedded in preferred shares based upon the differences between the fair value of the underlying common stock at the commitment date of the note transaction and the effective conversion price embedded in the note.\nASC 815-40 provides that, among other things, generally, if an event is not within the entitys control could or require net cash settlement, then the contract shall be classified as an asset or a liability.\nStock Based Compensation\nWe account for the grant of stock options and restricted stock awards in accordance with ASC 718, Compensation-Stock Compensation. ASC 718 requires companies to recognize in the statement of operations the grant-date fair value of stock options and other equity-based compensation.\nForeign Currency Translation\nAssets and liabilities of subsidiaries operating in foreign countries are translated into U.S. dollars using either the exchange rate in effect at the balance sheet date or historical rate, as applicable. Results of operations are translated using the average exchange rates prevailing throughout the year. The effects of exchange rate fluctuations on translating foreign currency assets and liabilities into U.S. dollars are included in a separate component of stockholders equity (accumulated other comprehensive loss), while gains and losses resulting from foreign currency transactions are included in operations.\nBusiness Combinations\nIn accordance with Accounting Standards Codification 805, \"Business Combinations\" (\"ASC 805\") the Company records acquisitions under the purchase method of accounting, under which the acquisition purchase price is allocated to the assets acquired and liabilities assumed based upon their respective fair values. The Company utilizes management estimates and, in some instances, may require an independent third-party valuation firm to assist in determining the fair values of assets acquired, liabilities assumed, and contingent consideration granted. Such estimates and valuations require us to make significant assumptions, including projections of future events and operating performance.\nCustomer Concentration\nFour and three of the Company's customers accounted for approximately 94% and 94% of its revenues during fiscal 2022 and 2021, respectively.\nRecently Issued Accounting Pronouncements\nManagement does not believe that any other recently issued, but not yet effective, accounting standards if currently adopted would have a material effect on the accompanying consolidated financial statements.\nNOTE 3 - PROPERTY AND EQUIPMENT\nProperty and equipment consisted of the following:\nEstimated Life\nComputer and office equipment\n3 to 5 years\n$ 23,920\n$ 23,920\nLess: Accumulated depreciation\n(22,500\n)\n(22,500\n)\n$ 1,420\n$ 1,420\nDepreciation expense amounted to $0 and $558 during fiscal 2022 and 2021, respectively.\nNOTE 4 - LOANS PAYABLE\nAugust 31,\nLoans payable\n$ 1,979,431\n$ 1,694,440\nThe loans payables are generally due on demand and have not been called, are unsecured, and are bearing interest at a range of 0-12%., with the exception of one loan payable to a financial institution. Such loan, which amounted to $55,200 at August 31, 2021 bears interest rate at 2.5%, is unsecured, matures in November 2027 with principal and interest payable monthly starting in November 2021. This loan is part of a Bounce Back Loan Scheme from the UK Government.\nDuring fiscal 2021, the Company successfully reached agreements with certain lenders resulting in gain on extinguishment for loans payable which amounted to the difference between the carrying value and the revised amount of the obligations. The gain on extinguishment of principal and accrued interest amounted to $169,837 during fiscal 2021.\nThe company may have to provide alternative consideration (which may be in cash, fixed number of shares or other financial instruments) up to amounts accrued to satisfy its fixed obligations under certain unsecured loans payable. The consideration hasnt been issued yet and is included in accrued expenses and interest expense and were valued based on the fair value of the consideration at issuance.\nThe aggregate schedule maturities of the Companys loans payable outstanding as of August 31, 2021 are as follows:\nYear ended August 31,\n$\n1,945,071\n10,593\n11,267\n11,983\n$\n1,979,431\nNOTE 5 - CONVERTIBLE DEBENTURES\nAt August 31, 2022, and August 31, 2021 convertible debentures consisted of the following:\nAugust 31,\nConvertible notes payable\n$ 546,571\n$ 590,991\nThe convertible debentures matured in 2015, and bear interest at ranges between 6% and 15%. The convertible debentures are convertible at ratios varying between 45% and 50% of the closing price at the date of conversion through, at its most favorable terms for the holders, the average of the three lowest closing bids for a period of 5-30 days prior to conversion.\nThe Company successfully reached an agreement with a holder of convertible debentures aggregating $249,800 to modify its terms during fiscal 2021. Such debentures are no longer convertible, non-interest bearing, and have been reclassified to loans payable.\nIn March 2022, the Company reached an agreement with a holder of convertible debentures to satisfy obligations aggregating $85,000 in consideration of 30,000,000 shares of the Companys common stock, which generated a loss on extinguishment of debt of $82,845.\nNo convertible debentures have been issued since 2015.\nNOTE 6 - OFFICERS LOANS PAYABLE\nAugust 31,\nOfficers loans payable\n$ 79,169\n$ 89,709\nThe loans payables are due on demand, are unsecured, and are non-interest bearing.\nNOTE 7 - DERIVATIVE LIABILITIES\nThe Company accounts for the embedded conversion features included in its convertible instruments as derivative liabilities. At each measurement date, the fair value of the embedded conversion features was based on the lattice binomial method using the following assumptions:\nYears Ended August 31\nEffective Exercise price\n0.0016 - 0.0025\n0.001 - 0.0076\nEffective Market price\n0.0031\n0.0076\nVolatility\n138.63 %\n89.61 %\nRisk-free interest\n3.5 %\n.07 %\nTerms\n365 days\n365 days\nExpected dividend rate\n%\n%\nChanges in the derivative liabilities during fiscal 2022 and 2021 are as follows:\nBalance at September 1, 2020\n$ 773,676\nReclassification of liability contracts\n(258,146\n)\nChanges in fair value of derivative liabilities\n(9,170\n)\nBalance, August 31, 2021\n$ 506,360\nReclassification of liability contracts\n(23,189\n)\nChanges in fair value of derivative liabilities\n(201,239\n)\nBalance, August 31, 2022\n$ 281,932\nNOTE 8 - ACCRUED COMPENSATION\nThe Company owes $1,377,136 and $1,439,886 as of August 31, 2022 and 2021, respectively, in accrued compensation and expenses to certain directors and consultants. The amounts are non-interest bearing.\nNOTE 9 - COMMON STOCK AND PREFERRED STOCK\nPreferred Stock- Series 1 and 2\nThe designation of the Preferred Stock- Series 1 is as follows: Authorized 2,000,000 shares, par value of $0.001. One share of the Companys Preferred Stock- Series is convertible into 53.04 shares of the Companys common stock, at the holders option and with the Companys acquiescence, and has three votes per share.\nThe designation of the Preferred Stock- Series 2 is as follows: Authorized 2,000,000 shares, par value of $0.001. One share of the Companys Preferred Stock- Series is convertible into one share of the Companys common stock, at the holders option and with the Companys acquiescence, and has no voting rights.\nCommon Stock\nThe Authorized Shares increased to 2,000,000,000 in April 4, 2016.\nNOTE 10 - OTHER INCOME\nThe Company received tax credits of $98,265 related to expenses incurred in the United Kingdom local governmental entity during fiscal 2022.\nNOTE 11 - COMMITMENTS AND CONTINGENCIES\nLeases\nThe Company leases its facilities under non-cancellable operating leases which are renewable monthly as it is evaluating larger quarters. The leases have monthly base rents. The latest monthly base rent for the Companys facilities ranges is less than $1,000.\nTotal rental expense amounted to $7,063, and $18,402 during fiscal 2022 and 2021, respectively.\nConsulting Agreement\nThe annual compensation of Linda Perry is $150,000 for her role as a consultant and as Executive Director for US ( as well as Principal Executive and Financial Officer) interfaces to provide oversight regarding external regulatory reporting requirements. In addition, Ms. Perry is the lead executive for capital funding requirements and business development. The agreement has a rolling three-year term through September 2025.\nLegal Matters\nFrom time to time, the Company has become or may become involved in certain lawsuits and legal proceedings which arise in the ordinary course of business. The Company intends to vigorously defend its positions. However, litigation is subject to inherent uncertainties and an adverse result in those or other matters may arise from time to time that may harm its financial position, or our business and the outcome of these matters cannot be ultimately predicted.\nNOTE 12 - INCOME TAXES\nFor the years ended August 31, 2022, and 2021, the benefit for income taxes differed from the amounts computed by applying the statutory federal income tax rate at which rate the tax benefits is expected to occur. The reconciliation is as follows:\nYears Ended August 31\nBenefit computed at statutory rate\n$ 132,000\n$ 147,000\nState tax (benefit), net of federal affect\n27,000\n30,000\nPermanent differences (primarily change in fair value of derivative liability)\n(51,000\n)\n2,000\nIncrease in valuation allowance\n(108,000\n)\n(179,000\n)\nNet income tax benefit\n$ -\n$ -\nThe Company has net operating loss carry-forward for income tax totaling purposes approximately $6.4 million at August 31, 2021. A significant portion of these carryforwards is subject to annual limitations due to equity structure shifts or owner shifts involving five percent shareholders (as defined in the Internal Revenue Code) which results in a more than fifty percent change in ownership.\nThe net deferral tax asset is as follows:\nYears Ended August 31\nNet operating loss carry-forward\n$ 1,638,000\n$ 1,514,000\nAccrued compensation\n349,000\n364,000\nValuation allowance\n(1,987,000\n)\n(1,878,000\n)\nNet deferred tax asset\n$ -\n$ -\nNOTE 13 - FOREIGN OPERATIONS\nAs of August 31, 2022, all of our revenues and a majority of our assets are associated with subsidiaries located in the United Kingdom. Assets and revenues as of and for the respective periods were as follows:\nUnited States\nGreat Britain\nTotal\nRevenues\n$ -\n$ 225,842\n$ 225,842\nTotal revenues\n-\n225,842\n225,842\nIdentifiable assets at August 31, 2022\n9,170\n22,467\n31,637\nAs of August 31, 2019, a majority of revenues and assets are associated with subsidiaries located in the United Kingdom. Assets and revenues for the year ended August 31, 2021, were as follows:\nUnited States\nGreat Britain\nTotal\nRevenues\n$ -\n$ 171,712\n$ 171,712\nTotal revenues\n-\n171,712\n171,712\nIdentifiable assets at August 31, 2021\n9,532\n18,576\n27,928\nNOTE 14 - SUBSEQUENT EVENTS\nThe Company has analyzed its operations subsequent to August 31, 2022, through the date these financial statements were issued, and has determined that it does not have any material subsequent events requiring disclosure or accrual. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nThere are not currently and have not been any disagreements between us and our accountants on any matter of accounting principles, practices or financial statement disclosure.   ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nExecutive Officers and Directors\nThe following table sets forth certain information, as of August 31, 2022, with respect to our directors and executive officers.\nDirectors serve until the next annual meeting of the stockholders; until their successors are elected or appointed and qualified, or until their prior resignation or removal. Officers serve for such terms as determined by our board of directors. Each officer holds office until such officers successor is elected or appointed and qualified or until such officers earlier resignation or removal. No family relationships exist between any of our present directors and officers.\nName\nPosition\nReggie James\nChief Operating Officer, Senior Vice President and Executive Director\nLinda Perry\nPrincipal Executive Officer, Principal Financial Officer and Executive Director\nThe following is a brief account of the business experience of each of our Directors and Executive Officers:\nReggie James, As of April 1, 2011, Mr. Reggie James has served as Senior Vice President of Marketing and Communications and Executive Director. Mr. James also is the Managing Director of Digital Clarity. In 2013, he was appointed Co-Chief Operating Officer, and in August 2021, Chief Operating Officer. Mr. James has been involved in the commercial element of the internet since its inception and has been instrumental in driving forward business models that are common place today.\nMr. James is the founder of Digital Clarity, a leading Digital Advertising Agency and a wholly owned business of DBMM. The Company helps major brands and medium sized companies take advantage of the digital economy focusing on areas such as Search Engine Marketing (Google, Yahoo! & Bing), Social Media (Twitter, Facebook & LinkedIn) and Internet Strategy Planning including Design, Analytics and Mobile Marketing. Mr. James launched the European division of a later VoIP technology company that became the first dot com to list on the Singapore Stock Exchange later acquired by Spice Communications. Subsequently, Spice was acquired by Idea Cellular, the 3rd largest mobile services operator in India. Mr. James is also the co-founder of an internet analytics technology software house as well as shareholder in an AIM listed marketing services company. AIM is the London Stock Exchanges international market for smaller growing companies. Previously, Mr. James was involved with publishing groups VNU & Ziff-Davis where he launched titles such as Management Consultancy and IT Week. Prior to launching Digital Clarity, Mr. James was part of the global sales team at leading search company AltaVista where he managed global brands such as Compaq and Hewlett Packard (HP). AltaVista was acquired by Yahoo! Inc.\nLinda Perry, Ms. Perry is currently Principal Executive Officer, Principal Financial Officer and an Executive Director. She has had an extensive career in global and entrepreneurial businesses. Ms. Perry consults to several companies globally and is industry agnostic. While living in Europe, she was the senior advisor to the Board of Directors of The Balli Group, where her role was to integrate the acquisition of Klockner & Co. The acquisition resulted in the creation of the worlds largest steel, multi-metal, distribution, and trading company. Prior to that, she was appointed a director and a member of the Executive Committee of Churchill Insurance Group, Plc., a division of the Credit Suisse Group. The Company was re-organized and sold within the industry for £2.3 billion GBP. She was a senior executive at ExxonMobil Corporation holding general management positions with global responsibility in finance, marketing, and organization (described as corporate governance, management succession and executive compensation.) The latter role was under the aegis of the Board of Directors, entitled Compensation, Organization and Executive Development Committee/COED, of which she was a member. Ms. Perry holds an MBA from Harvard University. She has been a visiting lecturer/professor at IMD, Lausanne, Switzerland, INSEAD, Fontainebleau, France and the Stern School of Business at New York University throughout her career.\nWe believe that all our directors are qualified to serve on our board of directors based on their experience and the diversity of background.\nBoard Committees\nWe currently have standing committees on our Board of Directors. The audit committee and nomination /compensation committee are listed below.\nAudit Committee\nWe have established an Audit Committee of the Board of Directors. The Audit Committee duties include a recommendation to our Board of Directors the engagement of independent auditors to audit our financial statements and to review our accounting and auditing principles. The audit committee will review the scope, timing and fees for the annual audit and the results of audit examinations performed by the internal auditors and independent public accountants, including their recommendations to improve the system of accounting and internal controls.\nNomination/Compensation Committee\nWe have established a Nomination/Compensation Committee of the Board of Directors. The Nomination/Compensation Committee reviews and approves our total remuneration, including compensation of executive officers. The Nomination/Compensation Committee will also administer our stock option plans and recommend and approve grants of stock options under such plans.\nCompensation of Directors\nAll directors are officers and their compensation are included on the summary compensation table (Item 11).\nCompliance with Section 16(A) of the Exchange Act\nOur common stock was registered pursuant to Section 12 of the Exchange Act during the fiscal years ended August 31, 2020 and 2019. Accordingly, our officers, directors and principal shareholders were subject to the beneficial ownership reporting requirements of Section 16(a) of the Exchange Act during each year.\nCode of Ethics\nOn December 1, 2004 we adopted a Code of Ethics that applies to our Principal Executive Officer, Principal Financial Officer, Principal Accounting Officer and Controller and to persons performing similar functions. A copy of our Code of Ethics was previously filed as an Exhibit to our annual report on Form 10-KSB for the year ended August 31, 2004. A copy of our Code of Ethics will be provided to any person requesting same without charge. To request a copy of our Code of Ethics please make written request to DBMM. ITEM 11. EXECUTIVE COMPENSATION\nSUMMARY COMPENSATION TABLE\nNone of our executive officers or employees received compensation in excess of $100,000 during the years ended August 31, 2022 or 2021, except as follows:\nName Principal Position\nFiscal Year Ended\nAugust 31,\n($)\nSalary\n($)\nBonus\n($)\nStock awards\n($)\nOption awards\n($)\nNonequity incentive\nplan compensation\n($)\nNonqualified deferred compensation earnings\n($)\nAll other\nCompensation\n($)\nTotal\nReggie James\n$\n208,572\n(1)\n-\n-\n-\n-\n-\n-\n$\n208,572\nExecutive Director\n$\n211,178\n(2)\n-\n-\n-\n-\n-\n-\n$\n211,178\nLinda Perry\n$\n150,000\n(3)\n-\n-\n-\n-\n-\n-\n$\n150,000\nExecutive Director\n$\n150,000\n(3)\n-\n-\n-\n-\n-\n-\n$\n150,000\n(1)\nFor the fiscal year ending August 31, 2022, Mr. James earned $ 208,572 of which $154,573 has been paid to Reggie James. $54,000 remains unpaid.\n(2)\nFor the fiscal year ending August 31, 2021, Mr. James earned $ 211,178 of which $157,178 has been paid to Reggie James. $54,000 remains unpaid.\n(3)\nFor the fiscal years ended August 31, 2022, and 2021, Ms. Perry earned $150,000 each year of which $0 has been paid, $300,000 remains unpaid.\nOPTION/SAR GRANTS IN LAST FISCAL YEAR\nNo stock appreciation rights were granted to the named executives during the fiscal years ended August 31, 2022 and 2021.\nLONG TERM INCENTIVE PLAN AWARDS\nNo long-term incentive plan awards to the named executive officers during the fiscal years ended August 31, 2022 and 2021.\nEMPLOYMENT CONTRACTS, TERMINATION OF EMPLOYMENT, AND CHANGE-IN-CONTROL ARRANGEMENTS\nIn April 2011 the Company agreed to compensate a Company Officer, Reggie James, for monthly remuneration of $4,500 for his duties as Senior Vice President and Executive Director of DBMM and Digital Clarity. Mr. James was appointed Co-Chief Operating Officer during fiscal year 2013, and in August, 2021 Chief Operating Officer.\nIn September 2010 the Company agreed to compensate a Company Officer, Linda Perry, for annual remuneration of $150,000 for her role as a consultant and as Executive Director. She also was appointed Principal Executive Officer and Principal Financial Officer, in October 2011, for US interface to provide oversight for external regulatory reporting requirements. In addition, Ms. Perry is lead executive for capital funding requirements and business development.\nREPORT ON REPRICING OF OPTIONS/SARS\nDuring the fiscal years ended August 31, 2022, and 2021 we did not adjust or amend the exercise price of any stock options or SARs. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth information with respect to the beneficial ownership of our common stock known by us as of August 31, 2022 by, (i) each of our directors, (ii) each of our executive officers, and (iii) all of our directors and executive officers as a group. The percentages in the table have been calculated on the basis of treating as outstanding for a particular person, all shares of our common stock outstanding on such date and all shares of our common stock issuable to such holder in the event of exercise of outstanding options, warrants, rights or conversion privileges owned by such person at said date which are exercisable within 60 days of such date. Except as otherwise indicated, the persons listed below have sole voting and investment power with respect to all shares of our common stock owned by them, except to the extent such power may be shared with a spouse.\nName of Beneficial Owner and/or Beneficially Own Shares of Restricted Common Stock percentage owned:\n(1) Reggie James*\n7,982,328\n1.01\n%\n(2) Linda Perry*\n7,972,579\n1.01\n%\nAll Directors and Executive Officers as a Group (2 persons)\n15.945,159\nThe officers as a group hold 1,200,000 Restricted Preferred Shares, under the designation terms of Preferred Stock-Series 1. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS\nNone. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nAudit Fees\nThe aggregate fees billed to us by our principal accountants for services rendered during fiscal 2022 and 2021 are set forth in the table below:\nAudit Fees (1)\n$ 35,375\n$ 34,500\n(1)\nAudit fees represent fees for professional services provided in connection with the audit of our annual financial statements and review of our quarterly financial statements and audit services provided in connection with other statutory or regulatory filings.\nAudit Related Fees. We incurred fees to our independent auditors of $-0- for audit related fees during fiscal years ended August 31, 2022, and 2021.\nTax and Other Fees. We incurred fees to our independent auditors of $-0- for tax and other fees during the fiscal years ended August 31, 2022, and 2021.\nAudit Committees Pre-Approval Practice.\nFor fiscal years ended August 31, 2022 and 2021, the Audit Committee pre-approved all audit and permissible non-audit services provided by our independent auditors.\nPART IV ITEM 15. EXHIBITS\nThe following Exhibits are being filed with this Annual Report on Form 10-K:\nExhibit Number\nDescription\n3.1(1)\nArticles of Incorporation of the Registrant, as amended.\n3.2(8)\nBy-laws of the Registrant, as amended.\n10.3(4)\nShare Exchange Agreement, dated March 20, 2007, by and among the Company, Atlantic Network Holdings Limited, New Media Television (Europe) Limited and the Outside Stockholders Listed on Exhibit A Thereto.\n10.1(5)\nShare Exchange Agreement, dated March 30, 2010, between Digital Brand Media & Marketing Group, Inc., and Cloud Channel Limited.\n10.2(5)\nRescission Resolution of Share Exchange Agreement, dated March 20, 2007, by and among Digital Brand Media & Marketing Group, Inc., Atlantic Network Holdings Limited, the Outside Stockholders Listed on Exhibit A thereto and New Media Television (Europe) Limited.\n10.3(5)\nShare purchase Agreement between Cloud Channel Limited and Bitemark MC Limited.\n10.4(5)\nShare purchase Agreement between Cloud Channel Limited and Stylar Limited.\n10.4(6)\nAmendment to Share Exchange Agreement, dated March 31, 2010, between Digital Brand Media & Marketing Group, Inc., and Cloud Channel Limited.\n10.5(6)\nAmendment to Share Purchase Agreement between Cloud Channel Limited and Bitemark MC Limited.\n10.6(6)\nAmendment to Share Purchase Agreement between Cloud Channel Limited and Stylar Limited.\n10.7(8)\nRescission Resolution of Share Exchange Agreement, dated March 31, 2010, between Digital Brand Media & Marketing Group, Inc. and Bitemark MC Limited\n10.8(9)\nAgreement to purchase LLC interests\n10.9(10)\nAmendment to agreement to purchase LLC interests\n10.10(11)\nMutual Rescission and Release\n14.1(3)\nCode of Ethics\n31.1*\nSection 302 Certification of Executive Director\n32.1*\nSection 906 Certification of Executive Director\n101.INS*\nInline XBRL Instance Document\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n(1) Previously filed as an exhibit to the Companys Registration Statement on Form SB-2 filed with the Commission on March 27, 2002.\n(3) Previously filed as an exhibit to the Companys Annual Report on Form 10-KSB for the year ended August 31, 2004.\n(4) Previously filed as an exhibit to the Companys Current Report on Form 8-K filed with the Commission on March 21, 2007.\n(5) Previously filed as an exhibit to the Companys Current Report on Form 8-KA filed with the Commission on April 9, 2010.\n(6) Previously filed as an exhibit to the Companys Current Report on Form 8-KA filed with the Commission on July 15, 2010.\n(8) Previously filed as an exhibit to the Companys Annual Report on Form 10-K for the year ended August 31, 2011.\n(9) Previously filed as an exhibit to the Companys Current Report on Form 8-K Filed with the Commission on June 12, 2012.\n(10) Previously filed as an exhibit to the Companys Annual Report on Form 10-K for the year ended August 31, 2012.\n(11) Previously filed as an exhibit to the Companys Quarterly Report on Form 10-Q for the quarter ended May 31, 2013.\n* Filed herewith\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDIGITAL BRAND MEDIA & MARKETING GROUP, INC.\nDate: November 29, 2022\nBy:\n/s/ Linda Perry\nPrincipal Executive Officer\nPrincipal Financial Officer\nExecutive Director\nIn accordance with the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: November 29, 2022\nBy:\n/s/ Linda Perry\nPrincipal Executive Officer\nPrincipal Financial Officer\nExecutive Director\nNONE false FY\n2021-09-01 2022-08-31\n2020-05-29\n2022-11-29\n2022-08-31\n2021-08-31\ndbmm:PreferredStockSeries1Member\n2022-08-31\ndbmm:PreferredStockSeries1Member\n2021-08-31\ndbmm:PreferredStockSeries2Member\n2022-08-31\ndbmm:PreferredStockSeries2Member\n2021-08-31\n2020-09-01 2021-08-31\ndbmm:PreferredStockSeries1Member us-gaap:PreferredStockMember\n2021-08-31\ndbmm:PreferredStockSeries1Member us-gaap:PreferredStockMember\n2020-08-31\ndbmm:PreferredStockSeries1Member us-gaap:PreferredStockMember\n2022-08-31\ndbmm:PreferredStockSeries2Member us-gaap:PreferredStockMember\n2021-08-31\ndbmm:PreferredStockSeries2Member us-gaap:PreferredStockMember\n2020-08-31\ndbmm:PreferredStockSeries2Member us-gaap:PreferredStockMember\n2022-08-31\nus-gaap:CommonStockMember\n2021-08-31\nus-gaap:CommonStockMember\n2020-08-31\nus-gaap:CommonStockMember\n2021-09-01 2022-08-31\nus-gaap:CommonStockMember\n2020-09-01 2021-08-31\nus-gaap:CommonStockMember\n2022-08-31\nus-gaap:AdditionalPaidInCapitalMember\n2021-08-31\nus-gaap:AdditionalPaidInCapitalMember\n2020-08-31\nus-gaap:AdditionalPaidInCapitalMember\n2021-09-01 2022-08-31\nus-gaap:AdditionalPaidInCapitalMember\n2020-09-01 2021-08-31\nus-gaap:AdditionalPaidInCapitalMember\n2022-08-31\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-08-31\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2020-08-31\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-09-01 2022-08-31\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2020-09-01 2021-08-31\nus-gaap:RetainedEarningsMember\n2021-08-31\nus-gaap:RetainedEarningsMember\n2020-08-31\nus-gaap:RetainedEarningsMember\n2021-09-01 2022-08-31\nus-gaap:RetainedEarningsMember\n2020-09-01 2021-08-31\nus-gaap:RetainedEarningsMember\n2022-08-31\n2020-08-31\nsrt:MinimumMember\n2021-09-01 2022-08-31\nsrt:MaximumMember\n2021-09-01 2022-08-31\nsrt:MinimumMember\n2022-08-31\nsrt:MaximumMember\n2021-05-31\nsrt:MaximumMember\n2022-08-31\n2022-03-01 2022-03-31\nsrt:MinimumMember\n2021-08-31\nsrt:MaximumMember\n2021-08-31\nus-gaap:MeasurementInputPriceVolatilityMember\n2022-08-31\nus-gaap:MeasurementInputPriceVolatilityMember\n2021-08-31\nus-gaap:MeasurementInputRiskFreeInterestRateMember\n2022-08-31\nus-gaap:MeasurementInputRiskFreeInterestRateMember\n2021-08-31\nus-gaap:MeasurementInputExpectedTermMember\n2022-08-31\nus-gaap:MeasurementInputExpectedTermMember\n2021-08-31\nus-gaap:MeasurementInputExpectedDividendRateMember\n2022-08-31\nus-gaap:MeasurementInputExpectedDividendRateMember\n2021-08-31\ndbmm:PreferredStockSeries1Member\n2021-09-01 2022-08-31\ndbmm:PreferredStockSeries2Member\n2021-09-01 2022-08-31\n2016-04-04\ncountry:US\n2021-09-01 2022-08-31\ncountry:GB\n2021-09-01 2022-08-31\ncountry:US\n2022-08-31\ncountry:GB\n2022-08-31\ncountry:US\n2020-09-01 2021-08-31\ncountry:GB\n2020-09-01 2021-08-31\ncountry:US\n2021-08-31\ncountry:GB\n2021-08-31\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}