{
    "cik": "1128383",
    "company": "NEVADA CLASSIC THOROUGHBREDS INC",
    "filing_type": "10-K",
    "filing_date": "2023-10-16",
    "period_of_report": "2023-06-30",
    "sic": "7948",
    "state_of_inc": "NV",
    "state_location": "AZ",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1128383/0001128383-23-000012-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1128383/000112838323000012/r10k063023.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1128383/0001128383-23-000012.txt",
    "filename": "1128383_10K_2023_0001128383-23-000012.htm",
    "content": "ITEM 1: Business.\nNevada Classic Thoroughbreds, Inc. (\"NCT\" or the \"company\") has developed a thoroughbred racing and breeding proprietary horse racing structure. The company is specialized, making it possible for one or two people to maintain the operation of the company.\nThe company's proprietary solution to the horse racing industry's challenge is Power Genetics Mathematical Racing Numbers™ (\"PGMRN\"), pre-potent characteristics in horses that can reproduce themselves.\nMARKET\nThere are three distinct markets for the company's horses.\nThe first market is to race company horses in \"claiming races.\" The claiming race is to enable people to buy the company's horses at the racetrack. This is a viable means of eliminating horses that are good but not quite able to compete at the top level of horse racing.\nThe second market is racing income from the racetrack. When the race horse races and performs well, NCT will receive income, or \"purse money,\" from the winnings.\nThe third market is for the syndication of stallions. The stallions that possess outstanding pedigrees, conformation, and race records are syndicated into breeding shares. A breeding share entitles the share owner to breed one mare to the stallion in any one particular breeding season for the duration of the stallion's life.\nThe company is not dependent on only a few customers, since the horse racing industry's market is virtually nationwide, where the horses can be purchased or sold virtually throughout the entire United States. The company is not limited by its customers or limited by the location of its selected horses. These stallions are, almost without exception, readily available and accessible.\nThe company does not require governmental approval or licensing for any of its racing or breeding prospects. However, the racetrack requires a normal training license where the horse is intended to race. The licensing is to provide safety for the horse and riders who train and compete at that specific track.\n[back to Table of Contents] ITEM 1A: Risk Factors.\nThe Company is a high-risk/reward company. The risks are substantial and varied. At the present time, the Company's only shareholders are officers, directors, or sophisticated and accredited investors. The following risk factors are only a sample of the problems and risks the Company faces.\n1. The Skill or Art of Horse Racing\nThe Company's business is an art or skill, each horse being unique and non-duplicable. The costs of training, developing, and racing horses is the same whether the horse is a great money-earner or a complete loss. The trainers, groomers, and all those employed in handling of the race horses is solely a skill and unique to each individual horse. Each end product is a unique creation of art through the skill of all those participating in its development. As such any one of the many individuals failing to do their job at its utmost could result in a horse being completely worthless.\n2. Research and Development Implementation\nThe Company has, through its research and development as of June 30, 2023, developed criteria that gives the Company an advantage, and if such criteria is met, the horse has a 80% chance of earnings over $1 million. The Company did a random sample of stallions in the Blood Horse magazine that had earnings less than $100,000, and found that none of these horses met the Company's criteria for purchase. The Company randomly selected 30 horses that met the Company's criteria, 25 of which had earnings over $1 million. The problem the Company faces is that the Company will only be able to purchase or breed one race horse, given its financial restraints. Thus, there is a good probability that the chosen horse will not run as expected and will be a part of the 17% of horses meeting the Company's criteria, but that did not race well.\n3. Perfect Combinations\nUnfortunately, for any horse earning over $1 million, it must have a perfect combination of breeding, training, health, grooming, safety during transport, and numerous other factors relating to that one horse. Any one phase of the horse's development that is not perfect, could result in the horse being completely worthless as a race horse. ITEM 1B. Unresolved Staff Comments\nNot applicable. ITEM 2: Property.\nThe Company currently has no horses or other property at the present time. ITEM 3: Legal Proceedings.\nNot Applicable. ITEM 4: Mine Safety Disclosures.\nNot Applicable.\n[back to Table of Contents]\nPART II: ITEM 5: Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nThere are no markets for the company's securities. The company is inactive at the present time.\nThe company intends to obtain a market maker for the company's common stock and horse preferred stock.\nThe market for the company's stock is in the heart of the horse racing and gaming industry. One or more market makers in either of the states of Kentucky, California, Nevada, or New York would suit the needs of the investors as well as providing the company with representation in the horse racing industry, thereby giving investors the flexibility of various security goals and the company with its liquidity to take advantage of opportunities as they arise. The company needs to meet the needs of its shareholders in their buying and selling of the company's securities, and in their investment objections, having available horse preferred stock in the horses the company acquires. Investors may want the the potential capital appreciation of the company's horses. ITEM 6: Selected Financial Data.\nNot required. ITEM 7: Management's Discussion and Analysis of Financial Condition and Results of Operation.\nThe company is currently inactive, and plans to remain inactive until such time as new liquidity can be acquired for the purpose of purchasing racing and breeding prospects.\nD/B/A SHOWTIME SPORTS CARE\nBusiness Concepts Summary\n~The Discovery~\nIn the process of developing face creams to be used as anti-aging creams, we discovered that the creams increase the sensitivity in the hands and make perfecting and learning athletic skills noticeably easier.\n~Niche~\nThe two initial products planned are (1) \"The Touch\" for athletes perfecting their skills during the competitive season, and (2) \"The Touch Off-Season\" for athletes learning to develop the feel of their stroke. Other products will follow as testing and demand occurs.\n~Equity Financing~\nThe Company is 100% financed by the Officers and Directors of the Company, as additional Paid-In-Capital, until such time as proceeds from the sale of the products can cover its operating costs. Currently the Company has no product inventory. The Company expects to obtain product inventory at manufacturer's cost, anticipated to sell at a retail value of $50,000. The Company has no debt. One hundred percent of Showtime Sports Care's products will be guaranteed (refundable) for 15 days after purchase. On the sixteenth day after purchase, the funds will be transferred from an incoming checking account to either a savings or an expense checking account. There will always be 100% coverage for refunds on all Showtime Sports Care products sold.\n~Marketing~\nThe marketing is an interwoven four-prong system: Internet, Charity Advertising, Network Customer Distributorships, and Individual Distributorships.\n~Growth~\nThe Company has no debt. Initial expenses are covered by the Officers and Directors as additional Paid-In-Capital. The future expenses will be covered by the net proceeds from sales of Showtime Sports Care's products. A percentage of the net proceeds from Showtime Sports Care's products sold will be reserved for further product development and marketing for Showtime Sports Care.\n~Transparencies~\nShowtime Sports Care is a division/dba of the Company, and is currently still in the development stages. The Company, as a public company, is a voluntary filer with the Securities and Exchange Commission (\"SEC\"). The Company believes the SEC's uniform filing system will be a marked advantage to the Company by providing security and accuracy of financial reporting and other standard SEC-required filings.\nHORSES\nThe Company, in its current developmental stage, is revising its analysis of the prospective racing and breeding stock for purchase.\nThe Company has elected to purchase racing stock at this time, and develop them into breeding stock. This function is the heart of the thoroughbred industry, where the most expensive horses are bought and sold, and thus, the most important sector of the thoroughbred industry for profit to the company. If the analysis of the prospective breeding stock is reasonably accurate, then the company believes that it has the ability to purchase top breeding and racing prospects at a fraction of the cost of producing and maintaining breeding stock to potentially accomplish the same purpose. It appears obvious that, as long as the company enjoys its PGMRN advantage, that of identifying potential top breeding and racing thoroughbreds, it can purchase these prospects at a much lower price than it can produce them at this point in time. Therefore, the company is going to specialize in selecting these prospects until such time as it is more economical to produce its own racing and breeding stock.\nIn general, any other assets not specifically used for this purpose will be eliminated. Furthermore, such other assets have been used, and will more than likely be sold at a substantial loss to the company. None of the officers or directors of the company will purchase such assets for their own interests; rather, these assets will strictly be advertised and sold to others outside the company at current market prices.\nRESULT OF OPERATIONS\nResearch and Development Implementation\nThe Company has, through its research and development, developed criteria that gives the Company an advantage, and if such criteria is met, the horse has an 80% chance of earnings over $1 million. The Company did a random sample of stallions in the Blood Horse magazine that had earnings less than $100,000, and found that none of these horses met the Company's criteria for purchase. The Company randomly selects 30 horses that meet the Company's criteria, 25 of which have earnings over $1 million. The problem the Company faces is that the Company will only be able to purchase or breed one race horse, given the Company's financial restraints. Thus, there is a good probability that the chosen horse will not run as expected and will be a part of the 17% of horses meeting the Company's criteria, but that do not race well.\nPerfect Combinations\nUnfortunately, for any horse earning over $1 million, it must have a perfect combination of breeding, training, health, grooming, safety during transport, and numerous other factors relating to that one horse. Any one phase of the horse's development that is not perfect, could result in the horse being completely worthless as a race horse.\nMARKET MAKING\nThe company is in the process of obtaining a market maker for its stock, and anticipates being on the Pink Sheets until the company meets the requirements of the OTC Bulletin Board. While the company is in the process of securing a market maker, there can be no guarantees that a market maker will be available, or that the company will meet their requirements in order to make a market for the company's securities.\nFINANCIAL CONDITION AND LIQUIDITY\nThe Company expects to remain inactive. The Board of Directors intends to pay the company's expenses, as determined on an on-going basis by the Board of Directors, until such time as the company is able to produce a profit.\nThe officers and directors have paid all of the company's expenses. ITEM 7A: Quantitative and Qualitative Disclosures About Market Risk.\nPower Genetics Mathematical Racing Numbers™ (PGMRN)\nCOMPETITION\nThe competition is catching up to the company in one aspect of NCT's proprietary PGMRN Number Indexes, specifically Index 6. For example, Lost In The Fog, a horse-of-the-year candidate in 2005, won ten straight races before being defeated in the Breeders Cup Championship Series Sprint race. Lost In The Fog was analyzed by a company that analyzes efficiency of stride. According to the Breeders Cup announcers, they analyzed length of stride and time in the air, and he was selected for this quality. This would imply that some individuals are beginning to understand and apply the relationship of Index 6 to a quality of the race horse.\nThe competition is still behind the company in using the total Power Numbers in selecting horses for breeding and racing. The indicators are that some owners and trainers are willing to go through the expense of analyzing Index indicator Number 6 to help in their selection process, especially the select Kentucky sales, where horses are sold for millions of dollars. However, the other indicators seem to be unnoticed at the present time in comparing horses that have good indicators to those that do not. Their price seems to be relatively the same, and no correspondence seems to exist between the poor and good indicators and the prices at which they are sold. The thoroughbred sales in California and Texas have usually less expensive horses, and it is rare that anyone would go to the expense of analyzing these horses because of their lower auction prices. This gives the company a big advantage. The company can see the horses a day before the sale, analyze hundreds of horses using the complete Power Index Numbers rather than just Index 6, and purchase or bid on horses that have the complete package. ITEM 8: Financial Statements and Supplementary Data.\nThe following financial statements are attached to this Form 10-K Annual Report and filed as a part hereof.\n[back to Table of Contents]\nNEVADA CLASSIC THOROUGHBREDS, INC.\n(A Development Stage Company)\nCONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nJUNE 30, 2023\nFINANCIAL STATEMENTS\nPAGE\nBalance Sheet\nStatement of Operations\nStatement of Stockholders' Equity\nStatement of Cash Flows\nNotes to Financial Statements\n[back to Table of Contents]\nBALANCE SHEET\nFOR PERIOD ENDING JUNE 30, 2023\nASSETS\nJUNE 30, 2023\nJUNE 30, 2022\nCURRENT ASSETS\nPARENT COMPANY ASSETS\nCash\n$\n$\nCorporate Checking\n5,318\n6,100\nTreasury Stock (Preferred and Common)\n13,995\n13,995\nTOTAL PARENT COMPANY ASSETS\n19,313\n20,095\nD/B/A SHOWTIME SPORTS CARE ASSETS\nCash\n$\n$\nChecking\nSavings\nWebsites\n$\n$\nProSportTips.com\n3,000\n3,000\nShowtimeSportsCare.com\n2,500\n2,500\nWeb Marketing\nXplore Enterprise\nGoogle\nKAI Solutions website hosting\nInventory\nThe Touch\nThe Touch-Off Season\nPosters\nContracts\nTOTAL SHOWTIME SPORTS CARE ASSETS\n5,500\n5,500\nTOTAL CURRENT ASSETS\n24,813\n25,595\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCURRENT LIABILITIES\nAccounts payable\n$\n$\nCredit Line\nSTOCKHOLDERS' EQUITY\nHorse and Ranch Preferred Stock,\npar value $.001 per share\nAuthorized 5,000,000 (2,500,000 Horse Preferred\nand 2,500,000 Ranch Preferred) shares;\n4,000,000 shares issued and outstanding\n(2,000,000 Horse Preferred and 2,000,000\nRanch Preferred)\n$\n4,000\n4,000\nCommon stock,\npar value $.001 per share\nAuthorized 5,000,000 shares\n1,900,000 shares issued and\noutstanding\n1,900\n1,900\nPaid in capital in excess of par value of stock\n1,101\n1,079\nStockholder receivable\nDeficits accumulated during developmental stage13\n(199,908 )\n(198,807 )\nTOTAL STOCKHOLDERS' EQUITY 1\n$ 24,813\n$ 25,095\nTOTAL LIABILITIES AND STOCKHOLDERS' EQUITY 1\n$ 24,813\n$ 25,095\nSee Accompanying Notes\n[back to Table of Contents]\nSTATEMENT OF OPERATIONS\nFOR PERIOD ENDING JUNE 30, 2023\nJUNE 30, 2023\nJUNE 30, 2022\nREVENUE\n$\n$\nEXPENSES\nAdministrative\n1,061\n1,040\nWeb Marketing\nGeneral\nBank Charges\nSEC Accounting\n$\n$\nWebsites\nProSportTips.com\n$\n$\nShowtimesportscare.com\n$\n$\nTOTAL EXPENSES\n$ 1,101\n$ 1,079\nNET (LOSS)\n$ (1,101 )\n$ (1,079 )\nNET (LOSS) PER COMMON SHARE\nBasic and diluted\n$ ( .00 )\n$ ( .00 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING\nBasic and diluted\n1,900,000\n1,900,000\nSee Accompanying Notes\n[back to Table of Contents]\nSTATEMENT OF STOCKHOLDERS' EQUITY\nFOR THE PERIOD FROM INCEPTION (NOVEMBER 1, 2000) TO JUNE 30, 2023\nCommon and Preferred Stock\nShares\nAmount\nAdditional\nPaid-in\nCapital\nFair Market\nValue of\nServices\nDonated by\nStockholder\nAccumulated\nDeficit\nDuring the\nDevelopment\nState\nTotal\nStockholders'\nEquity\n(Deficit)\nCOMMON STOCK\nBalance at Inception - November 1, 2000.\nPREFERRED STOCK\nBalance at inception - November 1, 2000\nCOMMON STOCK Balance - June 2001 89,000\n(89)\nPREFERRED STOCK Balance - June 30, 2001 5,000\n(5)\nCOMMON Stock issued to Operations Manager for services. Donated back to company for future disbursement for period ending June 30, 2002\n2,000\nCOMMON STOCK Balance - June 2002 91,000\n(91)\nPREFERRED STOCK Balance - June 30, 2002 5,000\n(5)\nCOMMON Stock issued to Operations Manager for services. Donated back to company for future disbursement, for period ending June 30, 2003\n2,000\nCOMMON STOCK Balance - June 30, 2003 93,000\n(93)\nPREFERRED STOCK Balance - June 30, 2003 5,000\n(5)\nCOMMON Stock split 20:1 April 5, 2004 1,860,000\n1,860 (1,860)\nCOMMON Stock issued to Operations Manager for services. Donated back to company for future disbursement, for period ending June, 2004\n40,000\nCOMMON STOCK Balance - June 30, 2004 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK Balance - June 30, 2004 5,000\n(5)\nCOMMON STOCK Balance - June 2005 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK split 800:1 June 30, 2005 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n10,000\n--\n--\n--\n--\n--\nHorse Preferred:\n10,000\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2006 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2006 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n10,000\n--\n--\n--\n--\n--\nHorse Preferred:\n10,000\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2007 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2007 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n10,000\n--\n--\n--\n--\n--\nHorse Preferred:\n10,000\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2008 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2008 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n10,000\n--\n--\n--\n--\n--\nHorse Preferred:\n10,000\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2009 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2009 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n10,000\n--\n--\n--\n--\n--\nHorse Preferred:\n10,000\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2010 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2010 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2011 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2011 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2012 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2012 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2013 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2013 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2014 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2014 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2015 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2015 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2016 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2016 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Balance - June 2017 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2017 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Net Loss from inception -- -- -- -- 1,900 (1,900)\nPREFERRED STOCK Net Loss from inception -- -- -- -- 4,000 (4,000)\nCOMMON STOCK Balance - June 2018 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2018 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Net Loss from inception -- -- -- -- 1,900 (1,900)\nPREFERRED STOCK Net Loss from inception -- -- -- -- 4,000 (4,000)\nCOMMON STOCK Balance - June 2019 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2019 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Net Loss from inception -- -- -- -- 1,900 (1,900)\nPREFERRED STOCK Net Loss from inception -- -- -- -- 4,000 (4,000)\nCOMMON STOCK Balance - June 2020 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2020 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Net Loss from inception -- -- -- -- 1,900 (1,900)\nPREFERRED STOCK Net Loss from inception -- -- -- -- 4,000 (4,000)\nCOMMON STOCK Balance - June 2021 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2021 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Net Loss from inception -- -- -- -- 1,900 (1,900)\nPREFERRED STOCK Net Loss from inception -- -- -- -- 4,000 (4,000)\nCOMMON STOCK Balance - June 2022 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2022 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Net Loss from inception -- -- -- -- 1,900 (1,900)\nPREFERRED STOCK Net Loss from inception -- -- -- -- 4,000 (4,000)\nCOMMON STOCK Balance - June 2023 1,900,000\n1,900\n(1,900)\nPREFERRED STOCK - June 2023 4,000,000\n4,000\n(4,000)\nPreferred Stock divided into Ranch Preferred and Horse Preferred, as follows:\nRanch Preferred:\n2,000,000\n--\n--\n--\n--\n--\nHorse Preferred:\n2,000,000\n--\n--\n--\n--\n--\nPreferred Dividends to common stock shareholders from Preferred Stock, as follows:\nRanch Preferred:\n--\n--\n--\n--\n--\nHorse Preferred:\n--\n--\n--\n--\n--\nCOMMON STOCK Net Loss from inception -- -- -- -- 1,900 (1,900)\nPREFERRED STOCK Net Loss from inception -- -- -- -- 4,000 (4,000)\n[back to Table of Contents]\nSTATEMENT OF STOCKHOLDERS' EQUITY (Continued)\nFOR THE PERIOD FROM INCEPTION (NOVEMBER 1, 2000) TO JUNE 30, 2005\nUNAUDITED\nJUNE 30, 2005\nUNAUDITED\nJUNE 30, 2004\nUNAUDITED\nJUNE 30, 2003\nUNAUDITED\nJUNE 30, 2002\nAUDITED\nJUNE 30, 2001\nUNAUDITED\nJUNE 30, 2000\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nAT DATE OF INCEPTION\nNOVEMBER 1, 2000 - STOCK ISSUED TO FOUNDERS\nPreferred\n(4,000)\n(5)\n(5)\n(5)\n(5)\nCommon\n(1,900)\n(1,900)\n(93)\n(91)\n(89)\nFAIR MARKET VALUE OF SERVICES DONATED BY STOCKHOLDERS\n10,936 (54,679)\n10,936 (43,793)\n10,936 (32,807)\n10,936 (21,871)\n10, 935\nINCREASE IN PAID IN CAPITAL FOR PAYMENT OF EXPENSES BY STOCKHOLDERS\n1,760 (13,041)\n1,760 (11,281)\n1,760 (9,521)\n3,797 (7,761)\n3,964\nNET (LOSS) FOR EACH PERIOD SHOWN\n(12,696)\n(12,696)\n(12,696)\n(13,797)\n(14,767)\nBALANCE FOR EACH PERIOD SHOWN\n12,696 (67,720)\n12,696 (53,956)\n12,696 (41,260)\n13,814 (28,564)\n14,805 (14,767)\n[back to Table of Contents]\nCONTINUED -- FOR THE PERIOD FROM JUNE 30, 2006 THROUGH JUNE 30, 2011\n\t\t UNAUDITED\nJUNE 30, 2011\nUNAUDITED\nJUNE 30, 2010\nUNAUDITED\nJUNE 30, 2009\nUNAUDITED\nJUNE 30, 2008\nUNAUDITED\nJUNE 30, 2007\nUNAUDITED\nJUNE 30, 2006\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nAT DATE OF INCEPTION\nNOVEMBER 1, 2000 - STOCK ISSUED TO FOUNDERS\nPreferred\n(4,000)\n(4,000)\n(4,000)\n(4,000)\n(4,000)\n(4,000)\nCommon\n(1,900)\n(1,900)\n(1,900)\n(1,900)\n(1,900)\n(1,900)\nFAIR MARKET VALUE OF SERVICES DONATED BY STOCKHOLDERS\n(93,146)\n7,291 (76,551)\n10,936 (65,615)\nINCREASE IN PAID IN CAPITAL FOR PAYMENT OF EXPENSES BY STOCKHOLDERS\n(64,165)\n(63,845)\n4,583 (63,525)\n16,595 (58,942)\n17,496 (42,347)\n11,810 (24,851)\nNET (LOSS) FOR EACH PERIOD SHOWN\n(131,885)\n(131,565)\n4,583 (4,583)\n16,595 (34,091)\n2,515 (17,496)\n(22,746)\nBALANCE FOR EACH PERIOD SHOWN\n(131,885)\n(131,565)\n(131,245)\n16,595 (127,042)\n20,011 (110,477)\n22,746 (90,466)\n[back to Table of Contents]\nCONTINUED -- FOR THE PERIOD FROM JUNE 30, 2012 THROUGH JUNE 30, 2017\n\t\t UNAUDITED\nJUNE 30, 2017\nUNAUDITED\nJUNE 30, 2016\nUNAUDITED\nJUNE 30, 2015\nUNAUDITED\nJUNE 30, 2014\nUNAUDITED\nJUNE 30, 2013\nUNAUDITED\nJUNE 30, 2012\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nAT DATE OF INCEPTION\nNOVEMBER 1, 2000 - STOCK ISSUED TO FOUNDERS\nPreferred\n(4,000)\n(4,000)\n(4,000)\n(4,000)\n(4,000)\n(4,000)\nCommon\n(1,900)\n(1,900)\n(1,900)\n(1,900)\n(1,900)\n(1,900)\nFAIR MARKET VALUE OF SERVICES DONATED BY STOCKHOLDERS\nINCREASE IN PAID IN CAPITAL FOR PAYMENT OF EXPENSES BY STOCKHOLDERS\n1,040 (68,000)\n(66,960)\n(66,240)\n(65,520)\n(64,805)\n(64,485)\nNET (LOSS) FOR EACH PERIOD SHOWN\n17,511 (152,911)\n(134,680)\n(133,960)\n(133,240)\n(132,525)\n(132,205)\nBALANCE FOR EACH PERIOD SHOWN\n17,511 (152,911)\n(134,680)\n(133,960)\n(133,240)\n(132,525)\n(132,205)\n[back to Table of Contents]\nCONTINUED -- FOR THE PERIOD FROM JUNE 30, 2018 THROUGH JUNE 30, 2023\n\t\t UNAUDITED\nJUNE 30, 2023\nUNAUDITED\nJUNE 30, 2022\nUNAUDITED\nJUNE 30, 2021\nUNAUDITED\nJUNE 30, 2020\nUNAUDITED\nJUNE 30, 2019\nUNAUDITED\nJUNE 30, 2018\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nPaid in Capital\nin Excess of\nPar Value\nof Stock\nDeficit\nAccumulation\nduring the\nDevelopment\nStage\nAT DATE OF INCEPTION\nNOVEMBER 1, 2000 - STOCK ISSUED TO FOUNDERS\nPreferred\n(4,000)\n(4,000)\n(4,000)\n(4,000)\n(4,000)\n(4,000)\nCommon\n(1,900)\n(1,900)\n(1,900)\n(1,900)\n(1,900)\n(1,900)\nFAIR MARKET VALUE OF SERVICES DONATED BY STOCKHOLDERS\nINCREASE IN PAID IN CAPITAL FOR PAYMENT OF EXPENSES BY STOCKHOLDERS\n1,101 (85,233)\n1,079 (84,132)\n6,810 (83,053)\n5,158 (75,243)\n1,045 (70,085)\n1,040 (69,040)\nNET (LOSS) FOR EACH PERIOD SHOWN\n1,101 (199,908)\n1,079 (198,807)\n7,627 (197,728)\n6,198 (190,101)\n9,855 (183,983)\n2,722 (154,913)\nBALANCE FOR EACH PERIOD SHOWN\n1,101 (199,908)\n1,079 (198,807)\n7,627 (197,728)\n6,198 (190,101)\n9,855 (183,983)\n2,722 (154,913)\n[back to Table of Contents]\nSTATEMENT OF CASH FLOWS\nFOR THE PERIOD FROM JUNE 30, 2022 TO JUNE 30, 2023\nUNAUDITED\nJUNE 30, 2023\nUNAUDITED\nJUNE 30, 2022\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet (loss)\n$ (1,101\n)\n$ ( 1,079 )\nAdjustments to reconcile net (loss) to net cash provided by operating activities:\nFair market value of services provided by stockholder\n(1,061 )\n( 1,040 )\nIncrease in donated or gifted capital for payment of expenses by stockholders\nChanges in operating assets and liabilities:\nAccounts payable\nNET CASH PROVIDED BY OPERATING ACTIVITIES\n$\n$\nCASH FLOWS FROM INVESTING ACTIVITIES\nCASH FLOWS FROM FINANCING ACTIVITIES\nNET INCREASE (DECREASE) IN CASH AND CASH BALANCE AT JUNE 30\n$ ( 782 )\n$ (759 )\nSUPPLEMENTAL DISCLOSURE OF CASH\nFLOW INFORMATION\nCash paid for interest\n$\n$\nCash paid for taxes\n$\n$\nSCHEDULE OF NON-CASH INVESTING\nAND FINANCING ACTIVITIES\nFair market value of services provided by stockholder\n$ 1,061\n$ 1,040\nIncrease in donated or gifted capital for\npayment of expenses paid by stockholders\n$\n$\nSee Accompanying Notes\n[back to Table of Contents]\nNOTES TO FINANCIAL STATEMENTS\nJUNE 30, 2023\nNOTE 1: SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThe company uses SOP 85-3, breeding horses under development. The horse evaluation is adding in direct costs to the value of the horses under development. The value is the lower of cost or established market value, until breeding maturity, then the horses are depreciated through the life of the breeding career. Pursuant to discussions with staff of the Securities and Exchange Commission in January of 2006 and in keeping with SOP 85-3 regarding evaluations of breeding stock, the following accounting practices have been adopted and adjustments as of March 31, 2006.\nAny financial statements prior to March 31, 2006 will be inaccurate, as they do not reflect SOP 85-3, breeding horses under development, and should not be relied upon for any meaningful representations of the company's financial position.\nAccounting Estimates\nManagement uses estimates and assumptions in preparing financial statements in accordance with accounting principles generally accepted in the United States of America. Those estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities, and the reported revenues and expenses. Actual results could vary from the estimates that were used.\nIncome Taxes\nProvisions for income taxes are based on taxes payable or refundable for the current year and deferred taxes on temporary differences between the amount of taxable income and pretax financial income and between the basis of assets and liabilities and their reported amounts in the financial statements. Deferred tax assets and liabilities are included in the financial statements at currently enacted income tax rates applicable to the period in which the deferred tax assets and liabilities are expected to be realized or settled as prescribed in FASB Statement No. 109, \"Accounting for Income Taxes.\" As changes in tax laws or rates are enacted, deferred tax assets and liabilities are adjusted through the provision for income taxes.\nNet (Loss) Per Share\nThe Company adopted Statement of Financial Accounting Standards No. 144 that requires the reporting of both basic and diluted earnings (loss) per share. Basic earnings (loss) per share is computed by dividing net income (loss) available to common stockholders by the weighted average number of common shares outstanding for the period. Diluted earnings (loss) per share reflects the potential dilution that could occur if securities or other contracts to issue common stock were exercised or converted into common stock. In accordance with FASB 128, any anti-dilutive effects on net loss per share are excluded.\nLong-Lived Assets\nStatement of Financial Accounting Standards No. 144, \"Accounting for the Impairment of Long-Lived Assets and for Long-Lived Assets to be Disposed Of,\" requires that long-lived assets be reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the asset in question may not be recoverable.\n[back to Table of Contents]\nNOTE 2: PREFERRED STOCK\nNo special rights or preferences have been assigned to the preferred stock.\nNOTE 3: DEVELOPMENT STAGE OPERATIONS\nAs of June 30, 2023 the Company was in the development stages of operations. According to the Financial Accounting Standards Board of the Financial Accounting Foundation, a development stage Company is defined as a company that devotes most of its activities to establishing a new business activity. In addition, planned principle activities have not yet commenced.\nThe Company did not expense any development costs as per donation or gift from the shareholders for the period from June 30, 2022 to June 30, 2023.\nNOTE 4: FINANCIAL STATEMENT OF AN INACTIVE REGISTRANT\nUnder Statute 210.3-11, the Company does not need to provide an audited or reviewed quarterly report.\nReg. Statutes 210.3-11\n(a) Gross Receipts from all sources for the fiscal year are not in excess of $100,000;\n(b) The registrant has not purchased or sold any of its own stock, granted options therefore, or levied assessments upon outstanding stock;\n(c) Expenditures for all purposes for the fiscal year are not in excess of $100,000;\n(d) No material change in the business has occurred during the fiscal year, including any bankruptcy, reorganization, readjustment or succession or any material acquisition or disposition of plants, mines, mining equipment, mine rights or leases; and\n(e) No exchange upon which the shares are listed, or governmental authority having jurisdiction, requires the furnishing to it or the publication of audited financial statements.\n[back to Table of Contents]\nNOTE 5: INCOME TAXES\nNet (loss)\n$ (1,101 )\nThe provisions for income taxes is estimated as follows:\nCurrently payable\n$\nDeferred\n$\nThe net (loss) for financial statements differs from the federal income tax net loss. A reconciliation is as follows:\nFinancial statement net loss\n$ 199,908\nNon-deductible services\nIncome tax net loss\n199,908\nSignificant components of the Company's deferred tax asset are as follows:\nNet operating loss carry forward\n$ 199,908\nLess valuation allowance\nNet deferred asset\n$ 199,908\nNOTE 6: STOCK OPTION AGREEMENT\nOn November 1, 2000, the Company established a stock option agreement under which a total of 930,000 shares of common stock are reserved for the option.\nThe details of the option are as follows:\nNumber\nof Shares\nExercise\nPrice\nExercise\nDate\n64,000\n$ .50*\nJune 30, 2002\n866,000\n1.25*\nJune 30, 2003\n930,000\n*Adjusted for 20:1 stock split. The Company has elected to account for stock-based compensation under APB Opinion No. 25, under which no compensation expense has been recognized for stock options granted to employees at fair market value.\nA summary of the option activity for the period from November 1, 2000 to June 30, 2023, pursuant to the terms of the plan is as follows:\nShares\nUnder\nOption\nWeighted\nAverage\nExercise Price\nOptions outstanding at November 1, 2000\n$\nGranted 930,000\n23.81\nOutstanding at June 30, 2023 930,000\n23.81\nAll shares are exercisable.\n[back to Table of Contents]\nInformation regarding stock options outstanding as of June 30, 2023 is as follows, not including the 20:1 stock split:\nPrice Range $ 10.00 - $ 25.00\nWeighted average exercise and grant date prices $\n23.81\nOutstanding at June 30, 2023 Exercisable\nThe weighted average fair market value of options granted in the period of November 1, 2000 to June 30, 2023 were estimated as of the date of grant using the Black-Scholes stock option pricing model, based on the following weighted average assumptions:\nDividend yield\nExpected volatility 50%\nRisk fee interest rate 5.7%\nExpected life Exercisable\nFor purposes of pro forma disclosure, the estimated fair market value of the options, if any, is amortized to expense over the options' vesting periods.\nUnder the Black-Scholes model, the options did not have any intrinsic value. Therefore, pro forma disclosure information has not been presented.\nNOTE 7: SHARES OF STOCK ELIGIBLE FOR ISSUANCE\nCommon\nPreferred\nTotal stock authorized\n5,000,000\n5,000,000\nLess stock issued ( 1,900,000)\n( 4,000,000)\nLess stock reserved for stock options\n( 930,000)\nBalance available for issuance 2,170,000\n1,000,000\nNOTE 8: NET OPERATING LOSS CARRYFORWARD\nThe corporation has the following net operating loss carry forward:\nYear\nAmount\nExpiration Date\nJune 30, 2023\n199,908\nJune 30, 2024\nNOTE 9: FAIR MARKET VALUE OF SERVICES DONATED BY STOCKHOLDERS\nA stockholder, Pamela Brimhall, current CEO of the Company, provided services valued at $320.00 from July 1, 2022 through June 30, 2023. The salary is determined yearly by the Board of Directors. Since the company is inactive and in a development stage, the current CEO, Pam Brimhall, oversees the operations and the companys horse assets and the filing of the financial reports. She is currently the only qualified person the company has been able to find to fill these positions at the salary the company is willing to pay. When the company becomes active and a cash flow develops, these tasks will be broken out as the company is able to locate qualified persons to fulfill these jobs. Until such time, the fair market value is determined by what the company is willing to pay and what a qualified person is willing to accept.\n[back to Table of Contents]\nNOTE 10: LIMITED OPERATION COSTS\nThe shareholders have elected to pay a substantial portion of operation costs of the company up to June 2024 as gifts or donations to the Company. The exact amount will be determined by the Board of Directors on an on-going basis.\nNOTE 11: GOING CONCERN\nThe financial statements are presented on the basis that the Company is a going concern. Going concern contemplates the realization of assets and the satisfaction of liabilities in the normal course of business over a reasonable length of time. The Company is in the development stage of breeding and training horses.\nNOTE 12: INSURANCE\nThe Company does not have any insurance coverage on its horses nor any liability or workers' compensation insurance. However, the company intends to purchase insurance on its horses before any of the company's horses are bred or raced.\nNOTE 13: ACCUMULATED DEFICITS [back]\nThe common stock for salary was donated back to the company for the purpose of acquiring market makers and their float requirements.\n[back to Table of Contents] ITEM 9: Changes In and Disagreements With Accountants on Accounting and Financial Disclosure\nNone. ITEM 9A: Controls and Procedures\nEffectiveness of the Company's Controls and Procedures\nThe company maintains disclosures controls and procedures designed to ensure that information required to be disclosed in its reports filed under the Securities Exchange Act of 1934, as amended (the Exchange Act), is recorded, processed, summarized, and reported within the required time periods, and that such information is accumulated and communicated to management, including the company's Chief Executive Officer and Chief Financial Officer, or persons performing these duties, to allow for timely decisions regarding required disclosure.\nThe company's management, including the Chief Executive Officer and Chief Financial Officer, or persons performing these duties, has evaluated the effectiveness of the company's disclosure controls and procedures over financial reporting (as defined in Exchange Act Rules). At the present time, the company is an inactive filer, with minimal expense transactions each month and no earnings whatsoever. Because of this, the company's financial statements are unaudited. The company's management performs the function of audit committee, and has detected errors in its financial reports, which errors are not in any way related to earnings or expenditures, but merely to the manner in which cumulative balances have been reported. Such errors have been corrected in the company's June 2005 10KSB/A. The Public Company Accounting Oversight Board has defined a material weakness as a \"significant deficiency or combination of significant deficiencies that results in more than a remote likelihood that a material misstatement of the annual or interim financial statements will not be prevented or detected.\" The aforementioned errors are considered to be minor, and thus not \"material\" weaknesses, significant deficiencies, or a combination of significant deficiencies.\nBased upon the company's most recent evaluation, the company's management, including its Chief Executive Officer and Chief Financial Officer (or persons performing those duties), concluded the company's disclosure controls and procedures over financial reporting are adequate and effective as of June 30, 2023. The effectiveness of the company's controls and procedures are an on-going process of continual improvement. As such, when the company becomes active, with earnings to report and audited financial statements, the company's disclosure controls and procedures may require restructuring.\nThere has been no change in the company's internal control over financial reporting or any other factor that has materially affected, or is reasonably likely to materially affect, the company's internal control over financial reporting.\nEvaluation of Disclosure Controls and Procedures\nBased on an evaluation under the supervision and with the participation of the Companys management, the Companys principal executive officer and principal financial officer have concluded that the Companys disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (Exchange Act) were effective as of June 30, 2023, to provide reasonable assurance that information required to be disclosed by the Company in reports that it files or submits under the Exchange Act is (i ) recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms and (ii) accumulated and communicated to the Companys management, including its principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nInherent Limitations Over Internal Controls\nThe Companys internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles (GAAP). The Companys internal control over financial reporting includes those policies and procedures that:\n(i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Companys assets;\n(ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that the Companys receipts and expenditures are being made only in accordance with authorizations of the Companys management and directors; and\n(iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nManagement, including the Companys Chief Executive Officer and Chief Financial Officer, does not expect that the Companys internal controls will prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of internal controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Also, any evaluation of the effectiveness of controls in future periods are subject to the risk that those internal controls may become inadequate because of changes in business conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagements Annual Report on Internal Control Over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Management conducted an assessment of the effectiveness of the Companys internal control over financial reporting based on the criteria set forth in Internal Control -- Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework). Based on the Companys assessment, management has concluded that its internal control over financial reporting was effective as of June 30, 2023 to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with GAAP.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in the Companys internal control over financial reporting during its fourth fiscal quarter of April through June 2023, which were identified in connection with managements evaluation required by paragraph (d) of rules 13a-15 and 15d-15 under the Exchange Act, that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. ITEM 9B. Other Information\nNot applicable.\n[back to Table of Contents]\nPART III: ITEM 10: Directors, Executive Officers, and Corporate Governance\nIn response to this item, the company hereby incorporates by reference the information previously filed in the 10SB12G, filed August 15, 2001, as well as all subsequent quarterly and annual reports filed on forms 10Q and 10K. ITEM 11: Executive Compensation\nIn response to this item, the company hereby incorporates by reference the information previously filed in the 10SB12G, filed August 15, 2001. There has been no change in Executive Compensation as it relates to the dollar amount. ITEM 12: Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nIn response to this item, the company hereby incorporates by reference the information previously filed in the 10SB12G, filed August 15, 2001, as well as all subsequent quarterly and annual reports filed on forms 10Q and 10K. The security ownership is as described elsewhere in this 10K Annual Report for the period ending June 30, 2023. ITEM 13: Certain Relationships and Related Transactions, and Director Independence\nIn response to this item, the company hereby incorporates by reference the information previously filed in the 10SB12G, filed August 15, 2001, as well as all subsequent quarterly and annual reports filed on forms 10Q and 10K. ITEM 14: Principal Accounting Fees and Services\nThe company is an inactive voluntary filer. Its financial statements are unaudited. Shown in the company's Statement of Operations, Administrative Expenses, the company has billed $80.00 per quarter ($320.00 per year ended June 30, 2023) for accounting services provided by the company's chief executive officer.\n(1) Audit Fees\nDisclose, under the caption Audit Fees, the aggregate fees billed for each of the last two fiscal years for professional services rendered by the principal accountant for the audit of the registrants annual financial statements and review of financial statements included in the registrants Form 10-Q (17 CFR 249.308a) or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years.\nThe company's financial statements are unaudited.\n(2) Audit-Related Fees\nDisclose, under the caption Audit-Related Fees, the aggregate fees billed in each of the last two fiscal years for assurance and related services by the principal accountant that are reasonably related to the performance of the audit or review of the registrants financial statements and are not reported under Item 9(e)(1) of Schedule 14A. Registrants shall describe the nature of the services comprising the fees disclosed under this category.\nThe company's financial statements are unaudited.\n(3) Tax fees\nDisclose, under the caption Tax Fees, the aggregate fees billed in each of the last two fiscal years for professional services rendered by the principal accountant for tax compliance, tax advice, and tax planning. Registrants shall describe the nature of the services comprising the fees disclosed under this category.\nNone.\n(4) All Other Fees\nDisclose, under the caption All Other Fees, the aggregate fees billed in each of the last two fiscal years for products and services provided by the principal accountant, other than the services reported in Items 9(e)(1) through 9(e)(3) of Schedule 14A. Registrants shall describe the nature of the services comprising the fees disclosed under this category.\nNone.\n(5)(i) Disclose the audit committees pre-approval policies and procedures described in paragraph (c)(7)(i) of Rule 2-01 of Regulation S-X.\nNot applicable. The company's financial statements are unaudited.\n(ii) Disclose the percentage of services described in each of Items 9(e)(2) through 9(e)(4) of Schedule 14A that were approved by the audit committee pursuant to paragraph (c)(7)(i)(C) of Rule 2-01 of Regulation S-X.\nNot applicable. The company's financial statements are unaudited.\n(6) If greater than 50 percent, disclose the percentage of hours expended on the principal accountants engagement to audit the registrants financial statements for the most recent fiscal year that were attributed to work performed by persons other than the principal accountants full-time, permanent employees.\nNot applicable. The company's financial statements are unaudited.\nPART IV: ITEM 15: Exhibits, Financial Statement Schedules\n(a) The Company's unaudited financial statements are included in Item 8 of this annual report on Form 10-K.\n(b) Index to Exhibits required by Item 601 of Regulation S-K:\nExhibit 3.1* - Articles of Incorporation, as filed with the Nevada Secretary of State on October 31, 2000.\nExhibit 3.2* - By-laws.\nExhibit 31.1 - Certification of the Chief Executive Officer pursuant to Rule 13A-14 or 15D-14 of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nExhibit 31.2 - Certification of the Acting Chief Financial Officer pursuant to Rule 13A-14 or 15D-14 of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nExhibit 32.1 - Certification of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nExhibit 32.2 - Certification of the Acting Chief Financial Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n*Filed as an exhibit to the Company's 10SB12G, filed with the Securities and Exchange Commission on August 15, 2001, and incorporated herein by this reference.\n[back to Table of Contents]\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, and the Financial Statements of an Inactive Registrant, Regulation Section 210-3-11, the Registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nNevada Classic Thoroughbreds, Inc.\nDated: October 15, 2023 By: /s/ Pamela Brimhall\nPamela Brimhall\nPresident and CEO\nDuly Authorized Officer\nPrinciple Executive Officer\nChief Accounting Officer / Acting Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nNevada Classic Thoroughbreds, Inc.\nDated: October 15, 2023 By: /s/ Pamela Brimhall\nPamela Brimhall\nPresident and CEO\nPrinciple Executive Officer\nChief Accounting Officer / Acting Chief Financial Officer\nSupplemental information to be Furnished With Reports Filed Pursuant to Section 15(d) of the Exchange Act By Non-Reporting Issuers:\nNot Applicable.\n[back to Table of Contents]"
}