{
    "cik": "1133062",
    "company": "JANEL CORP",
    "filing_type": "10-K",
    "filing_date": "2023-12-08",
    "period_of_report": "2023-09-30",
    "sic": "7389",
    "state_of_inc": "NV",
    "state_location": "NY",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1133062/0001140361-23-057011-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1133062/000114036123057011/ef20012456_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1133062/0001140361-23-057011.txt",
    "filename": "1133062_10K_2023_0001140361-23-057011.htm",
    "content": "ITEM 1.\nBUSINESS\nOur Business\nJanel Corporation (Janel, the Company or the Registrant) is a holding company with subsidiaries in three business segments: Logistics, Life Sciences and Manufacturing. The Company strives to create shareholder value primarily through three strategic priorities: supporting its businesses efforts to make investments and to build long-term profits; allocating Janel capital at high risk-adjusted rates of return; and attracting and retaining exceptional talent.\nManagement at the Janel holding company focuses on significant capital allocation decisions, corporate governance and supporting Janels subsidiaries where appropriate. Janel expects to grow through its subsidiaries organic growth and by completing acquisitions. We plan to either acquire businesses within our existing segments or expand our portfolio into new strategic segments. Our acquisition strategy focuses on reasonably priced companies with strong and capable management teams, attractive existing business economics and stable and predictable earnings power.\nJanel was incorporated on August 31, 2000 and is domiciled in the state of Nevada. Its corporate headquarters are located in New York, New York.\nAs of September 30, 2023, Janel and its consolidated subsidiaries employed 316 full-time employees in the United States. None of these employees is covered by a collective bargaining agreement. Janel and its subsidiaries have experienced no work stoppages and consider relations with their employees to be good. Successful execution of our strategy is dependent on attracting, developing and retaining key employees and members of our management team. The skills, experience and industry knowledge of our employees significantly benefit our operations and performance. We continuously evaluate, modify and enhance our internal processes and technologies to increase employee engagement, productivity, efficiency opportunities, skills and resources needed for success.\nOur Business Segments\nWe have three reportable segments: Logistics, Life Sciences and Manufacturing. The following provides greater detail regarding each of these segments.\nLogistics\nThe Companys Logistics segment is comprised of several wholly-owned subsidiaries. The Logistics segment is a non-asset based, full-service provider of cargo transportation logistics management services, including freight forwarding via air-, ocean- and land-based carriers; customs brokerage services; warehousing and distribution services; trucking and other value-added logistics services. In addition to these revenue streams, the Company earns accessorial revenue in connection with its core services. Accessorial revenue includes, but is not limited to, fuel service charges, wait time fees, hazardous cargo fees, labor charges, handling, cartage, bonding and additional labor charges.\nLife Sciences\nThe Companys Life Sciences segment is comprised of several wholly-owned subsidiaries. The Companys Life Sciences segment manufactures and distributes high-quality monoclonal and polyclonal antibodies, diagnostic reagents and other immunoreagents for biomedical research and provides antibody manufacturing for academic and industry research scientists. Our Life Sciences segment also produces products for other life science companies on an original equipment manufacturer (OEM) basis.\nOn May 22, 2023, the Company acquired all the rights, title and interests to a royalty agreement for certain antibody products, which we include in our Life Sciences segment.\nOn March 2, 2023, the Company completed a business combination whereby it acquired all of the outstanding stock of Stephen Hall, PhD Ltd., which we include in our Life Sciences segment.\nOn November 1, 2022, the Company completed a business combination whereby it acquired all of the outstanding stock of ImmunoBioScience Corporation, which we include in our Life Sciences segment.\nOn August 15, 2022, the Company completed a business combination whereby it acquired all the membership interests of ECM Biosciences LLC, which we include in our Life Sciences segment.\nManufacturing\nThe Companys Manufacturing segment is comprised of Indco, Inc. (Indco). Indco is a majority-owned subsidiary of the Company that manufactures and distributes mixing equipment and apparatuses for specific applications within various industries. Indcos customer base is comprised of small- to mid-sized businesses as well as other larger customers for which Indco fulfills repetitive production orders.\nInvestment in Marketable Securities - Rubicon\nOn August 19, 2022, the Company acquired 1,108,000 shares of the common stock, par value $0.001 per share, of Rubicon Technology, Inc. (Rubicon), at a price per share of $20.00, in a cash tender offer made pursuant to the Stock Purchase and Sale Agreement, dated July 1, 2022, between the Company and Rubicon (the Rubicon Purchase Agreement). Pursuant to the terms of the Rubicon Purchase Agreement, the acquired shares represent 45.0% of Rubicons issued and outstanding shares of common stock as of August 3, 2022, as reported in Rubicons Quarterly Report on Form 10-Q for the quarterly period ended June 30, 2022, filed with the SEC on August 12, 2022. The Company owned approximately 46.6% of Rubicons issued and outstanding shares of common stock as of September 30, 2023.\nRubicon is an advanced materials provider specializing in monocrystalline sapphire for applications in optical and industrial systems. The purpose of our investment in Rubicon is for Janel to acquire a significant ownership interest in Rubicon, together with representation on Rubicons Board, in an attempt to (i) restructure the Rubicon business to achieve profitability and (ii) assist Rubicon in utilizing its net operating loss carry-forward assets. Although we are optimistic about our investment in Rubicon, our investment involves risks and uncertainties that are beyond our control, including those discussed herein under Item 1A, Risk Factors.\nLogistics\nThe Companys Logistics segment helps clients move and manage freight efficiently to reduce inventories and to increase supply chain speed and reliability. Key services include customs entry filing; arrangement of freight forwarding by air, ocean and ground; warehousing; cargo insurance procurement; logistics planning; product repackaging; online shipment tracking and hazardous material warehousing and distribution.\nOur Logistics segment earns flat fees for certain services, such as customs entry filing. For brokered services, Logistics earns the difference between the rate charged by a service provider and the rate Logistics charges the customer for the providers service. Its freight consolidation activities, in addition to on-going volume-based relationships with providers, allow Logistics to command preferred service rates that can be passed on profitably to the customer.\nAs a non-asset-based logistics provider, we own only a minimal amount of equipment. We generally expect to neither own nor operate any material transportation assets and, consequently, arrange for transportation of our customers shipments via trucking companies, commercial airlines, air cargo carriers, railroads, ocean carriers and other non-asset based third-party providers. By not owning the transportation equipment used to transport the freight, which results in relatively minimal fixed operating costs, we are able to leverage our network of locations to offer competitive pricing and flexible solutions to our customers. Moreover, our balanced product offering provides us with revenue streams from multiple sources and enables us to retain customers even as they shift across various modes of transportation. We believe our low capital intensity model allows us to provide low-cost solutions to our customers, operate our business with strong cash flow characteristics and retain significant flexibility in responding to changing industries and economic conditions.\nDuring the fiscal year ended September 30, 2023, Logistics handled approximately 152,000 individual import and export shipments originating or terminating in countries around the world. Approximately 49% of the revenues from these activities related to trucking, 25% to ocean freight, 14% to air freight, 5% to custom brokerage and the remainder of 7% to other.\nBased upon revenues, our customers are diverse, with the largest individual customer accounting for about 3.0% of revenues and the top ten customers accounting for 14.9% of revenues during fiscal 2023.\nAs of September 30, 2023, our Logistics segment operated out of twenty-five full-service locations in the United States and maintained a network of independent agent relationships in many trading countries, giving it the ability to provide a global service to its clients.\nEach office is responsible for its growth and profitability. Logistics management helps the offices as needed with efforts such as human resources, maintaining a common information technology platform and centralized accounting services. Our growth strategy includes servicing existing customers well and acquiring more of their business, hiring new people who can grow our company and adding new companies or services through acquisitions.\nThe logistics industry is highly fragmented, with low barriers to entry and intense competition. Our Logistics segment competes against providers ranging in size from mom-and-pop businesses to multi-national firms with hundreds of offices worldwide. Many of our Logistics customers utilize more than one logistics provider.\nThe freight forwarding industry requires dealings in currencies other than the U.S. Dollar. As a result, our Logistics segment is exposed to the inherent risks of international currency markets and governmental interference. Some countries in which the Logistics segment maintains agent relationships have currency control regulations that influence our ability to hedge foreign currency exposure. Logistics tries to manage these exposures by accelerating international currency settlements among those agents.\nHistorically, the quarterly operating results of the Logistics segment have been subject to seasonal trends. The fiscal third and fourth quarters have traditionally been the strongest, and the fiscal second quarter has traditionally been the weakest. This pattern has been the result of, or influenced by, numerous factors including climate, national holidays, consumer demand, economic conditions and other similar and subtle forces.\nA significant portion of Logistics segment revenues are derived from customers in industries with shipping patterns tied to consumer demand and/or just-in-time production schedules. Many Logistics customers may ship a significant portion of their goods at or near the end of a quarter. Therefore, the timing of revenues is, to a large degree, affected by factors beyond the segments control, such as shifting consumer demand for retail goods and manufacturing production delays. We cannot accurately forecast many of these factors, nor can we estimate the relative impact of any given factor. Therefore, historical patterns experienced may not continue in the future.\nGovernment Regulation\nInterstate and international transportation of freight is highly regulated. Failure to comply with applicable state and federal regulations, or to maintain required permits or licenses, can result in substantial fines or revocation of operating permits or authorities imposed on both transportation intermediaries and their shipper customers. We cannot give assurance as to the degree or cost of future regulations on our business. Some of the regulations affecting our current and prospective operations are described below.\nLogistics is a customs broker licensed and permitted by U.S. Customs and Border Protection (CBP). All U.S. customs brokers are required to maintain prescribed records and are subject to periodic audits by CBP. Logistics is a registered Ocean Transportation Intermediary (OTI) and is licensed as a non-vessel operating common carrier (NVOCC) by the Federal Maritime Commission (FMC). The FMC has established certain qualifications for shipping agents, including certain surety bonding requirements. We also operate as a Transportation Security Administration (TSA) certified Indirect Air Carrier (IAC), providing air freight services, subject to commercial standards set forth by the International Air Transport Association (IATA) and federal regulations issued by the Transportation Security Administration.\nAir freight forwarding operations are subject to regulation, as an indirect air cargo carrier, under the Federal Aviation Act, as enforced by the Federal Aviation Administration of the U.S. Department of Transportation and the Transportation Security Administration of the Department of Homeland Security. While air freight forwarders are exempted from most of the Federal Aviation Acts requirements by the Economic Aviation Regulations, the industry is subject to ongoing regulatory and legislative developments that can impact the economics of the industry by requiring changes to operating practices or influencing the demand for, and the costs of, providing services to customers.\nSurface freight forwarding operations are subject to various state and federal statutes and are regulated by the Federal Motor Carrier Safety Administration of the U.S. Department of Transportation and, to a very limited extent, the Surface Transportation Board. These federal agencies have broad investigatory and regulatory powers, including the power to issue a certificate of authority or license to engage in the business; to approve specified mergers, consolidations and acquisitions; and to regulate the delivery of some types of domestic shipments and operations within particular geographic areas.\nThe Federal Motor Carrier Safety Administration also has the authority to regulate interstate motor carrier operations, including the regulation of certain rates, charges and accounting systems; to require periodic financial reporting; and to regulate insurance, driver qualifications, operation of motor vehicles, parts and accessories for motor vehicle equipment, hours of service of drivers, inspection, repair, maintenance standards and other safety related matters. The federal laws governing interstate motor carriers have both direct and indirect application to the Company. The breadth and scope of the federal regulations may affect our operations and the motor carriers that are used in the provisioning of the transportation services. In certain locations, state or local permits or registrations may also be required to provide or obtain intrastate motor carrier services.\nRisk Management and Insurance\nAs a property freight broker, we are not legally liable for loss or damage to our customers cargo. In our customer contracts, we may agree to assume cargo liability up to a stated maximum.\nWe typically do not assume cargo liability above minimum industry standards in our international freight forwarding, ocean transportation or air freight businesses on international or domestic air shipments. With regards to international freight forwarding, ocean transportation and international domestic air freight shipments, we offer our customers the option to purchase shippers insurance coverage to insure goods in transit. When we agree to store goods for our customers for longer terms, we provide limited warehousemans coverage to our customers and typically contract for warehousing services from companies that provide us the same degree of coverage.\nWe maintain a broad cargo liability insurance policy to help protect us against catastrophic losses that may not be recovered from the responsible contracted carrier. We also carry various liability insurance policies, including automobile and general liability, with an umbrella policy.\nLife Sciences\nThe Companys wholly-owned Life Sciences segment manufactures and distributes high-quality monoclonal and polyclonal antibodies, diagnostic reagents and other immunoreagents for biomedical research and provides antibody manufacturing for academic and industry research scientists.\nOur Life Sciences segment also produces products for life science companies on an original equipment manufacturer (OEM) basis. Through a combined portfolio of nearly 3,000 products and a range of custom services, the Life Sciences segment provides the scientific community with high-quality tools to support critical research efforts.\nOur Life Sciences segment is based in Davis, California on an owned 40-acre facility and three\nother leased locations in the U.S. Our growth strategy is to place high-quality products in the hands of more researchers to accelerate scientific discovery.\nOur growth strategies include:\nProduct innovation: By working with key researchers and scientific organizations, we seek to develop new products to enhance the range of tools available and thereby expand the capabilities of life science researchers.\nOperational improvement: We continue to enhance our operational designs and processes to be more efficient, which supports higher profitability and enables us to devote more resources to investments in growth and innovation.\nAttract and retain exceptional talent: High-quality scientists enable our top-quality products and services to be offered, which are key to our reputation in the marketplace.\nAcquisitions and investments: We intend to grow by acquiring new businesses with high-quality reputations that will benefit from our combined innovational and operational strength.\nCustomers and distribution methods: We sell our biotechnology products directly to customers, principally direct through our website or distributors. Some of our customers utilize our scientific expertise and production capabilities and purchase our products and re-label them. Our reputation for quality products is critical to our ability to attract new customers for both our products and services.\nBroad product offering: A number of companies supply protein-related research and diagnostic reagents. Customers choose their products based upon product quality, reputation and price. We believe a number of our products have long-standing reputations and that our portfolio overall is well-regarded, especially amongst the academic, diagnostic and pharmaceutical research community.\nManufacturing: Our antibodies are produced using a variety of technologies including traditional animal immunization and hybridoma technology as well as recombinant antibody techniques. We are not dependent on key or sole source suppliers for most of our products, as we typically have several outside sources for all critical raw materials necessary for the manufacture of our products.\nThe majority of our life science products are shipped within two days of receipt of customers orders. Consequently, we typically do not maintain a significant backlog of orders for our Life Sciences segment products.\nOur Life Sciences segment is subject to regulation. One of our subsidiaries, Antibodies, Inc., maintains International Organization of Standardization certification for medical devices to support our manufacturing operation. We also comply with regulations related to the United States Department of Agriculture, National Institutes of Health, Office of Laboratory Animal Welfare and the United States Food and Drug Administration. Many of our customers are regulated and must verify our compliance with their standards throughout the supply chain, which requires us to maintain careful records. The failure to comply with these regulations may impair our ability to compete in the marketplace.\nManufacturing\nThe Companys Manufacturing segment is composed of Indco, which is a majority-owned subsidiary of the Company that manufactures and distributes mixing equipment and apparatuses for specific applications within various industries. Indcos headquarters and manufacturing operations are located in a single owned facility in New Albany, Indiana.\nIndco provides solutions for the mixing needs of customers operating in diverse industries, including chemicals, inks, paints, construction, plastics, adhesives, cosmetics, food and pharmaceuticals. Solutions include standard product configurations, both manufactured and distributed, available for order from Indcos website and its print catalog, which is mailed quarterly. In addition, Indco manufactures custom-designed mixing solutions that Indco helps specify, design, machine, assemble and distribute. During the fiscal year ended September 30, 2023, Indco made approximately 3,900 individual shipments to customers. In fiscal 2023, approximately 86% of Indcos revenue came from manufacturing activity. The remainder of its revenue came from non-manufactured product distribution activity. Indcos revenue is generally level throughout the year with little seasonality.\nIndco relies on a variety of providers of raw materials, mechanical components and other services in order to manufacture its products. These providers include national and multi-national suppliers for common industrial components such as motors, gear drives, motor controls and many other standard hardware products. Additionally, regional and local suppliers provide Indco-specific parts such as castings and fabricated metal components. Raw materials-primarily steel bars, plates and shafts-are sourced from domestic steel mills through local distributors. Alternative or substantially similar options are available from suppliers other than those Indco currently employs. While custom cast or fabricated parts are at greater risk of supply interruption, alternative equivalent suppliers are typically available.\nOur growth strategy within the industrial mixer business is to enhance our reputation as a high-quality manufacturer of often customized products to meet specialized mixing needs. Indcos products are frequently utilized in mission-critical applications, making our high-quality and strong service offering highly valuable to our customers. Our growth strategy includes keeping our direct relationship with the customer relevant through our web presence, introducing new relevant products and expanding our reach into new and existing markets with sales efforts and partners.\nThe industrial mixer manufacturing industry is highly fragmented with low barriers to entry. Indco competes with companies of all sizes based on a combination of pricing, lead-times, service, quality and ability to reach customers through internet presence and catalog circulation.\nGovernment regulation directly governing Indcos industrial mixer product line is minimal. Changing energy efficiency standards, however, as mandated by the Department of Energy, can, over time, affect electric motor manufacturers whose products are used by Indco. Historically, these changes have resulted in only minor changes to our product line.\nIndco is subject to U.S. federal, state and local provisions regulating the discharge of materials into the environment or otherwise for the protection of the environment. Although current operations have not been significantly affected by compliance with these environmental laws, the Company cannot predict what impact future environmental regulations may have on Indco. Indco does not anticipate making any material capital expenditures for environmental control purposes during the remainder of the current or succeeding fiscal years.\nAdditional information with respect to Janels businesses\nOur principal executive offices and corporate headquarters are located at 80 Eighth Avenue, New York, New York 10011, and our telephone number is (212) 373-5895.\nJanel maintains a website (http://www.janelcorp.com) where certain corporate governance documents and links to its subsidiaries websites can be found. Janels periodic reports filed with the SEC can be accessed at the SECs website (http://www.sec.gov) and indirectly through Janels website (http://www.janelcorp.com). The information contained or connected to our website is not incorporated by reference into this Annual Report on Form 10-K and should not be considered part of this Annual Report on Form 10-K. ITEM 1A.\nRISK FACTORS\nThe following risk factors should be read carefully in connection with an evaluation of the Companys business and any forward-looking statements made in this Annual Report on Form 10-K and elsewhere. See the section entitled Cautionary Statement Regarding Forward-Looking Statements set forth above. Any of the following risks or others discussed in this Annual Report on Form 10-K or the Companys other SEC filings could materially adversely affect the Companys business, operating results and financial condition. An investment in Janels common stock is subject to risks inherent to the Companys business. The material risks and uncertainties that management believes affect Janel are described below. Additional risks and uncertainties that management is not aware of or focused on or that management currently deems immaterial may also impair the Companys business operations.\nRisk Factors Related To Janels Growth Strategy\nJanels strategy of expanding its business through acquisitions of other businesses presents special risks.\nJanel expects to grow its businesses in part by completing acquisitions, either through acquisitions of businesses within its existing segments or the expansion of its portfolio into new segments. In either case:\nJanels financial condition may not be sufficient to support the funding needs of an expansion program;\nJanel may not be able to successfully identify suitable investment opportunities;\nacquisitions that Janel undertakes may not be successfully consummated or enhance profitability; or\nexpansion opportunities may not be available to Janel upon reasonable terms.\nThere may be a limited number of operating companies available for acquisition that Janel deems to be desirable targets. At times, there may be a limited number of operating companies available for acquisition and fewer attractive targets may be available, and it may require more time, more effort and more resources to identify a suitable target and to consummate an acquisition. Janel may compete with entities whose financial resources, technical expertise and managerial capabilities are significantly greater than Janels. Therefore, Janel may be at a competitive disadvantage in negotiating and executing possible acquisitions. Even if Janel is successful in a competitive bidding process for an acquisition, this competition may affect the terms of completed transactions, and, as a result, Janel may pay more or receive less favorable terms than it expected for potential acquisitions.\nIn addition, even if Janel is able to successfully compete with these entities, it expects future acquisitions to encounter risks similar to those that past acquisitions have encountered, such as:\ndifficulty in assimilating/integrating the operations and personnel of the acquired businesses;\npotential disruption of Janels or the targets ongoing business;\ninability to realize the projected operational and financial benefits from the acquisition or to maximize financial and strategic benefits through the incorporation of acquired personnel and clients, particularly in a high interest environment;\ndifficulty maintaining uniform standards, controls, procedures and policies;\nimpairment of relationships with employees and clients resulting from integration of the newly acquired company;\nstrain on managerial and operational resources as management tries to oversee larger operations;\nsignificantly increased need for working capital to operate the acquired companies and;\nexposure to unforeseen liabilities of acquired companies.\nFurthermore, managements attention may be diverted by acquisition, investment, transition or integration activities. Janel may be required to dedicate additional management and other resources to newly acquired businesses.\nAdditionally, should Janel acquire a new line of business in which it has no operating history, the success of such new business cannot be assured. If an acquired entity is not efficiently or completely integrated, there may be a material adverse effect on Janels business and operations.\nJanel may be required to record a significant change to earnings if its goodwill and other amortizable intangible assets, or other investments, become impaired, which could have a material adverse effect on the companys financial condition and/or stock price.\nUnder generally accepted accounting principles in the United States (GAAP), we are required to test goodwill for impairment at least annually and to review our goodwill, amortizable intangible assets and other assets acquired through merger and acquisition activity for impairment when events or changes in circumstance indicate that the carrying value of such assets may no longer be recoverable. Factors that could lead to impairment of goodwill, amortizable intangible assets and other assets acquired via acquisitions include significant adverse changes in the business climate, actual or projected operating results affecting Janel or any of its particular segments, and a decline in the financial condition of our business. If our goodwill, amortizable intangible assets or other investments become impaired in the future, we may be required to record additional charges to earnings. Such charges would have a material adverse effect on our financial results.\nLitigation, indemnification claims and other unforeseen claims and liabilities may arise from the acquisition or operation of acquired businesses.\nJanel may face litigation or other claims as a result of certain terms and conditions of our acquisition agreements, stock purchase agreements, tender offers and other agreements to purchase equity interests in target companies, such as earnout payments or closing net asset adjustments. Alternatively, shareholder litigation may arise as a result of proposed acquisitions. Acquired businesses may have liabilities, or be subject to claims, litigation, or investigations that we did not anticipate or which exceed our estimates at the time of the acquisition. Any litigation relating to a potential acquisition will increase expenses associated with the acquisition or cause a delay in completing the acquisition, which may impact Janels profitability. Litigation related to acquisitions would also divert management time and resources. Janel may experience disruptions that could have a material adverse effect on its business and operations, especially where an acquisition target may have pre-existing compliance issues or deficiencies, or material weaknesses in internal controls over financial reporting.\nOur subsidiaries may not be able to fully utilize their tax benefits, which could result in increased cash payments for taxes in future periods.\nNet operating losses (NOLs) may be carried forward to offset federal and state taxable income in future years and reduce the amount of cash paid for income taxes otherwise payable on such taxable income, subject to certain limits and adjustments. If fully utilized, the NOLs and other carryforwards of our minority-owned investment could provide our subsidiaries with significant tax savings in future periods. Our subsidiaries ability to utilize these tax benefits in future years will depend upon their ability to generate sufficient taxable income and to comply with the rules relating to the preservation and use of NOLs, as well as potential future changes in tax laws. The potential benefit of the NOLs and other carryforwards may be limited or permanently lost as a result of the following:\na change in control of our subsidiaries that would trigger limitations on the amount of taxable income in future years that may be offset by NOLs and other carryforwards that existed prior to the change in control; and\nexaminations and audits by the IRS and other taxing authorities could reduce the amount of NOLs and other credit carryforwards that are available for future years.\nOur actions may have an impact on the NOLs of our minority-owned investment. The inability to use these NOLs, or the diminution in value of such NOLs, could have a material adverse effect on our business and operations.\nRising interest rates may negatively impact our investments and have a material adverse effect on our business and operations.\nInterest rates are highly sensitive to many factors that are beyond our control, including general economic conditions and policies of various governmental and regulatory agencies and, in particular, the Federal Reserve Board. The Federal Reserve has raised interest rates with total increases of 525 basis points since March 2022. Changes in interest rates could have an adverse impact on our business by increasing the cost of borrowing, affecting our interest costs and our ability to make new investments on favorable terms or at all. Additionally, interest rate fluctuations and changes in credit spreads on floating rate loans may have a negative impact on our investments and investment opportunities and, accordingly, may have a material adverse effect on our rate of return on invested capital, our net investment income, our net asset value and the market price of our securities. In addition, an increase in interest rates may make it difficult or impossible to make payments on outstanding debt. Any increase in interest rates could have a negative effect on our interest costs and investments, which could have a material adverse effect on our business and operations.\nWe may experience conflicts of interest with the minority shareholders of our businesses.\nThe boards of directors and officers of Janels non-wholly owned affiliated businesses have fiduciary duties to their respective shareholders. As a result, they may make decisions that are in the best interest of their shareholders generally, but which are not necessarily in the best interest of our shareholders. In dealings with us, the directors and officers of our affiliated businesses may make decisions that are different from the decisions we would make. These decisions may not be in the best interests of our shareholders, which may have an adverse effect on our business and operations.\nRisk Factors Related To Janels Business And Industries\n(in thousands except per share data)\nJanel may not have sufficient working capital to continue operations, and our current asset-based lending facility is dependent upon an accounts receivable balance that may fluctuate as a result of national and global events.\nJanels cash needs are currently met by commercial bank credit facilities, cash on hand and cash generated from current operations. Actual short- and long-term working capital needs will depend upon numerous factors, including operating results, the availability of a revolving line of credit, competition and the cost associated with growing, either internally or through acquisition, none of which can be predicted with certainty. If results of operations and availability under Janels bank lines of credit are insufficient to meet cash needs, Janel will be required to obtain additional investment capital or debt funding to continue operations. Our substantial debt obligations could restrict our operations and financial condition. Additionally, our ability to generate cash to make payments on our indebtedness depends on many factors beyond our control.\nAs of September 30, 2023, we had approximately $31,620 of short-term borrowings and long-term debt. We may also incur additional indebtedness in the future.\nOur debt service obligations will require us to use a portion of our operating cash flow to pay interest and principal on indebtedness rather than for other corporate purposes, including funding future expansion of our business and ongoing capital expenditures, which could impede our growth. Our substantial indebtedness could have other adverse consequences, including:\nmaking it more difficult for us to satisfy our financial obligations;\nincreasing our vulnerability to adverse economic, regulatory and industry conditions, and placing us at a disadvantage compared to our competitors that are less leveraged;\nlimiting our ability to compete and our flexibility in planning for, or reacting to, changes in our business and the industries in which we operate;\nlimiting our ability to borrow additional funds for working capital, capital expenditures, acquisitions and general corporate or other purposes; and\nexposing us to greater interest rate risk, including the risk to variable borrowings of a rate increase and the risk to fixed borrowings of a rate decrease.\nOur ability to make payments on our indebtedness will depend on our ability to generate cash in the future. Our ability to generate cash is subject to general economic, financial, competitive, legislative, regulatory and other factors, many of which are beyond our control.\nOur business may not generate sufficient cash flow from operations, and future borrowings may not be available to us in an amount sufficient to enable us to pay our indebtedness when scheduled payments are due or to fund other liquidity needs. In these circumstances, we may need to refinance all or a portion of our indebtedness on or before maturity. Any refinancing of our debt could be at higher interest rates and may require make-whole payments and compliance with more onerous covenants, which could further restrict our business operations. Our ability to refinance our indebtedness or obtain additional financing would depend on, among other things, our financial condition at the time, restriction in the agreements governing our indebtedness and the condition of the financial markets and the industries in which we operate. As a result, we may not be able to refinance any of our indebtedness on commercially reasonable terms or at all. Without this financing, we may have to seek additional equity or debt financing or restructure our debt, which could harm our long-term business prospects. Our failure to comply with the terms of any existing or future indebtedness could result in an event of default which, if not cured or waived, could result in the acceleration of the payment of all of our debt.\nPursuant to the borrowing agreement, our ability to borrow under our current asset-based lending facility relies on our accounts receivable balance as collateral. This accounts receivable balance is heavily influenced by tariffs, global freight prices, international trade and other global events. Our ability to collect on these accounts receivables may further impact our ability to borrow under our current agreement. In the event that our accounts receivable balance decreases, we may face limited opportunities to borrow on our line of credit.\nOur subsidiaries do not have long-term contracts with all of their customers, and the loss of customers with which we do not have long-term contracts may have a material adverse effect on our business and operations.\nOur businesses are based primarily upon individual orders, sales and service agreements with customers-not long-term contracts. Therefore, customers could cease purchasing products or using our services at any time, for any reason, and with little or no notice, and we would have no recourse. If a significant number of our customers reduce or choose not to purchase products or use our services, or we have to lower prices to retain customers, it may have a material adverse effect on our business and operations.\nSignificant changes or developments in U.S. laws or policies, including changes in U.S. trade policies and tariffs and the reaction of other countries thereto, may have a material adverse effect on our business and financial statements.\nSignificant changes or developments in U.S. laws and policies, such as laws and policies surrounding international trade, foreign affairs, manufacturing and development and investment in the territories and countries where we or our customers operate, can materially adversely affect our business and financial statements. Under the previous U.S. administration, the imposition of significant tariffs and increased trade tension between the United States and China greatly impacted domestic industries access to foreign markets. Similar trade restrictions in the future may have a material adverse effect on our business and financial statements.\nJanels businesses face aggressive competition from other companies with greater financial resources and from companies that operate in areas in which our companies plan to expand in the future.\nOur businesses face intense competition within the logistics, manufacturing and life science industries on a local, regional, national, and global basis. Competitors include companies ranging from start-up companies, which may be able to respond to customers needs more quickly, to large multinational companies, which may have greater financial, marketing, operational and research and development resources than Janel.\nIn the freight forwarding industry, our Logistics business competes with a large and diverse group of freight forwarding concerns, commercial air and ocean carriers and a large number of locally established companies in geographic areas where our Logistics business does business or intends to do business in the future. The loss of customers, agents or employees to competitors could adversely impact the ability of our Logistics business to be profitable. In addition, the transport of freight, both domestically and internationally, is highly competitive and price sensitive, and new competitors emerge annually. Changes in the volume of freight transported, shippers preferences as to the timing of deliveries as a means to control shipping costs, economic and political conditions, both in the United States and abroad, work stoppages, labor constraints, U.S. and foreign laws relating to tariffs, trade restrictions, foreign investments and taxation may all have significant impact on our Logistics business overall business, growth and profitability.\nIndco competes within the highly fragmented industrial mixer manufacturing industry, which has low barriers to entry. New competitors emerge annually, and many aggressively market through electronic media. Our competitors may be more innovative than us, and, as a result, Indco may be unable to compete effectively.\nOur Life Sciences business faces significant competition across many of its product lines. To remain competitive, Life Sciences must develop new products and periodically enhance its existing products, otherwise, it may lose market share and be unable to achieve revenue growth targets. We anticipate that Life Sciences may also have to adjust the prices of many of its products to stay competitive. In addition, new competitors, technologies, or market trends may emerge to threaten or reduce the value of our product lines. Failure to innovate and develop new products may impact the future sales and earnings of Life Sciences and, therefore, Janel.\nJanels businesses are dependent upon technically skilled employees, and failure to obtain and retain skilled technical personnel could materially adversely affect their operations.\nJanel believes that the success of its business is highly dependent on the continuing efforts of certain technically skilled employees, particularly experienced engineers in our Manufacturing segment and scientists in our Life Sciences segment. For example, Indcos production facilities require skilled personnel to operate and provide technical services and support for its business. Competition for the personnel required for Indcos business intensifies as activity increases. In periods of high utilization, it may become more difficult to find and retain qualified individuals. This could increase Indcos costs or have other adverse effects on its operations. Only some of our employees are subject to employment agreements. The loss of the services of technically skilled employees may have an adverse effect on Janels business and operations.\nIn order to respond to the high variability in our Logistics business model, it may be necessary to adjust staffing levels to changing market demands. In periods of rapid change, it is more difficult to match our Logistics business staffing levels to its business needs.\nClimate change and increased focus by governmental and non-governmental organizations, stockholders and customers on sustainability issues, including those related to climate change, may have a material adverse effect on our business and operations.\nScientists have concluded that increasing concentrations of greenhouse gases in the Earths atmosphere may produce climate changes that have significant physical effects, such as increased frequency and severity of storms, droughts, floods, wildfires and other climatic events. Our Life Sciences business operates out of three locations and our Manufacturing business in a single location. Increased frequency of extreme weather could cause increased incidence of disruption to the production and distribution of our products at these locations. Increasing natural disasters in connection with climate change could also be a direct threat to our third-party vendors, service providers or other stakeholders, including disruptions on supply chains or information technology or other necessary services for Janel. If Janels facilities, supply chains, distribution systems, or information technology systems experience any catastrophic loss as a result of such natural disasters, such event could disrupt the companys operations, delay production and shipments, result in defective products or services, diminish demand, damage customer relationships and our reputation and result in legal exposure and significant repair or replacement expenses.\nFederal, state and local governments, as well as some of our customers, are beginning to respond to climate change issues. This increased focus on sustainability may result in new legislation or regulations and customer requirements that could negatively affect us as we may incur additional costs or be required to make changes to our operations in order to comply with any new regulations or customer requirements. Legislation or regulations that potentially impose restrictions, caps, taxes, or other controls on emissions of greenhouse gases such as carbon dioxide, a by-product of burning fossil fuels such as those used in the trucks in our Logistics segment, may have a material adverse effect on our business and operations.\nMore specifically, legislative, or regulatory actions related to climate change may have a material adverse effect on Janel by increasing our Logistics business fuel costs and reducing fuel efficiency and could result in the creation of substantial additional capital expenditures and operating costs in the form of taxes, emissions allowances, or required equipment upgrades. Any of these factors could impair our operating efficiency and productivity and result in higher operating costs. In addition, revenues could decrease if we are unable to meet regulatory or customer sustainability requirements. Furthermore, over the past several years, new rules relating to the disclosure of a range of climate-related risks have been proposed and/or adopted by certain authorities, including the SEC and the state of California. We are currently assessing the applicability of these rules, but at this time we cannot predict the costs of implementation or any potential adverse impacts resulting therefrom. We could ultimately incur increased costs relating to the assessment and disclosure of climate-related risks as a result of these regulatory and legislative actions. These additional costs, changes in operations, or loss of revenues may have a material adverse effect on our business and operations. For example, the motor carriers we contract with are subject to increasingly restrictive laws protecting the environment, including those relating to climate change, which could directly or indirectly have a material adverse effect on our business. Future and existing environmental regulatory requirements may have a material adverse effect on operations and increase operating expenses, which in turn could increase our purchased transportation costs. Our customers, our business and operations could be materially adversely affected by these new rules and costs.\nOur business is subject to evolving corporate governance and public disclosure regulations and expectations, including with respect to environmental, social and governance matters, that could expose us to numerous risks.\nWe are subject to changing rules and regulations promulgated by a number of governmental and self-regulatory organizations, including the SEC and the Financial Accounting Standards Board. These rules and regulations continue to evolve in scope and complexity and many new requirements have been created in response to laws enacted by Congress, making compliance more difficult and uncertain. In addition, increasingly regulators, customers, investors, employees and other stakeholders are focusing on environmental, social and governance (ESG) matters and related disclosures. These changing rules, regulations and stakeholder expectations have resulted in, and are likely to continue to result in, increased general and administrative expenses and increased management time and attention spent complying with or meeting such regulations and expectations. For example, developing and acting on initiatives within the scope of ESG, and collecting, measuring and reporting ESG-related information and metrics can be costly, difficult and time-consuming and is subject to evolving reporting standards, including the SECs recently proposed and Californias recently enacted climate-related reporting requirements, and similar proposals by other international regulatory bodies. We may also communicate certain initiatives and goals, regarding environmental matters, diversity, responsible sourcing and social investments and other ESG related matters, in our SEC filings or in other public disclosures. These initiatives and goals within the scope of ESG could be difficult and expensive to implement, the technologies needed to implement them may not be cost-effective and may not advance at a sufficient pace, and we could be criticized for the accuracy, adequacy or completeness of the disclosure. Further, statements about our ESG-related initiatives and goals, and progress against those goals, may be based on standards for measuring progress that are still developing, internal controls and processes that continue to evolve, and assumptions that are subject to change in the future. In addition, we could be criticized for the scope or nature of such initiatives or goals, or for any revisions to these goals. If our ESG-related data, processes and reporting are incomplete or inaccurate, or if we fail to achieve progress with respect to our goals within the scope of ESG on a timely basis, or at all, our reputation, business, financial performance and growth could be adversely affected.\nJanel may face competition from parties who sell their businesses to Janel and from professionals who cease working for Janel.\nWhile we typically enter into non-competition and non-solicitation agreements with parties that sell their businesses to us, one or more of the former owners of an acquired business who cease working for Janel or persons who leave Janels employment may compete with Janel or solicit Janels employees or clients in the future. Even if ultimately resolved in Janels favor, any litigation associated with enforcing non-competition or non-solicitation agreements could be time consuming, costly and distract managements focus from Janels business. Moreover, states and foreign jurisdictions may interpret restrictions on competition narrowly and in favor of employees. Therefore, certain restrictions on competition or solicitation may be unenforceable. In addition, Janel may decide not to pursue legal remedies if it determines that the costs or other factors outweigh the benefits of any possible legal recourse. Such persons, because they have worked for Janel or an acquired business, may be able to compete more effectively with Janel and may be more successful in soliciting its employees and clients than unaffiliated third parties.\nTerrorist attacks and other acts of violence or war may affect any market on which the Companys shares trade, the markets in which the Companys subsidiaries operate and the Companys business operations and profitability.\nTerrorist acts or acts of war or armed conflict may have a material adverse effect on Janels business and operations. Any of these acts could result in increased volatility in, or damage to, the United States and worldwide financial markets and economy, and, in particular, could lead to increased regulatory requirements with respect to the security and safety of freight shipments and transportation. Acts of terrorism or armed conflict, and the uncertainty caused by such conflicts, could cause a reduction in demand for Janels businesses. In particular, this would have a corresponding adverse effect on Janels Logistics business.\nSecurity breaches or cybersecurity attacks may have a material adverse effect on Janels ability to operate, could result in personal information being misappropriated and may cause Janel to be held liable or suffer harm to its reputation.\nWe are dependent on information technology systems and infrastructures to carry out important operational activities and to maintain our business records. In addition, we rely on the systems of third parties. As part of our normal business operations, we connect and store certain personal identifying and confidential information relating to our customers, vendors, employees and suppliers. External and internal risks, such as malware, insecure coding, Acts of God, data leakage and human error pose a direct threat to our information technology systems and operations.\nWe, and the third parties with whom we conduct business, have faced, and may continue to be subject to, cybersecurity attacks and other intentional hacking. Any failure to identify and address such defects or errors or prevent a cyber-attack, including a ransomware attack, could result in service interruptions, operational difficulties, loss of revenues or market share, liability to customers or others, diversion of resources, injury to our reputation and increased service and maintenance costs. Addressing such issues could prove to be impossible or very costly and responding to resulting claims or liability could similarly involve substantial cost.\nIn addition, our insurance coverage and/or indemnification arrangements that we enter into, if any, may not be adequate to cover all of the costs related to cybersecurity attacks or disruptions resulting from such events. We must also rely on the safeguards put in place by customers, suppliers, vendors or other third parties to minimize the impact of cyber threats, other security threats or business disruptions. These third parties may have varying levels of cybersecurity expertise and safeguards. In the event of a breach affecting these third parties, our business and financial results could suffer materially.\nWhile, to date, we have not had a significant cyber-attack or breach that has had a material impact on our business or results of operations, we remain at risk of a data breach due, in part, to the intentional or unintentional non-compliance by a third partys employee or agent, the breakdown of a third partys data protection processes or a cyber-attack on a third partys information network and systems. Additionally, acquired companies will need to be integrated with our information technology systems, which may cause additional training or licensing cost, along with potential delays and disruption. In such event, our revenue, financial results and ability to operate profitably could be materially adversely affected. The challenges associated with integration of our acquisitions may increase these risks.\nOur inability to successfully recover should we experience a catastrophic event, disaster or other business continuity problem could cause material financial loss, loss of human capital, regulatory actions, reputational harm or legal liability.\nOur operations are dependent upon our ability to protect our personnel, offices and technology infrastructure against damage from business continuity events that could have a significant disruptive effect on our operations. Should we or a key vendor or other third party experience a local or regional disaster or other business continuity problem, such as an earthquake, fire, flood, hurricane, or other weather event power loss, terrorist attack, pandemic, security breach, power loss, telecommunications failure, software or hardware malfunctions or other natural or man-made disaster, our continued success will depend, in part, on the availability of our personnel, office facilities and the proper functioning of existing, new or upgraded computer systems, telecommunications and other related systems and operations. In events like these, while our operational size and our existing back-up systems provide us with some degree of flexibility, we still can experience near-term operational challenges with regard to particular areas of our operations. We could potentially lose access to key executives and personnel, sensitive data or experience material adverse interruptions to our operations or delivery of services to our customers in a disaster recovery scenario. For example, during the COVID-19 pandemic, there were concerns for and restrictions on our personnel (including health concerns, quarantines, shelter-in-place orders and restrictions on travel), and increased privacy and cybersecurity risks in light of an increase in remote work among our workforce and our third-party service providers and vendors.\nWe regularly assess and take steps to improve upon our existing business continuity plans and key management succession. However, a disaster on a significant scale or affecting certain of our key operating areas within or across regions, or our inability to successfully recover should we experience a disaster or other business continuity problem, could materially interrupt our business operations and cause material financial loss, loss of human capital, regulatory actions, reputational harm, damaged client relationships or legal liability.\nJanel may be subject to product and other liability risks for which it may not have adequate insurance coverage.\nWe may be named a defendant in product liability lawsuits alleging that products or services provided by Janel have resulted or could result in an unsafe condition or injury to consumers, particularly for our Life Sciences and Manufacturing segment products. There are several factors beyond our control that could lead to liability claims, such as the reliability and competence of the customers operators and the training of such operators. Any such third-party claims and product liability claims filed against Janel could carry potential liabilities in excess of our insurance coverage. We cannot be certain that our current insurance will be sufficient to cover any adverse determinations in such product liability lawsuits.\nIn the ordinary course of our Logistics business, we are a defendant in several legal proceedings arising out of the conduct of our Logistics business. These proceedings include third-party claims for property damage or bodily injury incurred in connection with our services. Within our Logistics segment, ELFS maintains auto liability for commercial trucking claims of up to $6,000,000 per occurrence, and general liability with of up to $6,000,000 per occurrence. Any such third-party claims filed against ELFS could carry potential liabilities in excess of our insurance coverage. We cannot be certain that our current insurance will be sufficient to cover any adverse determinations in such liability claims or lawsuits.\nLife Sciences faces an inherent business risk of exposure to product and other liability claims if its products or services are alleged or found to have caused injury, damage or loss. While we retain product liability insurance, we may be unable to obtain insurance with adequate levels of coverage for potential liability on acceptable terms or claims of this nature may be excluded from coverage under the terms of any insurance policy that we obtain. If we are unable to obtain such insurance or the amounts of any claims successfully brought against us substantially exceed our coverage, our business could be materially adversely affected.\nIf Indcos customers successfully assert product liability claims against it due to defects in Indcos products, its operating results may suffer, and its reputation may be harmed. Indco faces an inherent risk of exposure to claims in the event that the failure, use or misuse of its products results, or is alleged to result, in bodily injury, property damage or economic loss. While Indco believes that it meets or exceeds existing professional specification standards recognized or required in the industries in which it operates, Indco has been subject to claims in the past, and it may be subject to claims in the future. A successful product liability claim or series of claims against Indco, or a significant warranty claim or series of claims against it, could materially decrease its liquidity, and, therefore, Janels financial condition. There are several factors beyond our control that could lead to liability claims, such as the reliability and competence of the customers operators and the training of such operators. Any such product liability claims filed against Indco could carry potential liabilities in excess of our insurance coverage. We cannot be certain that our current insurance will be sufficient to cover any adverse determinations in such product liability lawsuits.\nIf we fail to comply with applicable privacy, security and data laws, regulations and standards, our business and reputation may be materially adversely affected.\nAs disclosed above, we connect and store certain personal identifying and confidential information relating to our customers, vendors, employees and suppliers. The collection, maintenance, protection, use, transmission, disclosure and disposal of sensitive personal information are regulated at the federal, state, international and industry levels and requirements are also imposed on us by contracts with clients. In some cases, such laws, rules, regulations and contractual requirements also apply to our vendors and require us to obtain written assurances of their compliance with such requirements. International laws, rules and regulations governing the use and disclosure of such information, such as the European Unions General Data Protection Regulation and various regulations being adopted by states throughout the U.S., can be more stringent than laws in the United States, and they vary across jurisdictions. In addition, more jurisdictions are regulating the transfer of data across borders and domestic privacy and data protection laws are generally becoming more onerous.\nThese laws, rules and contractual requirements are subject to change and the regulatory environment surrounding data security and privacy is increasingly demanding. Compliance with existing or new privacy, security and data laws, regulations and requirements may result in increased operating costs, and may constrain or require us to alter our business model or operations.\nOur management information and financial reporting systems are spread across diverse platforms and geographies.\nThe growth of our business through acquisitions has resulted in our reliance on the accounting, business information and other computer systems of these acquired entities to capture and transmit information concerning customer orders, carrier payment, payroll and other critical business data. We continue to make progress towards migrating our various legacy operating and accounting systems to a singular system. As long as an acquired business remains on another information technology system, we face additional manual calculations, training costs, delays and an increased possibility of inaccuracies in the data we use to manage our business and report our financial results. Any delay in compiling, assessing and reporting information could materially adversely impact our business; our ability to react timely to changes in volumes, prices, or other trends; or to take actions to comply with financial covenants, all of which could negatively impact our stock price.\nRisk Factors Related To Janels Logistics Business\nOur Logistics business depends on third-party carriers to transport our customers cargo.\nAs a non-asset-based provider of global logistics services, our Logistics businesss ability to serve its customers depends on the availability of air and sea cargo space, including space on passenger and cargo airlines, ocean carriers that service the transportation lanes and trucking companies that our Logistics business uses. Shortages of cargo space are most likely to develop around holidays and in especially heavy transportation lanes. In addition, available cargo space could be reduced as a result of decreases in the number of airlines or ocean carriers serving particular shipment lanes at particular times. Consequently, our ability to provide services for our customers could be adversely impacted by, among other things: shortages in available cargo capacity; changes by carriers and transportation companies in policies and practices such as scheduling, pricing, payment terms and frequency of service, increases in the cost of fuel, taxes and labor, changes in the financial stability or operating capabilities of carriers and other factors not within our control. Reductions in airfreight or ocean freight capacity may have a material adverse effect on our yields. Material interruptions in service or stoppages in transportation, whether caused by strike, work stoppage, lock-out, slowdown or otherwise, may materially adversely affect our business and operations.\nQuality customer service is important to our success, and any challenges in meeting our customers needs and requirements may result in loss of business, thereby materially adversely affecting our operating results.\nIn addition, any determination that our third-party carriers have violated laws and regulations could seriously damage our reputation and brands, resulting in diminished revenue and profit and increased operating costs.\nWe may be subject to claims arising from transportation of freight by the carriers with which we contract, and increased insurance premium costs may have a material adverse effect on our results of operations.\nWe use the services of multiple transportation companies in connection with our transportation operations. From time to time, drivers are, or may be, involved in accidents which may cause injuries and in which goods carried by them are lost or damaged. Such accidents usually result in equipment damage and, unfortunately, can also result in injuries or death. The resulting types and/or amounts of damages may be excluded from or exceed the amount of insurance coverage maintained by the contracted carrier. Although these drivers are not our employees and all of these drivers are employees, owner-operators, or independent contractors working for carriers, from time to time, claims may be asserted against us for their actions, or for our actions in retaining them. Claims against us may exceed the amount of our insurance coverage or may not be covered by insurance at all. A material increase in the frequency or severity of accidents, liability claims or workers compensation claims, or unfavorable resolutions of claims, may materially adversely affect our operating results. A material increase in the frequency or severity of accidents, claims for lost or damaged goods, liability claims, workers compensation claims, or unfavorable resolutions of any such claims could materially adversely affect our results of operations to the extent claims are not covered by our insurance or such losses exceed our reserves. Significant increases in insurance costs or the inability to purchase insurance as a result of these claims could also reduce our profitability and have an adverse effect on our results of operations. The timing of the incurrence of these costs may also materially adversely affect our operating results compared to prior periods.\nAdditionally, insurance carriers may increase premiums for transportation companies generally. We may also experience additional increases in our insurance premiums in the future if our claims experience worsens. If our insurance or claims expense increases and we are unable to offset the increase with desired levels of insurance at reasonable rates, it may have a material adverse effect on our results of operations and financial position. In some instances, certain insurance could become unavailable or available only for reduced amounts of coverage. If we were to incur a significant liability for which we were not fully insured, it may have a material adverse effect on our business and operations.\nFinally, we face risks associated with the handling of customer inventory. Some of our operating agreements include maintaining the inventory of our customers. Failure to property handle such inventory could expose us to monetary claims and expenses, as well as reputational harm to our business.\nHigher carrier prices may result in decreased adjusted gross profit.\nCarriers can be expected to charge higher prices if market conditions warrant, including as a result of increased costs of fuel, labor shortages, and increased shipping times due to supply chain disruptions. Our adjusted gross profit and income from operations may decrease if we are unable to increase our pricing accordingly. Increased demand for truckload services and pending changes in regulations may reduce available capacity and also lead to increased carrier pricing.\nA determination that owner-operators are employees, rather than independent contractors, could expose us to various liabilities and additional costs.\nFederal and state legislation as well as tax and other regulatory authorities may seek to assert that independent contractors in the transportation service industry, such as our owner-operators, are employees rather than independent contractors. For example, on September 18, 2019, the state of California passed Assembly Bill 5 (AB5), which codified a standard test for determining a workers status as an employee or independent contractor for purposes of determining employee benefits such as paid vacation, sick leave, meals, rest breaks and overtime, known as the ABC test. The ABC test is generally thought to lower the threshold for classifying a worker as an employee as opposed to an independent contractor. A particular aspect of the ABC test poses a distinct threat to the trucking industry; the test maintains that an independent contractor must undertake work that is outside the usual course of the hiring entitys business to avoid classification as an employee. For trucking companies hiring third-party truck drivers, it is unclear whether this prong of the test is satisfied or not. In August 2022, a federal District Court formally lifted the injunction that had previously kept AB5 from applying to Californias trucking sector. The lifting of the injunction further increases the likelihood that owner-operators may be classified as employees within the state.\nWhile relatively new in California, versions of the ABC test have existed in a number of other states over the years and have been challenged in various courts as violating the federal governments exclusive right to regulate motor carriers in interstate commerce. There can be no assurance that these interpretations and tax laws that consider these persons independent contractors will not change, that other federal or state legislation will not be enacted or that various authorities will not successfully assert a position that reclassifies independent contractors to be employees. If our owner-operators are determined to be our employees, that determination could materially increase our exposure under a variety of federal and state tax, workers compensation, unemployment benefits, labor, employment and tort laws, as well as our potential liability for employee benefits. As a result of the enactment of AB5, the lack of clear guidance from regulatory authorities and the courts on the application of AB5, and the possibility that other jurisdictions may enact similar laws, there is uncertainty regarding what the worker classification regulatory landscape will look like in future years\nIn addition, such changes may be applied retroactively, and, if so, we may be required to pay additional amounts to compensate for prior periods. Any of the above increased costs would materially adversely affect our business and operations.\nRecessions and other economic developments that reduce freight volumes could have a material adverse impact on our Logistics business.\nThe transportation industry historically has experienced cyclical fluctuations in financial results due to economic recession, downturns in business cycles of customers like those serviced by our Logistics business, interest rate fluctuations, government shutdowns and other economic factors beyond the control of our Logistics business. Deterioration in the economic environment subjects our Logistics business to various risks that may have a material impact on its operating results and cause it, and, therefore, Janel, to not reach its long-term growth goals, as a result of, for example, the following:\na reduction in overall freight volumes in the marketplace, reducing our Logistics businesss opportunities for growth;\neconomic difficulties encountered by some of our Logistics business customers, who may, therefore, not be able to pay our Logistics business in a timely manner or at all, or may go out of business;\neconomic difficulties encountered by a significant number of our Logistics businesss transportation providers, who may go out of business and, therefore, leave our Logistics business unable to secure sufficient equipment or other transportation services to meet commitments to its customers; and\nthe inability of our Logistics business to appropriately adjust its expenses to changing market demands.\nIn addition, if a downturn in the business cycles of our Logistics business customers causes a reduction in the volume of freight shipped by those customers, its, and, therefore, Janels, operating results could be materially adversely affected.\nOther events affecting the volume of international trade and international operations may have a material adverse effect on our Logistics international operations.\nIn addition to economic conditions, our Logistics businesss international supply chain services are directly related to, and dependent on, the volume of international trade, particularly trade between the United States and foreign nations. This trade, as well as our Logistics businesss international supply chain services, is influenced by many factors, including:\neconomic and political conditions in the United States and abroad;\nmajor work stoppages;\nexchange controls, currency conversion and fluctuations;\nwar, other armed conflicts and terrorism, such as the Russia-Ukraine conflict; and\nU.S. and foreign laws relating to tariffs, trade restrictions, foreign investment and taxation.\nThe foregoing and other events beyond the control of our Logistics business, such as a failure of various nations to reach or adopt international trade agreements or an increase in bilateral or multilateral trade restrictions, may have a material adverse effect on our Logistics segment.\nThe difficulty in accurately forecasting timing or volumes of customer shipments and/or rate changes by carriers could increase the cost of our operations. The unpredictability of short- and long-term fluctuations in such factors is influenced by volatile market conditions, global developments, consumer trends and numerous other factors outside of our companys direct control.\nFailure to comply with governmental permit and licensing requirements or statutory and regulatory requirements could result in civil and criminal sanctions, fines or revocation of our Logistics businesss operating authorities, and changes in these requirements may have a material adverse effect on our Logistics business.\nOur Logistics businesss operations are subject to various state, local, federal and foreign statutes and regulations prohibiting various activities that in many instances require permits and licenses. Failure to maintain compliance with applicable law and regulations, required permits or licenses, or to comply with applicable regulations, could result in substantial fines or revocation of our Logistics business operating authorities. Moreover, government deregulation efforts, modernization of the regulations governing customs clearance and changes in the international trade and tariff environment could require material expenditures or otherwise have a material adverse effect on our Logistics business specifically.\nOur Logistics business is subject to seasonal trends and other factors beyond our control.\nHistorically, our Logistics businesss operating results have been subject to seasonal trends when measured on a quarterly basis. Its second fiscal quarter has traditionally been the weakest, and the third and fourth fiscal quarters have traditionally been the strongest. As a result, its quarterly operating results are likely to continue to fluctuate. This trend is dependent on numerous factors, including the markets in which our Logistics business operates, holiday seasons, consumer demand, climate, economic conditions and numerous other factors. This historical seasonality has also been influenced by the growth and diversification of our Logistics business international network and service offerings. A substantial portion of our Logistics businesss revenue is derived from customers in industries whose shipping patterns are tied closely to consumer demand which can sometimes be difficult to predict or are based on just-in-time production schedules. Therefore, our Logistics businesss revenue is, to a large degree, affected by factors that are outside of its control. In addition, our Logistics business has several primarily variable expenses that are fixed for a period of time, and it may not be able to adequately adjust them in a period of rapid change in market demand. Our Logistics business historic operating patterns may not continue in future periods as it cannot influence or forecast many of these factors. Comparisons of our operating results from period to period are, therefore, not necessarily meaningful and should not be relied upon as an indicator of future performance.\nFactors Related To Janels Life Sciences Business\nChanges in governmental regulations may reduce demand for our products and/or increase our expenses.\nLife Sciences competes in markets in which it or its customers must comply with federal, state, local and foreign regulations, such as environmental, health and safety, and food and drug regulations. We develop, configure and market our products to meet customer needs created by these regulations. Any significant change in these regulations could reduce demand for our products and/or increase our costs of producing these products.\nThe success of Life Sciences depends on its ability to continually produce products that meet high quality standards such as purity, reproducibility and/or absence of cross- reactivity.\nProduct quality and reputation are key purchasing decision factors for our Life Sciences customers. While our Life Sciences operations have experienced and qualified personnel, long operating histories and substantial production systems and protocols in place, failure on our part to meet our customers high-quality product expectations (in particular with respect to product purity, reproducibility and specificity) may have a material adverse effect on our business and operations.\nThe success of Life Sciences is affected by its ability to maintain its intellectual property rights. If we are unable to adequately protect our intellectual property, if third parties infringe on our intellectual property rights, or if we are involved in disputes to determine the scope and validity of others proprietary rights, we may suffer competitive injury or expend significant resources enforcing our rights.\nIntellectual property rights heavily influence product development and differentiation. We own several patents, trademarks, copyrights, trade secrets and other intellectual property and licenses to intellectual property owned by others, which together are important to our business operations. However, the intellectual property rights we obtain are not always sufficiently broad and do not always guarantee a significant competitive advantage, and patents may not be issued for pending or future patent applications owned, submitted by, or licensed to us. Despite the steps that we and our licensors have taken to maintain and protect our intellectual property, we cannot fully prevent such intellectual property from being challenged, invalidated, circumvented, designed-around or becoming subject to compulsory licensing. Sometimes, enforcement may not be available to us because a third-party may have a dominant intellectual property position or for other business reasons.\nWe also rely on nondisclosure and noncompetition agreements with employees, consultants and other parties to protect, in part, trade secrets and other proprietary rights. There can be no guarantee that these agreements sufficiently protect our trade secrets and other proprietary rights and will not be breached, that we will have sufficient remedies for any breach, that others will not independently develop substantially equivalent proprietary information, or that third parties will not otherwise gain access to our trade secrets or other proprietary rights.\nWe may also be sued by third parties alleging that we have infringed their intellectual property rights. Such lawsuits are expensive, time-consuming and divert managements focus away from other business concerns. If we are found to be infringing the intellectual property of others, we could be required to cease certain activities, alter our products or processes, or pay licensing fees, any of which could cause unexpected costs and delays that may materially adversely affect us. If we are unable to obtain a required license on acceptable terms, or if we are unable to design around any third-party patent, we may be unable to sell some of our products and services, which could reduce revenue. Additionally, if we do not prevail in such lawsuits, a court may find damages or award other remedies in favor of the opposing party, which may materially adversely affect our earnings.\nThe biomedical and life sciences industries that we serve are under constant pressures to increase the predictability of or reduce healthcare costs, all of which may materially adversely affect our business and financial results due to our role in the healthcare supply chain.\nOur Life Sciences products are sold primarily to research scientists at biomedical and life sciences companies and at academic research institutions. Development spending by our customers and the availability of government research funding can fluctuate due to changes in available resources, mergers of pharmaceutical and biotechnology companies, spending priorities, general economic conditions and institutional and governmental budgetary policies. Efforts to reduce or increase the predictability of healthcare costs may impact all stages of the healthcare supply chain, including the acquisition of antibodies, diagnostic reagents, diagnostic kits and other immunoreagents for biomedical research and antibody manufacturing. In addition, consolidation trends in the pharmaceutical, biotechnology and diagnostic industries have served to create fewer customer accounts and to concentrate purchasing decisions for some customers. Failure to anticipate and respond to competitors actions may materially adversely affect the future sales and earnings of Life Sciences and, therefore, Janel.\nRisk Factors Related To Janels Manufacturing Business\nAny decrease in the availability, or increase in the cost, of raw materials could materially affect Indcos revenue and earnings.\nThe availability of certain critical raw materials such as motors, gear drivers, motor controls, standard hardware products, castings and steel bars, plates and shafts are subject to factors that are not within Indcos control. In some cases, these critical raw materials are purchased from suppliers operating in countries that may be subject to unstable political and economic conditions, or there may be other supply chain issues related to the procurement of such raw materials, including as a result of international conflicts, or climate change.\nWhile Indco has historically been able to source its raw materials from an assortment of suppliers, at any given time, Indco may be unable to obtain an adequate supply of critical raw materials on a timely basis, at prices and other terms acceptable to it, or at all. If Indco is unable to obtain adequate and timely deliveries of required raw materials, it may be unable to timely manufacture sufficient quantities of products. This could cause Indco to lose sales, incur additional costs, delay new product introductions or suffer harm to Indcos reputation.\nIf suppliers increase the price of critical raw materials or are unwilling or unable to meet Indcos demand, it may not have alternative sources of supply. In addition, costs of certain critical raw materials have been volatile due to factors beyond Indcos control. Raw material costs are included in Indcos contracts with customers, but in some cases Indco is exposed to changes in raw material costs from the time purchase orders are placed to when it purchases the raw materials for production. Changes in business conditions may have a material adverse effect on Indcos ability to recover rapid increases in raw material costs and may materially adversely affect Indcos, and, therefore, Janels, results of operations.\nThe extensive environmental, health and safety regulatory regimes applicable to Indcos operations create potential exposure to significant liabilities.\nThe nature of Indcos manufacturing business subjects its operations to numerous and varied federal, state, local and international laws and regulations relating to pollution, protection of public health and the environment, natural resource damages and occupational safety and health. Failure to comply with these laws and regulations, or with the permits required for Indcos operations, could result in fines or civil or criminal sanctions, third-party claims for property damage or personal injury and investigation and cleanup costs. Potentially significant expenditures could be required in order to comply with new environmental laws or requirements that may be adopted or imposed in the future. Indco has used, and currently uses, certain substances that are considered hazardous, extremely hazardous or toxic under worker safety and health laws and regulations. Although Indco implements controls and procedures designed to reduce the continuing risk of adverse impacts and environmental, health and safety issues, Indco could incur substantial cleanup costs, fines and civil or criminal sanctions, and third-party property damage or personal injury claims as a result of violations, non-compliance or liabilities under these regulatory regimes.\nAs a manufacturing business, Indco also must comply with federal and state environmental laws and regulations that relate to the manner in which Indco stores and disposes of materials and the related reports that Indco is required to file. Indco cannot ensure that it will not incur additional costs to maintain compliance with environmental laws and regulations or that it will not incur significant penalties for failure to be in compliance.\nIndco relies on a single location to manufacture its products.\nIndcos business operates out of a single location in New Albany, Indiana. Indco employs lean manufacturing techniques and, therefore, carries little inventory. Indco could experience prolonged periods of reduced production due to unforeseen catastrophic events occurring in or around its facility in Indiana. As a result, Indco may be unable to shift manufacturing capabilities to alternate locations, accept materials from suppliers, meet customer shipment needs or address other severe consequences that may be encountered, and Indco may suffer damage to its reputation. Indcos, and, therefore, Janels, financial condition and results of operations may be materially adversely affected were such events to occur.\nRisk Factors Related To Ownership of Janels Common Stock\nA small number of Janels stockholders have a controlling influence over Janel.\nA small number of Janels stockholders control the vote of approximately 67.3% of the outstanding shares of Janels common stock as of September 30, 2023, which includes Janel common stock such persons can acquire through the exercise of vested options granted to them. As a result, these stockholders could control the election of Janels directors and, therefore, have the ability to control the affairs of Janel. Furthermore, one particular investor in the Company has the right to appoint 50% of the members of Janels board of directors.\nAs a result, these few stockholders have controlling influence over, among other things, the ability to amend Janels certificate of incorporation and bylaws or effect or preclude fundamental corporate transactions involving Janel, including the acceptance or rejection of any proposals relating to a merger of Janel or an acquisition of Janel by another entity. The interests of these officers, directors and stockholders may conflict with those of other stockholders. This concentration of ownership may also delay, deter or prevent a change in control of Janel, and some transactions may be more difficult or impossible without the support of these parties.\nIt is unlikely that Janel will issue dividends on its common stock in the foreseeable future.\nJanel has never declared nor paid cash dividends on its common stock, and it does not intend to pay dividends in the foreseeable future. The payment of dividends in the future will be at the discretion of Janels board of directors.\nJanels stock price is subject to volatility.\nJanels common stock trades on the Pink tier of the OTC market under the symbol JANL. The market price of Janels common stock has been subject to significant fluctuations. There is an absence of a true market for Janel shares and thus a valid valuation is not readily maintained. This result is caused in part by the concentrated holdings of Janel, which has led to abnormal price volatility. Such fluctuations as well as economic conditions generally may adversely affect the market price of Janels common stock.\nOur common stock is not as frequently traded as compared to the volume of trading activity associated with larger companies whose shares trade on the larger national exchanges. Because of this limited liquidity, stockholders may be unable to sell their shares at the prices or volumes they desire. As a result, the trading price of our shares may occasionally fluctuate drastically. The trading price may be affected by a number of factors including events described in the risk factors set forth in this report as well as our operating results, financial condition, announcements, general conditions in the industry and the financial markets and other events or factors. In recent years, broad stock market indices, in general, and smaller capitalization companies, in particular, have experienced substantial price fluctuations. In a volatile market, we may experience wide fluctuations in the market price of our common stock. These fluctuations may have a negative effect on the market price of our common stock.\nWe have issued, and may continue to issue, shares of preferred stock with greater rights than our common stock.\nOur certificate of incorporation authorizes our board of directors to issue shares of preferred stock and to determine the price and other terms for those shares without the approval of our stockholders. As of September 30, 2023, for example, we had 11,368 shares of Series C Cumulative Preferred Stock outstanding. Any such preferred stock we may issue in the future could rank ahead of our common stock with respect to certain rights or obligations, including in terms of dividends and liquidation rights.\nJanel has no assurance of a continued public trading market.\nJanels common stock is quoted in the over-the-counter market on the Pink tier of the OTC market and, to the extent the market price of our common stock falls below $5.00 per share, may be subject to the low-priced security or so-called penny stock rules that impose additional sales practice requirements on broker-dealers who sell such securities. For any transaction involving a penny stock, the rules require, among other things, the delivery, prior to the transaction, of a disclosure schedule required by the SEC relating to the penny stock market. The broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative and current quotations for the securities. Finally, monthly statements must be sent disclosing recent price information for the penny stocks held in the customers account. These disclosure requirements may have the effect of reducing the level of trading activity in the secondary market for the stock that is subject to these penny stock rules. Consequently, to the extent we are subject to the penny stock rules, such rules may affect the ability of broker-dealers to trade our securities. As a result, characterization as a penny stock can discourage investor interest in and limit the marketability of our common stock.\nJanel incurs significant costs to comply with the laws and regulations affecting public companies, which could harm its business and results of operations.\nJanel is subject to the reporting requirements of the Securities Exchange Act of 1934, as amended (the Exchange Act), and the Sarbanes-Oxley Act of 2002, as amended (the Sarbanes- Oxley Act), and other applicable securities rules and regulations. These rules and regulations have increased, and will continue to increase, Janels legal, accounting and financial compliance costs and have made, and will continue to make, some activities more time-consuming and costly. For example, these rules and regulations could make it more difficult and more costly for Janel to obtain director and officer liability insurance, and Janel may be required to accept reduced policy limits and coverage or to incur substantial costs to maintain the same or similar coverage.\nThese rules and regulations could also make it more difficult for Janel to attract and retain qualified persons to serve on its board of directors or its board committees or as executive officers. Janels management and other personnel devote a substantial amount of time to these compliance initiatives. As a result, managements attention may be diverted from other business concerns, which could harm Janels business and operating results. ITEM 1B.\nUNRESOLVED STAFF COMMENTS\nNot applicable.\nITEM 1C.\nCYBERSECURITY\nNot applicable. ITEM 2.\nPROPERTIES\nJanels executive offices are located in approximately 3,300 square feet of leased space in New York, New York. The lease term ends September 1, 2025.\nAs of September 30, 2023, Logistics leased 6,900 square feet of office space in Garden City, New York. This location serves as the executive offices of the Logistics segment. The lease term ends March 31, 2025.\nAs of September 30, 2023, Logistics leased twenty-five additional office spaces, some of which are on a month-to-month basis, in sixteen states located in the United States. Lease terms for these locations expire at various dates through October 31, 2029.\nAs of September 30, 2023, Indco owned an approximately 12,600 square-foot manufacturing facility on a 1.2-acre parcel of land in New Albany, Indiana.\nAs of September 30, 2023, Life Sciences owned an approximately 25,000 square-foot manufacturing facility on a 40-acre parcel of land in Davis, California. The Life Sciences segment also leases three other offices in the United States. Lease terms for these locations expire at various dates through February 28, 2034.\nThe Company believes that its owned and leased properties are adequate to meet its occupancy needs in the foreseeable future. ITEM 3.\nLEGAL PROCEEDINGS\nJanel is occasionally subject to claims and lawsuits that typically arise in the normal course of business. While the outcome of these claims cannot be predicted with certainty, management does not believe that the outcome of any of these legal matters will have a material adverse effect on the Companys business, results of operations, financial condition or cash flows. The information otherwise called for by this item is incorporated herein by reference to Note 19, Risks and Uncertainties, in the notes to the consolidated financial statements included in Part II, Item 8 of this Form 10-K. ITEM 4.\nMINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5.\nMARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\n(in thousands, except share and per share data)\nJanel Corporations Common Stock is traded on the Pink tier of the OTC market under the symbol JANL.\nThe following table sets forth the high and low bid prices for the common stock for each full quarterly period during the fiscal years indicated. The prices reflect the high and low bid prices as available through the Pink tier of the OTC market and represent prices between dealers. They do not reflect retailer markups, markdowns or commissions and may not represent actual transactions.\nFiscal Year 2023\nFiscal Year 2022\nFiscal Quarter\nHigh\nLow\nHigh\nLow\nFirst Quarter, ended December 31,\n$\n49.00\n$\n36.00\n$\n29.00\n$\n15.52\nSecond Quarter, ended March 31,\n$\n39.00\n$\n28.00\n$\n52.00\n$\n16.75\nThird Quarter, ended June 30,\n$\n34.00\n$\n25.00\n$\n47.00\n$\n25.00\nFourth Quarter, ended September 30,\n$\n28.25\n$\n21.00\n$\n57.11\n$\n28.00\nOn September 30, 2023, the Company had 59 holders of its shares of common stock. This amount does not include street name holders or beneficial holders of our common stock, whose holders of record are banks, brokers and other financial institutions.\nThe closing price of the common stock on September 30, 2023 was $28.25 per share.\nCommon Stock Dividends\nWe have not declared, and currently do not plan to declare in the foreseeable future, dividends on our common stock.\nCommon Stock\nOn August 10, 2022, the Company issued 88,888 shares of its Common Stock, par value $0.001 per share, at a purchase price of $45 per share (the closing sale price per share of Common Stock on August 9, 2022) as reported on the Pink tier of the OTC market, or an aggregate purchase price of $4,000. The Shares were sold to accredited investors in a private placement in reliance upon the exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933 and Regulation D promulgated thereunder.\nSeries C Cumulative Preferred Stock (Series C Stock)\nOn March 31, 2022, the Company purchased 4,687 shares of the Series C Stock from two holders at a purchase price of $500 per share plus accrued and unpaid dividends, or an aggregate of $3,000, and exchanged 4,905 shares of Series C Stock plus accrued and unpaid dividends from one holder, for the issuance of 65,205 shares of the Companys Common Stock, par value $0.001 per share valued at $47.00 per share of Common Stock (the closing price for the Common Stock on March 30, 2022), or a total value of $3,065. The Company had 11,368 shares of Series C Stock outstanding as of September 30, 2023. ITEM 6.\nRESERVED ITEM 7.\nMANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOur discussions below in this Item 7 should be read along with Janels audited financial statements and related notes thereto as of September 30, 2023 and 2022 and for each of the two years in the period ended September 30, 2023 included in this Annual Report on Form 10-K.\nINTRODUCTION\nJanel is a holding company with subsidiaries in three business segments: Logistics, Life Sciences and Manufacturing. The Company strives to create shareholder value primarily through three strategic priorities: supporting its businesses efforts to make investments and to build long-term profits, allocating Janels capital at higher risk-adjusted rates of return and attracting and retaining exceptional talent. Management at the holding company level focuses on significant capital allocation decisions and corporate governance. Janel expects to grow through its subsidiaries organic growth and by completing acquisitions. We plan to either acquire businesses within our existing segments or expand our portfolio into new strategic segments. Our acquisition strategy focuses on reasonably-priced companies with strong and capable management teams, attractive existing business economics and stable and predictable earnings power.\nYear Ended September 30, 2023 Acquisitions\nOn May 22, 2023, the Company acquired all the rights, title and interests to a royalty agreement for certain antibody products, which we include in our Life Sciences segment.\nOn March 2, 2023, the Company completed a business combination whereby it acquired all of the outstanding stock of Stephen Hall, PhD Ltd., which we include in our Life Sciences segment.\nOn November 1, 2022, the Company completed a business combination whereby it acquired all of the outstanding stock of ImmunoBioScience Corporation, which we include in our Life Sciences segment.\nYear Ended September 30, 2022 Acquisitions\nOn August 15, 2022, the Company completed a business combination whereby it acquired all of the membership interests of ECM Biosciences LLC, which we include in our Life Sciences segment.\nInvestment in Marketable Securities - Rubicon\nOn August 19, 2022, the Company acquired 1,108,000 shares of the common stock, par value $0.001 per share, of Rubicon Technology, Inc. (Rubicon), at a price per share of $20.00, in a cash tender offer made pursuant to the Stock Purchase and Sale Agreement, dated July 1, 2022, between the Company and Rubicon (the Rubicon Purchase Agreement). Pursuant to the terms of the Rubicon Purchase Agreement, the acquired shares represented 45.0% of Rubicons issued and outstanding shares of common stock as of August 3, 2022, as reported in Rubicons Quarterly Report on Form 10-Q for the quarterly period ended June 30, 2022, filed with the SEC on August 12, 2022. The Company owned approximately 46.6% of Rubicons issued and outstanding shares of common stock as of September 30, 2023.\nResults of Operations - Janel Corporation\nOur results of operations and period-over-period changes are discussed in the following section. The tables and discussion should be read in conjunction with the accompanying Consolidated Financial Statements and the notes thereto appearing in Item 8.\nRefer to Item 7. Management Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the year ended September 30, 2022, filed on December 9, 2022, for a comparison of fiscal year 2022 results of operations to the fiscal year 2021 results of operations, which specific discussion is incorporated herein by reference.\nOur condensed consolidated results of operations are as follows:\nFinancial Summary\nFiscal years ended September 30,\n(in thousands)\nRevenue\n$\n186,449\n$\n316,863\nForwarding expenses and cost of revenues\n130,777\n250,666\nGross profit\n55,672\n66,197\nOperating expenses\n53,073\n56,699\nIncome from operations\n$\n2,599\n$\n9,498\nNet income (loss)\n$\n$\n(2,138\n)\nAdjusted operating income (1)\n$\n5,353\n$\n12,797\nConsolidated revenues for the year ended September 30, 2023 were $186,449, or 41.2% lower than fiscal 2022. Revenues decreased primarily due to lower freight prices in our Logistics segment as a result of lower freight demand relative to improved global transportation capacity. Income from operations for fiscal 2023 was $2,599 compared to income from operations of $9,498 for fiscal 2022, a decrease of $6,899, largely as a result of lower profits across our business segments, especially at our Logistics segment, which benefited from unusually high demand in the prior fiscal year. Adjusted operating income for fiscal 2023 decreased to $5,353 versus $12,797 in the prior fiscal year primarily due to an overall decrease in profits at our business segments.\nThe Companys net income for the year ended September 30, 2023 totaled $723 or $0.36 per diluted share, compared to net loss of ($2,138) or ($2.07) per diluted share for the year ended September 30, 2022. The increase in net income was largely due to a smaller non-cash mark-to-market write down of an equity investment, a change in fair value of an earnout and an income tax benefit, partially offset by lower profits in our business segments and higher interest expense.\n(1) The following table sets forth a reconciliation of income from operations to adjusted operating income:\nAdjusted Operating Income\nFiscal years ended September 30,\n(in thousands)\nIncome from operations\n$\n2,599\n$\n9,498\nAmortization of intangible assets\n2,098\n1,975\nStock-based compensation\nCost recognized on sale of acquired inventory\nAdjusted operating income\n$\n5,353\n$\n12,797\nBUSINESS PERFORMANCE\nResults of Operations - Logistics\nOur Logistics business helps its clients move and manage freight efficiently to reduce inventories and to increase supply chain speed and reliability. Key services include arrangement of freight forwarding by air, ocean and ground, customs entry filing, warehousing, cargo insurance procurement, logistics planning, product repacking and online shipment tracking.\nFinancial Summary\nFiscal years ended September 30,\n(in thousands)\nRevenue\n$\n166,052\n$\n295,343\nForwarding expense\n123,938\n242,946\nGross profit\n$\n42,114\n$\n52,397\nGross profit margin\n25.4\n%\n17.7\n%\nSelling, general and administrative expenses\n$\n37,310\n$\n40,075\nIncome from operations\n$\n4,804\n$\n12,322\nFiscal 2023 compared with fiscal 2022\nRevenue\nTotal revenue in fiscal 2023 was $166,052 as compared to $295,343 in fiscal 2022, a decrease of $129,291 or 43.8%. Revenues decreased primarily due to lower freight prices as a result of lower freight demand relative to improved global transportation capacity. Lower prices for ocean, air and trucking services led to a decrease in both gross revenue and forwarding expenses. Compared to fiscal 2022, during fiscal 2023, our volume, as measured in ocean freight by twenty-foot equivalent units, fell 25%, air freight volume as measured by metric tons fell 25% and customs entries fell 16%.\nGross Profit\nGross profit in fiscal 2023 was $42,114, a decrease of $10,283, or 19.6%, as compared to $52,397 in fiscal 2022. Gross profit as a percentage of revenue increased to 25.4% compared to 17.7% for the prior fiscal year, primarily because gross profit declined at a slower rate compared with gross revenue, which declined more significantly due to lower freight prices.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses in fiscal 2023 were $37,310 as compared to $40,075 in fiscal 2022. The decrease of $2,765, or 6.9%, was mainly due to lower personnel expenses and a recovery of previously expensed bad debt. As a percentage of gross revenue, selling, general and administrative expenses were 22.5% and 13.6% for fiscal 2023 and fiscal 2022, respectively. The increase in selling, general and administrative expenses as a percentage of revenue largely reflected the decrease in transportation rates and its impact on revenue.\nIncome from Operations\nIncome from operations decreased to $4,804 in fiscal 2023 compared to $12,322 in fiscal 2022. Income from operations decreased as a result of lower transportation volume and prices partially offset by lower personnel expense. Operating margin as a percentage of gross profit was 11.4% in fiscal 2023 compared to 23.5% in fiscal 2022, largely due to lower gross profits.\nResults of Operations - Life Sciences\nThe Companys Life Sciences segment manufactures and distributes high-quality monoclonal and polyclonal antibodies, diagnostic reagents and other immunoreagents for biomedical research and provides antibody manufacturing for academic and industry research scientists. Our Life Sciences business also produces products for other life science companies on an OEM basis.\nFinancial Summary\nFiscal years ended September 30,\n(in thousands)\nRevenue\n$\n11,059\n$\n11,625\nCost of sales\n1,951\n2,441\nCost recognized upon sale of acquired inventory\nGross profit\n$\n8,683\n$\n8,692\nGross profit margin\n78.5\n%\n74.8\n%\nSelling, general and administrative expenses\n$\n6,149\n$\n5,421\nIncome from operations\n$\n2,534\n$\n3,271\nFiscal 2023 compared with fiscal 2022\nRevenue\nTotal revenue was $11,059 in fiscal 2023 compared with $11,625 in fiscal 2022. Revenue decreased 4.9% or $566 primarily related to lower demand for diagnostic reagents, partially offset by current year acquisitions. Organic growth excluding acquisition revenue declined $1,408, or 12.1% as COVID-19 pandemic-related revenue declined in fiscal 2023.\nGross Profit\nGross profit was $8,683 and $8,692 for fiscal years 2023 and 2022, respectively, relatively consistent with prior year. In the fiscal years ended September 30, 2023 and 2022, the Life Sciences segment had a gross profit margin of 78.5% and 74.8%, respectively. The increase in gross profit margin resulted from an improvement in product mix.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses for the Life Sciences segment were $6,149 and $5,421 for fiscal years 2023 and 2022, respectively. The year-over-year increase was due to additional expenses from acquired businesses. As a percentage of revenue, selling, general and administrative expenses were 55.6% and 46.6% for fiscal 2023 and fiscal 2022, respectively.\nIncome from Operations\nThe Life Sciences business earned $2,534 and $3,271 in income from operations for fiscal 2023 and 2022, respectively. The decrease in income from operations was primarily due to lower demand for diagnostic reagents and additional expenses from acquired businesses. As a result of these factors, income from operations as a percentage of revenue declined from 28.1% in fiscal year 2022 to 22.9% in fiscal year 2023.\nResults of Operations - Manufacturing\nThe Companys Manufacturing segment reflects its majority-owned Indco subsidiary, which manufactures and distributes industrial mixing equipment.\nFinancial Summary\nFiscal years ended September 30,\n(in thousands)\nRevenue\n$\n9,338\n$\n9,895\nCost of sales\n4,463\n4,787\nGross profit\n$\n4,875\n$\n5,108\nGross profit margin\n52.2\n%\n51.6\n%\nSelling, general and administrative expenses\n$\n2,978\n$\n3,095\nIncome from operations\n$\n1,897\n$\n2,013\nFiscal 2023 compared with fiscal 2022\nRevenue\nTotal revenue was $9,338 in fiscal 2023 compared with $9,895 in fiscal 2022, a decrease of 5.6%. The revenue decline largely reflected a decrease in volume across the business, offset in part by higher product pricing.\nGross Profit\nGross profit was $4,875 and $5,108 for fiscal years 2023 and 2022, respectively. The year-over-year decline in gross profit reflected a decrease in sales volume. Gross profit margin for the Manufacturing segment during fiscal 2023 was 52.2%, as compared to 51.6%, in fiscal 2022. The increase in gross profit margin was generally due to a favorable product mix shift.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses for the Manufacturing segment were $2,978 and $3,095 for fiscal years 2023 and 2022, respectively, a decrease of $117, or 3.8%. As a percentage of gross revenue, selling, general and administrative expenses were 31.9% and 31.3% for fiscal 2023 and fiscal 2022, respectively, consistent with prior year.\nIncome from Operations\nIncome from operations for fiscal 2023 was $1,897 compared to $2,013 in fiscal 2022, representing a 5.8% decrease compared to the prior fiscal year and consistent with the decline in revenue.\nResults of Operations - Corporate and Other\nBelow is a reconciliation of income from operating segments to net (loss) available to common stockholders:\nYears Ended\nSeptember 30,\n(In thousands)\nTotal income from operating segments\n$\n9,235\n$\n17,606\nCorporate expenses\n(4,331\n)\n(5,342\n)\nAmortization expense\n(2,098\n)\n(1,976\n)\nStock-based compensation\n(207\n)\n(790\n)\nTotal Corporate expenses\n(6,636\n)\n(8,108\n)\nInterest expense\n(1,998\n)\n(1,276\n)\nChange in fair value of mandatorily redeemable non-controlling interest\n(135\n)\nFair value adjustments to Rubicon investment (net of dividends)\n(798\n)\n(7,601\n)\nChange in fair value of earnout\n(980\n)\nNet income before taxes\nIncome tax benefit (expense)\n(2,190\n)\nNet Income (loss)\n(2,138\n)\nPreferred stock dividends\n(284\n)\n(586\n)\nNon-controlling interest dividends\n-\n(404\n)\nNet income (loss) Available to Common Stockholders\n$\n$\n(3,128\n)\nTotal Corporate Expenses\nCorporate expenses, which include amortization of intangible assets, stock-based compensation and merger and acquisition expenses, decreased by $1,472 to $6,636, or 18.2%, in fiscal 2023 as compared to fiscal 2022. The decrease was due primarily to lower stock-based compensation expense and lower accounting and merger and acquisition related professional expense, offset in part by current year increases in amortization of intangible expenses. We incur merger and acquisition deal-related expenses and intangible amortization at the Corporate level rather than at the segment level.\nInterest Expense\nInterest expense for the consolidated company increased $722, or 56.6%, to $1,998 in fiscal 2023 from $1,276 in fiscal 2022. The increase was primarily due to higher interest rates, partially offset by lower average debt outstanding.\nIncome Tax Expense\nOn a consolidated basis, the Company recorded an income tax benefit of $198 in fiscal 2023, as compared to an income tax expense of ($2,190) in fiscal 2022. The decrease in income tax expense was primarily due to a decrease in pretax income.\nPreferred Stock Dividends\nPreferred stock dividends include the Companys Series C Stock and dividends accrued but not paid. For the fiscal years ended September 30, 2023 and 2022, preferred stock dividends were $284 and $586, respectively. Preferred stock dividends for fiscal 2023 decreased $302, or 51.5%, compared to fiscal 2022 as a result of the Company retiring $6,000 of Series C Preferred Stock on March 31, 2022 and due to a decrease in the annual dividend rate from 9% to 5%. Dividends accrued but not paid on the Companys Series C Stock were $2,029 and $1,745 as of September 30, 2023 and 2022, respectively.\nNet Income (loss)\nNet income (loss) was $723, or $0.60 per diluted share, for fiscal 2023 and ($2,138), or ($2.07) per diluted share, for fiscal year 2022. The increase in net income was primarily due to a smaller non-cash mark-to-market write-down of an equity investment, a change in fair value of an earnout, lower stock-based compensation and an income tax benefit offset by lower profits in our business segments and higher interest expense.\nNet income (loss) Available to Common Stockholders\nNet income (loss) available to common stockholders was $439 or $0.36 per diluted share for fiscal 2023 and ($3,128) or ($3.03) per diluted share for fiscal 2022. The increase in net income available to common stockholders was largely due to a smaller non-cash mark-to-market write-down of an equity investment, a change in fair value of an earnout, lower stock-based compensation and an income tax benefit offset by lower profits in our business segments and higher interest expense as well as lower preferred stock dividends and the absence of dividends to non-controlling shareholders.\nLIQUIDITY AND CAPITAL RESOURCES\nGeneral\nOur ability to satisfy liquidity requirements-including satisfying debt obligations and funding working capital, day-to-day operating expenses and capital expenditures-depends upon future performance, which is subject to general economic conditions, competition and other factors, some of which are beyond Janels control. Our Logistics segment depends on commercial credit facilities to fund day-to-day operations, as there is a difference between the timing of collection cycles and the timing of payments to vendors.\nAs a customs broker, our Logistics segment makes significant cash advances for a select group of our credit-worthy customers. These cash advances are for customer obligations, such as the payment of duties and taxes to customs authorities primarily in the United States. Increases in duty rates could result in increases in the amounts we advance on behalf of our customers. Cash advances are a pass through and are not recorded as a component of revenue or expense. The billings of such advances to customers are accounted for as a direct increase in accounts receivable from the customer and a corresponding increase in accounts payable to governmental customs authorities. These pass through billings can influence our traditional credit collection metrics. For customers that meet certain criteria, we have agreed to extend payment terms beyond our customary terms. Management believes that it has established effective credit control procedures and has historically experienced relatively insignificant collection problems.\nJanels cash flow performance for the 2023 fiscal year may not necessarily be indicative of future cash flow performance.\nAs of September 30, 2023, and compared with the prior fiscal year, the Companys cash and cash equivalents decreased by $4,130, or 62.7%, to $2,461 from $6,591 as of September 30, 2022. During the fiscal year ended September 30, 2023, Janels net working capital deficiency (current assets less current liabilities) decreased by $6,407, from ($13,143) at September 30, 2022 to ($19,550) at September 30, 2023.\nCash flows from operating activities\nNet cash provided by operating activities for fiscal years 2023 and 2022 was $11,388 and $12,107, respectively. The decrease in cash provided by operations for the year ended September 30, 2023 was driven principally by lower net income, deferred income tax provision, change in fair value of an earnout and an increase in prepaid expenses, partially offset by the timing of cash collections for accounts receivables and cash payments on accounts payable primarily in our Logistics segment for the year ended September 30, 2023.\nCash flows from investing activities\nNet cash used in investing activities, mainly for the acquisition of subsidiaries, was $6,500 for fiscal 2023 and $11,469 for fiscal 2022. Net cash used in investing activities for fiscal 2023 related to the two acquisitions in our Life Sciences segment and earnout payments the former owners of ELFS. The fiscal 2022 amount was associated with the Rubicon investment (net of dividend) and one Life Sciences acquisition. The Company also used $360 for the acquisition of property and equipment for the year ended September 30, 2023 compared to $551 for the year ended September 30, 2022.\nCash flows from financing activities\nNet cash (used in) financing activities was ($9,018) for fiscal 2023 and ($281) for fiscal 2022. Net cash used in financing activities in fiscal 2023 primarily included repayment of our term loan and line of credit. Net cash provided by financing activities in fiscal year 2022 primarily included proceeds from an increase in our amended term loan and proceeds from our private placement offering, offset in part by repayments on our line of credit and repurchase of Series C Preferred Stock.\nCredit Facilities\nLogistics\nSantander Bank Facility\nThe wholly-owned subsidiaries that comprise the Companys Logistics segment (collectively, the Janel Group Borrowers), with the Company as a guarantor, have a Loan and Security Agreement (as amended, the Santander Loan Agreement) with Santander with respect to a revolving line of credit facility (the Santander Facility). The Santander Loan Agreement was amended on March 31, 2022 to provide for, among other changes, the following: (i) the maximum revolving facility amount available was increased from $30,000 to $31,500 (limited to 85% of the borrowers eligible accounts receivable borrowing base and reserves, subject to adjustments set forth in the Santander Loan Agreement); (ii) the LIBOR basis on which interest under the Santander Loan Agreement was calculated under certain circumstances was changed to the Secured Overnight Financing Rate (SOFR) and interest on the Santander Facility accrues at an annual rate equal to the one-month SOFR plus 2.75%; (iii) a one-time increase from $1,000 to $3,000 in the amount the Company was permitted to distribute to holders of the Companys Series C Preferred Stock if specified conditions are met; and (iv) the amount of indebtedness of the Companys Antibodies Incorporated subsidiary that the Company was permitted to guaranty was increased from $2,920 to $5,000.\nOn July 13, 2022, the Santander Loan Agreement was further amended by a Consent, Waiver and Second Amendment (the Second Santander Amendment) to (i) increase the maximum revolving facility amount available to $35,000 (limited to 85% of the Janel Group Borrowers eligible accounts receivable borrowing base and reserves, subject to adjustments set forth in the Santander Loan Agreement) and (ii) provide for a new bridge term loan to the Company in the principal amount of up to $12,000 (the Bridge Facility) to be funded in connection with the acquisition (the Rubicon Transaction)by the Company of up to 45% of the outstanding shares of Rubicon Technology, Inc. (Rubicon). The Bridge Facility was drawn on August 18, 2022 and matured on the earlier to occur of (i) twenty (20) business days following the funding of the Bridge Facility and (ii) the date of funding of the dividend to be paid by Rubicon in connection with the Rubicon Transaction. The Company repaid the Bridge Facility in full on August 30, 2022. The Second Santander Amendment also contained a one-time waiver and consent to (a) the consummation of the Rubicon Transaction, and (b) a dividend of $2,500 to be paid by Janel Group, Inc., (the Janel Group) to the Company.\nOn January 30, 2023, the Santander Loan Agreement was further amended by the Third Amendment to the Amended and Restated Loan and Security Agreement (the Third Santander Amendment). As amended by the terms of the Third Santander Amendment, the percentage of the Borrowers eligible accounts receivable used to calculate the borrowing base under the Loan Agreement was increased from 85% to 90% for Domestic Insured Accounts (as defined in the Amendment), subject to adjustments set forth in the Loan Agreement.\nOn April 25, 2023, in connection with an amendment to the Credit Agreement entered into with First Merchants Bank (First Merchant) as described further below, we entered into the Fourth Amendment to the Amended and Restated Loan and Security Agreement (the Fourth Santander Amendment). The Fourth Santander Amendment (i) included modifications to address the amendments made to the First Merchants Credit Facilities (as defined below) and the consolidation of the debt thereunder and (ii) terminated the subordination agreement relating to the Companys guarantee of the First Merchants Credit Facilities.\nOn August 22, 2023, we entered into the Fifth Amendment to the Amended and Restated Loan and Security Agreement (the Fifth Santander Amendment). The Fifth Santander Amendment permitted certain unsecured guaranties by the Company in the ordinary course of business guarantying obligations of subsidiaries in an aggregate amount not to exceed $4,000 and related modifications to certain negative covenants.\nThe Santander Loan Agreement matures on September 21, 2026. Interest accrues on the Santander Facility at an annual rate equal to the one-month SOFR plus 2.75%. The Janel Group Borrowers obligations under the Santander Facility are secured by all of the assets of the Janel Group Borrowers, while the Santander Loan Agreement contains customary terms and covenants. As a result of its terms, the Santander Facility is classified as a current liability on the consolidated balance sheet.\nAt September 30, 2023, outstanding borrowings under the Santander Facility were $18,759, representing 53.6% of the $35,000 available thereunder, and interest was accruing at an effective interest rate of 7.60%.\nAt September 30, 2022, outstanding borrowings under the Santander Facility were $26,396, representing 75.4% of the $35,000 available thereunder, and interest was accruing at an effective interest rate of 5.79%.\nThe Company was in compliance with the financial covenants defined in the Santander Loan Agreement at both September 30, 2023 and September 30, 2022.\nWorking Capital Requirements\nThrough September 30, 2023, the Logistics segments cash needs were met by the Santander Facility and cash on hand. As of September 30, 2023, the Logistics segment had, subject to collateral availability, $1,622 available for future borrowings under its $35,000 Santander Facility and $906 in cash.\nThe Company believes that its current financial resources will be sufficient to finance the operations and obligations (current and long-term liabilities) of the Logistics segment for the short- and long-term. However, the actual working capital needs of the Logistics segment will depend upon numerous factors, including operating results; the costs associated with growing the Logistics segment, either organically or through acquisitions; competition and availability under the Santander Facility, none of which can be predicted with certainty. If cash flow and available credit are not sufficient to fund working capital, the operations of the Logistics segment will be materially negatively impacted.\nLife Sciences and Manufacturing\nFirst Merchants Bank Credit Facility\nOn February 29, 2016, Indco entered into a Credit Agreement (as amended, the Prior First Merchants Credit Agreement) with First Merchants.\nOn August 1, 2022, Indco and First Merchants entered into Amendment No. 3 to the Prior First Merchants Credit Agreement, modifying the terms of Indcos credit facilities. Under the revised terms, the credit facilities consisted of a $5,500 term loan, a $1,000 (limited to the borrowing base and reserves) revolving loan, and the continuation of a mortgage loan in the original principal amount of $680 (collectively, the Prior First Merchants Facility). Interest accrued on the term loan at an annual rate equal to one-month adjusted term SOFR plus either 2.75% (if Indcos total funded debt to EBITDA ratio was less than 2:1), or 3.5% (if Indcos total funded debt to EBITDA ratio was greater than or equal to 2:1). Interest accrued on the revolving loan at an annual rate equal to one-month adjusted term SOFR plus 2.75%. Interest accrued on the mortgage loan at an annual rate of 4.19%. Indcos obligations under the Prior First Merchants Credit Facility were secured by all of Indcos real property and other assets, and are guaranteed by Janel, and Janels guarantee of Indcos obligations was secured by a pledge of Janels Indco shares.\nOn April 25, 2023, Indco and certain other Subsidiaries of the Company that are part of the Life Science and Manufacturing segments (together with Indco, the Borrowers and each, a Borrower), entered into a Credit Agreement (the Credit Agreement) with First Merchants. The Credit Agreement constitutes an amendment and restatement of the Prior First Merchants Credit Agreement. The credit facilities provided under the Credit Agreement (the First Merchants Credit Facilities) consist of a $3,000 revolving loan (limited to the borrowing base and reserves), a $5,000 acquisition loan, a $6,905 Term A loan and a $620 Term B loan as a continuation of the mortgage loan under the Prior First Merchants Credit Agreement. Interest accrues on the outstanding revolving loan, Term A loan and acquisition loan at an annual rate equal to one-month adjusted term SOFR plus either (i) 2.75% (if the Borrowers total funded debt to EBITDA ratio is less or equal to 1.75:1) or (ii) 3.50% (if the Borrowers total funded debt to EBITDA ratio is greater than to 1.75:1). Interest accrues on the Term B loan at an annual rate of 4.19%. The Borrowers obligations under the First Merchants Credit Facilities are secured by all of the Borrowers real property and other assets, and are guaranteed by the Company, and the Companys guarantee of the Borrowers obligations is secured by a pledge of the Companys equity interests in certain of the Borrowers. The revolving loan portion will expire on August 1, 2027, the Term A loan portion will mature on April 25, 2033, the Term B loan portion will mature on July 1, 2025 and the acquisition loan will permit multiple draws until October 25, 2024, at which point the outstanding principal amount will amortize, with all remaining amounts due at maturity of the acquisition loan on April 25, 2029; each of the foregoing maturities, subject to earlier termination as provided in the Credit Agreement and unless renewed or extended.\nAs of September 30, 2023, there were $500 of outstanding borrowings under the acquisition loan, $450 of outstanding borrowings under the revolving loan, $6,235 of outstanding borrowings under the Term A loan and $610 of outstanding borrowings under the Term B loan, with interest accruing on the acquisition loan and revolving loan at an effective interest rate of 8.18% and on the Term A loan and Term B loan at an effective interest rate of 8.18% and 4.19%, respectively.\nAs of September 30, 2022, there were no outstanding borrowings under the revolving loan under the Prior First Merchants Credit Agreement, $5,420 of borrowings under the term loan under the Prior First Merchants Credit Agreement, and $631 of borrowings under the mortgage loan under the Prior First Merchants Credit Agreement with interest accruing on such term loan and mortgage loan at an effective interest rate of 6.63% and 4.19%, respectively.\nThe Company was in compliance with the financial covenants defined in the First Merchants Credit Agreement at September 30, 2023 and the Prior First Merchants Credit Agreement at September 30, 2022.\nWorking Capital Requirements\nLife Sciences and Manufacturings cash needs are currently met by the Term A loan, Term B loan, revolving loan and acquisition loan under the First Merchants Credit Facilities and cash on hand. As of September 30, 2023, Life Sciences and Manufacturing had $2,550 available under its $3,000 revolving loan and had $4,500 available under its $5,000 acquisition loan subject to collateral availability and $1,101 and $266 in cash, respectively. The Company believes that the current financial resources will be sufficient to finance the Life Sciences and Manufacturing segments operations and obligations (current and long-term liabilities) for the long and short- term. However, actual working capital needs will depend upon numerous factors, including operating results; the cost associated with growing the Life Sciences and Manufacturing segments, either organically or through acquisitions; competition; and availability under the revolving credit facility, none of which can be predicted with certainty. If cash flow and available credit are not sufficient to fund working capital, Life Sciences and Manufacturings operations will be materially negatively impacted.\nLife Sciences\nFirst Northern Bank of Dixon\nAntibodies Incorporated (Antibodies), a wholly-owned subsidiary of the Company, entered into a Business Loan Agreement (as amended, the First Northern Loan Agreement) with First Northern Bank of Dixon (First Northern) on June 21, 2018. The First Northern Loan Agreement provided for a $2,235 term loan (the First Northern Term Loan) and a $750 revolving credit facility (the First Northern Revolving Loan).\nAntibodies also entered into two separate business loan agreements with First Northern: a $125 term loan in connection with a potential expansion of solar generation capacity on the Antibodies property (the First Northern Solar Loan) on November 18, 2019 and a $60 term loan in connection with a potential expansion of generator capacity on the Antibodies property (the First Northern Generator Loan) on June 19, 2020.\nOn April 25, 2023, each of the First Northern Term Loan, the First Northern Revolving Loan, the First Northern Solar Loan and the First Northern Generator Loan was paid in full with the proceeds provided by the First Merchants Credit Facilities and the First Merchants Loan Agreement. In connection with the repayment, each business loan agreement governing such First Northern loans was terminated and all liens granted to First Northern in connection with the First Northern Loan Agreement and such business loan agreements on any property of Antibodies were released. Antibodies has no further obligations owing to First Northern in connection with the First Northern Loan Agreement and such business loan agreements.\nAs of September 30, 2022, the total amount outstanding under the First Northern Term Loan was $2,084, of which $2,027 is included in long-term debt and $57 is included in current portion of long-term debt, with interest accruing at an effective interest rate of 4.18%.\nAs of September 30, 2022, the total amount outstanding under the First Northern Solar Loan was $23, of which $15 is included in long-term debt and $8 is included in current portion of long-term debt, with interest accruing at an effective interest rate of 4.43%.\nAs of September 30, 2022, there were no outstanding borrowings under the First Northern Revolving Loan.\nThe Company was in compliance with the financial covenants defined in the First Northern Loan Agreement at April 25, 2023.\nCURRENT OUTLOOK\nThe results of operations in the Logistics, Life Sciences and Manufacturing segments are affected by the general economic cycle, particularly as it influences global trade levels and specifically the import and export activities of our Logistics segments various current and prospective customers. Historically, the Companys annual results of operations have been subject to seasonal trends which have been the result of, or influenced by, numerous factors including climate, national holidays, consumer demand, economic conditions, the growth and diversification of the segments international network and service offerings and other similar and subtle forces.\nThe Company cannot accurately forecast many of these factors, nor can it estimate accurately the relative influence of any particular factor and, as a result, there can be no assurance that historical patterns, if any, will continue in future periods.\nThe Companys subsidiaries are implementing business strategies to grow revenue and profitability for fiscal 2024 and beyond. Our Logistics strategy calls for additional branch offices, introduction of new revenue streams for existing locations, sales force expansion, additional acquisitions and a continued focus on implementing lean methodologies to contain operating expenses.\nOur Life Sciences and Manufacturing segments expect to introduce new product lines and wider distribution and promotion of their products with internet sales efforts. In addition to supporting its subsidiaries growth plans, the Company may seek to grow by entering new business segments through acquisition.\nCertain elements of the Companys profitability and growth strategy, including proposals for acquisition and accelerating revenue growth, are contingent upon the availability of adequate financing on terms acceptable to the Company.\nWithout adequate equity and/or debt financing, the implementation of significant aspects of the Companys strategic growth plan may be deferred beyond the originally anticipated timing, and the Companys operations may be materially negatively impacted.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur accounting policies are described in Note 1 - Summary of Significant Accounting Policies, included herein, which contains a summary of the significant accounting policies and methods used in the preparation of our consolidated financial statements. Our financial statements are prepared in conformity with accounting principles generally accepted in the United States (GAAP), which require us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the year. Actual results could differ from those estimates. We consider the following policies to be the most critical in understanding the judgments that are involved in preparing our financial statements and the uncertainties that could impact our results of operations, financial condition and cash flows.\nBusiness Combinations and Related Acquired Intangible Assets and Goodwill. We record all tangible and intangible assets acquired and liabilities assumed in a business combination at fair value as of the acquisition date in accordance with Accounting Standards Codification (ASC) 805 Business Combinations. Acquisition date fair value represents the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants as measured on the acquisition date. The valuations are based on information that existed as of the acquisition date. During the measurement period, which shall not exceed one year from the acquisition date, we may adjust provisional amounts recorded for assets acquired and liabilities assumed to reflect new information that we have subsequently obtained regarding facts and circumstances that existed as of the acquisition date. Such fair value assessments require judgments and estimates, which may cause final amounts to differ materially from original estimates.\nAs part of acquisitions of businesses, we acquired certain identifiable intangible assets, which are valued as of the acquisition date using a discounted cash flow (DCF) model. Key assumptions in the DCF model include (i) future revenues, (ii) earnings before interest, taxes depreciation and amortization (EBITDA) and (iii) the weighted average cost of capital discount rate. Estimated future revenues include assumptions about our ability to renew contracts in a competitive bidding process. A decrease in revenues or gross and EBITDA margins may adversely affect the value of identifiable intangible assets. The discount rate focuses on rates of return for equity and debt and is calculated using public information from selected guideline companies. The magnitude of the discount rate reflects the perceived risk of an investment. A change in the estimated risk of the acquired company cash flows would change the discount rate, which in turn could significantly affect the valuation of acquired identifiable intangible assets.\nThe excess amount of the aggregated purchase consideration paid over the fair value of the net of assets acquired and liabilities assumed is recorded as goodwill. Goodwill is evaluated for impairment annually or more frequently if an event occurs or circumstances change, such as material deterioration in performance that would indicate an impairment may exist. During the fourth quarter of 2021, we changed the date of our annual impairment test of goodwill and indefinite-lived intangible assets from September 30 to July 1. When evaluating goodwill for impairment, we may first perform a qualitative assessment (step zero of the impairment test) to determine whether it is more likely than not that a reporting unit is impaired. If we decide not to perform a qualitative assessment, or if we determine that it is more likely than not the carrying amount of a reporting unit exceeds its the fair value, then we perform a quantitative assessment (step one of the impairment test) and calculate the estimated fair value of the reporting unit. If the carrying amount of the reporting unit exceeds the estimated fair value, an impairment charge would be recorded to reduce the carrying amount to its estimated fair value. The decision to perform a qualitative impairment assessment in a given year is influenced by a number of factors, including the significance of the excess of the reporting units estimated fair value over carrying amount at the last quantitative assessment date, the amount of time in between quantitative fair value assessments and the date of our acquisitions.\nNo indicators of impairment were identified from the date of our annual impairment test through September 30, 2023.\nA qualitative assessment is performed for intangibles and long-lived assets to determine if there are any indicators that the carrying amount might not be recovered. A quantitative analysis may be performed in order to test the intangibles and long-lived assets for impairment. If a quantitative analysis is necessary, an income approach, specifically a relief from royalty method, is used to estimate the fair value of the intangibles and long-lived assets. Principal factors used in the relief from royalty method that require judgment are projected net sales, discount rates, royalty rates and terminal growth assumptions.\nThe estimated fair value of each intangible and long-lived assets is compared to its carrying amount to determine if impairment exists. If the carrying amount of a intangibles and long-lived assets exceeds the estimated fair value, an impairment charge would be recorded to reduce the carrying amount of the intangibles and long-lived assets. No indicators of impairment of our intangibles and long-lived assets were identified from the date of our annual impairment test through September 30, 2023.\nRECENT ACCOUNTING STANDARDS\nThe recent accounting standards is discussed in Note 1 to the consolidated financial statements contained in this report.\nNON-GAAP FINANCIAL MEASURES\nWhile we prepare our financial statements in accordance with U.S. GAAP, we also utilize and present certain financial measures, in particular adjusted operating income, which is not based on or included in U.S. GAAP (we refer to these as non-GAAP financial measures).\nOrganic Growth\nOur non-GAAP financial measure of organic growth represents revenue growth excluding revenue from acquisitions within the preceding 12 months. The organic growth presentation provides useful period-to-period comparison of revenue results as it excludes revenue from acquisitions that would not be included in the comparable prior period.\nAdjusted Operating Income\nAs a result of our acquisition strategy, our net income includes material non-cash charges relating to the amortization of customer-related intangible assets in the ordinary course of business as well as other intangible assets acquired in our acquisitions. Although these charges may increase as we complete more acquisitions, we believe we will be growing the value of our intangible assets such as customer relationships. Because these charges are not indicative of our operations, we believe that adjusted operating income is a useful financial measure for investors because it eliminates the effect of these non-cash costs and provides an important metric for our business that is more representative of the actual results of our operations.\nAdjusted operating income (which excludes the non-cash impact of amortization of intangible assets, stock-based compensation and cost recognized on the sale of acquired inventory valuation) is used by management as a supplemental performance measure to assess our businesss ability to generate cash and economic returns.\nAdjusted operating income is a non-GAAP measure of income and does not include the effects of preferred stock dividends, interest and taxes.\nWe believe that organic growth and adjusted operating income provide useful information in understanding and evaluating our operating results in the same manner as management. However, organic growth and adjusted operating income are not financial measures calculated in accordance with U.S. GAAP and should not be considered as a substitute for total revenue, operating income or any other operating performance measures calculated in accordance with U.S. GAAP. Using these non-GAAP financial measures to analyze our business has material limitations because the calculations are based on the subjective determination of management regarding the nature and classification of events and circumstances that users of the financial statements may find significant.\nIn addition, although other companies in our industry may report measures titled organic growth, adjusted operating income or similar measures, such non-GAAP financial measures may be calculated differently from how we calculate our non-GAAP financial measures, which reduces their overall usefulness as comparative measures. Because of these limitations, you should consider organic growth and adjusted operating income alongside other financial performance measures, including total revenue, operating income and our other financial results presented in accordance with U.S. GAAP. ITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURE ABOUT MARKET RISK\nConsistent with the rules applicable to smaller reporting companies, we have omitted the information required by Item 7A. ITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements and supplementary data required by this Item 8 are included in the Companys Consolidated Financial Statements and set forth in the pages indicated in Item 15(a) of this Annual Report and are incorporated herein by reference. ITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURES\nNone. ITEM 9A.\nCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nJanel maintains a system of disclosure controls and procedures that is designed to provide reasonable assurance that information, which is required to be disclosed in the reports that it files or submits under the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC and is accumulated and communicated to management, including its Chief Executive Officer and Principal Financial Officer, to allow timely decisions regarding required disclosures. Any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. The Companys management, with the participation of the Chief Executive Officer and Principal Financial Officer, has evaluated the effectiveness of the design and operation of the Companys disclosure controls and procedures as of September 30, 2023, and based on their evaluation, has concluded that our disclosure controls and procedures were effective.\nManagements Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Exchange Act, as amended, as a process designed by, or under the supervision of, our Chief Executive Officer and Principal Financial Officer and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. GAAP and includes those policies and procedures that: (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that the Companys receipts and expenditures are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with policies or procedures may deteriorate.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Principal Financial Officer, we have performed an evaluation of the effectiveness of our internal control over financial reporting under the framework in Internal Control-Integrated Framework (2013), issued by the Committee of Sponsoring Organizations of the Commission. Based on this assessment, management, including our Chief Executive Officer and Principal Financial Officer, has concluded that our internal control over financial reporting was effective as of September 30, 2023.\nThis Annual Report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to the exemption provided to issuers that are neither large accelerated filers nor accelerated filers under the Dodd-Frank Wall Street Reform and Consumer Protection Act.\nChanges in Internal Control Over Financial Reporting\nThere was no change in our internal control over financial reporting that occurred during the quarter ended September 30, 2023 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B.\nOTHER INFORMATION\nNone.\nITEM 9C.\nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe current executive officers and directors of the Company are as follows:\nName\nAge\nPosition\nDarren C. Seirer\nBoard Chairman, President and Chief Executive Officer\nJohn Eidinger\nBoard Vice Chairman\nGerard van Kesteren\nDirector, Chair of Audit Committee\nKaren Miller Ryan\nDirector, Chair of Compensation Committee\nGregory J. Melsen\nDirector, Chair of Nominating and Corporate Governance Committee\nJohn J. Gonzalez, II\nDirector, Senior Advisor for Mergers and Acquisitions\nGregory B. Graves\nDirector\nVincent A. Verde\nPrincipal Financial Officer, Treasurer and Secretary\nDarren C. Seirer has served as Board Chairman, President and Chief Executive Officer of the Company since January 1, 2023. Mr. Seirer has been a private investor since 2019 and he has served as an advisor to the Company since 2021. Mr. Seirer was previously at Select Equity Group, L.P. from 1993 to 2019. Mr. Seirer has served as a director of Rubicon Technology, an investment of the Company. Mr. Seirer is well-qualified to serve as a member of the Companys board of directors based on his extensive experience in financial services and mergers and acquisitions.\nJohn Eidinger has served as Vice Chairman of the Board since January 1, 2023. Since 2019, Mr. Eidinger has advised and assisted the Company in business development. Previously, Mr. Eidinger was a private investor. From 2011 until 2017, Mr. Eidinger was an associate portfolio manager from Select Equity Group, L.P. Mr. Eidinger is well-qualified to serve as a member of the Companys board of directors based on his extensive experience in financial services and mergers and acquisitions.\nGerard van Kesteren has served as a Director of Janel since November 2015. From 1999 until 2014, Mr. van Kesteren served as the Chief Financial Officer of Kuehne + Nagel Group, an international freight forwarder and leading global provider of innovative and fully integrated supply chain solutions. Mr. van Kesteren has served as a director of Raben Group NV (Netherlands) and Planzer Holding AG (Switzerland) since 2015, and CTP NV (Netherlands) since 2021 and Deufol SE (Germany) since 2022. Mr. van Kesteren is well-qualified to serve as a member of the Companys board of directors based on his extensive experience in the freight forwarding and logistics industry. Mr. van Kesteren serves as the chair of the Audit Committee.\nJohn J. Gonzalez, II has served as a Director of Janel since June 2016. Prior to that, he was a Senior Managing Director of Janel Group, following the August 2014 purchase by the Company of Alpha International and President Container Lines (Alpha/PCL), which he co-founded in 1979. Mr. Gonzalez has been involved in the transportation business since 1969. Mr. Gonzalez is well-qualified to serve as a member of the Companys board of directors based on his extensive experience in the freight forwarding and logistics industry and also serves as a senior advisor to the Company.\nGregory J. Melsen has served as a Director of Janel since January 2018. Mr. Melsen has over 45 years of business experience, primarily in the accounting and finance areas. He has served as Chief Financial Officer at a number of companies including Techne Corporation (now Bio-Techne Corporation), a holding company for biotechnology and clinic diagnostic brands. He also has 19 years of public accounting experience, including nine years as partner at Deloitte. Mr. Melsen is well-qualified to serve as a member of the Companys board of directors based on his extensive experience in accounting and finance. Mr. Melsen serves as Chair of the Nominating and Corporate Governance Committee.\nKaren Miller Ryan, also known professionally as Karen Padgett, has served as a Director of Janel since October 2021. Prior to that, she served as Vice President of Global Marketing and Vice President of the Antibody Business Unit of Bio-Techne, a public global life science business from 2014 until 2019. From 1996 until 2014, Ms. Miller Ryan was the founder and Chief Executive Officer of Novus Biologicals, a private research reagent company, which she successfully grew until its sale to Bio-Techne. Ms. Miller Ryan is well qualified to serve as a member of the Companys board of directors based on her extensive life science and executive leadership experience. Ms. Miller Ryan serves as chair of the Compensation Committee.\nGregory B. Graves, has served as a Director of Janel since May 31, 2023. Mr. Graves served as Executive Vice President and Chief Financial Officer and Treasurer of Entegris, Inc. (Entegris), a company focused on specialty chemicals and advanced materials solutions, from July 2008 to May 15, 2023. Mr. Graves has served as a director of Laird Superfood, Inc. (a plant-based food company) since September 2018, and was a member of the board of directors of Plug Power Inc. (an energy solutions provider) from May 2017 to June 2019. In 2022, Mr. Graves joined the board of directors of Skywater Technologies, Inc., a semiconductor manufacturer. Mr. Graves is well-qualified to serve as a member of the Companys board of directors based on his extensive experience in accounting and finance.\nVincent A. Verde is Principal Financial Officer, Treasurer and Secretary of the Company and has served in such capacities since May 2018. From February 2018 to May 2018, Mr. Verde served as Controller of the Company. From January 2018 to February 2018, Mr. Verde served as a consultant for the Company. Prior to joining the Company, from December 2016 to February 2017, Mr. Verde served as a consultant for Xylem Inc., a publicly traded manufacturer and servicer of engineered solutions. Mr. Verde served from November 2014 to November 2016 as Subsidiary Controller for Teledyne Bolt, Inc., a developer, manufacturer and distributor of marine seismic data acquisition equipment and underwater remotely operated robotic vehicles and subsidiary of Teledyne Technologies Inc. (Teledyne). From January 2012 to November 2014, Mr. Verde served as Vice President and Corporate Controller for Bolt Technology Corporation, a then-publicly traded manufacturer and distributor of geophysical equipment and industrial clutches, which was acquired by Teledyne in November 2014. Mr. Verde has 17 years of public accounting experience, including eight years as Audit manager at Deloitte.\nDirectors hold office for a one-year term until they are re-elected, or their successors have been duly elected and qualified. The executive officers are elected by the Board of Directors on an annual basis and serve under the direction of the Board. Executive officers devote all of their business time to the Companys affairs.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires the Companys directors, executive officers and persons who beneficially own more than 10% of its Class A common stock to file reports of ownership and changes in ownership with the SEC and to furnish the Company with copies of all such reports they file.\nBased on the Companys review of the copies of such forms received by it, or written representations from certain reporting persons, the Company believes that none of its directors, executive officers or persons who beneficially own more than 10% of the Companys common stock failed to comply with Section 16(a) reporting requirements during the fiscal year ended September 30, 2023.\nBoard of Directors\nDuring the fiscal year ended September 30, 2023, the board of directors met eleven times. No incumbent director attended fewer than 75% of the aggregate of the total number of meetings of the board of directors of the Company and the total number of meetings held by all board committees in which that director served.\nCommittees.\nThe Companys Board of Directors has established an Audit Committee, a Compensation Committee and a Nominating and Corporate Governance Committee. Each committee operates under a charter that has been approved by the Companys board of directors and is available on its website located at www.janelcorp.com.\nAudit Committee.\nThe Companys audit committee (Audit Committee) oversees its corporate accounting and financial reporting process. The Audit Committee consists of Mr. van Kesteren as the chair, Mr. Gonzalez, Mr. Melsen, Mr. Graves and Ms. Miller Ryan. The Audit Committee met four times during fiscal 2023. The Audit Committee has the following responsibilities, among others, as set forth in the Audit Committee charter:\nreviewing and assessing the effectiveness of external auditors, their independence from Janel and any additional assignments they may be given, as well as reviewing their appointment, termination and remuneration;\nreviewing and assessing the scope and plan of the audit, the examination process, audit results and reports, as well as whether auditor recommendations have been implemented by management;\nrecommending the approval of the annual internal audit report, including the responses of management thereto;\nassessing managements established risk assessment and any proposed measures to reduce risk;\nassessing the Companys efforts and policies of compliance with relevant laws and regulations;\nreviewing, in tandem with external auditors, as well as the Chief Executive Officer and the Principal Financial Officer, whether accounting principles and the financial control mechanisms of Janel and its subsidiaries are appropriate in view of Janels size and complexity; and\nreviewing annual and interim statutory and consolidated financial statements intended for publication and recommending such financial statements to the board of directors.\nThe board of directors of the Company has determined that Messrs. Gonzalez, Graves, Melsen and van Kesteren and Ms. Miller Ryan meet the definition of independent directors under the Companys criteria. The board of directors of the Company has also determined that Ms. Miller Ryan, Mr. Graves and Mr. Melsen meet the Companys independence criteria for audit committee membership, which is based on the Nasdaq rules regarding audit committee independence. The board of directors of the Company, however, has determined that Mr. van Kesteren does not meet the Companys independence criteria for audit committee membership, as he received an annual $40,000 consulting fee during the fiscal year 2023 for services rendered to the Companys Logistics segment. The board of directors of the Company has also determined that Mr. Gonzalez does not meet the Companys independence criteria for audit committee membership, as he received an annual $90,000 consulting fee and cost of health insurance of $19,000 during the fiscal year 2023 for services rendered to the Companys Logistics segment. The Companys board of directors designated Gerard van Kesteren as an audit committee financial expert considering his experience as Chief Financial Officer of Kuehne + Nagel Group. The Companys board of directors has determined each of Messrs. Graves, Melsen and van Kesteren to be an audit committee financial expert based on their respective experiences.\nCompensation Committee\nThe Companys compensation committee (the Compensation Committee) formulates, reviews and recommends compensation policies that are consistent with Janels established compensation philosophy and that will enable it to attract and retain high-quality leadership.\nThe Compensation Committee met four times during fiscal 2023. The Compensation Committee has the following responsibilities, among others, as set forth in the Compensation Committees charter:\nreviewing and approving the Companys general compensation philosophy and objectives;\nreviewing and approving the corporate goals and individual objectives relevant to the compensation of the Companys Chief Executive Officer and evaluating the performance of the Chief Executive Officer considering these objectives;\napproving base salary amounts, incentive and bonus compensation amounts and individual stock and/or option grants and awards for the Chief Executive Officer and, based on the recommendation of the Chief Executive Officer, all corporate officers at or above the Vice President level;\nreviewing all forms of compensation for the Companys senior management, including the form and amount of current salary, deferred salary, cash and non-cash benefits, and all compensation plans;\nreviewing the Companys severance or similar termination payments and administering the Companys stock option and other incentive compensation plans and programs;\namending or modifying, where appropriate, the provisions of any compensation or benefit plan that does not require stockholder approval;\npreparing and approving reports to stockholders on compensation matters which are required by the SEC and other government bodies;\nperforming an annual performance appraisal for members of the Companys senior management designated by the board of directors;\nestablishing levels of director compensation to include marketplace reviews of retainers, meeting fees, stock plans and other similar components of compensation; and\nannually reviewing succession plans for key positions within the Company.\nThe Companys Compensation Committee consists of Ms. Miller Ryan as the chair and Messrs. Gonzalez, Graves, Melsen and van Kesteren. The Companys board of directors has determined that Ms. Miller Ryan and Messrs. Gonzalez, Graves, Melsen and van Kesteren are independent members of the Compensation Committee.\nNominating and Corporate Governance Committee\nThe Companys nominating and corporate governance committee (the Nominating and Corporate Governance Committee) is responsible for developing and implementing policies and procedures that are intended to assure that Janels board of directors and the boards of directors (or equivalent) of its subsidiaries will be appropriately constituted and organized to meet its fiduciary obligations to the Company and its stockholders on an ongoing basis. The Nominating and Corporate Governance Committee met four times during fiscal 2023. Among other matters, the Nominating and Corporate Governance Committee is responsible for the following, as set forth in the Nominating and Corporate Governance Committees charter:\nmaking recommendations to Janels board of directors regarding matters and practices concerning the board, its committees and individual directors, as well as matters and practices of the boards, committees and individual directors of each of Janels subsidiaries;\nperiodically evaluating the size, composition and governance structure of Janels board of directors and its committees and the boards and committees of Janels subsidiaries and determining the future requirements of each such body;\nperiodically making recommendations concerning the qualifications, criteria, compensation and retirement age of members of Janels board of directors and the boards of its subsidiaries, which recommendations, upon approval by Janels board of directors, shall be incorporated in Janels Corporate Governance Guidelines;\nrecommending nominees for election to Janels board of directors and the boards of its subsidiaries and establishing and administering a board evaluation process; and\nreviewing timely nominations by stockholders for the election of individuals to Janels board of directors and ensure that such stockholders are advised of any action taken by the board of directors with respect thereto.\nThe Companys Nominating and Corporate Governance Committee consists of the Companys full board of directors. Mr. Melsen serves as the chair of the Nominating and Corporate Governance Committee.\nIndependence of Directors\nThe Company is not currently subject to listing requirements of any national securities exchange or inter-dealer quotation system which has requirements that a majority of the board of directors be independent and, as a result, is not at this time required to have a board of directors comprised of a majority of independent directors. Pursuant to Item 407(a) of Regulation S-K, however, Janel must disclose each director that is independent under the independence standards of either the New York Stock Exchange or Nasdaq, as selected by Janel. The Company has elected to use the independence standards prescribed under Nasdaq Rule 5605(a)(2), which defines an independent director as a person who does not have any relationship with the Company which, in the opinion of the Companys board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. Based on the applicable criteria, the Companys board of directors has determined that Messrs. Seirer and Eidinger are not independent by virtue of the fact that they are Executive Officers of the Company.\nThe board of directors has determined that Messrs. Gonzalez, Graves, Melsen, and van Kesteren and Ms. Miller Ryan are independent directors.\nDirector Compensation\nThe following table summarizes the compensation paid to the Companys non-executive directors for their services during the Companys fiscal year ended September 30, 2023 (actual dollar amounts):\nName\nFees Earned or\nPaid in Cash(1)\nOption\nAwards(2)\nAll Other\nCompensation\nTotal\nGerard van Kesteren\n$\n50,000\n$\n103,100\n$\n40,000\n(3)\n$\n193,100\nKaren Miller Ryan\n$\n50,000\n$\n103,100\n$\n-\n$\n153,100\nGregory J. Melsen\n$\n50,000\n$\n103,100\n$\n-\n$\n153,100\nJohn J. Gonzalez\n$\n40,000\n$\n103,100\n$\n109,000\n(4)\n$\n252,100\nGregory B. Graves\n$\n13,333\n$\n-\n$\n-\n(5)\n$\n13,333\nBrendan Killackey(6)\n$\n-\n$\n-\n$\n447,885\n$\n447,885\n(1)\nCompensation is paid on a monthly basis.\n(2)\nThe aggregate number of options outstanding as of September 30, 2023, for each director was as follows: Gerard van Kesteren - 7,499, John J. Gonzalez II - 7,499, Gregory J. Melsen - 14,375, and Karen Miller Ryan - 5,000.\n(3)\nRepresents compensation paid to Mr. van Kesteren in connection with his consulting arrangement.\n(4)\nRepresents compensation paid to Mr. Gonzalez in connection with his consulting arrangement and payment of medical insurance premiums.\n(5)\nRepresents compensation paid to Mr. Graves in connection with his board of directors fee since being appointed effective May 31, 2023.\n(6)\nDirector through January 1, 2023.Directors who also serve as executive officers of the Company do not receive additional compensation for their board service.\nPursuant to the Companys non-employee director compensation policy, for the fiscal year 2023 non-employee directors received a retainer at an annual rate of $40,000, payable on a monthly basis, and 2,500 options, pursuant to the Amended and Restated Janel Corporation 2017 Equity Incentive Plan or such other equity plan that the Company may adopt from time to time. Directors who also serve as executive officers of the Company do not receive additional compensation for their board service.\nCommittee chairs receive an additional retainer at an annual rate of $10,000. According to the non-employee director compensation policy, non-employee directors will be reimbursed for their reasonable travel and other expenses incurred to attend board of directors or board committee meetings.\nEmployment Arrangements\nThe Company has no active employment agreements with any of its officers or directors.\nCode of Business Conduct and Ethics\nThe Company has adopted a code of business conduct and ethics, including a whistleblower policy, that applies to all of its employees, including executive officers and directors. The code of business conduct and ethics, including our whistleblower policy, is available on the Companys website at www.janelcorp.com. The Company intends to disclose, if required, any future amendments to, or waivers from, the code of business conduct and ethics within four business days of the waiver or amendment through a website posting or by filing a Current Report on Form 8-K with the SEC.\nCorporate Governance Guidelines\nThe Companys board of directors has adopted corporate governance guidelines that serve as a flexible framework within which its board of directors and its committees operate. These guidelines cover a number of areas, including the size and composition of the board of directors, director selection criteria and qualifications, the agenda for board meetings, board member access to management and independent advisors, director compensation, director orientation and continuing education and annual board and committee self-evaluations. A copy of the corporate governance guidelines is available on the Companys website at www.janelcorp.com.\nCommunications with the Board\nAny stockholder desiring to contact the board, or any specific director(s), may send written communications to: Board of Directors (Attention: (Name(s) of director(s), as applicable)), c/o the Companys Secretary, 80 Eighth Avenue, New York, New York 10011. Any proper communication so received will be processed by the Secretary. If it is unclear from the communication received whether it was intended or appropriate for the board, the Secretary will (subject to any applicable regulatory requirements) use his or her judgment to determine whether such communication should be conveyed to the board of directors or, as appropriate, to the member(s) of the board of directors named in the communication.\nLeadership Structure and Risk Oversight\nWhile the board of directors believes that there are various structures that can provide successful leadership to the Company, the Companys executive functions are carried out by Mr. Seirer, the Companys President and Chief Executive Officer, who also serves as chair of the Companys board of directors and, together with the other directors, brings experience, oversight and expertise to the management of the Company.\nThe board of directors believes that, due to the small size of the Company, this leadership structure best serves the Company and its stockholders. Management is responsible for the day-to-day management of risks the Company faces, while the board of directors has collective responsibility for the oversight of risk management. In its risk oversight role, the board of directors has the responsibility to satisfy itself that the risk management processes designed and implemented by management are adequate and functioning as designed. To do this, management discusses with the board of directors the risks facing the Company and its strategy for managing them. ITEM 11.\nEXECUTIVE COMPENSATION\nIntroduction\n(actual dollar amounts)\nThe following table provides summary information concerning compensation paid or accrued by us to our Chief Executive Officer and President, Vice Chairman, our former Chief Executive Officer and President, and our Principal Financial Officer, Treasurer and Secretary. We refer to these individuals collectively as the named executive officers.\nSummary Compensation Table\nThe following table sets forth information regarding the total compensation awarded to, paid to or earned by the named executive officers as compensation for their services in all capacities during the fiscal years ended September 30, 2023 and 2022 (actual dollar amounts):\nName and Principal Position\nYear\nBase\nSalary ($)\nBonus ($)\nAll Other\nComp. ($)\nTotal ($)\nDarren C. Seirer, Chief Executive Officer and President\n100,000\n-\n(1)\n100,751\nDominique Schulte, Chief Executive Officer and President\n100,000\n-\n24,821\n(2)\n124,821\n50,000\n-\n16,478\n66,478\nJohn Eidinger, Vice Chairman\n144,000\n-\n-\n144,000\nVincent A. Verde, Principal Financial Officer, Treasurer and Secretary\n215,000\n208,355\n35,494\n(3)\n458,849\n215,000\n80,936\n27,606\n323,542\n(1)\nAmounts reported under all other compensation for the fiscal year ended September 30, 2023 include $751 of 401(k) contributions paid on behalf of Mr. Seirer for the fiscal year ended 2023.\n(2)\nMs. Schulte served as Chief Executive Officer and President and as a Director through January 1, 2023. Amounts reported under all other compensation for the fiscal year ended September 30, 2023, include $23,319 of medical insurance premiums and $1,502 of 401(k) contributions paid for the fiscal year ended 2023.\n(3)\nAmounts reported under the Bonus column for fiscal year ended September 30, 2023 include a discretionary bonus $177,778 related to fiscal year 2022 performance. Amounts reported under all other compensation for fiscal year ended September 30, 2023 include $27,740 of medical insurance premiums and $7,754 of 401(k) contributions paid on behalf of Mr. Verde for the fiscal year ended 2023.\nLong-Term Incentive Plan Awards\nWhile the Company has adopted the Amended and Restated 2017 Equity Incentive Plan pursuant to which certain stock awards may be granted to the Companys directors, officers, employees and consultants, our current intent is to utilize this plan only to make annual equity awards to the Companys non-employee directors.\nSavings and Stock Option Plans\n401(k) and Profit-Sharing Plan\n(actual dollar amounts)\nThe Company maintains a qualified retirement plan, commonly referred to as a 401(k) plan covering substantially all full-time employees under each segment.\nThe Janel Corporation 401(k) Plan allows for employee salary deferrals including Roth 401(k) deferrals, employer matching contributions, employer profit sharing contributions and employee rollovers. The Janel Corporation 401(k) Plan provides for participant contributions of up to 50% of annual compensation (not to exceed the IRS limit), as defined by the plan. The Company contributes an amount equal to 50% of the participants first 6% of contributions.\nThe combined expenses charged to operations for contributions made to the plans for the benefit of the employees for the fiscal years ended September 30, 2023 and 2022 were approximately $535,200 and $379,000, respectively.\nThe administrative expense charged to operations for the fiscal years ended September 30, 2023 and 2022 aggregated approximately $65,600 and $64,000, respectively.\nEquity Plans\nOn October 30, 2013, the Board of Directors adopted Janels 2013 Non-Qualified Stock Option Plan (the 2013 Option Plan) providing for options to purchase up to 100,000 shares of common stock for issuance to directors, officers, employees of and consultants to the Company and its subsidiaries. The exercise price and other terms of any nonqualified option granted under the 2013 Option Plan is determined by the Compensation Committee of the board of directors.\nOn September 21, 2021, the Board of Directors of the Company adopted the Amended and Restated 2017 Janel Corporation Equity Incentive Plan (the Amended and Restated Plan), which amended and restated the prior 2017 Equity Incentive Plan, as previously amended, and pursuant to which non-statutory stock options, restricted stock awards and stock appreciation rights with respect to up to 200,000 shares of the Companys Common Stock, par value $.001 per share, may be granted to employees, directors and consultants to the Company and its subsidiaries. Participants and all terms of any grant under the Amended and Restated Plan are in the discretion of the Companys Compensation Committee.\nOutstanding Equity Awards at September 30, 2023\nNone of our named executive officers had any outstanding stock awards at September 30, 2023. ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following tables set forth information concerning beneficial ownership of shares of Common Stock outstanding as of September 30, 2023. For purposes of calculating beneficial ownership, Rule 13d-3 of the Exchange Act requires inclusion of shares of common stock that may be acquired within sixty days of the stated date. Unless otherwise indicated in the footnotes to a table, beneficial ownership of shares represents sole voting and investment power with respect to those shares.\nCertain Beneficial Owners\nThe following table reflects the names and addresses of the only persons or entities known to the Company to be the beneficial owners of 5% or more of the outstanding shares of the Companys common stock as of September 30, 2023.\nName and address of Beneficial Owner (1)\nShares\nBeneficially\nOwned\nPercent\nof Class\nOaxaca Group L.L.C. (2)\n485,302\n40.9\n%\nJohn Eidinger\n186,704\n15.7\n%\nJohn J. Gonzalez, II (3)\n108,236\n9.1\n%\nvan Kesteren Foundation (4)\n81,915\n6.9\n%\n(1)\nThe address of each person and entity included in this table is 80 Eighth Avenue, New York, NY 10011, except for the van Kesteren Foundation which is Seestrasse 39, 8846 Willerzell, Switzerland.\n(2)\nThese shares are held by Oaxaca Group L.L.C. Ms. Schulte is the sole member of Oaxaca Group L.L.C. and, therefore, shares beneficial ownership of the shares.\n(3)\nIncludes 1,666 shares of common stock issuable upon the exercise of stock options that may be exercised within 60 days of September 30, 2023.\n(4)\nMr. van Kesteren, a director of the Company, and his wife are members of the board of directors of the van Kesteren Foundation. Mr. van Kesteren disclaims beneficial ownership of the shares of the Companys common stock held by the van Kesteren Foundation.\nDirectors and Executive Officers\nThe following table sets forth information with respect to the beneficial ownership of the shares of common stock as of September 30, 2023 by each named executive officer, each current director and each nominee for election as a director and all directors and executive officers of the Company as a group. An asterisk (*) indicates ownership of less than 1%.\nName of Beneficial Owner\nShares\nBeneficially\nOwned\nPercent\nof Class\nDominique Schulte (1)\n485,302\n40.9\n%\nJohn Eidinger\n186,704\n15.7\n%\nJohn J. Gonzalez, II (2)\n108,236\n9.1\n%\nGerard van Kesteren (2)\n19,166\n1.6\n%\nGregory J. Melsen (2)\n11,042\n*\nKaren Miller Ryan (3)\n6,111\n*\nGregory B. Graves\n1,200\n*\nVincent A. Verde\n*\nDarren C. Seirer (4)\n-\n*\nAll directors and executive officers as a group\n333,124\n26.4\n%\n(1)\nThese shares are held by Oaxaca Group L.L.C. Ms. Schulte is the sole member of Oaxaca Group L.L.C. and, therefore, shares beneficial ownership of the shares.\n(2)\nIncludes 1,666 shares of common stock issuable upon the exercise of stock options that may be exercised within 60 days of September 30, 2023.\n(3)\nIncludes 833 shares of common stock issuable upon the exercise of stock options that may be exercised within 60 days of September 30, 2023.\n(4)\nDoes not include shares beneficially owned by Dominique Schulte, Mr. Seirers spouse, which are referenced above and for which Mr. Seirer disclaims beneficial ownership.\nEquity Compensation Plan Information\nThe following table provides information, as of September 30, 2023, with respect to all compensation arrangements maintained by the Company under which shares of common stock may be issued:\nColumn A\nColumn B\nColumn C\nPlan Category: Equity Compensation plans not approved by security holders:\nNumber of securities\nto be issued,\nupon exercise of\noutstanding options\nWeighted-average\nexercise price of\noutstanding options\nNumber of securities\nremaining available\nfor future issuance\nunder equity\ncompensation plans\n2013 Non-Qualified Stock Option Plan (1)\n6,621\n$\n5.49\n35,701\nAmended and Restated 2017 Equity Incentive Plan (2)\n34,372\n$\n25.81\n69,753\nTotal\n40,993\n$\n22.53\n105,454\n(1)\nOn October 30, 2013, the Board of Directors of the Company adopted the Companys 2013 Non-Qualified Stock Option Plan providing for options to purchase up to 100,000 shares of common stock for issuance to directors, officers, employees of and consultants to the Company and its subsidiaries. The exercise price and other terms of any nonqualified option granted under the 2013 Option Plan is determined by the Compensation Committee of the board of directors.\n(2)\nOn September 21, 2021, the Board of Directors of the Company adopted the Amended and Restated 2017 Janel Corporation Equity Incentive Plan pursuant to which non-statutory stock options, restricted stock awards and stock appreciation rights with respect to up to 200,000 shares of the Companys common stock may be granted to employees, directors and consultants to the Company and its subsidiaries. Participants and all terms of any grant under the Amended and Restated Plan are in the discretion of the Compensation Committee. ITEM 13.\nCERTAIN RELATIONSHIPS, RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nRelated Party Transactions\n(actual dollar amounts)\nWe are not aware of any transactions since October 1, 2022 or any proposed transactions in which the Company was a party where the amount involved exceeded the lesser of 1% of the average of the Companys total assets at year-end for the last two completed fiscal years and $120,000, and in which a director, executive officer, holder of more than 5% of our common stock or any member of the immediate family of any of the foregoing persons, had or will have a direct or indirect material interest. ITEM 14.\nPRINCIPAL ACCOUNTING FEES AND SERVICES\n(actual dollar amounts)\nThe following reflects the fees of Prager Metis CPAs, LLC, the Companys sole independent public accountant, for the audit of our financial statements for the fiscal years ended September 30, 2023 and 2022, and fees billed for other services provided by Prager Metis during those periods.\nYear End September 30,\nFee Category\nAudit Fees\n$\n338,750\n$\n377,050\nAudit-Related Fees\n50,195\n92,000\nTax Fees\n55,495\n71,768\nTotal Fees\n$\n444,440\n$\n540,818\nAudit Fees\nAudit fees include fees paid and accrued for professional services rendered by Prager Metis CPAs for 2023 and 2022, fees for the audits of our financial statements included in our Annual Report on Form 10-K for 2023 and 2022, and reviews of the financial statements included in our Quarterly Reports on Form 10-Q. Audit fees also include comfort letter fees for 2022.\nAudit-Related Fees\nAudit-related services fees include fees paid and accrued for transaction related audit services and agreed upon procedures.\nTax Fees\nTax fees include fees paid and accrued for corporate tax compliance, counsel and advisory services.\nApproval of Independent Auditor Services and Fees\nThe Audit Committee reviews all fees charged by the Companys independent auditors and actively monitors the relationship between audit and non-audit services provided. The Audit Committee must pre-approve all audit and non-audit services provided by the Companys independent auditors and fees charged.\nPART IV ITEM 15.\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)\nDocuments filed as part of this report\n(1)\nFinancial Statements.\nThe Consolidated Financial Statements filed as part of this report are listed on the Table of Contents to Consolidated Financial Statements.\nAll other schedules are omitted because they are not applicable, are not required, or because the required information is included in the consolidated financial statements or notes thereto.\n(b)\nExhibits\nExhibit\nNo.\nDescription\n* 2.1\nStock Purchase and Sale Agreement, dated July 1, 2022, between Janel Corporation and Rubicon Technology, Inc. (incorporated by reference to Exhibit 2.1 to the Companys Current Report on Form 8-K filed July 5, 2022)\n3.1\nArticles of Incorporation of Wine Systems Design, Inc. (predecessor name) (incorporated by reference to Exhibit 3A to Wine Systems Design, Inc. (predecessor name) Registration Statement on Form SB-2 filed May 10, 2001)\n3.2\nAmended and Restated By-Laws of Janel Corporation (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed November 1, 2013)\n3.3\nCertificate of Designations of Series C Cumulative Preferred Stock (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed August 29, 2014)\n3.4\nCertificate of Change filed Pursuant to NRS 78.209 for Registrant (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed April 21, 2015)\n3.5\nCertificate of Amendment to Articles of Incorporation of the Registrant (incorporated by reference to Exhibit 3.2 to the Companys Current Report on Form 8-K filed April 21, 2015)\n3.6\nAmendment to Certificate of Designation After Issuance of Class or Series pursuant to NRS 78.1955 for Series C Cumulative Preferred Stock (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed March 25, 2016)\n3.7\nAmendment to Certificate of Designation After Issuance of Class or Series pursuant to NRS 78.1955 for Series C Cumulative Preferred Stock (incorporated by reference to Exhibit 3.7 to the Companys Quarterly Report on Form 10-Q for the quarter ended March 31, 2017)\n3.8\nAmendment to Certificate of Designation After Issuance of Class or Series pursuant to NRS 78.1955 for Series C Cumulative Preferred Stock (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K/A filed October 17, 2017)\n3.9\nAmendment to Certificate of Designation After Issuance of Class or Series pursuant to NRS 78.1955 for Series C Cumulative Preferred Stock (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on October 5, 2021)\n3.10\nCertificate, Amendment or Withdrawal of Designation pursuant to NRS 78.1955 with respect to Series C Cumulative Preferred Stock (incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on April 5, 2022)\n4.1\nDescription of Registrants Securities (incorporated by reference to Exhibit 4.1 to the Companys Annual Report on Form 10-K for fiscal year ended December 31, 2022 filed December 9, 2022)\n10.1\nJanel World Trade, Ltd. 2013 Non-Qualified Stock Option Plan (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed November 1, 2013)\n10.2\nCredit Agreement, effective as of February 29, 2016, by and between Indco, Inc. and First Merchants Bank (incorporated by reference to Exhibit 10.5 to the Companys Current Report on Form 8-K filed March 25, 2016)\n10.3\nSecurity Agreement, effective as of February 29, 2016, made by Indco and the Company, Inc. for the benefit of First Merchants Bank (incorporated by reference to Exhibit 10.8 to the Companys Current Report on Form 8-K filed March 25, 2016)\n10.4\nContinuing Guaranty Agreement, effective as of February 29, 2016, made by Janel Corporation for the benefit of First Merchants Bank (incorporated by reference to Exhibit 10.9 to the Companys Current Report on Form 8-K filed March 25, 2016)\n10.5\nRestricted Stock Award Agreement between Janel Corporation and Gerard van Kesteren dated May 12, 2017 (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed September 5, 2017)\n10.6\nBusiness Loan Agreement, dated June 14, 2018, by and between AB Merger Sub, Inc. and First Northern Bank of Dixon (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed June 27, 2018)\n10.7\nPromissory Note, dated June 14, 2018, made by AB Merger Sub, Inc. payable to First Northern Bank of Dixon (incorporated by reference to Exhibit 10.2 of the Companys Current Report on Form 8-K filed June 27, 2018)\n10.8\nDeed of Trust, dated June 14, 2018, by Antibodies Incorporated, as Trustor (incorporated by reference to Exhibit 10.3 of the Companys Current Report on Form 8-K filed June 27, 2018)\n10.9\nCommercial Guaranty, dated June 14, 2018, from Janel Corporation (as Guarantor) to First Northern Bank of Dixon (incorporated by reference to Exhibit 10.4 of the Companys Current Report on Form 8-K filed June 27, 2018)\n10.10\nAmendment No. 1 to Credit Agreement, effective as of August 30, 2019, by and between Indco, Inc. and First Merchants Bank (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed on September 6, 2019)\n10.11\nTerm Loan Promissory Note, effective as of August 30, 2019, made by Indco, Inc. payable to First Merchants Bank (incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on September 6, 2019)\n10.12\nRevolving Loan Promissory Note, effective as of August 30, 2019, made by Indco, Inc. payable to First Merchants Bank (incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed on September 6, 2019)\n10.13\nPledge Agreement, effective as of August 30, 2019, by Janel Corporation to First Merchants Bank (incorporated by reference to Exhibit 10.4 of the Companys Current Report on Form 8-K filed on September 6, 2019)\n10.14\nConsulting Agreement, dated February 26, 2017, between Janel Corporation and John J. Gonzalez, II (incorporated by reference to Exhibit 10.30 of the Companys Form 10-K for the year ended September 30, 2018, filed on July 26, 2019)\n10.15\nConsulting Agreement, dated September 28, 2016, between Janel Corporation and Gerard van Kesteren (incorporated by reference to Exhibit 10.31 of the Companys Form 10-K for the year ended September 30, 2018, filed on July 26, 2019)\n10.16\nAmendment No. 2 to Credit Agreement effective as of July 1, 2020, by and between Indco Inc. and First Merchants Bank (incorporated by reference to Exhibit 10.39 of the Companys Annual Report on Form 10-K for the fiscal year ended September 30, 2020)\n10.17\nAmended and Restated Loan and Security Agreement, by and among Santander Bank, N.A., as lender, and Janel Group, Inc., Expedited Logistics and Freight Services, LLC, a Texas limited liability company, and ELFS Brokerage, LLC (collectively as borrowers) and Janel Corporation and Expedited Logistics and Freight Services, LLC, an Oklahoma limited liability company, as loan party obligors dated September 21, 2021 (incorporated by reference to Exhibit 10.44 of the Companys Annual Report on Form 10-K for the year ended September 30, 2021)\n10.18\nFirst Amendment to Amended and Restated Loan and Security Agreement between (incorporated by reference to Exhibit 10.1 of the Companys Quarterly Report on Form 10-Q for the quarter ended March 31, 2022)\n10.19\nConsent, Waiver and Second Amendment to Amended and Restated Loan Agreement, dated as of July 13, 2022, by and among Santander Bank, N.A., Janel Group, Inc., Expedited Logistics and Freight Services, LLC, ELFS Brokerage LLC, Janel Corporation and Expedited Logistics and Freight Services, LLC (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed on July 13, 2022)\n10.20\nForm letter purchase agreement, dated March 31, 2022, between the Company and holders of Series C Stock (incorporated by reference to Exhibit 10.2 of the Companys Quarterly Report on Form 10-Q for the quarter ended March 31, 2022)\n10.21\nAmended and Restated 2017 Janel Corporation Equity Incentive Plan dated September 21, 2021 (incorporated by reference to Exhibit 10.45 of the Companys Annual Report on Form 10-K for the fiscal year ended September 30, 2021)\n10.22\nSubscription Agreement for sale of Series C Preferred Stock dated as of September 30, 2021 between Janel Corporation and Oaxaca Group LLC (incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on October 5, 2021)\n10.23\nAmendment No. 3 to Credit Agreement effective as of August 1, 2022 entered into by and among Indco, Inc., and First Merchants Bank (incorporated by reference to Exhibit 10.23 of the Companys Annual Report on Form 10-K for the fiscal year ended September 30, 2022)\n10.24\nThird Amendment to Amended and Restated Loan and Security Agreement, by and among Santander Bank, N.A., as lender, and Janel Group, Inc., Expedited Logistics and Freight Services, LLC, a Texas limited liability company, and ELFS Brokerage, LLC (collectively as borrowers) and Janel Corporation and Expedited Logistics and Freight Services, LLC, an Oklahoma limited liability company, as loan party obligors dated January 30, 2023 (incorporated by reference to Exhibit 10.1 of the Companys Quarterly Report on Form 10-Q for the quarter ended December 31, 2022)\n10.25\nAmended and Restated Credit Agreement, by and among Indco, Inc., Antibodies Incorporated, Aves Labs, Inc., Phosphosolutions LLC, Immunochemistry Technologies LLC, ECM Biosciences, LLC, Stephen Hall PhD LTD, Immunobioscience Corp., (collectively as borrowers), and each individually, a Borrower), and First Merchants Bank dated April 25, 2023 (incorporated by reference to Exhibit 10.1 of the Companys Quarterly Report on Form 10-Q for the quarter ended June 30, 2023).\n10.26\nFourth Amendment to Amended and Restated Loan and Security Agreement, by and among Santander Bank, N.A., as lender, and Janel Group, Inc., Expedited Logistics and Freight Services, LLC, and ELFS Brokerage, LLC (collectively as borrowers) and Janel Corporation and Expedited Logistics and Freight Services, LLC, as loan party obligors dated April 25, 2023 (incorporated by reference to Exhibit 10.2 of the Companys Quarterly Report on Form 10-Q for the quarter ended June 30, 2023).\n10.27\nFifth Amendment to Amended and Restated Loan and Security Agreement, by and among Santander Bank, N.A., as lender, and Janel Group, Inc., Expedited Logistics and Freight Services, LLC, and ELFS Brokerage, LLC (collectively as borrowers) and Janel Corporation and Expedited Logistics and Freight Services, LLC, as loan party obligors dated August 22, 2023 (filed herewith).\nSubsidiaries of the Registrant (filed herewith)\n23.1\nConsent of Prager Metis CPAs, LLC (filed herewith)\n31.1\nRule 13a-14(a)/15d-14(a) Certification of Principal Executive Officer (filed herewith)\n31.2\nRule 13a-14(a)/15d-14(a) Certification of Principal Financial Officer (filed herewith)\n32.1\nSection 1350 Certification of Principal Executive Officer (furnished herewith)\n32.2\nSection 1350 Certification of Principal Financial Officer (furnished herewith)\nInteractive data files providing financial information from the Registrants Annual Report on Form 10-K for the fiscal year ended September 30, 2023 in Inline XBRL (eXtensible Business Reporting Language) pursuant to Rule 405 of Regulation S-T: (i) Consolidated Balance Sheets as of September 30, 2023 and September 30, 2022, (ii) Consolidated Statements of Operations for the years ended September 30, 2023 and 2022, (iii) Consolidated Statements of Stockholders Equity for the years ended September 30, 2023 and 2022, (iv) Consolidated Statements of Cash Flows for the years ended September 30, 2023 and 2022, and (v) Notes to Consolidated Financial Statements (filed herewith)\nCover Page Interactive Data File (formatted as Inline XBRL and contained in the Interactive Data Files submitted as Exhibit 101) (filed herewith)\nRepresents management contract, compensatory plan or arrangement in which directors and/or executive officers are entitled to participate.\n*\nSchedules to this exhibit have been omitted pursuant to Item 601(b)(2) of Registration S-K. The Registrant hereby agrees to furnish a copy of any omitted schedules to the SEC upon request\nThe agreements and other documents filed as exhibits to this report are not intended to provide factual information or other disclosure other than with respect to the terms of the agreements or other documents themselves, and you should not rely on them for that purpose. In particular, any representations and warranties made by us in these agreements or other documents were made solely within the specific context of the relevant agreement or document and may not describe the actual state of affairs as of the date they were made or at any other time.\nITEM 16.\nFORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, Janel Corporation has duly caused this report to be signed on its behalf by the undersigned, thereto duly authorized.\nJANEL CORPORATION\n(Registrant)\nDate: December 8, 2023\nBy:\n/s/ Darren C. Seirer\nDarren C. Seirer\nDirector, Board Chair, President and Chief Executive Officer\n(Principal Executive Officer)\nDate: December 8, 2023\nBy:\n/s/ Vincent A. Verde\nVincent A. Verde\nPrincipal Financial Officer, Treasurer and Secretary\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Darren C. Seirer\nDirector, Board Chairman, President and Chief Executive Officer\nDecember 8, 2023\nDarren C. Seirer\n/s/ John Eidinger\nDirector, Board Vice Chairman\nDecember 8, 2023\nJohn Eidinger\n/s/ Vincent A. Verde\nPrincipal Financial Officer, Treasurer and Secretary\nDecember 8, 2023\nVincent A. Verde\n/s/ John J. Gonzalez, II\nDirector\nDecember 8, 2023\nJohn J. Gonzalez, II\n/s/ Gregory J. Melsen\nDirector\nDecember 8, 2023\nGregory J. Melsen\n/s/ Karen Miller Ryan\nDirector\nDecember 8, 2023\nKaren Miller Ryan\n/s/ Gerard van Kesteren\nDirector\nDecember 8, 2023\nGerard van Kesteren\n/s/ Gregory B. Graves\nDirector\nDecember 8, 2023\nGregory B. Graves\nReport of Registered Independent Public Accounting Firm - Prager Metis CPAs, LLC (PCAOB ID number 273)\nConsolidated Balance Sheets as of September 30, 2023 and 2022\nConsolidated Statements of Operations for the Years Ended September 30, 2023 and 2022\nConsolidated Statements of Stockholders Equity for the Years Ended September 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended September 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of\nDirectors of Janel Corporation and Subsidiaries\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Janel Corporation and Subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of operations, changes in stockholders equity and cash flows for the years ended September 30, 2023 and 2022, and the related notes to the consolidated financial statements (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of September 30, 2023 and 2022, and the results of its operations, stockholders equity and its cash flows for the years ended September 30, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are a matter arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to an account or disclosure that is material to the consolidated financial statements and (2) involved especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Prager Metis CPAs, LLC\nWe have served as the Companys auditor since 2019\nBasking Ridge, New Jersey\nDecember 8, 2023\nJANEL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share and per share data)\nSeptember 30,\nASSETS\nCurrent Assets:\nCash\n$\n2,461\n$\n6,591\nAccounts receivable, net of allowance for doubtful accounts\n27,518\n57,077\nInventory, net\n4,850\n4,802\nPrepaid expenses and other current assets\n4,459\n3,423\nTotal current assets\n39,288\n71,893\nProperty and Equipment, net\n4,922\n5,044\nOther Assets:\nIntangible assets, net\n22,204\n22,420\nGoodwill\n20,317\n18,622\nInvestment in Rubicon at fair value\n1,573\n2,371\nOperating lease right of use asset\n7,460\n5,660\nSecurity deposits and other long-term assets\n1,070\nTotal other assets\n52,624\n49,595\nTotal assets\n$\n96,834\n$\n126,532\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent Liabilities:\nLine of credit\n$\n19,709\n$\n26,396\nAccounts payable - trade\n25,447\n44,960\nAccrued expenses and other current liabilities\n6,337\n7,194\nDividends payable\n2,029\n1,745\nCurrent portion of earnout\n1,664\nCurrent portion of long-term debt\nCurrent portion of deferred acquisition payments\n-\nCurrent portion of subordinated promissory note-related party\n1,988\nCurrent portion of operating lease liabilities\n2,020\n1,825\nTotal current liabilities\n58,837\n85,036\nOther Liabilities:\nLong-term debt\n5,784\n7,519\nLong-term portion of earnout\n1,738\n2,916\nSubordinated promissory notes-related party\n3,424\n5,382\nMandatorily redeemable non-controlling interest\nDeferred income taxes\n1,341\n2,541\nLong-term operating lease liabilities\n5,689\n4,001\nOther liabilities\nTotal other liabilities\n19,024\n23,169\nTotal liabilities\n77,861\n108,205\nStockholders Equity:\nPreferred Stock, $0.001 par value; 100,000 shares authorized\nSeries C 30,000 shares authorized and 11,368 shares issued and outstanding at September 30, 2023 and September 30, 2022, liquidation value of $7,713 and $7,429 at September 30, 2023 and September 30, 2022, respectively\n-\n-\nCommon stock, $0.001 par value; 4,500,000 shares authorized, 1,206,354 issued, and 1,186,354 outstanding as of September 30, 2023 and September 30, 2022, respectively\nPaid-in capital\n17,107\n17,184\nCommon treasury stock, at cost, 20,000 shares\n(240\n)\n(240\n)\nAccumulated earnings\n2,105\n1,382\nTotal stockholders equity\n18,973\n18,327\nTotal liabilities and stockholders equity\n$\n96,834\n$\n126,532\nThe accompanying notes are an integral part of these consolidated financial statements.\nJANEL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nYear Ended September 30,\nRevenues\n$\n186,449\n$\n316,863\nForwarding expenses and cost of revenues\n130,777\n250,666\nGross profit\n55,672\n66,197\nCost and Expenses:\nSelling, general and administrative\n50,975\n54,723\nAmortization of intangible assets\n2,098\n1,976\nTotal Costs and Expenses\n53,073\n56,699\nIncome from Operations\n2,599\n9,498\nOther Items:\nInterest expense\n(1,998\n)\n(1,276\n)\nFair value adjustments to Rubicon investment (net of dividends)\n(798 )\n(7,601 )\nChange in fair value of earnout\n(980 )\nChange in fair value of mandatorily redeemable non-controlling interest\n(135\n)\nIncome Before Income Taxes\nIncome tax benefit (expense)\n(2,190\n)\nNet Income (Loss)\n(2,138\n)\nPreferred stock dividends\n(284\n)\n(586\n)\nNon-controlling interest dividends\n-\n(404 )\nNet Income (Loss) Available to Common Stockholders\n$\n$\n(3,128\n)\nNet income (loss) per share:\nBasic\n$\n0.61\n$\n(2.07\n)\nDiluted\n$\n0.60\n$\n(2.07\n)\nNet income (loss) per share attributable to common stockholders:\nBasic\n$\n0.37\n$\n(3.03\n)\nDiluted\n$\n0.36\n$\n(3.03\n)\nWeighted average number of shares outstanding:\nBasic\n1,186.4\n1,030.8\nDiluted\n1,206.2\n1,030.8\nThe accompanying notes are an integral part of these consolidated financial statements.\nJANEL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\n(in thousands, except share and per share data)\nPREFERRED\nSTOCK\nCOMMON\nSTOCK\nPAID-IN CAPITAL\nCOMMON\nTREASURY\nSTOCK\nACCUMULATED\nEARNING\nTOTAL\nEQUITY\nShares\n$\nShares\n$\n$\nShares\n$\n$\n$\nBalance - September 30, 2021\n20,991\n$\n-\n962,207\n$\n$\n14,838\n20,000\n$\n(240\n)\n$\n3,520\n$\n18,119\nNet (Loss)\n-\n-\n-\n-\n-\n-\n-\n(2,138\n)\n(2,138\n)\nDividends to preferred stockholders\n-\n-\n-\n-\n(586\n)\n-\n-\n-\n(586\n)\nDividends to non-controlling interest\n-\n-\n-\n-\n(404 )\n-\n-\n-\n(404 )\nPreferred C shares purchases\n(4,687 )\n-\n-\n-\n(1,731 )\n-\n-\n-\n(1,731 )\nPreferred C shares converted\n(4,905 )\n-\n65,205\n-\n-\n-\n-\n-\n-\nPreferred B shares converted\n(31\n)\n-\n-\n-\n-\n-\n-\n-\nCommon Stock issued in private placement\n-\n-\n88,888\n-\n4,000\n-\n-\n-\n4,000\nStock based compensation\n-\n-\n15,000\n-\n-\n-\n-\nStock option exercise\n-\n-\n74,748\n-\n-\n-\n-\nBalance - September 30, 2022\n11,368\n$\n-\n1,206,354\n$\n$\n17,184\n20,000\n$\n(240\n)\n$\n1,382\n$\n18,327\nNet Income\n-\n-\n-\n-\n-\n-\n-\nDividends to preferred stockholders\n-\n-\n-\n-\n(284\n)\n-\n-\n-\n(284\n)\nStock based compensation\n-\n-\n-\n-\n-\n-\n-\nBalance - September 30, 2023\n11,368\n$\n-\n1,206,354\n$\n$\n17,107\n20,000\n$\n(240\n)\n$\n2,105\n$\n18,973\nThe accompanying notes are an integral part of these consolidated financial statements.\nJANEL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYear Ended\nSeptember 30,\nCash Flows from Operating Activities:\nNet income (loss)\n$\n$\n(2,138\n)\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nProvision for uncollectible accounts, net of recoveries\n(100\n)\n1,142\nDepreciation\nDeferred income provision\n(1,200\n)\nAmortization of intangible assets\n2,098\n1,976\nAmortization of acquired inventory valuation\nAmortization of loan costs\nStock based compensation\nUnrealized loss on fair value adjustment to Rubicon investment (net of dividend)\n7,601\nChange in fair value of earnout\n(857\n)\nChange in fair value of mandatorily redeemable noncontrolling interest\n(353\n)\nChanges in operating assets and liabilities, net of effects of acquisitions:\nAccounts receivable\n29,799\n(5,874\n)\nInventory\n(1,503\n)\nPrepaid expenses and other current assets\n(1,036\n)\n(421\n)\nSecurity deposits and other long-term assets\n(48\n)\nAccounts payable and accrued expenses\n(20,396\n)\n8,546\nOther liabilities\nNet cash provided by operating activities\n11,388\n12,107\nCash Flows from Investing Activities:\nAcquisition of property and equipment, net of disposals\n(360\n)\n(551\n)\nInvestment in Rubicon (net of dividend)\n-\n(9,972\n)\nAcquisitions\n(4,447\n)\n(946\n)\nEarnout payment\n(1,693 )\n-\nNet cash used in investing activities\n(6,500\n)\n(11,469\n)\nCash Flows from Financing Activities:\nDividends paid to preferred stockholders\n-\n(657\n)\nDividends paid to minority shareholders\n-\n(404\n)\nRepayments borrowings of term loan\n(1,748\n)\n2,538\nProceeds from stock option exercise\n-\nLine of credit (payments)\n(6,687\n)\n(3,241\n)\nRepurchase of Series C Preferred Stock\n-\n(2,343\n)\nProceeds from Private Placement\n-\n4,000\nRepayment of subordinated promissory note-related party\n(583\n)\n(451\n)\nNet cash (used in) financing activities\n(9,018\n)\n(281\n)\nNet (decrease) increase in cash\n(4,130\n)\nCash at beginning of the period\n6,591\n6,234\nCash at end of period\n2,461\n6,591\nSupplemental Disclosure of Cash Flow Information:\nCash paid during the period for:\nInterest\n$\n1,862\n$\nIncome taxes\n$\n1,393\n$\n1,883\nNon-cash investing activities:\nContingent earnout acquisition\n$\n$\n-\nDue to former owner\nNon-cash financing activities:\nDividends declared to preferred stockholders\n$\n$\nThe accompanying notes are an integral part of these consolidated financial statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(in thousands except share and per share data)\n1.\nSUMMARY OF BUSINESS AND SIGNIFICANT ACCOUNTING POLICIES\nBusiness description\nJanel Corporation (Janel or the Company) is a holding company with subsidiaries in three business segments: Logistics, Life Sciences and Manufacturing. The Company strives to create shareholder value primarily through three strategic priorities: supporting its businesses efforts to make investments and to build long-term profits; allocating Janels capital at high risk-adjusted rates of return; and attracting and retaining exceptional talent.\nManagement at the holding company focuses on significant capital allocation decisions, corporate governance and supporting Janels subsidiaries where appropriate. Janel expects to grow through its subsidiaries organic growth and by completing acquisitions. We plan to either acquire businesses within our existing segments or expand our portfolio into new strategic segments. Our acquisition strategy focuses on reasonably-priced companies with strong and capable management teams, attractive existing business economics and stable and predictable earnings power.\nLogistics\nThe Companys Logistics segment is comprised of several wholly-owned subsidiaries. The Logistics segment is a non-asset based, full-service provider of cargo transportation logistics management services, including freight forwarding via air-, ocean- and land-based carriers, customs brokerage services, warehousing and distribution services, trucking and other value-added logistics services. In addition to these revenue streams, the Company earns accessorial revenue in connection with its core services. Accessorial revenue includes, but is not limited to, fuel service charges, wait time fees, hazardous cargo fees, labor charges, handling, cartage, bonding and additional labor charges.\nLife Sciences\nThe Companys Life Sciences segment is comprised of several wholly-owned subsidiaries. The Companys Life Sciences segment manufactures and distributes high-quality monoclonal and polyclonal antibodies, diagnostic reagents and other immunoreagents for biomedical research and provides antibody manufacturing for academic and industry research scientists. Our Life Sciences segment also produces products for other life science companies on an original equipment manufacturer (OEM) basis.\nOn May 22, 2023, the Company acquired all the rights, title and interests to a royalty agreement for certain antibody products, which we include in our Life Sciences segment.\nOn March 2, 2023, the Company completed a business combination whereby it acquired all of the outstanding stock of Stephen Hall, PhD Ltd., which we include in our Life Sciences segment. The acquisition of Stephen Hall, PhD Ltd., was completed to expand our product offering in our Life Sciences segment.\nOn November 1, 2022, the Company completed a business combination whereby it acquired all of the outstanding stock of ImmunoBioScience Corporation, which we include in our Life Sciences segment. The acquisition of ImmunoBioScience Corporation was completed to expand our product offering in our Life Sciences segment.\nOn August 15, 2022, the Company completed a business combination whereby it acquired all the membership interests of ECM Biosciences LLC, which we include in our Life Sciences segment.\nManufacturing\nThe Companys manufacturing segment is comprised of Indco, Inc. (Indco), a majority-owned subsidiary of the Company that manufactures and distributes mixing equipment and apparatuses for specific applications within various industries. Indcos customer base is comprised of small- to mid-sized businesses as well as other larger customers for which Indco fulfills repetitive production orders.\nInvestment in Marketable Securities - Rubicon\nOn August 19, 2022, the Company acquired 1,108,000 shares of the common stock, par value $0.001 per share, of Rubicon Technology, Inc. (Rubicon), at a price per share of $20.00, in a cash tender offer made pursuant to the Stock Purchase and Sale Agreement, dated July 1, 2022, between the Company and Rubicon (the Rubicon Purchase Agreement). Pursuant to the terms of the Rubicon Purchase Agreement, the acquired shares represent 45.0% of Rubicons issued and outstanding shares of common stock as of August 3, 2022, as reported in Rubicons Quarterly Report on Form 10-Q for the quarterly period ended June 30, 2022, filed with the SEC on August 12, 2022. The Company owned approximately 46.6% of Rubicons issued and outstanding shares of common stock as of September 30, 2023.\nRubicon is an advanced materials provider specializing in monocrystalline sapphire for applications in optical and industrial systems.The purpose of our investment in Rubicon is for Janel to acquire a significant ownership interest in Rubicon, together with representation on Rubicons Board, in an attempt to (i) restructure the Rubicon business to achieve profitability and (ii) assist Rubicon in utilizing its net operating loss carry-forward assets.\nBasis of consolidation\nThe accompanying consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries, as well as Indco, of which Janel owns 90.2%, with a non-controlling interest held by existing Indco management. The Indco non-controlling interest is mandatorily redeemable and is recorded as a liability. All intercompany transactions and balances have been eliminated in consolidation.\nUses of estimates in the preparation of financial statements\nThe preparation of financial statements in conformity with generally accepted accounting principles in the United States (U.S. GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of financial statements, as well as the reported amounts of revenues and expenses during the reporting period. The most critical estimates made by the Company are those relating to accounts receivables valuation, the useful lives of long-term assets, accrual of cost related to ancillary services the Company provides, accrual of tax expense on an interim basis and potential impairment of goodwill and intangible assets with indefinite lives, long-lived assets impairment.\nCash\nThe Company maintains cash balances at various financial institutions. Accounts at each institution are insured by the Federal Deposit Insurance Corporation up to $250. The Companys accounts at these institutions may, at times, exceed the federally insured limits. The Company has not experienced any losses in such accounts.\nAccounts receivable and allowance for doubtful accounts receivable\nAccounts receivable are recorded at the contractual amount. The Company records its allowance for doubtful accounts based upon its assessment of various factors. The Company considers historical collection experience, the age of the accounts receivable balances, credit quality of the Companys customers, any specific customer collection issues that have been identified, current economic conditions and other factors that may affect the customers ability to pay. The Company writes off accounts receivable balances that have aged significantly once all collection efforts have been exhausted and the receivables are no longer deemed collectible from the customer. Recoveries of previously written off accounts receivables are charged back to the allowance for doubtful accounts. The allowance for doubtful accounts as of September 30, 2023 and September 30, 2022 was $1,255 and $1,547, respectively.\nInventory\nInventory is valued at the lower of cost (using the first-in, first-out method) or net realizable value. The Company maintains an inventory valuation reserve to provide for slow moving and obsolete inventory, inventory not meeting quality control standards and inventory subject to expiration for its Life Sciences business. The products of the Life Sciences business require the initial manufacture of multiple batches to determine if quality standards can consistently be met. In addition, the Company will produce larger batches of established products than current sales requirements due to economies of scale. The manufacturing process for these products, therefore, has and will continue to produce quantities in excess of forecasted usage. The Company values acquired manufactured antibody inventory based on a three-year forecast. Inventory quantities in excess of the forecast are not valued due to uncertainty over salability.\nProperty and equipment and depreciation policy\nProperty and equipment are recorded at cost. Property and equipment acquired in business combinations are initially recorded at fair value. Depreciation is provided for in amounts sufficient to amortize the costs of the related assets over their estimated useful lives on the straight-line and accelerated methods for both financial reporting and income tax purposes. Maintenance and repairs are recorded as expenses when incurred.\nGoodwill\nThe Company records as goodwill the excess of purchase price over the fair value of the tangible and identifiable intangible assets acquired in a business combination. Under current authoritative guidance, goodwill is not amortized but is tested for impairment annually as well as when an event or change in circumstance indicates impairment may have occurred. Goodwill is tested for impairment by comparing the fair value of the Companys individual reporting units to their carrying amount to determine if there is potential goodwill impairment. If the fair value of the reporting unit is less than the carrying value, an impairment loss is recorded to the extent that the implied fair value of the goodwill of the reporting unit is less than its carrying value. If there is a material change in economic conditions, or other circumstances influencing the estimate of future cash flows or significantly affecting the fair value of our reporting units, the Company could be required to recognize impairment charges in the future.\nDuring the fourth quarter of 2021, we changed the date of our annual impairment test of goodwill and indefinite-lived intangible assets from September 30 to July 1. The change in the impairment test date lessens resource constraints that exist in connection with the Companys year-end close and financial reporting process and provide for additional time to complete the required impairment testing. This change did not represent a material change to our method of applying an accounting principle, and therefore does not delay, accelerate or avoid an impairment charge.\nThe fair value of our reporting units were in excess of carrying value and goodwill was not deemed to be impaired as of September 30, 2023 and 2022.\nIntangibles and long-lived assets\nLong-lived assets, including fixed assets and intangible assets, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying value may not be recoverable. In reviewing for impairment, the carrying value of such assets is compared to the estimated undiscounted future cash flows expected from the use of the assets and their eventual disposition.\nIf such cash flows are not sufficient to support the assets recorded value, an impairment charge is recognized to reduce the carrying value of the long-lived asset to its estimated fair value.\nThe determination of future cash flows, as well as the estimated fair value of long-lived assets, involves significant estimates on the part of management. If there is a material change in economic conditions, or other circumstances influencing the estimate of future cash flows or fair value, the Company could be required to recognize impairment charges in the future.\nThe Company concluded that the fair value of intangibles and long-lived assets were not deemed to be impaired as of September 30, 2023 and 2022.\nEquity-Method Investments\nThe Company has determined that its investment in Rubicon is subject to the equity method of accounting, and the Company has elected the fair value option under Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 825-10, Financial Instruments (ASC 825-10) to account for the equity method investment. In accordance with ASC 825-10, the Company will present its equity method investment in Rubicon at fair value each reporting period with changes in fair value and dividends received from Rubicon recorded to income from investment in unconsolidated affiliate on the Companys statements of operations.\nSee Notes 16 and 17 for further information about the Companys investment in Rubicons equity securities accounted for under the fair value option.\nBusiness segment information\nThe Company operates in three reportable segments: Logistics, Life Sciences and Manufacturing. The Companys Chief Executive Officer regularly reviews financial information at the reporting segment level in order to make decisions about resources to be allocated to the segments and to assess their performance.\nRevenue and revenue recognition\nLogistics\nRevenue Recognition\nRevenue is recognized upon transfer of control of promised services to customers. With respect to its Logistics segment, the Company has determined that in general each shipment transaction or service order constitutes a separate contract with the customer. When the Company provides multiple services to a customer, different contracts may be present for different services.\nThe Company typically satisfies its performance obligations as services are rendered at a point in time. A typical shipment would include services rendered at origin, such as pick-up and delivery to port, freight services from origin to destination port and destination services, such as customs clearance and final delivery. The Company measures the performance of its obligations as services are completed at a point in time during the life of a shipment, including services at origin, freight and destination. The Company fulfills nearly all of its performance obligations within a one to two-month period.\nThe Company evaluates whether amounts billed to customers should be reported as gross or net revenue. Generally, revenue is recorded on a gross basis when the Company is acting as principal and is primarily responsible for fulfilling the promise to provide the services, when it has discretion in setting the prices for the services to the customers, and the Company has the ability to direct the use of the services provided by the third party. Revenue is recognized on a net basis when the Company is acting as agent and we do not have latitude in carrier selection or establish rates with the carrier.\nIn the Logistics segment, the Company disaggregates its revenues by its five primary service categories: ocean freight, trucking, air freight, custom brokerage and other. A summary of the Companys revenues disaggregated by major service lines for the fiscal year ended September 30, 2023 and 2022 was as follows:\nYear Ended September 30,\nService Type\nTrucking\n$\n80,364\n$\n95,333\nOcean freight\n42,047\n123,989\nAir freight\n23,095\n48,312\nOther\n11,675\n15,191\nCustom brokerage\n8,871\n12,518\nTotal\n$\n166,052\n$\n295,343\nLife Sciences and Manufacturing\nRevenues from the Life Sciences segment are derived from the sale of high-quality monoclonal and polyclonal antibodies, diagnostic reagents and diagnostic kits and other immunoreagents for biomedical research and antibody manufacturing. Revenues from the Companys Manufacturing segment, which is comprised of Indco, a majority-owned subsidiary of the Company that manufactures and distributes mixing equipment and apparatus for specific applications within various industries, are derived from the engineering, manufacture and delivery of specialty mixing equipment and accessories. Revenues for Life Sciences and Manufacturing are recognized when products are shipped, and risk of loss is transferred to the carrier(s) used.\nIncome (loss) per common share\nBasic net income (loss) per share is computed by dividing net income (loss) for the period by the weighted average number of common shares outstanding, excluding unvested restricted stock, during the period. Diluted net income (loss) per share reflects the additional dilution from potential issuances of common stock, such as stock issuable pursuant to the exercise of stock options. The treasury stock method is used to calculate the potential dilutive effect of these common stock equivalents. Potentially dilutive shares are excluded from the computation of diluted net income (loss) per share when their effect is anti-dilutive.\nEquity classified share-based awards\nThe Company recognizes compensation expense for stock-based payments granted based on the grant-date fair value estimated in accordance with ASC Topic 718, Compensation- Stock Compensation. For employee stock-based awards, we calculate the fair value of the award on the date of grant using the Black-Scholes method for stock options and the quoted price of our common stock for restricted shares; the expense is recognized over the service period for awards expected to vest.\nStock-based compensation to non-employees\nLiability classified share-based awards\nThe Company maintains other share unit compensation grants for shares of Indco, which vest over a period of up to three years following their grant. The shares contain certain put features where the Company is either required or expects to settle vested awards on a cash basis.\nThese awards are classified as liability awards, measured at fair value at the date of grant and re-measured at fair value at each reporting date up to and including the settlement date. The determination of the fair value of the share units under these plans is described in Note 10. The fair value of the awards is expensed over the respective vesting period of the individual awards with recognition of a corresponding liability. Changes in fair value after vesting are recognized through compensation expense. Compensation expense reflects estimates of the number of instruments expected to vest. The impact of forfeitures and fair value revisions, if any, are recognized in earnings such that the cumulative expense reflects the revisions, with a corresponding adjustment to the settlement liability. Liability-classified share unit liabilities due within 12 months of the reporting date are presented in trade and other payables while settlements due beyond 12 months of the reporting date are presented in non-current liabilities.\nNon-employee share-based awards\nThe Company grants restricted stock awards, restricted stock units and stock options to certain directors, officers and employees. The Company accounts for share-based compensation as equity awards such that compensation cost is measured at the grant date based on the fair value of the award and is expensed ratably over the vesting period. The fair value of restricted stock is the market price as of the grant date, and the fair value of each stock option grant is estimated as of the grant date using the Black-Scholes option pricing model. Determining the fair value of share-based awards at the grant date requires judgment about, among other things, stock volatility, the expected life of the award and other inputs. The Company accounts for forfeitures as they occur.\nThe Company issues new shares of common stock to satisfy exercises and vesting of awards granted under its stock plans. Share-based compensation expense is reflected in the consolidated statements of operations as part of selling general and administrative expenses.\nMandatorily Redeemable Non-Controlling Interests\nThe non-controlling interests that are reflected as mandatorily redeemable non-controlling interests in the consolidated financial statements consist of non-controlling interests related to the Indco acquisition whose owners have certain redemption rights that allow them to require the Company to purchase the non-controlling interests of those owners upon certain events outside the control of the Company, including upon the death of the holders. The Company is required to purchase 20% per year of the mandatorily redeemable non-controlling interest at the option of the holders beginning on the third anniversary of the date of the Indco acquisition, which was March 21, 2019. As of September 30, 2023, the holders had not exercised their redemption rights.\nOn December 13, 2021, two minority owners of Indco exercised 7,000 and 3,372 options to purchase Indcos common stock at an exercise price of $6.48 and $12.07 for an aggregate purchase price of $45 and $41, respectively. Indco issued related party promissory notes in the amount of $45 and $41, respectively, which bear interest at 1% per annum; both interest and principal are payable on the maturity date of December 31, 2024. On November 30, 2020, a minority owner of Indco exercised 7,000 options to purchase Indcos common stock at an exercise price of $6.48 for an aggregate purchase price of $45. These notes are included in security deposits and other long-term assets. The fair value of the shares issued of Indcos common stock was recorded as an increase in mandatorily redeemable non-controlling interest. As a result of the exercise of options to purchase Indcos stock, the mandatorily redeemable non-controlling interest percentage was 9.8% as of each of September 30, 2023 and 2022.\nOn the date the Company acquires the controlling interest in a business combination, the fair value of the non-controlling interest is recorded in the long-term liabilities section of the consolidated balance sheet under the caption Mandatorily redeemable non-controlling interest. The mandatorily redeemable non-controlling interest is adjusted each reporting period, if required, to its then current redemption value, based on the predetermined formula defined in the respective agreement. The Company reflects any adjustment in the redemption value and any earnings attributable to the mandatorily redeemable non-controlling interest in its consolidated statements of operations by recording the adjustments and earnings to other income and expense in the caption change in fair value of mandatorily redeemable non-controlling interest.\nIncome taxes\nThe Company uses the asset and liability method of accounting for income taxes in accordance with ASC Topic 740, Income Taxes. Under this method, income tax expense is recognized for the amount of: (i) taxes payable or refundable for the current year and (ii) deferred tax consequences of temporary differences resulting from matters that have been recognized in an entitys financial statements or tax returns. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled.\nThe effect on deferred tax assets and liabilities of a change in tax rates is recognized in the results of operations in the period that includes the enactment date. A valuation allowance is provided when it is more likely than not that some portion or all of a deferred tax asset will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income and the reversal of deferred tax liabilities during the period in which related temporary differences become deductible. The benefit of tax positions taken or expected to be taken in the Companys income tax returns are recognized in the consolidated financial statements if such positions are more likely than not of being sustained.\nLeases\nThe Company determines if an arrangement is a lease at inception. Assets and obligations related to operating leases are included in operating lease right-of-use (ROU) assets; current portion of operating lease liability; and operating lease liability, net of current portion in our consolidated balance sheets. Assets and obligations related to finance leases are included in property, technology and equipment, net; current portion of finance lease liability; and finance lease liability, net of current portion in our consolidated balance sheets.\nROU assets represent our right to use an underlying asset for the lease term, and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. As most of the Companys leases do not provide an implicit rate, the incremental borrowing rate based on the information available at commencement date is used in determining the present value of lease payments. We use the implicit rate when readily determinable. Our lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option.\nThe Companys agreements with lease and non-lease components are all each accounted for as a single lease component.\nFor leases with an initial term of twelve months or less, the Company elected the exemption from recording right of use assets and lease liabilities for all leases that qualify and records rent expense on a straight-line basis over the lease term. Expenses for these short-term leases for the fiscal year ended September 30, 2023 amounted to $372.\nContingent Earnout Liabilities\nThe Company accounts for contingent consideration relating to business combinations as a contingent earnout liability and a decrease (increase) to goodwill at the date of the acquisition and continually remeasures the asset or liability at each balance sheet date by recording changes in the fair value through change in fair value of contingent consideration in the consolidated statements of operations. The ultimate settlement of contingent earnout liabilities relating to business combinations may be for amounts that are materially different from the amounts initially recorded and may cause volatility in the Companys results of operations.\nRecent accounting pronouncements\nIn March 2020, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2020-04, Reference Rate Reform (Topic 848). In December 2022, the FASB issued ASU 2022-06 to temporarily ease the potential burden in accounting for reference rate reform. The standards provide optional expedients and exceptions for applying accounting principles generally accepted in the United States to existing contracts, hedging relationships, and other transactions affected by reference rate reform. The standards apply only to contracts and hedging relationships that reference the London Interbank Offered Rate (LIBOR) or another reference rate to be discontinued because of reference rate reform. The standards were effective upon issuance and can generally be applied through December 31, 2024. While there has been no material effect to our financial condition, results of operations, or cash flows from reference rate reform as of September 30, 2023, we continue to monitor our contracts and transactions for potential application of these ASUs.\nIn January 2017, the FASB issued ASU 2017-04, Intangibles - Goodwill and Other: Simplifying the Test for Goodwill Impairment, to simplify the subsequent measurement of goodwill by eliminating Step 2 from the goodwill impairment test. This standard became effective for us in the first quarter of fiscal year 2023. The new standard is required to be applied using a cumulative-effect transition method. The adoption of this standard did not have a material effect on our consolidated financial statements and related disclosures.\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326), which replaces the incurred loss methodology previously employed to measure credit losses for most financial assets and requires the use of a forward-looking expected loss model. Current accounting delays the recognition of credit losses until it is probable a loss has been incurred, while the update will require financial assets to be measured at amortized costs less a reserve and equal to the net amount expected to be collected. This standard became effective for us in the first quarter of fiscal 2023. The new standard is required to be applied using a cumulative-effect transition method. The adoption of this standard did not have a material effect on our consolidated financial statements and related disclosures.\n2.\nACQUISITIONS\nFiscal 2023 Acquisitions\nLife Sciences\nOn November 1, 2022, the Company completed a business combination whereby it acquired all of the outstanding stock of ImmunoBioScience Corporation (IBS), for an aggregate purchase price of $3,755, net of $153 cash received. At closing, $3,000 was paid in cash, $250 was due to the former stockholder of IBS as a deferred acquisition payment upon integration, $300 was recorded as a preliminary earnout consideration (not to exceed $750) and $205 was recorded as a preliminary working capital adjustment. The acquisition was funded with cash provided by normal operations, and the results of operations of IBS are included in Janels condensed consolidated results of operations since the date of the acquisition. In connection with the combination, the Company recorded an aggregate of $1,468 in goodwill and $1,680 in other identifiable intangibles. Supplemental pro forma information has not been provided as the acquisition did not have a significant impact on Janels condensed consolidated results of operations, individually or in aggregate. IBS is a developer and manufacturer of high-quality reagents used by research and diagnostic customers. IBS was founded in 2007 and is headquartered in Mukilteo, Washington. The acquisition of IBS was completed to expand our product offerings in our Life Sciences segment.\nOn March 2, 2023, the Company completed a business combination whereby it acquired all of the outstanding stock of Stephen Hall PhD, Ltd. (SH) for an aggregate purchase price of $600. At closing, $500 was paid in cash and $100 was due to the former stockholder of SH as a deferred acquisition payment upon integration. The acquisition was funded with cash provided by normal operations, and the results of operations of SH are included in Janels condensed consolidated results of operations since the date of the acquisition. In connection with the combination, the Company recorded an aggregate of $181 in goodwill and $202 in other identifiable intangibles. Supplemental pro forma information has not been provided as the acquisition did not have a significant impact on Janels condensed consolidated results of operations, individually or in aggregate. SH is a developer and manufacturer of antibodies and cell culture media for research and diagnostic uses. SH was founded in 2011 and is headquartered in Lafayette, Indiana. The acquisition of SH was completed to expand our product offerings in our Life Sciences segment.\nOn May 22, 2023, the Company acquired all the rights, title and interests to a royalty agreement for certain antibody products for a purchase price of $500. The Company recorded this acquisition as a royalty asset, which is included in security deposits and other long-term assets in the accompanying condensed consolidated balance sheet and will be amortized over the estimated life of ten years.\nFiscal 2022 Acquisitions\nLife Sciences\nOn August 15, 2022, the Company completed a business combination whereby it acquired all of the membership interests of ECM Biosciences LLC (ECM) for $850, net of $16 cash received. At closing, the former member of ECM was paid $600 in cash and an additional $250 was due to the former member, which is included in accrued expenses and other current liabilities. In connection with the combination, the Company recorded an aggregate of $24 in goodwill and $222 in other identifiable intangibles. This acquisition was funded with cash provided by normal operations. The results of operations of the acquired businesses are included in Janels consolidated results of operations since the date of the acquisition and are included in our Life Sciences segment. The acquisition of ECM was completed to expand our product offerings in our Life Sciences segment. Supplemental pro forma information has not been provided as the acquisition did not have a significant impact on Janels consolidated results of operations, individually or in aggregate.\nInvestment in Marketable Securities - Rubicon\nOn August 19, 2022, the Company acquired 1,108,000 shares (the Acquired Shares) of the common stock, par value $0.001 per share, of Rubicon Technology, Inc. (Rubicon), at a price per share of $20.00, in a cash tender offer made pursuant to the Stock Purchase and Sale Agreement, dated July 1, 2022, between the Company and Rubicon (the Purchase Agreement). Pursuant to the terms of the Purchase Agreement, the Acquired Shares represented 45.0% of Rubicons issued and outstanding shares of common stock as of August 3, 2022, as reported in Rubicons Quarterly Report on Form 10-Q for the quarterly period ended June 30, 2022, filed with the SEC on August 12, 2022. Due to share repurchases effectuated by Rubicon, the Company owned approximately 46.6% of Rubicons issued and outstanding shares of common stock as of September 30, 2023.\nRubicon is an advanced materials provider specializing in monocrystalline sapphire for applications in optical and industrial systems.\n3.\nPROPERTY AND EQUIPMENT\nA summary of property and equipment and the estimated lives used in the computation of depreciation and amortization is as follows (in thousands):\nSeptember 30,\nLife\nBuilding and improvements\n$\n3,064\n$\n3,076\n12-30 years\nLand and improvements\n1,385\n1,385\nIndefinite\nFurniture and Fixture\n3-7 years\nComputer Equipment\n3-5 years\nMachinery & Equipment\n1,454\n1,357\n3-15 years\nLeasehold Improvements\n3-5 years\n7,534\n7,160\nLess Accumulated Amortization\n(2,612\n)\n(2,116\n)\n$\n4,922\n$\n5,044\nDepreciation expense for the fiscal year ended September 30, 2023 and 2022 was $508 and $484, respectively.\n4.\nINVENTORY\nInventories consisted of the following (in thousands):\nYear End September 30,\nFinished goods\n$\n2,095\n$\n1,823\nWork-in-process\nRaw materials\n1,811\n2,260\nGross inventory\n4,875\n4,846\nLess - reserve for inventory valuation\n(25\n)\n(44\n)\n$\n4,850\n$\n4,802\n5.\nINTANGIBLE ASSETS\nA summary of intangible assets and the estimated useful lives used in the computation of amortization is as follows (in thousands):\nSeptember 30,\nLife\nCustomer relationships\n$\n25,238\n$\n23,625\n15-24 Years\nTrademarks/names\n4,559\n4,539\n1-20 Years\nTrademarks/names\nIndefinite\nOther\n1,429\n1,180\n2-22 Years\n31,747\n29,865\nLess: Accumulated Amortization\n(9,543\n)\n(7,445\n)\n$\n22,204\n$\n22,420\nThe composition of the intangible assets balance at September 30, 2023 and 2022 is as follows (in thousands):\nSeptember 30,\nLogistics\n$\n18,174\n$\n18,174\nLife Sciences\n5,873\n3,991\nManufacturing\n7,700\n7,700\n31,747\n29,865\nLess: Accumulated Amoritzation\n(9,543\n)\n(7,445\n)\n$\n22,204\n$\n22,420\nAmortization expense of intangible assets for the year ended September 30, 2023 and 2022 was $2,098 and $1,976, respectively.\nThe future amortization of these intangible assets is expected to be as follows (in thousands):\nFiscal Year 2024\n$\n2,092\nFiscal Year 2025\n2,089\nFiscal Year 2026\n2,088\nFiscal Year 2027\n2,069\nFiscal Year 2028\n2,069\nThereafter\n11,276\n$\n21,683\n6.\nGOODWILL\nThe Companys goodwill carrying amounts relate to the acquisitions in the Logistics, Life Sciences and Manufacturing businesses.\nThe composition of the goodwill balance at September 30, 2023 and 2022 is as follows (in thousands):\nSeptember 30,\nLogistics\n$\n9,175\n$\n9,175\nLife Sciences\n6,096\n4,401\nManufacturing\n5,046\n5,046\n$\n20,317\n$\n18,622\n7.\nNOTES PAYABLE - BANKS\n(A)\nSantander Bank Facility\nThe wholly-owned subsidiaries that comprise the Companys Logistics segment (collectively, the Janel Group Borrowers), with the Company as a guarantor, have a Loan and Security Agreement (as amended, the Santander Loan Agreement) with Santander with respect to a revolving line of credit facility (the Santander Facility).The Santander Loan Agreement was amended on March 31, 2022 to provide for, among other changes, the following: (i) the maximum revolving facility amount available was increased from $30,000 to $31,500 (limited to 85% of the borrowers eligible accounts receivable borrowing base and reserves, subject to adjustments set forth in the Santander Loan Agreement); (ii) the LIBOR basis on which interest under the Santander Loan Agreement was calculated under certain circumstances was changed to the Secured Overnight Financing Rate (SOFR) and interest on the Santander Facility accrues at an annual rate equal to the one-month SOFR plus 2.75%; (iii) a one-time increase from $1,000 to $3,000 in the amount the Company was permitted to distribute to holders of the Companys Series C Preferred Stock if specified conditions are met; and (iv) the amount of indebtedness of the Companys Antibodies Incorporated subsidiary that the Company was permitted to guaranty was increased from $2,920 to $5,000.\nOn\nJuly 13, 2022, the Santander Loan Agreement was further amended by a Consent, Waiver and Second Amendment (the Second Santander Amendment) to (i) increase the maximum revolving facility amount available to $35,000 (limited to 85% of the Janel Group Borrowers eligible accounts receivable borrowing base and reserves, subject to adjustments set forth in the Santander Loan Agreement) and (ii) provide for a new bridge term loan to the Company in the principal amount of up to $12,000 (the Bridge Facility) to be funded in connection with the acquisition (the Rubicon Transaction) by the Company of up to 45% of the outstanding shares of Rubicon Technology, Inc. (Rubicon). The Bridge Facility was drawn on August 18, 2022 and matured on the earlier to occur of (i) twenty (20) business days following the funding of the Bridge Facility and (ii) the date of funding of the dividend to be paid by Rubicon in connection with the Rubicon Transaction. The Company repaid the Bridge Facility in full on August 30, 2022. The Second Santander Amendment also contained a one-time waiver and consent to (a) the consummation of the Rubicon Transaction, and (b) a dividend of $2,500 to be paid by Janel Group, Inc. (the Janel Group) to the Company.\nOn January 30, 2023, the Santander Loan Agreement was further amended by the Third Amendment to the Amended and Restated Loan and Security Agreement (the Third Santander Amendment). As amended by the terms of the Third Santander Amendment, the percentage of the Borrowers eligible accounts receivable used to calculate the borrowing base under the Loan Agreement was increased from 85% to 90% for Domestic Insured Accounts (as defined in the Amendment), subject to adjustments set forth in the Loan Agreement.\nOn April 25, 2023, in connection with an amendment to the Credit Agreement entered into with First Merchants Bank (First Merchant) as described further below, we entered into the Fourth Amendment to the Amended and Restated Loan and Security Agreement (the Fourth Santander Amendment). The Fourth Santander Amendment (i) included modifications to address the amendments made to the First Merchants Credit Facilities (as defined below) and the consolidation of the debt thereunder and (ii) terminated the subordination agreement relating to the Companys guarantee of the First Merchants Credit Facilities.\nOn August 22, 2023, we entered into the Fifth Amendment to the Amended and Restated Loan and Security Agreement (the Fifth Santander Amendment). The Fifth Santander Amendment permitted certain unsecured guaranties by the Company in the ordinary course of business guarantying obligations of subsidiaries in an aggregate amount not to exceed $4,000 and related modifications to certain negative covenants.\nThe Santander Loan Agreement matures on September 21, 2026. Interest accrues on the Santander Facility at an annual rate equal to the one-month SOFR plus 2.75%. The Janel Group Borrowers obligations under the Santander Facility are secured by all of the assets of the Janel Group Borrowers, while the Santander Loan Agreement contains customary terms and covenants. As a result of its terms, the Santander Facility is classified as a current liability on the consolidated balance sheet.\nAt September 30, 2023, outstanding borrowings under the Santander Facility were $18,759, representing 53.6% of the $35,000 available thereunder, and interest was accruing at an effective interest rate of 7.60%.\nAt September 30, 2022, outstanding borrowings under the Santander Facility were $26,396, representing 75.4% of the $35,000 available thereunder, and interest was accruing at an effective interest rate of 5.79%.\nThe Company was in compliance with the financial covenants defined in the Santander Loan Agreement at both September 30, 2023 and September 30, 2022.\n(B)\nFirst Merchants Bank Credit Facility\nOn February 29, 2016, Indco entered into a Credit Agreement (as amended, the Prior First Merchants Credit Agreement) with First Merchants, which was subsequently amended on August 30, 2019 and July 1, 2020.\nOn August 1, 2022, Indco and First Merchants entered into Amendment No. 3 to the Prior First Merchants Credit Agreement, modifying the terms of Indcos credit facilities. Under the revised terms, the credit facilities consisted of a $5,500 term loan, a $1,000 (limited to the borrowing base and reserves) revolving loan, and the continuation of a mortgage loan in the original principal amount of $680 (collectively, the Prior First Merchants Facility). Interest accrued on the term loan at an annual rate equal to one-month adjusted term SOFR plus either 2.75% (if Indcos total funded debt to EBITDA ratio was less than 2:1), or 3.5% (if Indcos total funded debt to EBITDA ratio was greater than or equal to 2:1). Interest accrued on the revolving loan at an annual rate equal to one-month adjusted term SOFR plus 2.75%. Interest accrued on the mortgage loan at an annual rate of 4.19%. Indcos obligations under the Prior First Merchants Credit Facility were secured by all of Indcos real property and other assets, and are guaranteed by Janel, and Janels guarantee of Indcos obligations was secured by a pledge of Janels Indco shares.\nOn April 25, 2023, Indco and certain other Subsidiaries of the Company that are part of the Life Science and Manufacturing segments (together with Indco, the Borrowers and each, a Borrower), entered into a Credit Agreement (the Credit Agreement) with First Merchants. The Credit Agreement constitutes an amendment and restatement of the Prior First Merchants Credit Agreement. The credit facilities provided under the Credit Agreement (the First Merchants Credit Facilities) consist of a $3,000 revolving loan (limited to the borrowing base and reserves), a $5,000 acquisition loan, a $6,905 Term A loan and a $620 Term B loan as a continuation of the mortgage loan under the Prior First Merchants Credit Agreement. Interest accrues on the outstanding revolving loan, Term A loan and acquisition loan at an annual rate equal to one-month adjusted term SOFR plus either (i) 2.75% (if the Borrowers total funded debt to EBITDA ratio is less or equal to 1.75:1.00) or (ii) 3.50% (if the Borrowers total funded debt to EBITDA ratio is greater than to 1.75:1.00). Interest accrues on the Term B loan at an annual rate of 4.19%. The Borrowers obligations under the First Merchants Credit Facilities are secured by all of the Borrowers real property and other assets, and are guaranteed by the Company, and the Companys guarantee of the Borrowers obligations is secured by a pledge of the Companys equity interests in certain of the Borrowers. The revolving loan portion will expire on August 1, 2027, the Term A loan portion will mature on April 25, 2033, the Term B loan portion will mature on July 1, 2025 and the acquisition loan will permit multiple draws until October 25, 2024, at which point the outstanding principal amount will amortize, with all remaining amounts due at maturity of the acquisition loan on April 25, 2029; each of the foregoing maturities, subject to earlier termination as provided in the Credit Agreement and unless renewed or extended.\nAs of September 30, 2023, there were $500 of outstanding borrowings under the acquisition loan, $450 of outstanding borrowings under the revolving loan, $6,235 of outstanding borrowings under the Term A loan and $610 of outstanding borrowings under the Term B loan, with interest accruing on the acquisition loan and revolving loan at an effective interest rate of 8.18% and on the Term A loan and Term B loan at an effective interest rate of 8.18% and 4.19%, respectively.\nAs of September 30, 2022, there were no outstanding borrowings under the revolving loan under the Prior First Merchants Credit Agreement, $5,420 of borrowings under the term loan under the Prior First Merchants Credit Agreement, and $631 of borrowings under the mortgage loan under the Prior First Merchants Credit Agreement with interest accruing on such term loan and mortgage loan at an effective interest rate of 6.63% and 4.19%, respectively.\nIndco was in compliance with the financial covenants defined in the First Merchants Credit Agreement at September 30, 2023 and September 30, 2022.\nThe table below sets forth the total long term debt, net of capitalized loan fees of $349 for the First Merchants Credit Agreement (in thousands):\nSeptember 30,\nTotal Debt\n$\n6,499\n$\n6,051\nLess Current Portion\n(715\n)\n(574\n)\nLong-term Portion\n$\n5,784\n$\n5,477\nThese obligations mature as follows (in thousands):\nFiscal Year 2024\n$\nFiscal Year 2025\n1,276\nFiscal Year 2026\nFiscal Year 2027\nFiscal Year 2028\nThereafter\n2,437\n$\n6,499\n(C)\nFirst Northern Bank of Dixon\nAntibodies Incorporated (Antibodies), a wholly-owned subsidiary of the Company, entered into a Business Loan Agreement (as amended, the First Northern Loan Agreement) with First Northern Bank of Dixon (First Northern) on June 21, 2018. The First Northern Loan Agreement provided for a $2,235 term loan (the First Northern Term Loan) and a $750 revolving credit facility (the First Northern Revolving Loan).\nAntibodies also entered into two separate business loan agreements with First Northern: a $125 term loan in connection with a potential expansion of solar generation capacity on the Antibodies property (the First Northern Solar Loan) on November 18, 2019 and a $60 term loan in connection with a potential expansion of generator capacity on the Antibodies property (the First Northern Generator Loan) on June 19, 2020.\nOn April 25, 2023, each of the First Northern Term Loan, the First Northern Revolving Loan, the First Northern Solar Loan and the First Northern Generator Loan was paid in full with the proceeds provided by the First Merchants Credit Facilities and the First Merchants Loan Agreement. In connection with the repayment, each business loan agreement governing such First Northern loans was terminated and all liens granted to First Northern in connection with the First Northern Loan Agreement and such business loan agreements on any property of Antibodies were released. Antibodies has no further obligations owing to First Northern in connection with the First Northern Loan Agreement and such business loan agreements.\nAs of September 30, 2022, the total amount outstanding under the First Northern Term Loan was $2,084, of which $2,027 is included in long-term debt and $57 is included in current portion of long-term debt, with interest accruing at an effective interest rate of 4.18%.\nAs of September 30, 2022, the total amount outstanding under the First Northern Solar Loan was $23, of which $15 is included in long-term debt and $8 is included in current portion of long-term debt, with interest accruing at an effective interest rate of 4.43%.\nAs of September 30, 2022, there were no outstanding borrowings under the First Northern Revolving Loan.\nThe Company was in compliance with the financial covenants defined in the First Northern Loan Agreement at April 25, 2023 .\n8.\nSUBORDINATED PROMISSORY NOTES - RELATED PARTY\nAves\nLabs, Inc., a wholly-owned subsidiary of the Company, is the obligor on a fixed 0.5% subordinated promissory note in the amount of $1,850 (the ICT Subordinated Promissory Note) issued to the former owner of ImmunoChemistry Technologies, LLC (ICT), in connection with a business combination whereby the Company acquired all of the membership interests of ICT. The ICT Subordinated Promissory Note is payable in sixteen scheduled quarterly installments of principal and interest beginning March 4, 2021, matures on December 4, 2024, and may be prepaid, in whole or in part, without premium or penalty.\nThe ICT Subordinated Promissory Note is guaranteed by the Company and is secured by the Companys membership interests in ICT. The ICT Subordinated Promissory Note is subordinate to and junior in right of payment for principal interest premiums and other amounts payable to Santander, First Merchants and the First Northern.\nAs of September 30, 2023, the amount outstanding under the ICT Subordinated Promissory Note was $312, of which $288 is included in the current portion of subordinated promissory notes and $24 is included in the long-term portion of subordinated promissory notes.\nAs of September 30, 2022, the amount outstanding under ICT Subordinated Promissory Note was $707, of which $425 is included in the current portion of subordinated promissory notes and $282 is included in the long-term portion of subordinated promissory notes.\nJanel Group, Inc. (Janel Group), a wholly-owned subsidiary of the Company, is the obligor on four fixed 4% subordinated promissory notes totaling $6,000 in the aggregate (together, the ELFS Subordinated Promissory Notes), payable to certain former shareholders of Expedited Logistics and Freight Services, LLC (ELFS), in connection with the Companys business combination whereby it acquired all the membership interest of ELFS and its related subsidiaries. All of the ELFS Subordinated Promissory Notes are guaranteed by the Company and are subordinate to and junior in right of payment for principal, interest, premiums and other amounts payable to the Santander Bank Facility and the First Merchants Facility. The ELFS Subordinated Promissory Notes are payable in twelve equal consecutive quarterly installments of principal together with accrued interest. Beginning October 15, 2021 and on the same day of the next eight consecutive calendar quarters, thereafter payment of accrued interest and unpaid interest is due to the former shareholders. Beginning October 15, 2023 and on the same day of the next twelve consecutive calendar quarters, thereafter payment of principal together with accrued interest and unpaid interest is due to the former shareholders. In June 2022, the principal amount of the ELFS Subordinated Promissory Notes was adjusted to $5,100 due to a revised working capital adjustment of $900.\nAs of September 30, 2023, the amount outstanding under the ELFS Subordinated Promissory Notes was $5,100, of which $1,700 is included in the current portion of subordinated promissory notes and $3,400 was included in the long-term portion of subordinated promissory notes.\nAs of September 30, 2022, the amount outstanding under the ELFS Subordinated Promissory Notes was $5,100 and was included in the long-term portion of subordinated promissory notes.\nSeptember 30,\n(in thousands)\nTotal Subordinated Promissory Notes\n$\n5,412\n$\n5,807\nLess Current Portion of Subordinated Promissory Notes\n(1,988\n)\n(425\n)\nLong Term Portion of Subordinated Promissory Notes\n$\n3,424\n$\n5,382\nThese obligations mature as follows (in thousands):\nTotal\n1,988\n1,724\n1,700\n$\n5,412\n9.\nSTOCKHOLDERS EQUITY\n(in thousands, except share per share data)\nJanel is authorized to issue 4,500,000 shares of common stock, par value $0.001. In addition, the Company is authorized to issue 100,000 shares of preferred stock, par value $0.001. The preferred stock is issuable in series with such voting rights, if any, designations, powers, preferences and other rights and such qualifications, limitations and restrictions as may be determined by the Companys Board of Directors or a duly authorized committee thereof, without stockholder approval. The Board of Directors may fix the number of shares constituting each series and increase or decrease the number of shares of any series.\n(A)\nCommon Stock\nOn August 10, 2022, the Company issued 88,888 shares of its common stock, par value $0.001 per share (Common Stock), at a purchase price of $45 per share (the closing sale price per share of Common Stock on August 9, 2022 as reported on the Pink tier of the OTC market, or an aggregate purchase price of $4,000.\nThe shares were sold to accredited investors in a private placement in reliance upon the exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933 and Regulation D promulgated thereunder.\n(B)\nPreferred Stock\nSeries B Convertible Preferred Stock\nShares of the Companys Series B Convertible Preferred Stock (the Series B Stock) are convertible into shares of the Companys Common Stock at any time on a one- share (of Series B Stock) for ten-shares (of Common Stock) basis. The Company had 31 shares of Series B Stock outstanding as of September 30, 2021. On March 31, 2022, the Company, on behalf of two holders, converted the remaining 31 shares of Series B Stock into 306 shares of the Companys Common Stock. On March 31, 2022, the Company submitted for filing to the Nevada Secretary of State a Certificate, Amendment or Withdrawal of Designation withdrawing the Companys Series B Convertible Preferred Stock from the Companys Articles of Incorporation. As of September 30, 2023 and 2022, the Company had no shares of Series B Stock outstanding.\nSeries C Cumulative Preferred Stock\nShares of the Companys Series C Cumulative Preferred Stock (the Series C Stock) were initially entitled to receive annual dividends at a rate of 7% per annum of the original issuance price of $500, when and if declared by the Companys Board of Directors, with such rate to increase by 2% annually beginning on the third anniversary of issuance of such Series C Stock to a maximum rate of 13%. By the filing of the Certificate of Amendment to the Companys Certificate of Incorporation on March 31, 2022, the annual dividend rate decreased to 5% per annum of the original issuance price, when and if declared by the Companys Board of Directors, and will increase by 1% beginning on January 1, 2024. Such rate is to increase on each January 1 thereafter for four years to a maximum rate of 9%. The dividend rate of the Series C Stock as of September 30, 2023 and 2022 was 5% and 5%, respectively . In the event of liquidation, holders of Series C Stock shall be paid an amount equal to the original issuance price, plus any accrued but unpaid dividends thereon. Shares of Series C Stock may be redeemed by the Company at any time upon notice and payment of the original issuance price, plus any accrued but unpaid dividends thereon. The liquidation value of Series C Stock was $7,713 and $7,429 as of September 30, 2023 and September 30, 2022, respectively.\nOn March 31, 2022, the Company purchased 4,687 shares of the Series C Stock from two holders at a purchase price of $500 per share plus accrued dividends, or an aggregate of $3,000, and exchanged 4,905 shares of Series C Stock plus accrued dividends from one holder, for the issuance of 65,205 shares of the Companys Common Stock, par value $0.001 per share valued at $47.00 per share of Common Stock (the closing price for the Common Stock on March 30, 2022), or a total value of $3,065. As a result of these transactions, the number of issued and outstanding shares of Series C Stock was reduced from 20,960 shares to 11,368 shares.\nSuch shares issued on March 31, 2022 and September 30, 2021, were sold in private placements in reliance upon the exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933 and Regulation D promulgated thereunder.\nIn August 2021, the Board of Directors approved an increase in the number of shares of Series C Stock, from 20,000 shares to 30,000 shares.\nFor the fiscal year ended September 30, 2023 and 2022, the Company declared dividends on Series C Stock of $284 and $586, respectively. At September 30, 2023 and 2022, the Company had accrued dividends of $2,029 and $1,745, respectively.\n(C)\nEquity Incentive Plan\nOn\nMay 12, 2017, the Company adopted the 2017 Equity Incentive Plan (the 2017 Plan) pursuant to which (i) incentive stock options, (ii) non-statutory stock options, (iii) restricted stock awards and (iv) stock appreciation rights with respect to shares of the Companys common stock may be granted to directors, officers, employees of and consultants to the Company. On September 21, 2021, the Board of Directors of the Company adopted the Amended and Restated 2017 Janel Corporation Equity Incentive Plan (the Amended Plan) pursuant to which non-statutory stock options, restricted stock awards and stock appreciation rights of the Companys Common Stock, par value $0.001 per share (Common Stock), may be granted to employees, directors and consultants to the Company and its subsidiaries.\nThe Amended Plan increases the number of shares of Common Stock that may be issued pursuant to the Amended Plan from 100,000 to 200,000 shares of Common Stock of the Company and adopts certain other non-substantive amendments.\nParticipants and all terms of any grant under the Amended Plan are in the discretion of the Companys Compensation Committee.\n10.\nSTOCK-BASED COMPENSATION\n(in thousands, except share per share data)\nOn October 30, 2013, the Board of Directors of the Company adopted the Companys 2013 Non-Qualified Stock Option Plan (the 2013 Option Plan) providing for options to purchase up to 100,000 shares of Common Stock for issuance to directors, officers, employees of and consultants to the Company and its subsidiaries.\nOn September 21, 2021, the board of directors of the Company adopted the Amended and Restated 2017 Janel Corporation Equity Incentive Plan (the Amended and Restated Plan), which amended and restated the prior 2017 plan, as previously amended, and pursuant to which non-statutory stock options, restricted stock awards and stock appreciation rights with respect to up to 200,000 shares of the Companys Common Stock may be granted to directors, officers, employees of and consultants to the Company and its subsidiaries. The Amended and Restated Plan increased the number of shares of Common Stock that may be issued pursuant to the Amended and Restated Plan from 100,000 to 200,000 shares of Common Stock of the Company and adopts certain other non-substantive amendments. Participants and all terms of any grant under the Amended and Restated Plan are in the discretion of the Companys Compensation Committee.\nTotal stock-based compensation for the fiscal year ended September 30, 2023 and 2022 amounted to $231 and $832, respectively, and was included in selling, general and administrative expense in the Companys statements of operations.\n(A)\nStock Options\nThe Company uses the Black-Scholes option pricing model to estimate the fair value of our share-based awards. In applying this model, we use the following assumptions:\nRisk-free interest rate - We determine the risk-free interest rate by using a weighted average assumption equivalent to the expected term based on the U.S. Treasury constant maturity rate.\nExpected term - We estimate the expected term of our options on the average of the vesting date and term of the option.\nExpected volatility - We estimate expected volatility using daily historical trading data of our common stock.\nDividend yield - We have never paid dividends on our common stock and currently have no plans to do so; therefore, no dividend yield is applied.\nThe fair values of our employee option awards were estimated using the assumptions below, which yielded the following weighted average grant date fair values for the periods presented:\nRisk-free interest rate\n3.98\n%\n1.10\n%\nExpected option term in years\n5.5 - 6.5\n5.5 - 6.5\nExpected volatility\n93.6\n%\n100.3% - 110.3\n%\nDividend yield\n- %\n-\n%\nWeighted average grant date fair value\n$\n30.06 - $41.24\n$\n17.60 - $19.07\nOptions for Employees\nNumber of\nOptions\nWeighted\nAverage\nExercise Price\nWeighted\nAverage\nRemaining\nContractual\nTerm (in years)\nAggregate\nIntrinsic Value\n(in thousands)\nOutstanding balance at September 30, 2022\n30,993\n$\n12.68\n6.8\n$\n1,251.45\nGranted\n10,000\n$\n53.06\n9.3\n$\n-\nOutstanding balance at September 30, 2023\n40,993\n$\n22.53\n6.6\n$\n482.49\nExercisable at September 30, 2023\n21,831\n$\n9.95\n4.9\n$\n399.40\nThe aggregate intrinsic value in the above table was calculated as the difference between the closing price of the Companys Common Stock at September 30, 2023 of $28.25 per share and the exercise price of the stock options that had strike prices below such closing price.\nAs of September 30, 2023, there was approximately $338 of total unrecognized compensation expense related to the unvested employee stock options which is expected to be recognized over a weighted average period of two years.\nLiability classified share-based awards\nDuring the fiscal year ended September 30, 2023, there were no options granted and no options were exercised with respect to Indcos common stock. The Company uses the Black-Scholes option pricing model to estimate the fair value of Indcos share-based awards. In applying this model, the Company used the following assumptions:\nRisk-free interest rate\n1.10\n%\nExpected option term in years\n5.5 - 6.5\nExpected volatility\n%\nDividend yield\n-\n%\nGrant date fair value\n$\n5.57 - $6.66\nNumber of\nOptions\nWeighted\nAverage\nExercise Price\nWeighted\nAverage\nRemaining\nContractual\nTerm (in years)\nAggregate\nIntrinsic Value\n(in thousands)\nOutstanding Balance at September 30, 2022\n35,607\n$\n12.22\n6.67\n$\n175.98\nOutstanding Balance at September 30, 2023\n35,607\n$\n12.22\n5.76\n$\n119.94\nExercisable on September 30, 2023\n28,613\n$\n11.40\n5.30\n$\n113.20\nThe aggregate intrinsic value in the above table was calculated as the difference between the valuation price of Indcos common stock at September 30, 2023 of $15.19 per share and the exercise price of the stock options that had strike prices below such closing price.\nThe liability classified awards were measured at fair value at each reporting date until the final measurement date, which was the date of completion of services required to earn the option. The accrued compensation cost related to these options was approximately $334 and $311 as of September 30, 2023 and September 30, 2022, respectively, and is included in other liabilities in the condensed consolidated financial statement.The compensation cost related to these options was approximately $23 and $42 for the fiscal years ended September 30, 2023 and September 30, 2022, respectively, and is included in other liabilities in the consolidated financial statement.The cost associated with the options issued on each grant date is being recognized ratably over the period of service required to earn each tranche of options.\nUpon vesting, the options continue to be accounted for as a liability in accordance with ASC 480-10-25-8 and are measured in accordance with ASC 480-10-35 at every reporting period until the options are settled.\nAs a result of previous option exercise and stock repurchase activity, the mandatorily redeemable non-controlling interest percentage was 9.8% as of each of September 30, 2023 and 2022.\nChanges in the fair value of the vested options are recognized in earnings in the consolidated financial statements.\nThe options are classified as liabilities, and the underlying shares of Indcos common stock also contain put options which result in their classification as a mandatorily redeemable security. While their redemption does not occur on a fixed date, there is an unconditional obligation for the Company to repurchase the shares upon death.\nAs of September 30, 2023, there was approximately $16 of total unrecognized compensation expense related to the unvested Indco stock options. This expense is expected to be recognized over a weighted average period of two years.\n(B)\nRestricted Stock\nOn March 30, 2022, the Board of Directors of the Company approved an equity grant of 15,000 shares of restricted stock to an employee of the Company pursuant to the Companys Amended and Restated Plan, vesting immediately. The compensation cost related to this award was approximately $705 for the year ended September 30, 2022 and was included in selling, general and administrative expense in the Companys statements of operations.\n11.\nINCOME PER COMMON SHARE\nThe following table provides a reconciliation of the basic and diluted income (loss) per share (EPS) computations for the fiscal years ended September 30, 2023 and 2022 (in thousands, except share and per share data):\nYear Ended September 30,\nIncome (Loss):\nNet income (loss)\n$\n$\n(2,138\n)\nPreferred stock dividends\n(284\n)\n(586\n)\nNon-controlling interest dividends\n-\n(404 )\nNet income (loss) available to common stockholders\n$\n$\n(3,128\n)\nCommon Shares:\nBasic - weighted average common shares\n1,186.4\n1,030.8\nEffect of dilutive stock options\n-\nDiluted - weighted average common stock\n1,206.2\n1,030.8\nIncome (Loss) per Common Share:\nBasic -\nNet income (loss)\n$\n0.61\n$\n(2.07\n)\nPreferred stock dividends\n(0.24\n)\n(0.57\n)\nNon-controlling interest dividends\n-\n(0.39\n)\nNet income (loss) attributable to common stockholders\n$\n0.37\n$\n(3.03\n)\nDiluted -\nNet income (loss)\n$\n0.60\n$\n(2.07\n)\nPreferred stock dividends\n(0.24\n)\n(0.57\n)\nNon-controlling interest dividends\n-\n(0.39 )\nNet income (loss) available to common stockholders\n$\n0.36\n$\n(3.03\n)\nThe computation for the diluted number of shares excludes unexercised stock options that are anti-dilutive. There were 10,000 anti-dilutive shares for the fiscal years ended September 30, 2023 and 48,293 anti-dilutive shares for the fiscal years ended September 30, 2022.\nPotentially diluted securities as of September 30, 2023 and 2022 are as follows:\nSeptember 30,\nEmployee stock options (Note 10)\n40,993\n30,993\n12.\nINCOME TAXES\nThe reconciliation of income tax computed at the Federal statutory rate to the provision for income taxes from operations is as follows (in thousands):\nYear Ended September 30,\nFederal taxes at statutory rates\n$\n$\nPermanent differences\n1,477\nState and local taxes, net of Federal benefit\n(273\n)\nOther\n(285\n)\n-\n$\n(198\n)\n$\n2,190\nThe provisions of income taxes are summarized as follows (in thousands):\nYear Ended September 30,\nCurrent\n$\n1,048\n$\n1,948\nDeferred\n(1,246\n)\n$\n(198\n)\n$\n2,190\nThe tax effects of temporary differences that gave rise to significant portions of the deferred tax assets and liabilities were as follows (in thousands):\nDeferred tax assets - net state operating loss carryforwards\n$\n$\n-\nLease liability\n1,814\n1,755\nOther\nStock based compensation\nTotal deferred tax assets\n3,008\n2,851\nValuation allowance\n-\n-\nTotal deferred tax assets net of valuation allowance\n3,008\n2,851\nDeferred tax liabilities - depreciation and amortization\n2,564\n3,648\nPrepaid expenses\nRight of use assets\n1,755\n1,706\nTotal deferred tax liabilities\n4,349\n5,392\nNet deferred tax liability\n$\n(1,341\n)\n$\n(2,541\n)\nThe Company has no Federal net operating loss carryforwards for income tax purposes as of September 30, 2023.\nThe Company will recognize interest and penalties related to uncertain tax positions as a component of income tax expense.\nAs of September 30, 2023, the Company had no accrued interest or penalties related to uncertain tax positions and no amounts have been recognized in the Companys statement of operations. Income tax returns for tax years from 2019 through 2022 remain subject to examination by the taxing jurisdictions.\nOn August 16, 2022, the Inflation Reduction Act (IRA) was signed into law in the United States. Among other provisions, the IRA includes a 15% corporate minimum tax rate applied to certain large corporations and a 1% excise tax on corporate stock repurchases made after December 31, 2022.\n13.\nPROFIT SHARING AND 401(K) PLANS\nThe Company maintains a qualified retirement plan commonly referred to as a 401(k) Plan covering substantially all full-time employees under each segment.\nThe Janel Corporation 401(k) allows for employee salary deferrals including Roth 401(k) deferrals, employer matching contributions, employer profit sharing contributions and employee rollovers. The Janel Corporation 401(k) plan provides for participant contributions of up to 50% of annual compensation (not to exceed the IRS limit), as defined by the plan. The Company contributes an amount equal to 50% of the participants first 6% of contributions.\nThe combined expenses charged to operations for contributions made to the plans for the benefit of the employees for the years ended September 30, 2023 and 2022 were $535 and $379, respectively.\nThe administrative expense charged to operations for the years ended September 30, 2023 and 2022 aggregated $65 and $64, respectively.\n14.\nBUSINESS SEGMENT INFORMATION\nAs discussed above in Note 1, the Company operates in three reportable segments: Logistics, Life Sciences and Manufacturing.\nThe Companys Chief Executive Officer regularly reviews financial information at the reporting segment level in order to make decisions about resources to be allocated to the segments and to assess their performance.\nThe following tables presents selected financial information about the Companys reportable segments and Corporate for the purpose of reconciling to the consolidated totals for the fiscal years ended September 30, 2023 and 2022:\nFor the year ended September 30, 2023 (in thousands)\nConsolidated\nLogistics\nLife Sciences\nManufacturing\nCorporate\nRevenues\n$\n186,449\n$\n166,052\n$\n11,059\n$\n9,338\n$\n-\nForwarding expenses and cost of revenues\n130,777\n123,938\n2,376\n4,463\n-\nGross profit\n55,672\n42,114\n8,683\n4,875\n-\nSelling, general and administrative\n50,975\n37,310\n6,149\n2,978\n4,538\nAmortization of intangible assets\n2,098\n-\n-\n-\n2,098\nIncome (loss) from operations\n2,599\n4,804\n2,534\n1,897\n(6,636\n)\nInterest expense\n1,998\n1,357\n-\nIdentifiable assets\n96,834\n34,823\n11,932\n4,202\n45,877\nCapital expenditures, net of disposals\n$\n$\n$\n$\n$\n-\nFor the year ended September 30, 2022\n(in thousands)\nConsolidated\nLogistics\nLife Sciences\nManufacturing\nCorporate\nRevenues\n$\n316,863\n$\n295,343\n$\n11,625\n$\n9,895\n$\n-\nForwarding expenses and cost of revenues\n250,666\n242,946\n2,933\n4,787\n-\nGross profit\n66,197\n52,397\n8,692\n5,108\n-\nSelling, general and administrative\n54,723\n40,075\n5,421\n3,095\n6,132\nAmortization of intangible assets\n1,976\n-\n-\n-\n1,976\nIncome (loss) from operations\n9,498\n12,322\n3,271\n2,013\n(8,108\n)\nInterest expense\n1,276\nIdentifiable assets\n126,532\n64,630\n10,884\n4,324\n46,694\nCapital expenditures, net of disposals\n$\n$\n$\n$\n$\n-\nGoodwill and intangible assets are recorded at the Corporate level and are included in identifiable assets.\n15.\nLEASES\nThe Company has operating leases for office and warehouse space in all districts where it conducts business. As of September 30, 2023, the remaining terms of the Companys operating leases were between one and 126 months and certain lease agreements contain provisions for future rent increases. Payments due under the lease contracts include the minimum lease payments that the Company is obligated to make under the non-cancelable initial terms of the leases as the renewal terms are at the Companys option and the Company is not reasonably certain to exercise those renewal options at lease commencement.\nThe components of lease cost for the years ended September 30, 2023 and 2022 are as follows:\nOperating lease cost\n$\n2,102\n$ 1,869\nShort-term lease cost\nTotal lease cost\n$\n2,474\n$ 2,222\nRent expense for the year ended September 30, 2023 and 2022 was $2,474 and $2,222, respectively.\nOperating lease right of use assets, current portion of operating lease liabilities and long-term operating lease liabilities reported in the consolidated balance sheets for operating leases as of September 30, 2023 were $7,460, $2,020 and $5,689, respectively.\nOperating lease right of use assets, current portion of operating lease liabilities and long-term operating lease liabilities reported in the consolidated balance sheets for operating leases as of September 30, 2022 were $5,660, $1,825 and $4,001, respectively.\nDuring the twelve months ended September 30, 2023 and 2022, the Company entered into new operating leases and recorded an additional $1,759 and $ 4,397, respectively in operating lease right of use assets and corresponding lease liabilities.\nAs of September 30, 2023 and 2022, the weighted-average remaining lease term and the weighted-average discount rate related to the Companys operating leases were 5.9 years and 4.01% and 4.6 years and 3.05% respectively.\nCash paid for amounts included in the measurement of operating lease obligations were $2,012 and $1,797 for the twelve months ended September 30, 2023 and 2022.\nFuture minimum lease payments under non-cancelable operating leases as of September 30, 2023 are as follows (in thousands):\nYear End\nSeptember 30, 2023\n$\n2,066\n1,685\n1,199\n1,209\n1,196\nThereafter\n1,567\nTotal undiscounted loan payments\n8,922\nLess imputed interest\n(1,213\n)\nTotal lease obligation\n$\n7,709\n16.\nRUBICON INVESTMENT\n(in thousands, except per share data)\nOn August 19, 2022, the Company acquired 1,108,000 shares of the common stock, par value $0.001 per share, of Rubicon, at a price per share of $20.00, in a cash tender offer made pursuant to the Stock Purchase and Sale Agreement, dated July 1, 2022, between the Company and Rubicon. Pursuant to the terms of the Purchase Agreement, the Acquired Shares represented 45.0% of Rubicons issued and outstanding shares of common stock as of August 3, 2022, as reported in Rubicons Quarterly Report on Form 10-Q for the quarterly period ended June 30, 2022, filed with the SEC on August 12, 2022. The purchase price for the acquired Rubicon shares was $22,160 and was paid from the Companys cash on hand, proceeds of the Bridge Loan, funds available under the Santander Credit Facility and funds available under the First Merchants Facility. On August 12, 2022 Rubicon announced that, in connection with the cash tender offer by the Company for up to 45% of Rubicons issued and outstanding common stock, par value $0.001 per share, the Rubicon Board of Directors set August 23, 2022 (the Record Date) as the record date for its cash distribution of $11.00 per share of Common Stock (the Distribution). The Distribution and the Record Date was conditioned upon the consummation of the cash tender offer on August 19, 2022, and the Distribution in the amount of $12,188 was paid to the Company on August 29, 2022.\nThe Company revalued the investment in Rubicons securities on September 30, 2023 and 2022 and recorded a loss of $798 and $19,789, respectively within other income (loss), net of dividends on the Companys consolidated. Below is reconciliation for the changes to the investment in Rubicon for the year ended September 30, 2023 and 2022.\nSeptember 30,\nSeptember 30,\nBalance at beginning of year\n$ 2,371\n$\n-\nPurchase of Rubicon investment\n-\n22,160\nFair value adjustments to Rubicon investment\n(798 )\n(19,789\n)\nTotal\n$ 1,573\n$\n2,371\nThe summarized financial information of Rubicon as of and for the twelve months ended September 30, 2023 is as follows: total assets $4,185, total liabilities $615, total revenues $2,692, gross profit $582 and net income $735.\nThe summarized financial information of Rubicon as of and for the twelve months ended September 30, 2022 is as follows: total assets $5,340, total liabilities $2,337, total revenues $3,883, gross profit $1,505 and net income $810.\n17.\nFAIR VALUE MEASUREMENTS\nTopic 820 established a framework for measuring fair value. That framework provides a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurement) and the lowest priority to unobservable inputs (Level 3 measurement). The three levels of the fair value hierarchy under Topic 820 are described below:\nLevel 1:\nInputs to the valuation methodology are unadjusted quoted prices for identical assets or liabilities in active markets that the Company has the ability to access.\nLevel 2:\nInputs to the valuation methodology are quoted market prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant assumptions are observable in the market.\nLevel 3:\nInputs to the valuation methodology are unobservable and significant to the fair value measurement.\nThis includes certain pricing models, discounted cash flow methodologies and similar techniques that use significant unobservable inputs.\nRecurring Fair Value Measurements\nThe following table presents the Companys assets and liabilities that are measured at fair value on a recurring basis based on the three-level valuation hierarchy (in thousands):\nTotal fair value at\nSeptember 30, 2023\nQuoted prices in active\nmarkets for identical\nassets (Level 1)\nSignificant other\nobservable inputs\n(Level 2)\nSignificant\nunobservable inputs\n(Level 3)\nAssets:\nInvestment in Rubicon at fair value\n$\n1,573\n$\n1,573\n$\n-\n$\n-\n$\n1,573\n$\n1,573\n$\n-\n$\n-\nLiabilities:\nContingent earnout liabilities\n$\n2,330\n$\n-\n$\n-\n$\n2,330\n$\n2,330\n$\n-\n$\n-\n$\n2,330\nTotal fair value at\nSeptember 30, 2022\nQuoted prices in active\nmarkets for identical\nassets (Level 1)\nSignificant other\nobservable inputs\n(Level 2)\nSignificant\nunobservable inputs\n(Level 3)\nAssets:\nInvestment in Rubicon at fair value\n$\n2,371\n$\n2,371\n$\n-\n$\n-\n$\n2,371\n$\n2,371\n$\n-\n$\n-\nLiabilities:\nContingent earnout liabilities\n$\n4,580\n$\n-\n$\n-\n$\n4,580\n$\n4,580\n$\n-\n$\n-\n$\n4,580\nInvestment in Rubicon at fair value\nAs of each of September 30, 2023 and September 30, 2022, the Company held 46.6% and 45.0%, respectively, of the total issued and outstanding shares of Rubicon and reported its investment under the fair value method pursuant to ASC 320. Management determined that it was appropriate to carry its investment in Rubicon at fair value because the investment was traded on the NASDAQ stock exchange through January 2, 2023, began trading on the OTCQB Capital Market on January 3, 2023 and had daily trading activity, the combination of which provide a better indicator of value. The investment in Rubicon is re-measured at the end of each quarter based on the trading price and any change in the value is reported on the income statement as an unrealized gain or loss on marketable securities in other income (expense). Refer to Note 16 to Consolidated Financial Statements for reconciliation of changes to the investment in Rubicon for the years ended September 30, 2023 and 2022.\nContingent earnout liabilities\nThese liabilities relate to the estimated fair value of earnout payments to former IBS and ELFS owners for the periods ending September 30, 2023 and 2022. The current and non-current portions of the fair value of the contingent earnout liability at September 30, 2023 were $592 and $1,738, respectively. The current and non-current portions of the fair value of the contingent earnout liability at September 30, 2022 were $1,664 and $2,916, respectively.\nThe following table sets forth a summary of the changes in the fair value of the Companys contingent earnout liabilities, which are measured at fair value on a recurring basis utilizing Level 3 assumptions in their valuation (in thousands):\nSeptember 30,\nBalance at beginning of year\n$\n4,580\n$ 3,600\nFair value of contingent consideration recorded in connection with business combinations\n-\nEarnout payment\n(1,693 )\n-\nFair value adjustment of contingent earnout liabilities\n(857 )\nBalance at end of year\n$\n2,330\n$ 4,580\nThe\nCompany determined the fair value of the contingent earnout liability using forecasted results through the expected earnout periods. The principal inputs to the approach include expectations of the specific businesss revenue in fiscal years 2023 through 2025 using an appropriate discount rate. Given the use of significant inputs that are not observable in the market, the contingent liability is classified within Level 3 of the fair value hierarchy. There were no significant changes to this methodology during the year ended September 30, 2023.\n18.\nCOMMITMENTS AND CONTINGENCIES\nEmployment Agreements\nThe Company has various employment agreements, including employment agreements with the previous owners of ELFS and PhosphoSolutions.\n19.\nRISK AND UNCERTAINTIES\n(A)\nCurrency Risks\nThe nature of Janels operations requires it to deal with currencies other than the U.S. Dollar. As a result, the Company is exposed to the inherent risks of international currency markets and governmental interference. A number of countries where Janel maintains agent relationships have currency control regulations. The Company attempts to compensate for these exposures by accelerating international currency settlements among those agents.\n(B)\nConcentration of Credit Risk\nThe Companys assets that are exposed to concentrations of credit risk consist primarily of cash and receivables from customers. The Company places its cash with financial institutions that have high credit ratings. The receivables from clients are spread over many customers. The Company maintains an allowance for uncollectible accounts receivable based on expected collectability and performs ongoing credit evaluations of its customers financial condition. We have continued to experience heightened customer credit risk as a result of the negative impact to customers financial condition, employment levels and consumer confidence arising from economic disruptions related to the COVID-19 pandemic, and we expect that our risk in this area will remain high as long as the disruptions persist.\n(C)\nLegal Proceedings\nJanel is occasionally subject to claims and lawsuits which typically arise in the normal course of business. While the outcome of these claims cannot be predicted with certainty, management does not believe that the outcome of any of these legal matters will have a material adverse effect on the Companys business, results of operations, financial condition, or cash flows.\n(D)\nConcentration of Customers\nNo customer accounts for 10% or more of consolidated sales for the years ended September 30, 2023 and 2022. No customer accounted for 10% or more of consolidated accounts receivable at September 30, 2023 and 2022.\n(E)\nAuto Insurance\nIn the ordinary course of our Logistics business, we are a defendant in several legal proceedings arising out of the conduct of our Logistics business. These proceedings include third party claims for property damage or bodily injury incurred in connection with our services. Although there can be no assurance as to the ultimate disposition of these proceedings, we do not believe, based upon the information available at this time, that these property damage or bodily injury claims, in the aggregate, will have a material impact on our consolidated financial statements. Within our Logistics segment, ELFS, maintains auto liability for commercial trucking claims of up to $6,000 per occurrence, and general liability with of up to $6,000 per occurrence.\n20.\nSUBSEQUENT EVENTS\nOn October 4, 2023, Rubicon announced that it had authorized a cash dividend of $1.10 per share of Common Stock of Rubicon and set October 16, 2023 as the record date for the distribution. On October 23, 2023 the Company received $1,219 in dividends.\nOn December 1, 2023, in connection with an amendment (the Purchase Agreement Amendment) to that certain Membership Interest Purchase Agreement dated as of September 21, 2021 (the Purchase Agreement) among Janel Group, ELFS and former shareholders of ELFS, (the ELFS Sellers), (i) the Janel Group Borrowers and Santander entered into an Acknowledgment and Consent Agreement pursuant to which Santander consented to the Purchase Agreement Amendment and the effect of the modifications thereunder on the Santander Loan Agreement and (ii) the ELFS Sellers and Santander entered into an Acknowledgment and Consent Agreement pursuant to which Santander consented to the Purchase Agreement Amendment and the effect of the modifications thereunder on the Subordination Agreement (as defined in the Santander Loan Agreement) between Santander and the ELFS Sellers. As amended, the parties agreed to (i) certain modifications fixing the amount of the remaining earnout payments in earnout year three and four (as defined in the Purchase Agreement) to $1,078 each earnout year and (ii) extended the maturity by an additional two years and restored the pre-working capital adjusted amount of the ELFS Subordinated Promissory Notes (as defined in the Purchase Agreement) to $6,000 (increase of $900) payable to the Subordinated Lender thereunder (collectively, the Purchase Modifications)."
}