{
    "cik": "1144215",
    "company": "ACUITY BRANDS INC",
    "filing_type": "10-K",
    "filing_date": "2023-10-26",
    "period_of_report": "2023-08-31",
    "sic": "3640",
    "state_of_inc": "DE",
    "state_location": "GA",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1144215/0001144215-23-000090-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1144215/000114421523000090/ayi-20230831.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1144215/0001144215-23-000090.txt",
    "filename": "1144215_10K_2023_0001144215-23-000090.htm",
    "content": "Item 1.Business.\nOverview\nAcuity Brands, Inc. (referred to herein as we, our, us, the Company, or similar references) is a market-leading industrial technology company. We use technology to solve problems in spaces and light. Through our two business segments, Acuity Brands Lighting and Lighting Controls (ABL) and the Intelligent Spaces Group (ISG), we design, manufacture, and bring to market products and services that make a valuable difference in people's lives. We achieve growth through the development of innovative new products and services, including lighting, lighting controls, building management solutions, and location-aware applications.\nABL Segment\nOur ABL strategy is to increase product vitality, improve service levels, use technology to improve and differentiate both our products and our services, and drive productivity. ABL's portfolio of lighting solutions includes commercial, architectural, and specialty lighting in addition to lighting controls and components that can be combined to create integrated lighting controls systems. We offer devices such as luminaires that predominantly utilize light emitting diode (LED) technology designed to optimize energy efficiency and comfort for various indoor and outdoor applications. ABL's portfolio of products includes but is not limited to the following brands: A-LightTM, AculuxTM, American Electric Lighting®, CycloneTM, Dark to Light®, eldoLED®, Eureka®, Gotham®, Healthcare Lighting®, Holophane®, Hydrel®, IndyTM, IOTA®, Juno®, Lithonia Lighting®, Luminaire LEDTM, Luminis®, Mark Architectural LightingTM, nLight®, OPTOTRONIC®, Peerless®, RELOC® Wiring Solutions, and Sensor SwitchTM.\nPrincipal customers of ABL include electrical distributors, retail home improvement centers, electric utilities, national accounts, original equipment manufacturer (OEM) customers, digital retailers, lighting showrooms, and energy service companies. Our customers are located in North America and select international markets that serve new construction, renovation and retrofit, and maintenance and repair applications. ABL's lighting and lighting controls solutions are sold primarily through a network of independent sales agencies that cover specific geographic areas and market channels, by internal sales representatives, through consumer retail channels, directly to large corporate accounts, and directly to OEM customers. Products are delivered directly from our manufacturing facilities or through a network of distribution centers, regional warehouses, and commercial warehouses using both common carriers and an internally-managed truck fleet.\nWe market our product portfolio and service capabilities to customers and/or end users in multiple channels through a broad spectrum of marketing and promotional methods, including direct customer contact, trade shows, on-site training, print and digital advertising in industry publications, product brochures, and other literature, as well as through digital marketing and social media. We operate training and education facilities in several locations throughout North America and Europe designed to enhance the lighting knowledge of customers and industry professionals.\nISG Segment\nOur ISG strategy is to make spaces smarter, safer, and greener by connecting the edge to the cloud. ISG offers building management solutions and building management software. Our building management solutions include products for controlling heating, ventilation, air conditioning (HVAC); lighting; shades; refrigeration; and building access that deliver end-to-end optimization of those building systems. Our intelligent building software enhances the occupant experience, improves building system management, and automates labor intensive tasks while delivering operational energy efficiency and cost reductions. Through a connected and converged building system architecture, our software delivers different applications, allows clients to upgrade over time with natural refresh cycles, and deploys new capabilities. Customers of ISG primarily include system integrators as well as retail stores, airports, and enterprise campuses throughout North America and select international locations. ISG products and solutions are marketed under multiple brand names, including but not limited to, Atrius®, Distech Controls®, and KE2 Therm Solutions®.\nManufacturing and Distribution\nWe operate eighteen manufacturing facilities, including six facilities in the United States, seven facilities in Mexico, two facilities in Europe, and three in Canada. We utilize a blend of internal and outsourced manufacturing processes and capabilities to fulfill a variety of customer needs. Our investment in our production facilities is focused primarily on improving capabilities, product quality, and manufacturing efficiency as well as environmental, health, and safety\ncompliance. We also utilize contract manufacturing from U.S., Asian, and European sources for certain products. The following table shows the percentage of finished goods manufactured and purchased in fiscal 2023 by significant geographic region.\nManufactured Purchased Total\nUnited States 15 % 7 % 22 %\nMexico 57 % - % 57 %\nAsia - % 15 % 15 %\nOthers 6 % - % 6 %\nTotal 78 % 22 % 100 %\nWe operate seven manufacturing facilities in Mexico, some of which are authorized to operate as Maquiladoras by the Ministry of Economy of Mexico. Maquiladora status allows us to import raw materials into Mexico duty-free, provided that such items, after processing, are exported from Mexico within a stipulated time frame. Maquiladora status, which is renewed periodically, is subject to various restrictions and requirements, including compliance with the terms of the Maquiladora program and other local regulations, which have become stricter in recent years.\nDuring fiscal 2023, net sales initiated outside of the U.S. represented approximately 14% of total net sales. See the Supplemental Disaggregated Information footnote of the Notes to Consolidated Financial Statements for additional information regarding the geographic distribution of net sales, operating profit, and long-lived assets.\nResearch and Development\nResearch and development (R&D) is defined as the critical investigation aimed at discovery of new knowledge and the conversion of that knowledge into the design of a new product service or significant improvement to an existing product or service. We invest in product vitality, including enhancement of existing offerings, with a focus on improving the performance-to-cost ratio and energy efficiency. We also develop software applications and capabilities to enhance data analytics offerings for building performance, enterprise operations, and personal experiences. R&D expenses consist of compensation, payroll taxes, employee benefits, materials, supplies, and other administrative costs, but the amounts do not include all new product development costs. For fiscal 2023, 2022, and 2021, R&D expenses totaled $97.1 million, $95.1 million, and $88.3 million, respectively.\nIndustry Overview\nOur addressable market includes non-portable luminaires as defined by the National Electrical Manufacturers Association; poles for outdoor lighting; emergency lighting fixtures and lighting equipment; lighting controls; HVAC controls; refrigeration; and building technology controls, software, and systems.\nWe operate in highly competitive industries that are affected by a number of general business and economic factors, such as, but not limited to, gross domestic product growth, employment levels, credit availability, interest rates and inflation, building costs, freight, construction-related labor availability, building occupancy rates, imports and trade, energy costs, freight costs, tariffs, commodity costs, and commodity availability. Our market is based on non-residential and residential construction, both new as well as renovation and retrofit activity, which may be impacted by these general economic factors. Precise segmentation of the market by new construction and renovation activity is not available, though internal estimates based on third-party data estimate the size of the markets to be about the same. Non-residential construction spending on commercial, institutional, industrial, and infrastructure projects has a material impact on the demand for our lighting and building solutions. Demand for our residential lighting products is highly dependent on economic drivers, such as consumer spending and discretionary income, along with housing construction and home improvement spending.\nOur market is influenced by evolving technologies. This evolution includes: the development of new or improved lighting technologies, including solid-state lighting, electronic drivers, embedded lighting controls, and more effective optical designs and lamps; federal, state, and local requirements for updated energy codes; design strategies and technologies addressing sustainability and facilitating intelligent buildings; and incentives by federal, state, and local municipal authorities, as well as utility companies, for using more energy-efficient lighting and building technology solutions. We are a leading provider of integrated lighting and building technology solutions based on these technologies and utilize internally developed, licensed, or acquired intellectual property.\nCompetition\nWe experience competition based on numerous factors, including product vitality, service capabilities, price, brand name recognition, product quality, product and system design, energy efficiency, and customer relationships. The markets for lighting and building management solutions are competitive and continue to evolve through acquisition and consolidation activities. Existing and new entrants continue to develop capabilities and solutions that are both complementary as well as competitive to those of traditional industry participants. Additionally, the market for artificial intelligence and software solutions is active with a wide range of competitors, from existing large companies to startup organizations. Certain global and more diversified manufacturers may provide a broader product offering utilizing electrical, lighting, and building technology products and services as well as pricing benefits from the bundling of various offerings. In addition, there are competitors, including Asian importers, small startup companies, and global electronics, technology, and software companies, offering competing solutions, sometimes deploying different technologies.\nRegulations\nWe are subject to various federal, state, and local laws and regulations that impose increasingly complex, stringent and costly compliance activities. These laws and regulations include but are not limited to, the Clean Air Act and the Toxic Substances Control Act; the Clean Water Act; the Safe Harbor data privacy program between the U.S. and European Union; the United States-Mexico-Canada-Free Trade Agreement (USMCA); regulations from the Occupational Safety and Health Administration agency; the European Unions General Data Protection Regulation; Californias Consumer Privacy Act and Connected Device Privacy Act; the Civil Rights Act of 1964 and other federal and state labor and employment laws and regulations; the U.S. Foreign Corrupt Practices Act (the FCPA); and the U.K. Bribery Act.\nOn an ongoing basis, we allocate resources, including investments in capital and operating costs, to comply with laws and regulations. We do not currently believe that the costs of complying with government regulations have a material impact on our financial condition, results of operations, or cash flows. However, we may be affected by current or future standards, laws, or regulations, including those imposed in response to energy, substances in or components in or used in the manufacturing of our products, climate change, product functionality, geopolitics, corporate social responsibility, employee health and safety, privacy, or similar concerns. These standards, laws, and regulations may impact our costs of operation, the sourcing of raw materials, and the manufacture and distribution of our products and services. They may also place restrictions and other requirements or impediments on the products and solutions we can sell in certain geographical locations or may impact the willingness of certain investors to own our shares. See Part I. Item 1a.Risk Factors.\nThis filing contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. A variety of risks and uncertainties could cause our actual results to differ materially from the anticipated results or other expectations expressed in our forward-looking statements. See Cautionary Statement Regarding Forward-Looking Information included in Management's Discussion and Analysis of Financial Condition and Results of Operations. These risks could adversely impact our financial position, results of operations, cash flows, and financial expectations and could cause the market price of our securities to decrease. Such risks include the following, without limitation.\nRisks Related to Our Strategy\nOur business and results have been and may be adversely affected by fluctuations in the cost or availability of raw materials, components, purchased finished goods, or services.\nWe utilize a variety of raw materials and components in our production process including steel, aluminum, lamps, certain rare earth materials, microchips, light emitting diodes (LED), LED drivers, ballasts, wire, electronic components, power supplies, petroleum-based byproducts, natural gas, and copper. We also source certain finished goods externally. During early fiscal 2023, supply chain disruptions for certain components, including, notably, microchips and electronics, have resulted in higher prices for significant commodities, including oil and steel, as well as increased warehousing, freight, and container costs, which have negatively impacted our business. Although these disruptions have subsided from their peaks, future disruptions in the supply chain and shortages could affect our ability to procure components for our products on a timely basis, or at all, or could require us to commit to increased purchases and provide longer lead times to secure critical components by entering into longer term guaranteed supply agreements. Alternatively, supply chain disruptions and shortages could require us to rely on relatively high-cost spot market purchases for certain materials or products.\nFuture increases in our costs could negatively impact our profitability as there can be no assurance that future price increases will be successfully passed through to customers. Disruptions in the supply chain could also negatively impact us. We generally source our goods from a number of suppliers. However, there are a limited number of suppliers for certain components and certain purchased finished goods, which on a limited basis, results in sole-source supplier situations.\nOur competitors supply certain of those items, and those competitors may, for various strategic reasons, choose to cease selling to us. In addition, our ongoing efforts to improve the effectiveness of our supply chain could result in a reduction in the number of our suppliers, and in turn, increased risk associated with reliance on a single or a limited number of suppliers. Furthermore, volatility in certain commodities, such as oil, impacts all suppliers and, therefore, may result in additional price increases from time to time regardless of the number and availability of suppliers. Profitability and volume could be negatively impacted by limitations inherent within the supply chain of certain of these component parts, including competitive, governmental, and legal limitations, natural disasters, and other events that could impact both supply and price. Additionally, we are dependent on certain service providers for key operational functions. While there are a number of suppliers of these services, the cost to change service providers and set up new processes could be significant.\nIn addition, the labor market for skilled manufacturing remains tight, and our labor costs have increased as a result, particularly in the U.S. and Mexico.\nOur results may be adversely affected by market and competitive pricing.\nAggressive pricing actions by competitors may affect our ability to manage the price/cost relationship to achieve desired revenue growth and profitability levels. Potential decreased demand for our products resulting from factors including uncertainty in the global economy, the current inflationary environment, rising interest rates, and a potential global recession may influence competitor pricing. Additionally, dynamic pricing models may not cover our rising costs. Even if we were able to increase prices to cover our costs, competitive pricing pressures may not allow us to pass on any more than the cost increases. Alternatively, if costs were to decline, the marketplace may not allow us to hold prices at their current levels.\nInnovations of new products and services may not yield desired returns.\nContinual introductions of new products and solutions, services, and technologies, enhancement of existing products and services, and effective servicing of customers are key to our competitive strategy. The success of new product and solution introductions depends on a number of factors, including, but not limited to, timely and successful product development, product quality, market acceptance, our ability to manage the risks associated with product life cycles, such as additional inventory obsolescence risk as product life cycles begin to shorten, new products and production capabilities, effective management of purchase commitments and inventory levels to support anticipated product manufacturing and demand, availability of products in appropriate quantities and costs to meet anticipated demand, and risk that new products may have quality or other defects in the early stages of introduction. Accordingly, we cannot fully predict the ultimate effect of new product introductions on our business. Additionally, new products and solutions may not achieve the same profit margins as expected or as compared to our historic products and solutions. Furthermore, other market participants, such as well-established competitors, could develop alternative platforms for monetizing products, solutions, and services that result in a paradigm shift in our industry, particularly with respect to new and developing technologies.\nWe may not be able to identify, finance, and complete suitable acquisitions, alliances, or investments, and we may pursue future growth through acquisitions, alliances, or investments, which may not yield anticipated benefits.\nWe have strengthened our business through acquisitions, alliances, and investments and may continue to do so as opportunities arise in the future. Such investments have been and may be in startup or development-stage entities. We will benefit from such activity only to the extent that we can effectively identify suitable acquisition and alliance candidates and leverage and integrate the assets or capabilities of the acquired businesses and alliances, including, but not limited to, personnel, technology, and operating processes. It may be difficult for us to integrate acquired businesses efficiently into our business operations. Any acquisitions, alliances, or investments may not be successful or realize the intended benefits. Moreover, unanticipated events, negative revisions to valuation assumptions and estimates, diversion of resources and management's attention from other business concerns, and difficulties in attaining synergies, among other factors, could adversely affect our ability to recover initial and subsequent investments, particularly those related to acquired goodwill and intangible assets or non-controlling interests. In addition, such investment transactions may limit our ability to invest in other activities, which could be more profitable or advantageous.\nWe may experience difficulties in streamlining activities, which could impact shipments to customers, product quality, and the realization of expected savings from streamlining actions.\nWe expect to benefit from potential programs to streamline operations, including the consolidation of certain facilities and the reduction of overhead costs. Such benefits will only be realized to the extent that we can effectively leverage assets, personnel, and operating processes in the transition of production between manufacturing facilities. Uncertainty is inherent within the facility consolidation process, and unforeseen circumstances could offset the anticipated benefits, disrupt service to customers, and impact product quality.\nGeneral business, political, and economic conditions, including the strength of the construction and renovation market, political events, or other factors may affect demand for our products and services.\nWe compete based on numerous factors, including product vitality and service levels, as well as features and benefits, brand name recognition, product quality, product and system design, energy efficiency, customer relationships, service capabilities, and price. In addition, we operate in a highly competitive environment that is influenced by a number of general business and economic factors, such as economic vitality, employment levels, credit availability, interest rates, trends in vacancy rates and rent values, energy costs, and commodity costs. Sales of lighting, lighting controls, and building technology solutions depend significantly on the level of activity in new construction and renovation/retrofits. Declines in general economic activity, appropriations, and regulations, including tax and trade policy and other political uncertainties, may negatively impact new construction and renovation projects, which in turn may impact demand for our product and service offerings.\nDecreased construction and renovation spending and consumer demand for our products and services, along with rising commodity costs may materially affect our future access to our sources of liquidity, particularly our cash flows from operations, financial condition, capitalization, and capital investments. Additionally, current uncertain economic conditions, including economic slowdowns, supply chain disruptions, and a potential global recession, could adversely affect our ability to access the capital and other financial markets, and may require us to consider alternative sources of funding for some of our operations and for working capital, which may increase our cost of, as well as adversely impact our access to, capital. These uncertain economic conditions may also result in the inability\nof our customers and other counter-parties to make payments to us, on a timely basis or at all.\nRisks Related to Our Operations\nTechnological developments and increased competition could affect our operating profit margins and sales volume.\nWe compete in an industry and markets where technology and innovation play major roles in the competitive landscape. We are highly engaged in the investigation, development, and implementation of new technologies and services. Securing employee talent, key partnerships, and alliances, including having access to technologies, services, and solutions developed by others, as well as obtaining appropriate patents and the right to utilize patents of other parties all play a significant role in protecting our freedom to operate. Additionally, the continual development of new technologies by existing and new source suppliers - including non-traditional competitors with significant resources - looking for either direct market access or partnerships with competing large manufacturers, coupled with significant associated exclusivity and/or patent activity, could adversely affect our ability to sustain operating profit margins and desirable levels of sales volume.\nIn addition, there are new competitors, including small startup companies and global electronics, technology, and software companies, offering competing solutions, sometimes deploying different technologies. These competitors may vertically integrate and begin offering total solution packages that directly compete with our offerings. Certain global and more diversified electrical manufacturers as well as certain global technology and building solution providers may be able to obtain a competitive advantage, either through internal development or acquisitions, over us by offering broader and more integrated solutions utilizing electrical, lighting, controls, building automation solutions, and data analytics, and small startup companies may offer more localized product sales and support services within individual regions.\nWe may be unable to sustain significant customer and/or channel partner relationships.\nRelationships with customers are directly impacted by our ability to deliver quality products and services. Although no individual customer exceeded 10% of net sales during fiscal 2023, the loss of or a substantial decrease in the volume of purchases by certain larger customers could harm our business in a meaningful manner. We have relationships with channel partners such as electrical distributors, home improvement retailers, independent sales agencies, system integrators, and value-added resellers. While we maintain positive, and in many cases long-term, relationships with these channel partners, the sudden or unplanned loss of a number of these channel partners or a substantial decrease in the volume of purchases from a major channel partner or a group of channel partners could adversely affect our business.\nWe could be adversely affected by external disruptions to our operations.\nThe breakdown of equipment or other events, including, but not limited to, labor disputes, strikes, workplace violence, public health crises, pandemics and epidemics (such as the recent COVID-19, or similar or related, pandemics or endemics), climate change, brown outs and other power outages, earthquakes, fires, explosions, terrorism, adverse weather conditions, water scarcity, cyber-attacks, civil disruptions, or catastrophic events such as war or natural disasters, leading to production interruptions in our or one or more of our suppliers facilities could adversely affect us. Approximately 57% of our finished products are manufactured in Mexico, a country that periodically experiences heightened civil unrest or may experience trade disputes with the U.S., both of which could cause a disruption of the supply of products to or from these facilities. Further, because many of our customers are to varying degrees dependent on planned deliveries from our facilities, those customers that have to reschedule their own production or delay opening a facility due to our missed deliveries as a result of these disruptions could pursue financial claims against us. We may incur costs to correct any of these problems in addition to facing claims from customers. Further, our reputation among actual and potential customers may be harmed and result in a loss of business. Further, these types of events may negatively impact residential, commercial, and industrial spending, including construction and renovation spending as well as consumer spending on our products, in impacted regions or, depending on the severity, globally. As a result, any of such events could adversely impact us. While we have developed business continuity plans, including alternative capacity, to support responses to such events or disruptions and maintain insurance policies covering, among other things, physical damage and business interruptions, these policies may not cover all losses. We could incur uninsured losses and liabilities arising from such events, including damage to our reputation, loss of customers, and substantial losses in operational capacity.\nCurrent global conflicts, such as the those between Russia and Ukraine as well as within the Middle East, have created substantial uncertainty in the global economy, including sanctions and penalties imposed on certain\ncountries from several governments. While we do not have operations in these locations and do not have significant direct exposure to customers and vendors in those countries, we are unable to predict the impact that these actions will have on the global economy or on our financial condition, results of operations, and cash flows as of the date of these financial statements.\nCompany operating systems, information systems, or devices have experienced, and may experience in the future, a failure, a compromise of security, or a violation of data privacy laws or regulations, which could adversely impact our operations as well as the effectiveness of internal controls over operations and financial reporting.\nWe are highly dependent on various software and automated systems to record and process operational and financial transactions. We have experienced, and could experience in the future, a failure of one or more of these software and automated systems or could fail to complete all necessary data reconciliation or other conversion controls when implementing a new software system.\nWe have also experienced compromises of our security, and could experience in the future, a compromise of our security due to many reasons, including technical system flaws, clerical, data input or record-keeping errors, or tampering or manipulation of our systems by employees or unauthorized third parties, including viruses, malware, or phishing. Information security risks also exist with respect to the use of portable electronic devices, such as laptops and smartphones, which are particularly vulnerable to loss and theft. We may also be subject to disruptions of any of these systems arising from events that are wholly or partially beyond our control (for example, natural disasters, acts of terrorism, cyber-attacks, including but not limited to hacking, malware, ransomware attacks, denial-of-service attacks, social engineering, exploitation of internet-connected devises, and other attacks, epidemics, computer viruses, and electrical/telecommunications outages). While prior compromises of our security have not had, in the aggregate, a material impact on the Companys operations and financial condition, the Company expects events of this nature to continue as cyber-attacks are becoming more sophisticated and frequent, and the techniques used in such attacks change rapidly. The Company monitors its data, information technology and personnel usage of Company systems to reduce these risks and continues to do so on an ongoing basis for any current or potential threats.\nIf any of our hardware, software, or automated systems are compromised, fail, or have other significant shortcomings, it could disrupt our business, require us to incur substantial additional expenses, or result in potential liability or reputational damage. There can be no assurance that our efforts to protect our data and information technology will prevent such compromises of security.\nWe also provide and maintain technology to enable lighting controls and building technology systems. In addition to the risks noted above, there are other risks associated with these customer offerings. For example, a customer may depend on integral information from, or functionality of, our technology to support that customers other systems, such that a failure of our technology could impact those systems, including by loss or destruction of data. Likewise, a customers failure to properly configure, update, segregate, or upgrade its own network and integrations with our technology are outside of our control and could result in a failure in functionality or security of our technology.\nWe and certain of our third-party vendors may receive and store personal information in connection with human resources operations, customer offerings, and other aspects of the business. A material network breach in the security of these systems could include the theft of intellectual property, trade secrets, the unauthorized release, gathering, monitoring, misuse, loss, change, or destruction of our or our customers', suppliers', or other third-party's confidential, proprietary and other information (including personal identifying information of individuals), or otherwise disrupt our or our clients' or other third parties' business operations. To the extent that any disruption or security breach results in a loss or damage to our data, or an inappropriate disclosure of confidential or customer or employee information, it could cause significant damage to our reputation, affect relationships with our customers, employees, and other counterparties, lead to claims against us, which may result in the payment of fines, penalties, and costs, and ultimately harm our business. In addition, we may be required to incur significant costs, or regulatory fines, penalties, or intervention, to protect against damage caused by these disruptions or security breaches in the future.\nWe are also subject to an increasing number of data privacy and security laws and regulations that impose requirements on us and our technology prior to certain use or transfer, storing, use, processing, disclosure, and protection of data and prior to sale or use of certain technologies. Failure to comply with such laws and regulations could result in the imposition of fines, penalties and other costs. The legal and regulatory data privacy framework is evolving and uncertain.\nSystem failures, ineffective system implementation or disruptions, failure to comply with data privacy and security laws or regulations, or the compromise of security with respect to internal or external systems or portable electronic devices could damage our systems or infrastructure, subject us to liability claims, or regulatory fines, penalties, or intervention, harm our reputation, interrupt our operations, disrupt customer operations, and adversely affect our internal control over financial reporting, business, financial condition, results of operations, or cash flows.\nChanges in our relationship with employees, changes in U.S. or international employment regulations, an inability to attract and retain talented employees, or a loss of key employees could adversely impact the effectiveness of our operations.\nWe employed approximately 12,200 people as of August 31, 2023, approximately 8,600 of whom are employed in international locations. As such, we have significant exposure to changes in domestic and foreign laws governing relationships with employees, including wage and hour laws and regulations, fair labor standards, minimum wage requirements, overtime pay, unemployment tax rates, workers' compensation rates, citizenship requirements, and payroll taxes, which likely would have a direct impact on our operating costs. Union recognition and collective bargaining agreements are in place or in process covering approximately 65% of our workforce. Collective bargaining agreements representing approximately 57% of our workforce will expire within one year, primarily due to annual negotiations with unions in Mexico. While we believe that we have good relationships with both our unionized and non-unionized employees, we may become vulnerable to a strike, work stoppage, or other labor action by these employees.\nOur success is also dependent upon our ability to attract, retain, and motivate a qualified and diverse workforce, and there can be no assurance that we will be able to do so, particularly during times of increased labor costs or labor shortages. We rely upon the knowledge and experience of employees involved in functions throughout the organization that require technical expertise and knowledge of the industry. We have experienced intense competition for qualified and capable personnel in key markets and with key skills, and we cannot provide assurance that we will be able to retain our key employees or that we will be successful in attracting, assimilating, and retaining personnel in the future. In addition, our growth may be constrained by resource limitations as competitors and customers compete for increasingly scarce human capital resources. The demand for skilled workers is currently high. We face an increasingly competitive labor market due to sustained labor shortages in part and are subject to inflationary pressures on employee wages and salaries, which may increase labor costs. Our competitors may be able to offer a work environment with higher compensation or more opportunities than we can. An inability to attract and retain a sufficient number of employees could adversely impact our ability to execute key operational functions.\nThere are inherent risks in our solutions and services businesses.\nRisks inherent in the sale of solutions and services include assuming greater responsibility for successfully delivering projects that meet a particular customer specification, including: defining and controlling contract scope and timing, efficiently executing projects, and managing the performance and quality of subcontractors and suppliers and our own systems. As we expand our service and solutions offerings, reliance on the technical infrastructure to provide services to customers will increase. If we fail to appropriately manage and secure the technical infrastructure required, customers could experience service outages or delays in implementation of services. If we are unable to manage and mitigate these risks, we could incur liabilities and other losses.\nWe may be subject to risk in connection with third-party relationships necessary to operate our business.\nWe utilize strategic partners and third-party relationships in order to operate and grow our business. For instance, we utilize third parties to contract manufacturing of certain products, subcontract installation and commissioning, as well as perform certain selling, distribution, and administrative functions. We cannot control the actions or performance, including product quality, of these third parties and therefore, cannot be certain that we or our end-users will be satisfied. Any future actions of or any failure to act by any third party on which our business relies could cause us to incur losses or interruptions in our operations. In addition, we act as a general contractor in certain relationships with third-parties, and as such are subject to risks applicable to general contractors.\nWe are subject to risks related to operations and suppliers outside the United States.\nWe have substantial activities outside of the United States, including sourcing of products, materials, components, and contract manufactured finished goods, as well as manufacturing and distribution activities. Our operations, as well as those of key vendors, are therefore subject to regulatory, economic, political, military, and other events in countries where these operations are located. In addition to the risks that are common to both our domestic and\ninternational operations, we face risks specifically related to our foreign operations and sourcing activities, including but not limited to: foreign currency fluctuations; unstable political, social, regulatory, economic, financial, and market conditions; laws that prohibit shipments to certain countries or restricted parties and that prohibit improper payments to government officials such as the Foreign Corrupt Practices Act and the U.K. Bribery Act; potential for privatization and other confiscatory actions; trade restrictions and disruption; shipping delays or disruptions; criminal activities; increases in tariffs and taxes; corruption; terrorist action; nationalization and expropriation; limitations on repatriation of earnings or other capital requirements; and other changes in regulation in international jurisdictions that could result in substantial additional legal or compliance obligations for us.\nWe source certain components and approximately 15% of our finished goods from Asia, a significant portion of which are subject to import tariffs. These tariffs could increase in future periods resulting in higher costs and/or lower demand. We could be adversely affected to the extent we are unable to mitigate the impacts of the tariffs.\nWe operate seven manufacturing facilities in Mexico, some of which are authorized to operate as Maquiladoras by the Ministry of Economy of Mexico. Maquiladora status allows us to import raw materials into Mexico duty-free, provided that such items, after processing, are exported from Mexico within a stipulated time frame. Maquiladora status, which is renewed periodically, is subject to various restrictions and requirements, including compliance with the terms of the Maquiladora program and other local regulations, which have become stricter in recent years. In addition, if our Mexican facilities cease to qualify for Maquiladora status or if the Mexican government adopts additional adverse changes to the program, including nationalization, our manufacturing costs in Mexico would increase.\nWe are also subject to certain other laws and regulations affecting our international operations, including laws and regulations such as the United States, Mexico, Canada Free Trade Agreement (USMCA) which, among other things, provide certain beneficial duties and tariffs for qualifying imports and exports, subject to compliance with the applicable classification and other requirements. A majority of our sales are subject to USMCA. In addition, the US government has initiated or is considering imposing tariffs on certain foreign goods, including steel and aluminum. Related to this action, certain foreign governments, including China, have instituted or are considering imposing tariffs on certain U.S. goods. It remains unclear what the U.S. Administration or foreign governments will or will not do with respect to tariffs, the USMCA, or other international trade agreements and policies. A trade war or other governmental action related to tariffs or international trade agreements or policies has the potential to adversely impact demand for our products, costs, customers, suppliers, and/or the US economy or certain sectors thereof and, thus, to adversely impact our business.\nThe evolution of our products, complexity of our supply chain, and reliance on third-party vendors such as customs brokers and freight vendors, which may not have effective processes and controls to enable us to fully and accurately comply with such requirements, could subject us to liabilities for past, present, or future periods. Such liabilities could adversely impact our business.\nWe continue to monitor conditions affecting our international locations, including potential changes in income from a strengthening or weakening in foreign exchange rates in relation to the U.S. dollar. Some of these risks, including but not limited to foreign exchange rates, violations of laws, and higher costs associated with changes in regulation, could adversely impact our business.\nOur business could be negatively impacted by social impact and sustainability matters.\nThere has been, and may continue to be, an increasing focus from U.S. and foreign government agencies, certain investors, customers, consumers, employees, and other stakeholders concerning environmental, social and governance (ESG) matters. Some investors may use ESG criteria to guide their investment strategies and, in some cases, may choose not to invest in us if they believe our policies relating to corporate responsibilities do not align with their ESG criteria. In addition, different stakeholder groups have divergent views on ESG matters, which increases the risk that any action or lack thereof with respect to ESG matters will be perceived negatively by at least some stakeholders and could adversely affect our reputation, business, financial performance, and growth.\nWe may, from time to time, communicate certain initiatives, targets, and goals, regarding environmental matters, diversity, responsible sourcing and social investments and other ESG matters. These initiatives, targets, and goals could be difficult and expensive to implement, and we could be criticized for the accuracy, adequacy, or completeness of the disclosure thereof. Further, statements about our ESG initiatives, targets, and goals, and progress against those targets and goals, may be based on standards for measuring progress that are still developing, internal controls and processes that continue to evolve, as well as assumptions, estimates and climate scenarios that are subject to change in the future. In addition, we could be criticized or subject to litigation for the scope or nature of such initiatives, targets, or goals, or for any revisions to such targets or goals. If our ESG-related data, processes, and reporting are incomplete or inaccurate, or if we fail, or are perceived to fail, to achieve\nprogress with respect to our ESG targets or goals on a timely basis, or at all, our reputation, business, financial performance, and growth could be adversely affected.\nWe have begun to incorporate artificial intelligence capabilities in our product offerings, and challenges with properly managing the use of artificial intelligence and machine learning could result in reputational harm, competitive harm, and legal liability, and adversely affect our results of operations, financial condition, and/or cash flows.\nWe have begun incorporating artificial intelligence (AI) capabilities into certain product offerings. These features may become important in our operations over time. Our competitors or other third parties may incorporate AI into their products more quickly or more successfully than us, which could impair our ability to compete effectively and adversely affect our results of operations. Additionally, if the content, analyses, or recommendations that AI applications assist in producing are or are alleged to be deficient, inaccurate, or biased, we could be subject to competitive risks, potential legal liability, and reputational harm, and our business, financial condition, and results of operations may be adversely affected. The use of AI capabilities may also result in cybersecurity incidents. Any such cybersecurity incidents related to our use of AI capabilities could adversely affect our business.\nRisks Related to Legal and Regulatory Matters\nFailure to comply with the broad range of standards, laws, and regulations in the jurisdictions in which we operate may result in exposure to substantial disruptions, costs, and liabilities.\nWe are subject to various foreign and domestic federal, state, and local laws and regulations that include but are not limited to, the Clean Air Act and the Toxic Substances Control Act; the Clean Water Act; the Safe Harbor data privacy program between the U.S. and European Union; the United States-Mexico-Canada-Free Trade Agreement (USMCA); regulations from the Occupational Safety and Health Administration agency; the European Unions General Data Protection Regulation; Californias Consumer Privacy Act and Connected Device Privacy Act; the Civil Rights Act of 1964 and other federal and state labor and employment laws and regulations; the U.S. Foreign Corrupt Practices Act (the FCPA); and the U.K. Bribery Act. The laws and regulations impacting us impose increasingly complex, stringent, and costly compliance activities.\nConcerns regarding climate change may also lead to significant legislative and regulatory responses, including efforts to limit greenhouse gas (GHG) emissions. The United States Environmental Protection Agency (EPA) has implemented regulations that require reporting of GHG emissions or that limit emissions of GHGs from certain mobile or stationary sources. In addition, the U.S. Congress and federal and state regulatory agencies have considered other legislation and regulatory proposals to reduce emissions of GHGs, and many states and other jurisdictions have already taken legal measures to reduce emissions of GHGs, primarily through the development of GHG inventories, GHG permitting, and/or regional GHG cap-and-trade programs. It is uncertain whether, when, and in what form a federal mandatory carbon dioxide emissions reduction program, or other state programs, may be adopted. Similarly, certain countries have adopted the Kyoto Protocol, and in February 2021, the U.S. rejoined the Paris Agreement.\nIn addition, permits and environmental controls are required for certain of our operations to limit air and water pollution, and these permits are subject to modification, renewal, and revocation by issuing authorities. Some environmental laws, such as Superfund, the Clean Water Act, and comparable laws in U.S. states and other jurisdictions worldwide, impose joint and several liability for the cost of environmental remediation, natural resource damages, third-party claims, and other expenses, without regard to the fault or the legality of the original conduct, on those persons who contributed to the release of a hazardous substance into the environment. Environmental laws and regulations have generally become stricter in recent years, and certain federal, state, and local governments domestically and internationally, have enacted, or are considering enacting, new laws and regulations, including those governing raw material composition, carbon dioxide and other air emissions, end-of-life product dispositions, energy efficiency, and certain additional disclosure obligations related to the above.\nWe may be affected by those or other future standards, laws, or regulations, including those imposed in response to energy, climate change, our carbon footprint, product functionality, geopolitical, corporate social responsibility, or similar concerns. As customers become increasingly concerned about the environmental impact of their purchases, if we fail to keep up with changing regulations or innovate or operate in ways that minimize the energy use of or other impacts of our products or operations, customers may choose more energy efficient or sustainable alternatives. These standards, laws, or regulations may also impact our costs of operation, the sourcing of raw materials, and the manufacture and distribution of our products and may place restrictions and other requirements or impediments on the products and solutions we can sell in certain geographical locations or on the willingness of certain investors to own our shares. In addition, we may be subject to consumer lawsuits or enforcement actions by\ngovernmental authorities if our ESG claims relating to product marketing are inaccurate. At the same time, certain actions that we may take in our efforts to address ESG concerns may be challenged as being inconsistent or prohibited by various federal, state or local laws and regulations. It is uncertain what laws, rules or regulations may be enacted, or how courts may interpret them in the future, and therefore we cannot predict the potential impact such laws or regulations may have on our future financial condition, results of operations, and cash flows. The laws and regulations regarding ESG disclosures and requirements are also rapidly evolving and could have an adverse effect on our operations and the costs of compliance with, and the other burdens imposed by, these and other laws or regulatory actions may increase our operational costs.\nIt is uncertain what laws will be enacted, and therefore we cannot predict the potential impact of such laws on our future financial condition, results of operations, and cash flows. The laws and regulations regarding ESG disclosures and requirements are also rapidly evolving and could have an adverse effect on our operations and the costs of compliance with, and the other burdens imposed by, these and other laws or regulatory actions may increase our operational costs.\nWe may develop unexpected legal contingencies or matters that exceed insurance coverage.\nWe are subject to and in the future may be subject to various claims, including legal claims arising in the normal course of business. Such claims may include without limitation employment claims, product recall, personal injury, network security, data privacy, or property damage claims resulting from the use of our products, services, or solutions, as well as exposure to hazardous materials, contract disputes, or intellectual property disputes. We are insured up to specified limits for certain types of losses with a self-insurance retention per occurrence, including product or professional liability, and cyber liability, including network security and data privacy claims, and are fully self-insured for certain other types of losses, including environmental, product recall, warranties, commercial disputes, and patent infringement. We establish accruals for legal claims when the costs associated with the claims become probable and can be reasonably estimated. The actual costs of resolving legal claims may be substantially higher or lower than the level of insurance coverage we hold and/or the amounts accrued for such claims. In the event of unexpected future developments, it is possible that the ultimate resolutions of such matters could be unfavorable. Our insurance coverage is negotiated on an annual basis, and insurance policies in the future may have coverage exclusions that could cause claim-related costs to rise.\nIf our products are improperly designed, manufactured, packaged, or labeled, or are otherwise alleged to cause harm or injury, we may need to recall those items, may have increased warranty costs, and could be the target of product liability claims.\nWe may need to recall products if they are improperly designed, manufactured, packaged, or labeled, and we do not maintain insurance for such recall events. Many of our products and solutions have become more complex in recent years and include more sophisticated and sensitive electronic components. A problem or issue relating to any individual component could have the effect of creating a compounded problem for an integrated solution, which could result in significant costs and losses. We have increasingly manufactured certain of those components and products in our own facilities. We have previously initiated product recalls as a result of potentially faulty components, assembly, installation, design, and packaging of our products. Widespread product recalls could result in significant losses due to the costs of a recall, the destruction of product inventory, penalties, and lost sales due to the unavailability of a product for a period of time. In addition, products we developed that incorporate technologies, such as LED, generally provide for more extensive warranty protection, which may result in higher costs if warranty claims on these products are higher than historical amounts. We may also be liable if the use or failure of any of our products cause harm, whether from fire, shock, harmful materials or components, alleged adverse health impacts from exposure to light emitted by our products, or any other personal injury or property damage, and we could suffer losses from a significant product liability judgment against us in excess of our insurance limits. We may not be able to obtain indemnity or reimbursement from our suppliers or other third parties for the warranty costs or liabilities associated with our products, even if such costs or liabilities are covered under supplier warranty obligations. A significant product recall, warranty claim, or product liability case could also result in adverse publicity, damage to our reputation, and a loss of consumer confidence in our products.\nWe may not be able to adequately protect our intellectual property and could be the target of intellectual property claims.\nWe own certain patents, trademarks, copyrights, trade secrets, and other intellectual property. In addition, we continue to file patent applications, when appropriate. We cannot be certain that others have not and will not infringe on our intellectual property rights; however, we seek to establish and protect those rights, which could result in significant legal expenses and adversely affect our financial condition and results of operations.\nOver the last several years, we and others in the industry have received an increased number of allegations of patent infringement from competitors and from non-practicing entity patent holders, often coupled with offers to license such patents for our use. Such offers typically relate to various technologies including electronics, power systems, controls, and software, as well as the use of visible light to communicate data, the use of certain wireless networking methods, and the design of specific products. We believe that we do not need or will be able to invalidate or access such patents through licensing, cross-licensing, or other mutually beneficial arrangements, although to the extent we are required but unable to enter into such arrangements on acceptable economic terms, it could adversely impact us.\nWe are exposed to certain regulatory, financial and other risks related to climate change and other sustainability matters.\nThe scientific consensus indicates that emissions of greenhouse gases (GHG) continue to alter the composition of Earths atmosphere in ways that are affecting, and are expected to continue to affect, the global climate. The potential impacts of climate change on our customers, product offerings, operations, facilities, and suppliers are accelerating and uncertain, as they will be particular to local and customer-specific circumstances.\nConcerns regarding climate change may lead to significant legislative and regulatory responses, including efforts to limit GHG emissions. The EPA has implemented regulations that require reporting of GHG emissions or that limit emissions of GHGs from certain mobile or stationary sources. In addition, the U.S. Congress and federal and state regulatory agencies have considered other legislation and regulatory proposals to reduce emissions of GHGs, and many states have already taken legal measures to reduce emissions of GHGs, primarily through the development of GHG inventories, GHG permitting, and/or regional GHG cap-and-trade programs. It is uncertain whether, when, and in what form a federal mandatory carbon dioxide emissions reduction program, or other state programs, may be adopted. Similarly, certain countries have adopted the Kyoto Protocol, and in February 2021, the U.S. rejoined the Paris Accord. These and other existing or potential international initiatives and regulations could affect our international operations. As customers become increasingly concerned about the environmental impact of their purchases, if we fail to keep up with changing regulations or innovate or operate in ways that minimize the energy use of our products or operations, customers may choose more energy efficient or sustainable alternatives. These actions could also increase costs associated with our operations, including costs for raw materials and transportation. We may also be subject to consumer lawsuits or enforcement actions by governmental authorities if our ESG claims relating to product marketing are inaccurate. It is uncertain what laws will be enacted, and therefore we cannot predict the potential impact of such laws on our future financial condition, results of operations, and cash flows.\nIn addition, investors and stakeholders are increasingly focused on ESG matters, and as stakeholder ESG expectations and standards evolve, our failure to sufficiently respond to these evolving standards and expectations may cause us to suffer from reputational damage, and our business or financial condition could be adversely affected. The laws and regulations regarding ESG disclosures and requirements are also rapidly evolving and could have an adverse effect on our operations and the costs of compliance with, and the other burdens imposed by, these and other laws or regulatory actions may increase our operational costs.\nTax liabilities due in the jurisdictions in which we operate may exceed anticipated amounts.\nOur operations are subject to income tax, sales tax, value-added tax (VAT), excise tax, property tax, and other taxes and assessments at federal, state, local, and international levels. Our consolidated tax obligation is driven largely by our corporate structure as well as domestic and international intercompany arrangements. We operate in several jurisdictions, including but not limited to, the United States, Mexico, Canada, and Europe. Certain jurisdictions may aggressively interpret their laws, regulations, and policies in an effort to raise additional tax revenue, and international tax authorities may seek to assert extraterritorial taxing rights on our transactions or operations.\nWe have previously been subject to domestic and international tax audits by taxing authorities of the jurisdictions which we operate, and we may be subject to additional such audits in the future. While our previous audits resulted in no significant findings, and we believe we continue to be in compliance with relevant tax laws, tax authorities may challenge or disagree with certain positions or methodologies in calculating our tax positions An unfavorable interpretation or outcome could increase our worldwide effective tax rate, result in additional tax obligations owed, impact the amount of recoverable VAT, and/or increase excise taxes owed, which could have an adverse impact on our financial position, results of operations, and/or cash flows.\nFurther, tax laws and regulations in domestic and international jurisdictions are often extremely complex and subject to varying interpretations and may require us to make judgments and estimates about our provisions, including with\nrespect to certain transactions where the ultimate tax determination is uncertain. Although we believe that our estimates are reasonable, the ultimate tax outcome may differ from the amounts recorded, which could have a material impact on our financial position, results of operations, and/or cash flows.\nAdditionally, our future income tax obligations could be adversely affected by changes in, or interpretations of, tax laws, regulations, policies, or decisions in the United States or in the other jurisdictions in which we operate.\nRisks Related to Financial Matters\nThe market price and trading volume of our shares may be volatile.\nThe market price of our common shares could fluctuate significantly for many reasons, including reasons unrelated to our specific performance, such as reports by industry analysts, investor perceptions, or negative announcements by customers, competitors, or suppliers regarding their own performance, as well as general global economic, industry, and political conditions. Our performance could be different than analyst expectations or issued guidance, causing a decline in our stock price. To the extent that other large companies within our industry experience declines in share price, our share price may decline as well. In addition, we may discontinue or reduce dividend payments and may discontinue or suspend our share repurchase program based on several factors, including our cash balances and potential future capital requirements for strategic transactions, including acquisitions, results of operations, financial condition and other factors that our Board of Directors may deem relevant. Any modification or suspension of dividends and any suspension or termination of our share repurchase program could cause our stock price to decline.\nWhen the market price of a companys shares drops significantly, shareholders could institute securities class action lawsuits against us or otherwise engage in activism, which could cause us to incur substantial costs and could divert the time and attention of our management and other resources.\nRisks related to our defined benefit retirement plans may adversely impact results of operations and cash flows.\nSignificant changes in actual investment returns on defined benefit plan assets, discount rates, and other factors could adversely affect our comprehensive income and the amount of contributions we are required to make to the defined benefit plans in future periods. As our defined benefit plan assets and liabilities are marked-to-market on an annual basis, large non-cash gains or losses could be recorded in the fourth quarter of each fiscal year. In accordance with United States generally accepted accounting principles, the income or expense for the plans is calculated using actuarial valuations. These valuations reflect assumptions about financial markets and interest rates, which may change based on economic conditions. Funding requirements for the defined benefit plans are dependent upon, among other things, interest rates, underlying asset returns, and the impact of legislative or regulatory changes related to defined benefit funding obligations. Unfavorable changes in these factors could adversely affect our results.\nOur business and operations are subject to interest rate risks, and changes in interest rates can reduce demand for our products and increase borrowing costs.\nRising interest rates could have a negative effect on overall economic activity, and could impair the ability of real estate developers, property owners, and contractors to obtain reasonable costs of capital on borrowed funds, resulting in depressed levels of construction and renovation projects and a resulting decrease in demand for our products and services. Rising interest rates could also impair our customers ability to repay obligations to us. Additionally, rising interest rates may increase our cost of capital, which could have material adverse effects on our financial condition and cash flows.\nThe instability of certain financial institutions may have adverse impacts on certain of our vendors and customers and/or on our ability to access our cash deposits, which could negatively impact our cash flows, results of operations, and financial condition.\nDuring fiscal 2023, there have been public reports of instability at certain financial institutions. Although we do not hold material deposits or investments at these financial institutions, and despite the steps taken to date by U.S. and foreign agencies and institutions to protect depositors, the follow-on effects of the events surrounding recent bank failures and pressure on other financial institutions are unknown, could include failures of other financial institutions to which we face direct or indirect exposure, and may lead to significant disruptions to the cash flows, operations and financial condition of our vendors, customers, and/or us. Additionally, tight credit conditions could impair the ability of real estate developers, property owners, and contractors to effectively access capital markets or obtain\nreasonable costs of capital on borrowed funds, resulting in depressed levels of construction and renovation projects. The inability of these constituents to borrow money to fund construction and renovation projects may reduce the demand for the Companys products and services. Item 1b.Unresolved Staff Comments.\nNone.\nItem 1c.Cybersecurity.\nNot applicable. Item 2.Properties.\nOur general corporate offices are located in Atlanta, Georgia. Because of the diverse nature of operations and the large number of individual locations, it is neither practical nor meaningful to describe each of our operating facilities owned or leased. The following listing summarizes the significant facility categories by which reportable segment, Acuity Brands Lighting and Lighting Controls (ABL) or the Intelligent Spaces Group (ISG), the facility primarily benefits as of August 31, 2023:\nABL ISG Corporate Total\nNature of Facilities Owned Leased Owned Leased Leased Owned Leased\nManufacturing facilities 10 5 2 1 - 12 6\nWarehouses - 1 - - - - 1\nDistribution centers 2 6 - - - 2 6\nOffices 5 10 - 3 1 5 14\nTotal 17 22 2 4 1 19 27\nThe following table provides additional geographic information related to our manufacturing facilities as of August 31, 2023:\nUnited States Mexico Europe Canada Total\nABL:\nOwned 4 5 1 - 10\nLeased 1 2 - 2 5\nTotal 5 7 1 2 15\nISG:\nOwned - - 1 1 2\nLeased 1 - - - 1\nTotal 1 - 1 1 3\nWe believe that our properties are well maintained and in good operating condition and that our properties are suitable and adequate for our present needs. Initiatives related to enhancing global operations may result in the future consolidation of certain facilities. Item 3.Legal Proceedings.\nSee the Commitments and Contingencies footnote of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K for information regarding our legal proceedings. Item 4.Mine Safety Disclosures.\nNot applicable.\nPART II Item 5.Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities.\nOur common stock is listed on the New York Stock Exchange under the symbol AYI. At October 20, 2023, there were 1,785 stockholders of record.\nThe timing, declaration, and payment of future dividends to holders of our common stock will depend upon many factors, including our cash balances and potential future capital requirements for strategic transactions, including acquisitions, results of operations, financial condition, and other factors that our Board of Directors may deem relevant.\nThe information required by this item with respect to equity compensation plans is included under the caption Equity Compensation Plans in our proxy statement for the annual meeting of stockholders to be held January 24, 2024, which we will file with the Securities and Exchange Commission pursuant to Regulation 14A. The proxy statement is incorporated herein by reference.\nIssuer Purchases of Equity Securities\nOn March 31, 2022, the Board of Directors (the Board) authorized the repurchase of up to five million shares of our common stock. Under the current share repurchase authorization, we may repurchase shares of our common stock from time to time at prevailing market prices, depending on market conditions, through open market or privately negotiated transactions. No date has been established for the completion of the share repurchase program, and we are not obligated to repurchase any shares. Subject to applicable corporate securities laws, repurchases may be made at such times and in such amounts as management deems appropriate. Repurchases under the program can be discontinued at any time management feels additional repurchases are not warranted. As of August 31, 2023, the maximum number of shares that may yet be repurchased under the share repurchase program authorized by the Board equaled 1.2 million shares. The following table summarizes share repurchase activity by month for the quarter ended August 31, 2023:\nPeriod Total Number of Shares Purchased Average Price Paid per Share Total Number of Shares Purchased as Part of Publicly Announced Plans or Programs Maximum Number of Shares that May Yet Be Purchased Under the Plans or Programs\n6/1/2023 through 6/30/2023 129,774 $ 163.44 129,774 1,406,752\n7/1/2023 through 7/31/2023 75,027 $ 167.12 75,027 1,331,725\n8/1/2023 through 8/31/2023 101,935 $ 164.33 101,935 1,229,790\nTotal 306,736 $ 164.64 306,736 1,229,790\nCompany Stock Performance\nThe following information in this Annual Report on Form 10-K is not deemed to be soliciting material or to be filed with the Securities and Exchange Commission or subject to Regulation 14A or 14C under the Exchange Act or to the liabilities of Section 18 of the Exchange Act, and it will not be deemed to be incorporated by reference into any filing under the Securities Act or the Exchange Act, except to the extent specifically incorporated by reference into such filing.\nThe following graph compares the cumulative total return to shareholders on our outstanding stock during the five years ended August 31, 2023, with the cumulative total returns of the Standard & Poors (S&P) Midcap 400 Index, the Dow Jones U.S. Electrical Components & Equipment Index, and the Dow Jones U.S. Building Materials & Fixtures Index. We are a component of both the S&P Midcap 400 Index and the Dow Jones U.S. Building Materials & Fixtures Index. The Dow Jones U.S. Electrical Components & Equipment Index is included in the following graph as the parent companies of several major lighting companies are included in the index.\nCOMPARISON OF FIVE-YEAR CUMULATIVE TOTAL RETURN*\nAmong Acuity Brands, Inc., the S&P Midcap 400 Index,\nthe Dow Jones U.S. Electrical Components & Equipment Index,\nand the Dow Jones U.S. Building Materials & Fixtures Index\n*Assumes $100 invested on August 31, 2018 in stock or index, including reinvestment of dividends.\nAug-18 Aug-19 Aug-20 Aug-21 Aug-22 Aug-23\nAcuity Brands, Inc. $ 100 $ 82 $ 72 $ 122 $ 109 $ 108\nS&P Midcap 400 Index 100 94 98 141 127 140\nDow Jones U.S. Electrical Components & Equipment Index 100 90 104 150 133 161\nDow Jones U.S. Building Materials & Fixtures Index 100 111 130 206 162 205 Item 6.[Reserved] Item 7.Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe purpose of this discussion and analysis is to enhance the understanding and evaluation of the results of operations, financial position, cash flows, indebtedness, and other key financial information of Acuity Brands, Inc. (referred to herein as we, our, us, the Company, or similar references) and its subsidiaries for the fiscal years ended August 31, 2023 and 2022. The following discussion should be read in conjunction with the Consolidated Financial Statements and Notes to Consolidated Financial Statements included within this report.\nA discussion of the year ended August 31, 2022 compared to the year ended August 31, 2021 can be found within Part II, Item 7. Management's Discussion and Analysis within our fiscal 2022 Annual Report on Form 10-K filed with the Securities and Exchange Commission on October 26, 2022.\nOverview\nCompany\nWe are a market-leading industrial technology company. We use technology to solve problems in spaces and light. Through our two business segments, Acuity Brands Lighting and Lighting Controls (ABL) and the Intelligent Spaces Group (ISG), we design, manufacture, and bring to market products and services that make a valuable difference in people's lives. We achieve growth through the development of innovative new products and services, including lighting, lighting controls, building management solutions, and location-aware applications.\nFinancial Condition, Capital Resources, and Liquidity\nWe have numerous sources of capital, including cash on hand and cash flows generated from operations, as well as various sources of financing. Our ability to generate sufficient cash flows from operations or to access certain capital markets, including banks, is necessary to meet our capital allocation priorities, which are to invest in our current business for growth, to invest in mergers and acquisitions, to maintain our dividend, and to make share repurchases. Sufficient cash flow generation is also critical to fund our operations in the short and long terms and to maintain compliance with covenants contained in our financing agreements.\nOur significant contractual cash requirements as of August 31, 2023 primarily include principal and interest on our unsecured notes, accounts payable, accrued employee compensation, and operating lease liabilities. We had no borrowings outstanding under our credit agreement as of August 31, 2023. Further details on our borrowings and operating lease liabilities are outlined in the Debt and Lines of Credit and Leases footnotes of the Notes to Consolidated Financial Statements, respectively, within this Annual Report on Form 10-K.\nAdditionally, we incur purchase obligations in the ordinary course of business that are enforceable and legally binding. Contractual purchase obligations subsequent to August 31, 2023 include $302.6 million in fiscal 2024. Contractual purchase obligations beyond fiscal 2024 are not significant.\nWe believe that we will be able to meet our liquidity needs over the next 12 months based on our cash on hand, current projections of cash flows from operations, and borrowing availability under financing arrangements. Additionally, we believe that our cash flows from operations and sources of funding, including, but not limited to, future borrowings and borrowing capacity, will sufficiently support our long-term liquidity needs. In the event of a sustained market deterioration, we may need additional capital, which would require us to evaluate available alternatives and take appropriate actions.\nCash\nOur cash position at August 31, 2023 was $397.9 million, an increase of $174.7 million from August 31, 2022. Cash generated from operating activities and cash on hand were used during the current year to fund our capital allocation priorities as discussed below.\nWe generated $578.1 million of cash flows from operating activities during fiscal 2023 compared with $316.3 million in the prior-year period, an increase of $261.8 million. This increase was due primarily to increased cash collections from customers and fewer inventory purchases during the current period, partially offset by the timing of payments for purchases on account.\nFinancing Arrangements\nSee the Debt and Lines of Credit footnote of the Notes to Consolidated Financial Statements within this Annual Report on Form 10-K for discussion of the terms of our various financing arrangements, including the $500.0 million aggregate principal amount of 2.150% senior unsecured notes due December 15, 2030 (the Unsecured Notes) as well as the terms of our $600.0 million five-year unsecured revolving credit facility (the Revolving Credit Facility).\nAt August 31, 2023, our outstanding debt balance was $495.6 million, which consisted solely of our Unsecured Notes, compared to our cash position of $397.9 million. We were in compliance with all covenants under our financing arrangements as of August 31, 2023.\nAt August 31, 2023, we had additional borrowing capacity under the Revolving Credit Facility of $596.2 million under the most restrictive covenant in effect at the time, which represents the full amount of the facility less the outstanding letters of credit of $3.8 million issued under the facility. As of August 31, 2023, our cash on hand combined with the additional borrowing capacity under the revolving credit facility totaled approximately $994.1 million.\nThe Unsecured Notes were issued by Acuity Brands Lighting, Inc., a wholly-owned subsidiary of Acuity Brands, Inc. The Unsecured Notes are fully and unconditionally guaranteed on a senior unsecured basis by Acuity Brands, Inc. and ABL IP Holding LLC, a wholly-owned subsidiary of Acuity Brands, Inc. The following tables present summarized financial information for Acuity Brands, Inc., Acuity Brands Lighting, Inc., and ABL IP Holding LLC on a combined basis after the elimination of all intercompany balances and transactions between the combined group as well as any investments in non-guarantors as of the dates and during the period presented (in millions):\nSummarized Balance Sheet Information August 31, 2023 August 31, 2022\nCurrent assets $ 995.7 $ 1,056.6\nCurrent assets due from non-guarantor affiliates 326.4 280.2\nNon-current assets 1,377.9 1,414.3\nCurrent liabilities 464.2 620.4\nNon-current liabilities 785.4 821.0\nSummarized Income Statement Information Year Ended August 31, 2023\nNet sales $ 3,310.4\nGross profit 1,417.2\nNet income 329.7\nCapital Allocation Priorities\nOur capital allocation priorities are to invest in our current business for growth, to invest in mergers and acquisitions, to maintain our dividend, and to make share repurchases.\nInvestments in Current Business for Growth\nWe invested $66.7 million and $56.5 million in property, plant, and equipment in fiscal 2023 and 2022, respectively. We invested more in fiscal 2023 primarily on new and enhanced equipment, facility improvements, and information technology.\nStrategic Acquisitions, Investments, and Divestitures\nWe seek opportunities to strategically expand and enhance our portfolio of solutions. On May 15, 2023, using cash on hand, we acquired all of the equity interests of KE2 Therm Solutions, Inc. (KE2 Therm). KE2 Therm develops and provides intelligent refrigeration control solutions that deliver the precision of digital controls to promote safety, efficiency, and reliability, while delivering cost savings to the customer. This acquisition is intended to expand ISG's technology and controls product portfolio and reach new customers.\nWe sold our Sunoptics prismatic skylights business in November 2022. We recognized a pre-tax loss of $11.2 million on the sale of this business.\nThere were no acquisitions or divestitures during fiscal 2022. The $12.9 million of cash outflows in fiscal 2022 reflected in the Consolidated Statements of Cash Flows primarily relate to working capital settlements for fiscal 2021 acquisitions.\nPlease refer to the Acquisitions and Divestitures footnote of the Notes to Consolidated Financial Statements for more information.\nDividends\nWe paid dividends on our common stock of $16.8 million ($0.52 per share) in fiscal 2023 and $18.1 million ($0.52 per share) in fiscal 2022, indicating a quarterly dividend rate of $0.13 per share. All decisions regarding the declaration and payment of dividends are at the discretion of the Board of Directors (the Board) and are evaluated regularly in light of our financial condition, earnings, growth prospects, funding requirements, applicable law, and any other factors the Board deems relevant.\nShare Repurchases\nDuring fiscal 2023, we repurchased 1.6 million shares of our outstanding common stock for $269.3 million. Total cash outflows for share repurchases during fiscal 2023 were $266.6 million. We expect to repurchase shares on an opportunistic basis subject to various factors including stock price, Company performance, market conditions, and other possible uses of cash. As of August 31, 2023, the maximum number of shares that may yet be repurchased under the share repurchase program authorized by the Board equaled 1.2 million shares.\nResults of Operations\nThe following is a discussion of our results of operations in fiscal 2023 compared to fiscal 2022. A discussion of our fiscal 2022 results of operations compared to fiscal 2021 can be found within Part II, Item 7. Management's Discussion and Analysis within our fiscal 2022 Annual Report on Form 10-K filed with the Securities and Exchange Commission on October 26, 2022.\nThe following table sets forth information comparing the components of net income for the year ended August 31, 2023 with the year ended August 31, 2022 (in millions except per share data):\nYear Ended August 31, Increase Percent\n2023 2022 (Decrease) Change\nNet sales $ 3,952.2 $ 4,006.1 $ (53.9) (1.3) %\nCost of products sold 2,239.0 2,333.4 (94.4) (4.0) %\nGross profit 1,713.2 1,672.7 40.5 2.4 %\nPercent of net sales 43.3 % 41.8 % 150 bps\nSelling, distribution, and administrative expenses 1,212.9 1,163.0 49.9 4.3 %\nSpecial charges 26.9 - 26.9 NM\nOperating profit 473.4 509.7 (36.3) (7.1) %\nPercent of net sales 12.0 % 12.7 % (70) bps\nOther expense:\nInterest expense, net 18.9 24.9 (6.0) (24.1) %\nMiscellaneous expense (income), net 7.8 (9.1) 16.9 NM\nTotal other expense 26.7 15.8 10.9 NM\nIncome before income taxes 446.7 493.9 (47.2) (9.6) %\nPercent of net sales 11.3 % 12.3 % (100) bps\nIncome tax expense 100.7 109.9 (9.2) (8.4) %\nEffective tax rate 22.5 % 22.3 %\nNet income $ 346.0 $ 384.0 $ (38.0) (9.9) %\nDiluted earnings per share $ 10.76 $ 11.08 $ (0.32) (2.9) %\nNM - not meaningful\nNet Sales\nNet sales of $3.95 billion for the year ended August 31, 2023 decreased by $53.9 million, or 1.3%, compared with the prior-year period due to declines in sales within our ABL segment, partially offset by higher sales within our ISG segment. The divestiture from our Sunoptics prismatic skylight business, the acquisition of KE2 Therm, and changes in foreign currency rates did not have a meaningful impact on net sales for the year ended August 31, 2023.\nGross Profit\nGross profit for the year ended August 31, 2023 increased $40.5 million, or 2.4%, to $1.71 billion compared with $1.67 billion for the prior year, and gross profit margin increased 150 basis points to 43.3% for fiscal 2023 compared with 41.8% in the prior-year period. Our gross profit increased compared with the prior year on lower sales as we strategically managed price. This increase was partially offset by higher labor costs as well as the recognition of a $13.0 million charge resulting from the collectability of a supplier warranty obligation owed to us for components we used in products manufactured and sold between 2017 and 2019.\nOperating Profit\nSelling, distribution, and administrative expenses of $1.21 billion for the year ended August 31, 2023 increased $49.9 million, or 4.3%, compared with the prior year. This increase was due primarily to higher employee-related costs and higher commissions.\nWe also recognized special charges of $26.9 million during fiscal year 2023. Please refer to the Special Charges footnote of the Notes to Consolidated Financial Statements within this Annual Report on Form 10-K for further details.\nOperating profit for fiscal 2023 was $473.4 million compared with $509.7 million reported for the prior-year period, a decrease of $36.3 million, or 7.1%. The decrease in operating profit for fiscal 2023 compared with fiscal 2022 was due to the recognition of special charges in fiscal 2023 as well as increased operating expenses, partially offset by an increase in gross profit.\nInterest Expense, net\nInterest expense, net, was $18.9 million and $24.9 million for the years ended August 31, 2023 and 2022, respectively. The decrease in net interest expense was due to increased investing rates on our interest-bearing cash cash equivalents. compared to the prior year, partially offset by changes in average short-term borrowings outstanding.\nMiscellaneous Expense (Income), net\nMiscellaneous expense (income), net consists of non-service related components of net periodic pension cost, gains and losses associated with foreign currency-related transactions, and non-operating gains and losses.\nWe reported net miscellaneous expense of $7.8 million in fiscal 2023 compared with net miscellaneous income of $9.1 million in fiscal 2022. This year-over-year change was due primarily to the recognition of an $11.2 million loss on the sale of our Sunoptics prismatic skylights business in fiscal 2023 and an impairment charge of $2.5 million for one unconsolidated equity investment, as well as higher pension cost. These amounts were partially offset by higher gains on foreign currency-related items compared to the prior year.\nThe details of the Sunoptics sale are described in the Acquisitions and Divestitures footnote of the Notes to Consolidated Financial Statements. The details of the equity investment impairment charge are included in the Fair Value Measurements footnote of the Notes to Consolidated Financial Statements.\nIncome Taxes and Net Income\nOur effective income tax rate was 22.5% and 22.3% for the years ended August 31, 2023 and 2022, respectively. Further details regarding income taxes are included in the Income Taxes footnote of the Notes to Consolidated Financial Statements.\nNet income for fiscal 2023 decreased $38.0 million, or 9.9%, to $346.0 million from $384.0 million reported for the prior year. The decrease in net income resulted primarily from a decrease in operating profit compared to the prior-year period.\nDiluted earnings per share for fiscal 2023 was $10.76 compared with $11.08 for the prior-year period, a decrease of $0.32, or 2.9%. This decrease reflects lower net income, partially offset by lower outstanding diluted shares.\nSegment Results\nThe following tables set forth information comparing the operating results of our segments, ABL and ISG, for the year ended August 31, 2023 with the year ended August 31, 2022 (in millions):\nYear Ended August 31,\n2023 2022 Increase (Decrease) Percent Change\nABL:\nNet sales $ 3,722.8 $ 3,810.1 $ (87.3) (2.3) %\nOperating profit 509.5 545.6 (36.1) (6.6) %\nOperating profit margin 13.7 % 14.3 % (60) bps\nISG:\nNet sales $ 252.7 $ 216.1 $ 36.6 16.9 %\nOperating profit 32.1 22.7 $ 9.4 41.4 %\nOperating profit margin 12.7 % 10.5 % 220 bps\nABL net sales for the year ended August 31, 2023 decreased 2.3% compared with the prior-year period due primarily to lower net sales within original equipment manufacturer (\"OEM\") and other, independent sales network, and corporate accounts channels, partially offset by higher net sales in direct sales network and retail sales channels.\nOperating profit for ABL was $509.5 million (13.7% of ABL net sales) for the year ended August 31, 2023 compared to $545.6 million (14.3% of ABL net sales) in the prior-year period, a decrease of $36.1 million. The decrease in operating profit was due primarily to special charges of $25.0 million, the recognition of a $13.0 million charge related to the collectability of a supplier receivable, and lower net sales. These declines were partially offset by our strategic management of price.\nISG net sales for the year ended August 31, 2023 increased 16.9% compared with the prior-year period driven primarily by strong demand for building and heating, ventilation, and air conditioning controls as well as price increases. ISG operating profit was $32.1 million (12.7% of ISG net sales) for the year ended August 31, 2023 compared with $22.7 million (10.5% of ISG net sales) in the prior-year period, an increase of $9.4 million. This increase was due primarily to contributions from higher sales, partially offset by increased employee costs.\nAccounting Standards Adopted in Fiscal 2023 and Accounting Standards Yet to Be Adopted\nSee the New Accounting Pronouncements footnote of the Notes to Consolidated Financial Statements for information on recently adopted and upcoming standards.\nCritical Accounting Estimates\nManagements Discussion and Analysis of Financial Condition and Results of Operations addresses the financial condition and results of operations as reflected in our Consolidated Financial Statements, which have been prepared in accordance with U.S. generally accepted accounting principles (U.S. GAAP). As discussed in the Description of Business and Basis of Presentation footnote of the Notes to Consolidated Financial Statements, the preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements as well as reported amounts of revenue and expense during the reporting period. On an ongoing basis, we evaluate our estimates and judgments. We base our estimates and judgments on our substantial historical experience and/or other relevant factors, such as projections of future performance, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results could differ from those estimates. We discuss the development of accounting estimates with our Audit Committee of the Board of Directors on a recurring basis. See the Significant Accounting Policies footnote of the Notes to Consolidated Financial Statements for a summary of our accounting policies.\nWe believe the following accounting topics represent our critical accounting estimates.\nRevenue Recognition\nWe recognize revenue when we transfer control of goods and services to our customers. Revenue is measured as the amount of consideration we expect to receive in exchange for goods and services. In the period of revenue recognition, we estimate and record provisions for certain rebates, sales incentives, product returns, and discounts to customers, in most instances, as reductions of revenue. We also maintain one-time or on-going marketing and trade-promotion programs with certain customers that require us to estimate and accrue the expected costs of such programs. Generally, these items are estimated based on customer agreements, historical trends, and expected demand. For sales with multiple deliverables, significant judgment may be required to determine which performance obligations are distinct and should be accounted for separately. We allocate the expected consideration to be collected to each distinct performance obligation based on its standalone selling price. Standalone selling price is generally estimated using a cost plus margin valuation when no observable input is available.\nActual results could differ from estimates, which would require adjustments to recorded amounts. Please refer to the Revenue Recognition footnote of the Notes to Consolidated Financial Statements for additional information regarding estimates related to revenue recognition.\nInventories\nInventories include materials, direct labor, inbound freight, customs, duties, tariffs, and related manufacturing overhead. Inventories are stated on a first-in, first-out basis at the lower of cost and net realizable value. We review inventory quantities on hand and record a provision for excess or obsolete inventory primarily based on estimated future demand and current market conditions. A significant change in customer demand, market conditions, or technology could render certain inventory obsolete and thus could have a material adverse impact on our operating results in the period the change occurs.\nGoodwill and Indefinite-Lived Intangible Assets\nIndefinite-lived intangible assets consist of trade names acquired through multiple acquisitions that are expected to generate cash flows indefinitely. Significant estimates and assumptions were used to both identify and determine the initial fair value of these acquired intangible assets, often with the assistance of third-party valuation specialists. These assumptions include, but are not limited to, estimated future net sales and profitability, customer attrition rates, royalty rates, and discount rates. Goodwill is calculated as the residual value of an acquisition's purchase price less the value of the identifiable net assets and is thus dependent on the appropriate identification and valuation of the net assets obtained in an acquisition.\nWe review goodwill and indefinite-lived intangible assets for impairment on an annual basis in the fiscal fourth quarter and on an interim basis if an event occurs or circumstances change that would more likely than not indicate that the fair value of the goodwill or an indefinite-lived asset is below its carrying value. An impairment loss for goodwill or an indefinite-lived intangible asset would be recognized based on the difference between the carrying value of the asset and its estimated fair value, which would be determined based on either discounted future cash flows or another appropriate fair value method. The evaluation of goodwill and indefinite-lived intangibles for impairment requires management to use significant judgments and estimates in accordance with U.S. GAAP including, but not limited to, economic, industry, and Company-specific qualitative factors, projected future net sales, operating results, and cash flows.\nWe currently believe that the estimates used in the evaluation of goodwill and indefinite-lived intangibles are reasonable, including our calculations of fiscal 2023 trade name impairment charges described below. However, future differences between actual and expected net sales, operating results, and cash flows and/or changes in the discount rates or theoretical royalty rates used could require us to record additional non-cash impairment charges to earnings for the write-down in the value of such assets. Such charges could have a material adverse effect on our results of operations and financial position but not our cash flows from operations.\nGoodwill\nWe performed our annual goodwill impairment analyses on the first day of our fiscal fourth quarter (June 1) for each period presented. Goodwill was tested for impairment at the reporting unit level using a combination of discounted future cash flows and relevant market multiples. Our discounted cash flow analyses required significant assumptions about discount rates, short and long-term growth rates, and future profitability. For the tests performed as of June 1, 2023, we utilized estimated discount rates ranging from 11% to 13%. These rates were based on the\nCapital Asset Pricing Model, which considers a risk-free interest rate, beta, market risk premium, and size premium to determine an appropriate discount rate for a reporting unit. Short-term growth rates were based on managements forecasted financial results, which consider key business drivers such as specific revenue growth initiatives, market share changes, growth in our addressable market, and general economic factors such as macroeconomic conditions, credit availability, and interest rates. We calculated the discounted cash flows attributable to our reporting units for a 10-year discrete period with a terminal value and compared this calculation to the discounted cash flows generated over a 40-year period to corroborate the reasonableness of assumptions used. The long-term growth rate used in determining terminal value was estimated at 2.5% and was primarily based on our understanding of projections for expected long-term growth in our addressable market and historical long-term performance.\nWe corroborate the values determined from our discounted cash flow models using a relevant market multiple, generally published earnings and/or revenue multiples. We also reconcile the sum of the fair values for each reporting unit to our market capitalization at the testing date, including consideration of a control premium.\nAny reasonably likely change in the assumptions used in these analyses, including revenue growth rates, discount rates, long-term growth rates, or relevant multiples would not cause the carrying value of any reporting unit to exceed its estimated fair value as determined under the goodwill impairment analysis. See the Significant Accounting Policies footnote of the Notes to Consolidated Financial Statements for further details.\nIndefinite-Lived Intangible Assets\nWe performed our annual indefinite-lived intangible asset impairment analyses on the first day of our fiscal fourth quarter (June 1) for each period presented. As of June 1, 2023, the current fiscal year testing date, we held 13 indefinite-lived intangible assets with an aggregate carrying value of $173.4 million. We utilized significant assumptions to estimate the fair value of these indefinite-lived trade names using a fair value model based on discounted future cash flows (fair value model) in accordance with Accounting Standards Codification (ASC) Topic 820, Fair Value Measurement (ASC 820). Future cash flows associated with each of our indefinite-lived trade names are calculated by multiplying a theoretical royalty rate a willing third party would pay for use of the particular trade name by estimated future net sales attributable to the relevant trade name. The present value of the resulting after-tax cash flows is our current estimate of the fair value of each trade name. This fair value model requires us to make several significant assumptions, including specific estimated future net sales (including short and long-term growth rates), a royalty rate, and a discount rate for each trade name.\nOur fiscal 2023 analyses resulted in impairment charges and the determination that certain assets no longer had indefinite lives. As of August 31, 2023, we held eight indefinite-lived intangible assets with an aggregate carrying value of $135.6 million. See the Significant Accounting Policies and Fair Value Measurement footnotes of the Notes to Consolidated Financial Statements for further details regarding the assumptions used and results of our annual impairment tests for the periods presented.\nShare-based Payment Expense\nWe recognize compensation cost for share-based payment transactions in the financial statements under the provisions of ASC Topic 718, Compensation-Stock Compensation (ASC 718). Restricted stock awards, performance stock awards, stock options, and director stock units representing certain deferrals into the Nonemployee Director Deferred Compensation Plan (the Director Plan) are valued based on their estimated grant date fair values. Depending on the nature of the grant, an award's fair value is based on the fair value of our common stock on the grant date, a Black-Scholes model, or a Monte Carlo simulation.\nWe generally recognize compensation cost for share-based payment transactions on a straight-line basis over an award's requisite service period, derived service period, or expected performance period. In certain circumstances, such as when a performance award is subject to graded vesting, we apply the accelerated attribution method to recognize compensation cost related to our share-based payment awards. When the actual number of awards earned is based on future performance, we recognize expense when it becomes probable that the performance metric will be satisfied.\nAdditionally, we estimate forfeitures of all share-based awards at the time of grant. We adjust forfeiture estimates for awards through their vesting dates to recognize compensation cost only for awards that actually vest. Forfeitures are estimated based on historical experience. If factors change causing different assumptions to be made in future periods, estimated compensation expense may differ significantly from that recorded in the current period.\nSee the Share-based Payments footnote of the Notes to Consolidated Financial Statements for further information on these awards, including assumptions used in estimating the fair value of our awards.\nProduct Warranty and Recall Costs\nOur products generally have a standard warranty term of five years. We accrue for the estimated amount of future warranty costs when the related revenue is recognized. Estimated future warranty costs are primarily based on historical experience of identified warranty claims. Estimated costs related to product warranty and recall costs outside of our historical experience, which could include significant product recalls or formal campaigns soliciting repair or return of a product, are accrued when they are deemed to be probable and can be reasonably estimated. Any estimated or actual loss recoveries that offset our costs and payments are reflected as assets based on the timing of receipt of recovery net of any amounts deemed uncollectible.\nWe are fully self-insured for product warranty costs. Although we expect that historical activity will continue to be the best indicator of future warranty costs, there can be no assurance that future warranty costs will not exceed historical amounts. If actual future warranty or recall costs exceed recorded amounts, additional accruals may be required, which could have a material adverse impact on our results of operations and cash flow.\nWe also sell certain service-type warranties that extend coverages for products beyond their base warranties. We account for service-type warranties as distinct performance obligations, allocate an appropriate amount of transaction price to these transactions, and recognize revenue for these contracts ratably over the life of the additional warranty period. We allocate transaction price to our service-type warranties largely based on expectations of cost plus margin based on our estimate of future claims. These estimates are subject to a higher level of estimation uncertainty than other estimates, as we have less experience in costs in the extended warranty period. Claims related to service-type warranties are expensed as incurred.\nCautionary Statement Regarding Forward-Looking Statements and Information\nThis filing contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 (the Act). Forward-looking statements include, among other things, statements that describe or relate to the Companys plans, initiatives, projections, vision, goals, targets, commitments, expectations, objectives, prospects, strategies, or financial outlook, and the assumptions underlying or relating thereto. In some cases, we may use words such as expect, believe, intend, anticipate, estimate, forecast, indicate, project, predict, plan, may, will, could, should, would, potential, and words of similar meaning, as well as other words or expressions referencing future events, conditions, or circumstances, to identify forward-looking statements. We intend these forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Act. Forward-looking statements are not guarantees of future performance. Our forward-looking statements are based on our current beliefs, expectations, and assumptions, which may not prove to be accurate, and are subject to known and unknown risks and uncertainties, many of which are outside of our control. These risks and uncertainties could cause actual events or results to differ materially from our historical experience and managements present expectations or projections. These risks and uncertainties are discussed in our filings with the U.S. Securities and Exchange Commission, including this annual report on Form 10-K (including, but not limited to, Part I, Item 1a. Risk Factors), quarterly reports on Form 10-Q, and current reports on Form 8-K. Any forward-looking statement speaks only as of the date on which it is made. You are cautioned not to place undue reliance on any forward-looking statements. Except as required by law, we undertake no obligation to publicly update or release any revisions to these forward-looking statements to reflect any events or circumstances after the date of this quarterly report or to reflect the occurrence of unanticipated events, whether as a result of new information, future events, or otherwise. Item 7a.Quantitative and Qualitative Disclosures about Market Risk.\nGeneral\nWe are exposed to worldwide market risks that may impact our Consolidated Balance Sheets, Consolidated Statements of Comprehensive Income, Consolidated Statements of Cash Flows, and Consolidated Statements of Stockholders' Equity due primarily to changing interest and foreign exchange rates. We do not currently engage in significant commodity hedging transactions for raw materials. The following discussion provides additional information regarding our market risks.\nInterest Rates\nInterest rate fluctuations expose variable-rate debt of the organization to changes in interest expense and cash flows. As of August 31, 2023, our long-term debt consisted primarily of fixed-rate senior unsecured notes. A fluctuation in interest rates would not affect interest expense or cash flows related to the Companys fixed-rate debt.\nHowever, a 10% increase in market interest rates at August 31, 2023 would have decreased the estimated fair value of our senior unsecured notes by approximately $14.2 million. As of August 31, 2023, we had no borrowings outstanding on our credit facility. Interest incurred on these borrowings is not significant to our overall results of operations or cash flows. See the Debt and Lines of Credit footnote of the Notes to Consolidated Financial Statements contained in this Form 10-K for additional information.\nForeign Exchange Rates\nThe majority of our net sales, expense, and capital purchases are transacted in U.S. dollars. However, exposure with respect to foreign exchange rate fluctuation exists due to our operations in Mexico and Canada, where a significant portion of products sold are produced or sourced from the United States, and, to a lesser extent, in Europe. Based on fiscal 2023 performance, a hypothetical depreciation of 10% in the value of the Canadian dollar in relation to the U.S. dollar would negatively impact operating profit by approximately $11.9 million, while a hypothetical 10% appreciation in the value of the Canadian dollar in relation to the U.S. dollar would favorably impact operating profit by approximately $14.5 million. In addition to products and services sold in Mexico, a significant portion of the goods sold in the United States are manufactured in Mexico. A hypothetical 10% decrease in the value of the Mexican peso in relation to the U.S. dollar would favorably impact operating profit by approximately $19.4 million, while a hypothetical 10% increase in the value of the Mexican peso in relation to the U.S. dollar would negatively impact operating profit by approximately $23.7 million. The individual impacts to the operating profit of hypothetical currency fluctuations in the Canadian dollar and Mexican peso have been calculated in isolation from any potential responses to address such exchange rate changes in our foreign markets.\nOur exposure to foreign currency risk related to our operations in Europe is immaterial and has been excluded from this analysis. Item 8. Financial Statements and Supplementary Data.\nIndex to Consolidated Financial Statements\nPage\nManagements Report on Internal Control over Financial Reporting\nReports of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of August 31, 2023 and 2022\nConsolidated Statements of Comprehensive Income for the years ended August 31, 2023, 2022, and 2021\nConsolidated Statements of Cash Flows for the years ended August 31, 2023, 2022, and 2021\nConsolidated Statements of Stockholders Equity for the years ended August 31, 2023, 2022, and 2021\nNotes to Consolidated Financial Statements\nNote 1 - Description of Business and Basis of Presentation\nNote 2 - Significant Accounting Policies\nNote 3 - New Accounting Pronouncements\nNote 4 - Acquisitions and Divestitures\nNote 5 - Fair Value Measurements\nNote 6 - Leases\nNote 7 - Debt and Lines of Credit\nNote 8 - Commitments and Contingencies\nNote 9 - Segment Information\nNote 10 - Revenue Recognition\nNote 11 - Share-based Payments\nNote 12 - Pension and Defined Contribution Plans\nNote 13 - Special Charges\nNote 14 - Common Stock and Related Matters\nNote 15- Income Taxes\nNote 16 - Supplemental Disaggregated Information\nMANAGEMENTS REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nACUITY BRANDS, INC.\nThe management of Acuity Brands, Inc. is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) and 15d-15(f) promulgated under the Securities Exchange Act of 1934. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThe Companys management assessed the effectiveness of the Companys internal control over financial reporting as of August 31, 2023. In making this assessment, the Companys management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013 Framework). Based on this assessment, management believes that, as of August 31, 2023, the Companys internal control over financial reporting is effective.\nManagements assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of the acquired business of KE2 Therm Solutions, Inc., (KE2 Therm), which is included in the Companys consolidated financial statements as of August 31, 2023 and for the period from the acquisition date of May 15, 2023 through August 31, 2023. As of August 31, 2023, KE2 Therm constituted less than 2% of both the Companys consolidated assets and stockholders' equity. For the year ended August 31, 2023, KE2 Therm constituted less than 1% of both the Company's net sales and pre-tax income.\nErnst & Young LLP (PCAOB ID: 42), the Companys independent registered public accounting firm, has issued an audit report on its audit of the Companys internal control over financial reporting. This report dated October 26, 2023 is included within this Form 10-K.\n/s/ NEIL M. ASHE /s/ KAREN J. HOLCOM\nNeil M. AsheChairman, President and\nChief Executive Officer\nKaren J. Holcom\nSenior Vice President and\nChief Financial Officer\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Acuity Brands, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Acuity Brands, Inc. (the Company) as of August 31, 2023 and 2022, the related consolidated statements of comprehensive income, cash flows and stockholders equity for each of the three years in the period ended August 31, 2023, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at August 31, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended August 31, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of August 31, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated October 26, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosures to which it relates.\nValuation of Indefinite-Lived Trade Names\nDescription of the Matter As explained in Notes 2 and 5 to the consolidated financial statements, the Company tests indefinite-lived trade names for impairment on an annual basis or more frequently if an event occurs or circumstances change that would more likely than not indicate that the fair value of the indefinite-lived trade name is below its carrying amount. The Companys indefinite-lived intangible assets consisted of thirteen trade names with an aggregate carrying value of approximately $173.4 million as of June 1, 2023, the Companys annual indefinite-lived trade name testing date. If the carrying amount exceeds the estimated fair value, an impairment loss would be recorded in the amount equal to the excess. As described in Notes 2 and 5, the Company recognized an impairment charge of approximately $14.0 million for six of these trade names.\nAuditing the Companys impairment tests for indefinite-lived trade names was especially complex due to the judgmental nature of the significant assumptions used in the determination of estimated fair values for trade names. The Company estimates the fair values of trade names using a fair value model based on discounted future cash flows. Significant assumptions used to estimate the value of the trade names included estimated future net sales (including short- and long-term growth rates), discount rates and royalty rates, all of which are forward-looking and could be materially affected by economic, industry and company-specific qualitative factors.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Companys annual impairment process. This included testing controls over managements review of the discounted cash flow model, including the significant assumptions described above.\nTo test the fair values of the Companys indefinite-lived trade names, our audit procedures included, among others, evaluating the Companys use of the discounted cash flow model, the completeness and accuracy of the underlying data and the significant assumptions described above. We compared the significant assumptions to current industry, market and economic trends, and the Companys historical results. For the six trade names that were impaired, we involved our valuation specialists to assist in evaluating the Companys discounted cash flow model and certain assumptions including the discount rates and royalty rates. In addition, we considered the accuracy of the Companys historical projections of net sales compared to actual net sales. We also performed a sensitivity analysis to evaluate the potential change in the fair values of the trade names resulting from changes in the significant assumptions.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2002.\nAtlanta, Georgia\nOctober 26, 2023\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Acuity Brands, Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Acuity Brands, Inc.s internal control over financial reporting as of August 31, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Acuity Brands, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of August 31, 2023, based on the COSO criteria.\nAs indicated in the accompanying Managements Report on Internal Control over Financial Reporting, managements assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of the acquired business of KE2 Therm Solutions, Inc. (KE2 Therm), which is included in the 2023 consolidated financial statements of the Company and constituted less than 2% of both the Companys consolidated assets and stockholders equity, as of August 31, 2023 and less than 1% of both net sales and pre-tax income, for the year then ended. Our audit of internal control over financial reporting of the Company also did not include an evaluation of the internal control over financial reporting of KE2 Therm.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of August 31, 2023 and 2022, the related consolidated statements of comprehensive income, cash flows and stockholders equity for each of the three years in the period ended August 31, 2023, and the related notes and our report dated October 26, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nAtlanta, Georgia\nOctober 26, 2023\nACUITY BRANDS, INC.\nCONSOLIDATED BALANCE SHEETS\n(In millions, except share data)\nAugust 31,\n2023 2022\nASSETS\nCurrent assets:\nCash and cash equivalents $ 397.9 $ 223.2\nAccounts receivable, less reserve for doubtful accounts of $1.3 and $1.2, respectively\n555.3 665.9\nInventories 368.5 485.7\nPrepayments and other current assets 73.5 91.2\nTotal current assets 1,395.2 1,466.0\nProperty, plant, and equipment, net 297.6 276.5\nOperating lease right-of-use assets 84.1 74.9\nGoodwill 1,097.9 1,084.3\nIntangible assets, net 481.2 529.2\nDeferred income taxes 3.0 1.3\nOther long-term assets 49.5 48.0\nTotal assets $ 3,408.5 $ 3,480.2\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable $ 285.7 $ 397.8\nCurrent maturities of debt - 18.0\nCurrent operating lease liabilities 19.7 15.7\nAccrued compensation 103.3 88.0\nOther accrued liabilities 186.7 214.1\nTotal current liabilities 595.4 733.6\nLong-term debt 495.6 495.0\nLong-term operating lease liabilities 75.5 67.4\nAccrued pension liabilities 38.4 41.4\nDeferred income taxes 59.0 102.1\nOther long-term liabilities 129.2 128.9\nTotal liabilities 1,393.1 1,568.4\nCommitments and contingencies (see Commitments and Contingencies footnote)\nStockholders equity:\nPreferred stock, $0.01 par value; 50,000,000 shares authorized; none issued\n- -\nCommon stock, $0.01 par value; 500,000,000 shares authorized; 54,411,186 and 54,241,069 issued, respectively\n0.5 0.5\nPaid-in capital 1,066.8 1,036.3\nRetained earnings 3,505.4 3,176.2\nAccumulated other comprehensive loss (112.6) (125.8)\nTreasury stock, at cost - 23,362,196 and 21,753,820 shares, respectively\n(2,444.7) (2,175.4)\nTotal stockholders equity 2,015.4 1,911.8\nTotal liabilities and stockholders equity $ 3,408.5 $ 3,480.2\nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nACUITY BRANDS, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In millions, except per-share data)\nYear Ended August 31,\n2023 2022 2021\nNet sales $ 3,952.2 $ 4,006.1 $ 3,461.0\nCost of products sold 2,239.0 2,333.4 1,986.0\nGross profit 1,713.2 1,672.7 1,475.0\nSelling, distribution, and administrative expenses 1,212.9 1,163.0 1,044.1\nSpecial charges 26.9 - 3.3\nOperating profit 473.4 509.7 427.6\nOther expense:\nInterest expense, net 18.9 24.9 23.2\nMiscellaneous expense (income), net 7.8 (9.1) 8.2\nTotal other expense 26.7 15.8 31.4\nIncome before income taxes 446.7 493.9 396.2\nIncome tax expense 100.7 109.9 89.9\nNet income $ 346.0 $ 384.0 $ 306.3\nEarnings per share(1):\nBasic earnings per share $ 10.88 $ 11.23 $ 8.44\nBasic weighted average number of shares outstanding 31.806 34.182 36.284\nDiluted earnings per share $ 10.76 $ 11.08 $ 8.38\nDiluted weighted average number of shares outstanding 32.164 34.645 36.554\nDividends declared per share $ 0.52 $ 0.52 $ 0.52\nComprehensive income:\nNet income $ 346.0 $ 384.0 $ 306.3\nOther comprehensive income (loss) items, net of tax:\nForeign currency translation adjustments 8.5 (33.3) 13.3\nDefined benefit plans 4.7 5.7 21.2\nOther comprehensive income (loss) items, net of tax 13.2 (27.6) 34.5\nComprehensive income $ 359.2 $ 356.4 $ 340.8\n______________________________\n(1) Earnings per share is calculated using unrounded numbers. Amounts in the table may not recalculate exactly due to rounding.\nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nACUITY BRANDS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\nYear Ended August 31,\n2023 2022 2021\nCash flows from operating activities:\nNet income $ 346.0 $ 384.0 $ 306.3\nAdjustments to reconcile net income to cash flows from operating activities:\nDepreciation and amortization 93.2 94.8 100.1\nShare-based payment expense 42.0 37.4 32.5\nGain on the sale or disposal of property, plant, and equipment - (2.3) (0.1)\nAsset impairments 20.8 1.7 6.0\nLoss on sale of a business 11.2 - -\nDeferred income taxes (47.8) 0.6 (2.7)\nChanges in operating assets and liabilities, net of acquisitions\nAccounts receivable 114.6 (99.7) (68.7)\nInventories 115.2 (83.3) (35.5)\nPrepayments and other current assets 21.4 (17.6) (18.2)\nAccounts payable (110.5) 2.6 65.5\nOther (28.0) (1.9) 23.5\nNet cash provided by operating activities 578.1 316.3 408.7\nCash flows from investing activities:\nPurchases of property, plant, and equipment (66.7) (56.5) (43.8)\nProceeds from sale of property, plant, and equipment - 8.9 4.7\nAcquisitions of businesses, net of cash acquired (35.5) (12.9) (75.3)\nOther investing activities 11.5 (1.7) (3.5)\nNet cash used for investing activities (90.7) (62.2) (117.9)\nCash flows from financing activities:\nBorrowings on credit facility, net of repayments (18.0) 18.0 -\nIssuances of long-term debt - - 493.8\nRepayments of long-term debt - - (401.1)\nRepurchases of common stock (266.6) (514.8) (434.9)\nProceeds from stock option exercises and other 2.7 12.5 3.2\nPayments of taxes withheld on net settlement of equity awards (14.2) (8.6) (4.5)\nDividends paid (16.8) (18.1) (19.1)\nOther financing activities - (1.4) -\nNet cash used for financing activities (312.9) (512.4) (362.6)\nEffect of exchange rate changes on cash and cash equivalents 0.2 (9.8) 2.4\nNet change in cash and cash equivalents 174.7 (268.1) (69.4)\nCash and cash equivalents at beginning of year 223.2 491.3 560.7\nCash and cash equivalents at end of year $ 397.9 $ 223.2 $ 491.3\nSupplemental cash flow information:\nIncome taxes paid $ 147.2 $ 109.4 $ 86.4\nInterest paid $ 27.9 $ 26.1 $ 22.2\nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nACUITY BRANDS, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\n(In millions)\nCommon Stock Outstanding\nShares(1)\nAmount Paid-in\nCapital Retained\nEarnings Accumulated Other\nComprehensive\nLoss Items Treasury\nStock, at cost Total\nBalance, August 31, 2020 38.9 $ 0.5 $ 963.6 $ 2,523.3 $ (132.7) $ (1,227.2) $ 2,127.5\nNet income - - - 306.3 - - 306.3\nOther comprehensive income, net of tax - - - - 34.5 - 34.5\nShare-based payment amortization, issuances, and cancellations 0.1 - 28.8 - - - 28.8\nEmployee stock purchase plan issuances - - 1.0 - - - 1.0\nCash dividends of $0.52 per share paid on common stock\n- - - (19.1) - - (19.1)\nStock options exercised - - 2.2 - - - 2.2\nCumulative effect of adoption of ASC 326 - - - (0.2) - - (0.2)\nRepurchases of common stock (3.8) - - - - (436.5) (436.5)\nBalance, August 31, 2021 35.2 0.5 995.6 2,810.3 (98.2) (1,663.7) 2,044.5\nNet income - - - 384.0 - - 384.0\nOther comprehensive loss, net of tax - - - - (27.6) - (27.6)\nShare-based payment amortization, issuances, and cancellations 0.1 - 28.2 - - - 28.2\nEmployee stock purchase plan issuances - - 1.8 - - - 1.8\nCash dividends of $0.52 per share paid on common stock\n- - - (18.1) - - (18.1)\nStock options exercised 0.1 - 10.7 - - - 10.7\nRepurchases of common stock (2.9) - - - - (511.7) (511.7)\nBalance, August 31, 2022 32.5 0.5 1,036.3 3,176.2 (125.8) (2,175.4) 1,911.8\nNet income - - - 346.0 - - 346.0\nOther comprehensive income, net of tax - - - - 13.2 - 13.2\nShare-based payment amortization, issuances, and cancellations 0.2 - 27.8 - - - 27.8\nEmployee stock purchase plan issuances - - 1.5 - - - 1.5\nCash dividends of $0.52 per share paid on common stock\n- - - (16.8) - - (16.8)\nStock options exercised - - 1.2 - - - 1.2\nRepurchases of common stock (1.6) - - - - (269.3) (269.3)\nBalance, August 31, 2023 31.1 $ 0.5 $ 1,066.8 $ 3,505.4 $ (112.6) $ (2,444.7) $ 2,015.4\n______________________________\n(1) Share activity and balances above calculated using rounded numbers.\nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 - Description of Business and Basis of Presentation\nAcuity Brands, Inc. (referred to herein as we, our, us, the Company, or similar references) is a market-leading industrial technology company. We use technology to solve problems in spaces and light. Through our two business segments, Acuity Brands Lighting and Lighting Controls (ABL) and the Intelligent Spaces Group (ISG), we design, manufacture, and bring to market products and services that make a valuable difference in people's lives. We achieve growth through the development of innovative new products and services, including lighting, lighting controls, building management systems, and location-aware applications.\nABL Segment\nOur ABL strategy is to increase product vitality, improve service levels, use technology to improve and differentiate both our products and our services, and drive productivity. ABL's portfolio of lighting solutions includes commercial, architectural, and specialty lighting in addition to lighting controls and components that can be combined to create integrated lighting controls systems. We offer devices such as luminaires that predominantly utilize light emitting diode (LED) technology designed to optimize energy efficiency and comfort for various indoor and outdoor applications. ABL's portfolio of products includes but is not limited to the following brands: A-LightTM, AculuxTM, American Electric Lighting®, CycloneTM, Dark to Light®, eldoLED®, Eureka®, Gotham®, Healthcare Lighting®, Holophane®, Hydrel®, IndyTM, IOTA®, Juno®, Lithonia Lighting®, Luminaire LEDTM, Luminis®, Mark Architectural LightingTM, nLight®, OPTOTRONIC®, Peerless®, RELOC® Wiring Solutions, and Sensor SwitchTM.\nPrincipal customers of ABL include electrical distributors, retail home improvement centers, electric utilities, national accounts, original equipment manufacturer (OEM) customers, digital retailers, lighting showrooms, and energy service companies. Our customers are located in North America and select international markets that serve new construction, renovation and retrofit, and maintenance and repair applications. ABL's lighting and lighting controls solutions are sold primarily through a network of independent sales agencies that cover specific geographic areas and market channels, by internal sales representatives, through consumer retail channels, directly to large corporate accounts, and directly to OEM customers. Products are delivered directly from our manufacturing facilities or through a network of distribution centers, regional warehouses, and commercial warehouses using both common carriers and an internally-managed truck fleet.\nISG Segment\nOur ISG strategy is to make spaces smarter, safer, and greener by connecting the edge to the cloud. ISG offers building management solutions and building management software. Our building management solutions include products for controlling heating, ventilation, air conditioning (HVAC); lighting; shades; refrigeration; and building access that deliver end-to-end optimization of those building systems. Our intelligent building software enhances the occupant experience, improves building system management, and automates labor intensive tasks while delivering operational energy efficiency and cost reductions. Through a connected and converged building system architecture, our software delivers different applications, allows clients to upgrade over time with natural refresh cycles, and deploys new capabilities. Customers of ISG primarily include system integrators as well as retail stores, airports, and enterprise campuses throughout North America and select international locations. ISG products and solutions are marketed under multiple brand names, including but not limited, to Atrius®, Distech Controls®, and KE2 Therm Solutions®.\nBasis of Presentation\nWe have prepared the Consolidated Financial Statements in accordance with U.S. generally accepted accounting principles (U.S. GAAP) to present the financial position, results of operations, and cash flows of Acuity Brands, Inc. and its wholly-owned subsidiaries.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 2 - Significant Accounting Policies\nPrinciples of Consolidation\nThe Consolidated Financial Statements include the accounts of Acuity Brands, Inc. and its wholly-owned subsidiaries after elimination of intercompany transactions and accounts.\nUse of Estimates\nThe preparation of financial statements and related disclosures in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenue and expense during the reporting period. Actual results could differ from those estimates.\nRevenue Recognition\nRefer to the Revenue Recognition footnote of the Notes to Consolidated Financial Statements for information related to our revenue recognition accounting policies.\nCash and Cash Equivalents\nCash in excess of daily requirements is invested in time deposits and marketable securities and is included in the accompanying balance sheets at fair value. We consider time deposits and marketable securities with an original maturity of three months or less when purchased to be cash equivalents.\nAccounts Receivable\nWe record accounts receivable at net realizable value. This value includes a reserve for doubtful accounts to reflect our estimate of expected credit losses over the contractual term of our receivables. Our estimation of current expected credit losses reflects our considerations of historical write-offs, an analysis of past due accounts based on the contractual terms of the receivables, and the economic status of customers, if known. We additionally consider the impact of general economic conditions, including construction spending, unemployment rates, and macroeconomic growth, on our customers' future ability to meet their obligations. We believe that the reserve is sufficient to cover uncollectible amounts; however, there can be no assurance that unanticipated future business conditions of customers will not have a negative impact on our results of operations, financial condition, or cash flows.\nConcentrations of Credit Risk\nConcentrations of credit risk with respect to receivables, which are typically unsecured, are generally limited due to the wide variety of customers and markets using our lighting, lighting controls, building management systems, and location-aware applications as well as their dispersion across many different geographic areas. One customer accounted for approximately 10% of receivables at August 31, 2023 and at August 31, 2022. No single customer accounted for more than 10% of net sales in fiscal 2023, 2022, or 2021.\nReclassifications\nWe may reclassify certain prior period amounts to conform to the current year presentation. No material reclassifications occurred during the current period.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nInventories\nInventories include materials, direct labor, inbound freight, customs, duties, tariffs, and related manufacturing overhead. Inventories are stated on a first-in, first-out basis at the lower of cost and net realizable value and consist of the following as of the dates presented (in millions):\nAugust 31,\n2023 2022\nRaw materials, supplies, and work in process(1)\n$ 214.0 $ 252.6\nFinished goods 180.3 264.0\nInventories excluding reserves 394.3 516.6\nLess: Reserves (25.8) (30.9)\nTotal inventories $ 368.5 $ 485.7\n_______________________________________\n(1) Due to the immaterial amount of estimated work in process and the short lead times for the conversion of raw materials to finished goods, we do not believe the segregation of raw materials and work in process is meaningful information.\nWe review inventory quantities on hand and record a provision for excess or obsolete inventory primarily based on estimated future demand and current market conditions. A significant change in customer demand or market conditions could render certain inventory obsolete and could have a material adverse impact on our operating results in the period the change occurs. The following table summarizes the changes in our inventory reserves for the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nBeginning balance $ 30.9 $ 38.0 $ 49.3\nAdditions to reserve 16.2 15.7 21.4\nDisposals of reserved inventory (20.6) (22.5) (32.7)\nForeign currency translation adjustments (0.7) (0.3) -\nEnding balance $ 25.8 $ 30.9 $ 38.0\nAssets Held for Sale\nWe classify assets as held for sale when a plan for disposal is developed and approved, the asset is available for immediate sale, an active program to locate a buyer at a price reasonable in relation to current fair value is initiated, and transfer of the asset is expected to be completed within one year. We cease the depreciation and amortization of the assets when all of these criteria have been met and generally reflect balances within Prepayments and other current assets on our Consolidated Balance Sheets. We did not have any assets classified as held for sale at August 31, 2023 or August 31, 2022.\nDuring the year ended August 31, 2022, we sold one building classified as held for sale at August 31, 2021 with a total carrying value of $6.6 million for a gain of approximately $2.3 million. This gain is reflected in Selling, distribution, and administrative expenses within our Consolidated Statements of Comprehensive Income.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nGoodwill and Other Intangibles\nThe changes in the carrying amount of goodwill during the periods presented by segment are summarized as follows (in millions):\nABL ISG Total\nBalance as of August 31, 2021 $ 1,022.2 $ 72.5 $ 1,094.7\nAdjustments to provisional amounts from acquired businesses 2.3 - 2.3\nForeign currency translation adjustments (10.3) (2.4) (12.7)\nBalance as of August 31, 2022 1,014.2 70.1 1,084.3\nAdditions from acquired businesses - 15.2 15.2\nAdjustments to provisional amounts from acquired businesses - (0.2) (0.2)\nDerecognitions for divestitures (0.7) - (0.7)\nForeign currency translation adjustments 0.9 (1.6) (0.7)\nBalance as of August 31, 2023 $ 1,014.4 $ 83.5 $ 1,097.9\nThrough multiple acquisitions, we acquired definite-lived intangible assets that are amortized over their estimated useful lives. Indefinite-lived intangible assets consist of trade names that are expected to generate cash flows indefinitely. Significant estimates and assumptions were used to determine the initial fair value of these acquired intangible assets, including estimated future short-term and long-term net sales and profitability, customer attrition rates, royalty rates, and discount rates. Certain of our intangible assets are attributable to foreign operations and are impacted by currency translation due to movements in foreign currency rates year over year. Summarized information for our intangible assets is as follows as of the dates presented (in millions except amortization periods):\nAugust 31,\n2023 2022\nGross Carrying\nAmount Accumulated\nAmortization Gross Carrying\nAmount Accumulated\nAmortization\nDefinite-lived intangible assets:\nPatents and patented technology $ 158.8 $ (122.3) $ 160.8 $ (116.0)\nTrademarks and trade names 45.5 (18.4) 27.2 (18.3)\nDistribution network 61.8 (49.4) 61.8 (47.3)\nCustomer relationships 425.0 (155.4) 427.7 (140.4)\nTotal definite-lived intangible assets $ 691.1 $ (345.5) $ 677.5 $ (322.0)\nIndefinite-lived trade names $ 135.6 $ 173.7\nWe recorded amortization expense of $42.1 million, $41.0 million, and $40.7 million related to acquired intangible assets during fiscal 2023, 2022, and 2021, respectively. Amortization expense is generally recorded on a straight-line basis and is expected to be approximately $39.6 million in fiscal 2024, $32.2 million in fiscal 2025, $29.5 million in fiscal 2026, $28.0 million in fiscal 2027, and $23.9 million in fiscal 2028.\nWe test goodwill and indefinite-lived intangible assets for impairment on an annual basis as of the first date of our fourth fiscal quarter (June 1) or more frequently if facts and circumstances indicate an asset is more likely than not impaired, as required by Accounting Standards Codification (ASC) Topic 350, Intangibles-Goodwill and Other (ASC 350). ASC 350 allows for an optional qualitative analysis for goodwill to determine the likelihood of impairment. If the qualitative review results in a more likely than not probability of impairment, a quantitative analysis is required. The qualitative step may be bypassed entirely in favor of a quantitative test.\nThe quantitative analysis for goodwill tests for impairments by comparing the fair value of a reporting unit to its carrying value, including goodwill. Reporting unit fair values can be determined based on a combination of valuation techniques including the expected present value of future cash flows, a market multiple approach, and a comparable transaction approach. If the fair value of a reporting unit exceeds its carrying value, goodwill is not\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nconsidered impaired. Conversely, if the carrying value of a reporting unit exceeds its fair value, an impairment charge for the difference would be recorded.\nIn fiscal 2023, 2022, and 2021, we used a quantitative analysis to calculate the fair value of our reporting units using a combination of discounted future cash flows and relevant market multiples. The analysis for goodwill did not result in an impairment charge during fiscal 2023, 2022, or 2021.\nWe performed our annual indefinite-lived intangible asset impairment analyses on the first day of our fiscal fourth quarter (June 1) for each period presented. As of June 1, 2023, the current fiscal year testing date, we held 13 indefinite-lived intangible assets with an aggregate carrying value of $173.4 million. The impairment test for indefinite-lived trade names compares the fair value of a trade name with its carrying value. If the carrying amount exceeds the estimated fair value, an impairment loss would be recorded for the amount of the excess. We estimate the fair value of indefinite-lived trade names using a fair value model based on discounted future cash flows. Significant assumptions, including estimated future short-term and long-term net sales, royalty rates, and discount rates, are used in the determination of estimated fair value for indefinite-lived trade names. Refer to the Fair Value Measurement footnote of the Notes to Consolidated Financial Statements for further information regarding significant assumptions used in our fiscal 2023 impairment test.\nBased on the results of the indefinite-lived intangible asset analyses for fiscal 2023, we recorded an impairment charge of $14.0 million for six trade names within Special Charges in the Consolidated Statements of Comprehensive Income related to our ABL segment. We also determined five of these trade names no longer have indefinite lives. These trade names were classified as definite-lived as of June 1, 2023 and will be amortized over 15 years. The impairment analyses for fiscal 2023 of the other seven indefinite-lived intangible assets indicated that their fair values exceeded their carrying values.\nThe impairment analyses of our indefinite-lived intangible assets indicated that their fair values exceeded their carrying values for fiscal 2022 and fiscal 2021.\nOther Long-Term Assets\nOther long-term assets consist of the following items whose economic benefits are expected to be realized greater than one year from the dates presented (in millions):\nAugust 31,\n2023 2022\nDeferred costs and other assets(1) (2)\n$ 29.9 $ 28.1\nInvestments in debt and equity securities 7.2 11.9\nPensions plans in which plan assets exceed benefit obligation 12.4 8.0\nTotal other long-term assets $ 49.5 $ 48.0\n_______________________________________\n(1)Estimated recoveries of warranty and recall costs, net of estimated credit losses, expected to be recovered greater than one year from the respective balance sheet dates are included in this category.\n(2)Included within this category are company-owned life insurance investments. We maintain life insurance policies on 56 former employees primarily to satisfy obligations under certain deferred compensation plans. These company-owned life insurance policies are presented net of loans that are secured by these policies. This program is frozen, and no new policies were issued in the three-year period ended August 31, 2023.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOther Current Liabilities\nOther current liabilities consist of the following as of the dates presented (in millions):\nAugust 31,\n2023 2022\nCustomer incentive programs(1)\n$ 31.6 $ 40.7\nRefunds to customers(1)\n25.6 28.0\nCurrent deferred revenues(1)\n14.1 11.4\nSales commissions 35.7 41.9\nFreight costs 15.0 22.8\nWarranty and recall costs(2)\n22.8 22.4\nTax-related items(3)\n9.2 13.9\nInterest on long-term debt(4)\n2.3 2.3\nOther 30.4 30.7\nTotal other current liabilities $ 186.7 $ 214.1\n____________________________________\n(1)Refer to the Revenue Recognition footnote of the Notes to Consolidated Financial Statements for additional information.\n(2)Refer to the Commitments and Contingencies footnote of the Notes to Consolidated Financial Statements for additional information.\n(3)Includes accruals for income, property, sales and use, and value added taxes.\n(4)Refer to the Debt and Lines of Credit footnote of the Notes to Consolidated Financial Statements for additional information.\nOther Long-Term Liabilities\nOther long-term liabilities consist of the following as of the dates presented (in millions):\nAugust 31,\n2023 2022\nDeferred compensation and postretirement benefits other than pensions(1)\n$ 45.6 $ 44.4\nDeferred revenues(2)\n47.6 53.1\nUnrecognized tax position liabilities, including interest(3)\n23.4 22.0\nSelf-insurance liabilities(4)\n3.8 3.7\nProduct warranty and recall costs(4)\n8.8 4.9\nOther - 0.8\nTotal other long-term liabilities $ 129.2 $ 128.9\n____________________________________\n(1)We maintain several non-qualified retirement plans for the benefit of eligible employees, primarily deferred compensation plans. The deferred compensation plans provide for elective deferrals of an eligible employees compensation and, in some cases, matching contributions by the organization. We maintain life insurance policies on certain former officers and other key employees as a means of satisfying a portion of these obligations.\n(2)Refer to the Revenue Recognition footnote of the Notes to Consolidated Financial Statements for additional information.\n(3)Refer to the Income Taxes footnote of the Notes to Consolidated Financial Statements for additional information.\n(4)Refer to the Commitments and Contingencies footnote of the Notes to Consolidated Financial Statements for additional information.\nShipping and Handling Fees and Costs\nWe include shipping and handling fees billed to customers in Net sales in the Consolidated Statements of Comprehensive Income.\nWhen a product is sold, the associated shipping and handling costs are recorded in the Consolidated Statements of Comprehensive Income based on their function. Costs associated with inbound freight and freight between manufacturing facilities and distribution centers are generally recorded in Cost of products sold, which may be capitalized into inventory. Other shipping and handling costs, which primarily include amounts incurred to transfer finished goods to a customer's desired location, are included in Selling, distribution, and administrative expenses and totaled $141.7 million, $151.2 million, and $132.0 million in fiscal 2023, 2022, and 2021, respectively.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nShare-based Payments\nWe account for stock options, restricted stock, performance stock units, and stock units representing certain deferrals into the Nonemployee Director Deferred Compensation Plan (the Director Plan) or the Supplemental Deferred Savings Plan (SDSP) (both of which are discussed further in the Share-based Payments footnote) based on their grant-date fair values estimated under the provisions of ASC Topic 718, Compensation-Stock Compensation (ASC 718).\nWe generally recognize compensation cost for share-based payment transactions on a straight-line basis over an award's requisite service period as defined by ASC 718. We apply the accelerated attribution method in certain circumstances, such as when a performance stock unit is subject to graded vesting. For awards subject to a market condition, we consider both actual and derived service periods, as well as the expected performance period, to determine the appropriate compensation recognition method. We have recorded share-based payment expense, net of estimated forfeitures, in Selling, distribution, and administrative expenses in the Consolidated Statements of Comprehensive Income. Share-based payment expense includes expense related to restricted stock, performance stock units, options issued, and stock units deferred into the Director Plan. We recorded $42.0 million, $37.4 million, and $32.5 million of share-based payment expense for the years ended August 31, 2023, 2022, and 2021, respectively. The total income tax benefit recognized for share-based payment expense was $7.2 million, $9.6 million, and $6.5 million for the years ended August 31, 2023, 2022, and 2021, respectively.\nExcess tax benefits and/or expense related to share-based payment awards are reported within Income tax expense on the Consolidated Statements of Comprehensive Income. We recognized net excess tax benefit related to share-based payment cost of $1.5 million and $4.8 million for the years ended August 31, 2023 and 2022, respectively. We recognized net excess tax expense related to share-based payment cost of $0.5 million for the year ended August 31, 2021.\nSee the Share-based Payments footnote of the Notes to Consolidated Financial Statements for more information.\nProperty, Plant, and Equipment\nProperty, plant, and equipment is initially recorded at cost and depreciated principally on a straight-line basis using estimated useful lives of plant and equipment (3 to 40 years for buildings and related improvements and 2 to 15 years for machinery and equipment) for financial reporting purposes. Accelerated depreciation methods are used for income tax purposes. Leasehold improvements are amortized over the shorter of the life of the lease or the estimated useful life of the improvement. Land is not depreciated. Depreciation expense amounted to $51.1 million, $53.8 million, and $59.4 million during fiscal 2023, 2022, and 2021, respectively. The balance of property, plant, and equipment consists of the following as of the dates presented (in millions):\nAugust 31,\n2023 2022\nLand $ 23.0 $ 22.0\nBuildings and leasehold improvements 210.9 202.3\nMachinery and equipment 727.9 667.6\nTotal property, plant, and equipment, at cost 961.8 891.9\nLess: Accumulated depreciation and amortization (664.2) (615.4)\nProperty, plant, and equipment, net $ 297.6 $ 276.5\nResearch and Development\nResearch and development (R&D) expense consists of compensation, payroll taxes, employee benefits, materials, supplies, and other administrative costs, but it does not include all new or enhanced product development costs. R&D expense is expensed as incurred and is included in Selling, distribution, and administrative expenses in our Consolidated Statements of Comprehensive Income. R&D expense amounted to $97.1 million, $95.1 million, and $88.3 million during fiscal 2023, 2022, and 2021, respectively.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAdvertising\nAdvertising costs are expensed as incurred and are included within Selling, distribution, and administrative expenses in our Consolidated Statements of Comprehensive Income. These costs totaled $21.9 million, $19.3 million, and $15.9 million during fiscal 2023, 2022, and 2021, respectively.\nInterest Expense, Net\nInterest expense, net, is comprised primarily of interest expense on long-term debt, line of credit borrowings, and loans that are secured by and presented net of company-owned life insurance policies on our Consolidated Balance Sheets. Interest expense is partially offset by interest income earned on cash and cash equivalents.\nThe following table summarizes the components of Interest expense, net during the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nInterest expense $ 27.9 $ 27.0 $ 24.2\nInterest income (9.0) (2.1) (1.0)\nInterest expense, net $ 18.9 $ 24.9 $ 23.2\nMiscellaneous Expense (Income), Net\nMiscellaneous expense (income), net, is comprised primarily of non-service related components of net periodic pension cost, gains and losses associated with foreign currency-related transactions, and non-operating gains and losses. During fiscal 2023 we reported an $11.2 million loss of the sale of our Sunoptics prismatic skylights business. The details of the Sunoptics sale are described in the Acquisitions and Divestitures footnote of the Notes to Consolidated Financial Statements.\nAmounts relating to foreign currency transactions consisted of net gains of $8.4 million in fiscal 2023, net gains of $5.3 million in fiscal 2022, and net losses of $1.3 million in fiscal 2021.\nIncome Taxes\nWe are taxed at statutory corporate rates after adjusting income reported for financial statement purposes for certain items that are treated differently for income tax purposes. Deferred income tax expenses or benefits result from changes during the year in cumulative temporary differences between the tax basis and book basis of assets and liabilities. Refer to the Income Taxes footnote of the Notes to Consolidated Financial Statements for additional information.\nForeign Currency Translation\nThe functional currency for foreign operations is generally the local currency where the foreign operations are domiciled. The translation of foreign currencies into U.S. dollars is performed for asset and liability accounts using exchange rates in effect at the balance sheet dates and for revenue and expense accounts using a weighted average exchange rate each month during the year. The gains or losses resulting from the balance sheet translation are included in Foreign currency translation adjustments in the Consolidated Statements of Comprehensive Income and are excluded from net income.\nComprehensive Income\nComprehensive income represents a measure of all changes in equity that result from recognized transactions and other economic events other than transactions with owners in their capacity as owners. Other comprehensive income (loss) items includes foreign currency translation and pension adjustments.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table presents the changes in each component of accumulated other comprehensive loss net of tax during the periods presented (in millions):\nForeign Currency Items Defined Benefit Pension Plans Accumulated Other Comprehensive Loss Items\nBalance as of August 31, 2021 $ (40.2) $ (58.0) $ (98.2)\nOther comprehensive (loss) income before reclassifications (33.3) 0.7 (32.6)\nAmounts reclassified from accumulated other comprehensive loss (1)\n- 5.0 5.0\nNet current period other comprehensive (loss) income (33.3) 5.7 (27.6)\nBalance as of August 31, 2022 (73.5) (52.3) (125.8)\nOther comprehensive income before reclassifications 8.5 0.4 8.9\nAmounts reclassified from accumulated other comprehensive loss (1)\n- 4.3 4.3\nNet current period other comprehensive income 8.5 4.7 13.2\nBalance as of August 31, 2023 $ (65.0) $ (47.6) $ (112.6)\n_______________________________________\n(1)The before tax amounts of the defined benefit pension plan items are included in net periodic pension cost. See the Pension and Defined Contribution Plans footnote for additional details.\nThe following table presents the tax expense or benefit allocated to each component of other comprehensive income (loss) during the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nBefore Tax Amount Tax (Expense) or Benefit Net of Tax Amount Before Tax Amount Tax (Expense) or Benefit Net of Tax Amount Before Tax Amount Tax (Expense) or Benefit Net of Tax Amount\nForeign currency translation adjustments $ 8.5 $ - $ 8.5 $ (33.3) $ - $ (33.3) $ 13.3 $ - $ 13.3\nDefined benefit pension plans:\nTax adjustments - - - - - - - (3.2) (3.2)\nActuarial gains 0.4 - 0.4 0.7 - 0.7 17.5 (3.6) 13.9\nAmortization of defined benefit pension items:\nPrior service cost 2.6 (0.6) 2.0 2.9 (0.7) 2.2 2.9 (0.6) 2.3\nActuarial losses 3.0 (0.7) 2.3 3.3 (0.8) 2.5 5.5 (1.2) 4.3\nSettlement losses - - - 0.4 (0.1) 0.3 3.9 - 3.9\nTotal defined benefit plans, net 6.0 (1.3) 4.7 7.3 (1.6) 5.7 29.8 (8.6) 21.2\nOther comprehensive income (loss) $ 14.5 $ (1.3) $ 13.2 $ (26.0) $ (1.6) $ (27.6) $ 43.1 $ (8.6) $ 34.5\nNote 3 - New Accounting Pronouncements\nAccounting Standards Adopted in Fiscal 2023\nAccounting Standards Update (ASU) 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers (ASU 2021-08)\nIn October 2021, the Financial Accounting Standards Board (the FASB) issued ASU 2021-08, which requires companies to recognize and measure contract assets and contract liabilities acquired in a business combination as if the acquiring company originated the related revenue contracts. ASU 2021-08 is effective for fiscal years beginning after December 15, 2022, or our fiscal 2024, with early adoption permitted, including in an interim period. We early adopted ASU 2021-08 as of May 15, 2023, on a prospective basis, as permitted by the standard, and applied its provisions to our current period acquisition. This standard did not have a material effect on our fiscal 2023 acquisition or our financial condition, results of operations, or cash flows.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAccounting Standards Yet to Be Adopted\nASU 2023-02, Investments-Equity Method and Joint Ventures (Topic 323): Accounting for Investments in Tax Credit Structures Using the Proportional Amortization Method (ASU 2023-02)\nIn March 2023, the FASB issued ASU 2023-02, which expands the permitted use of the proportional amortization method of accounting for certain tax-related investments if certain conditions are met. ASU 2023-02 is effective for fiscal years beginning after December 15, 2023, or our fiscal 2025, with early adoption permitted, including in an interim period. As of August 31, 2023, we do not hold any qualifying investments. Therefore, we do not expect ASU 2023-02 to have a material impact on our financial condition, results of operations, or cash flows.\nAll other newly issued accounting pronouncements not yet effective have been deemed either immaterial or not applicable.\nNote 4 - Acquisitions and Divestitures\nAcquisitions\nThe following discussion relates to fiscal 2023 and 2021 acquisitions. There were no acquisitions during fiscal 2022. The $12.9 million of cash outflows reflected in the fiscal 2022 Consolidated Statements of Cash Flows relate to fiscal 2021 acquisitions primarily for working capital settlements.\nFiscal 2023 Acquisitions\nOn May 15, 2023, using cash on hand, we acquired all of the equity interests of KE2 Therm Solutions, Inc. (KE2 Therm). KE2 Therm develops and provides intelligent refrigeration control solutions that deliver the precision of digital controls to promote safety, efficiency, and reliability, while delivering cost savings to the customer. This acquisition is intended to expand ISG's technology and controls product portfolio and reach new customers.\nWe accounted for the acquisition of KE2 Therm in accordance with Accounting Standards Codification (ASC) Topic 805, Business Combinations (ASC 805). Acquired assets and liabilities were recorded at their estimated acquisition-date fair values. Acquisition-related costs were expensed as incurred and were not material to our financial statements. The aggregate purchase price of these acquisitions reflects preliminary goodwill within the ISG segment of $15.0 million at August 31, 2023, which is not expected to be deductible for tax purposes. The goodwill is primarily comprised of expected benefits related to expanding ISG's technology and controls product portfolio as well as the trained workforce acquired with these businesses and expected synergies from combining the operations of KE2 Therm with our operations.\nWe additionally recorded preliminary gross intangible assets of $18.0 million as of August 31, 2023, which reflect estimates for definite-lived intangibles with a preliminary estimated weighted average useful life of approximately 15 years.\nAmounts recorded for acquired assets and liabilities are deemed to be provisional until disclosed otherwise as we continue to gather information related to the identification and valuation of acquired assets and liabilities including, but not limited to, intangible assets and tax-related items. The operating results of KE2 Therm have been included in our financial statements since the date of acquisition and are not material to our financial condition, results of operations, or cash flows.\nFiscal 2021 Acquisitions\nams OSRAM's North American Digital Systems Business\nOn July 1, 2021, using cash on hand, we acquired certain assets and liabilities of ams OSRAMs North American Digital Systems business (OSRAM DS). This acquisition is intended to enhance our LED driver and controls technology portfolio and accelerate our innovation, expand our access to market through a more fulsome OEM product offering, and give us more control over our supply chain.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nRockpile Ventures, Inc.\nOn May 18, 2021, using cash on hand, we acquired all of the equity interests of Rockpile Ventures, Inc., (Rockpile Ventures) an accelerator of edge artificial intelligence (AI) startups. Rockpile Ventures helps early-stage artificial intelligence companies drive co-engineering and co-selling partnerships with major cloud ecosystems, enabling faster adoption from proof-of-concept trials to market scale.\nAccounting for Fiscal 2021 Acquisitions\nWe accounted for the acquisitions of Rockpile Ventures and OSRAM DS (collectively the 2021 Acquisitions) in accordance with ASC 805. We finalized the acquisition accounting for the 2021 Acquisitions during fiscal 2022. There were no material changes to our financial statements as a result of the finalization of the acquisition accounting for these acquisitions.\nThe aggregate purchase price of the 2021 Acquisitions reflects goodwill of $12.3 million and definite-lived customer-based intangible assets of $6.7 million, which have a useful life of approximately 11 years. Goodwill recognized from the 2021 Acquisitions is comprised primarily of expected synergies from obtaining more control over our supply chain and technology, combining the operations of the acquired business with our operations, and acquiring the associated trained workforce. Goodwill from the 2021 Acquisitions totaling $9.2 million is tax deductible.\nDivestitures\nWe sold our Sunoptics prismatic skylights business in November 2022. We transferred assets with a total carrying value of $15.1 million, which primarily consisted of intangibles with definite lives, inventories, and allocated goodwill from the ABL segment. We recognized a pre-tax loss on the sale of $11.2 million within Miscellaneous expense (income), net on the Consolidated Statements of Comprehensive Income. Additionally, we recorded impairment charges for certain retained assets as well as associate severance and other costs related to the sale. These items are included within Special charges on the Consolidated Statements of Comprehensive Income. See the Special Charges and Fair Value Measurements footnotes of the Notes to Consolidated Financial Statements for further details. There were no divestitures during fiscal 2022 or 2021.\nNote 5 - Fair Value Measurements\nWe determine fair value measurements based on the assumptions a market participant would use in pricing an asset or liability. ASC Topic 820, Fair Value Measurement (ASC 820), establishes a three-level hierarchy that distinguishes between market participant assumptions based on (i) unadjusted quoted prices for identical assets or liabilities in an active market (Level 1), (ii) quoted prices in markets that are not active or inputs that are observable either directly or indirectly for substantially the full term of the asset or liability (Level 2), and (iii) prices or valuation techniques that require inputs that are both unobservable and significant to the overall fair value measurement (Level 3).\nWe utilize valuation methodologies to determine the fair values of our financial assets and liabilities in conformity with the concepts of exit price and the fair value hierarchy as prescribed in ASC 820. All valuation methods and assumptions are validated at least quarterly to ensure the accuracy and relevance of the fair values. There were no material changes to the valuation methods or assumptions used to determine fair values during the current period. No transfers between the levels of the fair value hierarchy occurred during the current fiscal period. In the event of a transfer in or out of a level within the fair value hierarchy, the transfers would be recognized on the date of occurrence. We may from time to time be required to remeasure the carrying value of certain assets and liabilities to fair value on a nonrecurring basis. Such adjustments typically arise if we determine that certain of our assets are impaired.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFinancial Instruments Recorded at Fair Value\nThe following table summarizes balances and the fair value hierarchy level of our financial instruments recorded at fair value on a recurring basis as of the dates presented (in millions):\nAugust 31,\n2023 2022\nLevel 1 Level 2 Level 3 Total Level 1 Level 2 Level 3 Total\nCash and cash equivalents $ 397.9 $ - $ - $ 397.9 $ 223.2 $ - $ - $ 223.2\nOther financial instruments - 0.4 - 0.4 - - - -\nAssets in fair value hierarchy 397.9 0.4 - 398.3 223.2 - - 223.2\nOther investments(1)\n7.2 11.9\nTotal assets at fair value $ 397.9 $ 0.4 $ - $ 405.5 $ 223.2 $ - $ - $ 235.1\n____________________________________\n(1)Includes strategic investments in privately-held entities over which we do not exercise significant influence or control without readily determinable fair values. Amounts are recorded at cost less any impairment adjusted for observable price changes, if any.\nDuring the second quarter of fiscal 2023, we received cash for the cancellation of a strategic investment, whose underlying company was acquired by a third party. We also received preferred equity in the third party with a cost basis of $2.5 million that is accounted for under ASC 320, Investments-Debt Securities using discounted cash flows based on rates of similar instruments (Level 2). During the year ended August 31, 2023, we recorded an allowance for credit loss for this investment for its full cost basis. This credit loss reflected a decline in the underlying company's financial condition and long-term prospects, which included a suspension of dividend payments owed to us as well as a significant market decline in its publicly traded securities, including similar preferred equities. This impairment charge is reflected in Miscellaneous expense (income), net for the year ended August 31, 2023 within our Consolidated Statements of Comprehensive Income. Accrued interest related to this investment was not material to our financial statements. We had no credit losses on our investments at August 31, 2022.\nNonrecurring Fair Value Measurements\nThe following table summarizes information related to our nonrecurring fair value measurements during the current fiscal year (in millions):\nMeasurement Date Fair Value Hierarchy Level Fair Value\nIndefinite-lived trade names June 1, 2023 Level 3 $ 46.5\nRight of use operating lease asset group November 30, 2022 Level 3 3.4\nTotal assets at nonrecurring fair value $ 49.9\nIndefinite-Lived Trade Names\nWe performed an evaluation of the fair values of our indefinite-lived trade names as of June 1, 2023. Our analyses indicated that the carrying values of six of our trade names exceeded their fair values due primarily to expectations of the associated brands' future performance compared to original expectations at acquisition date as well as increases in overall discount rates. The total fair value of these trade names at June 1, 2023 totaled $46.5 million, which resulted in an impairment charge of $14.0 million. This charge is reflected within Special Charges on the Consolidated Statements of Comprehensive Income and relates to our ABL segment. We also determined the remaining value for five of these indefinite-lived trade names no longer have indefinite lives. These trade names were classified as definite-lived as of June 1, 2023 and will be amortized over 15 years. The impairment analyses of the other seven indefinite-lived intangible assets indicated that their fair values exceeded their carrying values.\nWe utilized significant assumptions to estimate the fair values of our indefinite-lived trade names using a fair value model based on discounted future cash flows (fair value model) in accordance with ASC 820. Future cash flows associated with our indefinite-lived trade names were calculated by multiplying a theoretical royalty rate a willing\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nthird party would pay for use of the particular trade name by estimated future net sales attributable to the relevant trade name. The present value of the resulting after-tax cash flows reflected our estimate of the fair value of each trade name. This fair value model required us to make several significant assumptions, including specific estimated future net sales (including short and long-term growth rates), a royalty rate, and a discount rate for each trade name.\nFuture net sales and short-term growth rates are estimated for trade names based on managements financial forecasts, which consider key business drivers, such as specific revenue growth initiatives, market share changes, expected growth in our addressable market, and general economic factors, such as macroeconomic conditions, credit availability, and interest rates. Our expected revenues as of June 1, 2023 were based on our fiscal 2023 and 2024 projections as well as recent third-party lighting, controls, and building technology solutions market growth estimates through 2028. We also included revenue growth estimates based on current initiatives expected to help improve performance, as appropriate. The long-term growth rate used in determining terminal value was estimated at 2.5% and was based primarily on our understanding of projections for expected long-term growth for our addressable market and historical long-term performance.\nThe theoretical royalty rate was estimated primarily using managements assumptions regarding the amount a willing third party would pay to use the particular trade name and was compared with market information for similar intellectual property within and outside of the industry. During fiscal 2023, estimated theoretical royalty rates ranged between 1% and 3%. We based discount rates on the Capital Asset Pricing Model, which considers a current risk-free interest rate, beta, market risk premium, and size premium appropriate for each intangible. We utilized a range of estimated discount rates between 11% and 13% as of June 1, 2023.\nAny reasonably likely change in the assumptions used in the analyses for our trade names, including revenue growth rates, royalty rates, and discount rates, would not be material to our financial condition or results of operations.\nRight of Use Operating Lease Asset Group\nIn connection with our sale of our Sunoptics prismatic skylights business in November 2022, we retained certain assets, primarily right of use lease assets, that we did not plan to continue using in our manufacturing operations. Accordingly, we assessed the recoverability of these assets using an undiscounted cash flow model and concluded that the carrying values of the assets were not fully recoverable, which triggered an impairment test for these assets. Our impairment test indicated that the fair value of the assets totaled $3.4 million, which resulted in an impairment charge of $4.3 million. This amount is included within Special charges on the Consolidated Statements of Comprehensive Income.\nThe recoverability and impairment test required significant assumptions including estimated future cash flows, the identification of assets within the asset group, and the determination of appropriate discount rates. Future cash flows were largely based both on third-party market date for sublease rental rates as well as our historic experience in subleasing properties. The discount rate was calculated using a methodology consistent with our incremental borrowing rate for leases initiated at that time and approximated the high end of our weighted average discount rate for operating leases described in the Leases footnote of the Notes to Consolidated Financial Statements.\nDisclosures of Fair Value of Financial Instruments\nDisclosures of fair value information about financial instruments, for which it is practicable to estimate that value, are required each reporting period in addition to any financial instruments carried at fair value on a recurring basis as prescribed by ASC Topic 825, Financial Instruments (ASC 825). In cases where quoted market prices are not available, fair values are based on estimates using present value or other valuation techniques. Those techniques are significantly affected by the assumptions used, including the discount rate and estimates of future cash flows.\nFair value for our outstanding debt obligations is estimated based on discounted future cash flows using rates currently available for debt of similar terms and maturity (Level 2). Our senior unsecured public notes are carried at the outstanding balance, net of unamortized bond discount and deferred costs, as of the end of the reporting period. The estimated fair value of our senior unsecured public notes was $401.4 million and $399.2 million as of August 31, 2023 and 2022, respectively.\nWe had no short-term borrowings and $18.0 million of short-term borrowings outstanding under our revolving credit facility as of August 31, 2023 and 2022, respectively. These borrowings are variable-rate instruments that reset on a\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nfrequent short-term basis; therefore, we estimate that any outstanding carrying values of these instruments, which are equal to their face amounts, approximate their fair values. See Debt and Lines of Credit footnote for further details on our outstanding borrowings.\nASC 825 excludes certain financial instruments and all nonfinancial instruments from its disclosure requirements. Accordingly, the aggregate fair value amounts presented do not represent the underlying value to us. In many cases, the fair value estimates cannot be substantiated by comparison to independent markets, nor can the disclosed value be realized in immediate settlement of the instruments. In evaluating our management of liquidity and other risks, the fair values of all assets and liabilities should be taken into consideration, not only those presented above.\nNote 6 - Leases\nWe lease property and equipment under operating lease arrangements, most of which relate to distribution centers and manufacturing facilities in the U.S., Mexico, and Canada. We include both the contractual term as well as any renewal option that we are reasonably certain to exercise in the determination of our lease terms. For leases with a term of greater than 12 months, we value lease liabilities as the present value of the lease payments over the related term. Related assets are equal to the calculated lease liabilities adjusted for incentives and other items as prescribed by ASC Topic 842, Leases (ASC 842). Lease payments generally consist of fixed amounts, and variable amounts based on a market rate or an index are not material to our consolidated lease cost. We have elected to use the practical expedient present in ASC 842 to not separate lease and non-lease components for all significant underlying asset classes and instead account for them together as a single lease component in the measurement of our lease liabilities.\nWe apply the short-term lease exception to leases with a term of 12 months or less and exclude such leases from our Consolidated Balance Sheets. Payments related to these short-term leases are expensed on a straight-line basis over the lease term and are reflected as a component of lease cost within our Consolidated Statements of Comprehensive Income.\nGenerally, the rates implicit in our leases are not readily determinable. Therefore, we discount future lease payments using our estimated incremental borrowing rate at lease commencement. We determine this rate based on a credit-adjusted risk-free rate, which approximates a secured rate over the lease term. The weighted average discount rate for operating leases was 3.5% and 2.5% as of August 31, 2023 and 2022, respectively.\nThe following table presents the future undiscounted payments due on our operating lease liabilities as well as a reconciliation of those payments to our operating lease liabilities recorded as of the date presented (in millions):\nFiscal year August 31, 2023\n2024 $ 22.5\n2025 20.9\n2026 16.5\n2027 12.5\n2028 8.9\nThereafter 24.0\nTotal undiscounted lease payments 105.3\nLess: Discount due to interest (10.1)\nPresent value of lease liabilities $ 95.2\nThe weighted average remaining lease term for our operating leases was six years as of August 31, 2023.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nLease cost is recorded within Cost of products sold, and may be capitalized into inventory as manufacturing overhead, or Selling, distribution, and administrative expenses in the Consolidated Statements of Comprehensive Income based on the primary use of the related right of use (ROU) asset. The components of total lease cost were as follows during the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nOperating lease cost $ 22.3 $ 18.8 $ 18.3\nVariable lease cost 4.2 2.7 2.0\nShort-term lease cost 3.6 4.3 2.2\nTotal lease cost $ 30.1 $ 25.8 $ 22.5\nCash paid for operating lease liabilities during the year ended August 31, 2023, 2022, and 2021 was $20.1 million, $18.5 million, and $26.2 million, respectively. ROU assets obtained in exchange for lease liabilities during the year ended August 31, 2023 and 2022 were $29.9 million and $37.3 million, respectively.\nWe have no significant leases that have not yet commenced as of August 31, 2023 that create significant rights and obligations.\nWe have subleased certain properties. Lease income from these subleases is recognized in the Consolidated Statements of Comprehensive Income as it is earned and is not material to our consolidated results of operations. We do not have any other significant transactions in which we are the lessor.\nDuring fiscal 2023 and 2022, we committed to plans to vacate certain leased properties, which indicated that it was more likely than not that the fair value of the related ROU assets were below their carrying values. We assessed the recoverability of these assets using an undiscounted cash flow model and concluded that the carrying values of the assets were not fully recoverable. We recorded impairment charges of $4.3 million related to these assets using a discounted cash flow model to estimate their fair values in fiscal 2023. The fiscal 2023 impairment was related to the ABL segment. The impairments were recorded within Special charges in the Consolidated Statements of Comprehensive Income. See the Special Charges footnote of the Notes to Consolidated Financial Statements for further details on the fiscal 2023 impairment. The recoverability and impairment tests required significant assumptions including estimated future cash flows, the identification of assets within each asset group, and the determination of appropriate discount rates.\nNo impairments were recorded for leases in fiscal 2021.\nNote 7 - Debt and Lines of Credit\nOur debt is carried at the outstanding balance net of any related unamortized discounts and deferred costs and consists of the following as of the dates presented (in millions):\nAugust 31,\n2023 2022\nSenior unsecured public notes due December 2030, principal $ 500.0 $ 500.0\nSenior unsecured public notes due December 2030, unamortized discount and deferred costs (4.4) (5.0)\nShort-term borrowings under credit facility - 18.0\nTotal debt $ 495.6 $ 513.0\nOur next scheduled future principal payment of long-term debt is $500.0 million due upon the maturity of the senior unsecured notes in December 2030.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nLong-term Debt\nOn November 10, 2020, Acuity Brands Lighting, Inc. issued $500.0 million aggregate principal amount of 2.150% senior unsecured notes due December 15, 2030 (the Unsecured Notes) at a price equal to 99.737% of their face value. Interest on the Unsecured Notes is paid semi-annually in arrears on June 15 and December 15 of each year. We recorded $4.8 million of deferred issuance costs related to the Unsecured Notes as a direct deduction from the face amount of the Unsecured Notes. These issuance costs are amortized over the 10-year term of the Unsecured Notes.\nThe Unsecured Notes are fully and unconditionally guaranteed on a senior unsecured basis by Acuity Brands, Inc. and ABL IP Holding LLC, a wholly-owned subsidiary of Acuity Brands, Inc.\nLines of Credit\nOn June 30, 2022, we entered into a credit agreement (the Credit Agreement) with a syndicate of banks that provides us with a $600.0 million five-year unsecured revolving credit facility (the Revolving Credit Facility) with the ability to request an additional $400.0 million of borrowing capacity. The Revolving Credit Facility replaced our previous credit agreement set to expire on June 30, 2022, the details of which can be found in the fiscal 2021 Debt and Lines of Credit footnote of the Notes to Consolidated Footnotes within our 2021 Annual Report on Form 10-K filed with the Securities and Exchange Commission on October 27, 2021.\nThe Revolving Credit Facility uses the Secured Overnight Financing Rate (SOFR) as the applicable benchmark for U.S. Dollar borrowings and an applicable benchmark rate for non-U.S. Dollar borrowings as defined in the Credit Agreement. The applicable margin pricing grid mechanics are based on the better of our public credit ratings or our net leverage ratio and range from 0.80% to 1.20% for base rate borrowings and from 0.00% to 0.20% for floating rate advances. We are also required to pay certain fees in connection with the Credit Agreement, including administrative service fees and annual facility fees, which range from 0.075% to 0.175% of the aggregate $600.0 million remaining commitment of the lenders under the Credit Agreement.\nThe Credit Agreement contains a leverage ratio covenant (Maximum Leverage Ratio) of total indebtedness to earnings before interest, tax, depreciation, and amortization (EBITDA), as such terms are defined in the Credit Agreement. These ratios are computed at the end of each fiscal quarter for the most recent 12-month period. The Credit Agreement generally allows for a Maximum Leverage Ratio of 3.75 (subject to temporary increase to 4.25 in the event of a significant acquisition) and allows netting of all unrestricted cash and cash equivalents against debt.\nWe had no short-term borrowings at August 31, 2023 and $18.0 million in short-term borrowings at August 31, 2022 outstanding under the Revolving Credit Facility.\nWe were in compliance with all financial covenants under the Credit Agreement as of August 31, 2023. At August 31, 2023, we had additional borrowing capacity under the Credit Agreement of $596.2 million under the most restrictive covenant in effect at the time, which represents the full amount of the Revolving Credit Facility less outstanding letters of credit of $3.8 million issued under the Revolving Credit Facility, primarily for securing collateral requirements under our casualty insurance premiums.\nNone of our existing debt instruments include provisions that would require an acceleration of repayments based solely on changes in our credit ratings. Borrowings and repayments on our Revolving Credit Facility with terms of three months or less are reported on a net basis on our Consolidated Statements of Cash Flows.\nNote 8 - Commitments and Contingencies\nSelf-Insurance\nOur policy is to self-insure up to certain limits traditional risks, including workers compensation, comprehensive general liability, and auto liability. Our self-insured retention for each claim involving workers compensation, comprehensive general liability (including product liability claims), and auto liability is limited per occurrence of such claims. A provision for claims under this self-insured program, based on our estimate of the aggregate liability for claims incurred, is revised and recorded annually. The estimate is derived from both internal and external sources including, but not limited to, our independent actuary. We are also self-insured up to certain limits for certain other insurable risks, primarily physical loss to property and business interruptions resulting from such loss lasting two days or more in duration. Insurance coverage is maintained for catastrophic property and casualty exposures, as\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nwell as those risks required to be insured by law or contract. We are fully self-insured for certain other types of liabilities, including environmental, product recall, warranty, and patent infringement. The actuarial estimates are subject to uncertainty from various sources including, among others, changes in claim reporting patterns, claim settlement patterns, actual claims, judicial decisions, legislation, and economic conditions. Although we believe that the actuarial estimates are reasonable, significant differences related to the items noted above could materially affect our self-insurance obligations, future expense, and cash flows.\nWe are also self-insured for the majority of our medical benefit plans up to certain limits. We estimate our aggregate liability for claims incurred by applying a lag factor to our historical claims and administrative cost experience. The appropriateness of our lag factor is evaluated annually and revised as necessary.\nLeases\nWe lease certain of our buildings and equipment under noncancellable lease agreements. Please refer to the Leases footnote of the Notes to Consolidated Financial Statements for additional information.\nCollective Bargaining Agreements\nApproximately 65% of our total work force is covered by collective bargaining agreements. Collective bargaining agreements representing approximately 57% of our work force will expire within one year, primarily due to annual negotiations of union contracts in Mexico.\nData Security Incidents\nOn December 14, 2022, a former associate filed a putative class action complaint against the Company in the United States District Court for the Northern District of Georgia on behalf of all persons whose personal information was compromised as a result of data security incidents we experienced in October 2020 and/or December 2021. On January 25, 2023, a second putative class action complaint was filed in the same venue by two other former associates.\nBoth complaints contain similar allegations and claim that the Company failed to exercise reasonable caution in securing and safeguarding associate information. On that basis, the complaints assert claims for negligence, breach of contract, breach of implied contract, unjust enrichment, breach of fiduciary duty, invasion of privacy, and breach of confidence. The plaintiffs seek class certification, monetary damages, certain injunctive relief regarding our data-security measures, additional credit-monitoring services, other equitable relief (including disgorgement), attorneys fees, costs, and pre- and post-judgment interest.\nThe plaintiffs in both cases recently filed a notice of voluntary dismissal without prejudice of the suits in the Northern District of Georgia and refiled in state court. We continue to prepare our response strategy.\nEstimating an amount or range of possible losses resulting from litigation proceedings is inherently difficult, particularly where the matters involve indeterminate claims for monetary damages and are in the early stages of the proceedings where key evidential and legal issues have not been resolved. In addition, we have received inquiries from, and it is also possible that investigations or other actions are taken by, state and/or federal agencies regarding the data security incidents and related data privacy matters. For these reasons, we are currently unable to predict the ultimate timing or outcome of or reasonably estimate the possible losses or a range of possible losses resulting from the matters described above. We have insurance, subject to certain terms and conditions, for these types of matters.\nLitigation\nWe are subject to various other legal claims arising in the normal course of business, including patent infringement, employment matters, and product liability claims. Based on information currently available, it is the opinion of management that the ultimate resolution of pending and threatened legal proceedings will not have a material adverse effect on our financial condition, results of operations, or cash flows. However, in the event of unexpected future developments, it is possible that the ultimate resolution of any such matters, if unfavorable, could have a material adverse effect on our financial condition, results of operations, or cash flows in future periods. We establish estimated liabilities for legal claims when associated costs become probable and can be reasonably estimated. The actual costs of resolving legal claims may be substantially higher than the amounts accrued for such claims.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nHowever, we cannot make a meaningful estimate of actual costs to be incurred that could possibly be higher or lower than the accrued amounts.\nEnvironmental Matters\nOur operations are subject to numerous comprehensive laws and regulations relating to the generation, storage, handling, transportation, and disposal of hazardous substances, as well as solid and hazardous wastes, and to the remediation of contaminated sites. In addition, permits and environmental controls are required for certain operations to limit air and water pollution, and these permits are subject to modification, renewal, and revocation by issuing authorities. On an ongoing basis, we invest capital and incur operating costs relating to environmental compliance. Environmental laws and regulations have generally become stricter in recent years. We are not aware of any pending legislation or proposed regulation related to environmental issues that would have a material adverse effect. The cost of responding to future changes may be substantial. We establish accruals for known environmental claims when the associated costs become probable and can be reasonably estimated. The actual cost of environmental issues may be substantially higher than that accrued due to difficulty in estimating such costs.\nGuarantees and Indemnities\nWe are a party to contracts entered into in the normal course of business in which it is common for us to agree to indemnify third parties for certain liabilities that may arise out of or relate to the subject matter of the contract. In most cases, we cannot estimate the potential amount of future payments under these indemnities until events arise that would result in a liability under the indemnities.\nProduct Warranty and Recall Costs\nOur products generally have a standard warranty term of five years that assure our products comply with agreed upon specifications. We record an accrual for the estimated amount of future warranty costs in accordance with ASC Topic 450, Contingencies (ASC 450) when the related revenue is recognized. Estimated future warranty and recall costs are primarily based on historical experience of identified warranty and recall claims. Estimated costs related to product warranty and recall costs outside of our historical experience, which could include significant product recalls or formal campaigns soliciting repair or return of a product, are accrued when they are deemed to be probable and can be reasonably estimated. Any estimated or actual loss recoveries that offset our costs and payments are reflected as assets and included within Other current assets or Other long-term assets based on the timing of receipt of recovery. Recoveries are recorded net of allowances for credit losses.\nThere can be no assurance that future warranty or recall costs will not exceed historical amounts, new technology products may not generate unexpected costs, and/or loss recoveries will not be fully collectible. If actual future warranty or recall costs exceed historical amounts or recoveries are no longer collectible, adjustments to our accruals and/or receivables may be warranted, which could have a material adverse impact on our results of operations and cash flows.\nEstimated liabilities for product warranty and recall costs are included in Other accrued liabilities or Other long-term liabilities on the Consolidated Balance Sheets based upon when we expect to settle the incurred warranty. The following table summarizes changes in the estimated liabilities for product warranty and recall costs during the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nBeginning balance $ 27.3 $ 20.3 $ 16.1\nWarranty and recall costs(1)\n47.0 52.4 32.3\nPayments and other deductions(1)\n(42.7) (45.4) (28.4)\nAcquired warranty and recall liabilities - - 0.3\nEnding balance $ 31.6 $ 27.3 $ 20.3\n____________________________\n(1) Amounts exclude any estimated or actual loss recoveries.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 9 - Segment Information\nWe present our financial results of operations for our two reportable segments, ABL and ISG, consistent with how our chief operating decision maker evaluates operating results, assesses performance, and allocates resources within the Company.\nThe accounting policies of our reportable segments are the same as those described in the Significant Accounting Policies footnote of the Notes to Consolidated Financial Statements. Corporate expenses that are primarily administrative in function and benefit the Company on an entity-wide basis are not allocated to segments. These include expenses related to governance, policy setting, compliance, and certain other shared services functions. Additionally, net interest expense, net miscellaneous expense (income), and income tax expense are not allocated to segments.\nBeginning in fiscal 2023, we allocated special charges to operating segment information presented to the chief operating decision maker on a prospective basis. We allocated $25.0 million of the $26.9 million in special charges incurred during the year ended August 31, 2023 to the ABL segment; the remaining amounts of the fiscal 2023 charge were not allocated to a segment. We recorded no special charges during the year ended August 31, 2022. Special charges during the year ended August 31, 2021 of $3.3 million were not allocated to a segment.\nAlso beginning in fiscal 2023, we allocated certain working capital assets and capital expenditures to our segments primarily to assess each segment's contribution to our consolidated operating cash flows and capital expenditures. Segment assets include accounts receivable and inventory. Unallocated assets are presented in corporate as a reconciling item to our total consolidated assets. We have restated prior periods to reflect allocated assets and capital expenditures by segment at August 31, 2022 and 2021.\nThe following table presents financial information by operating segment for the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nNet sales:\nABL $ 3,722.8 $ 3,810.1 $ 3,287.3\nISG 252.7 216.1 190.0\nEliminations(1)\n(23.3) (20.1) (16.3)\nTotal $ 3,952.2 $ 4,006.1 $ 3,461.0\nOperating profit (loss):\nABL(2)\n$ 509.5 $ 545.6 $ 476.2\nISG 32.1 22.7 9.9\nUnallocated corporate amounts (68.2) (58.6) (58.5)\nTotal $ 473.4 $ 509.7 $ 427.6\nDepreciation and amortization:\nABL $ 77.4 $ 79.3 $ 84.3\nISG 14.4 14.4 14.7\nUnallocated corporate amounts 1.4 1.1 1.1\nTotal $ 93.2 $ 94.8 $ 100.1\nSegment assets:\nABL $ 870.1 $ 1,097.8 $ 925.3\nISG 53.7 53.8 45.2\nUnallocated corporate amounts 2,484.7 2,328.6 2,604.6\nTotal $ 3,408.5 $ 3,480.2 $ 3,575.1\nCapital expenditures:\nABL $ 59.3 $ 51.7 $ 42.9\nISG 3.5 2.6 0.8\nUnallocated corporate amounts 3.9 2.2 0.1\nTotal $ 66.7 $ 56.5 $ 43.8\n____________________________\n(1) These amounts represent intersegment sales. Profit on these sales eliminates within gross profit on a consolidated basis.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table reconciles operating profit by segment to income before income taxes (in millions):\nYear Ended August 31,\n2023 2022 2021\nOperating profit - ABL $ 509.5 $ 545.6 $ 476.2\nOperating profit - ISG 32.1 22.7 9.9\nUnallocated corporate amounts (68.2) (58.6) (58.5)\nOperating profit 473.4 509.7 427.6\nInterest expense, net 18.9 24.9 23.2\nMiscellaneous expense (income), net 7.8 (9.1) 8.2\nIncome before income taxes $ 446.7 $ 493.9 $ 396.2\nDuring the fourth quarter of fiscal 2023, we recognized charges within our ABL segment of $14.0 million for trade name impairments, $4.1 million for employee severance costs, and $13.0 million for the collectability of a supplier warranty obligation owed to us for components we used in products manufactured and sold between 2017 and 2019.\nNote 10 - Revenue Recognition\nWe recognize revenue when we transfer control of goods and services to our customers. Revenue is measured as the amount of consideration we expect to receive in exchange for goods and services and is recognized net of rebates, sales incentives, product returns, and discounts to customers. We allocate the expected consideration to be collected to each distinct performance obligation identified in a sale based on its standalone selling price. Sales and use taxes collected on behalf of governmental authorities are excluded from revenues.\nPayment is generally due and received within 60 days from the point of sale. In some instances, such as for software as a service agreements, payment is made prior to the transfer of control of goods and services. Payment terms generally do not extend beyond one year, and we apply the significant financing component practical expedient within ASC Topic 606, Revenue from Contracts with Customers (ASC 606). Accruals for cash discounts to customers are estimated using the expected value method based on historical experience and are recorded as a reduction to sales.\nOur standard terms and conditions of sale generally allow for the return of certain products within four months of the date of shipment. We also provide for limited product return rights to certain distributors and other customers, primarily for slow moving or damaged items subject to certain defined criteria. The limited product return rights generally allow customers to return resalable products purchased within a specified time period and subject to certain limitations, including, at times, when accompanied by a replacement order of equal or greater value. At the time revenue is recognized, we record a refund liability for the expected value of future returns primarily based on historical experience, specific notification of pending returns, or contractual terms with the respective customers. Although historical product returns generally have been within expectations, there can be no assurance that future product returns will not exceed historical amounts. A significant increase in product returns could have a material adverse impact on our operating results in future periods.\nRefund liabilities recorded under ASC 606 relating to rights of return, cash discounts, and other miscellaneous credits to customers were $25.6 million and $28.0 million as of August 31, 2023 and 2022, respectively, and are reflected within Other accrued liabilities on the Consolidated Balance Sheets. Additionally, we recorded right of return assets for products expected to be returned to our distribution centers, which are included within Prepayments and other current assets on the Consolidated Balance Sheets. Such assets totaled $4.9 million and $3.7 million as of August 31, 2023 and 2022, respectively.\nWe also maintain one-time and ongoing promotions with our customers, which may include rebate, sales incentive, marketing, and trade-promotion programs with certain customers that require us to estimate and accrue the expected costs of such programs. These arrangements may include volume rebate incentives, cooperative marketing programs, merchandising of our products, introductory marketing funds for new products, and other trade-promotion activities conducted by the customer. Costs associated with these programs are generally estimated based on the most likely amount expected to be settled based on the context of the individual contract and are reflected within the Consolidated Statements of Comprehensive Income in accordance with ASC 606, which in most instances requires such costs to be recorded as reductions of revenue. Amounts due to our customers\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nassociated with these programs totaled $31.6 million and $40.7 million as of August 31, 2023 and 2022, respectively, and are reflected within Other accrued liabilities on the Consolidated Balance Sheets.\nCosts to obtain and fulfill contracts, such as sales commissions, are generally short-term in nature and are generally expensed as incurred.\nNature of Goods and Services\nProducts\nSubstantially all of the revenues for the periods presented were generated from short-term contracts with our customers to deliver only tangible goods such as luminaires, lighting controls, and controls for various building systems. We record revenue from these contracts when the customer obtains control of those goods. For sales designated free on board shipping point, control is transferred and revenue is recognized at the time of shipment. For sales designated free on board destination, customers take control and revenue is recognized when a product is delivered to the customers delivery site.\nProfessional Services\nWe collect fees associated with training, installation, and technical support services, primarily related to the set up of our lighting and building technology solutions. We recognize revenue for these one-time services at the time the service is performed. We also sell certain service-type warranties that extend coverages for products beyond their base warranties. We account for service-type warranties as distinct performance obligations and recognize revenue for these contracts ratably over the life of the additional warranty period. We allocate transaction price to our service-type warranties largely based on expectations of cost plus margin based on our estimate of future claims. These estimates are subject to a higher level of estimation uncertainty than other estimates, as we have less experience in costs in the extended warranty period. Claims related to service-type warranties are expensed as incurred.\nSoftware\nSoftware sales include licenses for software, data usage fees, and software as a service arrangements, which generally extend for one year or less. We recognize revenue for software based on the contractual rights provided to a customer, which typically results in the recognition of revenue ratably over the contractual service period.\nShipping and Handling Activities\nWe account for all shipping and handling activities for customers as activities to fulfill the promise to transfer products to our customers. As such, we do not consider shipping and handling activities to be separate performance obligations, and we expense these costs as incurred.\nContracts with Multiple Performance Obligations\nA small portion of our revenue was derived from the combination of any or all of our products, professional services, and software licenses. Significant judgment may be required to determine which performance obligations are distinct and should be accounted for separately. We allocate the expected consideration to be collected to each distinct performance obligation based on its standalone selling price. Standalone selling price is generally determined using a cost plus margin valuation when no observable input is available. The amount of consideration allocated to each performance obligation is recognized as revenue in accordance with the timing for products, professional services, and software as described above.\nContract Balances\nOur rights related to collections from customers are unconditional and are reflected within Accounts receivable on the Consolidated Balance Sheets. We do not have any other significant contract assets. Contract liabilities arise when we receive cash or an unconditional right to collect cash prior to the transfer of control of goods or services.\nThe amount of transaction price from contracts with customers allocated to our contract liabilities consist of the following as of the dates presented (in millions):\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAugust 31,\n2023 2022\nCurrent deferred revenues $ 14.1 $ 11.4\nNon-current deferred revenues 47.6 53.1\nCurrent deferred revenues primarily consist of software licenses as well as professional service and service-type warranty fees collected prior to performing the related service and are included within Other current liabilities on the Consolidated Balance Sheets. These services are expected to be performed within one year. Revenue earned from beginning contract balances during the year ended August 31, 2023 approximated the current deferred revenue balance at August 31, 2022.\nNon-current deferred revenues primarily consist of long-term service-type warranties, which are typically recognized ratably as revenue between five years and ten years from the date of sale, and are included within Other long-term liabilities on the Consolidated Balance Sheets.\nUnsatisfied performance obligations that do not represent contract liabilities are expected to be satisfied within one year from August 31, 2023 and consist primarily of orders for physical goods that have not yet been shipped.\nDisaggregated Revenues\nOur ABL segment's lighting and lighting controls are sold primarily through independent sales agents who cover specific geographic areas and market channels, by internal sales representatives, through consumer retail channels, directly to large corporate accounts, and through other distribution methods, including directly to OEM customers. ISG sells predominantly to system integrators. The following table shows revenue from contracts with customers by sales channel and reconciles to our segment information for the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nABL:\nIndependent sales network $ 2,671.0 $ 2,714.1 $ 2,400.5\nDirect sales network 414.4 384.2 358.1\nRetail sales 194.9 178.3 181.5\nCorporate accounts 200.3 222.7 168.7\nOEM and other 242.2 310.8 178.5\nTotal ABL 3,722.8 3,810.1 3,287.3\nISG 252.7 216.1 190.0\nEliminations (23.3) (20.1) (16.3)\nTotal $ 3,952.2 $ 4,006.1 $ 3,461.0\nNote 11 - Share-based Payments\nOmnibus Stock Compensation Incentive and Directors Equity Plans\nIn January 2022, our stockholders approved the Amended and Restated Acuity Brands, Inc. 2012 Omnibus Stock Compensation Incentive Plan (the Stock Incentive Plan), which, among other things, increased the total number of shares authorized for issuance pursuant to the Stock Incentive Plan from 2.7 million to 3.6 million, with a corresponding increase to shares available for grant. The Compensation and Management Development Committee of the Board of Directors (the Compensation Committee\") is authorized to issue awards consisting of incentive and non-qualified stock options, stock appreciation rights, restricted stock awards, restricted stock units, performance stock awards, performance stock units, stock bonus awards, and cash-based awards to eligible employees, non-employee directors, and outside consultants.\nShares available for grant under the Stock Incentive Plan were approximately 1.0 million, 1.1 million, and 0.3 million at August 31, 2023, 2022, and 2021, respectively. Any shares subject to an award under the Stock Incentive Plan\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nthat are forfeited, canceled, expired, or settled for cash will be available for future grant under the Stock Incentive Plan.\nOur share-based payment awards are valued based on their grant date fair values as described further below. We recognize compensation cost for share-based payment transactions in accordance with ASC 718. For most of our awards, compensation cost is recognized on a straight-line basis over the award's requisite service period. We apply the accelerated attribution method in certain circumstances, such as when a performance stock unit is subject to graded vesting. For awards subject to a market condition, we consider both actual and derived service periods, as well as the expected performance period, to determine the appropriate compensation recognition method.\nCompensation expense recognized related to the awards under the current and prior equity incentive plans during the periods presented is summarized as follows (in millions):\nYear Ended August 31,\n2023 2022 2021\nRestricted stock awards and units $ 19.6 $ 17.2 $ 15.1\nPerformance stock units 15.2 9.9 6.8\nStock options 5.7 8.8 9.2\nDirector stock units 1.5 1.5 1.4\nTotal share-based payment expense $ 42.0 $ 37.4 $ 32.5\nRestricted Stock\nAs of August 31, 2023, we had approximately 0.3 million shares outstanding of restricted stock to officers, directors, and other key employees under the Stock Incentive Plan. Grants awarded prior to fiscal 2022 vest primarily over a four-year period, and grants awarded beginning in fiscal 2022 vest primarily over a three-year period. Our restricted stock grants are valued at the closing stock price on the date of the grant.\nActivity related to restricted stock awards during the periods presented was as follows (in millions, except per share data):\nNumber of\nShares Weighted Average\nGrant Date\nFair Value Per\nShare\nOutstanding at August 31, 2020 0.4 $ 134.68\nGranted 0.2 $ 108.79\nVested (0.1) $ 150.44\nForfeited (0.1) $ 116.33\nOutstanding at August 31, 2021 0.4 $ 116.77\nGranted 0.1 $ 204.36\nVested (0.1) $ 122.27\nForfeited (0.1) $ 131.08\nOutstanding at August 31, 2022 0.3 $ 144.51\nGranted 0.2 $ 175.23\nVested (0.1) $ 140.85\nForfeited (0.1) $ 163.37\nOutstanding at August 31, 2023 0.3 $ 159.33\n___________________________\n* Represents shares of less than 0.1 million.\nAs of August 31, 2023, there was $31.8 million of total unrecognized compensation cost related to unvested restricted stock, which is expected to be recognized over a weighted-average period of 1.3 years. The total fair\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nvalue of stock vested during the years ended August 31, 2023, 2022, and 2021 was approximately $19.9 million, $16.4 million, and $19.5 million, respectively.\nPerformance Stock Units\nAs of August 31, 2023, we had approximately 0.2 million performance stock units outstanding to officers, directors, and other key employees under the Stock Incentive Plan. Our performance stock units vest primarily over a three-year period.\nFor most of these grants, the actual number of performance stock units earned for these awards will be determined at the end of the related performance period based on the level of achievement of established performance thresholds. Such grants are valued at the closing stock price of the grant. We recognize compensation expense for these grants proportionately over the requisite service period for each employee when it becomes probable that the performance metric will be satisfied.\nA small subset of our performance stock units granted in fiscal 2023 have a payout based on a total shareholder return relative to a peer group index over a three-year period. These awards are valued using a Monte-Carlo simulation and are expensed over the longer of the requisite service period and the derived service period. Stock compensation may be accelerated if a market condition is met prior to the derived service period lapsing. All inputs into the Monte Carlo simulation are estimates made at the time of grant, which are summarized in the table below. Actual realized value of each award could materially differ from these estimates, without impact to future reported net income. Dividends were assumed to be reinvested on the ex-dividend date for us and peer companies. Expected volatility was based on historical volatility of our stock as well as our peer group. The risk-free interest rate was based on the U.S. Treasury yield consistent with the derived performance period.\nDividend yield -%\nExpected volatility 46.7%\nRisk-free interest rate 4.5%\nFair value of awards $254.19\nActivity related to performance stock units during the periods presented was as follows (in millions, except per share data):\nNumber of\nShares Weighted Average\nGrant Date\nFair Value Per\nShare\nOutstanding at August 31, 2020 0.1 $ 124.29\nGranted 0.1 $ 91.34\nForfeited - * $ 104.34\nOutstanding at August 31, 2021 0.2 $ 109.99\nGranted - * $ 207.02\nForfeited - * $ 113.51\nOutstanding at August 31, 2022 0.2 $ 145.46\nGranted 0.1 $ 186.78\nVested (0.1) $ 124.29\nForfeited - * $ 195.67\nOutstanding at August 31, 2023 0.2 $ 171.01\n___________________________\n* Represents shares of less than 0.1 million.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAs of August 31, 2023 there was $11.7 million of total unrecognized compensation cost related to unvested performance stock units. This cost is expected to be recognized over a weighted-average period of approximately 1.4 years. The total fair value of performance units vested during the year ended August 31, 2023 was approximately $11.5 million. No awards vested during the years ended August 31, 2022 or 2021, respectively.\nStock Options\nAs of August 31, 2023, we had approximately 1.0 million options outstanding to officers as well as other key current and former employees under the Stock Incentive Plan, all of which were granted in previous fiscal years. Of these options 0.3 million were granted in fiscal 2021 and become exercisable over a four-year period. These options are also subject to a market condition (the \"Market Options\"). Options issued under the Stock Incentive Plan are generally granted with an exercise price equal to the fair market value of our stock on the date of grant, but never less than the fair market value on the grant date, and expire 10 years from the date of grant.\nThe fair value of each Market Option was estimated on the date of grant using the Monte Carlo simulation model. The dividend yield was calculated based on annual dividends paid and the trailing 12-month average closing stock price at the time of grant. Expected volatility was based on historical volatility of our stock, calculated using the most recent time period equal to the expected life of the options. The risk-free interest rate was based on the U.S. Treasury yield for a term equal to the contractual term for the Market Options. The expected life of the Market Options is based on projected exercise dates resulting from the Monte Carlo simulation for each award tranche. All inputs noted above are estimates made at the time of grant. All inputs into the Monte Carlo simulation are estimates made at the time of grant. Actual realized value of each option grant could materially differ from these estimates, without impact to future reported net income.\nThe following weighted average assumptions were used to estimate the fair value of the stock options granted in the fiscal year presented:\nMarket Options\nDividend yield 0.5%\nExpected volatility 36.5%\nRisk-free interest rate 0.7%\nExpected life of options 8 years\nWeighted-average fair value of options $40.45\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nStock option activity during the periods presented was as follows:\nOutstanding Exercisable\nNumber of\nOptions\n(in millions) Weighted Average\nExercise Price Number of\nOptions\n(in millions) Weighted Average\nExercise Price\nOutstanding at August 31, 2020 0.9 $ 133.19 0.4 $ 151.07\nGranted 0.3 $ 108.96\nExercised - * $ 108.58\nOutstanding at August 31, 2021 1.2 $ 127.98 0.5 $ 142.36\nExercised (0.1) $ 88.94\nOutstanding at August 31, 2022 1.1 $ 132.50 0.6 $ 143.15\nExercised - * $ 126.92\nForfeitures (0.1) $ 227.15\nOutstanding at August 31, 2023 1.0 $ 131.81 0.9 $ 135.91\nRange of option exercise prices:\n$100.00 - $160.00 (average life - 6.2 years)\n0.8 $ 119.24 0.7 $ 121.22\n$160.01 - $210.00 (average life - 2.2 years)\n0.1 $ 207.80 0.1 $ 207.80\n$210.01 - $239.76 (average life - 3.1 years)\n0.1 $ 239.76 0.1 $ 239.76\n___________________________\n* Represents amounts of less than 0.1 million.\nThe total intrinsic value of options exercised during the years ended August 31, 2023, 2022, and 2021 was approximately $0.5 million, $14.0 million, and $1.2 million, respectively. As of August 31, 2023, the total intrinsic value of options outstanding was $37.9 million, the total intrinsic value of options expected to vest was $8.3 million, and the total intrinsic value of options exercisable was $29.6 million. As of August 31, 2023, there was $3.2 million of total unrecognized compensation cost related to unvested options. This cost is expected to be recognized over a weighted-average period of approximately 1.2 years.\nEmployee Deferred Stock Units\nWe previously allowed employees to defer a portion of restricted stock awards granted in fiscal 2003 and fiscal 2004 into the SDSP as stock units. The stock units are payable in shares of stock at the time of distribution from the SDSP. As of August 31, 2023, approximately 4,000 fully vested stock units remain deferred, but undistributed, under the Stock Incentive Plan. There was no compensation expense related to these stock units during fiscal years 2023, 2022, and 2021.\nDirector Deferred Stock Units\nIn January 2022, the total remaining shares available for issuance under the Director Plan were transferred into the Stock Incentive Plan. As of August 31, 2023, approximately 45,000 stock units were deferred but undistributed under the Director Plan.\nEmployee Stock Purchase Plan\nEmployees are able to purchase, through payroll deduction, common stock at a 5% discount on a monthly basis. There were 1.5 million shares of our common stock reserved for purchase under the plan, of which approximately 1.0 million shares remain available as of August 31, 2023. Employees may participate at their discretion.\nNote 12 - Pension and Defined Contribution Plans\nCompany-sponsored Pension Plans\nWe have several pension plans, both qualified and non-qualified, covering certain hourly and salaried employees.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nBenefits paid under these plans are based generally on employees years of service and/or compensation during the final years of employment. We historically have made at least the minimum annual contributions to the plans to the extent indicated by actuarial valuations and statutory requirements. Plan assets are invested primarily in fixed income and equity securities. Current period net actuarial gains in our projected benefit obligation primarily reflect an increase in the discount rate from our prior year valuation.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following tables reflect the status of our domestic (U.S.-based) and international pension plans as of the dates presented (in millions):\nDomestic Plans International Plans\nAugust 31, August 31,\n2023 2022 2023 2022\nChange in benefit obligation:\nBenefit obligation at beginning of year $ 176.0 $ 224.7 $ 31.5 $ 52.6\nService cost 3.8 4.4 0.8 0.4\nInterest cost 7.4 5.3 1.6 0.9\nActuarial gains (16.2) (43.1) (1.2) (17.1)\nBenefits paid (11.2) (15.3) (1.9) (2.1)\nOther - - 3.8 (3.2)\nBenefit obligation at end of year 159.8 176.0 34.6 31.5\nChange in plan assets:\nFair value of plan assets at beginning of year 141.5 182.6 28.5 42.2\nActual return on plan assets (1.3) (33.6) (5.2) (11.6)\nEmployer contributions 3.7 7.8 7.9 3.0\nBenefits paid (11.2) (15.3) (1.9) (2.1)\nOther - - 2.8 (3.0)\nFair value of plan assets at end of year 132.7 141.5 32.1 28.5\nFunded status at the end of year $ (27.1) $ (34.5) $ (2.5) $ (3.0)\nAmounts recognized in the consolidated balance sheets consist of:\nNon-current assets $ 10.1 $ 7.6 $ 2.3 $ 0.4\nCurrent liabilities (3.4) (3.9) (0.2) (0.2)\nNon-current liabilities (33.8) (38.2) (4.6) (3.2)\nNet amount recognized in consolidated balance sheets $ (27.1) $ (34.5) $ (2.5) $ (3.0)\nAccumulated benefit obligation $ 158.9 $ 175.3 $ 31.9 $ 31.3\nPre-tax amounts in accumulated other comprehensive loss:\nPrior service cost $ (0.1) $ (2.7) $ (0.1) $ (0.1)\nNet actuarial loss (44.3) (54.2) (13.4) (6.5)\nAmounts in accumulated other comprehensive loss\n$ (44.4) $ (56.9) $ (13.5) $ (6.6)\nPensions plans in which benefit obligation exceeds plan assets:\nProjected benefit obligation $ 37.2 $ 42.1 $ 5.6 $ 3.4\nAccumulated benefit obligation 36.3 41.4 3.5 2.3\nPlan assets - - 0.8 -\nPensions plans in which plan assets exceed benefit obligation:\nProjected benefit obligation $ 122.6 $ 133.9 $ 29.0 $ 28.1\nAccumulated benefit obligation 122.6 133.9 28.4 29.0\nPlan assets 132.7 141.5 31.3 28.5\nService cost of net periodic pension cost is allocated between Cost of products sold, and may be capitalized into inventory as labor costs, and Selling, distribution, and administrative expenses in the Consolidated Statements of Comprehensive Income based on the function of the employee's services. All other components of net periodic pension cost are included within Miscellaneous (income) expense, net in the Consolidated Statements of Comprehensive Income. We utilize a corridor approach to amortize cumulative unrecognized actuarial gains or losses over either the average expected future service of active participants or average life expectancy of plan participants based on each plans composition. The corridor is determined as the greater of the excess of 10% of plan assets or the projected benefit obligation at each valuation date. Amounts related to prior service cost are amortized over the average remaining expected future service period for active participants in each plan.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNet periodic pension cost during the periods presented included the following components before tax (in millions):\nDomestic Plans International Plans\n2023 2022 2021 2023 2022 2021\nService cost $ 3.8 $ 4.4 $ 4.6 $ 0.8 $ 0.4 $ 0.3\nInterest cost 7.4 5.3 5.3 1.6 0.9 0.9\nExpected return on plan assets (7.5) (11.2) (11.0) (2.1) (2.6) (2.3)\nAmortization of prior service cost 2.6 2.9 2.9 - - -\nSettlement - 0.4 3.9 - - -\nRecognized actuarial loss 2.4 2.4 4.1 0.6 0.9 1.4\nNet periodic pension cost $ 8.7 $ 4.2 $ 9.8 $ 0.9 $ (0.4) $ 0.3\nWeighted average assumptions used in computing the benefit obligation are as follows:\nDomestic Plans International Plans\n2023 2022 2023 2022\nDiscount rate 5.1 % 4.4 % 5.9 % 4.9 %\nRate of compensation increase 5.0 % 5.0 % 3.5 % 3.5 %\nWeighted average assumptions used in computing net periodic pension cost are as follows:\nDomestic Plans International Plans\n2023 2022 2021 2023 2022 2021\nDiscount rate 4.4 % 2.4 % 2.2 % 4.9 % 1.9 % 1.9 %\nExpected return on plan assets 5.5 % 6.3 % 6.8 % 6.4 % 6.4 % 6.5 %\nRate of compensation increase 5.0 % 5.0 % 5.0 % 3.5 % 3.4 % 3.4 %\nIt is our policy to adjust, on an annual basis, the discount rate used to determine the projected benefit obligation to approximate rates on high-quality, long-term obligations based on our estimated benefit payments available as of the measurement date. We use published yield curves to assist in the development of our discount rates. We estimate that a 100 basis point increase in the discount rate would reduce net periodic pension cost approximately $0.5 million for the domestic plans and $0.6 million for the international plans. The expected return on plan assets is derived primarily from a periodic study of long-term historical rates of return on the various asset classes included in our targeted pension plan asset allocation as well as future expectations. We estimate that each 100 basis point reduction in the expected return on plan assets would result in additional net periodic pension cost of $1.4 million and $0.3 million for domestic plans and international plans, respectively. We also evaluate the rate of compensation increase annually and adjust if necessary.\nOur investment objective for domestic plan assets is to earn a rate of return sufficient to exceed the long-term growth of the plans liabilities without subjecting plan assets to undue risk. The plan assets are invested primarily in high quality debt and equity securities. We conduct a periodic strategic asset allocation study to form a basis for the allocation of pension assets between various asset categories. Specific allocation percentages are assigned to each asset category with minimum and maximum ranges established for each. The assets are then managed within these ranges. At August 31, 2023, the U.S. targeted asset allocation was 20% equity securities, 75% fixed income securities, and 5% real estate securities. Our investment objective for the international plan assets is also to add value by exceeding the long-term growth of the plans liabilities. At August 31, 2023, the international asset target allocation approximated 20% equity securities, 30% fixed income securities, and 50% multi-strategy investments.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOur pension plan asset allocation by asset category as of the dates presented is as follows:\n% of Plan Assets\nDomestic Plans International Plans\n2023 2022 2023 2022\nEquity securities 18.3 % 31.6 % 17.6 % 16.8 %\nFixed income securities 75.0 % 61.2 % 53.3 % 22.8 %\nMulti-strategy investments - % - % 29.1 % 60.4 %\nReal estate 6.7 % 7.2 % - % - %\nTotal 100.0 % 100.0 % 100.0 % 100.0 %\nOur pension plan assets are stated at fair value based on quoted market prices in an active market, quoted redemption values, or estimates based on reasonable assumptions as of the most recent measurement period. See the Fair Value Measurements footnote for a description of the fair value guidance. No transfers between the levels of the fair value hierarchy occurred during the current fiscal period. In the event of a transfer in or out of a level within the fair value hierarchy, the transfers would be recognized on the date of occurrence. Certain pension assets valued at net asset value (NAV) per share as a practical expedient are excluded from the fair value hierarchy. Investments in pension plan assets as of August 31, 2023 are described in further detail below.\nShort-term Fixed Income Investments\nShort-term investments consist of money market funds, which are valued at the daily closing price as reported by the relevant fund (Level 1).\nMutual Funds\nMutual funds held by the domestic plans are open-end mutual funds that are registered with the Securities and Exchange Commission (SEC) and seek to either replicate or outperform a related index. These funds are required to publish their daily net asset value and to transact at that price. The mutual funds held by the domestic plans are deemed to be actively traded (Level 1).\nCollective Trust\nThe collective trust seeks to outperform the overall small-cap stock market and is comprised primarily of small-cap equity securities with quoted prices in active markets for identical investments. The value of this fund is calculated on each business day based on its daily net asset value; however, the collective trust is not deemed to be actively traded (Level 2).\nFixed Income Investments\nThe fixed income investment seeks to maximize total return by investing primarily in a diversified portfolio of investment-grade fixed income securities, primarily publicly traded corporate bonds as well as U.S. government and municipal bonds. The investment is valued on each business day based on the values of the underlying holdings and is not actively traded (Level 2).\nU.S. Treasury Investments\nThe domestic plans hold several fixed-income U.S. Treasury securities that are valued based on discounted future cash flows using rates currently available for debt of similar terms and maturity (Level 2)\nReal Estate Fund\nThe real estate fund invests primarily in commercial real estate and includes mortgage loans that are backed by the associated property's investment objective. The fund seeks real estate returns, risk, and liquidity appropriate to a core fund. The fund also seeks to provide current income with the potential for long-term capital appreciation. This investment is valued based on the NAV per share, without further adjustment. The NAV, as provided by the fund's trustee, is used as a practical expedient to estimate fair value and is therefore excluded from the fair value\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nhierarchy. NAV is based on the fair value of the underlying investments. Investors may request to redeem all or any portion of their shares on a quarterly basis. Each investor must provide a written redemption request at least sixty days prior to the end of the quarter for which the request is to be effective. If insufficient funds are available to honor all redemption requests at any point in time, available funds will be allocated pro-rata based on the total number of shares held by each investor. All decisions regarding whether to honor redemption requests are made by the funds board of directors.\nThe following tables present the fair value of the domestic pension plan assets by major category as of the dates presented (in millions):\nFair Value Measurements\nFair Value\nas of Quoted Market\nPrices in Active\nMarkets for\nIdentical Assets Significant\nOther\nObservable\nInputs Significant\nUnobservable\nInputs\nAugust 31, 2023 (Level 1) (Level 2) (Level 3)\nAssets included in the fair value hierarchy:\nFixed-income investments $ 58.2 $ - $ 58.2 $ -\nUS Treasury investments 36.9 - 36.9 -\nMutual funds:\nDomestic large cap equity fund 13.0 13.0 - -\nForeign equity fund 6.5 6.5 - -\nCollective trust: Domestic small cap equities 4.8 - 4.8 -\nShort-term fixed income investments 4.4 4.4 - -\nTotal assets in the fair value hierarchy 123.8\nAssets calculated at net asset value:\nReal estate fund 8.9\nTotal assets at net asset value 8.9\nTotal assets at fair value $ 132.7\nFair Value Measurements\nFair Value\nas of Quoted Market\nPrices in Active\nMarkets for\nIdentical Assets Significant\nOther\nObservable\nInputs Significant\nUnobservable\nInputs\nAugust 31, 2022 (Level 1) (Level 2) (Level 3)\nAssets included in the fair value hierarchy:\nMutual funds:\nDomestic large cap equity fund $ 23.7 $ 23.7 $ - $ -\nForeign equity fund 12.6 12.6 - -\nCollective trust: Domestic small cap equities 8.4 - 8.4 -\nShort-term fixed income investments 2.1 2.1 - -\nTotal assets in the fair value hierarchy 46.8\nAssets calculated at net asset value:\nFixed-income investments 84.5\nReal estate fund 10.2\nTotal assets at net asset value 94.7\nTotal assets at fair value $ 141.5\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nInternational Plan Investments\nThe international plans' assets consist primarily of funds invested in equity securities, multi-strategy investments, and fixed income investments. These securities are calculated using the values of the underlying holdings (i.e. significant observable inputs) but do not have quoted prices in active markets (Level 2). The short-term fixed income investments represents cash and cash equivalents held by the funds at fiscal year end (Level 1). The following tables present the fair value of the international pension plan assets by major category as of the dates presented (in millions):\nFair Value Measurements\nFair Value\nas of Quoted Market\nPrices in Active\nMarkets for\nIdentical Assets Significant\nOther\nObservable\nInputs Significant\nUnobservable\nInputs\nAugust 31, 2023 (Level 1) (Level 2) (Level 3)\nAssets included in the fair value hierarchy:\nEquity securities $ 5.2 $ - $ 5.2 $ -\nShort-term fixed income investments 7.1 7.1 - -\nMulti-strategy investments 11.0 - 11.0 -\nFixed-income investments 8.8 - 8.8 -\nTotal assets at fair value $ 32.1\nFair Value Measurements\nFair Value\nas of Quoted Market\nPrices in Active\nMarkets for\nIdentical Assets Significant\nOther\nObservable\nInputs Significant\nUnobservable\nInputs\nAugust 31, 2022 (Level 1) (Level 2) (Level 3)\nAssets included in the fair value hierarchy:\nEquity securities $ 4.8 $ - $ 4.8 $ -\nShort-term fixed income investments 0.3 0.3 - -\nMulti-strategy investments 17.2 - 17.2 -\nFixed-income investments 6.2 - 6.2 -\nTotal assets at fair value $ 28.5\nWe do not expect to contribute to the domestic qualified plans in fiscal 2024 based on the funded status of the plans as well as current legal minimum funding requirements. We expect to contribute approximately $0.3 million during fiscal 2024 to our international defined benefit plans. These amounts are based on the total contributions required during fiscal 2024 to satisfy current legal minimum funding requirements for qualified plans and estimated benefit payments for non-qualified plans.\nBenefit payments are made primarily from funded benefit plan trusts. Benefit payments are expected to be paid as follows during the years ending August 31 (in millions):\nDomestic Plans International Plans\n2024 $ 11.7 $ 1.7\n2025 12.5 1.8\n2026 14.2 1.9\n2027 13.2 2.1\n2028 12.4 2.3\n2029-2033 62.3 15.0\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nMulti-employer Pension Plans\nWe have contributed to two multi-employer defined benefit pension plans under the terms of collective-bargaining agreements that cover certain of our union-represented employees. The risks of participating in these multi-employer plans are different from single-employer plans in the following aspects:\nAssets contributed to the multi-employer plan by one employer may be used to provide benefits to employees of other participating employers.\nIf a participating employer stops contributing to the plan, the unfunded obligations of the plan may be shared by the remaining participating employers.\nIf a participating employer chooses to stop participating in some of its multi-employer plans, the employer may be required to pay those plans an amount based on the underfunded status of the plan, referred to as a withdrawal liability.\nOur contributions to these plans were $0.5 million for the years ended August 31, 2023 and 2022, and $0.6 million for the year ended August 31, 2021.\nDefined Contribution Plans\nWe have defined contribution plans to which both employees and we make contributions. Employer matching amounts are allocated in accordance with the participants investment elections for elective deferrals and totaled $11.1 million, $10.5 million, and $8.4 million for the years ended August 31, 2023, 2022, and 2021, respectively. At August 31, 2023, assets of the domestic defined contribution plans included shares of our common stock with a market value of approximately $6.9 million, which represented approximately 1.5% of the total fair market value of the assets in our domestic defined contribution plans.\nNote 13 - Special Charges\nDuring the year ended August 31, 2023, we recognized pre-tax special charges of $26.9 million, which primarily included impairment charges of indefinite-lived intangible assets; impairments of certain retained assets associated with our previously owned Sunoptics prismatic skylights business that were not transferred in connection with the sale; and severance and employee-related costs in connection with the Sunoptics divestiture as well as streamlining activities initiated during the fourth quarter of fiscal 2023. We recognized no special charges during the year ended August 31, 2022.\nThe details of the special charges during the periods presented are summarized as follows (in millions):\nYear Ended August 31,\n2023 2021\nTrade name impairment charges $ 14.0 $ -\nSeverance and employee-related costs 7.7 1.7\nOperating lease asset group impairment charge 4.3 -\nOther restructuring costs 0.9 1.6\nTotal special charges $ 26.9 $ 3.3\nAs of August 31, 2023, remaining accruals related to special charges totaled $5.2 million and are included in Accrued compensation in the Consolidated Balance Sheets. These amounts related to unpaid severance and employee-related costs from our fourth quarter fiscal 2023 actions.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 14 - Common Stock and Related Matters\nCommon Stock\nChanges in common stock during the periods presented were as follows (amounts and shares in millions):\nCommon Stock\nShares Amount\n(At par)\nBalance at August 31, 2020 53.9 $ 0.5\nVesting of share-based payment awards 0.1 -\nStock options exercised - * -\nBalance at August 31, 2021 54.0 0.5\nVesting of share-based payment awards 0.1 -\nStock options exercised 0.1 -\nBalance at August 31, 2022 54.2 0.5\nVesting of share-based payment awards 0.2 -\nStock options exercised - * -\nBalance at August 31, 2023 54.4 $ 0.5\n___________________________\n* Represents shares of less than 0.1 million.\nAs of August 31, 2023 and 2022, we had 23.4 million and 21.8 million of repurchased shares, respectively, recorded as treasury stock at an original repurchase cost of $2.44 billion and $2.18 billion, respectively.\nDuring fiscal 2023, we repurchased approximately 1.6 million shares of our outstanding common stock. As of August 31, 2023, the maximum number of shares that may yet be repurchased under the share repurchase program authorized by the Board equaled 1.2 million shares. We may repurchase shares of our common stock from time to time at prevailing market prices, depending on market conditions, through open market or privately negotiated transactions.\nPreferred Stock\nWe have 50 million shares of preferred stock authorized. No shares of preferred stock were issued in fiscal 2023 or 2022, and no shares of preferred stock are outstanding.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nEarnings per Share\nBasic earnings per share for the periods presented is computed by dividing net earnings available to common stockholders by the weighted average number of common shares outstanding for these periods. Diluted earnings per share is computed similarly but reflects the potential dilution that would occur if dilutive options were exercised, unvested share-based payment awards were vested, and other distributions related to deferred stock agreements were incurred. Common stock equivalents are calculated using the treasury stock method. The dilutive effects of share-based payment awards subject to market and/or performance conditions that were not met during the period are excluded from the computation of diluted earnings per share.\nThe following table calculates basic earnings per common share and diluted earnings per common share during the periods presented (in millions, except per share data):\nYear Ended August 31,\n2023 2022 2021\nNet income $ 346.0 $ 384.0 $ 306.3\nBasic weighted average shares outstanding 31.806 34.182 36.284\nCommon stock equivalents 0.358 0.463 0.270\nDiluted weighted average shares outstanding 32.164 34.645 36.554\nBasic earnings per share(1)\n$ 10.88 $ 11.23 $ 8.44\nDiluted earnings per share(1)\n$ 10.76 $ 11.08 $ 8.38\n____________________\n(1) Earnings per share is calculated using unrounded numbers. Amounts in the table may not recalculate exactly due to rounding.\nThe following table presents stock options, restricted stock awards, and performance stock units that were excluded from the diluted earnings per share calculation for the periods presented as the effect of inclusion would have been antidilutive (in millions):\nYear Ended August 31,\n2023 2022 2021\nStock options 0.1 0.1 0.8\nRestricted stock awards 0.1 0.1 - *\nPerformance stock units - * - -\n_______________________\n* Represents shares of less than 0.1 million.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 15 - Income Taxes\nWe account for income taxes using the asset and liability approach as prescribed by ASC Topic 740, Income Taxes (ASC 740). This approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns. Using the enacted tax rates in effect for the year in which the differences are expected to reverse, deferred tax liabilities and assets are determined based on the differences between the financial reporting and the tax basis of an asset or liability.\nOn August 16, 2022, the Inflation Reduction Act (IRA) was signed into law in the United States. Among other provisions, the IRA includes a 15% corporate alternative minimum tax rate applicable for our fiscal 2024 taxable year as well as a 1% federal excise tax on corporate stock repurchases made after December 31, 2022, which we account for as an increase to the cost basis of our share repurchases. The IRA has not had, and we do not expect it to have, a material impact on our financial condition, results of operations, or cash flows.\nInternal Revenue Code (IRC) Section 174 was enacted as part of the Tax Cuts and Jobs Act of 2017 (TCJA). IRC Section 174, which became effective for us during fiscal 2023, requires us to capitalize research and development expenditures and amortize them on our U.S. tax return over five or fifteen years, depending on where research is conducted. The year over year change in both our provision for current federal taxes and provision for (benefit from) deferred taxes relates principally to the application of IRC Section 174.\nThe provision for income taxes consists of the following components during the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nProvision for current federal taxes $ 105.8 $ 67.6 $ 65.4\nProvision for current state taxes 15.7 16.3 12.8\nProvision for current foreign taxes 27.0 25.4 14.4\n(Benefit from) provision for deferred taxes (47.8) 0.6 (2.7)\nTotal provision for income taxes $ 100.7 $ 109.9 $ 89.9\nThe following table reconciles the provision at the federal statutory rate to the total provision for income taxes during the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nFederal income tax computed at statutory rate $ 93.8 $ 103.7 $ 83.2\nState income tax, net of federal income tax benefit 11.4 13.5 10.7\nFederal permanent differences 2.2 (4.3) 0.6\nForeign permanent differences and rate differential 4.4 4.3 2.4\nResearch and development tax credits (8.3) (7.6) (7.6)\nUnrecognized tax benefits 1.9 2.1 0.7\nOther, net (4.7) (1.8) (0.1)\nTotal provision for income taxes $ 100.7 $ 109.9 $ 89.9\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nComponents of the net deferred income tax liabilities as of the dates presented include (in millions):\nAugust 31,\n2023 2022\nDeferred income tax liabilities:\nDepreciation $ (21.5) $ (18.6)\nGoodwill and intangibles (151.2) (154.2)\nOperating lease right of use assets (19.8) (18.3)\nOther liabilities (3.4) (7.4)\nTotal deferred income tax liabilities (195.9) (198.5)\nDeferred income tax assets:\nSelf-insurance 1.7 1.6\nPension 5.9 7.1\nDeferred compensation 23.1 22.2\nNet operating losses 6.2 5.8\nOther accruals not yet deductible 43.4 42.9\nOperating lease liabilities 22.6 20.3\nCapitalized research and development 41.5 -\nOther assets 15.4 9.3\nTotal deferred income tax assets 159.8 109.2\nValuation allowance (19.9) (11.5)\nNet deferred income tax liabilities $ (56.0) $ (100.8)\nAs of August 31, 2023, the estimated undistributed earnings from foreign subsidiaries was $255.8 million. We have recorded a deferred income tax liability of $0.7 million for certain foreign withholding taxes and U.S. taxes related to foreign earnings for which we do not assert indefinite reinvestment. With respect to unremitted earnings and original investments in foreign subsidiaries where we are continuing to assert indefinite reinvestment, any future remittances could be subject to additional foreign withholding taxes, U.S. state taxes, and certain tax impacts relating to foreign currency exchange effects. It is not practicable to estimate the amount of any unrecognized tax effects on these reinvested earnings and original investments in foreign subsidiaries. We account for the tax on Global Intangible Low-Taxed Income (GILTI) as a period cost and, therefore, do not record deferred taxes related to GILTI on our foreign subsidiaries.\nAt August 31, 2023, we had federal tax credit carryforwards of approximately $8.3 million that begin to expire in 2029, and state tax credit carryforwards of approximately $0.9 million that begin to expire in 2027. Approximately $7.6 million of the total $8.3 million in federal tax credit carryforwards are subject to a full valuation allowance as we do not expect to realize any future tax benefit. At August 31, 2023, we had federal net operating loss carryforwards of $14.4 million that begin to expire in 2029, state net operating loss carryforwards of $47.1 million that begin to expire in 2024, and foreign net operating loss carryforwards of $7.8 million that begin to expire in 2028.\nThe gross amount of unrecognized tax benefits as of August 31, 2023 and 2022 totaled $20.1 million and $19.5 million, respectively, which includes $20.1 million and $18.8 million, respectively, of net unrecognized tax benefits that, if recognized, would affect the annual effective tax rate. We recognize potential interest and penalties related to unrecognized tax benefits as a component of income tax expense; such accrued interest and penalties are not material. With few exceptions, we are no longer subject to United States federal, state, and local income tax examinations for years ended before 2018 or for foreign income tax examinations before 2018. We do not anticipate unrecognized tax benefits will significantly increase or decrease within the next 12 months.\nACUITY BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table reconciles the change in the unrecognized income tax benefit (reported in Other long-term liabilities on the Consolidated Balance Sheets) during the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nUnrecognized tax benefits balance at beginning of year $ 19.5 $ 17.7 $ 17.2\nAdditions based on tax positions related to the current year 4.3 3.5 5.2\nAdditions for tax positions of prior years 1.4 0.1 0.1\nReductions for tax positions of prior years (1.7) (0.2) (0.1)\nReductions due to settlements (0.5) - (4.6)\nReductions due to lapse of statute of limitations (2.9) (1.6) (0.1)\nUnrecognized tax benefits balance at end of year $ 20.1 $ 19.5 $ 17.7\nTotal accrued interest was $3.3 million, $2.1 million, and $2.0 million as of August 31, 2023, 2022, and 2021, respectively. There were no accruals related to income tax penalties during fiscal 2023. Interest, net of tax benefits, and penalties are included in Income tax expense within the Consolidated Statements of Comprehensive Income. We are routinely under audit from various tax jurisdictions. We do not currently anticipate material audit assessments.\nNote 16 - Supplemental Disaggregated Information\nSales of lighting, lighting controls, and building technology solutions, excluding services, accounted for approximately 99% of total consolidated net sales in fiscal 2023, 2022, and 2021. Our geographic distribution of net sales, operating profit, income before income taxes, and long-lived assets is summarized in the following table during and as of the periods presented (in millions):\nYear Ended August 31,\n2023 2022 2021\nNet sales(1):\nDomestic(2)\n$ 3,412.9 $ 3,486.4 $ 2,982.4\nInternational 539.3 519.7 478.6\nTotal $ 3,952.2 $ 4,006.1 $ 3,461.0\nOperating profit:\nDomestic(2)\n$ 382.6 $ 428.3 $ 369.9\nInternational 90.8 81.4 57.7\nTotal $ 473.4 $ 509.7 $ 427.6\nIncome before income taxes:\nDomestic(2)\n$ 367.5 $ 409.6 $ 343.7\nInternational 79.2 84.3 52.5\nTotal $ 446.7 $ 493.9 $ 396.2\nLong-lived assets(3):\nDomestic(2)\n$ 323.8 $ 325.9 $ 284.4\nInternational 107.4 73.5 76.6\nTotal $ 431.2 $ 399.4 $ 361.0\n_______________________________________\n(1)Net sales are attributed to each country based on the selling location.\n(2)Domestic amounts include amounts for U.S. based operations.\n(3)Long-lived assets include net property, plant, and equipment, operating lease right-of-use assets, and other long-term assets as reflected in the Consolidated Balance Sheets. Item 9.Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9a.Controls and Procedures.\nDisclosure controls and procedures are controls and other procedures that are designed to reasonably ensure that information required to be disclosed in the reports filed or submitted by us under the Securities Exchange Act of 1934, as amended (the Exchange Act), is recorded, processed, summarized, and reported within the time periods specified in the Securities and Exchange Commission (the SEC) rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to reasonably ensure that information required to be disclosed by us in the reports filed under the Exchange Act is accumulated and communicated to management, including the principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nAs required by SEC rules, we have evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of August 31, 2023. The scope of our efforts to comply with the SEC rules included all of our operations except for KE2 Therm Solutions, Inc. (KE2Therm), which we acquired during the year ended August 31,2023. KE2 Therm constituted less than 2% of both total assets and equity as of August 31, 2023 and less than 1% of both the Company's net sales and pre-tax income for the year ended August 31, 2023. SEC guidance permits management to omit an assessment of an acquired business' internal control over financial reporting from management's assessment of internal control over financial reporting for a period not to exceed one year from the date of the acquisition. Accordingly, management has not assessed KE2 Therm's internal control over financial reporting as of August 31, 2023. This evaluation was carried out under the supervision and with the participation of management, including the principal executive officer and principal financial officer. Based on this evaluation, which as discussed herein excluded the operations of KE2 Therm, these officers have concluded that the design and operation of our disclosure controls and procedures are effective at a reasonable assurance level as of August 31, 2023.\nHowever, because all disclosure procedures must rely to a significant degree on actions or decisions made by employees throughout the organization, such as reporting of material events, the Company and its reporting officers believe that they cannot provide absolute assurance that all control issues and instances of fraud or errors and omissions, if any, within the Company will be detected. Limitations within any control system, including our control system, include faulty judgments in decision-making or simple errors or mistakes. In addition, controls can be circumvented by an individual, by collusion between two or more people, or by management override of the control. Because of these limitations, misstatements due to error or fraud may occur and may not be detected.\nManagements annual report on our internal control over financial reporting and the independent registered public accounting firms attestation report are included in our 2023 Financial Statements in Item 8 of this Annual Report on Form 10-K, under the headings, Managements Report on Internal Control over Financial Reporting and Report of Independent Registered Public Accounting Firm as it relates to Internal Control Over Financial Reporting, respectively, and are incorporated herein by reference.\nThere were no changes in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) that occurred during our most recent quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting Item 9b.Other Information.\nOn October 26, 2023, the Company and Neil M. Ashe, the Companys President and Chief Executive Officer, entered into an amendment to Mr. Ashes Severance Agreement. The amendment modified the calculation of the minimum bonus component of severance that would be payable to Mr. Ashe on a qualifying termination of employment by replacing its reference to a specified percentage of Mr. Ashes base salary (130%) with a reference to Mr. Ashes target annual incentive bonus as in effect at the time of his termination. The foregoing description of the amendment to Mr. Ashes Severance Agreement is a summary only and is qualified in its entirety by the full text of the amendment, which is filed as Exhibit 10(iii)A (26) to this Annual Report on Form 10-K.\nItem 9c.Disclosure Regarding Foreign Jurisdictions That Prevent Inspections.\nNone.\nPART III Item 10.Directors, Executive Officers, and Corporate Governance.\nThe information required by this item, with respect to directors and corporate governance, will be included under the caption Item 1 - Election of Directors and Director Information of our proxy statement for the annual meeting of stockholders to be held January 24, 2024, to be filed with the Securities and Exchange Commission pursuant to Regulation 14A, and is incorporated herein by reference.\nThe information required by this item, with respect to executive officers, will be included under the caption Executive Officers of our proxy statement for the annual meeting of stockholders to be held January 24, 2024, to be filed with the Securities and Exchange Commission pursuant to Regulation 14A, and is incorporated herein by reference.\nThe information required by this item, with respect to the code of ethics, will be included under the captions Governance Policies and Procedures and Contacting the Board of Directors of our proxy statement for the annual meeting of stockholders to be held January 24, 2024, to be filed with the Securities and Exchange Commission pursuant to Regulation 14A, and is incorporated herein by reference. Item 11.Executive Compensation.\nThe information required by this item will be included under the captions Director Information, Board and Committees (including Compensation Committee Interlocks and Insider Participation), Compensation of Directors, Compensation Discussion and Analysis, Report of the Compensation and Management Development Committee, Fiscal 2023 Summary Compensation Table, Fiscal 2023 Grants of Plan-Based Awards, Outstanding Equity Awards at Fiscal 2023 Year-End, Option Exercises and Stock Vested in Fiscal 2023, Pension Benefits in Fiscal 2023, Fiscal 2023 Non-Qualified Deferred Compensation, Employment Arrangements, Potential Payments upon Termination, CEO Pay Ratio, and Equity Compensation Plans of our proxy statement for the annual meeting of stockholders to be held January 24, 2024, to be filed with the Securities and Exchange Commission pursuant to Regulation 14A, and is incorporated herein by reference. Item 12.Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe information required by this item will be included under the captions Equity Compensation Plans and Beneficial Ownership of the Companys Securities of our proxy statement for the annual meeting of stockholders to be held January 24, 2024, to be filed with the Securities and Exchange Commission pursuant to Regulation 14A, and is incorporated herein by reference. Item 13.Certain Relationships and Related Transactions, and Director Independence.\nThe information required by this item will be included under the captions Certain Relationships and Related Party Transactions, Director Information, and Board and Committees of our proxy statement for the annual meeting of stockholders to be held January 24, 2024, to be filed with the Securities and Exchange Commission pursuant to Regulation 14A, and is incorporated herein by reference. Item 14.Principal Accountant Fees and Services.\nThe information required by this item concerning our principal accountant will be included under the captions Audit Fees and Other Fees, Preapproval Policies and Procedures, and Report of the Audit Committee of our proxy statement for the annual meeting of stockholders to be held January 24, 2024, to be filed with the Securities and Exchange Commission pursuant to Regulation 14A, and is incorporated herein by reference.\nPART IV Item 15.Exhibits and Financial Statement Schedules.\n(a) The following documents are filed as a part of this report:\n(1)\nManagements Report on Internal Control over Financial Reporting\nReports of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of August 31, 2023 and 2022\nConsolidated Statements of Comprehensive Income for the years ended August 31, 2023, 2022, and 2021\nConsolidated Statements of Cash Flows for the years ended August 31, 2023, 2022, and 2021\nConsolidated Statements of Stockholders Equity for the years ended August 31, 2023, 2022, and 2021\nNotes to Consolidated Financial Statements\n(2) Financial Statement Schedules:\nAny of Schedules I through V not listed above have been omitted because they are not applicable or the required information is included in the consolidated financial statements or notes thereto\n(3) Exhibits filed with this report (begins on next page):\nCopies of exhibits will be furnished to stockholders upon request at a nominal fee. Requests should be sent to Acuity Brands, Inc., Investor Relations Department, 1170 Peachtree Street, N.E., Suite 1200, Atlanta, Georgia 30309\nINDEX TO EXHIBITS\nEXHIBIT 3 (a) Restated Certificate of Incorporation of Acuity Brands, Inc. (formerly Acuity Brands Holdings, Inc.), dated as of September 26, 2007.\nReference is made to Exhibit 3.1 of registrants Form 8-K as filed with the Commission on September 26, 2007, which is incorporated herein by reference.\n(b) Certificate of Amendment of Acuity Brands, Inc. (formerly Acuity Brands Holdings, Inc.), dated as of September 26, 2007.\nReference is made to Exhibit 3.2 of registrants Form 8-K as filed with the Commission on September 26, 2007, which is incorporated herein by reference.\n(c) Certificate of Amendment to the Restated Certificate of Incorporation of Acuity Brands, Inc., dated as of January 6, 2017.\nReference is made to Exhibit 3(c) of registrants Form 10-Q as filed with the Commission on January 9, 2017, which is incorporated herein by reference.\n(d) Certificate of Amendment to the Restated Certificate of Incorporation of Acuity Brands, Inc., dated as of January 7, 2021.\nReference is made to Exhibit 3(d) of registrants Form 10-Q as filed with the Commission on January 7, 2021, which is incorporated herein by reference.\n(e) Amended and Restated Bylaws of Acuity Brands, Inc., dated as of January 7, 2021.\nReference is made to Exhibit 3(e) of registrant's Form 10-Q as filed with the Commission on January 7, 2021, which is incorporated herein by reference.\nEXHIBIT 4 (a) Form of Certificate representing Acuity Brands, Inc. Common Stock.\nReference is made to Exhibit 4.1 of registrants Form 8-K as filed with the Commission on December 14, 2001, which is incorporated herein by reference.\n(b) Description of Securities.\nFiled with the Commission as part of this Form 10-K.\n(c) Indenture, dated as of November 10, 2020, between Acuity Brands Lighting, Inc. and U.S. Bank National Association, as trustee.\nReference is made to Exhibit 4.1 of registrant's Form 8-K as filed with the Commission on November 10, 2020, which is incorporated herein by reference.\n(d) First Supplemental Indenture, dated as of November 10, 2020, among Acuity Brands Lighting, Inc., Acuity Brands, Inc. and ABL IP Holding, LLC, and U.S. Bank National Association, as trustee.\nReference is made to Exhibit 4.2 of registrant's Form 8-K as filed with the Commission on November 10, 2020, which is incorporated herein by reference.\n(e) Officers Certificate, dated as of November 10, 2020, pursuant to Sections 3.01 and 3.03 of the Indenture, dated November 10, 2020, setting forth the terms of the 2.150% Senior Notes due 2030. the 2.150% Senior Notes due 2030.\nReference is made to Exhibit 4.3 of registrant's Form 8-K as filed with the Commission on November 10, 2020, which is incorporated herein by reference.\n(f) Form of 2.150% Senior Notes due 2030 (included in Exhibit 4.3).\nReference is made to Exhibit 4.3 of registrant's Form 8-K as filed with the Commission on November 10, 2020, which is incorporated herein by reference.\nEXHIBIT 10(i) (1) Five-Year Credit Agreement dated June 30, 2022.\nReference is made to Exhibit 10.1 of registrants Form 10-Q as filed with the Commission on June 30, 2022, which is incorporated herein by reference.\nEXHIBIT 10(iii)A Management Contracts and Compensatory Arrangements:\n(1) Acuity Brands, Inc. Supplemental Deferred Savings Plan.\nReference is made to Exhibit 10.14 of registrants Form 8-K as filed with the Commission on December 14, 2001, which is incorporated herein by reference.\n(2) Amendment No. 1 to Acuity Brands, Inc. Supplemental Deferred Savings Plan.\nReference is made to Exhibit 10(iii)A(2) of registrants Form 10-Q as filed with the Commission on January 14, 2003, which is incorporated by reference.\n(3) Amendment No. 2 to Acuity Brands, Inc. Supplemental Deferred Savings Plan.\nReference is made to Exhibit 10(iii)A(8) of the registrants Form 10-Q as filed with the Commission on July 14, 2003, which is incorporated by reference.\n(4) Amendment No. 3 to Acuity Brands, Inc. Supplemental Deferred Savings Plan.\nReference is made to Exhibit 10(iii)A(36) of the registrants Form 10-K as filed with the Commission on October 29, 2004, which is incorporated by reference.\n(5) Amendment No. 4 to Acuity Brands, Inc. Supplemental Deferred Savings Plan.\nReference is made to Exhibit 99.2 of registrants Form 8-K filed with the Commission on July 6, 2006, which is incorporated herein by reference.\n(6) Amendment No. 5 to Acuity Brands, Inc. Supplemental Deferred Savings Plan.\nReference is made to Exhibit 10(iii)A(6) of registrants Form 10-Q as filed with the Commission on July 10, 2007, which is incorporated herein by reference.\n(7) Amended and Restated Acuity Brands, Inc. 2005 Supplemental Deferred Savings Plan, effective as of July 1, 2019.\nReference is made to Exhibit 10(b) of the registrant's Form 10-Q as filed with the Commission on July 2, 2019, which is incorporated herein by reference.\n(8) First Amendment to the Acuity Brands, Inc. 2005 Supplemental Deferred Savings Plan, effective as of October 25, 2021\nReference is made to Exhibit 10(iii)A(14) of the registrants Form 10-K as filed with the Commission on October 27, 2021, which is incorporated herein by reference.\n(9) Acuity Brands, Inc. Nonemployee Director Deferred Compensation Plan as Amended and Restated Effective June 29, 2006.\nReference is made to Exhibit 99.1 of registrants Form 8-K filed with the Commission on July 6, 2006, which is incorporated herein by reference.\n(10) Amendment No. 2 to Acuity Brands, Inc. Nonemployee Director Deferred Compensation Plan dated October 24, 2008.\nReference is made to Exhibit 10(iii)A(86) of the registrants Form 10-K as filed with the Commission on October 27, 2008, which is incorporated herein by reference.\n(11) Amended and Restated Acuity Brands, Inc. 2011 Nonemployee Director Deferred Compensation Plan, Effective as of January 5, 2022.\nReference is made to Exhibit 10(iii)c of the registrant's Form 10-Q as filed with the Commission on January 7, 2022, which is incorporated herein by reference.\n(12) Acuity Brands, Inc. Compensation for Non-Employee Directors.\nReference is made to Exhibit 10(iii)A(12) of the registrant's Form 10-K as filed with the Commission on October 26, 2022, which is incorporated herein by reference.\n(13) Acuity Brands, Inc. Senior Management Benefit Plan.\nReference is made to Exhibit 10.16 of registrants Form 8-K as filed with the Commission on December 14, 2001, which is incorporated herein by reference.\n(14) Amendment No. 1 to Acuity Brands, Inc. Senior Management Benefit Plan.\nReference is made to Exhibit 10(iii)A(5) of registrants Form 10-Q as filed with the Commission on July 10, 2007, which is incorporated herein by reference.\n(15) Acuity Brands, Inc. Executive Benefits Trust.\nReference is made to Exhibit 10.18 of registrants Form 8-K as filed with the Commission on December 14, 2001, which is incorporated herein by reference.\n(16) Acuity Brands, Inc. Supplemental Retirement Plan for Executives.\nReference is made to Exhibit 10.19 of registrants Form 8-K as filed with the Commission on December 14, 2001, which is incorporated herein by reference.\n(17) Amendment No. 1 to Acuity Brands, Inc. Supplemental Retirement Plan for Executives.\nReference is made to Exhibit 10(iii)A(2) of the registrants Form 10-Q as filed with the Commission on April 14, 2003, which is incorporated by reference.\n(18) Acuity Brands, Inc. Benefits Protection Trust.\nReference is made to Exhibit 10.21 of registrants Form 8-K as filed with the Commission on December 14, 2001, which is incorporated herein by reference.\n(19) Acuity Brands, Inc. 2002 Supplemental Executive Retirement Plan, As Amended and Restated Effective As of July 1, 2019.\nReference is made to Exhibit 10(c) of the registrant's Form 10-Q as filed with the Commission on July 2, 2019, which is incorporated herein by reference.\n(20) Amendment No. 1 to Acuity Brands, Inc. 2002 Supplemental Executive Retirement Plan.\nReference is made to Exhibit 10(a) of registrant's Form 10-Q as filed with the Commission on January 7, 2020, which is incorporated herein by reference.\n(21) Form of Amended and Restated Change in Control Agreement entered into as of April 21, 2006.\nReference is made to Exhibit 99.1 of registrants Form 8-K filed with the Commission on April 27, 2006, which is incorporated herein by reference.\n(22) Employment Letter between Acuity Brands, Inc. and Neil M. Ashe, dated January 9, 2020\nReference is made to Exhibit 10.1 of registrants Form 8-K as filed with the Commission on January 9, 2020, which is incorporated herein by reference.\n(23) Form of Nonqualified Stock Option Award Agreement (options subject only to time-based conditions)\nReference is made to Exhibit 10.2 of registrants Form 8-K as filed with the Commission on January 9, 2020, which is incorporated herein by reference.\n(24) Form of Nonqualified Stock Option Award Agreement (options subject to time-based and share price performance conditions)\nReference is made to Exhibit 10.3 of registrants Form 8-K as filed with the Commission on January 9, 2020, which is incorporated herein by reference.\n(25) Form of Severance Agreement between Acuity Brands, Inc. and Neil M. Ashe\nReference is made to Exhibit 10.4 of registrants Form 8-K as filed with the Commission on January 9, 2020, which is incorporated herein by reference.\n(26) Amendment No. 1 to Severance Agreement between Acuity Brands, Inc. and Neil M. Ashe\nFiled with the Commission as part of this Form 10-K.\n(27) Form of Change in Control Agreement between Acuity Brands, Inc. and Neil M. Ashe\nReference is made to Exhibit 10.5 of registrants Form 8-K as filed with the Commission on January 9, 2020, which is incorporated herein by reference.\n(28) Acuity Brands, Inc. Matching Gift Program.\nFiled with the Commission as part of this Form 10-K.\n(29) Employment Letter dated November 16, 2005 between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10.1 of registrants Form 8-K filed with the Commission on November 18, 2005, which is incorporated herein by reference.\n(30) Amendment No. 1 to Acuity Brands, Inc. Amended and Restated Severance Agreement between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10(iii)A(81) of the registrants Form 10-K as filed with the Commission on October 30, 2009, which is incorporated herein by reference.\n(31) Amendment No. 2 to Acuity Brands, Inc. Amended and Restated Severance Agreement between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10 (f) of registrants Form 10-Q as filed with the Commission on March 31, 2010, which is incorporated herein by reference.\n(32) Amendment No. 3 to Acuity Brands, Inc. Amended and Restated Severance Agreement between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10(iii)A(4) of the registrant's Form 10-Q as filed with the Commission on April 2, 2014, which is incorporated herein by reference.\n(33) Amendment No. 4 to Acuity Brands, Inc. Amended and Restated Severance Agreement between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10(iii)A(46) of the registrant's Form 10-K as filed with the Commission on October 29, 2014, which is incorporated herein by reference.\n(34) Amendment No. 5 to Acuity Brands, Inc. Amended and Restated Severance Agreement between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10(iii)A(43) of the registrant's Form 10-K as filed with the Commission on October 27, 2015, which is incorporated herein by reference.\n(35) Amendment No. 6 to Acuity Brands, Inc. Amended and Restated Severance Agreement between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10(iii)A(44) of the registrant's Form 10-K as filed with the Commission on October 27, 2016, which is incorporated herein by reference.\n(36) Amendment No. 7 to Acuity Brands, Inc. Amended and Restated Severance Agreement between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10(iii)A(45) of the registrant's Form 10-K as filed with the Commission on October 26, 2017, which is incorporated herein by reference.\n(37) Amendment No. 8 to Acuity Brands, Inc. Amended and Restated Severance Agreement between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10(a) of the registrant's Form 10-Q as filed with the Commission on January 9, 2019, which is incorporated herein by reference.\n(38) Amendment No. 9 to Acuity Brands, Inc. Amended and Restated Severance Agreement between Acuity Brands, Inc. and Richard K. Reece.\nReference is made to Exhibit 10(b) of the registrant's Form 10-Q as filed with the Commission on April 3, 2019, which is incorporated herein by reference.\n(39) Acuity Brands Lighting, Inc. Severance Agreement, entered into as of March 28, 2018, by and between Acuity Brands Lighting, Inc. and Karen J. Holcom.\nReference is made to Exhibit 10(iii)A(51) of the registrant's Form 10-K as filed with the Commission on October 29, 2019, which is incorporated herein by reference.\n(40) Amendment No. 1 to Acuity Brands Lighting, Inc. Severance Agreement between Acuity Brands Lighting, Inc. and Karen J. Holcom.\nReference is made to Exhibit 10(iii)A(52) of the registrant's Form 10-K as filed with the Commission on October 29, 2019, which is incorporated herein by reference.\n(41) Amendment No. 2 to Acuity Brands Lighting, Inc. Severance Agreement between Acuity Brands Lighting, Inc. and Karen J. Holcom.\nReference is made to Exhibit 10(iii)A(53) of the registrant's Form 10-K as filed with the Commission on October 29, 2019, which is incorporated herein by reference.\n(42) Amendment No. 3 to Acuity Brands Lighting, Inc. Severance Agreement between Acuity Brands Lighting, Inc. and Karen J. Holcom.\nReference is made to Exhibit 10(a) of registrant's Form 10-Q as filed with the Commission on January 7, 2020, which is incorporated herein by reference.\n(43) Change in Control Agreement, entered into as of March 28, 2018, by and between Acuity Brands, Inc. and Karen J. Holcom.\nReference is made to Exhibit 10(iii)A(54) of the registrant's Form 10-K as filed with the Commission on October 29, 2019, which is incorporated herein by reference.\n(44) Amendment No.1 to Acuity Brands, Inc. Change in Control Agreement between Acuity Brands, Inc. and Karen J. Holcom.\nReference is made to Exhibit 10(iii)A(55) of the registrant's Form 10-K as filed with the Commission on October 29, 2019, which is incorporated herein by reference.\n(45) Change in Control Agreement dated March 28, 2018, by and between Acuity Brands, Inc. and Barry R. Goldman.\nReference is made to Exhibit 10(iii)A(81) of the registrants Form 10-K as filed with the Commission on October 23, 2020, which is incorporated herein by reference.\n(46) Amendment No. 1 to Acuity Brands, Inc. Change in Control Agreement between Acuity Brands, Inc. and Barry R. Goldman.\nReference is made to Exhibit 10(iii)A(82) of the registrants Form 10-K as filed with the Commission on October 23, 2020, which is incorporated herein by reference.\n(47) Severance Agreement dated March 28, 2020, by and between Acuity Brands, Inc. and Barry R. Goldman.\nReference is made to Exhibit 10(iii)A(83) of the registrants Form 10-K as filed with the Commission on October 23, 2020, which is incorporated herein by reference.\n(48) Amendment No. 1 to Acuity Brands, Inc. Severance Agreement between Acuity Brands, Inc. and Barry R. Goldman.\nReference is made to Exhibit 10(iii)A(84) of the registrants Form 10-K as filed with the Commission on October 23, 2020, which is incorporated herein by reference.\n(49) Amendment No. 2 to Acuity Brands, Inc. Severance Agreement between Acuity Brands, Inc. and Barry R. Goldman.\nReference is made to Exhibit 10(iii)A(85) of the registrants Form 10-K as filed with the Commission on October 23, 2020, which is incorporated herein by reference.\n(50) Amendment No. 3 to Acuity Brands, Inc. Severance Agreement between Acuity Brands, Inc. and Barry R. Goldman.\nReference is made to Exhibit 10(iii)A(86) of the registrants Form 10-K as filed with the Commission on October 23, 2020, which is incorporated herein by reference.\n(51) Amendment No. 4 to Acuity Brands, Inc. Severance Agreement between Acuity Brands, Inc. and Barry R. Goldman.\nReference is made to Exhibit 10(iii)A(80) of the registrants Form 10-K as filed with the Commission on October 27, 2021, which is incorporated herein by reference.\n(52) Change in Control Agreement dated March 2, 2020, by and between Acuity Brands, Inc. and Dianne S. Mills.\nReference is made to Exhibit 10(iii)A(87) of the registrants Form 10-K as filed with the Commission on October 23, 2020, which is incorporated herein by reference.\n(53) Severance Agreement dated March 2, 2020, by and between Acuity Brands, Inc. and Dianne S. Mills.\nReference is made to Exhibit 10(iii)A(88) of the registrants Form 10-K as filed with the Commission on October 23, 2020, which is incorporated herein by reference.\n(54) Amendment No. 1 to Acuity Brands, Inc. Severance Agreement between Acuity Brands, Inc. and Dianne S. Mills.\nReference is made to Exhibit 10(iii)A(83) of the registrants Form 10-K as filed with the Commission on October 27, 2021, which is incorporated herein by reference.\n(55) Form of Indemnification Agreement.\nReference is made to Exhibit 10.1 of registrants Form 8-K as filed with the Commission on February 9, 2010, which is incorporated herein by reference.\n(56) Form of Stock Notification and Award Agreement for stock options, effective October 24, 2013.\nReference is made to Exhibit 10(iii)A(1) of the registrant's Form 10-Q as filed with the Commission on April 2, 2014, which is incorporated herein by reference.\n(57) Form of Stock Notification and Award Agreement for stock options, effective October 27, 2014.\nReference is made to Exhibit 10(iii)A(66) of the registrant's Form 10-K as filed with the Commission on October 29, 2014, which is incorporated herein by reference.\n(58) Form of Stock Notification and Award Agreement for stock options, effective April 1, 2016.\nReference is made to Exhibit 10(iii)A(1) of the registrant's Form 10-Q as filed with the Commission on April 6, 2016, which is incorporated herein by reference.\n(59) Form of Restricted Stock Award Agreement for U.S. Grantees.\nReference is made to Exhibit 10(iii)A(70) of the registrant's Form 10-K as filed with the Commission on October 27, 2016, which is incorporated herein by reference.\n(60) Form of Restricted Stock Unit Award Agreement for Non-U.S. Grantees.\nReference is made to Exhibit 10(iii)A(72) of the registrant's Form 10-K as filed with the Commission on October 26, 2017, which is incorporated herein by reference.\n(61) Form of Nonqualified Stock Option Award Agreement.\nReference is made to Exhibit 10(iii)A(72) of the registrant's Form 10-K as filed with the Commission on October 27, 2016, which is incorporated herein by reference.\n(62) Form of Nonqualified Stock Option Award Agreement for Named Executive Officers.\nReference is made to Exhibit 10(iii)A(73) of the registrant's Form 10-K as filed with the Commission on October 27, 2016, which is incorporated herein by reference.\n(63) Amended and Restated Acuity Brands, Inc. 2012 Omnibus Stock Incentive Compensation Plan.\nReference is made to Appendix B of the registrants Proxy Statement as filed with the Commission on November 22, 2021, which is incorporated herein by reference.\n(64) Acuity Brands, Inc. 2017 Management Cash Incentive Plan.\nReference is made to Annex B of the registrants Proxy Statement as filed with the Commission on November 21, 2017, which is incorporated herein by reference.\n(65) Form of Restricted Stock Award Agreement for U.S. Employees.\nReference is made to Exhibit 10(iii)A(1) of the registrant's Form 10-Q as filed with the Commission on April 4, 2018, which is incorporated herein by reference.\n(66) Form of Restricted Stock Award Agreement for Directors.\nReference is made to Exhibit 10(iii)A(3) of the registrant's Form 10-Q as filed with the Commission on April 4, 2018, which is incorporated herein by reference.\n(67) Restricted Stock Award Agreement for Non-Employee Director.\nReference is made to Exhibit 10(iii)a of the registrant's Form 10-Q as filed with the Commission on January 7, 2022, which is incorporated herein by reference.\n(68) Deferred Stock Unit Award Agreement Non-Employee Directors.\nReference is made to Exhibit 10(iii)b of the registrant's Form 10-Q as filed with the Commission on January 7, 2022, which is incorporated herein by reference.\n(69) Acuity Brands, Inc. Amended and Restated 2012 Omnibus Stock Incentive Compensation Plan Global Performance Unit Notification and Award Agreement.\nReference is made to Exhibit 10(iii)A(93) of the registrant's Form 10-K as filed with the Commission on October 29, 2019, which is incorporated herein by reference.\n(70) Acuity Brands, Inc. Amended and Restated 2012 Omnibus Stock Incentive Compensation Plan Global Performance Unit Notification and Award Agreement.\nReference is made to Exhibit 10(c) of registrant's Form 10-Q as filed with the Commission on January 7, 2020, which is incorporated herein by reference.\n(71) Acuity Brands, Inc. Amended and Restated 2012 Omnibus Stock Incentive Compensation Plan Global Restricted Stock Unit Notification and Award Agreement.\nReference is made to Exhibit 10(iii)A(94) of the registrant's Form 10-K as filed with the Commission on October 29, 2019, which is incorporated herein by reference.\n(72) Acuity Brands, Inc. Amended and Restated 2012 Omnibus Stock Incentive Compensation Plan Global Restricted Stock Unit Notification and Award Agreement.\nReference is made to Exhibit 10(d) of registrant's Form 10-Q as filed with the Commission on January 7, 2020, which is incorporated herein by reference.\n(73) Acuity Brands, Inc. Amended and Restated 2012 Omnibus Stock Incentive Compensation Plan Global Performance Unit Notification and Award Agreement (TSR October 2022).\nReference is made to Exhibit 10(d) of registrant's Form 10-Q as filed with the Commission on January 9, 2023, which is incorporated herein by reference.\n(74) Acuity Brands, Inc. Non-Employee Director Compensation Schedule.\nReference is made to Exhibit 10 (1) of registrant's Form 10-Q as filed with the Commission on April 4, 2023, which is incorporated herein by reference.\n(75) Acuity Brands, Inc. 2005 Supplemental Deferred Savings Plan (As Amended and Restated effective March 30, 2023).\nReference is made to Exhibit 10 (2) of registrant's Form 10-Q as filed with the Commission on April 4, 2023, which is incorporated herein by reference.\n(76) Acuity Brands, Inc. Amended and Restated 2012 Omnibus Stock Incentive Compensation Plan Global Performance Unit Notification and Award Agreement (ROIC Performance Award).\nFiled with the Commission as part of this Form 10-K.\n(77) Acuity Brands, Inc. Amended and Restated 2012 Omnibus Stock Incentive Compensation Plan Global Performance Unit Notification and Award Agreement (rTSR Performance Award).\nFiled with the Commission as part of this Form 10-K.\n(78) Acuity Brands, Inc. Amended and Restated 2012 Omnibus Stock Incentive Compensation Plan Global Restricted Stock Unit Notification and Award Agreement\nFiled with the Commission as part of this Form 10-K.\n(79) Acuity Brands, Inc. Incentive-Based Compensation Recoupment Policy As Amended and Restated Effective as of October 2, 2023.\nFiled with the Commission as part of this Form 10-K.\n(80) Acuity Brands, Inc. Short-Term Incentive Plan As Amended and Restated Effective as of September 28, 2023.\nFiled with the Commission as part of this Form 10-K.\nEXHIBIT 21 List of Subsidiaries.\nFiled with the Commission as part of this Form 10-K.\nEXHIBIT 22 List of Guarantors and Subsidiary Issuers of Guaranteed Securities.\nFiled with the Commission as part of this Form 10-K.\nEXHIBIT 23 Consent of Independent Registered Public Accounting Firm.\nFiled with the Commission as part of this Form 10-K.\nEXHIBIT 24 Powers of Attorney.\nFiled with the Commission as part of this Form 10-K.\nEXHIBIT 31 (a) Certification of the Chief Executive Officer of the Company pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nFiled with the Commission as part of this Form 10-K.\n(b) Certification of the Chief Financial Officer of the Company pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nFiled with the Commission as part of this Form 10-K.\nEXHIBIT 32 (a) Certification of the Chief Executive Officer of the Company pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nFiled with the Commission as part of this Form 10-K.\n(b) Certification of the Chief Financial Officer of the Company pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nFiled with the Commission as part of this Form 10-K.\nEXHIBIT 101 .INS XBRL Instance Document The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n.SCH XBRL Taxonomy Extension Schema Document. Filed with the Commission as part of this Form 10-K.\n.CAL XBRL Taxonomy Extension Calculation Linkbase Document. Filed with the Commission as part of this Form 10-K.\n.DEF XBRL Taxonomy Extension Definition Linkbase Document. Filed with the Commission as part of this Form 10-K.\n.LAB XBRL Taxonomy Extension Label Linkbase Document. Filed with the Commission as part of this Form 10-K.\n.PRE XBRL Taxonomy Extension Presentation Linkbase Document. Filed with the Commission as part of this Form 10-K.\nEXHIBIT 104 Cover Page Interactive Data File. Formatted as Inline XBRL and contained in Exhibit 101 of this Form 10-K.\nItem 16.Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nACUITY BRANDS, INC.\nDate: October 26, 2023 By: /S/ NEIL M. ASHE\nNeil M. Ashe\nChairman, President and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ NEIL M. ASHE Chairman, Director, President and Chief Executive Officer (Principal Executive Officer) October 26, 2023\nNeil M. Ashe\n/s/ KAREN J. HOLCOM Senior Vice President and Chief Financial Officer (Principal Financial and Accounting Officer) October 26, 2023\nKaren J. Holcom\n* Director October 26, 2023\nMarcia J. Avedon, Ph.D.\n* Director October 26, 2023\nW. Patrick Battle\n* Director October 26, 2023\nMichael J. Bender\n* Director October 26, 2023\nG. Douglas Dillard, Jr.\n* Director October 26, 2023\nJames H. Hance, Jr.\n* Director October 26, 2023\nMaya Leibman\n* Director October 26, 2023\nLaura G. O'Shaughnessy\n* Director October 26, 2023\nMark J. Sachleben\n* Director October 26, 2023\nMary A. Winston\n*BY: /s/ KAREN J. HOLCOM Attorney-in-Fact October 26, 2023\nKaren J. Holcom"
}