{
    "cik": "1145255",
    "company": "HENNESSY ADVISORS INC",
    "filing_type": "10-K",
    "filing_date": "2023-12-07",
    "period_of_report": "2023-09-30",
    "sic": "6282",
    "state_of_inc": null,
    "state_location": "CA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1145255/0001437749-23-033810-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1145255/000143774923033810/hnna20230930_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1145255/0001437749-23-033810.txt",
    "filename": "1145255_10K_2023_0001437749-23-033810.htm",
    "content": "ITEM 1. BUSINESS\nGENERAL\nHennessy Advisors, Inc. (the Company, we, us, or our) is a publicly traded investment management firm whose primary business activity is providing investment advisory services to a family of 16 open-end mutual funds (collectively, the Hennessy Mutual Funds) and one exchange-traded fund (ETF) branded as the Hennessy Funds. We are committed to providing superior service to investors and employing a consistent and disciplined approach to investing based on a buy-and-hold philosophy that rejects the idea of market timing. Our goal is to provide products that investors can have confidence in, knowing their money is invested as promised and with their best interests in mind. Our firm was founded on these principles over 30 years ago, and the same principles guide us today.\nWe earn revenues primarily by providing investment advisory services to the Hennessy Funds and secondarily by providing shareholder services to investors in the Hennessy Mutual Funds. Investment advisory services include managing the composition of each funds portfolio (including the purchase, retention, and disposition of portfolio securities in accordance with each funds investment objectives, policies, and restrictions), monitoring each funds compliance with its investment objectives and restrictions and federal securities laws, monitoring the liquidity of each fund, reviewing each funds investment performance, overseeing the selection and continued employment of sub-advisors and monitoring such sub-advisors adherence to the funds investment objectives, policies, and restrictions, overseeing other service providers, maintaining in-house marketing and distribution departments, preparing and distributing regulatory reports, and overseeing distribution of the funds through third-party financial institutions. Shareholder services include maintaining a toll-free number that the current investors in the Hennessy Funds may call to ask questions about their accounts or the funds and actively participating as a liaison between investors in the Hennessy Funds and U.S. Bank Global Fund Services, the Hennessy Funds administrator. The fees we receive for investment advisory and shareholder services are calculated as a percentage of the average daily net asset values of the Hennessy Funds. Accordingly, our total revenue increases or decreases as our average assets under management rises or falls. The percentage amount of the investment advisory fees varies from fund to fund, but the percentage amount of the shareholder service fees is consistent across all Hennessy Mutual Funds.\nWe have delegated the day-to-day portfolio management responsibilities to sub-advisors, subject to our oversight, for some of the Hennessy Funds. In exchange for these sub-advisory services, we pay each sub-advisor a fee out of our own assets, which is calculated as a percentage of the average daily net asset values of the sub-advised funds. Accordingly, the sub-advisory fees we pay increase or decrease as our average assets under management in our sub-advised funds increases or decreases, respectively.\nOur average assets under management for fiscal year 2023 was $3.0 billion, and our total assets under management as of the end of fiscal year 2023 was $3.0 billion. Our business strategy centers on (i) organic growth through our marketing, sales, and distribution efforts and (ii) growth through strategic purchases of management-related assets.\nHISTORICAL CALENDAR YEAR TIMELINE\nIn February, we were founded as a California corporation under our previous name, Edward J. Hennessy, Inc., and registered as a broker-dealer with the Financial Industry Regulatory Authority.\nIn March, we launched our first mutual fund, the Hennessy Balanced Fund.\nIn October, we launched our second mutual fund, the Hennessy Total Return Fund.\nIn June, we successfully completed our first asset purchase by purchasing the assets related to the management of two mutual funds previously managed by Netfolio, Inc. (Netfolio) and changed the fund names to the Hennessy Cornerstone Growth Fund and the Hennessy Cornerstone Value Fund. The amount of the purchased assets as of the closing date totaled approximately $197 million.\nIn May, we successfully completed a self-underwritten initial public offering of our stock by raising $5.7 million at an offering price of $1.98 (HNNA.OB) and changed our firm name to Hennessy Advisors, Inc. Our total assets under management at the time of our initial public offering was approximately $358 million.\nIn September, we purchased the assets related to the management of a mutual fund previously managed by SYM Financial Corporation and reorganized the assets of such fund into the newly created Hennessy Cornerstone Mid Cap 30 Fund. The amount of the purchased assets as of the closing date was approximately $35 million.\nIn March, we purchased the assets related to the management of five mutual funds previously managed by Lindner Asset Management, Inc. and reorganized the assets of such funds into four of our existing Hennessy Funds. The amount of the purchased assets as of the closing date totaled approximately $301 million.\nIn July, we purchased the assets related to the management of a mutual fund previously managed by Landis Associates LLC and changed the fund name to the Hennessy Cornerstone Growth, Series II Fund. The amount of the purchased assets as of the closing date was approximately $299 million.\nIn November, we launched the Hennessy Micro Cap Growth Fund, LLC, a non-registered private pooled investment fund.\nIn March, we purchased the assets related to the management of two mutual funds previously managed by RBC Global Asset Management (U.S.) Inc. and reorganized the assets of such funds into the newly created Hennessy Cornerstone Large Growth Fund and the Hennessy Large Value Fund. In conjunction with the completion of the transaction, RBC Global Asset Management (U.S.) Inc. became the sub-advisor to the Hennessy Large Value Fund. The amount of the purchased assets as of the closing date totaled approximately $158 million.\nIn September, we purchased the assets related to the management of two mutual funds previously managed by SPARX Investment & Research, USA, Inc. and sub-advised by SPARX Asset Management Co., Ltd. and changed the fund names to the Hennessy Japan Fund and the Hennessy Japan Small Cap Fund. In conjunction with the completion of the transaction, SPARX Asset Management Co., Ltd. became the sub-advisor to both funds. The amount of the purchased assets as of the closing date totaled approximately $74 million.\nIn October, we reorganized the assets of the Hennessy Cornerstone Growth, Series II Fund into the Hennessy Cornerstone Growth Fund.\nIn October, we purchased the assets related to the management of 10 mutual funds previously managed by FBR Fund Advisers (the FBR Funds). We reorganized the assets of three of the FBR Funds into existing Hennessy Funds and reorganized the assets of the seven other FBR Funds into newly created series of the Hennessy Funds. In conjunction with the completion of the transaction, Broad Run Investment Management, LLC became the sub-advisor to the Hennessy Focus Fund, FCI Advisors became the sub-advisor to the Hennessy Equity and Income Fund (fixed income allocation) and the Hennessy Core Bond Fund, and The London Company of Virginia, LLC became the sub-advisor to the Hennessy Equity and Income Fund (equity allocation). The amount of the purchased assets as of the closing date was approximately $2.2 billion.\nIn December, we closed the Hennessy Micro Cap Growth Fund, LLC.\nIn April, our common stock began trading on The Nasdaq Capital Market.\nIn September, we completed a self-tender offer, under which we repurchased 1,500,000 shares of our common stock at $16.67 per share.\nIn June, we launched Institutional Class shares for the Hennessy Japan Small Cap Fund and the Hennessy Large Cap Financial Fund.\nIn September, we purchased the assets related to the management of two mutual funds previously managed by Westport Advisers, LLC and reorganized the assets of such funds into the Hennessy Cornerstone Mid Cap 30 Fund. The amount of the purchased assets as of the closing date totaled approximately $435 million.\nIn February, we liquidated the Hennessy Core Bond Fund and reorganized the Hennessy Large Value Fund into the Hennessy Cornerstone Value Fund. Additionally, for the Hennessy Technology Fund, we implemented changes to the investment strategy and the portfolio management team.\nIn March, we launched Institutional Class shares for the Hennessy Gas Utility Fund.\nIn December, we purchased the assets related to the management of two mutual funds previously managed by Rainier Investment Management, LLC (Rainier) and reorganized the assets of such funds into the Hennessy Cornerstone Large Growth Fund and the Hennessy Cornerstone Mid Cap 30 Fund. The amount of the purchased assets as of the closing date totaled approximately $122 million.\nIn January, we purchased the assets related to the management of a third mutual fund previously managed by Rainier and reorganized the assets of such fund into the Hennessy Cornerstone Mid Cap 30 Fund. The amount of the purchased assets as of the closing date totaled approximately $253 million.\nIn October, we purchased the assets related to the management of the two mutual funds previously managed by BP Capital Fund Services, LLC (\"BP Capital\") and reorganized the assets of such funds into the newly created Hennessy Energy Transition Fund and the Hennessy Midstream Fund. In connection with the transaction, BP Capital Fund Services, LLC became the sub-advisor to both funds. The amount of the purchased assets as of the closing date totaled approximately $200 million.\nDuring the year, we repurchased an aggregate of 560,734 shares of our common stock pursuant to our stock buyback program.\nIn the first three months of the year, we repurchased an aggregate of 206,109 shares of our common stock pursuant to our stock buyback program.\nIn October, we transferred listing of our common stock from The Nasdaq Capital Market to The Nasdaq Global Market. Also in October, we completed a public offering of 4.875% notes due 2026 (the 2026 Notes) in the aggregate principal amount of $40.25 million, which included the full exercise of the underwriters overallotment option.\nIn January, we mutually agreed with BP Capital to terminate the sub-advisory agreement for the Hennessy Energy Transition Fund and the Hennessy Midstream Fund and began managing such funds internally. In December, we purchased the assets related to the management of an ETF previously managed by Red Gate Advisers, LLC and reorganized the assets of such fund into the newly created Hennessy Stance ESG ETF. In connection with the transaction, Stance Capital, LLC (Stance Capital) and Vident Investment Advisory, LLC (VIA) became sub-advisors to the fund. The amount of the purchased assets as of the closing date totaled approximately $43 million.\nIn April, we signed a definitive agreement with Community Capital Management, LLC (CCM) to purchase the assets related to the management of the CCM Core Impact Equity Fund and the CCM Small/Mid-Cap Impact Value Fund (the CCM Equity Funds). Upon completion of the transaction, which is subject to the approval of the shareholders of each of the CCM Equity Funds, the assets of the CCM Equity Funds will be reorganized into the Hennessy Stance ESG ETF. In July, VIA completed an acquisition transaction that resulted in a change of control of VIA and automatic termination of our sub-advisory agreement with VIA. On the same date, we entered into a new sub-advisory agreement with Vident Advisory, LLC (Vident Advisory).\nPRODUCT INFORMATION\nInvestment Strategies of the Hennessy Funds\nWe manage 16 mutual funds and one ETF, each of which is categorized as a Domestic Equity, Multi-Asset, or Sector and Specialty product. Shares of the funds generally are available for purchase only by U.S. residents and, in certain circumstances, U.S. citizens living abroad.\nThe Hennessy Funds Family\nDomestic Equity\nMulti-Asset\nSector and Specialty\nHennessy Cornerstone Growth Fund\nHennessy Total Return Fund\nHennessy Energy Transition Fund\nHennessy Focus Fund\nHennessy Equity and Income Fund\nHennessy Midstream Fund\nHennessy Cornerstone Mid Cap 30 Fund\nHennessy Balanced Fund\nHennessy Gas Utility Fund\nHennessy Cornerstone Large Growth Fund\nHennessy Japan Fund\nHennessy Cornerstone Value Fund\nHennessy Japan Small Cap Fund\nHennessy Large Cap Financial Fund\nHennessy Small Cap Financial Fund\nHennessy Technology Fund\nHennessy Stance ESG ETF\nDomestic Equity Funds\nFive of the Hennessy Funds are categorized as Domestic Equity products. Of those five funds, four utilize a quantitative investment strategy and one is actively managed, and they all employ consistent and disciplined approaches to investing. Following is a brief description of the investment objectives and principal investment strategies of the Hennessy Funds in the Domestic Equity product category:\n●\nHennessy Cornerstone Growth Fund (Investor Class symbol HFCGX; Institutional Class symbol HICGX). The Hennessy Cornerstone Growth Fund seeks long-term growth of capital by investing in growth-oriented common stocks using a quantitative formula. From the investable common stocks of public companies in the S&P Capital IQ Database with market capitalizations exceeding $175 million, this fund invests in the 50 common stocks with the highest one-year price appreciation that also have price-to-sales ratios below 1.5, higher annual earnings than in the previous year, and positive stock price appreciation over the prior three-month and six-month periods.\n●\nHennessy Focus Fund (Investor Class symbol HFCSX; Institutional Class symbol HFCIX). The Hennessy Focus Fund seeks capital appreciation through a concentrated portfolio of approximately 20 companies that the portfolio managers believe are high-quality businesses with large growth opportunities, excellent management, low tail risk, and discount valuations. This funds holdings are conviction-weighted, with the top ten positions comprising approximately 60-80% of the funds assets.\n●\nHennessy Cornerstone Mid Cap 30 Fund (Investor Class symbol HFMDX; Institutional Class symbol HIMDX). The Hennessy Cornerstone Mid Cap 30 Fund seeks long-term growth of capital by investing in mid-cap growth-oriented common stocks using a quantitative formula. From the investable common stocks of public companies in the S&P Capital IQ Database with market capitalizations between $1 billion and $10 billion, this fund invests in the 30 common stocks with the highest one-year price appreciation that also have price-to-sales ratios below 1.5, higher annual earnings than in the previous year, and positive stock price appreciation over the prior three-month and six-month periods.\n●\nHennessy Cornerstone Large Growth Fund (Investor Class symbol HFLGX; Institutional Class symbol HILGX). The Hennessy Cornerstone Large Growth Fund seeks long-term growth of capital by investing in growth-oriented common stocks of larger companies using a quantitative formula. From the investable common stocks of public companies in the S&P Capital IQ Database, this fund invests in the 50 stocks that meet the following criteria, in the specified order: (1) above-average market capitalization; (2) a price-to-cash-flow ratio less than the median of the remaining securities; (3) positive total capital; and (4) the highest one-year return on total capital.\n●\nHennessy Cornerstone Value Fund (Investor Class symbol HFCVX; Institutional Class symbol HICVX). The Hennessy Cornerstone Value Fund seeks total return, consisting of capital appreciation and current income, by investing in larger, dividend-paying common stocks using a quantitative formula. From the investable common stocks of public companies in the S&P Capital IQ Database, this fund invests in the 50 stocks with the highest dividend yield that also have above-average market capitalizations, above-average number of shares outstanding, 12-month sales that are 50% greater than the average, and above-average cash flows.\nMulti-Asset Funds\nThree of the Hennessy Funds are categorized as Multi-Asset products. Of those three funds, two utilize a quantitative investment strategy and one is actively managed. These funds follow a more conservative investment strategy focused on generating income and providing an alternative to funds containing only equity stocks. Following is a brief description of the investment objectives and principal investment strategies of the Hennessy Funds in the Multi-Asset product category:\n●\nHennessy Total Return Fund (Investor Class symbol HDOGX). The Hennessy Total Return Fund seeks total return, consisting of capital appreciation and current income, by investing approximately 50% of its assets in the 10 highest dividend-yielding common stocks of the Dow Jones Industrial Average (known as the Dogs of the Dow) in roughly equal dollar amounts and the remaining 50% of its assets in U.S. Treasury securities with a maturity of less than one year. This fund then utilizes a borrowing strategy that allows the funds performance to approximate what it would be if the fund had an asset allocation of roughly 75% Dogs of the Dow stocks and 25% U.S. Treasury securities.\n●\nHennessy Equity and Income Fund (Investor Class symbol HEIFX; Institutional Class symbol HEIIX). The Hennessy Equity and Income Fund seeks income and long-term capital appreciation with reduced volatility of returns by investing up to 70% of its assets in common stock, preferred stock, and equity-like instruments and its remaining assets in asset-backed and mortgage-backed securities and debt instruments, including high-yield bonds.\n●\nHennessy Balanced Fund (Investor Class symbol HBFBX). The Hennessy Balanced Fund seeks a combination of capital appreciation and current income by investing approximately 50% of its assets in roughly equal dollar amounts in the Dogs of the Dow stocks but limits exposure to market risk and volatility by investing approximately 50% of its assets in U.S. Treasury securities with a maturity of less than one year.\nSector and Specialty Funds\nNine of the Hennessy Funds are categorized as Sector and Specialty products. Of those nine funds, one is designed as an index fund and the other eight are actively managed, and each focuses on a niche sector of the stock market. Following is a brief description of the investment objectives and principal investment strategies of the Hennessy Funds in the Sector and Specialty product category:\n●\nHennessy Energy Transition Fund (Investor Class symbol HNRGX; Institutional Class symbol HNRIX). The Hennessy Energy Transition Fund seeks total return by investing in companies operating in the United States across the full spectrum of the energy supply/demand value chain, including traditional upstream, midstream, and downstream energy companies, as well as renewable energy companies and energy end users. The portfolio managers use a proprietary research and investment process that involves fundamental and quantitative analysis of various macroeconomic and commodity price and other factors to select this funds investments and determine the weighting of each investment.\n●\nHennessy Midstream Fund (Investor Class symbol HMSFX; Institutional Class symbol HMSIX). The Hennessy Midstream Fund seeks capital appreciation through distribution growth and current income by investing in midstream energy infrastructure companies, including master limited partnerships, that own and operate assets used in the transporting, storing, gathering, processing, distributing, or marketing of natural gas, natural gas liquids, crude oil, refined products, coal, or electricity or that provide energy-related equipment and services. The portfolio managers combine a top-down deductive reasoning approach with a detailed bottom-up analysis of individual companies.\n●\nHennessy Gas Utility Fund (Investor Class symbol GASFX; Institutional Class symbol HGASX). The Hennessy Gas Utility Fund seeks income and capital appreciation by investing in companies that are members of the American Gas Association (AGA) in approximately the same percentage as the percentage weighting of such company in the AGA Stock Index. The AGA Stock Index is a capitalization-weighted index that consists of all member companies of the AGA whose securities are traded on a U.S. stock exchange. The index is adjusted monthly for the percentage of natural gas assets on each companys balance sheet.\n●\nHennessy Japan Fund (Investor Class symbol HJPNX; Institutional Class symbol HJPIX). The Hennessy Japan Fund seeks long-term capital appreciation by investing in equity securities of Japanese companies. Using in-depth analysis and on-site research, the portfolio managers focus on stocks with a potential value gap by screening for companies that they believe have strong businesses and management and are trading at attractive prices. The portfolio managers limit the portfolio to what they consider to be their best ideas and maintain a concentrated number of holdings.\n●\nHennessy Japan Small Cap Fund (Investor Class symbol HJPSX; Institutional Class symbol HJSIX). The Hennessy Japan Small Cap Fund seeks long-term capital appreciation by investing in equity securities of smaller Japanese companies, typically considered to be companies with market capitalizations in the bottom 20% of all publicly traded Japanese companies. Using in-depth analysis and on-site research, the portfolio managers focus on stocks with a potential value gap by screening for small-cap companies that the portfolio managers believe have strong businesses and management and are trading at attractive prices. The portfolio managers limit the portfolio to what they consider to be their best ideas and is unconstrained by its benchmarks.\n●\nHennessy Large Cap Financial Fund (Investor Class symbol HLFNX; Institutional Class symbol HILFX). The Hennessy Large Cap Financial Fund seeks capital appreciation by investing in securities of large-cap companies principally engaged in the business of providing financial services, including information technology companies that are primarily engaged in providing products or services to financial services companies.\n●\nHennessy Small Cap Financial Fund (Investor Class symbol HSFNX; Institutional Class symbol HISFX). The Hennessy Small Cap Financial Fund seeks capital appreciation by investing in securities of small-cap companies principally engaged in the business of providing financial services.\n●\nHennessy Technology Fund (Investor Class symbol HTECX; Institutional Class symbol HTCIX). The Hennessy Technology Fund seeks long-term capital appreciation by investing in securities of companies principally engaged in the research, design, development, manufacturing, or distributing of products or services in the technology industry. From the investable common stocks of public companies in the S&P Capital IQ Database with market capitalizations exceeding $175 million, this fund invests in approximately 60 stocks (weighted equally by dollar amount) that the portfolio managers believe demonstrate sector-leading cash flows and profits, a history of delivering returns in excess of cost of capital, attractive relative valuations, ability to generate cash, attractive balance sheet risk profiles, and prospects for sustainable profitability.\n●\nHennessy Stance ESG ETF (NYSE: STNC). The Hennessy Stance ESG ETF seeks long-term growth of capital by combining environmental, social, and governance (ESG) and machine learning/artificial intelligence (ML/AI) in an ETF structure. The portfolio managers seek exposure to companies that score well on ESG metrics and that the portfolio managers believe will outperform based on ML/AI models. The fund leverages optimization in an attempt to reduce portfolio level tail risk and mitigate downside losses.\nHistorical Investment Performance of the Hennessy Funds\nThe following table presents the average annualized returns for each Hennessy Fund and its relevant benchmark indices for the one-year, three-year, five-year, and ten-year (or since inception for Hennessy Funds that commenced operations less than ten years ago) periods ended September 30, 2023.\nReturns are presented net of all expenses borne by fund investors, but not net of fees waived or expenses borne by the Company. The past investment performance of the Hennessy Funds is not a guarantee of future performance, and all of the Hennessy Funds have experienced negative performance over various periods in the past and may do so again in the future.\nHennessy Cornerstone Growth Fund\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HICGX\n27.89 %\n19.23 %\n8.60 %\n9.67 %\nInvestor Class Share - HFCGX\n27.44 %\n18.83 %\n8.25 %\n9.33 %\nRussell 2000® Index (1)\n8.93 %\n7.16 %\n2.40 %\n6.65 %\nS&P 500® Index (2)\n21.62 %\n10.15 %\n9.92 %\n11.91 %\nHennessy Focus Fund*\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HFCIX\n15.99 %\n5.91 %\n5.97 %\n8.28 %\nInvestor Class Share - HFCSX\n15.57 %\n5.52 %\n5.58 %\n7.89 %\nRussell 3000® Index (3)\n20.46 %\n9.38 %\n9.14 %\n11.28 %\nRussell Midcap® Growth Index (4)\n17.47 %\n2.61 %\n6.97 %\n9.94 %\nHennessy Cornerstone Mid Cap 30 Fund\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HIMDX\n33.60 %\n23.00 %\n13.26 %\n11.28 %\nInvestor Class Share - HFMDX\n33.13 %\n22.57 %\n12.87 %\n10.91 %\nRussell Midcap® Index (5)\n13.45 %\n8.09 %\n6.38 %\n8.98 %\nS&P 500® Index (2)\n21.62 %\n10.15 %\n9.92 %\n11.91 %\nHennessy Cornerstone Large Growth Fund\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HILGX\n29.28 %\n12.94 %\n8.93 %\n10.15 %\nInvestor Class Share - HFLGX\n28.96 %\n12.64 %\n8.62 %\n9.88 %\nRussell 1000® Index (6)\n21.19 %\n9.53 %\n9.63 %\n11.63 %\nS&P 500® Index (2)\n21.62 %\n10.15 %\n9.92 %\n11.91 %\nHennessy Cornerstone Value Fund\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HICVX\n16.57 %\n17.20 %\n6.59 %\n8.44 %\nInvestor Class Share - HFCVX\n16.32 %\n16.94 %\n6.38 %\n8.22 %\nRussell 1000® Value Index (7)\n14.44 %\n11.05 %\n6.23 %\n8.45 %\nS&P 500® Index (2)\n21.62 %\n10.15 %\n9.92 %\n11.91 %\nHennessy Total Return Fund\nOne Year\nThree Years\nFive Years\nTen Years\nInvestor Class Share - HDOGX\n11.86 %\n6.81 %\n3.04 %\n5.52 %\n75/25 Blended DJIA/Treasury Index (8)\n15.66 %\n7.14 %\n6.10 %\n8.53 %\nDow Jones Industrial Average (9)\n19.18 %\n8.62 %\n7.14 %\n10.79 %\nHennessy Equity and Income Fund*\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HEIIX\n11.47 %\n3.88 %\n4.34 %\n6.00 %\nInvestor Class Share - HEIFX\n10.97 %\n3.49 %\n3.94 %\n5.61 %\nS&P 500® Index (2)\n21.62 %\n10.15 %\n9.92 %\n11.91 %\nHennessy Balanced Fund\nOne Year\nThree Years\nFive Years\nTen Years\nInvestor Class Share - HBFBX\n6.91 %\n4.16 %\n2.01 %\n3.59 %\n50/50 Blended DJIA/Treasury Index (10)\n11.66 %\n4.94 %\n4.73 %\n6.10 %\nDow Jones Industrial Average (9)\n19.18 %\n8.62 %\n7.14 %\n10.79 %\nHennessy Energy Transition Fund*\nOne Year\nThree Years\nFive Years\nSince Inception (12/31/13)\nInstitutional Class Share - HNRIX\n26.63 %\n50.26 %\n5.77 %\n4.05 %\nInvestor Class Share - HNRGX\n26.22 %\n49.74 %\n5.44 %\n3.77 %\nS&P 500® Energy Index (11)\n30.21 %\n51.42 %\n8.96 %\n4.34 %\nS&P 500® Index (2)\n21.62 %\n10.15 %\n9.92 %\n11.10 %\nHennessy Midstream Fund*\nOne Year\nThree Years\nFive Years\nSince Inception (12/31/13)\nInstitutional Class Share - HMSIX**\n33.28 %\n38.81 %\n5.73 %\n1.84 %\nInvestor Class Share - HMSFX\n32.95 %\n38.51 %\n5.51 %\n1.59 %\nAlerian US Midstream Energy Index (12)\n25.56 %\n40.32 %\n8.95 %\n4.29 %\nS&P 500® Index (2)\n21.62 %\n10.15 %\n9.92 %\n11.10 %\nHennessy Gas Utility Fund*\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HGASX**\n-0.12 %\n8.73 %\n4.76 %\n6.01 %\nInvestor Class Share - GASFX\n-0.42 %\n8.41 %\n4.44 %\n5.78 %\nAGA Stock Index (13)\n0.25 %\n9.43 %\n5.50 %\n6.92 %\nS&P 500® Index (2)\n21.62 %\n10.15 %\n9.92 %\n11.91 %\nHennessy Japan Fund\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HJPIX\n24.49 %\n-5.06 %\n-0.45 %\n6.90 %\nInvestor Class Share - HJPNX\n24.04 %\n-5.41 %\n-0.84 %\n6.52 %\nRussell/Nomura Total MarketTM Index (14)\n25.77 %\n2.93 %\n2.05 %\n4.93 %\nTokyo Stock Price Index (TOPIX) (15)\n25.90 %\n2.82 %\n1.92 %\n4.83 %\nHennessy Japan Small Cap Fund\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HJSIX**\n15.51 %\n-0.59 %\n-0.04 %\n7.82 %\nInvestor Class Share - HJPSX\n15.16 %\n-0.98 %\n-0.43 %\n7.50 %\nRussell/Nomura Small CapTM Index (16)\n18.86 %\n-0.80 %\n-1.20 %\n4.51 %\nTokyo Stock Price Index (TOPIX) (15)\n25.90 %\n2.82 %\n1.92 %\n4.83 %\nHennessy Large Cap Financial Fund*\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HILFX**\n-4.93 %\n-1.87 %\n0.27 %\n5.41 %\nInvestor Class Share - HLFNX\n-5.21 %\n-2.21 %\n-0.07 %\n5.09 %\nRussell 1000® Index Financials (17)\n13.59 %\n14.39 %\n8.82 %\n11.15 %\nRussell 1000® Index (6)\n21.19 %\n9.53 %\n9.63 %\n11.63 %\nHennessy Small Cap Financial Fund*\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HISFX\n-12.52 %\n19.01 %\n2.21 %\n6.00 %\nInvestor Class Share - HSFNX\n-12.85 %\n18.53 %\n185.00 %\n5.61 %\nRussell 2000® Index Financials (18)\n-3.89 %\n10.55 %\n0.51 %\n6.06 %\nRussell 2000® Index (1)\n8.93 %\n7.16 %\n2.40 %\n6.65 %\nHennessy Technology Fund*\nOne Year\nThree Years\nFive Years\nTen Years\nInstitutional Class Share - HTCIX**\n30.01 %\n8.10 %\n9.15 %\n10.26 %\nInvestor Class Share - HTECX\n29.71 %\n7.84 %\n8.88 %\n9.95 %\nNASDAQ Composite Index (19)\n26.11 %\n6.60 %\n11.41 %\n14.52 %\nS&P 500® Index (2)\n21.62 %\n10.15 %\n9.92 %\n11.91 %\nHennessy Stance ESG ETF*\nOne Year\nThree Years\nFive Years\nSince Inception (3/15/21)\nSTNC - Net Asset Value\n8.41 %\n-\n-\n0.71 %\nSTNC - Market Price\n8.35 %\n-\n-\n0.73 %\nS&P 500® Index (2)\n21.62 %\n-\n-\n4.70 %\n* Performance information from prior to the date that we acquired the assets related to the management of the fund is included because the previous investment manager managed the fund using a similar investment strategy.\n** Performance shown for periods prior to the inception of Institutional Class shares represents the performance of Investor Class shares of the fund and includes expenses that are not applicable to, and are higher than, those of Institutional Class shares.\n(1)\nThe Russell 2000® Index comprises the smallest 2,000 companies in the Russell 3000® Index based on market capitalization and current index membership, representing approximately 7% of the total market capitalization of the Russell 3000® Index.\n(2)\nThe S&P 500® Index is a capitalization-weighted index that is designed to represent the broad domestic economy through changes in the aggregate market value of 500 stocks across all major industries.\n(3)\nThe Russell 3000® Index comprises the 3,000 largest U.S. companies based on market capitalization, representing approximately 96% of the investable U.S. equities market.\n(4)\nThe Russell Midcap® Growth Index comprises those companies in the Russell Midcap® Index with relatively higher price-to-book ratio, higher forecasted growth values, and higher sales per share historical growth.\n(5)\nThe Russell Midcap® Index comprises approximately 800 of the smallest securities in the Russell 1000® Index, representing approximately 27% of the total market capitalization of the Russell 1000® Index.\n(6)\nThe Russell 1000® Index comprises the 1,000 largest companies in the Russell 3000® Index based on market capitalization and current index membership, representing approximately 93% of the total market capitalization of the Russell 3000® Index.\n(7)\nThe Russell 1000® Value Index comprises those companies in the Russell 1000® Index with relatively lower price-to-book ratios, lower forecasted growth value, and lower sales per share historical growth.\n(8)\nThe 75/25 Blended DJIA/Treasury Index consists of 75% common stocks represented by the Dow Jones Industrial Average and 25% short-duration Treasury securities represented by the ICE BofAML U.S. 3-Month Treasury Bill Index, which comprises U.S. Treasury securities maturing in three months.\n(9)\nThe Dow Jones Industrial Average is a price-weighted average of 30 significant stocks traded on the New York Stock Exchange or The Nasdaq Stock Market LLC.\n(10)\nThe 50/50 Blended DJIA/Treasury Index consists of 50% common stocks represented by the Dow Jones Industrial Average and 50% short-duration Treasury securities represented by the ICE BofAML 1-Year U.S. Treasury Note Index, which comprises U.S. Treasury securities maturing in approximately one year.\n(11)\nThe S&P 500® Energy Index comprises those companies included in the S&P 500® that are classified in the Energy sector.\n(12)\nThe Alerian US Midstream Energy Index comprises companies that earn a majority of their cash flow from midstream activities involving energy commodities.\n(13)\nThe AGA Stock Index is a capitalization-weighted index consisting of members of the American Gas Association whose securities are traded on a U.S. stock exchange.\n(14)\nThe Russell/Nomura Total Market™ Index represents approximately 98% of the investable Japan equity market.\n(15)\nThe Tokyo Stock Price Index (TOPIX) is a capitalization-weighted index of all of the companies listed on the First Section of the Tokyo Stock Exchange.\n(16)\nThe Russell/Nomura Small Cap™ Index comprises the bottom 15% of the Russell/Nomura Total Market™ Index based on market capitalization.\n(17)\nThe Russell 1000® Index Financials is a subset of the Russell 1000® Index that measures the performance of securities classified in the Financials sector of the large-cap U.S. equity market.\n(18)\nThe Russell 2000® Index Financials is a subset of the Russell 2000® Index that measures the performance of securities classified in the Financials sector of the small-cap U.S. equity market.\n(19)\nThe NASDAQ Composite Index is a broad-based capitalization-weighted index of all common stocks listed on The Nasdaq Stock Market LLC.\nInvestors cannot invest directly in an index. Performance data for an index does not reflect any deductions for fees, expenses, or taxes.\nFrank Russell Company (Russell) is the source and owner of the trademarks, service marks, and copyrights related to the Russell Indexes. Russell® is a trademark of Frank Russell Company. Neither Russell nor its licensors accept any liability for any errors or omissions in the Russell Indexes or Russell ratings or underlying data, and no party may rely on any Russell Indexes or Russell ratings or underlying data contained in this communication. No further distribution of Russell data is permitted without Russells express written consent. Russell does not promote, sponsor, or endorse the content of this communication.\nStandard & Poors Financial Services LLC is the source and owner of the S&P® and S&P 500® trademarks.\nThe Dow Jones Industrial Average is the property of the Dow Jones & Company, Inc. Dow Jones & Company, Inc. is not affiliated with the Hennessy Funds or its investment advisor. Dow Jones & Company, Inc. has not participated in any way in the creation of the Hennessy Funds or in the selection of stocks included in the Hennessy Funds and has not approved any information included in this communication.\nThe Alerian US Midstream Energy Index is a servicemark of GKD Index Partners. LLC d/b/a Alerian (Alerian), and its use is granted under a license from Alerian. Alerian makes no express or implied warranties, representations, or promises regarding the originality, merchantability, suitability, or fitness for a particular purpose or use with respect to the Alerian indices. No party may rely on, and Alerian does not accept any liability for any errors, omissions, interruptions, or defects in, the Alerian indices or underlying data.\nDevelopment of New Investment Strategies and Expanding Our Product Offerings\nWe develop new investment strategies and expand our product offerings by identifying investor needs and reviewing asset allocation tables to determine where we can augment our family of funds. Once we identify an attractive market segment, we select one of the following methods to initiate the new strategy:\n●\nWe screen the appropriate universe of stocks with a set of parameters that we believe identifies stocks that will produce higher long-term returns with lower associated risk than their relative indices, and we then introduce the new investment strategy into the marketplace by opening and directly marketing a new fund;\n●\nWe purchase the assets related to the management of an existing fund that we then manage ourselves;\n●\nWe purchase the assets related to the management of an existing fund and then engage the existing portfolio managers or strategic firm to act as a sub-advisor to manage the fund; or\n●\nWe purchase the assets related to the management of an existing fund and then employ the existing portfolio management team to manage the fund.\nASSETS UNDER MANAGEMENT, SOURCES OF REVENUES, AND 12B-1 PLANS\nWe earn revenues primarily by providing investment advisory services to the Hennessy Funds and secondarily by providing shareholder services to investors in the Hennessy Mutual Funds. The fees we receive for these services are calculated as a percentage of the average daily net asset values of the Hennessy Funds. In addition, the sub-advisory fees that we pay are also calculated as a percentage of the average daily net asset values of the sub-advised Hennessy Funds. The amount of our assets under management fluctuates as a result of organic inflows (purchases of shares of the Hennessy Funds by new or existing investors), acquisition inflows, outflows (redemptions of shares of the Hennessy Funds by investors), and market appreciation or depreciation.\nThe following table summarizes our assets under management for the past three fiscal years:\nFiscal Years Ended September 30,\n(In thousands)\nBeginning assets under management\n$ 2,895,717\n$ 4,065,922\n$ 3,564,597\nAcquisition inflows\n43,088\n-\n-\nOrganic inflows\n598,119\n656,491\n818,358\nRedemptions\n(915,397 )\n(1,147,888 )\n(1,345,371 )\nMarket appreciation (depreciation)\n410,515\n(678,808 )\n1,028,338\nEnding assets under management\n$ 3,032,042\n$ 2,895,717\n$ 4,065,922\nAs stated above, the amount of fees we receive for providing investment advisory and shareholder services increases or decreases as our average assets under management rises or falls.\nThe following table summarizes our sources of revenues, net of sub-advisory fees, for the past three fiscal years:\nFiscal Years Ended September 30,\n(In thousands)\nInvestment advisory fees\n$ 22,090\n$ 27,468\n$ 30,367\nShareholder service fees\n1,930\n2,199\n2,393\nSubtotal\n24,020\n29,667\n32,760\nSub-advisory fees\n(3,759)\n(5,727)\n(7,332)\nRevenue, net of sub-advisory fees\n$ 20,261\n$ 23,940\n$ 25,428\nInvestment Advisory Agreements and Fees\nWe provide investment advisory services to the Hennessy Funds pursuant to investment advisory agreements with Hennessy Funds Trust. Our provision of investment advisory services to the Hennessy Funds is subject to the oversight of the Board of Trustees of Hennessy Funds Trust (the Funds Board of Trustees) and must be in accordance with the applicable Hennessy Funds investment advisory agreement, Prospectus, and Statement of Additional Information. The services that we provide to each Hennessy Fund pursuant to these investment advisory agreements include, among other things, the following:\n●\nacting as portfolio manager for the fund or overseeing the sub-advisor acting as portfolio manager for the fund, which includes managing the composition of the funds portfolio (including the purchase, retention, and disposition of portfolio securities in accordance with the funds investment objectives, policies, and restrictions), seeking best execution for the funds portfolio, managing the use of soft dollars for the fund, and managing proxy voting for the fund;\n●\nperforming a daily reconciliation of portfolio positions and cash for the fund;\n●\nmonitoring the liquidity of the fund;\n●\nmonitoring the funds compliance with its investment objectives and restrictions and federal securities laws;\n●\nmaintaining a compliance program (including a code of ethics), conducting ongoing reviews of the compliance programs of the funds service providers (including any sub-advisor), including their codes of ethics, as appropriate, conducting on-site visits to the funds service providers (including any sub-advisor) as feasible, monitoring incidents of abusive trading practices, reviewing fund expense accruals, payments, and fixed expense ratios, evaluating insurance providers for fidelity bond, directors and officers and errors and omissions insurance, and cybersecurity insurance coverage, managing regulatory examination compliance and responses, conducting employee compliance training, reviewing reports provided by service providers, and maintaining books and records;\n●\nif applicable, overseeing the selection and continued employment of the funds sub-advisor, reviewing the funds investment performance, and monitoring the sub-advisors adherence to the funds investment objectives, policies, and restrictions;\n●\noverseeing service providers that provide accounting, administration, distribution, transfer agency, custodial, sales, marketing, public relations, audit, information technology, and legal services to the fund;\n●\nmaintaining in-house marketing and distribution departments on behalf of the fund;\n●\npreparing or directing the preparation of all regulatory filings for the fund, including writing and annually updating the funds prospectus and related documents;\n●\nfor each annual report of the fund, preparing or reviewing a written summary of the funds performance during the most recent 12-month period;\n●\nmonitoring and overseeing the accessibility of the fund on financial institution platforms;\n●\npaying the incentive compensation of the funds compliance officer and employing other staff such as legal, marketing, national accounts, distribution, sales, administrative, and trading oversight personnel, as well as management executives;\n●\nproviding a quarterly compliance certification to the Funds Board of Trustees; and\n●\npreparing or reviewing materials for the Funds Board of Trustees, presenting to or leading discussions with the Funds Board of Trustees, preparing or reviewing all meeting minutes, and arranging for training and education of the Funds Board of Trustees.\nThe investment advisory agreements also provide that we are responsible for performing any ordinary clerical and bookkeeping services needed by the Hennessy Funds that are not provided by the funds custodian, administrator, or transfer agent. The Funds Board of Trustees comprises five trustees who are not interested persons of the Hennessy Funds (the disinterested trustees) and Neil J. Hennessy, who is our Chief Executive Officer and Chairman of our Board of Directors. Under the Investment Company Act of 1940, as amended (the 1940 Act), a majority of the trustees must be disinterested trustees, and the disinterested trustees must approve entering into and continuing our investment advisory agreements. The disinterested trustees also have sole responsibility for selecting and nominating other disinterested trustees.\nIn exchange for the services described above, we receive an investment advisory fee from each Hennessy Fund that is calculated as a percentage of such funds average daily net asset value. As of the end of fiscal year 2023, the percentages of each funds assets used to calculate the annual investment advisory fees payable to us are as follows:\nHennessy Fund\nInvestment Advisory Fee\n(All Class Shares)\n(as a % of fund assets)\nHennessy Cornerstone Growth Fund\n0.74%\nHennessy Focus Fund\n0.90%\nHennessy Cornerstone Mid Cap 30 Fund\n0.74%\nHennessy Cornerstone Large Growth Fund\n0.74%\nHennessy Cornerstone Value Fund\n0.74%\nHennessy Total Return Fund\n0.60%\nHennessy Equity and Income Fund\n0.80%\nHennessy Balanced Fund\n0.60%\nHennessy Energy Transition Fund\n1.25%\nHennessy Midstream Fund\n1.10%\nHennessy Gas Utility Fund\n0.40%\nHennessy Japan Fund\n0.80%\nHennessy Japan Small Cap Fund\n0.80%\nHennessy Large Cap Financial Fund\n0.90%\nHennessy Small Cap Financial Fund\n0.90%\nHennessy Technology Fund\n0.74%\nHennessy Stance ESG ETF\n0.95%\nWe waive a portion of our fees with respect to the Hennessy Midstream Fund, the Hennessy Technology Fund, and the Hennessy Stance ESG ETF to comply with contractual expense ratio limitations. The fee waivers are calculated daily by the Hennessy Funds accountants at U.S. Bank Global Fund Services, reviewed by management, and then charged to expense monthly as offsets to our revenues. Each waived fee is then deducted from investment advisory fee income and reduces the aggregate amount of advisory fees we receive from such fund in the subsequent month. Total fee waivers during each of fiscal year 2023 and 2022 were $0.1 million. To date, we have only waived fees based on contractual obligations, but we have the ability to waive fees at our discretion. Any decision to waive fees would apply only on a going-forward basis.\nOur investment advisory agreements must be renewed annually (except in limited circumstances) by (a) the Funds Board of Trustees or the vote of a majority of the outstanding shares of the applicable Hennessy Fund and (b) the vote of a majority of the disinterested trustees. If an investment advisory agreement is not renewed, it terminates automatically. There are two additional circumstances in which an investment advisory agreement terminates. First, an investment advisory agreement automatically terminates if we assign it to another advisor (assignment includes indirect assignment, which is the transfer of our common stock in sufficient quantities deemed to constitute a controlling block). Second, an investment advisory agreement may be terminated prior to its expiration upon 60 days written notice by either the applicable Hennessy Fund or us.\nSub-Advisory Agreements and Fees\nWe have delegated the day-to-day portfolio management responsibilities to sub-advisors, subject to our oversight, for some of the Hennessy Funds. In each case, the sub-advisor entity or the individuals working at the sub-advisor entity is the same entity or are the same individuals who advised the fund prior to our purchase of the assets related to the management of such fund. The provision of sub-advisory services must be in accordance with the applicable Hennessy Funds sub-advisory agreement, Prospectus, and Statement of Additional Information. The services that each sub-advisor provides to the applicable Hennessy Fund pursuant to the terms of the sub-advisory agreement include, among other things, the following (except these responsibilities are divided between Stance Capital and Vident Advisory for the Hennessy Stance ESG ETF):\n●\nacting as portfolio manager for the fund, which includes managing the composition of the funds portfolio (including the purchase, retention, and disposition of portfolio securities in accordance with the funds investment objectives, policies, and restrictions), seeking best execution for the funds portfolio, managing the use of soft dollars for the fund, and managing proxy voting for the fund;\n●\nensuring that its compliance programs include policies and procedures relevant to the fund and the sub-advisors duties as a portfolio manager to the fund;\n●\nfor each annual report of the fund, preparing a written summary of the funds performance during the most recent 12-month period; and\n●\nproviding a quarterly certification to Funds Board of Trustees regarding trading and allocation practices, supervisory matters, the sub-advisors compliance program (including its code of ethics), compliance with the funds policies, and general firm updates.\nIn exchange for sub-advisory services, we pay sub-advisory fees to the sub-advisors out of our own assets. Sub-advisory fees are calculated as a percentage of the applicable funds average daily net asset value. The following table lists each of our sub-advised funds, the sub-advisor for such fund, and the percentage used to calculate the annual sub-advisory fees payable by us to such funds sub-advisor as of the end of fiscal year 2023:\nHennessy Fund\nSub-Advisory Fee\n(All Class Shares)\nSub-Advisor\n(As a % of Fund Assets)\nHennessy Focus Fund\nBroad Run Investment Management, LLC\n0.29%\nHennessy Equity and Income Fund\nFCI Advisors (fixed income allocation)\n0.27%\nThe London Company of Virginia, LLC (equity allocation)\n0.33%\nHennessy Japan Fund\nSPARX Asset Management Co., Ltd.\n$0-$500 million:\n0.35%\nAbove $500 million-$1 billion:\n0.40%\nAbove $1 billion:\n0.42%\nHennessy Japan Small Cap Fund\nSPARX Asset Management Co., Ltd.\n$0-$500 million:\n0.35%\nAbove $500 million-$1 billion:\n0.40%\nAbove $1 billion:\n0.42%\nHennessy Stance ESG ETF\nStance Capital, LLC (portfolio composition sub-advisor)\n$0-$125 million:\n0.40%\nAbove $125-$250 million:\n0.37%\nAbove $250 million:\n0.35%\nVident Advisory, LLC* (trading sub-advisor)\n$0-$250 million:\n0.05%\nAbove $250-$500 million:\n0.05%\nAbove $500 million:\n0.04%\n*Subject to a minimum sub-advisory fee to Vident Advisory, LLC of $18,750 on an annual basis.\nThe sub-advisory agreements must be renewed annually in the same manner as the investment advisory agreements and are subject to the same termination provisions, including automatic termination in the event the agreement is assigned. Assignment is generally defined under the 1940 Act and the Advisers Act to include direct assignments as well as assignments that are deemed to occur due to the change in control of the investment advisor, which includes us or one of the sub-advisors that we have engaged on behalf of certain of the Hennessy Funds. However, a transaction is not an assignment under the 1940 Act or the Investment Advisers Act of 1940, as amended (the \"Advisers Act\") if it does not result in a change of actual control or management of us or, in the context of a sub-advisor, a change of actual control or management of the sub-advisor.\nIf a sub-advisor experienced a change of control but we did not, we could continue acting as an advisor to the applicable Hennessy Fund, but the shareholders of such Hennessy Fund would have to approve a new sub-advisory agreement for the sub-advisor. Because obtaining shareholder approval for a new sub-advisor can be costly both in terms of expense and time, we recently sought and received an exemptive order from the Securities and Exchange Commission (SEC) to operate under a manager of managers structure. The manager of managers structure permits us to appoint and replace unaffiliated sub-advisors and to enter into and make material amendments to the related sub-advisory agreements on behalf of the Hennessy Funds without shareholder approval, but subject in each case to the approval of the Hennessy Funds Board of Trustees. Under the manager of managers structure, we have ultimate responsibility, subject to oversight by the Hennessy Funds Board of Trustees, for overseeing the Hennessy Funds unaffiliated sub-advisors and recommending their hiring, termination, or replacement. Even with the exemptive order from the SEC, we cannot implement the manager of managers structure on behalf of a particular Hennessy Fund until the shareholders of such Hennessy Fund approve its implementation.\nWe recently obtained shareholder approval for the Hennessy Stance ESG ETF to operate under a manager of managers structure and are evaluating the timing and process for obtaining shareholder approval for the Hennessy Mutual Funds that have a sub-advisor. With respect to the Hennessy Stance ESG ETF, our sub-advisory agreement with VIA, one of the sub-advisors for the fund, terminated automatically on July 14, 2023, in connection with an acquisition transaction that resulted in a change of control of VIA. As a result of the transaction, VIA ceased to exist and Vident Advisory became the sole Vident enterprise carrying out Vidents business and operations. On the same date, we entered into a new sub-advisory agreement with Vident Advisory pursuant to which Vident Advisory now provides sub-advisory services to the Hennessy Stance ESG ETF. The new sub-advisory agreement was approved by the Hennessy Funds Board of Trustees and by vote of the shareholders of the Hennessy Stance ESG ETF. At the same meeting, the shareholders of the Hennessy Stance ESG ETF also approved the implementation of the manager of managers structure for the fund.\nShareholder Servicing Agreements and Fees\nPursuant to a shareholder servicing agreement with Hennessy Funds Trust, we provide shareholder services to investors in the Hennessy Mutual Funds including, among other things, maintaining a toll-free number that the current investors in the Hennessy Funds may call to ask questions about their accounts or the funds and actively participating as a liaison between investors in the Hennessy Funds and U.S. Bank Global Fund Services. In exchange for these services, we receive a shareholder service fee from each Hennessy Mutual Fund of 0.10% of the average daily net assets of such funds Investor Class shares.\nThe shareholder servicing agreement must be renewed annually by the Funds Board of Trustees, including the vote of a majority of the disinterested trustees. If the shareholder servicing agreement is not renewed, it terminates automatically. In addition, the shareholder servicing agreement may be terminated prior to its expiration upon 60 days written notice by Hennessy Funds Trust or us.\n12b-1 Plans\nAll of the Hennessy Mutual Funds have adopted a 12b-1 plan. These plans are named after Rule 12b-1 of the 1940 Act, which permits a fund to adopt a plan that allows the fund to collect fees to use to make payments to third parties in connection with the distribution of fund shares. Amounts paid under a plan may be spent on any activities or expenses primarily intended to result in sale of shares of the fund, including, but not limited to (i) advertising, (ii) compensation paid to financial institutions, broker-dealers, and others for sales and marketing, (iii) shareholder accounting servicing, (iv) printing and mailing prospectuses to possible new investors, and (v) printing and mailing sales literature. A fund may also employ a distributor to distribute and market fund shares and then use 12b-1 fees to pay the distributor for expenses relating to telephone use, overhead, employing employees who engage in or support the distribution of the fund shares, printing prospectuses and other reports for possible new investors, advertising, and preparing and distributing sales literature.\nThe 12b-1 fee for each Hennessy Mutual Fund is 0.15% of the average daily net assets of such funds Investor Class shares.\nCUSTODIAL, DISTRIBUTION, AND BROKERAGE ARRANGEMENTS\nWe use independent third parties for custody and distribution of our assets under management.\nAll trades for the Hennessy Funds are executed by independent brokerage firms following our direction or the direction of our sub-advisors. When selecting brokers, we and our sub-advisors are required to seek best execution. Although there is no single statutory definition, SEC releases and other legal guidelines make clear that this duty requires us to seek the most advantageous terms reasonably available under the circumstances for a customers account. The lowest possible commission, while important, is not the sole determinative factor. We and our sub-advisors also consider factors such as order size and market depth, availability of competing markets and liquidity, trading characteristics of the security, financial responsibility of the broker-dealer, and the brokers ability to address current market conditions.\nCurrently, we participate in soft dollar arrangements with one of our brokers. This means we receive research reports and real-time electronic research to assist us in trading and managing the Hennessy Funds. Under these soft dollar arrangements, the Hennessy Funds pay brokerage commissions for securities trades at the regular market rate, and some or all of the value of those commissions is received by us in the form of research or other services that benefit the Hennessy Funds. We believe our soft dollar arrangements comply with SEC guidance regarding soft dollars.\nLICENSE AGREEMENT\nOur ability to use the names and formulaic investment strategies of the Hennessy Cornerstone Growth Fund and the Hennessy Cornerstone Value Fund are governed by the terms and conditions of a license agreement, dated as of April 10, 2000, with Netfolio. Under the license agreement, Netfolio granted us a perpetual, paid-up, royalty-free, exclusive license to use certain trademarks, such as Strategy Indexing, Cornerstone Growth, and Cornerstone Value, as well as the formula investment strategies used by the Hennessy Cornerstone Growth Fund and the Hennessy Cornerstone Value Fund. All of our advertising, marketing, promotional, and other materials incorporating or referring to the trademarks are subject to the prior written approval of Netfolio, except that we do not need Netfolios prior written approval to use the trademarks in a manner that is not substantially unchanged from any prior use by Netfolio in its own business or from any prior use by us previously approved by Netfolio. We have the right to assign the license to another person or entity if the assignee agrees in writing to be bound by the terms of the license agreement. There are no ongoing licensing fees associated with this license agreement, and Netfolio does not have any contractual rights to terminate the license agreement.\nBUSINESS STRATEGY\nFrom the time we launched our first mutual fund in 1996, we have consistently pursued a growth strategy centered on organic growth through our marketing, sales, and distribution efforts and growth through strategic purchases of management-related assets. The implementation of this business strategy is described below.\n●\nSeeking to deliver strong investment performance of the Hennessy Funds\nOne of the most effective ways we can grow the assets of the Hennessy Funds is by delivering strong investment performance, which we believe should:\n●\nresult in an increase in the value of existing assets of the Hennessy Funds;\n●\nencourage more investors to buy shares of the Hennessy Funds and decrease the number of investors who redeem their shares and leave the Hennessy Funds; and\n●\nmotivate current investors to invest additional money in the Hennessy Funds.\n●\nUtilizing our branding and marketing campaign to attract assets\nWe believe we can attract investors to the Hennessy Funds by effectively marketing our consistent and disciplined approach to investing based on a buy-and-hold philosophy that rejects the idea of market timing. We offer quantitative funds, actively managed funds, and income-generating funds. We believe our quantitative funds attract investors who want to understand exactly how their investments are managed and who favor statistical analysis and empirical evidence as the basis for investment decisions. We also believe that our actively managed funds attract investors who appreciate a fundamental, hands-on investment management approach and talented portfolio managers. Finally, we believe our more conservative, income-generating funds attract investors seeking alternatives to funds invested entirely in equities.\nWe run a comprehensive and far-reaching public relations program designed to disseminate our message to a wide variety of potential investors through frequent television appearances, radio spots, feature articles, and print media mentions. We have partnered with an industry-leading public relations firm, SunStar Strategic, to proactively promote the Hennessy Funds to national financial media. This public relations program has consistently resulted in the Hennessy Funds being mentioned an average of once every two to three days in national print and broadcast media such as CNBC, Fox News, Bloomberg radio and TV, The Wall Street Journal, Kiplinger, and Barrons, among others. To facilitate our presence in the media, we utilize LiveStudio, an in-house studio providing a direct link to media broadcasts, at our office in Novato, California. We have several spokespeople who help us expand our public relations program and provide comprehensive media coverage of our products, including (i) Neil J. Hennessy, who is our Chief Executive Officer and Chairman of our Board of Directors as well as President, Chief Market Strategist, and a Portfolio Manager of the Hennessy Funds, (ii) Ryan Kelley, Chief Investment Officer and a Portfolio Manager of the Hennessy Funds, and (iii) Portfolio Managers Ben Cook, David Ellison, and Josh Wein, as well as the Portfolio Managers at our sub-advisors.\nWe maintain and regularly update a robust website and social media presence. Our core marketing efforts include targeted outreach to both current and prospective investors in the Hennessy Funds, including financial advisors and retail investors. Our content marketing includes overall market and sector-specific thought leadership, promotional investment ideas, fund updates, and commentary from our portfolio managers, as well as feature news articles and broadcast appearances. We attend select investment advisor trade shows and strategic industry-related conferences, and we seek opportunities to moderate or speak on industry-related panels.\n●\nExpanding our distribution network to additional distribution platforms\nInvestors may purchase shares of the Hennessy Funds through financial institutions, including fund supermarkets, national wirehouses and broker-dealers, independent and regional broker-dealers, and registered investment advisors.\nFund supermarkets, such as Schwab, Fidelity, TD Ameritrade, and Pershing, generally offer funds of many different investment companies to investors in exchange for a services fee paid by the applicable fund or that funds investment advisor. The ability to purchase various funds in a single location is very attractive to investors, and the majority of our assets under management as of the end of fiscal year 2023 was held at fund supermarkets. Additionally, we continually seek opportunities to form new relationships with financial institutions to make the Hennessy Funds even more accessible to investors. We oversee distribution of the Hennessy Funds through all financial institutions.\nInvestors may also purchase shares of the Hennessy Mutual Funds directly through the Hennessy Funds' website or by calling us or U.S. Bank Global Fund Services, the Hennessy Funds administrator.\n●\nIncreasing our current base of financial advisors and investment professionals\nInvestment professionals generally have access to a wide variety of investment products they may recommend to their clients. A recommendation by an investment professional to a client to buy one of the Hennessy Funds may greatly influence that investor. Thus, we believe that expanding our current base of investment professionals who utilize no-load funds for their clients will help us increase our assets under management, which will in turn increase our revenues.\n●\nSecuring participation on the platforms of national full-service firms\nWe continually strive to develop relationships with national full-service firms that permit their investment professionals to offer no-load funds to their clients as a way to increase the amount of assets that we manage, which will in turn increase our revenues.\n●\nPursuing strategic purchases of management agreements for additional funds\nA primary component of our growth strategy is to selectively pursue strategic purchases of the assets related to the management of additional funds. We believe the regulatory burden imposed upon the fund industry, along with increased competition, has compressed the margins of smaller to mid-sized fund managers, making those managers more receptive to an asset purchase. The long-term trend toward lower fees has made it more challenging to identify accretive asset purchases, but we believe that we are well positioned to move quickly once we identify any attractive purchase targets from the large supply of potential targets.\nThrough our asset purchase strategy, we have completed 11 purchases of the assets related to the management of investment funds over a 20-year period, integrating $4.3 billion in net assets of 31 different investment funds into the Hennessy Funds family.\n●\nDelivering strong, high-quality financial results.\nWe seek to maintain a strong financial position and to manage our investment advisory business to meet the highest regulatory, ethical, and business standards and to maintain continuity of service to all of the investors in the Hennessy Funds.\nCOMPETITION\nThe investment advisory industry is highly competitive, with new competitors continually entering the industry. We compete directly with numerous global and U.S. investment managers, commercial banks, savings and loans associations, brokerage and investment banking firms, broker-dealers, insurance companies, and other financial institutions that often provide investment products with similar features and objectives to those we offer. These institutions range from small boutique firms to large financial services complexes. We are considered a small investment advisory company. Many competing companies are part of larger financial services companies that conduct business in more markets and have greater marketing, financial, technical, research, and distribution resources and other capabilities than we do. Most of the larger firms offer a broader range of financial services to the same retail and institutional investors we seek to serve. These factors may place us at a competitive disadvantage, and we can give no assurance that our strategies and efforts to maintain and enhance our current investor relationships, as well as to create new ones, will be successful. To grow our business, we must be able to compete effectively for assets under management. Key competitive factors include:\n●\nthe investment performance of the Hennessy Funds;\n●\nthe breadth of our product offerings;\n●\nindustry rankings of the Hennessy Funds;\n●\nthe quality of our services;\n●\nour ability to further develop and market our brand;\n●\nour commitment to placing the interests of investors first; and\n●\nour general business reputation.\nIncreased competition could reduce the demand for our products and services, which could have a material adverse effect on our business, results of operations, and financial condition.\nCompetition is an important risk that our business faces and should be considered along with other risk factors that we discuss in Item 1A, Risk Factors.\nREGULATORY ENVIRONMENT\nWe are subject to an increasing number of extensive and complex federal and state laws and regulations intended to protect investors in funds and investors of registered investment advisors. We believe we are in compliance in all material respects with all applicable laws and regulations.\nWe are registered as an investment advisor with the SEC and, therefore, must comply with the requirements of the Advisers Act and related SEC regulations. Such requirements relate to, among other things, fiduciary duties to investors, transactions with investors, compliance program effectiveness, solicitation arrangements, conflicts of interest, advertising, recordkeeping and reporting, disclosure, and anti-fraud matters.\nWe manage accounts for the Hennessy Funds on a discretionary basis, meaning that we have the authority to buy and sell securities for each portfolio, select broker-dealers to execute trades, and negotiate brokerage commission rates. In connection with certain of these transactions, we receive soft dollar credits from broker-dealers that have the effect of reducing certain of our expenses. All of our soft dollar arrangements are intended to be within the safe harbor provided by Section 28(e) of the Securities Exchange Act of 1934, as amended (the Exchange Act). If our ability to use soft dollars were reduced or eliminated as a result of the implementation of statutory amendments or new regulations, our operating expenses would increase.\nThe Hennessy Funds are registered with the SEC under the 1940 Act, which imposes additional obligations on both the Hennessy Funds and us, as the advisor to the Hennessy Funds, including detailed operational requirements. While we exercise broad discretion over the day-to-day management of the business, affairs, and investment portfolios of the Hennessy Funds, our operations are subject to oversight and management by the Funds Board of Trustees. The responsibilities of the Funds Board of Trustees include, among other things, annually approving the continuation of our investment advisory agreements and shareholder servicing agreement with the Hennessy Funds and our sub-advisory agreements with the sub-advisors to the Hennessy Funds, approving other service providers, determining the method of valuing assets, and monitoring transactions involving affiliates. The 1940 Act also imposes on us a fiduciary duty with respect to receiving investment advisory fees. That fiduciary duty may be enforced by the SEC, by administrative action, or through litigation initiated by investors in the Hennessy Funds pursuant to a private right of action.\nThe SEC is authorized to institute proceedings and impose sanctions for violations of the Advisers Act of 1940 and the 1940 Act, ranging from fines and censures to the suspension of individual employees to termination of our registration as an investment advisor. A violation of applicable law or regulations could also subject us, our directors, and our employees to civil actions brought by private parties. We believe we are in compliance in all material respects with all applicable SEC requirements.\nEMPLOYEES\nAs of the end of fiscal year 2023, we had 17 employees, 16 of whom were full-time employees. Our 17 employees had an average tenure of 14 years as of the end of fiscal year 2023. We focus on providing our employees competitive compensation, a friendly and flexible office environment, and fostering close-knit working relationships among our team members. Over 50% of our employees are women, and with an executive team that is 50% women and 25% minority, we believe we have created an environment in which all team members can be successful and supported.\nOur executive officers are (i) Neil J. Hennessy, Chief Executive Officer and Chairman of our Board of Directors, (ii) Teresa M. Nilsen, President, Chief Operating Officer, Secretary, and a member of our Board of Directors, (iii) Kathryn R. Fahy, Chief Financial Officer and Senior Vice President, and (iv) Daniel B. Steadman, Executive Vice President. In addition to our executive officers responsibilities at Hennessy Advisors, Inc., (a) Mr. Hennessy is President, Chief Market Strategist, and a Portfolio Manager of the Hennessy Funds and is a member of the Funds Board of Trustees, (b) Ms. Nilsen is an Executive Vice President and Treasurer of the Hennessy Funds, (c) Ms. Fahy is Vice President, Assistant Treasurer, and Assistant Secretary of the Hennessy Funds, and (d) Mr. Steadman is an Executive Vice President and Secretary of the Hennessy Funds.\nAVAILABLE INFORMATION\nWe make available free of charge through a link on our website, www.hennessyadvisors.com, our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and, if applicable, amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. We are not including the information contained on our website as part of, or incorporating it by reference into, this Annual Report on Form 10-K. ITEM 1A. RISK FACTORS\nWe face many risks and uncertainties, many of which are inherent in the financial services industry and the investment advisory business. Investors should carefully consider the risks described below, together with all of the other information included in this Annual Report on Form 10-K, in evaluating us and our common stock. Our business, results of operations, financial condition, and stock price could be materially adversely affected by any of the risks we face, including those described below.\nRISKS RELATING TO OUR ASSETS UNDER MANAGEMENT\nVolatility in and disruption of the capital markets and changes in the economy has and may continue to significantly affect our assets under management and revenues.\nThe securities markets are inherently volatile and may be affected by factors beyond our control, including global economic conditions, industry trends, interest and inflation rate fluctuations, political factors, the imposition of economic sanctions, public health crises, natural disasters, and other factors that are difficult to predict. Because our assets under management is largely concentrated in equity products, our results are particularly susceptible to downturns in the equity markets. We derive all of our operating revenues from investment advisory fees and shareholder service fees paid to us by the Hennessy Funds. These fees are calculated as a percentage of the average daily net asset value of the Hennessy Funds. Accordingly, our revenues increase or decrease as our average assets under management increases or decreases, which is affected by market appreciation or depreciation and purchases and redemptions of shares of the Hennessy Funds. Changing market conditions could also cause an impairment to the value of our management contract asset.\nInvestors in the Hennessy Funds can redeem their investments at any time and for any reason, including poor investment performance and volatile equity markets. A decline in our assets under management adversely affects our revenues.\nInvestors in the Hennessy Funds may redeem their investments at any time and for any reason without prior notice. Success in the investment advisory and fund business is largely dependent on investment performance, as well as investor servicing and distribution. If the Hennessy Funds perform poorly compared to the investment products offered by other investment advisory firms, we may experience a decrease in purchases of shares and an increase in redemptions of shares of the Hennessy Funds. Further, sharp declines in the stock market have and may continue to cause increases in redemptions of shares of the Hennessy Funds. Such redemptions reduce our assets under management and adversely affect our revenues.\nAdverse opinions of the Hennessy Funds by third parties, including rating agencies or industry analysts, could decrease new investments in, or accelerate redemptions from, the Hennessy Funds, which would adversely affect our revenues.\nThe Hennessy Funds are rated, ranked, and assessed by independent third parties, including rating agencies, industry analysts, distribution partners, and industry periodicals. These ratings, rankings, and assessments often influence the investment decisions of investors, but they can be affected by a number of factors that are not under our direct control and may change frequently. For example, a ranking agency like Morningstar may change its ranking designs and methodology, which could result in a decrease in the ratings of the Hennessy Funds without any action on our part. If the Hennessy Funds received an adverse rating, ranking, or assessment from a third party, it could result in an increase in the withdrawal of assets from the Hennessy Funds by existing investors and the inability to attract additional investments into the Hennessy Funds from existing and new investors, thereby reducing our assets under management and adversely affecting our revenues.\nThe failure or negative performance of products offered by competitors may have a negative impact on the Hennessy Funds within such similar product type, irrespective of our fund performance.\nMany competitors offer similar products to the Hennessy Funds, and the failure or negative performance of competitors products could lead to a loss of confidence in the corresponding products in the Hennessy Funds lineup, irrespective of the performance of the Hennessy Funds. Any loss of confidence in a product type could lead to redemptions in the Hennessy Fund within such product type, which could have a material adverse effect on our business, results of operations, and financial condition.\nOur business and operations are subject to adverse effects from market reactions to the outbreak of contagious diseases.\nThe outbreak and spread of contagious diseases such as COVID-19 has adversely impacted global commercial activity, contributed to significant volatility in global equity and debt markets, and disrupted supply chains, operations, and economic activity. The COVID-19 pandemic adversely impacted the value and performance of the Hennessy Funds, which resulted in declines in our revenues. It also limited our ability to source and pursue potential acquisitions. Future outbreaks of contagious diseases could have similar adverse impacts on our business and financial performance.\nRISKS RELATING TO OUR BUSINESS MODEL AND OPERATIONS\nWe derive a substantial portion of our revenues from a limited number of the Hennessy Funds.\nFor the past several years, approximately 75% of our assets under management has been concentrated in five of our funds. During fiscal year 2023, our average assets under management was concentrated in the following five funds: (i) the Hennessy Focus Fund (23% of average assets under management); (ii) the Hennessy Gas Utility Fund (17% of average assets under management); (iii) the Hennessy Cornerstone Midcap 30 Fund (15% of average assets under management); (iv) the Hennessy Japan Fund (10% of average assets under management); and (v) the Hennessy Cornerstone Value Fund (10% of average assets under management). Consequently, our revenues followed a similar pattern of concentration: (a) the Hennessy Focus Fund (27% of total revenue); (b) the Hennessy Cornerstone Midcap 30 Fund (15% of total revenue); (c) the Hennessy Gas Utility Fund (10% of total revenue); (d) the Hennessy Cornerstone Value Fund (10% of total revenue); and (e) the Hennessy Japan Fund (10% of total revenue). As a result, our operating results are particularly dependent upon the performance of a very small number funds and our ability to maintain and grow assets under management in these funds. These funds have experienced significant redemptions in recent years and may continue to do so for the future. This has reduced, and may continue to reduce, our assets under management and revenues.\nWe utilize unaffiliated sub-advisors to manage the portfolio composition of certain of the Hennessy Funds, and any matters that have an adverse impact on their businesses or any change in our relationships with our sub-advisors could lead to a reduction in assets under management, which would adversely affect our revenues.\nWe utilize unaffiliated sub-advisors to manage the portfolio composition of some of the Hennessy Funds. Although we perform due diligence on our sub-advisors, we do not manage their day-to-day business activities. Our financial condition and profitability may be adversely affected by situations that are specific to such sub-advisors, such as disruption of their operations, their exposure to disciplinary action, or reputational harm to them.\nWe periodically negotiate the terms and conditions of these sub-advisory relationships, and there can be no assurance that such terms will remain acceptable to us or our sub-advisors. These relationships may also be terminated by us or the applicable sub-advisor without penalty on 60 days notice. In addition, each sub-advisory agreement must be renewed annually by the Funds Board of Trustees (or by the vote of a majority of the outstanding shares of the applicable Hennessy Fund), including a majority of the disinterested trustees. Furthermore, a sub-advisory agreement automatically terminates if it is assigned. Assignment is generally defined under the 1940 Act and the Advisers Act to include direct assignments as well as assignments that are deemed to occur due to the change in control of the investment advisor, which includes us or one of the sub-advisors that we have engaged on behalf of certain of the Hennessy Funds. However, a transaction is not an assignment under the 1940 Act or the Advisers Act if it does not result in a change of actual control or management of us or, in the context of a sub-advisor, a change of actual control or management of the sub-advisor.\nGenerally, if a sub-advisor experiences a change of control but we do not, we could continue acting as an advisor to the applicable Hennessy Fund, but the shareholders of such Hennessy Fund would have to approve a new sub-advisory agreement for the sub-advisor. However, for the Hennessy Stance ESG ETF, we have the authority to appoint and replace unaffiliated sub-advisors and to enter into and make material amendments to the related sub-advisory agreements without shareholder approval. This is because we recently sought and received an exemptive order from the SEC to operate under a manager of managers structure and subsequently obtained shareholder approval to implement such structure for the Hennessy Stance ESG ETF. Under the manager of managers structure, we have ultimate responsibility, subject to oversight of and approval by the Hennessy Funds Board of Trustees, for overseeing the Hennessy Funds unaffiliated sub-advisors and recommending their hiring, termination, or replacement. We have not yet received, and do not have an estimated timeline for receiving, shareholder approval to operate under a manager of managers structure for the Hennessy Mutual Funds that are sub-advised.\nAny interruption or termination of our sub-advisory relationships, whether due to a change of control or any other circumstance, could affect our ability to market our sub-advised funds and result in a reduction in assets under management, which would adversely affect our revenues.\nWe utilize a unitary fee structure for the Hennessy Stance ESG ETF, and we bear the risk that the Funds operating expenses may increase and lead to a reduction in our revenues from the fund.\nThe Hennessy Stance ESG ETF pays us a unitary fee under its investment advisory agreement with us. Under a unitary fee structure, we bear all operating expenses incurred in connection with providing services to the fund. The operating expenses covered by the unitary fee include third party data providers, transfer agency, custody, fund administration, legal, audit and other services. Additionally, for no compensation, we pay all other operating expenses of the fund, including sub-advisory fees, with the exception of the following: (1) the management fees paid to us; (2) distribution fees and expenses paid by the fund under any distribution plan adopted pursuant to Rule 12b-1 under the Investment Company Act; (3) interest expenses; (4) brokerage expenses, trading expenses, and other expenses (such as stamp taxes) in connection with the execution of portfolio transactions or in connection with creation or redemption transactions; (5) compensation paid to the independent trustees of the fund and fees paid to independent trustees counsel; (6) tax expenses and governmental fees; and (7) extraordinary expenses not incurred in the course of ordinary business (the Excluded Fees). The fund and its shareholders bear the costs of Excluded Fees. The unitary fee structure generally eliminates the possibility for any decrease in the total fund expense ratio during periods when assets under management increased, which could lead to increased profitability for us if ware able to achieve economies of scale. On the other hand, if the funds operating expenses increase (other than Excluded Fees), this will lead to a reduction in our revenues from the fund.\nWe depend on key personnel to manage our business, and the loss of any key persons services, combined with our inability to identify and retain a suitable replacement for such person, could materially adversely affect us. Additionally, the cost to retain our key personnel could put pressure on our operating margins.\nOur success is largely dependent on the skills, experience, and performance of our key personnel. The business acumen, investment advisory expertise, and business relationships of our key personnel are critical elements in operating and expanding our business. Financial services professionals are in high demand, and we face significant competition for qualified employees. The loss of services of any of our key personnel for any reason, combined with our inability to identify and retain a suitable replacement for such person, could have a material adverse effect on our business, results of operations, and financial condition. Moreover, in order to retain key personnel, we may be required to increase compensation to such individuals, resulting in additional expense.\nWe have debt and may incur additional debt, which may increase the risk of investing in us and may harm our financial condition and results of operations.\nBorrowings, also known as leverage, magnify the potential for gain or loss on amounts invested and therefore increase the risks associated with investing in our securities.\nOn October 20, 2021, we completed a public offering of the 2026 Notes in the aggregate principal amount of $40.25 million, which included the full exercise of the underwriters overallotment option. The 2026 Notes mature on December 31, 2026, and may be redeemed in whole or in part at any time or from time to time at our option on or after December 31, 2023. The 2026 Notes bear interest at 4.875% per annum, payable on the last day of each calendar quarter and at maturity, beginning December 31, 2021. The 2026 Notes are direct unsecured obligations, rank equally in right of payment with any of our future unsecured unsubordinated indebtedness, senior to any of our future indebtedness that expressly provides that it is subordinate to the 2026 Notes, effectively subordinate to all of our existing and future secured indebtedness, and structurally subordinated to all existing and future indebtedness and other obligations of any future subsidiaries of ours.\nWe may incur additional debt in the future. Our indebtedness could (i) decrease our ability to obtain additional financing for working capital, capital expenditures, general corporate or other purposes, (ii) limit our flexibility to make acquisitions, (iii) increase our cash requirements to support the payment of interest, (iv) limit our flexibility in planning for, or reacting to, changes in our business and our industry, and (v) increase our vulnerability to adverse changes in general economic and industry conditions. Our ability to make payments of principal and interest on our indebtedness depends upon our future performance, which is subject to general economic conditions and financial, business, and other factors affecting our consolidated operations, many of which are beyond our control.\nChanges in the distribution channels on which we depend could reduce our net revenues and hinder our growth.\nOur primary source of distribution of the Hennessy Funds is through a variety of financial institutions. Our success is highly dependent on access to these various distribution channels. We cannot guarantee we will be able to retain access to these channels at similar pricing or at all. Increasing competition for these distribution channels could cause our distribution costs to rise, which could have a material adverse effect on our net income. These financial institutions generally can terminate their relationships with us on short notice. Mergers and other corporate transactions among distributors also may affect our relationships with financial institutions. Certain of the financial institutions upon whom we rely to distribute the Hennessy Funds also sell their own competing proprietary investment products, which could limit the distribution of our products. Investors increasingly rely on external consultants and other third parties for advice on the choice of investment manager. These consultants and third parties tend to exert a significant degree of influence over their clients choices, and they may favor one of our competitors as better meeting their particular clients needs. There is no assurance that the Hennessy Funds will be among their recommended choices in the future.\nAdditionally, particularly in the United States, certain financial institutions have substantially reduced the number of investment funds they make available to their clients. If a material portion of the financial institutions with whom we do business were to substantially narrow their product offerings, it could have a significant adverse effect on our assets under management, revenues, and net income. More broadly, in both retail and institutional channels, financial institutions (distribution firms and consultants) are seeking to reduce the number of investment management firms with which they do business. This poses risks of additional lost business if a particular financial institution chooses to stop or significantly reduce its business relationship with us. Any failure to maintain strong business relationships with these financial institutions and the consultant community due to any of the above-described factors would impair our ability to distribute the Hennessy Funds, which in turn would have a negative effect on our assets under management, revenues, and net income.\nManagement contracts purchased by us are currently classified as an indefinite-life asset subject to impairment analysis. The impairment analysis is based on subjective criteria, and an impairment loss could be recorded.\nThe management contracts we have purchased, an $81.3 million asset on the balance sheet as of the end of fiscal year 2023, are considered an intangible asset with an indefinite useful life. Management reviews the indefinite life classification of our management contract asset each reporting period. If the management contract asset is ever reclassified as an asset with a definite life, we would begin amortizing the management contracts over their remaining useful life. If the management contract asset continues to be classified as an indefinite-life asset, we will continue to periodically review the carrying value to determine if any impairment has occurred. The impairment analysis is based on anticipated future cash flows, which are calculated based on assets under management. Although the management contract asset is not currently impaired, there is always a possibility of impairment in the future, which could require us to write off all or a portion of the asset. A write-off, depending on the amount, could have operational risks and could have a significant impact on the value of our equity and our earnings per share.\nWe may be required to forego all or a portion of our fees under our investment advisory agreements with the Hennessy Funds.\nOn an annual basis, the Funds Board of Trustees must assess the reasonableness of our investment advisory fees. While the Funds Board of Trustees has found our investment advisory fees to be reasonable in the past, we cannot guarantee that it will continue to do so. Additionally, we regularly analyze the expense ratios of the Hennessy Funds and have the right to waive fees to compete with other funds with lower expense ratios (although in the past we have only waived fees based on contractual obligations). Any waiver of or reduction in fees would cause our revenues to decline and could adversely affect our business, results of operations, and financial condition. Any fee waiver would apply only on a going-forward basis.\nThe Hennessy Japan Fund and the Hennessy Japan Small Cap Fund invest in the Japanese stock market in yen, which involves foreign exchange and economic uncertainties.\nThe Hennessy Japan Fund and the Hennessy Japan Small Cap Fund are invested in securities listed on the Japanese stock market, which exposes these funds to risks that are not typically associated with an investment in a U.S. issuer. The values of these funds fluctuate with changes in the value of the Japanese yen versus the U.S. dollar. Investments in Japanese securities also expose these funds to the economic uncertainties affecting Japan, which may differ from those affecting the United States. Further, Japanese financial accounting standards and practices may differ, and there may be less information on Japanese companies available publicly. If these circumstances result in a reduction in the total assets of the Hennessy Japan Fund and the Hennessy Japan Small Cap Fund, our assets under management would be reduced, which would adversely affect our revenues.\nWe utilize quantitative investment strategies for some of the Hennessy Funds that require us to invest in specific portfolios of securities and hold these positions for a specified period of time regardless of performance.\nOur formula-driven funds adhere to quantitative investment strategies, and the portfolios of stocks held by such funds are rescreened and rebalanced at designated times in accordance with such investment strategies. Adhering to our investment strategies regardless of any adverse developments that may arise could result in substantial losses to the formula-driven Hennessy Funds if, for example, the stocks selected for a fund are experiencing financial difficulty or are out of favor with investors in a given period. This could, in theory, result in relatively low performance of the formula-driven Hennessy Funds and adversely affect the net assets of such Hennessy Funds. A decrease in the net assets of the Hennessy Funds would adversely affect our revenues.\nWe pursue strategic asset purchases as part of our regular business strategy, and such acquisitions involve inherent risks that could adversely affect our operating results and financial condition and potentially dilute the holdings of current shareholders.\nAs part of our regular business strategy, we pursue strategic purchases of the assets related to the management of additional funds. This strategy is accompanied by risks including, among others, the possibility of the following:\n●\nthe potential unavailability of attractive acquisition opportunities;\n●\na high level of competition from other companies that may have greater financial resources than we do;\n●\nour inability to value potential asset purchases accurately and negotiate acceptable purchase terms;\n●\nour inability to obtain quorum and secure enough affirmative votes to gain approval of the proposed fund reorganization from the target funds investors;\n●\nthe loss of fund assets paid for in an asset purchase through redemptions by investors of the funds involved in the asset purchase;\n●\nhigher than anticipated asset purchase expenses;\n●\nour inability to successfully integrate and maintain adequate infrastructure to support business growth;\n●\nincreasing our leverage;\n●\nthe potential diversion of our managements time and attention;\n●\ndilution to our shareholders if we fund an asset purchase in whole or in part with our common stock; and\n●\nadverse effects on our earnings if purchased intangible assets become impaired.\nWhile we seek to mitigate these risks through, among other things, due diligence and indemnification provisions, these or other risk-mitigating measures that we put in place may not be sufficient to address these risks. If one or more of these risks occur, we may be unable to successfully complete a purchase of management-related assets (thereby requiring us to write off any related expenses), we may experience an impairment of our management contract asset, we may receive negative publicity or suffer other negative impacts on our reputation, and we may not achieve the expected return on investment. Any of these results could have an adverse effect on our business, results of operations, and financial condition.\nOur investment advisory and shareholder servicing agreements can be terminated on short notice, are not freely assignable, and must be renewed annually; the loss of such agreements would reduce our revenues.\nWe generate all of our operating revenues from the investment advisory and shareholder servicing agreements with the Hennessy Funds. These agreements may be terminated without penalty on 60 days notice and may not be assigned without the consent of investors in the Hennessy Funds. In addition, they each must be renewed annually by the Funds Board of Trustees (or, in the case of our investment advisory agreements, by the vote of a majority of the outstanding shares of the applicable Hennessy Fund), including a majority of the disinterested trustees. The termination or non-renewal of these agreements, or the renegotiation of the terms of these agreements in a manner detrimental to us, could result in a substantial reduction in revenues, which could have a material adverse effect on our business, results of operations, and financial condition.\nRISKS RELATING TO OUR INDUSTRY\nInvestor behavior is influenced by short-term investment performance.\nInvestor behavior may be based on many factors, including short-term investment performance. Poor short-term performance of the Hennessy Funds, irrespective of longer-term success, could potentially lead to a decrease in purchases of shares of the Hennessy Funds and an increase in redemptions, thereby reducing our assets under management and adversely affecting our revenues.\nAssets invested through financial institutions can be quickly redeemed, which could reduce our revenues.\nFinancial institutions are attractive to investors because of the ease of accessibility to a variety of funds, but this may cause the investments to be more sensitive to fluctuations in performance, especially in the short term. If we were unable to retain the assets of the Hennessy Funds held through financial institutions, our assets under management would be reduced. As a result, our revenues could decline and our business, results of operations, and financial condition could be materially adversely affected.\nWe face intense competition in attracting investors and retaining net assets in the Hennessy Funds.\nThe investment advisory industry is intensely competitive and new participants are continually entering the industry. We compete directly with numerous global and U.S. investment advisors, commercial banks, savings and loan associations, brokerage and investment banking firms, broker-dealers, insurance companies, and other financial institutions that often provide investment products with similar features and objectives to those we offer. These institutions range from small boutique firms to large financial services complexes. We are considered a small investment advisory company. Many competing companies are part of larger financial services companies that conduct business in more markets and have greater marketing, financial, technical, research, and distribution resources and other capabilities than we do. Most of the larger firms offer a broader range of financial services to the same retail and institutional investors that we seek to serve. If we are unable to attract investors and retain net assets in the Hennessy Funds due to increased competition, our revenues could decline and we could experience a material adverse effect on our business, results of operations, and financial condition.\nFor more information regarding competitive factors, see the Competition subheading in Item 1, Business.\nWe may be unable to develop or acquire new products and the development of new products may expose us to reputational harm, additional costs, or operational risk.\nOur continued financial performance may depend on our ability to react to changes in the asset management industry, respond to evolving investor demands and develop, market, and manage new investment products. Conversely, the development and introduction of new products, including the creation or acquisition of products with a focus on ESG matters, requires continued innovative effort on our part and may require significant time and resources, as well as ongoing support and investment. Substantial risks and uncertainties are associated with the introduction of new products, including the implementation of new and appropriate operational controls and procedures, shifting investor and market preferences, the introduction of competing products, constraints on our ability to manage growth, and compliance with regulatory and disclosure requirements. A growing number of new products also depend on data provided by third parties as analytical inputs and are subject to additional risks, including with respect to data quality, cost, availability, and provider relationships. There can be no assurance that we will be able to develop or acquire new products that address the needs of investors on the timescale they require. Any failure to successfully develop or acquire new products, or effectively manage associated operational risks, could harm our reputation and expose us to additional costs, which may reduce our assets under management and adversely affect our revenues.\nMarket consolidation and industry trends could negatively impact our business.\nIn recent years, there have been several instances of industry consolidation in both the distribution and investment management areas. Further consolidation may occur in these areas in the future. The increasing size and market influence of certain distributors of our products and of certain direct competitors may have a negative impact on our ability to compete at the same levels of profitability in the future. Additionally, the market environment has increasingly led some investors to favor lower-fee, passive products. As a result, investment advisors that emphasize passive products have gained, and may continue to gain, market share from active managers like us.\nIndustry trends and market pressure to lower our investment advisory fees could reduce our profit margin.\nOur profits are highly dependent on the fees we are able to charge to the Hennessy Funds for investment advisory services. To the extent we are forced to compete on the basis of the investment advisory fees we charge to the Hennessy Funds, we may not be able to maintain our current fee structures. We have historically competed primarily on the performance of the Hennessy Funds and not on the level of our investment advisory fees relative to those of our competitors. In recent years, however, there has been a trend toward lower fees in the investment advisory industry. To maintain our fee structures in a competitive environment, we must be able to provide investors in the Hennessy Funds with investment returns and service that will adequately compensate them for investing in our funds with our current fee structures. We may not succeed in maintaining our current fee structures, and fee reductions on existing or future business could have a material adverse effect on our results of operations.\nHigher insurance premiums and increased insurance coverage risks could increase our costs and reduce our profitability.\nWe carry insurance in amounts and under terms that we believe are appropriate, but we cannot guarantee that our insurance policies will cover all liabilities and losses to which we may be exposed or, if covered, that such liabilities and losses will not exceed insurance coverage limits or that our insurers will remain solvent and meet their obligations. In addition, insurance premiums and required retentions have increased in the past and may do so again in the future.\nWe are subject to regulatory and governmental inquiries and civil litigation. An adverse outcome of any such proceeding could involve substantial financial penalties. Various claims may also arise against us in the ordinary course of business, such as employment-related claims. There has been increased incidence of litigation and regulatory investigations in the financial services industry in recent years, including customer claims and class action suits alleging substantial monetary damages. Certain insurance coverage may not be available or may be prohibitively expensive in future periods. As our insurance policies come up for renewal, we may need to assume higher deductibles or co-insurance liabilities, or pay higher premiums, which would increase our expenses and have a material adverse effect on our results of operations.\nWe depend on information technology, and any failures of or damage to, attack on or unauthorized access to our information technology systems or facilities, or those of third parties with which we do business, including as a result of cyber-attacks, could result in significant limits on our ability to conduct our operations and activities, costs, and reputational damage.\nWe use software and related technologies throughout our business and also utilize third-party vendors who use software and related technologies to provide services to us and the Hennessy Funds. We are dependent on the effectiveness of our information and cybersecurity policies, procedures, and capabilities we maintain to protect our computer and telecommunications systems and the data that resides on or is transmitted through them, including data provided by third parties that is significant to our business. An information security incident, such as a cyber-attack involving a phishing scam, business email compromise, malware, or ransomware attack, or an internally caused incident or disruption, such as misuse or a failure to control access to sensitive systems, could materially interrupt our business operations or cause disclosure or modification of sensitive or confidential investor or competitive information. Moreover, our growing reliance on mobile and cloud technology and any failure by mobile technology and cloud service providers to adequately safeguard their systems and prevent cyber-attacks could disrupt our operations and result in misappropriation, corruption, or loss of personal, confidential, or proprietary information or third-party data. Additionally, although we take precautions to password protect and encrypt our laptops and other mobile electronic hardware, if such hardware is stolen, misplaced, or left unattended, it may become vulnerable to hacking or other unauthorized use, creating a possible security risk and resulting in potentially costly actions. Furthermore, there is a risk that encryption and other protective measures may be circumvented, particularly to the extent that new computing technologies increase the speed and computing power available.\nThe financial services industry has been the subject of cyber-attacks involving the dissemination, theft, and destruction of corporate information or other assets as a result of failure to follow procedures by employees or as a result of actions by third parties, including actions by terrorist organizations and nation-state actors. Although we have implemented policies and controls to prevent and address potential data breaches, inadvertent disclosures, increasingly sophisticated cyber-attacks, and cyber-related fraud, there can be no assurance that any of these measures will prove effective. Because the techniques used to obtain unauthorized access, disable, or degrade service or sabotage systems change frequently and often are not recognized until launched against a target, we may be unable to anticipate these techniques, to implement adequate preventative measures, or to address them until they are discovered. In addition, a successful cyber-attack may persist for an extended period of time before being detected, and it may take a considerable amount of time for an investigation to be completed and the severity and potential impact to be known. While such an investigation is ongoing, we may not necessarily know the extent of the harm or how best to remediate it, certain errors or actions could be repeated or compounded before they are discovered and remediated, and communication to the public, regulators, shareholders, and investors in the Hennessy Funds may be inaccurate, any or all of which could further increase the costs and consequences of an information security incident.\nIf any of these events were to occur, we could suffer a financial loss, a disruption of our business, liability to the Hennessy Funds and their investors, regulatory intervention, or reputational damage, any of which could have a material adverse effect on our business, results of operations, and financial condition. We also may be required to expend significant additional resources to modify our protective measures or to investigate and remediate vulnerabilities or other exposures. In addition, our cybersecurity insurance may not cover all losses and damages from such events and our ability to maintain or obtain sufficient insurance coverage in the future may be limited.\nFinally, cybersecurity and data privacy have become high priorities for regulators, and many jurisdictions are enacting laws and regulations in these areas. Enactment of privacy laws or regulations could, among other things, result in additional costs of compliance or litigation. In addition, while we strive to comply with the relevant laws and regulations, any failure to comply could result in regulatory investigations and penalties as well as negative publicity, which could materially adversely affect our business, results of operations, and financial condition.\nWe are exposed to legal risk and litigation, which could increase our expenses and reduce our profitability.\nWe are subject to a number of sources of potential legal liability, including, by way of example, investors in the Hennessy Funds, our own shareholders, our employees, or regulators. Lawsuits or investigations that we may become involved in could be very expensive and highly damaging to our reputation, even if the underlying claims are without merit.\nOur business is extensively regulated, which increases our costs of doing business, and our failure to comply with regulatory requirements may harm our financial condition.\nOur business is subject to extensive regulation in the United States, particularly by the SEC. We are subject to regulation under the Securities Act of 1933, as amended, the Exchange Act, the 1940 Act, the Advisers Act, and various other statutes. The laws to which we are subject are designed primarily to protect investors in the Hennessy Funds as opposed to our shareholders. In addition to an increased number of applicable laws, the investment fund industry has undergone increased scrutiny by the SEC and state regulators in recent years, resulting in numerous enforcement actions and sweep examinations. Increased regulation has increased our costs in managing the Hennessy Funds, and we could continue to experience higher costs if new laws require us to spend more time, hire additional personnel, or buy new technology to comply effectively. Any change in law could also have a material adverse effect on us by limiting the sources of our revenues and increasing our costs. In addition to securities regulations, our business also may be materially adversely affected by other types of laws and policies.\nAny determination of a failure to comply with applicable laws, rules, or regulations could expose us or our employees to civil liability, criminal liability, or disciplinary or enforcement action, with penalties that could include the disgorgement of fees, fines, sanctions, suspensions, or censure of individual employees, or revocation or limitation of business activities or registration, and may result in monetary losses that are not covered by insurance in adequate amounts or at all, any of which could have an adverse impact on our financial condition and results of operations. Further, if we or our employees were to fail to comply with applicable laws, rules, or regulations, or be named as a subject of an investigation or other regulatory action, the public announcement and potential publicity surrounding any such investigation or action could have an adverse effect on our reputation and our stock price and result in increased costs, even if we or our employees were found not to have violated such laws, rules, or regulations.\nChanges to U.S. or state tax laws, our failure to adequately comply with U.S. or state tax laws, or the outcome of any audits or regulatory disputes with respect to our compliance with U.S. or state tax laws could adversely affect us.\nChanges to U.S. or state tax law could be enacted in the future that could have a material adverse effect on our business, results of operations, and financial condition. Further, we are subject to potential tax audits in various jurisdictions and in such event, tax authorities may disagree with certain positions we have taken and assess penalties or additional taxes. While we assess regularly the likely outcomes of these potential audits, there can be no assurance that we will accurately predict the outcome of a potential audit, and an audit could have a material adverse impact on our business, results of operations, and financial condition.\nOur investment advisory agreements require us to adhere to the investment policies and strategies of the Hennessy Funds; any failure to comply with such requirements could result in claims, losses, or regulatory sanctions.\nOur investment advisory agreements with the Hennessy Funds contain contractual provisions that require us to comply with the investment policies and strategies of the Hennessy Funds when we provide our investment advisory services. We are also required to comply with numerous investment, asset valuation, distribution, and tax requirements under applicable law and regulations. Any allegation of a failure to adhere to these requirements could result in investor claims, reputational damage, withdrawal of assets, and potential regulatory sanctions, any of which could negatively impact our revenues and earnings. We have implemented procedures and utilize the services of experienced administrators, accountants, and lawyers to assist in satisfying these requirements, but there can be no assurance that these precautions will protect us from potential liabilities.\nWe may need to raise additional capital to fund new business initiatives, and resources may not be available to us in sufficient amounts or on acceptable terms, which could have an adverse impact on our business.\nOur ability to meet our future cash needs is dependent upon our ability to generate cash. Although we have been successful in generating sufficient cash in the past, we may not be successful in the future. We may need to raise additional capital to fund new business initiatives or repay the 2026 Notes, and financing may not be available to us in sufficient amounts, on acceptable terms, or at all. Our ability to access bank financing or capital markets efficiently depends on a number of factors, including the state of credit and equity markets, interest rates, and credit spreads. If we are unable to access sufficient capital on acceptable terms, our business could be adversely impacted.\nFailure to establish adequate controls and risk management policies, as well as circumvention of established controls and policies by employees, could harm us by impairing our ability to attract and retain investors in the Hennessy Funds and by subjecting us to significant legal liability, regulatory scrutiny, and reputational harm.\nOur reputation is critical to attracting and retaining investors in the Hennessy Funds. In recent years, there have been a number of highly publicized cases involving fraud, conflicts of interest, or other misconduct by individuals in the financial services industry. We have implemented controls and risk management policies to monitor and manage risks, but we cannot be certain that such controls and policies will successfully identify and manage internal and external risks. Further, although we strive to conduct our business in accordance with the highest ethical standards and emphasize the importance of doing so to our employees, there is a risk that our employees could engage in misconduct that adversely affects our business. For example, if an employee were to engage in, or be accused of engaging in, illegal or suspicious activity (such as improper trading, disclosure of confidential information, or breach of fiduciary duties), we could be subject to regulatory sanctions and suffer serious harm to our reputation, financial position, and ability to maintain and grow the number of investors in the Hennessy Funds.\nThe historical performance of the Hennessy Funds should not be considered indicative of the future results of the Hennessy Funds or of any returns expected on our common stock.\nThe historical performance of the Hennessy Funds is relevant to returns on our common stock only insofar as the fees we have earned in the past and may earn in the future, which are based on average assets under management, may impact the performance of our common stock. Positive performance of the Hennessy Funds typically increases our revenues, which in turn could positively affect our business, and poor performance typically reduces our revenues, which in turn could adversely affect our business. However, the historical and potential future returns of the Hennessy Funds are not directly linked to returns on our common stock, such that positive performance of the Hennessy Funds will not necessarily result in positive returns on our common stock and poor performance of the Hennessy Funds will not necessary result in negative returns on our common stock. Moreover, the historical performance of the Hennessy Funds should not be considered indicative of the future results that should be expected from such funds.\nRISKS RELATING TO OUR COMMON STOCK\nOwnership of a large percentage of our common stock is concentrated with a small number of shareholders, which could increase the volatility in our stock trading and significantly affect our share price and causes us to experience limited trading volume in our securities.\nWe have a limited number of shareholders, and a large percentage of our common stock is held by an even fewer number of shareholders. If our larger shareholders were to decide to liquidate their ownership positions, it could cause significant fluctuations in the share price of our common stock. Having a limited number of shareholders also causes us to experience limited trading volume in our securities.\nWe intend to pay regular dividends to our shareholders, but our ability to do so is subject to the discretion of our Board of Directors.\nWe have consistently paid dividends each year since 2005, but the declaration, amount, and payment of dividends to our shareholders by us are subject to the discretion of our Board of Directors. Our Board of Directors takes into account general economic and business conditions, our strategic plans, our financial results and condition, any contractual, legal, and regulatory restrictions on our payment of dividends, and such other factors as our Board of Directors deems relevant to determining whether to declare dividends and the amount of such dividends.  ITEM 2. PROPERTIES.\nOur principal executive office is located at 7250 Redwood Boulevard, Suite 200, Novato, California 94945, where we occupy approximately 13,728 square feet and have the right to use all common areas. We also lease office space in Austin, Texas, Dallas, Texas, Boston, Massachusetts, and Chapel Hill, North Carolina. We consider these arrangements to be suitable and adequate for the management and operations of our business. We do not own any real property. ITEM 3. LEGAL PROCEEDINGS.\nNone. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock trades on The Nasdaq Global Market under the stock symbol HNNA.\nWe have paid regular cash dividends to our shareholders and intend to continue to do so, although the declaration of a dividend is always subject to the discretion of our Board of Directors.\nAs of the end of fiscal year 2023, we had 127 holders of record of our common stock. In addition, there were 45 brokerage firm accounts that represent 1,977 additional individual shareholders for a total of 2,104 shareholders.\nThe equity compensation plan information required by Item 201(d) of Regulation S-K is set forth in the Equity Compensation Plan Information subheading under Item 12, Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nPURCHASES OF EQUITY SECURITIES BY THE ISSUER AND AFFILIATED PURCHASERS\nDuring fiscal year 2023, we repurchased shares underlying vested restricted stock units (RSUs) from employees to satisfy tax withholding obligations arising in connection with the vesting of RSUs. The stock repurchases are presented in the following table for the three months ended September 30, 2023:\nPeriod\nTotal Number of Shares Purchased\nAverage Price Paid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs\nMaximum Number of Shares that May Yet Be Purchased Under the Plans or Programs (1)\nJuly 1-31, 2023\n-\n$ -\n-\n596,368\nAugust 1-31, 2023 (2)\n7,849\n6.89\n-\n1,096,368\nSeptember 1-30, 2023 (2)\n26,343\n6.79\n-\n1,096,368\nTotal\n34,192\n$ 6.81\n-\n1,096,368\n(1)\nWe are authorized to purchase a maximum of 2,000,000 shares under our stock buyback program. We announced the stock buyback program in August 2010, and the program has no expiration date. In August 2022, the Board of Directors increased the number of shares that may be repurchased under the stock buyback program by 500,000 shares, to a total of 2,000,000 shares. We did not repurchase any shares pursuant to the stock buyback program during the three months ended September 30, 2023.\n(2)\nThe shares that we repurchased in August and September 2023 are not subject to a maximum per plan or program because we did not repurchase them pursuant to a plan or program.  ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFORWARD-LOOKING STATEMENTS\nThis report contains forward-looking statements within the meaning of the securities laws, for which we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. In some cases, forward-looking statements can be identified by terminology such as expect, anticipate, intend, may, plan, will, should, could, would, assume, believe, estimate, predict, potential, project, continue, seek, and similar expressions, as well as statements in the future tense. We have based these forward-looking statements on our current expectations and projections about future events, based on information currently available to us. Forward-looking statements should not be read as a guarantee of future performance or results, and will not necessarily be accurate indications of the times at which, or means by which, such performance or results will be achieved.\nForward-looking statements are subject to risks, uncertainties, and assumptions, including those described in the section titled Risk Factors and elsewhere in this Annual Report on Form 10-K. Unforeseen developments could cause actual performance or results to differ substantially from those expressed in or suggested by the forward-looking statements. Management does not assume responsibility for the accuracy or completeness of these forward-looking statements. There is no regulation requiring an update of any of the forward-looking statements after the date of this report to conform these statements to actual results or to changes in our expectations.\nOur business activities are affected by many factors, including, without limitation, redemptions by investors in the Hennessy Funds, taxes, general economic and business conditions, interest rate movements, inflation, the personal savings rate, competitive conditions, industry regulation, and fluctuations in the stock market, many of which are beyond the control of our management. Further, the business and regulatory environments in which we operate remain complex, uncertain, and subject to change. We expect that regulatory requirements and developments will cause us to incur additional administrative and compliance costs. Notwithstanding the variability in our economic and regulatory environments, we remain focused on the investment performance of the Hennessy Funds and on providing high-quality customer service to investors.\nOur business strategy centers on (i) the identification, completion, and integration of future acquisitions and (ii) organic growth, through both the retention of the fund assets we currently manage and the generation of inflows into the funds we manage. The success of our business strategy may be influenced by the factors discussed in Item 1A, Risk Factors. All statements regarding our business strategy, as well as statements regarding market trends and risks and assumptions about changes in the marketplace, are forward-looking by their nature.\nOVERVIEW\nOur primary business activity is providing investment advisory services to a family of 16 open-end mutual funds and one ETF branded as the Hennessy Funds. We manage 12 of the 17 Hennessy Funds internally. For the remaining five funds, we have delegated the day-to-day portfolio management responsibilities to sub-advisors, subject to our oversight. We oversee the selection and continued employment of each sub-advisor, review each funds investment performance, and monitor each sub-advisors adherence to each applicable funds investment objectives, policies, and restrictions. In addition, we conduct ongoing reviews of the compliance programs of sub-advisors and make onsite visits to sub-advisors, as feasible. Our secondary business activity is providing shareholder services to investors in the Hennessy Mutual Funds.\nWe derive our operating revenues from investment advisory fees paid to us by the Hennessy Funds and shareholder service fees paid to us by the Hennessy Mutual Funds. These fees are calculated as a percentage of the average daily net assets of each Hennessy Fund. The percentage amount of the investment advisory fees varies by fund. The percentage amount of the shareholder service fees is consistent across all Hennessy Mutual Funds, but shareholder service fees are charged on Investor Class shares only. The dollar amount of the fees we receive fluctuates with changes in the average net asset value of each Hennessy Fund, which is affected by each funds investment performance, purchases and redemptions of shares, general market conditions, and the success of our marketing, sales, and public relations efforts.\nU.S. equities had strong, positive performance for the one-year period ended September 30, 2023, with the S&P 500® Index returning 21.62% and the Dow Jones Industrial Average returning 19.18% for the period (on a total return basis). Equity prices advanced despite a rise in interest rates as it appears investors now expect that the Federal Reserve is likely to be near the end of raising the Federal Funds rate. The United States economy continues to create jobs with the unemployment rate now standing at 3.8% while inflation continues to moderate. The steady drop in inflation from levels one year ago, within the backdrop of a strong labor market, has helped to propel the stock market higher. The Consumer Price Index advanced 8.0% in 2022 and is expected to rise 4.1% in 2023, according to Bloomberg. While this current level is still above the Federal Reserves 2% target for inflation, the market seems to be pricing in the Federal Reserve standing on the sidelines for the foreseeable future. According to Bloomberg, the market is not expecting any reasonable chance of any Fed action until next July, when the market is pricing in a better than even chance of a rate cut.\nLong-term U.S. bonds increased meaningfully during the one-year period ended September 30, 2023, as the Federal Reserve continued raising the Federal Funds rate. With a yield curve that remains inverted, investor attention has focused on economic growth that continues to defy consensus expectations. While real GDP increased 1.9% in 2022, it is expected to accelerate slightly in 2023 with consensus growth expectation of 2.1%, according to Bloomberg. The idea that the economy was inevitably headed toward a recession has been reconsidered and the market seems to now believe that the economy, while perhaps slowing, is not likely to go into a recession. For the one-year period ended September 30, 2023, 10-year U.S. Government Bond yields rose from 3.83% to 4.57%.\nThe Japanese equity market increased 25.56% (in U.S. dollar terms) for the one-year period ended September 30, 2023, as measured by the Tokyo Stock Price Index (TOPIX). Like many other markets, Japans stock market has rebounded sharply from its weakness in the prior twelve-month period. A relatively strong earnings backdrop in Japan has been supported by the weakening of the yen and strong domestic demand. The market is now focusing its attention on the idea that the Bank of Japan could announce an end to negative interest rates by the end of the year.\nAgainst this positive equity performance backdrop, 14 of the 17 Hennessy Funds posted positive returns for the one-year period ended September 30, 2023. The longer-term performance numbers remain strong, with 13 of the Hennessy Funds posting positive returns for the three-year and five-year periods ended September 30, 2023, and all 14 Hennessy Funds with at least 10 years of operating history posting positive returns for the 10-year period ended September 30, 2023.\nAs always, we are committed to providing superior service to investors and employing a consistent and disciplined approach to investing based on a buy-and-hold philosophy that rejects the idea of market timing. Our goal is to provide products that investors can have confidence in, knowing their money is invested as promised and with their best interests in mind. Accordingly, we continually seek new and improved ways to support investors in the Hennessy Funds, including by providing market insights, sector highlights, and other resources to help them manage their fund investments with confidence. We operate a robust and leading-edge marketing automation and customer relationship management (CRM) system, with a database of over 100,000 financial advisors in addition to retail investors. We utilize this technology both to help retain assets and drive new purchases into the Hennessy Funds. We employ a comprehensive marketing and sales program consisting of content, digital, social media, and traditional marketing initiatives and proactive meetings. In addition, our consistent annual public relations campaign has resulted in the Hennessy brand name appearing on TV, radio, print, or online media on average once every two to three days.\nWe provide service to over 149,000 fund accounts nationwide, including accounts held by investors who employ financial advisors to assist them with investing as well as accounts held by retail investors who invest directly with us. We serve approximately 11,600 financial advisors who utilize the Hennessy Funds on behalf of their clients, including nearly 800 who purchased one of our Funds for the first time during fiscal year 2023. Approximately 14% of such advisors own two or more Hennessy Funds, and over 400 advisors hold a position of over $500,000. While numbers have declined in recent years, we continue to focus significant efforts on financial advisors who own two or more Hennessy Funds or hold a position of over $500,000 in an effort to build and maintain brand loyalty among our top tier of advisors.\nTotal assets under management as of the end of fiscal year 2023 was $3.0 billion, an increase of $0.1 billion, or 4.7%, compared to the end of fiscal year 2022. The increase in total assets was attributable to market appreciation, partially offset by net outflows of the Hennessy Funds.\nThe following table illustrates the year-by-year changes in our assets under management over the past three fiscal years:\nFiscal Years Ended September 30,\n(In thousands)\nBeginning assets under management\n$ 2,895,717\n$ 4,065,922\n$ 3,564,597\nAcquisition inflows\n43,088\n-\n-\nOrganic inflows\n598,119\n656,491\n818,358\nRedemptions\n(915,397 )\n(1,147,888 )\n(1,345,371 )\nMarket appreciation (depreciation)\n410,515\n(678,808 )\n1,028,338\nEnding assets under management\n$ 3,032,042\n$ 2,895,717\n$ 4,065,922\nAs stated above, the fees we receive for providing investment advisory and shareholder services are based on average assets under management. The following table shows average assets under management by share class over the past three fiscal years:\nFiscal Years Ended September 30,\n(In thousands)\nHennessy Mutual Funds\nInvestor Class\n$ 1,930,294\n$ 2,199,250\n$ 2,394,194\nInstitutional Class\n1,027,166\n1,445,112\n1,595,106\nHennessy Stance ESG ETF\n34,230\n-\n-\nAverage assets under management\n$ 2,991,690\n$ 3,644,362\n$ 3,989,300\nThe principal asset on our balance sheet, management contract asset, represents the capitalized costs incurred in connection with the purchase of the assets related to the management of investment funds. As of the end of fiscal year 2023, this asset had a net balance of $81.3 million, an increase of $0.4 million since the end of fiscal year 2022. The increase is related to the purchase of assets related to the management of an ETF that were reorganized into the Hennessy Stance ESG ETF and the costs associated with the definitive agreement signed with CCM in April 2023. (See Note 16 in Item 8, Financial Statements and Supplementary Data.)\nOn October 20, 2021, we completed a public offering of the 2026 Notes in the aggregate principal amount of $40.25 million, which included the full exercise of the underwriters overallotment option. The 2026 Notes mature on December 31, 2026, and may be redeemed in whole or in part at any time or from time to time at our option on or after December 31, 2023. The 2026 Notes bear interest at 4.875% per annum, payable on the last day of each calendar quarter and at maturity, beginning December 31, 2021. The 2026 Notes are direct unsecured obligations, rank equally in right of payment with any of our future unsecured unsubordinated indebtedness, senior to any of our future indebtedness that expressly provides that it is subordinate to the 2026 Notes, effectively subordinate to all of our existing and future secured indebtedness, and structurally subordinated to all existing and future indebtedness and other obligations of any future subsidiaries of ours. The 2026 Notes are the principal liability on our balance sheet at $39.2 million, net of issuance costs.\nRESULTS OF OPERATIONS\nThe following table sets forth items in the statements of income as dollar amounts and as percentages of total revenue:\nFiscal Years Ended September 30,\nAmounts\nPercent of Total Revenue\nAmounts\nPercent of Total Revenue\n(In thousands, except percentages)\nRevenue\nInvestment advisory fees\n$ 22,090\n92.0 %\n$ 27,468\n92.6 %\nShareholder service fees\n1,930\n8.0\n2,199\n7.4\nTotal revenue\n24,020\n100.0\n29,667\n100.0\nOperating expenses\nCompensation and benefits\n7,732\n32.2\n8,322\n28.0\nGeneral and administrative\n5,479\n22.8\n5,036\n17.0\nFund distribution and other\n2.0\n1.8\nSub-advisory fees\n3,759\n15.6\n5,727\n19.3\nDepreciation\n1.0\n0.7\nTotal operating expenses\n17,686\n73.6\n19,828\n66.8\nNet operating income\n6,334\n26.4\n9,839\n33.2\nInterest expense\n2,256\n9.4\n2,122\n7.2\nInterest income\n(2,522 )\n(10.5 )\n(229 )\n(0.8 )\nIncome before income tax expense\n6,600\n27.5\n7,946\n26.8\nIncome tax expense\n1,829\n7.6\n1,756\n5.9\nNet income\n$ 4,771\n19.9 %\n$ 6,190\n20.9 %\nRevenue - Investment Advisory Fees and Shareholder Service Fees\nTotal revenue comprises investment advisory fees and shareholder service fees. Comparing fiscal year 2023 to fiscal year 2022, total revenue decreased by 19.0%, from $29.7 million to $24.0 million, investment advisory fees decreased by 19.6%, from $27.5 million to $22.1 million, and shareholder service fees decreased by 12.2%, from $2.2 million to $1.9 million.\nThe decrease in investment advisory fees was due mainly to decreased average daily net assets of the Hennessy Funds. The decrease in shareholder service fees was due to a decrease in the average daily net assets held in Investor Class shares of the Hennessy Mutual Funds. Assets held in Investor Class shares of the Hennessy Mutual Funds are subject to a shareholder service fee, whereas assets held in Institutional Class shares of the Hennessy Mutual Funds are not subject to a shareholder service fee.\nWe collect investment advisory fees from each Hennessy Fund at differing annual rates. These annual rates range between 0.40% and 1.25% of average daily net assets. Average daily net assets of the Hennessy Funds for fiscal year 2023 was $3.0 billion, which represents a decrease of $0.7 billion, or 17.9%, compared to fiscal year 2022. The Hennessy Fund with the largest average daily net assets for fiscal year 2023 was the Hennessy Focus Fund, with $684 million. We collect an investment advisory fee from the Hennessy Focus Fund at an annual rate of 0.90% of average daily net assets. However, we pay a sub-advisory fee at an annual rate of 0.29% to the funds sub-advisor, which reduces the net operating profit contribution of the fund to our financial operations. The Hennessy Fund with the second largest average daily net assets for fiscal year 2023 was the Hennessy Gas Utility Fund, with $509 million. We collect an investment advisory fee from the Hennessy Gas Utility Fund at an annual rate of 0.40% of average daily net assets.\nTotal assets under management as of the end of fiscal year 2023 was $3.0 billion, an increase of $0.1 billion, or 4.7%, compared to the end of fiscal year 2022. The increase in total assets was attributable to market appreciation, partially offset by net outflows of the Hennessy Funds.\nThe Hennessy Funds with the three largest amounts of net inflows were as follows:\nFiscal Year Ended September 30, 2023\nFund Name\nAmount\nHennessy Cornerstone Mid Cap 30 Fund\n$ 169 million\nHennessy Japan Small Cap Fund\n$ 18 million\nHennessy Midstream Fund\n$ 1 million\nThe Hennessy Funds with the three largest amounts of net outflows were as follows:\nFiscal Year Ended September 30, 2023\nFund Name\nAmount\nHennessy Focus Fund\n$ (203) million\nHennessy Gas Utility Fund\n$ (89) million\nHennessy Japan Fund\n$ (82) million\nRedemptions as a percentage of assets under management decreased from an average of 2.6% per month during fiscal year 2022 to an average of 2.5% per month during fiscal year 2023.\nOperating Expenses\nComparing fiscal year 2022 to fiscal year 2023, total operating expenses decreased by 10.8%, from $19.8 million to $17.7 million. The decrease in operating expenses was primarily due to decreases in sub-advisory fee, compensation and benefits, and fund distribution and other expenses, partially offset by an increase in general and administrative and depreciation expenses. As a percentage of total revenue, total operating expenses increased 6.8 percentage points to 73.6%.\nCompensation and Benefits Expense: Comparing fiscal year 2022 to fiscal year 2023, compensation and benefits expense decreased by 7.1%, from $8.3 million to $7.7 million. As a percentage of total revenue, compensation and benefits expense increased 4.2 percentage points to 32.2%. The decrease in dollar value of compensation and benefits expense was due primarily to a decrease in head count and incentive-based compensation during fiscal year 2023.\nGeneral and Administrative Expense: Comparing fiscal year 2022 to fiscal year 2023, general and administrative expense increased by 8.8% from $5.0 million to $5.5 million. As a percentage of total revenue, general and administrative expense increased 5.8 percentage points to 22.8%. The increase in general and administrative expense was due to an increase in professional services, including investment banking, legal and marketing costs, in the current period.\nFund Distribution and Other Expense: The distribution component of fund distribution and other expense consists of fees paid to various financial institutions that offer the Hennessy Funds as potential investments to their clients. When the Hennessy Funds are purchased through one of these financial institutions, the institution typically charges an asset-based fee, which is recorded as a fund distribution expense on our statement of operations to the extent paid by us. The Hennessy Mutual Funds, with the exception of the Hennessy Stance ESG ETF, may be purchased directly, and when purchased directly, we do not incur any such expense. These fees generally increase or decrease in line with the net assets of the Hennessy Funds held through these financial institutions, which are affected by inflows, outflows, and fund performance. In addition, some financial institutions charge a minimum fee if the average daily net assets of a Hennessy Fund held by such an institution are less than a threshold amount. In such cases, we pay the minimum fee.\nThe distribution component of fund distribution and other expenses is affected by many factors, including the following:\n●\naverage daily net assets held by financial institutions;\n●\nthe split of average daily net assets held by financial institutions in Institutional Class shares of the Hennessy Mutual Funds versus Investor Class shares of the Hennessy Mutual Funds; and\n●\nfee minimums at various financial institutions.\nThe other component of fund distribution and other expense consists of fees incurred by us for the operations of the Hennessy Stance ESG ETF. We receive a unitary investment advisory fee from the Hennessy Stance ESG ETF and then pay all of its operating expenses (with limited exceptions), including fund administration, fund accounting, transfer agency, custody, licensing, audit, and tax services.\nComparing fiscal year 2022 to fiscal year 2023, fund distribution and other expense decreased by 9.3%, from $0.54 million to $0.49 million. As a percentage of total revenue, fund distribution and other expense increased 0.2 percentage points to 2.0%. The decrease in dollar value of fund distribution and other expense was primarily due to decreased average daily net assets of the Hennessy Mutual Funds, which in turn decreases the fees we pay to financial institutions. The decrease was partly offset by the expense associated with the operations of the Hennessy Stance ESG ETF that began in December 2022.\nSub-Advisory Fees Expense: Comparing fiscal year 2022 to fiscal year 2023, sub-advisory fees expense decreased by 34.4%, from $5.7 million to $3.8 million. As a percentage of total revenue, sub-advisory fees expense decreased 3.7 percentage points to 15.6%. The decrease in sub-advisory fees expense was due to a decrease in average daily net assets of the sub-advised Hennessy Funds, with an additional decrease as a result of us no longer paying sub-advisory fees with respect to the Hennessy Energy Transition Fund and the Hennessy Midstream Fund after January 31, 2022. The decrease was partly offset by the expense associated with new sub-advisory relationships relating to the Hennessy Stance ESG ETF that began in December 2022.\nDepreciation Expense: Comparing fiscal year 2022 to fiscal year 2023, depreciation expense increased by 11.1% from $0.21 million to $0.23 million due to additional fixed asset purchases. As a percentage of total revenue, depreciation expense increased 0.3 percentage points to 1.0%.\nInterest Expense\nComparing fiscal year 2022 to fiscal year 2023, interest expense increased by 6.3% from $2.1 to $2.3 million. The increase in interest expense was due to a full period of 2026 Notes interest expense incurred in the current period. The 2026 Notes were issued on October 20, 2021, and therefore incurred a partial period of interest expense in the first quarter of the prior comparable period.\nInterest Income\nComparing fiscal year 2022 to fiscal year 2023, interest income increased from $0.2 to $2.5 million. The increase was due to rising interest rates.\nIncome Tax Expense\nComparing fiscal year 2022 to fiscal year 2023, income tax expense increased by 4.2%, from $1.76 million to $1.83 million. The increase in income tax expense was due to a higher effective income tax rate, partially offset by lower net operating income in the current period. The higher effective tax rate in the current period is due to the release of a portion of uncertain tax benefit position in the prior comparable period, as discussed in Item 8, Financial Statements and Supplementary Data.\nNet Income\nComparing fiscal year 2022 to fiscal year 2023, net income decreased by 22.9%, from $6.2 million to $4.8 million. The decrease in net income was primarily due to decreased average assets under management in the current period, which resulted in lower revenue and net operating income.\nLIQUIDITY AND CAPITAL RESOURCES\nWe continually review our capital requirements to ensure that we have funding available to support our business model. Management anticipates that cash and other liquid assets on hand as of the end of fiscal year 2023 will be sufficient to meet our capital requirements for one year from the issuance date of this report, as well as our longer-term capital requirements for periods beyond one year from the issuance date of this report. To the extent that liquid resources and cash provided by operations are not adequate to meet long-term capital requirements, management plans to raise additional capital by either, or both, seeking bank financing or accessing the capital markets. There can be no assurance that we will be able to raise additional capital.\nOn October 20, 2021, we completed a public offering of our 2026 Notes in the aggregate principal amount of $40.25 million, which included the full exercise of the underwriters overallotment option. The 2026 Notes mature on December 31, 2026, and may be redeemed in whole or in part at any time or from time to time at our option on or after December 31, 2023. The 2026 Notes bear interest at 4.875% per annum, payable on the last day of each calendar quarter and at maturity, beginning December 31, 2021. The 2026 Notes are direct unsecured obligations, rank equally in right of payment with any of our future unsecured unsubordinated indebtedness, senior to any of our future indebtedness that expressly provides that it is subordinate to the 2026 Notes, effectively subordinate to all of our existing and future secured indebtedness, and structurally subordinated to all existing and future indebtedness and other obligations of any future subsidiaries of ours.\nOur total assets under management as of the end of fiscal year 2023 was $3.0 billion, an increase of $0.1 billion, or 4.7%, compared to the end of fiscal year 2022. The primary sources of our revenues, liquidity, and cash flow are our investment advisory fees and shareholder service fees, which are based on, and generated by, our average assets under management. Our average assets under management for fiscal year 2023 was $3.0 billion. As of the end of fiscal year 2023, we had cash and cash equivalents of $60.5 million.\nThe following table summarizes key financial data relating to our liquidity and use of cash:\nFiscal Years Ended September 30,\n(In thousands)\nNet cash provided by operating activities\n$ 7,134\n$ 8,665\nNet cash used in investing activities\n(819 )\n(231 )\nNet cash (used in) provided by financing activities\n(4,326 )\n34,217\nNet increase in cash and cash equivalents\n$ 1,989\n$ 42,651\nThe decrease in cash provided by operating activities of $1.5 million was mainly due to decreased net income in the current period.\nThe increase in cash used in investing activities of $0.6 million was due to the purchase of assets related to the management of an ETF that were reorganized into the Hennessy Stance ESG ETF and the costs associated with the definitive agreement signed with CCM in the current period.\nThe decrease in cash provided by financing activities of $38.5 million was due to the issuance of the 2026 Notes in the prior comparable period.\nDividend Payments. We have consistently paid dividends each year since 2005. Our quarterly dividend rate remained constant during fiscal years 2023 and 2022, and our dividend payments totaled $4.2 and $4.1 million in each such fiscal year, respectively.\n2026 Notes. On October 20, 2021, we completed a public offering of our 2026 Notes in the aggregate principal amount of $40.25 million, which included the full exercise of the underwriters overallotment option. The 2026 Notes bear interest at 4.875% per annum, payable on the last day of each calendar quarter and at maturity, beginning December 31, 2021. The 2026 Notes mature on December 31, 2026.\nCRITICAL ACCOUNTING POLICIES\nOur financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States, which require the use of estimates, judgments, and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the periods presented. These accounting policies, methods, and estimates are an integral part of the financial statements prepared by management and are based upon managements current judgments. Those judgments are normally based on knowledge and experience with regard to past and current events and assumptions about future events. Certain accounting policies, methods, and estimates are particularly sensitive because of their significance to the financial statements and because future events affecting them may differ markedly from managements current judgment. Described below are the accounting policies that we believe are most critical to understanding our results of operations and financial position.\nOur operating revenues consist of contractual investment advisory and shareholder service fees. We earn our investment advisory fees through portfolio management of the Hennessy Funds, and we earn our shareholder service fees by assisting investors in the Hennessy Mutual Funds. These fee revenues are earned and calculated daily by the Hennessy Funds accountants. In accordance with Financial Accounting Standards Board (FASB) guidance on revenue recognition, we recognize fee revenues monthly. Our contractual agreements provide persuasive evidence that an arrangement exists with fixed and determinable fees, and the services are rendered daily. The collectability is probable as the fees are received from the Hennessy Funds in the month subsequent to the month in which the services are provided.\nThe management contracts we have purchased are considered intangible assets with an indefinite life and we account for them in accordance with Accounting Standards Codification 350: Intangibles - Goodwill and Other (ASC 350). Pursuant to ASC 350, an entity first assesses qualitative factors to determine whether it is more likely than not that an indefinite-lived intangible asset is impaired as a basis for determining whether it is necessary to perform a quantitative impairment test. The more-likely-than-not threshold is defined as having a likelihood of more than 50 percent. If an entity determines that it is more likely than not that an indefinite-lived intangible asset is impaired, then it must conduct an impairment analysis. We were able to forego the annual impairment analysis for fiscal year 2023 as the more-likely-than-not threshold was not met as of the end of fiscal year 2023.\nThe costs related to our purchase of the assets related to the management of investment funds are capitalized as incurred. The costs are defined as an intangible asset per the FASB standard Intangibles - Goodwill and Other. The acquisition costs include legal fees, fees for soliciting shareholder approval, and a percent of asset costs to purchase the management contracts. The amounts are included in the management contract asset, totaling $81.3 million as of the end of fiscal year 2023.\nRECENTLY ISSUED AND ADOPTED ACCOUNTING STANDARDS\nWe reviewed accounting pronouncements issued between December 7, 2022, the filing date of our most recent previously filed Annual Report on Form 10-K, and December 6, 2023, the filing date of this Annual Report on Form 10-K, and have determined that no accounting pronouncement issued would have a material impact on our financial position, results of operations, or disclosures.\nThere have been no other significant changes to our critical accounting policies and estimates during fiscal year 2023.  ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to Financial Statements:\nReport of Independent Registered Public Accounting Firm\nBalance Sheets\nStatements of Income\nStatements of Changes in Stockholders Equity\nStatements of Cash Flows\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nof Hennessy Advisors, Inc.:\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Hennessy Advisors, Inc. (the Company) as of September 30, 2023 and 2022, the related statements of income, changes in stockholders equity and cash flows for each of the two years in the period ended September 30, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the two years in the period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of Management Contract Asset - Impairment Consideration\nAs described in Note 1(f) to the financial statements, the Company has historically capitalized the cost of purchasing management contracts as intangible assets. These intangible assets are considered to have indefinite useful lives and are therefore not amortized, but rather tested at least annually for impairment. As part of this annual test, management (i) evaluates whether events and circumstances indicate that it is more likely than not that impairment exists, and/or (ii) estimates the fair value of such intangible assets and compares it to the cost of the assets to determine whether impairment has occurred. Managements estimate of the fair value of management contract assets involves subjective assumptions that include stock market returns, fund flows and weighted average cost of capital.\nWe have determined that the valuation of management contract assets constitutes a critical audit matter for the following reasons: (i) it is a matter that should be communicated to the audit committee, since it involves a significant management estimate; (ii) it involves a material account balance; and (iii) it involves especially subjective auditor judgment.\nWe have addressed this critical audit matter by performing appropriate audit procedures. These procedures included (i) assessing managements evaluation of whether events or circumstances indicate that it is more likely than not that impairment exists; (ii) evaluating the reasonableness of managements fair value estimate assumptions; and (iii) testing the mathematical accuracy of managements valuation model. Professionals with specialized skills and knowledge were used to assist in evaluating of the measurement of the Companys estimated fair value of the management contract assets.\n/s/ Marcum LLP\nMarcum LLP\nWe have served as the Companys auditor since 2004.\nSan Francisco, CA\nDecember 6, 2023\nHennessy Advisors, Inc.\nBalance Sheets\n(In thousands, except share and per share amounts)\nSeptember 30,\nAssets\nCurrent assets\nCash and cash equivalents\n$ 60,476 $ 58,487\nInvestments in marketable securities, at fair value\n10 9\nInvestment fee income receivable\n2,046 2,051\nInterest income receivable\n253 100\nPrepaid expenses\n669 753\nOther accounts receivable\n247 257\nTotal current assets\n63,701 61,657\nProperty and equipment, net of accumulated depreciation of $2,287 and $2,057, respectively\n305 320\nOperating lease right-of-use asset\n295 651\nManagement contracts\n81,262 80,868\nOther assets\n156 156\nTotal assets\n$ 145,719 $ 143,652\nLiabilities and Stockholders' Equity\nCurrent liabilities\nAccrued liabilities and accounts payable\n$ 3,165 $ 3,320\nAccrued management contract payment\n- 210\nOperating lease liability\n279 367\nIncome taxes payable\n748 820\nTotal current liabilities\n4,192 4,717\nNotes payable, net of issuance costs\n39,164 38,870\nLong-term operating lease liability\n- 279\nNet deferred income tax liability\n14,611 13,488\nTotal liabilities\n57,967 57,354\nCommitments and contingencies (Note 10)\nStockholders' equity\nCommon stock, no par value, 22,500,000 shares authorized; 7,671,099 shares issued and outstanding as of September 30, 2023, and 7,571,741 as of September 30, 2022\n21,800 20,951\nRetained earnings\n65,952 65,347\nTotal stockholders' equity\n87,752 86,298\nTotal liabilities and stockholders' equity\n$ 145,719 $ 143,652\nSee Accompanying Notes to Financial Statements\nHennessy Advisors, Inc.\nStatements of Income\n(In thousands, except share and per share amounts)\nFiscal Years Ended September 30,\nRevenue\nInvestment advisory fees\n$ 22,090\n$ 27,468\nShareholder service fees\n1,930\n2,199\nTotal revenue\n24,020\n29,667\nOperating expenses\nCompensation and benefits\n7,732\n8,322\nGeneral and administrative\n5,479\n5,036\nFund distribution and other\nSub-advisory fees\n3,759\n5,727\nDepreciation\nTotal operating expenses\n17,686\n19,828\nNet operating income\n6,334\n9,839\nInterest expense\n2,256\n2,122\nInterest income\n(2,522 )\n(229 )\nIncome before income tax expense\n6,600\n7,946\nIncome tax expense\n1,829\n1,756\nNet income\n$ 4,771\n$ 6,190\nEarnings per share\nBasic\n$ 0.63\n$ 0.83\nDiluted\n$ 0.63\n$ 0.82\nWeighted average shares outstanding\nBasic\n7,580,120\n7,483,342\nDiluted\n7,603,676\n7,558,008\nCash dividends declared per share\n$ 0.55\n$ 0.55\nSee Accompanying Notes to Financial Statements\nHennessy Advisors, Inc.\nStatements of Changes in Stockholders' Equity\n(In thousands, except share data)\nCommon Stock\nRetained\nTotal Stockholders'\nShares\nAmount\nEarnings\nEquity\nBalance at September 30, 2021\n7,469,584\n$ 19,964\n$ 63,298\n$ 83,262\nNet income\n-\n-\n6,190\n6,190\nDividends paid\n-\n-\n(4,113 )\n(4,113 )\nEmployee and director restricted stock vested\n132,263\n-\n-\n-\nRepurchase of vested employee restricted stock for tax withholding\n(37,718 )\n(328 )\n(28 )\n(356 )\nShares issued for auto-investments pursuant to the 2021 Dividend Reinvestment and Stock Purchase Plan\n-\nShares issued for dividend reinvestment pursuant to the 2021 Dividend Reinvestment and Stock Purchase Plan\n7,141\n-\nStock-based compensation\n-\n1,252\n-\n1,252\nEmployee restricted stock forfeiture\n-\n(16 )\n-\n(16 )\nBalance at September 30, 2022\n7,571,741\n$ 20,951\n$ 65,347\n$ 86,298\nNet income\n-\n-\n4,771\n4,771\nDividends paid\n-\n-\n(4,166 )\n(4,166 )\nEmployee and director restricted stock vested\n124,015\n-\n-\n-\nRepurchase of vested employee restricted stock for tax withholding\n(34,192 )\n(233 )\n-\n(233 )\nShares issued for auto-investments pursuant to the 2021 Dividend Reinvestment and Stock Purchase Plan\n1,206\n-\nShares issued for dividend reinvestment pursuant to the 2021 Dividend Reinvestment and Stock Purchase Plan\n8,329\n-\nStock-based compensation\n-\n1,026\n-\n1,026\nEmployee restricted stock forfeiture\n-\n(17 )\n-\n(17 )\nBalance at September 30, 2023\n7,671,099\n$ 21,800\n$ 65,952\n$ 87,752\nSee Accompanying Notes to Financial Statements\nHennessy Advisors, Inc.\nStatements of Cash Flows\n(In thousands)\nFiscal Years Ended September 30,\nCash flows from operating activities\nNet income\n$ 4,771\n$ 6,190\nAdjustments to reconcile net income to net cash provided by operating activities\nDepreciation\nChange in right-of-use asset and operating lease liability\n(11 )\n-\nAmortization of note issuance costs\nDeferred income taxes\n1,123\n1,051\nEmployee restricted stock forfeiture\n(17 )\n(16 )\nStock-based compensation\n1,026\n1,252\nUnrealized loss (gain) on marketable securities\n(1 )\nChange in operating assets and liabilities:\nInvestment fee income receivable\nInterest income receivable\n(153 )\n(100 )\nPrepaid expenses\nOther accounts receivable\nOther assets\n-\nAccrued liabilities and accounts payable\n(155 )\n(831 )\nIncome taxes payable\n(72 )\n(230 )\nNet cash provided by operating activities\n7,134\n8,665\nCash flows from investing activities\nPurchases of property and equipment\n(215 )\n(216 )\nPayments related to management contracts\n(604 )\n(15 )\nNet cash used in investing activities\n(819 )\n(231 )\nCash flows from financing activities\nProceeds from issuance of notes, net of underwriting discount\n-\n39,042\nPayment of issuance costs on notes\n-\n(435 )\nRepurchase of vested employee restricted stock for tax withholding\n(233 )\n(356 )\nProceeds from shares issued pursuant to the 2021 Dividend Reinvestment and Stock Repurchase Plan\nDividend payments\n(4,102 )\n(4,039 )\nNet cash (used in) provided by financing activities\n(4,326 )\n34,217\nNet increase in cash and cash equivalents\n1,989\n42,651\nCash and cash equivalents at the beginning of the period\n58,487\n15,836\nCash and cash equivalents at the end of the period\n$ 60,476\n$ 58,487\nSupplemental disclosures of cash flow information\nCash paid for income taxes\n$\n$\nCash paid for interest\n$ 1,962\n$ 1,859\nDividend investment issued in shares\n$\n$\nPayment related to management contracts in accounts payable\n$ -\n$\nSee Accompanying Notes to Financial Statements\nNotes to Financial Statements\n(1)\nOrganization and Description of Business and Significant Accounting Policies\n(a)\nOrganization and Description of Business\nHennessy Advisors, Inc. (the Company) was founded on February 1, 1989, as a California corporation under the name Edward J. Hennessy, Incorporated. In 1990, the Company became a registered investment advisor, and on April 15, 2001, the Company changed its name to Hennessy Advisors, Inc.\nThe Companys operating activities consist primarily of providing investment advisory services to 16 open-end mutual funds and one exchange-traded fund (ETF) branded as the Hennessy Funds. The Company serves as the investment advisor to all classes of the Hennessy Cornerstone Growth Fund, the Hennessy Focus Fund, the Hennessy Cornerstone Mid Cap 30 Fund, the Hennessy Cornerstone Large Growth Fund, the Hennessy Cornerstone Value Fund, the Hennessy Total Return Fund, the Hennessy Equity and Income Fund, the Hennessy Balanced Fund, the Hennessy Energy Transition Fund, the Hennessy Midstream Fund, the Hennessy Gas Utility Fund, the Hennessy Japan Fund, the Hennessy Japan Small Cap Fund, the Hennessy Large Cap Financial Fund, the Hennessy Small Cap Financial Fund, and the Hennessy Technology Fund (collectively, the Hennessy Mutual Funds), as well as to the Hennessy Stance ESG ETF. The Company also provides shareholder services to investors in the Hennessy Mutual Funds.\nThe employee retention credit (ERC), as originally enacted on March 27, 2020, by the CARES Act, was a refundable tax credit against certain employment taxes equal to 50% of the qualified wages an eligible employer paid to employees and allowed claims through December 31, 2021, by eligible employers who retained employees during the COVID-19 pandemic. The Company filed Form 941-X to request an ERC from the Internal Revenue Service. In May 2023, the Company received an ERC of approximately $0.3 million plus accrued interest. For-profit entities do not have specific guidance to apply under accounting principles generally accepted in the United States to account for ERCs and therefore follow guidance in accordance with Accounting for Government Grants and Disclosure of Government Assistance (IAS 20). In accordance with IAS 20, the Company is netting the credit against related payroll expense in the current period.\nThe Companys operating revenues consist of contractual investment advisory and shareholder service fees paid to it by the Hennessy Funds. The Company earns investment advisory fees from each Hennessy Fund by, among other things:\n●\nacting as portfolio manager for the fund or overseeing the sub-advisor acting as portfolio manager for the fund, which includes managing the composition of the funds portfolio (including the purchase, retention, and disposition of portfolio securities in accordance with the funds investment objectives, policies, and restrictions), seeking best execution for the funds portfolio, managing the use of soft dollars for the fund, and managing proxy voting for the fund;\n●\nperforming a daily reconciliation of portfolio positions and cash for the fund;\n●\nmonitoring the liquidity of the fund;\n●\nmonitoring the funds compliance with its investment objectives and restrictions and federal securities laws;\n●\nmaintaining a compliance program (including a code of ethics), conducting ongoing reviews of the compliance programs of the funds service providers (including any sub-advisor), including their codes of ethics, as appropriate, conducting on-site visits to the funds service providers (including any sub-advisor) as feasible, monitoring incidents of abusive trading practices, reviewing fund expense accruals, payments, and fixed expense ratios, evaluating insurance providers for fidelity bond, directors and officers and errors and omissions insurance, and cybersecurity insurance coverage, managing regulatory examination compliance and responses, conducting employee compliance training, reviewing reports provided by service providers, and maintaining books and records;\n●\nif applicable, overseeing the selection and continued employment of the funds sub-advisor, reviewing the funds investment performance, and monitoring the sub-advisors adherence to the funds investment objectives, policies, and restrictions;\n●\noverseeing service providers that provide accounting, administration, distribution, transfer agency, custodial, sales, marketing, public relations, audit, information technology, and legal services to the fund;\n●\nmaintaining in-house marketing and distribution departments on behalf of the fund;\n●\npreparing or directing the preparation of all regulatory filings for the fund, including writing and annually updating the funds prospectus and related documents;\n●\nfor each annual report of the fund, preparing or reviewing a written summary of the funds performance during the most recent 12-month period;\n●\nmonitoring and overseeing the accessibility of the fund on financial institution platforms;\n●\npaying the incentive compensation of the funds compliance officer and employing other staff such as legal, marketing, national accounts, distribution, sales, administrative, and trading oversight personnel, as well as management executives;\n●\nproviding a quarterly compliance certification to the Board of Trustees of Hennessy Funds Trust (the Funds Board of Trustees); and\n●\npreparing or reviewing materials for the Funds Board of Trustees, presenting to or leading discussions with the Funds Board of Trustees, preparing or reviewing all meeting minutes, and arranging for training and education of the Funds Board of Trustees.\nThe Company earns shareholder service fees from Investor Class shares of the Hennessy Mutual Funds by, among other things, maintaining a toll-free number that the current investors in the Hennessy Funds may call to ask questions about their accounts and actively participating as a liaison between investors in the Hennessy Funds and U.S. Bank Global Fund Services.\nInvestment advisory and shareholder service fee revenues are earned and calculated daily by the Hennessy Funds accountants at U.S. Bank Global Fund Services and are subsequently reviewed by management.\nThe Company recognizes revenues when its obligations related to the investment advisory and shareholder services are satisfied, and it is probable that a significant reversal of the revenue amount would not occur in future periods. Management judgment is required in assessing the probability of significant revenue reversal and in identification of distinct services. Investment advisory and shareholder services are performed over time because investors in the Hennessy Funds are receiving and consuming the benefits as they are provided by the Company. Fees are based on contractual percentages of net asset values and recognized for services provided during the period, which are distinct from services provided in other periods. Such fees are affected by changes in net asset values, including market appreciation or depreciation, foreign exchange translation, and net inflows or outflows. Assets under management represent the broad range of financial assets the Company manages for the Hennessy Funds on a discretionary basis pursuant to investment management and shareholder servicing agreements that are expected to continue for at least 12 months. In general, reported assets under management reflect the valuation methodology that corresponds to the basis used for determining revenue. The fees are computed and billed monthly, at which time they are recognized in accordance with Accounting Standards Codification 606 - Revenue from Contracts with Customers.\nThe Company waives a portion of its fees with respect to the Hennessy Midstream Fund, the Hennessy Technology Fund, and the Hennessy Stance ESG ETF to comply with contractual expense ratio limitations. The fee waivers are calculated daily by the Hennessy Funds accountants at U.S. Bank Global Fund Services, reviewed by management, and then charged to expense monthly as offsets to the Companys revenues. Each waived fee is then deducted from investment advisory fee income and reduces the aggregate amount of advisory fees the Company receives from such fund in the subsequent month. To date, the Company has only waived fees based on contractual obligations, but the Company has the ability to waive fees at its discretion. Any decision to waive fees would apply only on a going-forward basis.\nThe Companys contractual agreements for investment advisory and shareholder services prove that a contract exists with fixed and determinable fees, and the services are rendered daily. The collectability is deemed probable because the fees are received from the Hennessy Funds in the month subsequent to the month in which the services are provided.\n(b)\nCash and Cash Equivalents\nCash and cash equivalents include all cash balances and highly liquid investments with original maturities of three months or less that are readily convertible into cash.\n(c)\nFair Value of Financial Instruments\nThe Financial Accounting Standards Board (FASB) guidance on Disclosures about Fair Value of Financial Instruments requires disclosures regarding the fair value of all financial instruments for financial statement purposes. The estimates presented in these financial statements are based on information available to management as of the end of fiscal years 2023 and 2022. Accordingly, the fair values presented in the Companys financial statements as of the end of fiscal years 2023 and 2022 may not be indicative of amounts that could be realized on disposition of the financial instruments. The fair value of receivables, accounts payable, and notes payable has been estimated at carrying value due to the short maturity of these instruments. The fair value of marketable securities and money market accounts is based on closing net asset values as reported by securities exchanges registered with the SEC.\n(d)\nInvestments\nInvestments in highly-liquid financial instruments with remaining maturities of less than one year are classified as short-term investments. Financial instruments with remaining maturities of greater than one year are classified as long-term investments. A table of investments is included in Note 3 in this Item 8, Financial Statements and Supplementary Data.\nThe Company holds investments in publicly traded mutual funds, which are accounted for as trading securities. Accordingly, unrealized gains and losses of less than $1,000 per year were recognized in operations for fiscal years 2023 and 2022.\nDividend income is recorded on the ex-dividend date. Purchases and sales of marketable securities are recorded on a trade-date basis, and realized gains and losses recognized on sale are determined on a specific identification/average cost basis.\n(e)\nProperty and Equipment\nProperty and equipment are stated at cost less accumulated depreciation. Depreciation is computed using the straight-line method over the estimated useful lives of the assets, generally between one and ten years.\n(f)\nManagement Contracts Purchased\nThroughout its history, the Company has completed 11 purchases of the assets related to the management of 31 different investment funds, some of which were reorganized into already existing Hennessy Funds. In accordance with FASB guidance, the Company periodically reviews the carrying value of its management contract asset to determine if any impairment has occurred. Although a quantitative analysis of the fair value of the management contract asset was not required, management performed a high-level analysis for internal purposes only. The fair value of the management contract asset was estimated as of the end of fiscal years 2023 and 2022 by applying the income approach and was based on management estimates and assumptions, including third-party valuations that utilize appropriate valuation techniques. The analysis further supported that there was no \"more-likely-than-not\" impairment trigger as of such dates.\nUnder Accounting Standards Codification 350 - Intangibles - Goodwill and Other, intangible assets that have indefinite useful lives are not amortized but are tested at least annually for impairment. The Company considered various factors, such as likelihood of continued renewal, whether there are foreseeable limits on net cash flows, and whether the Company is dependent on a limited number of investors, in determining the useful life of the management contracts. Based on analysis, the Company considers the management contract asset to be an intangible asset with an indefinite useful life and no impairment as of the end of fiscal year 2023.\nThe Company completed its most recent asset purchase on December 22, 2022, when it purchased certain assets related to the management of the Stance Equity ESG Large Cap Core ETF (the Stance ETF). This asset purchase added approximately $43 million to the Companys assets under management at the time of closing. The purchase was consummated in accordance with the terms and conditions of the Transaction Agreement, dated as of August 29, 2022, among the Company, Stance Capital, LLC, and Red Gate Advisers, LLC, among others. Upon completion of the transaction, the assets related to the management of the Stance ETF were reorganized into a newly formed series of Hennessy Funds Trust named the Hennessy Stance ESG ETF. In connection with the transaction, Stance Capital, LLC and Vident Investment Advisory, LLC (VIA) became sub-advisors to the Hennessy Stance ESG ETF. In July 2023, VIA completed an acquisition transaction that resulted in a change of control of VIA and automatic termination of the Companys sub-advisory agreement with VIA. On the same date, the Company entered into a new sub-advisory agreement with Vident Advisory, LLC. As of September 30, 2023, the Company capitalized a total of $0.2 million under this transaction, all of which remained payable as of September 30, 2022, and was paid during the year ended September 30, 2023.\nOn April 26, 2023, the Company announced that it has signed a definitive agreement with Community Capital Management, LLC (CCM) related to the management of the CCM Core Impact Equity Fund and the CCM Small/Mid-Cap Impact Value Fund (the CCM Equity Funds). The definitive agreement includes customary representations, warranties, and covenants of the parties to the agreement. It provides for payment by the Company to be made upon closing equal to 1.25% of the aggregate current net asset value of the CCM Equity Funds measured as of the close of business two trading days prior to the closing date of the transaction. The Company expects to complete the transaction during calendar 2023.\nIn the current period, the Company capitalized $0.2 million in legal costs related to the transaction. Upon completion of the transaction, the assets of the CCM Equity Funds will be reorganized into the Hennessy Stance ESG ETF. The transaction is subject to customary closing conditions, including the approval of the CCM Equity Funds shareholders.\n(g)\nIncome Taxes\nThe Company, under the FASB guidance on Accounting for Uncertainty in Income Tax, uses a recognition threshold and measurement attribute for the financial statement recognition and measurement of uncertain tax positions taken or expected to be taken in a companys income tax return and also provides guidance on derecognition, classification, interest and penalties, accounting in interim periods, disclosure, and transition. The Company utilizes a two-step approach for evaluating uncertain tax positions. The first step, recognition, requires the Company to determine if the weight of available evidence indicates that a tax position is more likely than not to be sustained upon audit, including resolution of related appeals or litigation processes, if any. The second step, measurement, is based on the largest amount of benefit that is more likely than not to be realized on ultimate settlement.\nThe Company believes the positions taken on its tax returns are fully supported, but tax authorities may challenge these positions and they may not be fully sustained on examination by the relevant tax authorities. Accordingly, the income tax provision includes amounts intended to satisfy assessments that may result from these challenges. Determining the income tax provision for these potential assessments and recording the related effects requires management judgement and estimates. The amounts ultimately paid on resolution of an audit could be materially different from the amounts previously included in the income tax provision and, therefore, could have a material impact on the Companys income tax provision, net income, and cash flows. The accrual for uncertain tax positions is attributable primarily to uncertainties concerning the tax treatment of the Companys domestic operations, including the allocation of income among different jurisdictions. For a further discussion on taxes, refer to Note 12 in this Item 8, Financial Statements and Supplementary Data.\nThe Company is subject to income tax in the U.S. federal jurisdiction and multiple state jurisdictions. The Companys U.S. federal income taxes for 2019 through 2023 remain open and subject to examination. The Company has identified 22 major state tax jurisdictions in which it is subject to income tax, which include California, Colorado, Connecticut, District of Columbia, Florida, Georgia, Illinois, Indiana, Iowa, Louisiana, Maryland, Massachusetts, Michigan, Minnesota, New Hampshire, New Jersey, New York, North Carolina, Oregon, Pennsylvania, Texas, and Wisconsin. For tax years that remain open, the below chart shows the number of such state tax jurisdictions that remain subject to examination by the appropriate governmental agencies:\nYear\nNumber of State Tax Jurisdictions\nFor state tax jurisdictions with unfiled tax returns, the statutes of limitations remains open indefinitely.\n(h)\nEarnings per Share\nBasic earnings per share is determined by dividing net earnings by the weighted average number of shares of common stock outstanding, while diluted earnings per share is determined by dividing net earnings by the weighted average number of shares of common stock outstanding adjusted for the dilutive effect of common stock equivalents, which consist of restricted stock units (RSUs).\n(i)\nEquity\nAmended and Restated 2013 Omnibus Incentive Plan\nThe Company has adopted, and the Companys shareholders have approved, the Amended and Restated 2013 Omnibus Incentive Plan (the Omnibus Plan), which provides for the issuance of options, stock appreciation rights, restricted stock, RSUs, performance awards, and other equity awards for the purpose of attracting and retaining executive officers, key employees, and outside directors and advisors and increasing shareholder value. The maximum number of shares that may be issued under the Omnibus Plan is 50% of the number of outstanding shares of common stock of the Company, subject to adjustment by the compensation committee of the Companys Board of Directors upon the occurrence of certain events. The 50% limitation does not invalidate any awards made prior to a decrease in the number of outstanding shares, even if such awards have result or may result in shares constituting more than 50% of the outstanding shares being available for issuance under the Omnibus Plan. Shares available under the Omnibus Plan that are not awarded in one particular year may be awarded in subsequent years.\nThe compensation committee of the Companys Board of Directors has the authority to determine the awards granted under the Omnibus Plan, including among other things, the individuals who receive the awards, the times when they receive them, vesting schedules, performance goals, whether an option is an incentive or nonqualified option, and the number of shares to be subject to each award. However, no participant may receive options or stock appreciation rights under the Omnibus Plan for an aggregate of more than 75,000 shares in any calendar year. The exercise price and term of each option or stock appreciation right is fixed by the compensation committee except that the exercise price for each stock option that is intended to qualify as an incentive stock option must be at least equal to the fair market value of the stock on the date of grant and the term of the option cannot exceed 10 years. In the case of an incentive stock option granted to a 10% or more shareholder, the exercise price must be at least 110% of the fair market value on the date of grant and cannot exceed five years. Incentive stock options may be granted only within 10 years from the date of shareholder approval of the Omnibus Plan (which was March 2014). The aggregate fair market value (determined at the time the option is granted) of shares with respect to which incentive stock options may be granted to any one individual, which stock options are exercisable for the first time during any calendar year, may not exceed $100,000. An optionee may, with the consent of the compensation committee, elect to pay for the shares to be received upon exercise of his or her options in cash, shares of common stock, or any combination thereof.\nUnder the Omnibus Plan, participants may be granted RSUs, each of which represents an unfunded, unsecured right to receive a share of the Companys common stock on the date specified in the recipients award. The Company issues new shares of its common stock when it is required to deliver shares to an RSU recipient. The RSUs granted under the Omnibus Plan vest over four years at a rate of 25% per year. The Company recognizes stock-based compensation expense on a straight-line basis over the four-year vesting term of each award.\nAll compensation costs related to RSUs vested during fiscal years 2023 and 2022 have been recognized in the financial statements.\nThe Company has available up to 3,835,550 shares of the Companys common stock in respect of granted stock awards, in accordance with terms of the Omnibus Plan.\nA summary of RSU activity is as follows:\nFiscal Years Ended September 30,\nShares\nWeighted Average Grant Date Fair Value per Share Shares\nWeighted Average Grant Date Fair Value per Share\nNon-vested balance at beginning of year\n315,561 $ 8.15 323,810 $ 8.87\nGranted\n159,700 5.53 132,875 7.72\nVested (1)\n(124,746 ) (8.22 ) (133,207 ) (9.42 )\nForfeited\n(5,360 ) (8.12 ) (7,917 ) (8.76 )\nNon-vested balance at end of year\n345,155 $ 6.91 315,561 $ 8.15\n(1)\nRepresents partially vested RSUs for which the Company already has recognized the associated compensation expense but has not yet issued to employees the related shares of common stock.\nAdditional information related to RSUs is as follows:\nSeptember 30, 2023\n(In thousands, except years)\nUnrecognized compensation expense related to RSUs\n$ 2,386\nWeighted average remaining period to expense for RSUs (in years)\n3.1\nDividend Reinvestment and Stock Purchase Plan\nIn January 2021, the Company adopted an updated Dividend Reinvestment and Stock Purchase Plan (the DRSPP), replacing the previous Dividend Reinvestment and Stock Purchase Plan that had been in place since 2018. The DRSPP provides shareholders and new investors with a convenient and economical means of purchasing shares of the Companys common stock and reinvesting cash dividends paid on the Companys common stock. Under the DRSPP, the Company issued 9,535 and 7,612 shares of common stock in fiscal years 2023 and 2022, respectively. The maximum number of shares that may be issued under the DRSPP is 1,470,000, of which 1,443,310 shares remained available for issuance as of September 30, 2023.\nStock Buyback Program\nIn August 2010, the Companys Board of Directors adopted a stock buyback program pursuant to which the Company was authorized to repurchase up to 1,500,000 shares of its common stock in the open market, in privately negotiated transactions, or otherwise. The program does not have an expiration date. In August 2022, the Board of Directors increased the number of shares that may be repurchased under the program to 2,000,000 shares. As a result, a total of 1,096,368 shares remains available for repurchase under the stock buyback program. The Company did not repurchase any shares of its common stock pursuant to the stock buyback program during fiscal year 2023.\n(j)\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates.\n(2)\nFair Value Measurements\nThe Company applies Accounting Standards Codification 820 - Fair Value Measurement for all financial assets and liabilities, which establishes a framework for measuring fair value and expands disclosures about fair value measurements. The standard defines fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. It also establishes a fair value hierarchy consisting of the following three levels that prioritize the inputs to the valuation techniques used to measure fair value:\n●\nLevel 1 - Unadjusted, quoted prices in active markets for identical assets or liabilities that an entity has the ability to access at the measurement date;\n●\nLevel 2 - Other significant observable inputs (including, but not limited to, quoted prices in active markets for similar assets or liabilities, quoted prices in markets that are not active for identical or similar assets or liabilities, and model-derived valuations in which all significant inputs and significant value drivers are observable in active markets); and\n●\nLevel 3 - Significant unobservable inputs (including the entitys own assumptions about what market participants would use to price the asset or liability based on the best available information) when observable inputs are not available.\nBased on the definitions, the following table represents the Companys assets categorized in the Level 1 to Level 3 hierarchies:\nSeptember 30, 2023\nLevel 1\nLevel 2\nLevel 3\nTotal\n(In thousands)\nMoney market fund deposits\n$ 59,382 $ - $ - $ 59,382\nMutual fund investments\n10 - - 10\nTotal\n$ 59,392 $ - $ - $ 59,392\nAmounts included in\nCash and cash equivalents\n$ 59,382 $ - $ - $ 59,382\nInvestments in marketable securities\n10 - - 10\nTotal\n$ 59,392 $ - $ - $ 59,392\nSeptember 30, 2022\nLevel 1\nLevel 2\nLevel 3\nTotal\n(In thousands)\nMoney market fund deposits\n$ 54,225 $ - $ - $ 54,225\nMutual fund investments\n9 - - 9\nTotal\n$ 54,234 $ - $ - $ 54,234\nAmounts included in\nCash and cash equivalents\n$ 54,225 $ - $ - $ 54,225\nInvestments in marketable securities\n9 - - 9\nTotal\n$ 54,234 $ - $ - $ 54,234\nThere were no transfers between levels during fiscal years 2023 or 2022.\nThe fair values of receivables, payables, and accrued liabilities approximate their book values given the short-term nature of those instruments.\nThe fair value of the 2026 Notes (see Note 9 in this Item 8, Financial Statements and Supplementary Data) was approximately $36.8 million as of September 30, 2023, based on the last trading price of the notes on that date (Level 1).\n(3)\nInvestments\nThe cost, gross unrealized gains, gross unrealized losses, and fair market value of the Companys trading investments were as follows:\nCost\nGross Unrealized Gains\nGross Unrealized Losses\nTotal\n(In thousands)\nMutual fund investments\n$\n$\n$ (20 )\n$\nTotal\n(20 )\nMutual fund investments\n$\n$\n$ (19 )\n$\nTotal\n(19 )\nThe mutual fund investments are included as a separate line item in current assets on the Companys balance sheets.\n(4)\nProperty and Equipment, Net\nThe following table summarizes the Companys property and equipment balances:\nSeptember 30,\n(In thousands)\nEquipment\n$ 786 $ 703\nLeasehold improvements\n154 154\nFurniture and fixtures\n399 396\nIT infrastructure\n87 85\nSoftware\n1,166 1,039\nProperty and equipment, gross\n2,592 2,377\nAccumulated depreciation\n(2,287 ) (2,057 )\nProperty and equipment, net\n$ 305 $ 320\nThe following useful lives are assigned to fixed assets: furniture is seven years, equipment is three years, and software ranges from one to three years. During each of fiscal year 2023 and 2022, depreciation expense was $0.2 million.\n(5)\nManagement Contracts\nThe costs related to the Companys purchase of the assets related to management contracts are capitalized as incurred and comprise the management contract asset. This asset was $81.3 million as of the end of fiscal year 2023, an increase of $0.4 million from the end of fiscal year 2022. The increase was related to expenses incurred in connection with the purchase of assets related to the management of the Stance ETF and the costs associated with the definitive agreement signed with CCM in the current period. The Company considers the management contract asset to be an intangible asset per Accounting Standards Codification 350 - Intangibles - Goodwill and Other. The purchase costs that comprise the management contract asset include consideration to the seller, as well as legal and similar external transaction costs.\n(6)\nInvestment Advisory Agreements\nThe Company has investment advisory agreements with Hennessy Funds Trust under which it provides investment advisory services to all classes of the 17 Hennessy Funds.\nThe investment advisory agreements must be renewed annually (except in limited circumstances) by (a) the Funds Board of Trustees or the vote of a majority of the outstanding shares of the applicable Hennessy Fund and (b) the vote of a majority of the trustees of Hennessy Funds Trust who are not interested persons of the Hennessy Funds. If an investment advisory agreement is not renewed, it terminates automatically. There are two additional circumstances in which an investment advisory agreement terminates. First, an investment advisory agreement automatically terminates if the Company assigns it to another advisor (assignment includes indirect assignment, which is the transfer of the Companys common stock in sufficient quantities deemed to constitute a controlling block). Second, an investment advisory agreement may be terminated prior to its expiration upon 60 days written notice by either the applicable Hennessy Fund or the Company.\nAs provided in each investment advisory agreement, the Company receives investment advisory fees monthly based on a percentage of the applicable funds average daily net asset value.\nThe Company has entered into sub-advisory agreements for the Hennessy Focus Fund, the Hennessy Equity and Income Fund, the Hennessy Japan Fund, the Hennessy Japan Small Cap Fund, and the Hennessy Stance ESG ETF. Under each of these sub-advisory agreements, the sub-advisor is responsible for the investment and reinvestments of the assets of the applicable Hennessy Fund in accordance with the terms of such agreement and the applicable Hennessy Funds Prospectus and Statement of Additional Information. The sub-advisors are subject to the direction, supervision, and control of the Company and the Funds Board of Trustees. The sub-advisory agreements must be renewed annually (except in limited circumstances) in the same manner as, and are subject to the same termination provisions as, the investment advisory agreements.\nIn exchange for the sub-advisory services, the Company (not the Hennessy Funds) pays sub-advisory fees to the sub-advisors out of its own assets. Sub-advisory fees are calculated as a percentage of the applicable sub-advised funds average daily net asset value.\nEffective January 31, 2022, the Company and BP Capital Fund Services, LLC mutually agreed to terminate the sub-advisory agreement for the Hennessy Energy Transition Fund and the Hennessy Midstream Fund. Those funds are now managed internally by the Company.\n(7)\nLeases\nThe Company determines if an arrangement is an operating lease at inception. Operating leases are included in operating lease right-of-use assets and current and long-term operating lease liabilities on the Companys balance sheet. During the quarter ended March 31, 2021, the Company renewed the lease for its office in Novato, California for an additional three years, which initially created a long-term operating lease as of such date. Upon renewal of the lease, the Company recorded a right-of-use asset of $1.1 million on its balance sheet. The renewed lease expires on July 31, 2024, and is therefore a short-term operating lease as of September 30, 2023. There were no other long-term operating leases as of the end of fiscal year 2023.\nRight-of-use assets represent the Companys right to use an underlying asset for the lease term and operating lease liabilities represent the Companys obligation to make lease payments arising from the lease. Operating lease right-of-use assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the lease term. In determining the present value of lease payments, the Company uses its incremental borrowing rate based on the information available at the lease commencement date. The Companys lease terms may include options to extend the lease when it is reasonably certain that it will exercise any such options. For its leases, the Company concluded that it is not reasonably certain that any renewal options would be exercise, and, therefore, the amounts are not recognized as part of operating lease right-of-use assets or operating lease liabilities. Leases with initial terms of 12 months or less and certain office equipment leases that are deemed insignificant are not recorded on the balance sheet and are expensed as incurred and included within rent expense under general and administrative expense. Lease expense related to operating leases is recognized on a straight-line basis over the expected lease terms.\nThe Companys most significant leases are real estate leases of office facilities. The Company leases office space under non-cancelable operating leases. Its principal executive office is located in Novato, California, and it has additional offices in Austin, Texas, Dallas, Texas, Boston, Massachusetts, and Chapel Hill, North Carolina. Only the office lease in Novato, California has been capitalized because the other operating leases have terms of 12 months or less, including leases that are month-to-month in nature. The classification of the Companys operating lease right-of-use assets and operating lease liabilities and other supplemental information related to the Companys operating leases are as follows:\nSeptember 30, 2023\n(In thousands, except years and percentages)\nOperating lease right-of-use assets\n$ 295\nCurrent operating lease liability\n$ 279\nLong-term operating lease liability\n$ -\nWeighted average remaining lease term\n0.8\nWeighted average discount rate\n0.90 %\nFor fiscal years 2023 and 2022, the Companys lease payments related to its operating lease right-of-use assets totaled $0.37 million and $0.36 million, respectively, and total rent expense for all offices, which is recorded under general and administrative expense in the statements of income, totaled $0.51 million and $0.49 million, respectively.\nThe undiscounted cash flows for future maturities of the Companys operating lease liabilities and the reconciliation to the balance of operating lease liabilities reflected on the Companys balance sheet are as follows:\nSeptember 30, 2023\n(In thousands)\nFiscal year 2024 undiscounted cash flows\nPresent value discount\n(7 )\nTotal operating lease liabilities\n$ 279\n(8)\nAccrued Liabilities and Accounts Payable\nDetails relating to the accrued liabilities and accounts payable reflected on the Companys balance sheet are as follows:\nSeptember 30,\n(In thousands)\nAccrued bonus liabilities\n$ 2,260\n$ 2,207\nAccrued sub-advisor fees\nOther accrued expenses\nTotal accrued expenses\n$ 3,165\n$ 3,320\n(9)\nDebt Outstanding\nOn October 20, 2021, the Company completed a public offering of 4.875% notes due 2026 in the aggregate principal amount of $40,250,000 (the 2026 Notes), which included the full exercise of the underwriters overallotment option. The initial net proceeds received were approximately $38,607,000 after considering the impact of issuance costs and underwriter discounts. The 2026 Notes bear interest at 4.875% per annum, payable on the last day of each calendar quarter and at maturity, beginning December 31, 2021. The 2026 Notes mature on December 31, 2026.\nThe 2026 Notes are direct unsecured obligations, rank equally in right of payment with any of the Companys future unsecured unsubordinated indebtedness, senior to any of the Companys future indebtedness that expressly provides that it is subordinate to the 2026 Notes, effectively subordinate to all of the Companys existing and future secured indebtedness, and structurally subordinated to all existing and future indebtedness and other obligations of any of the Companys future subsidiaries.\n(10)\nCommitments and Contingencies\nIn addition to the operating leases discussed in Note 7 in this Item 8, Financial Statements and Supplementary Data, the Company has contractual expense ratio limitations in place with respect to the Hennessy Midstream Fund, the Hennessy Technology Fund, and the Hennessy Stance ESG ETF. The contractual expense ratio limitations with respect to the Hennessy Midstream Fund and the Hennessy Technology Fund expire February 28, 2024. The contractual expense ratio limitation with respect to the Hennessy Stance ESG ETF expires December 31, 2024. Total fees waived during fiscal years 2023 and 2022 were $0.15 million and $0.11 million, respectively. To date, the Company has only waived fees based on contractual obligations but has the ability to waive fees at its discretion. Any decision to waive fees would apply only on a going forward basis.\nThe Company has no other commitments and no significant contingencies with original terms in excess of one year.\n(11)\nRetirement Plan\nThe Company has a 401(k) retirement plan covering eligible employees. Employees are eligible to participate if they are over 21 years of age and have completed a minimum of one month of service with at least 80 hours worked in that month. The Company also made discretionary profit-sharing contributions of $0.2 million in each of the fiscal years 2023 and 2022. To be eligible for the discretionary profit-sharing contribution, an employee must be eligible to participate in the 401(k) retirement plan and must complete at least 501 hours of service during the calendar year or be employed as of the last day of the calendar year.\n(12)\nIncome Taxes\nAs of the end of each of fiscal years 2023 and 2022, the Companys gross liability for unrecognized tax benefits related to uncertain tax positions was $0.4 million and $0.4 million, respectively. If the tax benefits of such amounts were recognized, $0.3 million and $0.3 million of such amounts, respectively, would decrease the Companys effective income tax rate. The Companys net liability for accrued interest and penalties was $0.3 million as of each of September 30, 2023, and September 30, 2022. The Company has elected to recognize interest and penalties related to unrecognized tax benefits as a component of income tax expense. During the years ended September 30, 2023, and September 30, 2022, the Company recognized approximately $0.05 million and $0.02 million in interest and penalties, respectively.\nThe Companys activity was as follows:\nFiscal Years Ended September 30,\n(In thousands)\nBeginning year balance\n$ 353 $ 608\nDecrease related to prior year tax positions\n- (255 )\nEnding year balance\n$ 353 $ 353\nThe total amount of unrecognized tax benefits can change due to final regulations, audit settlements, tax examinations activities, lapse of applicable statutes of limitations, and the recognition and measurement criteria under the guidance related to accounting for uncertainly in income taxes. The Company is unable to estimate what this change could be within the next 12 months, but does not believe it would be material to its financial statements.\nThe Companys income tax expense was as follows:\nFiscal Years Ended September 30,\n(In thousands)\nCurrent\nFederal\n$ 485 $ 854\nState\n221 (149 )\nTotal Current\n706 705\nDeferred\nFederal\n955 888\nState\n168 163\nTotal Deferred\n1,123 1,051\nTotal\n$ 1,829 $ 1,756\nThe principal reasons for the differences from the federal statutory income tax rate and the Companys effective tax rate were as follows:\nFiscal Years Ended September 30,\nFederal statutory income tax rate\n21.0 %\n21.0 %\nState income taxes, net of federal benefit\n4.0 3.9\nPermanent and other differences\n(0.4 ) 0.4\nDifference due to executive compensation\n0.7 1.0\nTax return to provision adjustments\n0.8 (1.3 )\nUncertain tax position\n0.9 (3.0 )\nStock-based compensation\n0.7 0.1\nEffective income tax rate\n27.7 %\n22.1 %\nThe tax effects of temporary differences that give rise to significant portions of deferred tax assets and liabilities were as follows:\nFiscal Years Ended September 30,\n(In thousands)\nDeferred tax assets\nAccrued compensation\n$ 37 $ 40\nStock compensation\n18 20\nState taxes\n176 175\nCapital loss carryforward\n7 7\nLease liability\n70 (1 )\nGross deferred tax assets\n308 241\nDisallowed capital loss\n(7 ) (7 )\nNet deferred tax assets\n301 234\nDeferred tax liabilities\nProperty and equipment\n(31 ) (35 )\nManagement contracts\n(14,807 ) (13,687 )\nROU asset\n(74 ) -\nTotal deferred tax liabilities\n(14,912 ) (13,722 )\nNet deferred tax liabilities\n$ (14,611 ) $ (13,488 )\n(13)\nEarnings per Share\nThe weighted average common shares outstanding used in the calculation of basic earnings per share and weighted average common shares outstanding, adjusted for common stock equivalents, used in the computation of diluted earnings per share were as follows:\nSeptember 30,\nWeighted average common stock outstanding, basic\n7,580,120 7,483,342\nDilutive impact of RSUs\n23,556 74,666\nWeighted average common stock outstanding, diluted\n7,603,676 7,558,008\nFor fiscal years 2023 and 2022, the Company excluded 100,569 and 282 common stock equivalents, respectively, from the diluted earnings per share calculations because they were not dilutive. In each case, the excluded common stock equivalents consisted of vested RSUs.\n(14)\nConcentration of Credit Risk\nThe Company maintains its cash accounts with three commercial banks that, at times, may exceed federally insured limits. The amount on deposit at September 30, 2023, exceeded the insurance limits of the Federal Deposit Insurance Corporation by approximately $1.1 million. In addition, total cash and cash equivalents include $59.3 million held in the First American U.S. Government Money Market Fund that is not federally insured. The Company believes it is not exposed to any significant credit risk on cash and cash equivalents.\n(15)\nRecently Issued and Adopted Accounting Standards\nThe Company has reviewed accounting pronouncements issued between December 7, 2022, the filing date of its most recent previously filed Annual Report on Form 10-K, and December 6, 2023, the filing date of this Annual Report on Form 10-K, and has determined that no accounting pronouncement issued would have a material impact on the Companys financial position, results of operations, or disclosures.\nThere have been no other significant changes to the Companys critical accounting policies and estimates during fiscal year 2023.\n(16)\nRisk and Uncertainties - Geopolitical Tensions\nThe short and long-term implications of Russias invasion of Ukraine and Hamas' attack against Israel are difficult to predict. Because of the highly uncertain and dynamic nature of these events, their impact on the Companys business, financial condition, or operating results cannot be reasonably estimated at this time.\n(17)\nPending Asset Purchase of the CCM Equity Funds\nOn April 26, 2023, the Company announced that it signed a definitive agreement with Community Capital Management, LLC to purchase the assets related to the management of the CCM Equity Funds. The Company filed a Current Report on Form 8-K regarding this transaction on April 26, 2023.\nUpon completion of the transaction, the assets related to the CCM Equity Funds will be reorganized into the Hennessy Stance ESG ETF.\nThe transaction is subject to customary closing conditions, including approval by the Board of Trustees of Hennessy Funds Trust, the Board of Trustees of the Quaker Investment Trust, and the shareholders of each of the CCM Equity Funds.\n(18)\nSubsequent Events\nAs of December 6, 2023, the filing date of this Annual Report on Form 10-K, management evaluated the existence of events occurring subsequent to the end of fiscal year 2023, and determined the following to be subsequent events:\nOn October 26, 2023, the Company announced a quarterly cash dividend of $0.1375 per share paid on November 27, 2023, to shareholders of record as of November 13, 2023. The declaration and payment of dividends to holders of the Companys common stock, if any, are subject to the discretion of the Companys Board of Directors. The Companys Board of Directors will take into account such matters as general economic and business conditions, the Companys strategic plans, the Companys financial results and condition, contractual, legal, and regulatory restrictions on the payment of dividends by the Company, and such other factors as the Companys Board of Directors may consider relevant.\nOn November 13, 2023, the Company completed the purchase of certain assets related to the management of the CCM Small/Mid-Cap Impact Value Fund. This asset purchase added approximately $12 million to the Companys assets under management at the time of closing. The purchase was consummated in accordance with the terms and conditions of that certain Transaction Agreement, dated as of April 26, 2023, between the Company and Community Capital Management, LLC. The purchase price of $0.2 million was funded with available cash and was based on the total net assets under management of the CCM Small/Mid-Cap Impact Value Fund as measured at the close of business on November 10, 2023. Upon completion of the transaction, the assets of CCM Small/Mid-Cap Impact Value Fund were reorganized into the Hennessy Stance ESG ETF.\nThe Special Meeting of shareholders of the CCM Core Impact Equity Fund has been adjourned to January 31, 2024. Pending shareholder approval, the assets of the CCM Core Impact Equity Fund will also be reorganized into the Hennessy Stance ESG ETF. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nMANAGEMENTS ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13a-15(f) of the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of September 30, 2023, using the criteria set forth in 2013 Internal Control - Integrated Framework 2013 issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, our management concluded that, as of September 30, 2023, the Companys internal control over financial reporting was effective based on those criteria.\nEVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nUnder the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) and 15d-15(e) of the Exchange Act, as of the end of the period covered by this report. Based on such evaluation, our principal executive officer and principal financial officer have concluded that our disclosure controls and procedures as of September 30, 2023, were effective to provide reasonable assurance that the information required to be disclosed by us in reports filed under the Exchange Act is (i) recorded, processed, summarized, and reported within the time periods specified in the rules and forms of the SEC, and (ii) accumulated and communicated to management, including the principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nCHANGES IN INTERNAL CONTROLS\nThere have been no changes in internal control over financial reporting as defined in Rules 13a-15(f) of the Exchange Act that occurred during the fiscal quarter ended September 30, 2023, and that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nThe information required by this item can be found in our Proxy Statement for our 2024 Annual Meeting (Proxy Statement) under the captions Election of Directors, Corporate Governance, and Executive Officers. Such information is incorporated by reference as if fully set forth in this report.\nCODE OF ETHICS\nWe have adopted a Code of Ethics that applies to our principal executive officer, principal financial officer, executive vice presidents, directors, and all employees. The code has been designed in accordance with the Sarbanes-Oxley Act of 2002 to promote honest and ethical conduct. The code also applies to Hennessy Funds Trust. The Code of Ethics is posted on our website at www.hennessyadvisors.com. In the event we amend or waive any of the provisions of the Code of Ethics, we intend to disclose these actions on our website. We are not including the information contained on our website as part of, or incorporating it by reference into, this report.\nAny person may obtain a copy of the Code of Ethics, at no cost, by forwarding a written request to:\nHennessy Advisors, Inc.\n7250 Redwood Blvd., Suite 200\nNovato, CA 94945\nAttention: Teresa Nilsen ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this item can be found in the Proxy Statement under the captions Director Compensation, Compensation Discussion and Analysis, and Executive Compensation. Such information is incorporated by reference as if fully set forth in this report. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nThe information required by this item can be found in the Proxy Statement under the caption Voting Information. Such information is incorporated by reference as if fully set forth in this report.\nEQUITY COMPENSATION PLAN INFORMATION\nOur Omnibus Plan, which was approved by our shareholders, is the only equity compensation plan under which we may issue our common stock.\nSeptember 30, 2023\nPlan Category\nNumber of Securities to Be Issued upon Exercise of Outstanding Options, Warrants, and Rights\nWeighted-Average Exercise Price of Outstanding Options, Warrants, and Rights\nNumber of Securities Remaining for Issuance Under Compensation Plans (2)\nEquity compensation plans approved by security holders (1)\n349,613\n-\n1,175,032\nEquity compensation plans not approved by security holders\n-\n-\n-\nTotal\n349,613\n-\n1,175,032\n(1)\nSecurities to be issued pursuant to outstanding RSUs that vest over four years at a rate of 25% per year, for which the weighted average exercise price is zero.\n(2)\nExcludes securities to be issued upon the vesting of outstanding RSUs. The maximum number of shares of common stock that may be issued under the Omnibus Plan is 50% of our outstanding common stock, or 3,835,550 shares, as of the end of fiscal year 2023. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information required by this item can be found in the Proxy Statement under the caption Corporate Governance. Such information is incorporated by reference as if fully set forth in this report. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this item can be found in the Proxy Statement under the caption Independent Registered Public Accounting Firm. Such information is incorporated by reference as if fully set forth in this report.\nPART IV ITEM 15. EXHIBIT AND FINANCIAL STATEMENT SCHEDULES\nThe financial statements and financial statement schedules for Hennessy Advisors, Inc. are included in Item 8, Financial Statements and Supplementary Data.\nExhibit Index\nSet forth below is a list of all exhibits to this Annual Report on Form 10-K, including those incorporated by reference.\nExhibits\n3.1\nAmended and Restated Articles of Incorporation (10)\n3.2\nFifth Amended and Restated Bylaws (12)\n4.1\nDescription of Securities (16)\n4.2\nIndenture, dated as of October 20, 2021, by and between the Registrant and U.S. Bank National Association, as trustee (15)\n4.3\nFirst Supplemental Indenture, dated as of October 20, 2021, by and between the Registrant and U.S. Bank National Association, as trustee (15)\n10.1\nLicense Agreement, dated as of April 10, 2000, between the registrant and Netfolio, Inc. (2)\n10.2\nInvestment Advisory Agreement, dated as of March 23, 2009, between the registrant and Hennessy Funds Trust (on behalf of the Hennessy Cornerstone Large Growth Fund) (3)\n10.3\nInvestment Advisory Agreement, dated as of October 25, 2012, between the registrant and Hennessy Funds Trust (on behalf of the Hennessy Focus Fund, the Hennessy Equity and Income Fund, the Hennessy Gas Utility Fund, the Hennessy Large Cap Financial Fund, the Hennessy Small Cap Financial Fund, and the Hennessy Technology Fund) (4)\n10.4\nInvestment Advisory Agreement, dated as of February 28, 2014, between the registrant and Hennessy Funds Trust (on behalf of the Hennessy Cornerstone Growth Fund, the Hennessy Cornerstone Mid Cap 30 Fund, the Hennessy Cornerstone Value Fund, the Hennessy Total Return Fund, the Hennessy Balanced Fund, the Hennessy Japan Fund, and the Hennessy Japan Small Cap Fund) (7)\n10.5\nFirst Amendment to Investment Advisory Agreement, dated as of March 1, 2016, between the registrant and Hennessy Funds Trust (on behalf of the Hennessy Cornerstone Growth Fund, the Hennessy Cornerstone Mid Cap 30 Fund, the Hennessy Cornerstone Value Fund, the Hennessy Total Return Fund, the Hennessy Balanced Fund, the Hennessy Japan Fund, and the Hennessy Japan Small Cap Fund) (9)\n10.6 First Amendment to Investment Advisory Agreement, dated as of February 28, 2017, between the registrant and Hennessy Funds Trust (on behalf of the Hennessy Focus Fund, the Hennessy Equity and Income Fund, the Hennessy Gas Utility Fund, the Hennessy Large Cap Financial Fund, the Hennessy Small Cap Financial Fund, and the Hennessy Technology Fund)\n10.7 Amended and Restated Investment Advisory Agreement, dated as of February 28, 2022, between the registrant and Hennessy Funds Trust (on behalf of the Hennessy Energy Transition Fund and the Hennessy Midstream Fund)\n10.8 Investment Advisory Agreement, dated as of December 22, 2022, between the registrant and Hennessy Funds Trust (on behalf of the Hennessy Stance ESG ETF)\n10.9 First Amendment to Investment Advisory Agreement, dated as of April 28, 2023, between the registrant and Hennessy Funds Trust (on behalf of the Hennessy Stance ESG ETF)\n10.10\nSub-Advisory Agreement, dated as of October 25, 2012, between the registrant and Broad Run Investment Management, LLC (for the Hennessy Focus Fund) (4)\n10.11\nSub-Advisory Agreement, dated as of October 25, 2012, between the registrant and The London Company of Virginia, LLC (for the Hennessy Equity and Income Fund (equity allocation)) (4)\n10.12\nSub-Advisory Agreement, dated as of October 25, 2012, between the registrant and FCI Advisors (for the Hennessy Equity and Income Fund (fixed income allocation)) (4)\n10.13\nSub-Advisory Agreement, dated as of February 28, 2014, between the registrant and SPARX Asset Management Co., Ltd. (for the Hennessy Japan Fund and the Hennessy Japan Small Cap Fund) (7)\n10.14\nFirst Amendment to Sub-Advisory Agreement, dated as of February 28, 2018, between the registrant and SPARX Asset Management Co., Ltd. (for the Hennessy Japan Fund and the Hennessy Japan Small Cap Fund) (13)\n10.15 Sub-Advisory Agreement, dated as of December 22, 2022, between the registrant and Stance Capital, LLC (for the Hennessy Stance ESG ETF (portfolio composition sub-advisor))\n10.16 First Amendment to Sub-Advisory Agreement, dated as of April 28, 2023, between the registrant and Stance Capital, LLC (for the Hennessy Stance ESG ETF (portfolio composition sub-advisor))\n10.17 Sub-Advisory Agreement, dated as of July 14, 2023, between the registrant and Vident Advisory, LLC (for the Hennessy Stance ESG ETF (trading sub-advisor))\n10.18\nSecond Amended and Restated Servicing Agreement, dated as of February 28, 2022, between the registrant and Hennessy Funds Trust (on behalf of all Hennessy Mutual Funds)\n10.19\nHennessy Advisors, Inc. Amended and Restated 2013 Omnibus Incentive Plan (6)\n10.20\nForm of Restricted Stock Unit Award Agreement for Employees (1)(5)\n10.21\nForm of Restricted Stock Unit Award Agreement for Directors (1)(5)\n10.22\nForm of Stock Option Award Agreement for Employees (1)(5)\n10.23\nForm of Stock Option Award Agreement for Directors (1)(5)\n10.24\nSecond Amended and Restated Bonus Agreement, dated as of January 26, 2018, between the registrant and Teresa M. Nilsen (1)(12)\n10.25\nAmended and Restated Bonus Agreement, dated as of October 10, 2016, between the registrant and Daniel B. Steadman (1)(9)\n10.26\nEmployment Agreement, dated as of January 26, 2018, between the registrant and Teresa M. Nilsen (1)(12)\n10.27\nFourth Amended and Restated Employment Agreement, dated as of February 22, 2019, between the registrant and Neil J. Hennessy (1)(14)\n23.1\nConsent of Marcum LLP, Independent Registered Public Accounting Firm\n31.1\nRule 13a-14a Certification of the Principal Executive Officer\n31.2\nRule 13a-14a Certification of the Principal Financial Officer\n32.1\nWritten Statement of the Principal Executive Officer, Pursuant to 18 U.S.C. § 1350\n32.2\nWritten Statement of the Principal Financial Officer, Pursuant to 18 U.S.C. § 1350\nHennessy Advisors, Inc. Compensation Recovery Policy\nFinancial statements from the Annual Report on Form 10-K of the registrant for the year ended September 30, 2023, filed on December 6, 2023, formatted in XBRL: (i) the Balance Sheets; (ii) the Statements of Income and Comprehensive Income; (iii) the Statements of Changes in Stockholders Equity; (iv) the Statements of Cash Flows; and (v) the Notes to Financial Statements.\nThe Cover Page Interactive Data File (the cover page XBRL tags are embedded in the Inline XBRL document).\nNotes:\n(1)\nManagement contract or compensatory plan or arrangement.\n(2)\nIncorporated by reference from the Companys Form SB-2 registration statement (SEC File No. 333-66970) filed August 6, 2001.\n(3)\nIncorporated by reference from the Companys Form 10-K for the fiscal year ended September 30, 2009 (SEC File No. 000-49872), filed December 4, 2009.\n(4)\nIncorporated by reference from the Companys Form 10-Q for the quarter ended December 31, 2012 (SEC File No. 000-49872), filed January 17, 2013.\n(5)\nIncorporated by reference from the Companys Current Report on Form 8-K (SEC File No. 000-49872) filed September 18, 2013.\n(6)\nIncorporated by reference to Annex A of the Companys definitive proxy statement on Schedule 14A for the Companys Special Meeting of Shareholders held on March 26, 2015 (SEC File No. 000-49872), filed February 21, 2014.\n(7)\nIncorporated by reference from the Companys Form 10-Q for the quarter ended June 30, 2014 (SEC File No. 001-36423), filed August 6, 2014.\n(8)\nIncorporated by reference from the Companys Current Report on Form 8-K (SEC File No. 001-36423) filed October 13, 2016.\n(9)\nIncorporated by reference from the Companys Form 10-K for the fiscal year ended September 30, 2016 (SEC File No. 001-36423), filed December 1, 2016.\n(10)\nIncorporated by reference from the Companys Current Report on Form 8-K (SEC File No. 001-36423) filed March 7, 2017.\n(11)\nIncorporated by reference from the Companys Current Report on Form 8-K (SEC File No. 001-36423) filed May 11, 2017.\n(12)\nIncorporated by reference from the Companys Current Report on Form 8-K (SEC File No. 001-36423) filed January 25, 2018.\n(13)\nIncorporated by reference from the Companys Form 10-Q for the quarter ended March 31, 2018 (SEC File No. 001-36423), filed May 2, 2018.\n(14)\nIncorporated by reference from the Companys Current Report on Form 8-K (SEC File No. 001-36423) filed February 25, 2019.\n(15)\nIncorporated by reference from the Companys Current Report on Form 8-K (SEC File No. 001-36423), filed October 20, 2021.\n(16)\nIncorporated by reference from the Companys Form 10-K for the fiscal year ended September 30, 2021 (SEC File No. 001-36423), filed November 24, 2021.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized:\nHennessy Advisors, Inc.\n(Registrant)\nDate: December 6, 2023\nBy: /s/ Teresa M. Nilsen\nTeresa M. Nilsen\nPresident, Chief Operating Officer, Secretary, and Director\n(As a duly authorized officer on behalf of the registrant and as Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nBy: /s/ Kathryn R. Fahy\nDate: December 6, 2023\nKathryn R. Fahy\nChief Financial Officer and Senior Vice President\n(Principal Financial and Accounting Officer)\nBy: /s/ Neil J. Hennessy\nDate: December 6, 2023\nNeil J. Hennessy\nChief Executive Officer and Chairman of the Board of Directors\nBy: /s/ Henry Hansel\nDate: December 6, 2023\nHenry Hansel\nDirector\nBy: /s/ Brian A. Hennessy\nDate: December 6, 2023\nBrian A. Hennessy\nDirector\nBy: /s/ Lydia Knight-ORiordan\nDate: December 6, 2023\nLydia Knight-ORiordan\nDirector\nBy: /s/ Kiera Newton\nDate: December 6, 2023\nKiera Newton\nDirector\nBy: /s/ Susan W. Pomilia\nDate: December 6, 2023\nSusan W. Pomilia\nDirector\nBy: /s/ Thomas L. Seavey\nDate: December 6, 2023\nThomas L. Seavey\nDirector"
}