{
    "cik": "1230524",
    "company": "Cyber Apps World",
    "filing_type": "10-K",
    "filing_date": "2023-10-25",
    "period_of_report": "2023-07-31",
    "sic": "8742",
    "state_of_inc": "NV",
    "state_location": "V8",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1230524/0001477932-23-007851-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1230524/000147793223007851/cyap_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1230524/0001477932-23-007851.txt",
    "filename": "1230524_10K_2023_0001477932-23-007851.htm",
    "content": "Item 1. Business.\nPrior Operations\nWe were incorporated on July 15, 2002, under the laws of the State of Nevada under the name Titan Web Solutions, Inc. with a view to offering a full range of business consulting services in the retail specialty coffee industry in China.\nOn April 9, 2015, we merged with our wholly owned subsidiary Cyber Apps World Inc. and concurrently changed our name to Cyber Apps World Inc. Our business focused on the development of mobile applications focusing on allowing users around the world to save money on products and services from member merchants and suppliers instantly with mobile coupons, using their desktops and/or mobile devices, including smartphones. We have not been successful in developing revenue from our operations.\nRecent Developments\nOn July 6, 2023, JanBella Group, LLC (JanBella Group), a family office, acquired 100,000 outstanding shares of Super A Voting Preferred Stock (the Series A Preferred Shares) in satisfaction of a promissory note made by the Company in favor of JanBella Group. The Series A Preferred Shares had been pledged to secure a note made by the Company to JanBella. Thereupon, Mohammed Irfan Raimiya Kazi, the Company's Chief Executive Officer and a director and Kateryna Malenko, the Companys Secretary and a director, resigned as officers and directors of the Company and William Alessi, an affiliate of JanBella Group, was appointed the sole officer and director of the Company. The Series A Preferred Shares entitle the holder thereof to 99.97% of the voting power of the Company.\nOn August 23, 2023, JanBella Group sold the Series A Preferred Shares to Zenith Energy Ltd. (Zenith Energy). Zenith Energy is a British Columbia corporation based in Vancouver, B.C., engaged in energy production projects on three continents, whose shares are traded on the London Stock Exchange and Euronext Oslo.\nIn the change in control transaction, Zenith Energy acquired the 100,000 Series A Preferred Shares, representing 99.87% of the voting power of the Company, from JanBella for consideration of approximately $398,400. As part of the transaction, William Alessi, the sole officer and director of the Company, appointed Luca Benedetto, Ippolito Cattaneo, and Dario Sodero as directors of the Company (with Messrs. Cattaneo's and Sodero's appointment subject to compliance by CYAP with Rule 14f-l under the Securities Exchange Act of 1934). Thereafter, Mr. Alessi resigned as CYAP's sole director and officer.\nIn addition to the foregoing, Mr. Benedetto was appointed President and Treasurer of the Company and Mr. Cattaneo was appointed as the Company's Secretary.\nIn addition to continuing with its present business, the Company is exploring potential expansion into other business sectors, particularly the acquisition of energy production and development opportunities in the U.S. Zenith Energy has advised us that intends to invest in the Company in order to enable it to accomplish future expansion.\nPrivacy and Value Software\nOn March 15, 2022, we entered into an agreement to acquire employee monitoring software known as Privacy and Value. We amended this agreement on April 20, 2022, and September 28, 2022. The software product attempts to balance employer concerns regarding employee efficiency and productivity with employee privacy.\nAs companies are increasingly attempting to meet the demands of employees that want work environment flexibility and are forced to avoid employee congregation in response to the current global Covid-19 pandemic, they are retaining staff that either work from home or they rely on outsourcing to retain employees and independent contractors in other countries. One of the primary concerns with having staff work in a separate location that removes them from the daily, direct oversight of management is that employee productivity will suffer. One of the responses to this concern is for businesses to use some form of worker surveillance in order to ensure that employees are utilizing their work time efficiently. However, businesses may face pushback from their staff due to concerns that their personal privacy is compromised when they are subject to constant monitoring during work hours. They may resist practices such as webcam surveillance or persistent computer screen observation.\nTo address employer concerns regarding staff efficiency and employee concerns regarding privacy, we intend to market and sell the Privacy and Value software that has features to monitor worker computer productivity while providing employees with reasonable privacy during their work days. The features of the software are as follows:\n·\nthe software will monitor the employees' computer desktops while they are actually working on the system. Surveillance will commence when an employee logs on to his or her computer through our software and will continue until the employee logs out of the system. After an employee signs out of the software, recording and monitoring will cease and the employee can access his or her computer contents and the Internet for personal purposes;\n·\nwhen the employee is logged in, the software will allow management to maintain real-time access to employee activity and to view each employee's desktop screen content and the keystrokes that the employee is typing. All of this information will also be recorded and stored for future management use with all information time stamped. The file name for each day's recording will be the employee's first name, last name, and the year, month, and day, which will allow a manager to identify the appropriate recording without difficulty;\n·\nbased on employee actions, the software will calculate the amount of time that the employee was logged into the system based on a searchable time period (e.g., a shift, a week, or a month). It will also indicate the length of various time periods during which the employee did not make any keystrokes on his or her computer; and\n·\nallow the manager to quickly access the recording of employee's desktop at the times when keystrokes commenced and stopped. The software will also provide details of the length of each break that the employee takes during the work period analyzed. It will also have tools that the manager can use, in tabular and graphic form, to compare the efficiency of employees in terms of keystrokes and time logged in to their computer.\nThe agreement with the vendor provided that in consideration of the vendor selling the Privacy and Value software to us, CYAP would:\n(a)\npay $10,000 to the vendor, which amount was paid in August 2023); and\n(b)\npay an amount equal to the estimation of value of a 50% interest in the software and the related data and databases based on an independent business valuation completed by a valuator who is accredited by the American Society of Appraisers and acceptable to both parties less the $10,000 cash payment noted above. The Company is currently evaluating whether to complete the acquisition of the remaining 50% interest in the software.\nFriendly and Fast Delivery Service\nWe are currently developing a delivery computer application known as Friendly and Fast. The application is being designed to allow users to order food, groceries, and other courier services. Friendly and Fast's focus will strictly be delivery of goods.\nFriendly and Fast will target both individuals and corporate customer segments. For corporate clients, this feature will give discounts to restaurant owners, grocery stores, couriers, and similar enterprises so they can affordably provide deliveries to their customers. We are currently organizing beta testing of the application in Ahmedabad, India and have commissioned a private Company to be primarily responsible for the completion of the application development.\nFinancial Condition\nOur financial statements for the year ended July 31, 2023, have been prepared on a going concern basis which contemplates the realization of assets and settlement of liabilities and commitments in the normal course of business. We have not generated any significant revenue as of July 31, 2023. Management recognizes that our continued existence is dependent upon its ability to obtain needed working capital through additional equity and/or debt financing and revenue to cover expenses as we continue to incur losses.\nSince our incorporation, we have financed our operations almost exclusively through our sale of equity and through advances from our shareholders. Management's plans are to finance operations through the sale of equity or other investments for the foreseeable future, as we may not receive significant revenue from our and proposed business operations. There is no guarantee that we will be successful in arranging financing on acceptable terms.\nOur ability to raise additional capital is affected by trends and uncertainties beyond its control. We do not currently have any arrangements for financing, and we may not be able to find such financing if required. Obtaining additional financing would be subject to a number of factors, including investor sentiment. Market factors may make the timing, amount, terms or conditions of additional financing unavailable to us. These uncertainties raise substantial doubt about our ability to continue as a going concern.\nCompetition\nFriendly and Fast Application\nThere is intense competition between traditional taxi and courier companies, and delivery service companies. Companies providing ride-hailing services are transitioning from providing traditional taxi services to additional services, such as ride sharing and food and consumer goods delivery, in order to expand the overall market for transportation services.\nThe delivery service market is quite fragmented as there is high competition in the market among major players. Since this market is expanding, new entrants are emerging as well. We will compete with other delivery service companies, including Uber Eats, Skip The Dishes, Door Dash, and Grubhub that are well-established in North America. In other markets where we may wish to expand, there are also well-established regional companies, such as DiDi (China), Ola (India), Grab (southeast Asia), Bolt (Europe, Africa, and the Middle East), and Cabify (South America). These companies generally have greater financial and technical resources, industry expertise, and managerial capabilities than we do. Most of our competitors benefit from established brand awareness with current and prospective customers.\nWe believe that industry competition for customers is primarily based on brand recognition, marketing, price, and quality of service. We hope to be able to compete effectively based on these factors though we primarily hope to develop a niche market by providing lower commission charges to restaurants that agree to utilize our food delivery services and by developing underexplored markets, such as businesses that use local courier services for non-food deliveries and rely on traditional vehicle courier companies.\nPrivacy and Value Software\nThe software and computer application development business are also extremely fragmented and competitive. The sector includes large, established corporations that develop their products in-house and have the capability and financial resources necessary in order to launch and market their products, as well as large custom software development companies that design products according to client specifications, such as Praxent, Orases, 10Pearls, Fingent, Tack Mobile, and Mercury Development. Additionally, there are smaller niche market participants that focus on a single or small number of products that are well-tailored to specific commercial or consumer demands. Many of these competitors have international operations and are able to not only compete in terms of software quality, but also based on price given their access to software development talent in developing countries, such as India, where skilled labor is less expensive.\nPatents and Trademarks\nDue to the costs involved and the potential inability to qualify, we have not filed for patent protection of our products and our trademarks. We have not sought legal advice regarding whether or not patent protection of our technology is possible. Accordingly, our business is subject to the risk that competitors could either copy our technology or release competing products.\nGovernment Regulation\nWe are subject to laws that require protection of user privacy and user data. In our processing of account registrations, we will receive and store a large volume of personally identifiable data. This data is increasingly subject to laws and regulations in numerous jurisdictions around the world, including the United States through its Privacy Act and the Commission of the European Union through its General Data Protection Regulation. Such government action is typically intended to protect the privacy of personal data that is collected, processed, and transmitted in or from the governing jurisdiction.\nIn addition, our long-term business strategy may include geographic expansion into additional jurisdictions, many of which regions and countries have different legislation, regulatory environments, and tax laws. Compliance with legal, regulatory, and tax requirements around the world places demands on our time and resources, and we may nonetheless experience unforeseen and potentially adverse legal, regulatory, or tax consequences, which may have an adverse effect on our business.\nResearch and Development\nWe have not incurred any expenditures on research and development activities.\nEmployees\nAs of the date of this report, we have no employees. We have retained independent consultants and contractors who are presently completing the necessary additional development of our products.\nItem lA. Risk Factors.\nAs a smaller reporting Company, we are not required to provide this Item.\nItem lB. Unresolved Staff Comments.\nNone.   Item 2. Properties.\nWe do not own any interest in real property. Item 3. Legal Proceedings.\nWe have no knowledge of any material, active or pending proceeding against us or our subsidiaries, nor are we, or any subsidiary, involved as a plaintiff or defendant in any material proceeding or pending litigation. Item 4. Mine Safety Disclosures.\nNone.\nPART II Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nThe Common Stock is currently quoted on the OTC Pink marketplace of OTC Markets Group, Inc., an inter-dealer quotation system, under the symbol \"CYAP.\" However, there is currently only a limited trading market for the Common Stock and there is no assurance that a regular trading market will ever develop.\nHolders\nAs of the date of this Report there were 36 holders of record of Common Stock, based on information provided by the Company's transfer agent. The holders of Common Stock are entitled to one vote for each share held of record on all matters submitted to a vote of stockholders. Holders of Common Stock have no preemptive rights and no right to convert their Common Stock into any other securities. There are no redemption or sinking fund provisions applicable to the Common Stock.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nAs of the end of the most recently completed fiscal years, July 31, 2023 and July 31, 2022, the Company did not have any equity compensation plans and have not maintained any such plans since our inception. Item 6. [Reserved]. Item 7. Management's Discussion and Analysis of our Financial Conditions and Results of Operations.\nThe following discussion should be read in conjunction with our financial statements and notes to those financial statements, included elsewhere in this prospectus. This discussion contains forward-looking statements that involve risks and uncertainties. Our actual results and the timing of selected events could differ materially from those anticipated in these forward-looking statements as a result of various factors, including those set forth under \"Risk factors\" and elsewhere in this prospectus.\nForward Looking Statements\nCertain statements made in this Report may constitute forward-looking statements on our current expectations and projections about future events. These forward-looking statements involve known or unknown risks, uncertainties and other factors that may cause our actual results, performance, or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. In some cases you can identify forward-looking statements by some words such as may, should, potential, continue, expects, anticipates, intends, plans, believes, estimates and similar expressions. These statements are based on our current beliefs, expectations, and assumptions and are subject to a number of risks and uncertainties. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance or achievements. These forward-looking statements are made as of the date of this Report, and we assume no obligation to update these forward-looking statements whether as a result of new information, future events, or otherwise, other than as required by law. In light of these assumptions, risks, and uncertainties, the forward-looking events discussed in this Report might not occur and actual results and events may vary significantly from those discussed in the forward-looking statements.\nResults of Operations\nThe Company earned income of $2,762 during the fiscal year ended July 31, 2023, compared to losses of $(1,498,322) incurred during the fiscal year ended July 31, 2022.\nWe have not attained profitable operations and are dependent upon obtaining financing to complete our proposed business plan. For these reasons our auditors believe that there is substantial doubt that we will be able to continue as a going concern.\nOur financial statements have been prepared assuming that we will continue as a going concern and, accordingly, do not include adjustments relating to the recoverability and realization of assets and classification of liabilities that might be necessary should we be unable to continue in operation.\nRevenue\nWe have not earned any significant revenue from our operations for the fiscal years ended July 31, 2023, and July 31, 2022.\nOperating Expenses\nThe Company has incurred operating expenses of $74,029 during Year Ended July 31, 2023 compared to expenses of $1,498,322 incurred during Year Ended July 31, 2022. The majority of the expenses consisted of general and administrative expenses.\nLiquidity and Capital Resources\nAs of July 31, 2023, our current assets consisted of $3 in cash and deposits and our total liabilities were $237,878 which consisted of convertible notes payable of $180,686, loans payable of $11,597, and accounts payable and accrued expenses of $45,595.\nWe currently have no external sources of liquidity such as arrangements with credit institutions or off-balance sheet arrangements that will have or are reasonably likely to have a current or future effect on our financial condition or immediate access to capital.\nOur financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America (GAAP) which contemplates our continuation as a going concern. We have not yet generated any revenue and have incurred losses to date of approximately $(10,880,173). In addition, our current liabilities exceed our current assets by $45,592. These factors raise substantial doubt about our ability to continue operating as a going concern. Our ability to continue our operations as a going concern, realize the carrying value of our assets, and discharge our liabilities in the normal course of business is dependent upon our ability to raise capital sufficient to fund our commitments and ongoing losses, and ultimately generate profitable operations.\nZenith Energy has advised us that it intends to invest in the Company in order to enable it to accomplish future expansion, although we have no definitive agreement in that regard.\nCash Flows\nOperating Activities\nWe have not generated positive cash flows from operating activities. For the fiscal year ended July 31, 2023, net cash outflows used in operating activities were $61,761 consisting of our net profit for the period of $2,762 and accounts payable of $64,523.\nInvesting Activities\nFor the fiscal year ended July 31, 2023, we spent $73,942 of our cash for software development.\nWe have not attained profitable operations and are dependent upon obtaining financing to pursue exploration activities. For these reasons, there is substantial doubt that we will be able to continue as a going concern\nSince our incorporation, we have financed our operations through advances from our shareholders, and by payments made by a third party. We expect to finance operations through the sale of equity or other investments for the foreseeable future, as we do not receive significant revenue from our business operations. There is no guarantee that we will be successful in arranging financing on acceptable terms.\nOur ability to raise additional capital is affected by trends and uncertainties beyond our control. We do not currently have any arrangements for financing, and we may not be able to find such financing if required. Obtaining additional financing would be subject to a number of factors, including investor sentiment. Market factors may make the timing, amount, terms or conditions of additional financing unavailable to us.\nOur auditors are of the opinion that our continuation as a going concern is in doubt. Our continuation as a going concern is dependent upon continued financial support from our shareholders and other related parties.\nFinancing Activities\nWe have financed our operations primarily from either third-parties or the issuance of equity and debt instruments. For the fiscal year ended July 31, 2023, net cash from financing activities was $135,386, which consisted of proceeds from issuance of additional shares of our common and preferred stock of $31,900, and issue of convertible notes payable of $103,486, which were converted into our shares pursuant to the terms of convertible promissory notes.\nCritical Accounting Policies\nOur financial statements and accompanying notes have been prepared in accordance with United States generally accepted accounting principles (\"GAAP\") applied on a consistent basis. The preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods.\nWe regularly evaluate the accounting policies and estimates that we use to prepare our financial statements. A complete summary of these policies is included in the notes to our financial statements. In general, management's estimates are based on historical experience, on information from third party professionals, and on various other assumptions that are believed to be reasonable under the facts and circumstances. Actual results could differ from those estimates made by management.\nThe financial statements have been prepared in conformity GAAP, which contemplates our continuation as a going concern. The Company has no revenue since January 1, 2020, and has incurred losses to date of approximately $(10,880,173). In addition, the Company's current liabilities exceed its current assets by $45,592. The Company intends on financing its future development activities and its working capital needs largely from the sale of public equity securities with some additional funding from other traditional financing sources, including term notes until such time that funds provided by operations are sufficient to fund working capital requirements. These factors raise substantial doubt about the Company's ability to continue operating as a going concern. The Company's ability to continue our operations as a going concern, realize the carrying value of our assets, and discharge our liabilities in the normal course of business is dependent upon our ability to raise capital sufficient to fund its commitments and ongoing losses, and ultimately generate profitable operations.\nContractual Obligations\nWe are a smaller reporting Company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information under this item.\nOff-Balance Sheet Arrangements\nUnder SEC regulations, we are required to disclose off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, such as changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. An off-balance sheet arrangement means a transaction, agreement or contractual arrangement to which any entity that is not consolidated with us is a party, under which we have:\n·\nany obligation under certain guaranteed contracts,\n·\nany retained or contingent interest in assets transferred to an unconsolidated entity or similar arrangement that serves as credit, liquidity or market risk support to that entity for such assets,\n·\nany obligation under a contract that would be accounted for as a derivative instrument, except that it is both indexed to our stock and classified in shareholder equity in our statement of financial position, and\n·\nany obligation arising out of a material variable interest held by us in an unconsolidated entity that provides financing, liquidity, market risk or credit risk support to us, or engages in leasing, hedging or research and development services with us.\nWe do not have any off-balance sheet arrangements that we are required to disclose pursuant to these regulations. In the ordinary course of business, we enter into operating lease commitments, purchase commitments and other contractual obligations. These transactions are recognized in our financial statements in accordance with generally accepted accounting principles in the United States.\nRevenue Recognition\nThe Company recognizes revenue when control of promised goods or services is transferred to the Company's customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services.\nPrior to the Merger Agreement as of December 31, 2020, with respect to sales of product to both franchisee and non-franchisee customers, the Company transfers control, invoices the customer and recognizes revenue upon shipment to the customer. Sales prices are based on fixed price lists that are different depending on whether the price list is for franchisee customers or for non-franchisee customers. Sales, value add and other taxes collected concurrent with revenue-producing activities are excluded from revenue.\nRecent Accounting Pronouncements\nNo accounting standards that have been issued or proposed by the FASB or other standards-setting bodies that require adoption until a future date are expected to have a material impact on the Company's financial statements upon adoption. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot applicable. Item 8. Financial Statements and Supplementary Data (PCAOB 50909).\nCYBER APPS WORLD INC. FINANCIAL STATEMENTS\nJuly 31, 2023 and July 31, 2022\nReports of Independent Registered Accounting Firms\nConsolidated Balance Sheets as of July 31, 2023, and 2022\nConsolidated Statements of Operations for Years Ended July 31, 2023, and 2022\nConsolidated Statement of Stockholders' Deficiency for the Years Ended July 31, 2023, and 2022\nConsolidated Statements of Cash Flows for the Years Ended July 31, 2023, and 2022\nNotes to Consolidated Financial Statements for the Years Ended July 31, 2023, and 2022\nAHMED & ASSOCIATES CPA P.C.\nNew Hyde Park, New York, United States Phone: +l 9179970677\nTo the shareholders and the board of directors of Cyber Apps World Inc.\nReport of Independent Registered Public Accounting Firm.\nOpinion on the financial statements.\nI have audited the accompanying balance sheet of Cyber Apps World Inc. and the related statements of income, stockholders equity, cash flows, including the related notes and any related schedules for the years ended July 31, 2023. In my opinion the financial statements present fairly in all material respects the financial position of the Company as of July 31, 2023 and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nGoing concern matters.\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has incurred losses, and has an accumulated deficit which raises substantial doubt about its ability to continue as a going concern. Management's plans concerning these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for opinion.\nThese financial statements are the responsibility of the Company's management. My responsibility is to express an opinion on the financial statements based on my audit. I am a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the US federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. I have conducted my audit in accordance with the standards of the PCAOB. Those standards require that I plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. My audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. I believe my audit provides a reasonable basis for my opinion.\nCritical audit matters.\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved my especially challenging, subjective, or complex judgments. I have determined that there are no critical audit matters to report.\nThe Company is not required to have, nor was I engaged to perform, an audit of its internal control over financial reporting. As part of my audit, I am required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, I express no such opinion.\n/s/ Rizwan Ahmed\nAhmed & Associates, CPA\nRizwan Ahmed, CPA\nOctober 11, 2023\nJACK SHAMA, CPA, MA\n1498 East 32nd Street\nBrooklyn, NY 11234\n631-318-0351\nTo the shareholders and the board of directors of Cyber Apps World Inc.\nReport of Independent Registered Public Accounting Firm.\nOpinion on the financial statements.\nI have audited the accompanying balance sheet of Cyber Apps World Inc. and the related statements of income, stockholders equity, cash flows, including the related notes and any related schedules for the years ended July 31, 2022 and July 31, 2021. In my opinion the financial statements present fairly in all material respects the financial position of the company as of July 31, 2022 and July 31, 2021and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America.\nGoing concern matters.\nThe accompanying financial statements have been prepared assuming that the company will continue as a going concern. As discussed in Note 2 to the financial statements, the company has incurred losses, and has an accumulated deficit which raises substantial doubt about its ability to continue as a going concern. Managements plans concerning these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for opinion.\nThese financial statements are the responsibility of the companys management. My responsibility is to express an opinion on the financial statements based on my audit. I am a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the company in accordance with the US federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. I conducted my audit in accordance with the standards of the PCAOB. Those standards require that I plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. My audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. I believe my audit provides a reasonable basis for my opinion.\nCritical audit matters.\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved my especially challenging, subjective, or complex judgments. I have determined that there are no critical audit matters to report.\nThe company is not required to have, nor was I engaged to perform, an audit of its internal control over financial reporting. As part of my audit, I am required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the companys internal control over financial reporting. Accordingly, I express no such opinion.\n/s/ Jack Shama\nJack Shama, CPA\nOctober 3, 2022\nI have served as the companys auditor since March 2019.\nCyber Apps World, Inc.\nConsolidated Balance Sheets July 31,\nASSETS\nCurrent assets\nCash\n$ 3\n$ 320\nPrepaid expenses\n-\n7,652\nTotal current assets\n7,972\nOther assets\nSoftware development\n488,696\n414,753\nTotal other assets\n488,696\n414,753\nTotal assets\n$ 488,699\n$ 422,724\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent liabilities\nAccounts payable and accrued expenses\n$ 45,596\n$ 117,769\nTotal current liabilities\n45,596\n117,769\nNon-current liabilities\nConvertible notes payable\n180,686\n77,200\nLoan payable\n11,597\n11,597\nTotal non-current liabilities\n192,283\n88,797\nTotal liabilities\n237,879\n206,566\nCommitments and contingencies (Note 7)\nStockholders' equity\nPreferred stock, $0.001 par value, 10,000,000 authorized, 100,000 issued and outstanding as of July 31, 2023 and 2022\nCommon stock: $0.001 par value, 250,000,000 authorized, 1,272,917 issued and outstanding as of July 31, 2023 and 5,000,000,000 authorized, 807,616,147 issued and outstanding as of July 31, 2022, respectively\n506,755\n444,701\nAdditional paid-in capital\n10,624,138\n10,654,292\nAccumulated deficit\n(10,880,173\n)\n(10,882,935\n)\nTotal stockholders' equity\n250,820\n216,158\nTotal liabilities and stockholders' equity\n$ 488,699\n$ 422,724\nThe accompanying notes are an integral part of these consolidated financial statements.\nCyber Apps World, Inc.\nConsolidated Statements of Operations\nFor the Years Ended July 31,\nRevenue\n$ -\n$ 11\nOperating expenses\nGeneral and administrative expenses\n74,029\n1,498,322\nTotal operating expenses\n74,029\n1,498,333\nOperating loss\n(74,029 )\n(1,498,322 )\nOther income(expense)\nInterest expense\n(923 )\nGain on write off of liabilities\n77,714\nTotal other income (expense)\n76,791\nNet income (loss)\n$ 2,762\n$ (1,498,322 )\nBasic and diluted net income (loss) per common share\n$ 0.00\n$ 0.00 )\nBasic and diluted weighted average common shares outstanding\n1,272,917\n807,616,147\nThe accompanying notes are an integral part of these consolidated financial statements.\nCyber Apps World Inc.\nConsolidated Statements of Stockholders' Equity\nJuly 31, 2023 and 2022\nPreferred Stock\nCommon Stock\nAdditional\nPaid-in\nShares\nto be\nAccumulated\nShares\nAmount\nShares\nAmount\nCapital\nIssued\nDeficit\nTotal\nBalance, July 31, 2021\n$\n$ 388,986,268\n$ 39,079\n$ 10,384,113\n$ 23,000\n$ (9,388,089 )\n$ 1,058,103\nCancellation of shares as of January 31, 2022\n(141,000,000 )\n(14,100 )\n(14,100 )\nCommon stock issued for cash\n559,629,879\n419,722\n270,179\n689,901\nPreferred stock issued\nShares to be issued\n100,000\n(23,000 )\n(23,000\n)\nOther\n3,465\n3,465\nNet loss for the period ended July 31, 2022\n(1,498,311\n)\n(1,498,311\n)\nBalance, July 31, 2022\n100,000\n$ 100\n$ 807,616,147\n$ 444,701\n$ 10,654,292\n$\n$ (10,882,935 )\n$ 216,158\nBalance, July 31, 2022\n100,000\n$ 100\n$ 807,616,147\n$ 444,701\n$ 10,654,292\n$\n$ (10,882,935 )\n$ 216,158\nIssuance of common stock\n98,045,405\n62,052\n(30,152 )\n31,900\nPreferred stock issued\n200,000\nCancellation of common stock\n(904,390,639 )\nCancellation of preferred stock\n200,000\n(200 )\n(200 )\nRound up shares\n2,004\n(2 )\nNet income for the period ended July 31, 2023\n2,762\n2,762\nBalance, July 31, 2023\n500,000\n$ 100\n1,272,917\n$ 506,755\n10,624,138\n$\n$ (10,880,173\n)\n$ 250,820\nThe accompanying notes are an integral part of these consolidated financial statements.\nCyber Apps World, Inc.\nConsolidated Statements of Cash Flows\nFor the Years Ended July 31,\nCash flows from operating activities:\nNet income (loss)\n$ 2,762\n$ (1,498,322 )\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nImpairment loss\n1,350,000\nChanges in assets and liabilities:\nPrepaid expenses\n35,000\nAccounts payable and accrued expenses\n(64,523 )\n(102,543 )\nNet cash used in operating activities\n(61,761 )\n(215,865 )\nCash flows from investing activities:\nSoftware development\n(73,942 )\n(70,866 )\nNet cash used in investing activities\n(73,942 )\n(70,866 )\nCash flows from financing activities:\nChange in convertible notes payable\n103,486\n(392,550 )\nChange in loan payable\n-\n(43,482 )\nShares to be issued\n-\n(23,000 )\nProceeds from issuance of preferred stock\n-\nProceeds from issuance of common stock\n62,054\n405,622\nProceeds from issuance of additional paid-in capital\n(30,154 )\n270,179\nNet cash provided by financing activities\n135,386\n216,869\nNet decrease in cash\n(317 )\n(69,862 )\nCash at beginning of period\n70,182\nCash at end of period\n$ 3\n$ 320\nCash paid for interest\n$ -\n$ -\nCash paid for taxes\n$ -\n$\nThe accompanying notes are an integral part of these consolidated financial statements.\nCYBER APPS WORLD INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\nNote 1. Financial Statement Presentation\nCyber Apps World Inc. (the Company), following the merger with the Company's wholly owned subsidiary on April 9, 2015, (formed for the sole purpose of merging with its parent), has been engaged in the development of mobile applications focusing on allowing users around the world to save money on products and services from member merchants and suppliers instantly with mobile coupons, using their desktops and/or mobile devices, including smartphones. We have not been successful in developing revenue from our operations.\nThe summary of significant accounting policies is presented to assist in the understanding of the financial statements. The financial statements and notes are the representations of management. These accounting policies conform to accounting policies generally accepted in the United States of America and have been consistently applied in the preparation of the financial statements.\nBasis of Presentation\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and the discharge of liabilities in the normal course of business for the foreseeable future.\nAs reflected in the accompanying financial statements for the year ended July 31, 2023, we incurred net income of $2,762. In addition, we reported cash used in operations of$(61,761) from our operating activities for the year ended July 31, 2023. As of July 31, 2023, we had accumulated deficit of $(10,880,173) and a working capital deficit of $45,593. The Company earned revenue of $2,762 for the year ended July 31, 2023. Management believes these factors raise substantial doubt about our ability to continue as a going concern for the next twelve months.\nSince its incorporation, the Company financed its operations almost exclusively through advances from its controlling shareholders. Management's plans are to finance operations through the sale of equity or other investments for the foreseeable future, as the Company does not receive significant revenue from its new business operations. There is no guarantee that the Company will be successful in arranging financing on acceptable terms.\nThe Company's ability to raise additional capital is affected by trends and uncertainties beyond its control. The Company does not currently have any arrangements for financing, and it may not be able to find such financing if required. Obtaining additional financing would be subject to a number of factors, including investor sentiment. Market factors may make the timing, amount, terms or conditions of additional financing unavailable to it. These uncertainties raise substantial doubt about the ability of the Company to continue as a going concern. The accompanying financial statements do not include any adjustments that might result from the outcome of these uncertainties.\nThese financial statements do not include any adjustments to reflect the possible future effect on the recoverability and classification of assets or the amounts and classifications of liabilities that may result from the outcome of these uncertainties. Management believes that the actions presently being taken to obtain additional funding and implement its strategic plan provides the opportunity for our Company to continue as a going concern.\nNote 2. Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America (US GAAP). The Company's functional currency is USD.\nUse of Estimates\nThe preparation of the financial statements is in conformity with generally accepted accounting principles in the United States of America, which require management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Management makes these estimates using the best information available at the time the estimates are made. Actual results could differ from those estimates.\nFair Value of Financial Instruments\nFinancial Accounting Standards Board (\"FASB\") Accounting Standards Codification (\"ASC\") 820 (formerly Statement of Financial Accounting Standard (\"SFAS\") No. 157 Fair Value Measurements) establishes a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as the following:\n·\nLevel 1-defined as observable inputs such as quoted prices in active markets for identical assets or liabilities;\n·\nLevel 2-defined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and\n·\nLevel 3-defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions.\nThe carrying amounts reported in the balance sheets for cash, accounts receivable, other receivable, accounts payable, other payable, and amounts due from related parties generally approximate their fair market values based on the short- term maturity of these instruments. ASC 825-10 \"Financial Instruments\" allows entities to voluntarily choose to measure certain financial assets and liabilities at fair value (fair value option). The fair value option may be elected on an instrument-by-instrument basis and is irrevocable, unless a new election date occurs. If the fair value option is elected for an instrument, unrealized gains and losses for that instrument should be reported in earnings at each subsequent reporting date. The Company did not elect to apply the fair value option to any outstanding instruments.\nProperty and Equipment\nProperty and equipment are recorded at cost. Depreciation of property and equipment are accounted for by accelerated methods over the following estimated useful lives:\nClassification\nEstimated Useful Lives\nFurniture and Fixtures\n10 years\nSoftware\n3-5 years\nComputers\n5 years\nRevenue Recognition\nThe Company recognizes revenue when control of promised goods or services is transferred to the Company's customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services.\nPrior to the Merger Agreement (as defined above), with respect to sales of product to both franchisee and non-franchisee customers, the Company transfers control, invoices the customer and recognizes revenue upon shipment to the customer. Sales prices are based on fixed price lists that are different depending on whether the price list is for franchisee customers or for non-franchisee customers. Sales, value add and other taxes collected concurrent with revenue-producing activities are excluded from revenue.\nGoodwill\nGoodwill represents the excess of purchase price paid over the fair value of net identifiable assets (tangible and intangible assets) acquired in business combination transactions. Goodwill is not subject to amortization and is tested for impairment annually or more frequently if events or circumstances indicate that the asset might be impaired. The Company performs a qualitative assessment of its reporting units and certain select quantitative calculations against its current long-range plan to determine whether it is more likely than not (a likelihood of more than 50 percent) that the fair value of a reporting unit is less than its carrying amount. The Company considers persistent and lasting decline in revenue, negative operating cash flows, changes in internal strategic expansion plans, changes in any applicable regulatory environments, among other factors, as part of the qualitative assessment.\nThe Company first assesses certain qualitative factors to determine whether the existence of events or circumstances leads to determination that it is more likely than not that the fair value of a reporting unit is less than its carrying amount. After assessing the totality of events or circumstances, the Company determines if it is not more likely than not that the fair value of a reporting unit is less than its carry amount, then performing the two-step impairment test is unnecessary. When necessary, impairment of goodwill is tested at the reporting unit level by comparing the reporting unit's carrying amount, including goodwill, to the fair value of the reporting unit. The fair value of the reporting unit is estimated using a discounted cash flow approach. If the carrying amount of the reporting unit exceeds its fair value, then a second step is performed to measure the amount of impairment loss, if any, by comparing the fair value of each identifiable asset and liability in the reporting unit to the total fair value of the reporting unit.\nFor the year ended July 31, 2023, the Company recorded an aggregate impairment loss of $0. (July 31, 2022 - $1,350,000) against its goodwill balance and software development balance. As of July 31, 2023, the Company's goodwill balance was $0 (July 31, 2022 - $0) and a software development balance of $488,695 (July 31, 2022 -\n$414,753).\nBasic and Diluted Earnings per Share\nThe Company reports earnings per share in accordance with FASB ASC 260 \"Earnings per share\". The Company's basic earnings per share are computed using the weighted average number of shares outstanding for the periods presented. Diluted earnings per share are computed based on the assumption that any dilutive options or warrants were converted or exercised. Dilution is computed by applying the treasury stock method. Under this method, the Company's outstanding stock warrants are assumed to be exercised, and funds thus obtained were assumed to be used to purchase common stock at the average market price during the period. There were no dilutive instruments outstanding as of July 31, 2023.\nIncome Taxes\nDeferred income tax assets or liabilities are computed based on the temporary differences between the financial statement and income tax bases of assets and liabilities using the statutory marginal income tax rate in effect for the years in which the differences are expected to reverse. Deferred income tax expenses or credits are based on the changes in the deferred income tax assets or liabilities from period to period. A valuation allowance against deferred tax assets is required if, based on the weight of available evidence, it is more likely than not that some portion or all of the deferred tax assets will not be realized. The valuation allowance should be sufficient to reduce the deferred tax asset to the amount that is more likely than not to be realized.\nRecently Issued Accounting Pronouncements\nNo accounting standards that have been issued or proposed by the FASB or other standards-setting bodies that require adoption until a future date are expected to have a material impact on the Company's financial statements upon adoption.\nNote 3. Convertible Notes Payable and Loan Payable\nAs of July 31, 2023, the Company holds a balance of convertible note payable in the amount of $180,686 (July 31, 2022 - $77,200), including interest and accumulated prepayment expense, which is convertible into common stock at deemed prices ranging from 60% to 61% of the lowest market price of the Company's stock within the prior 20 trading days prior to conversion. The convertible notes bear interest at rates ranging from 10% per annum to 12% per annum compounded monthly.\nAs of July 31, 2023, the Company has an outstanding loan payable balance of $1,597 (July 31, 2022 - $11,597). This balance was totally refunded in August 2023.\nNote 4. Common Stock\nPreferred Stock\nIn January 2023, the Company issued 200,000 shares of Series A Super Voting Preferred Stock (the Series A Preferred Shares) to a certain counterparty. These 200,000 Series A Preferred Shares were cancelled on July 7, 2023.\nOn June 23, 2022, the Company issued 100,000 Series A Preferred Shares for consideration of $0.001 per share, resulting in total proceeds of $100.\nOn July 6, 2023, JanBella Group, LLC (JanBella Group), a family office, acquired 100,000 outstanding Series A Preferred Shares in satisfaction of a promissory note made by the Company in favor of JanBella Group. The Series A Preferred Shares had been pledged to secure a note made by the Company to JanBella. The Series A Preferred Shares entitle the holder thereof to 99.97% of the voting power of the Company.\nOn August 23, 2023, JanBella Group sold the Series A Preferred Shares to Zenith Energy Ltd. (Zenith Energy). Zenith Energy. In the change in control transaction, Zenith Energy acquired the 100,000 Series A Preferred Shares, representing 99.87% of the voting power of the Company, from JanBella for consideration of approximately $398,400. The Series A Stock shall have the following preferences, powers, designations and other special rights:\nEach Series A Preferred Share entitles the holder to 10,000 votes on all matters submitted to the shareholders of the Company's common stock. The holder of the Series A Preferred Shares votes together with the holders of common stock as a single class upon all matters submitted to a vote of stockholders. ·\nThe holders of Series A Preferred Shares are not be entitled to receive dividends paid on the Company's Common Stock.\nUpon liquidation, dissolution and winding up of the Company, whether voluntary or involuntary, the holders of the Series A Preferred Shares then outstanding are not be entitled to receive out of the assets of the Company, whether from capital or earnings available for distribution, any amounts which will be otherwise available to and distributed to the holders of common stock.\nCommon Stock\nEffective January 18, 2013, the Company filed with Secretary of State of Nevada a Certificate of Change that affected a 1:50 reverse split in the Company's outstanding common stock and a reduction of our authorized common stock in the same 1:50 ratio, from 500,000,000 shares to 10,000,000 shares. We have retroactively restated all share amounts to show effects of the Common Stock split.\nOn August 18, 2021, the Company increased its authorized capital to 5,000,000,000 shares of common stock with par value $0.00075.\nDuring the year-ended July 31, 2022, the Company issued 559,629,879 shares of common stock for total proceeds of $689,901. The Company also cancelled 141,000,000 shares of common stock for no monetary amount.\nDuring the year-ended July 31, 2023, the Company issued 98,045,405 shares of common stock for total proceeds of $31,900. The Company also cancelled 904,390,639 shares of common stock for no monetary amount.\nDuring the year ended July 30, 2022, the shareholders representing a majority of the Company's issued voting shares, as well as the Company's Board of Directors approved a reverse stock split whereby each 840 pre-split shares of common stock shall be exchanged for one post-split share of common stock. Concurrently with the reverse split, the Company has approved the decrease in its authorized shares of common stock from 5,000,000,000 shares with par value $0.00075 to 250,000,000 shares with par value $0.001.\nNote 5. Income Taxes\nAs of July 31, 2023, the Company has deferred tax assets as a result of the net operating losses incurred from inception. The resulting deferred tax assets are reduced by a valuation allowance as discussed in Note 1, equal to the deferred tax asset as it is unlikely, based on current circumstances, that the Company will ever realize a tax benefit. Deferred tax assets and the corresponding valuation allowances amounted to approximately $3.3 million and $1.9 million as of July 31, 2023, and July 31, 2022, respectively. The statutory tax rate is 21% and the effective tax rate is zero.\nUnder current tax laws, the cumulative operating losses incurred amounting to approximately $10.8 million and $10.8 million on July 31, 2023, and July 31, 2022, respectively, will begin to expire in 2024.\nSection 382 of the U.S. Internal Revenue Code imposes an annual limitation on loss carry-forwards to offset taxable income when an ownership change occurs. The Company meets the definition of an ownership change and some of the net operating loss carry forwards will be limited.\nNote 6. Related Party Transactions\nThere were no reportable related party transactions during the year ended July 31,2023.\nNote 7. Commitments and Contingencies\nFrom time to time, the Company may be involved in litigation in the ordinary course of business. The Company is not currently involved in any litigation that we believe could have a material adverse effect on its financial condition or results of operations.\nIn accordance with Generally Accepted Accounting Principles (GAAP), it is imperative to disclose that the Company has categorized specific tax liabilities as \"Unenforceable due to Statute of Limitations\" in its financial statements for the period ending July 31, 2023. These tax write-offs are reported as contingent liabilities, and their respective amounts are itemized as follows:\nIRS - 941 Due - $25,132 SUTA Due -$ 2,507 FUTA Due - $832\nNC Withholding Due - $26,060\nNote 8. Subsequent Events\nOn July 7, 2023 the Company cancelled 200,000 Series A Preferred Shares issued in January 2023.\nOn August 23, 2023, JanBella Group, LLC, a family office sold the 100,000 Series A Preferred Shares it held to Zenith Energy Ltd. (Zenith Energy) for consideration of approximately $398,400. In the change in control transaction, Zenith Energy acquired 99.87% of the voting power of the Company. As part of the transaction, William Alessi, the sole officer and director of the Company, appointed Luca Benedetto, Ippolito Cattaneo, and Dario Sodero as directors of the Company (with Messrs. Cattaneo's and Sodero's appointment subject to compliance by CYAP with Rule 14f-l under the Securities Exchange Act of 1934). Thereafter, Mr. Alessi resigned as CYAP's sole director and officer.\nIn addition to the foregoing, Mr. Benedetto was appointed President and Treasurer of the Company and Mr. Cattaneo was appointed as the Company's Secretary. Item 9. Changes In and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nDisclosure Controls and Procedures\nWe maintain disclosure controls and procedures, as defined in Rule 13a-15(e) and Rule 15d-15(e) promulgated under the Securities Exchange Act of 1934, as amended (the Exchange Act) that are designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC's rules and forms and that such information is accumulated and communicated to our senior management, consisting of Luca Benedetto, our President and Treasurer (our Principal Executive, Financial and Accounting Officer), as appropriate to allow timely decisions regarding required disclosure.\nWe carried out an evaluation, under the supervision and with the participation of our senior management, consisting of Luca Benedetto, our President and Treasurer (our Principal Executive, Financial and Accounting Officer) of the effectiveness of the design and operation of our disclosure controls and procedures as of July 31, 2023. Based on the evaluation of these disclosure controls and procedures, and in light of the material weaknesses found in our internal controls over financial reporting as set forth below, our President and Treasurer (our Principal Executive, Financial and Accounting Officer) concluded that our disclosure controls and procedures were not effective.\nManagement's Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, our principal executive financial officers and accounting officers effected by our Board, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with US GAAP and includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Because of the inherent limitations of internal control, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce, though not eliminate, this risk.\nAs of July 31, 2023, Luca Benedetto, our President and Treasurer (our Principal Executive, Financial and Accounting Officer assessed the effectiveness of our internal control over financial reporting based on the criteria for effective internal control over financial reporting established in Internal Control--Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in 2013 and SEC guidance on conducting such assessments. Based on that evaluation, we believe that, during the period covered by this report, such internal controls and procedures were not effective to detect the inappropriate application of US GAAP rules as more fully described below. This was due to deficiencies that existed in the design or operation of our internal controls over financial reporting that adversely affected our internal controls and that may be considered to be material weaknesses.\nThe matters involving internal controls and procedures that our management considered to be material weaknesses under the standards of the Public Company Accounting Oversight Board were: (1) lack of a functioning audit committee and a lack of independent directors on our Board, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties consistent with control objectives; and (3) ineffective controls over period end financial disclosure and reporting processes. The aforementioned material weaknesses were identified by Luca Benedetto, our President and Treasurer (our Principal Executive, Financial and Accounting Officer) in connection with the review of our financial statements as of July 31, 2023.\nManagement believes that the material weaknesses set forth in items (2) and (3) above did not have an effect on our financial results. However, management believes that the lack of a functioning audit committee and the lack of independent directors on our Board results in ineffective oversight in the establishment and monitoring of required internal controls and procedures, which could result in a material misstatement in our financial statements in future periods.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the fourth quarter of the year ended July 31, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone\nItem 9C. Disclosure Regarding Foreign Jurisdictions That Prevent Inspections.\nNot applicable\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nAs at the date of this Report, our executive officers and directors and their respective ages are as follows:\nName\nPosition\nAge\nTerm of Office\nLuca Benedetto\nPresident, Treasurer and Director\nAugust 23, 2023, to present\nIppolito Cattaneo\nSecretary and Director\nAugust 23, 2023, to present\nDario Sodero\nDirector\nAugust 23, 2023, to present\nThe appointment of Messrs. Cattaneo and Sodero as directors is subject to the Company's compliance with Rule 14f-1 under the Exchange Act.\nDirectors are elected to serve until the earlier of the election and qualification of their successors, their removal for cause by the shareholders, or their resignation. Directors are elected by a plurality of the votes cast at the annual meeting of stockholders and hold office until the expiration of the term for which he or she was elected and until a successor has been elected and qualified.\nA majority of the authorized number of directors constitutes a quorum of the Board for the transaction of business. The directors must be present at the meeting to constitute a quorum. Any action required or permitted to be taken by the Board may be taken without a meeting if all members of the Board individually or collectively consent in writing to the action.\nExecutive officers are appointed by the Board and serve at its pleasure.\nThe principal occupation and business experience during the past five years for the Company's executive officers and directors is as follows:\nLuca Benedetto has been Chief Financial Officer and a director of Zenith Energy since 2013. Mr. Benedetto is an Italian national, trained in Italy as a registered accountant with further education in IFRS accounting and consolidation at IPSOA Milan. He has more than twenty-five years of experience in accounting, auditing, and financial administration. Mr. Benedetto began his professional career as an accountant and computer programmer responsible for financial software development and worked for the Italian division of IBM as an internal auditor and accountant as well as providing staff training in these aforementioned fields. He also served for seven years as a financial and administrative officer in a well-established Italian Company specializing in the construction of fuel and water storage tanks. He joined the Zenith Energy Ltd. group in 2013 as Chief Financial Officer of Zenith Energy's Italian subsidiary, Canoel Italia S.r.1., and has since progressed to also hold the position of Chief Financial Officer of Zenith Energy. In this capacity he has been directly involved in the monitoring of business performance, cash flow management, budgetary oversight, accounts team supervision, accounts preparation and strategic planning. Since January 2016 he has also been responsible for the compiling and reviewing of the quarterly Consolidated Financial Statements and Management's Discussion and Analysis of Zenith Energy.\nIppolito Cattaneo is a UK national with a bachelor's degree from the University of Bristol. He has a blend of financial and oil & gas experience, having started his working life at Standard Chartered Bank prior to commencing his university education. He has worked for more than five years at Zenith Energy as Business Development and Investor Relations manager. During this time he has gained significant experience in a multiplicity of regulatory environments, as well as playing an important role in enabling Zenith Energy to implement its development objectives in Africa and in other regions, both operationally and on a corporate level.\nIn addition, Mr. Cattaneo has significant operational experience, having taken a key role in Zenith Energy's operational activities in Tunisia, Italy, and the Republic of the Congo. He has in-depth knowledge of the requirements for project procurement and financing from beginning to completion, as well as having experience from a financial standpoint in the development of strategy and investor communications.\nHe speaks four languages fluently (English, French, Spanish, and Italian) and has a wide network of contacts across the African continent.\nDario Sodero has served as a member of the board of directors of Zenith Energy since June 24, 2009. As an experienced energy industry executive with 47 years of experience in North America, the Sub-Arctic, North Africa and the Middle East, Mr. Sodero has strong geological, exploration and technical expertise. Mr. Sodero has formerly acted as director and executive of several other TSX- and TSXV-listed exploration and production companies. Mr. Sodero holds a Doctorate degree in Geology from the University of Turin, Italy.\nThe Company has not engaged in any transaction with Mr. Benedetto, Mr. Cattaneo, or Mr. Sodero, in which they had or will have a direct or indirect material interest exceeding $120,000, nor is any such transaction currently proposed or contemplated.\nInvolvement in Certain Legal Proceedings\nTo our knowledge, during the last ten years, none of our and executive officers and directors (including those of our subsidiaries) has:\n·\nHad a bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time.\n·\nBeen convicted in a criminal proceeding or been subject to a pending criminal proceeding, excluding traffic violations and other minor offenses.\n·\nBeen subject to any order, judgment or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities.\n·\nBeen found by a court of competent jurisdiction (in a civil action), the SEC, or the Commodities Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended or vacated.\n·\nBeen the subject to, or a party to, any sanction or order, not subsequently reverse, suspended or vacated, of any self-regulatory organization, any registered entity, or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nFamily Relationships\nThere are no family relationships among our executive officers or directors.\nAudit Committee\nWe do not presently have an audit committee. Our board of directors currently acts as our audit committee.\nCompensation Committee\nWe do not presently have a compensation committee. Our board of directors currently acts as our compensation committee.\nNominating Committee\nWe do not presently have a nominating committee. Our board of directors currently acts as our nominating committee.\nCode of Ethics\nWe have not adopted Code of Ethics which is applicable to our executive officers. Item 11. Executive Compensation.\nThe following table sets forth the compensation paid by us for the last three completed fiscal years ending for our executive officers. This information includes the dollar value of base salaries, bonus awards and number of stock options granted, and certain other compensation, if any. The compensation discussed addresses all compensation awarded to, earned by, or paid to our executive officers.\nSummary Compensation Table\nName and Principal\nPosition\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption Awards\n($)\nNon- Equity\nIncentive Plan Compensation\n($)\nChange in pension\nvalue and\nnonqualified\ndeferred compensation earnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nMohammed Ifran Rafimiya Kazi\nPresident and CEO(1)\nKateryna Malenko\nSecretary(1)\nWilliam Alessi President, Chief Executive Officer and Secretary(2)\n(1)\nMr. Kazi and Ms. Malenko resigned as executive officers and directors of the Company effective July 6, 2023.\n(2)\nMr. Alessi was appointed as an executive officer and director of the Company effective July 6, 2023 and resigned from such positions effective August 23, 2023.\nEmployment Agreements\nThe Company had no employment agreements with the former executive officers named in the above table and has no employment agreement with its present executive officers.\nEquity Compensation Plans\nThe Company has no equity compensation plan in place and has not granted stock awards, stock options or other equity incentives to any of its former executive officers named in the above table or to any of its present executive officers.\nDirector Compensation\nThe Company has not implemented a compensation plan for and has not compensated its non-executive directors.\nCompliance with Section 16(a) of the Exchange Act\nSection 16(a) of the Exchange Act requires our executive officers and directors and persons who own more than 10% of a registered class of our equity securities to file with the SEC initial statements of beneficial ownership, reports of changes in ownership and annual reports concerning their ownership of our common stock and other equity securities, on Forms 3, 4 and 5 respectively. Executive officers, directors and greater than 10% stockholders are required by the SEC regulations to furnish us with copies of all Section 16(a) reports that they file.\nBased solely on our review of the copies of such forms received by us, or written representations from certain reporting persons, we believe that all filing requirements applicable to our officers, directors and greater than 10% beneficial owners were complied with under Section 16 of the Exchange Act during the fiscal year ended July 31, 2023, except that (i) Kateryna Malenko. a former executive officer and director did not file Forms 4 reporting he acquisition of 15,000,000 shares of Common Stock in December 2022 and 200,000 Series A Preferred Shares in January 2023 and the subsequent return for cancellation by the Company of (A) all 15,000,000 shares of Common Stock held by her in March 2023 and (B) all 300,000 Series A Preferred Shares held by her in July 2023; and (ii) William Alessi, a former executive officer and director of the Company failed to file a Form 3 when he became an executive officer and director in July 2023. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nAs of the end of the most recently completed fiscal years, July 31, 2023 and July 31, 2022, the Company did not have any equity compensation plans and have not maintained any such plans since our inception.\nSecurity Beneficial Ownership Table\nThe following table sets forth, as of date of this report, certain information with respect to the beneficial ownership of our common stock by each stockholder known by us to be the beneficial owner of more than 5% of our common stock and by each of our current directors and executive officers. The address of each of our current directors and officers is c/o the Company, Via Tomaso Rodari 6, Lugano, Switzerland 6900. Each person has sole voting and investment power with respect to the shares of Common Stock, except as otherwise indicated. Beneficial ownership consists of a direct interest in the shares of Common Stock, except as otherwise indicated.\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Ownership\nPercentage of Class\nLuca Benedetto\nshares of common stock\n%\nIppolito Cattaneo\nshares of common stock\n0 %\nDario Sodero\nshares of common stock\n0 %\nAll directors and officers as a group\n(3 persons)\nshares of common stock\n0 %\n_________________\nMr. Benedetto is Chief Financial Officer and a director of Zenith Energy and Mr. Sodero is a director of Zenith Energy and accordingly, may be deemed to have shared voting and dispositive control over the Series A Preferred shares held by Zenith Energy, which afford Zenith Energy 99.87% of the voting power of the Company. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe following are transactions for the last two completed fiscal years and any currently proposed transaction, in which the registrant was or is to be a participant and the amount involved exceeds the less of $120,000 or one percent of the average of the registrant's total assets at July 31, 2023 and July 31, 2022, and in which any of the following persons had or will have a direct or indirect material interest.\n·\nany director or executive officer;\n·\nany immediate family member of a director or executive officer, which means any child, stepchild, parent, stepparent, spouse, sibling, mother-in-law, father-in-law, son-in-law, daughter-in-law, brother-in-law, or sister-in-law of such director, executive officer and any person (other than a tenant or employee) sharing the household of such director or executive officer;\n·\nany person who was in any of the following categories when a transaction in which such person had a direct or indirect material interest occurred or existed:\n·\nany person who is known to the registrant to be the beneficial owner of more than five percent of any class of the registrant's voting securities; or\n·\nany immediate family member of any such security holder, which means any child, stepchild, parent, stepparent, spouse, sibling, mother-in-law, father-in-law, son-in-law, daughter-in-law, brother-in-law, or sister-in-law of such security holder, and any person (other than a tenant or employee) sharing the household of such security holder.\nTransaction with Directors\nIn June 2022, we entered into a subscription agreement with Kateryna Malenko, a former officer and director of the Company, whereby she purchased 100,000 Series A Preferred Shares from us for a total consideration of $100. In January 2023, we issued an additional 200,000 Series A Preferred Shares to Ms. Malenko. All of the Series A Preferred Shares were returned to the Company for cancellation in July 2023.\nOn December 22, 2022, we issued 15,000,000 shares of restricted Common Stock at a deemed price of $0.001 per share to Ms. Malenko. We issued these shares to Ms. Malenko in consideration of management and director services that she has provided to us. On March 9, 2023, Ms. Malenko agreed to cancel and return the 15,000,000 shares of restricted Common Stock to the treasury.\nExcept as set forth above, during the Company's two most recently completed fiscal years ended July 31, 2023 and July 31, 2022, and the period since our more recently completed fiscal year, we have not entered into any transactions with directors, executive officers, nominees for election as a director, any 10% shareholders of our common stock, or any immediate family members of such persons in which they had a direct or indirect material interest in the transaction.\nOther Related Party Transactions\nExcept as disclosed above, no executive officer, director or any member of these individuals' immediate families, any corporation or organization with whom any of these individuals is an affiliate or any trust or estate in which any of these individuals serve as a trustee or in a similar capacity or has a substantial beneficial interest in is or has been indebted to us at any time since the beginning of our last fiscal year.\nProcedures for Approval of Related Party Transactions\nOur Board is charged with reviewing and approving all potential related party transactions. All such related party transactions must then be reported under applicable SEC rules. We have not adopted other procedures for review, or standards for approval, of such transactions, but instead review them on a case-by-case basis. Item 14. Principal Accountant Fees and Services.\nAudit Fees\nFor the fiscal years ended July 31, 2023 and July 31, 2022., our independent registered public accounting firms were Ahmed & Associates, CPA P.C. and Jack Shama, CPA, respectively. The aggregate fees billed for professional services rendered for the accounting and audit of our financial statements for the fiscal years ended July 31, 2023 and July 31, 2022, were $2,500 and $2,000, respectively.\nAudit-Related Fees\nThere have been no audit-related fees billed by our independent registered public accounting firms in the fiscal years ended July 31, 2023 and July 31, 2022.\nTax Fees\nThere have been no tax fees billed by our independent registered public accounting firms in the fiscal years ended July 31, 2023 and July 31, 2022.\nAll Other Fees\nOur registered independent registered public accounting firms have billed us $4,500 for other fees related to the review of our Quarterly Reports on Form 10-Q, in each of the fiscal years ended July 31, 2023 and July 31, 2022.\nPolicy on Audit Committee Pre-Approval of Audit and Permissible Non-Audit Services of Independent Auditors\nSince we do not have a formal audit committee given our relatively small size, our board of directors serves as our audit committee. We have not adopted pre-approval policies and procedures with respect to our accountants. All of the services provided, and fees charged by our independent registered public accounting firms were approved by the board of directors. Item 15. Exhibits and Financial Statement Schedules.\nExhibit\nDescription of Exhibit\n3.1\nArticles of Incorporation of the Company. (Incorporated herein by reference to Exhibit 3.1 to the Company's Registration Statement on Form SB-2, filed with the Commission on May 7, 2003.)\n3.la\nCertificate of Change, effective October 23, 2019, providing for a 4-for-l stock split and increase in authorized common stock. (Incorporated herein by reference to Exhibit 3.la to the Company's Amended Annual report on Form 10-K/A, filed with the Commission on August 13, 2020.)\n3.1b\nCertificate of Designation of Series A Super Voting Preferred Stock, filed herewith.\n3.2\nBy-Laws of the Company. (Incorporated herein by reference to Exhibit 3.2 to the Company's Registration Statement on Form SB-2 filed with the Commission on May 7, 2003.)\n31.1\nSection 302 Certification, filed herewith.\n32.1\nSection 906 Certification, filed herewith.\nCopies of the following documents are included as exhibits to this report pursuant to Item 601 of Regulation S-K.\nEC Ref. No.\nTitle of Document\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Label Linkbase Document\n101.PRE\nXBRL Taxonomy Presentation Linkbase Document\nItem 16. Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act of 1934, the registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCYBER APPS WORLD, INC.\nBy: /s/ Luca Benedetto\nLuca Benedetto\nPresident and Treasurer\n(Principal Executive, Financial and Accounting Officer)\nDate: October 25, 2023\nIn accordance with the Securities Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n/s/ Luca Benedetto\nLuca Benedetto\nPresident, Treasurer and Director\n(Principal Executive, Financial and Accounting Officer)\nDate: October 25, 2023"
}