{
    "cik": "1230524",
    "company": "Cyber Apps World",
    "filing_type": "10-K",
    "filing_date": "2022-10-06",
    "period_of_report": "2022-07-31",
    "sic": "8742",
    "state_of_inc": "NV",
    "state_location": "V8",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1230524/0001575705-22-000689-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1230524/000157570522000689/form10k_cyberapps.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1230524/0001575705-22-000689.txt",
    "filename": "1230524_10K_2022_0001575705-22-000689.htm",
    "content": "Item 1. Business.\nPrior Operations\nWe were incorporated on July 15, 2002 under the laws of the State of Nevada under the name Titan Web Solutions, Inc. with a view to offering a full range of business consulting services in the retail specialty coffee industry in China.\nOn April 9, 2015 we merged with our wholly-owned subsidiary Cyber Apps World Inc. and concurrently changed our name to Cyber Apps World Inc. Our business focused on the development of mobile applications focusing on allowing users around the world to save money on products and services from member merchants and suppliers instantly with mobile coupons, using their desktops and/or mobile devices, including smartphones. We have not been successful in developing revenue from our operations.\nPrivacy and Value Software\nOn March 15, 2021, we entered into an agreement to acquire employee monitoring software known as Privacy and Value. We amended this agreement on April 20, 2021 and September 28, 2022. The software product attempts to balance employer concerns regarding employee efficiency and productivity with employee privacy.\nAs companies are increasingly attempting to meet the demands of employees that want work environment flexibility and are forced to avoid employee congregation in response to the current global Covid-19 pandemic, they are retaining staff that either work from home or they rely on outsourcing to retain employees and independent contractors in other countries. One of the primary concerns with having staff work in a separate location that removes them from the daily, direct oversight of management is that employee productivity will suffer. One of the responses to this concern is for businesses to use some form of worker surveillance in order to ensure that employees are utilizing their work time efficiently. However, businesses may face pushback from their staff due to concerns that their personal privacy is compromised when they are subject to constant monitoring during work hours. They may resist practices such as webcam surveillance or persistent computer screen observation.\nTo address employer concerns regarding staff efficiency and employee concerns regarding privacy, we intend market and sell the Privacy and Value software that has features to monitor worker computer productivity while providing employees with reasonable privacy during their work days. The features of the software are as follows:\n● the software will monitor the employees computer desktops while they are actually working on the system. Surveillance will commence when an employee logs on to his or her computer through our software and will continue until the employee logs out of the system. After an employee signs out of the software, recording and monitoring will cease and the employee can access his or her computer contents and the Internet for personal purposes;\n● when the employee is logged in, the software will allow management to maintain real-time access to employee activity and to view each employees desktop screen content and the keystrokes that the employee is typing. All of this information will also be recorded and stored for future management use with all information time stamped. The file name for each days recording will be the employees first name, last name, and the year, month, and day, which will allow a manager to identify the appropriate recording without difficulty; and\n● based on employee actions, the software will calculate the amount of time that the employee was logged into the system based on a searchable time period (e.g., a shift, a week, or a month). It will also indicate the length of various time periods during which the employee did not make any keystrokes on his or her computer and allow the manager to quickly access the recording of employees desktop at the times when keystrokes commenced and stopped. The software will also provide details of the length of each break that the employee takes during the work period analyzed. It will also have tools that the manager can use, in tabular and graphic form, to compare the efficiency of employees in terms of keystrokes and time logged in to their computer.\nIn consideration of the vendor selling the Privacy and Value software to us, we have agreed to:\n(a) pay $10,000 to the vendor upon execution of the agreement; and\n(b) pay, by March 31, 2023, an amount equal to the estimation of value of a 50% interest in the Software and the related data and databases based on an independent business valuation completed by a valuator who is accredited by the American Society of Appraisers and acceptable to both parties less the $10,000 cash payment noted above. Notwithstanding the valuations estimation of value of the software, the amount of the additional payment shall not be less than $50,000 and shall not exceed $250,000. We obtained an independent business valuation on the Software in June 2021, which indicated that we would have to pay $250,000 to complete the acquisition of a 50% interest in the Software.\nFriendly and Fast Delivery Service\nWe are currently developing a delivery computer application known as Friendly and Fast. The application is being designed to allow users to order food, groceries, and other courier services. Friendly and Fasts focus will strictly be delivery of goods.\nFriendly and Fast will target both individuals and corporate customer segments. For corporate clients, this feature will give discounts to restaurant owners, grocery stores, couriers, and similar enterprises so they can affordably provide deliveries to their customers. We are currently organizing beta testing of the application in Ahmedabad, India and have commissioned a private company to be primarily responsible for the completion of the application development.\nFinancial Condition\nOur financial statements for the period ended July 31, 2022, and 2021 have been prepared on a going concern basis which contemplates the realization of assets and settlement of liabilities and commitments in the normal course of business. We have not generated any significant revenue as of July 31, 2022. Management recognizes that our continued existence is dependent upon its ability to obtain needed working capital through additional equity and/or debt financing and revenue to cover expenses as we continue to incur losses.\nSince our incorporation, we have financed our operations almost exclusively through our sale of equity and through advances from our shareholders. Managements plans are to finance operations through the sale of equity or other investments for the foreseeable future, as we may not receive significant revenue from our and proposed business operations. There is no guarantee that we will be successful in arranging financing on acceptable terms.\nOur ability to raise additional capital is affected by trends and uncertainties beyond its control. We do not currently have any arrangements for financing, and we may not be able to find such financing if required. Obtaining additional financing would be subject to a number of factors, including investor sentiment. Market factors may make the timing, amount, terms or conditions of additional financing unavailable to us. These uncertainties raise substantial doubt about our ability to continue as a going concern.\nCompetition\nFriendly and Fast Application\nThere is intense competition between traditional taxi and courier companies, and delivery service companies. Companies providing ride-hailing services are transitioning from providing traditional taxi services to additional services, such as ride sharing and food and consumer goods delivery, in order to expand the overall market for transportation services.\nThe delivery service market is quite fragmented as there is high competition in the market among major players. Since this market is expanding, new entrants are emerging as well. We will compete with other delivery service companies, including Uber Eats, Skip The Dishes, Door Dash, and Grubhub that are well-established in North America. In other markets where we may wish to expand, there are also well-established regional companies, such as DiDi (China), Ola (India), Grab (southeast Asia), Bolt (Europe, Africa, and the Middle East), and Cabify (South America). These companies generally have greater financial and technical resources, industry expertise, and managerial capabilities than we do. Most of our competitors benefit from established brand awareness with current and prospective customers.\nWe believe that industry competition for customers is primarily based on brand recognition, marketing, price, and quality of service. We hope to be able to compete effectively based on these factors though we primarily hope to develop a niche market by providing lower commission charges to restaurants that agree to utilize our food delivery services and by developing underexplored markets, such as businesses that use local courier services for non-food deliveries and rely on traditional vehicle courier companies.\nPrivacy and Value Software\nThe software and computer application development business are also extremely fragmented and competitive. The sector includes large, established corporations that develop their products in-house and have the capability and financial resources necessary in order to launch and market their products, as well as large custom software development companies that design products according to client specifications, such as Praxent, Orases, 10Pearls, Fingent, Tack Mobile, and Mercury Development. Additionally, there are smaller niche market participants that focus on a single or small number of products that are well-tailored to specific commercial or consumer demands. Many of these competitors have international operations and are able to not only compete in terms of software quality, but also based on price given their access to software development talent in developing countries, such as India, where skilled labor is less expensive.\nPatents and Trademarks\nDue to the costs involved and the potential inability to qualify, we have not filed for patent protection of our products and our trademarks. We have not sought legal advice regarding whether or not patent protection of our technology is possible. Accordingly, our business is subject to the risk that competitors could either copy our technology or release competing products.\nGovernment Regulation\nWe are subject to laws that require protection of user privacy and user data. In our processing of account registrations, we will receive and store a large volume of personally identifiable data. This data is increasingly subject to laws and regulations in numerous jurisdictions around the world, including the United States through its Privacy Act and the Commission of the European Union through its General Data Protection Regulation. Such government action is typically intended to protect the privacy of personal data that is collected, processed, and transmitted in or from the governing jurisdiction.\nIn addition, our long-term business strategy may include geographic expansion into additional jurisdictions, many of which regions and countries have different legislation, regulatory environments, and tax laws. Compliance with legal, regulatory, and tax requirements around the world places demands on our time and resources, and we may nonetheless experience unforeseen and potentially adverse legal, regulatory, or tax consequences, which may have an adverse effect on our business.\nResearch and Development\nWe have not incurred any expenditures on research and development activities.\nEmployees\nAs of the date of this report, we have no employees. We have retained independent consultants and contractors who are presently completing the necessary additional development of our products.\nSubsidiaries\nWe have a wholly-owned subsidiary, RTsave Inc. that previously held our interest in the SmartSaveNow website. Item 1A. Risk Factors.\nNot applicable. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nWe do not own any interest in real property. Our mailing address is 9436 W. Lake Mead Blvd., Ste. 5-53, Las Vegas NV 89134, for which we pay $15.00 per month, on a month-to-month basis. Item 3. Legal Proceedings.\nNone Item 4. Mine Safety Disclosures.\nNone.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nOur shares of common stock trade on the OTC Markets Pink Sheets under the symbol CYAP. Over-the-counter market quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions. The market for our common stock maybe illiquid and investors may not be able to sell their shares.\nAs of September , 2022, there were approximately 47 registered owners of record of our common stock. During our previous eight fiscal quarters, the high and low trading prices as reported by Yahoo Finance were as follows:\nPeriod High Low\nAugust 1, 2020, to October 31, 2020 $ 1.00 $ 0.15\nNovember 1, 2020, to January 31, 2021 $ 0.70 $ 0.14\nFebruary 1, 2021, to April 30, 2021 $ 0.374 $ 0.017\nMay 1, 2021, to July 31, 2021 $ 0.103 $ 0.006\nAugust 1, 2021, to October 31, 2021 $ 0.0189 $ 0.0045\nNovember 1, 2021, to Jan 31, 2022 $ 0.032 $ 0.0046\nFebruary 1, 2022, to April 30, 2022 $ 0.0069 $ 0.0014\nMay 1, 2022, to July 31, 2022 $ 0.0035 $ 0.0008\nHolders of common stock are entitled to receive such dividends as may be declared by the Board of Directors out of funds legally available therefore and, in the event of liquidation, to share pro rata in any distribution of our assets after payment of liabilities. The Board of Directors is not obligated to declare a dividend. We have not paid any dividends and we do not have any current plans to pay any dividends.\nSecurities Authorized for Issuance under Equity Compensation Plans\nNone. Item 6. Selected Financial Data.\nNot applicable. Item 7. Managements Discussion and Analysis of our Financial Conditions and Results of Operations.\nIntroduction\nWe were incorporated on July 15, 2002, under the laws of the State of Nevada.\nResults of Operations - Year Ended July 31, 2022, and 2021\nWe have not earned any significant revenue from our operations during the year-ended July 31, 2022, and 2021. During the year ended July 31, 2022, we incurred net losses of $1,498,311 consisting entirely of general and administrative fees. The increase in general and administrative fees during the year-ended July 30,2022 primarily from a $1,350,000 impairment loss on our goodwill and software development balance and from increased business activity relating to software development\nWe have not attained profitable operations and are dependent upon obtaining financing to complete our proposed business plan. For these reasons our auditors believe that there is substantial doubt that we will be able to continue as a going concern.\nOur financial statements have been prepared assuming that we will continue as a going concern and, accordingly, do not include adjustments relating to the recoverability and realization of assets and classification of liabilities that might be necessary should we be unable to continue in operation.\nLIQUIDITY AND CAPITAL RESOURCES\nAs of July 31, 2022, our current assets consisted of $7,972 in cash and deposits and our total liabilities were $206,567 which consisted of convertible notes payable of $77,200, loans payable of $11,597, and accounts payable and accrued expenses of $117,770.\nCash Flows from Operating Activities\nWe have not generated positive cash flows from operating activities. For the year ended July 31, 2022, net cash flows used in operating activities were $215,865 consisting of our net loss for the period of $1,498,311, adjusted for impairment loss incurred in the period of $1,350,000, accounts payable of $102,554 and deposits of $35,000.\nCash Flows from Financing Activities\nWe have financed our operations primarily from either third-party or the issuance of equity and debt instruments. For the fiscal year ended July 31, 2022, net cash from financing activities was $216,869, which consisted of proceeds from issuance of additional shares of our common and preferred stock, offset by convertible notes payable of $392,550 and loans payable of $43,482, which were converted into our shares pursuant to the terms of convertible promissory notes.\nCash Flows from Investing Activities\nFor the fiscal year ended July 31, 2022, we spent $70,866 of our cash for software development.\nWe have not attained profitable operations and are dependent upon obtaining financing to pursue exploration activities. For these reasons, there is substantial doubt that we will be able to continue as a going concern\nSince our incorporation, we have financed our operations through advances from our shareholders, and by payments made by a third party. We expect to finance operations through the sale of equity or other investments for the foreseeable future, as we do not receive significant revenue from our business operations. There is no guarantee that we will be successful in arranging financing on acceptable terms.\nOur ability to raise additional capital is affected by trends and uncertainties beyond our control. We do not currently have any arrangements for financing, and we may not be able to find such financing if required. Obtaining additional financing would be subject to a number of factors, including investor sentiment. Market factors may make the timing, amount, terms or conditions of additional financing unavailable to us.\nOur auditors are of the opinion that our continuation as a going concern is in doubt. Our continuation as a going concern is dependent upon continued financial support from our shareholders and other related parties.\nCritical Accounting Policies\nOur discussion and analysis of its financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States of America.\nOff-Balance Sheet Arrangements\nAs of the date of this annual report, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nUse of Estimates\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States of America requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and disclosure of contingent assets and liabilities. On an on-going basis, we evaluate our estimates and judgments, including those related to revenue recognition, inventories, adequacy of allowances for doubtful accounts, valuation of long-lived assets and goodwill, income taxes, litigation and warranties. We base its estimates on historical and anticipated results and trends and on various other assumptions that we believe are reasonable under the circumstances, including assumptions as to future events. The policies discussed below are considered by management to be critical to an understanding of our financial statements. These estimates form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. By their nature, estimates are subject to an inherent degree of uncertainty. Actual results may differ from those estimates.\nProperty and Equipment\nProperty and equipment are recorded at cost. Depreciation of property and equipment are accounted for by accelerated methods over the following estimated useful lives:\nEvaluation of Long-Lived Assets\nWe review property and equipment for potential impairment whenever significant events or changes in circumstances indicate the carrying value may not be recoverable in accordance with the guidance in ASC 360-15-35 Impairment or Disposal of Long-Lived Assets. An impairment exists when the carrying amount of the long-lived assets is not recoverable and exceeds its fair value. The carrying amount of a long-lived asset is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset. If an impairment exists, the resulting write-down would be the difference between the fair market value of the long-lived asset and the related net book value.\nNet Loss Per Common Share\nClassification Estimated Useful Lives\nFurniture and Fixtures 10 years\nSoftware 3-5 years\nComputers 5 years\nBasic loss per common share is computed based on the weighted average number of shares outstanding during the year. Diluted earnings per common share is computed by dividing net earnings (loss) by the weighted average number of common shares and potential common shares during the specified periods. The Company has no outstanding options, warrants or other convertible instruments that could affect the calculated number of shares.\nIncome Taxes\nDeferred income tax assets or liabilities are computed based on the temporary differences between the financial statement and income tax bases of assets and liabilities using the statutory marginal income tax rate in effect for the years in which the differences are expected to reverse. Deferred income tax expenses or credits are based on the changes in the deferred income tax assets or liabilities from period to period. A valuation allowance against deferred tax assets is required if, based on the weight of available evidence, it is more likely than not that some portion or all of the deferred tax assets will not be realized. The valuation allowance should be sufficient to reduce the deferred tax asset to the amount that is more likely than not to be realized. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot applicable Item 8. Financial Statements and Supplementary Data (PCAOB 50909).\nCYBER APPS WORLD INC.\nFINANCIAL STATEMENTS\nJuly 31, 2022 and 2021\nReports of Independent Registered Accounting Firms\nBalance Sheets as of July 31, 2022, and 2021\nStatements of Operations for Years Ended July 31, 2022, and 2021\nStatement of Stockholders (Deficiency) for the Years Ended July 31, 2022, and 2021\nStatements of Cash Flows for the Years Ended July 31, 2022, and 2021\nNotes to Financial Statements for the Years Ended July 31, 2022, and 2021\nJACK SHAMA, CPA, MA\nEast 32nd Street\nBrooklyn, NY 11234\n631-318-0351\nTo the shareholders and the board of directors of Cyber Apps World Inc.\nReport of Independent Registered Public Accounting Firm.\nOpinion on the financial statements.\nI have audited the accompanying balance sheet of Cyber Apps World Inc. and the related statements of income, stockholders equity, cash flows, including the related notes and any related schedules for the years ended July 31, 2022 and July 31, 2021. In my opinion the financial statements present fairly in all material respects the financial position of the company as of July 31, 2022 and July 31, 2021 and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America.\nGoing concern matters.\nThe accompanying financial statements have been prepared assuming that the company will continue as a going concern. As discussed in Note 2 to the financial statements, the company has incurred losses, and has an accumulated deficit which raises substantial doubt about its ability to continue as a going concern. Managements plans concerning these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty\nBasis for opinion.\nThese financial statements are the responsibility of the companys management. My responsibility is to express an opinion on the financial statements based on my audit. I am a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the company in accordance with the US federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. I conducted my audit in accordance with the standards of the PCAOB. Those standards require that I plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. My audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. I believe my audit provides a reasonable basis for my opinion.\nCritical audit matters.\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved my especially challenging, subjective, or complex judgments. I have determined that there are no critical audit matters to report.\nThe company is not required to have, nor was I engaged to perform, an audit of its internal control over financial reporting. As part of my audit, I am required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the companys internal control over financial reporting. Accordingly, I express no such opinion.\n/s/ Jack Shama, CPA\nJack Shama, CPA\nOctober 3, 2022\nI have served as the companys auditor since March 2019.\nCYBER APPS WORLD INC.\nCONSOLIDATED BALANCE SHEET (AUDITED)\nJuly 31, July 31,\n$ $\nASSETS\nCurrent assets:\nCash 70,182\nDeposits & prepayments 7,652 42,652\nTotal current assets 7,972 112,834\nFixed assets:\nSoftware development - 308,752\nTotal fixed assets - 308,752\nOther assets:\nGoodwill - 964,581\nSoftware development - WIP 414,753 420,554\nTotal other assets 414,753 1,385,135\nTotal Assets 422,725 1,806,721\nLIABILITIES & STOCKHOLDERS EQUITY\nLIABILITIES\nCurrent liabilities:\nAccounts payable and accrued liabilities 117,770 223,789\nTotal current liabilities 117,770 223,789\nLong term liabilities:\nConvertible notes payable 77,200 469,750\nLoan payable 11,597 55,079\nTotal non-current liabilities 88,797 524,829\nTotal Liabilities 206,567 748,618\nSTOCKHOLDERS EQUITY\nPreferred stock: $0.001 par value, 10,000,000 authorized, 100,000 issued and outstanding. -\nCommon stock: $0.00075 par value, 5,000,000,000 authorized, 807,616,147 issued and outstanding as of July 31, 2022 and 388,986,268 issued and outstanding as of July 31, 2021, respectively 444,701 39,079\nShares to be issued - 23,000\nAdditional paid in capital 10,654,292 10,384,113\nAccumulated deficit (10,882,935 ) (9,388,089 )\nTotal Stockholders Equity 216,158 1,058,103\nTotal Liabilities and Stockholders Equity 422,725 1,806,721\n(The accompanying notes are an integral part of these audited consolidated financial statements)\nCYBER APPS WORLD INC.\nCONSOLIDATED STATEMENT OF COMPREHENSIVE LOSS (AUDITED)\nFor the year ended July 31,\n$ $\nNet Sales\n-\nCost of Goods Sold\n- -\nGross Income -\nExpenses\nGeneral and administrative 1,498,322 550,194\nConsolidated loss before interest & taxes (1,498,311 ) (550,194 )\nIncome tax - -\nConsolidated net loss (1,498,311 ) (550,194 )\nNet income per share - basic and diluted (0.00 ) (0.00 )\nWeighted average shares outstanding - basic and diluted 807,616,147 241,093,483\n(The accompanying notes are an integral part of these audited consolidated financial statements)\nCYBER APPS WORLD INC.\nCONSOLIDATED STATEMENT OF STOCKHOLDERS EQUITY (AUDITED)\nFor the years ended July 31, 2022 and 2021\nCommon Stock Preferred Stock Additional Paid in Shares to be Accumulated\nNumber Par Value Number Par Value Capital issued Deficit Total\n$ $ $ $ $ $\nOpening Balance as of July 31, 2020 171,792,634 24,320 - - 9,772,742 - (8,862,921 ) 934,141\nCommon stock issued for cash 76,193,634 - - 611,372 - - 612,031\nShare capital for business combination 141,000,000 14,100 - - - - - 14,100\nShares to be issued - - - - - 23,000 - 23,000\nOther - - - - - - 25,026 25,026\nNet Loss - - - - - - (550,194 ) (550,194 )\nClosing Balance as of July 31, 2021 388,986,268 39,079 - - 10,384,113 23,000 (9,388,089 ) 1,058,103\nOpening Balance as of July 31, 2021 388,986,268 39,079 - - 10,384,113 23,000 (9,388,089 ) 1,058,103\nCancellation of Shares as of January 31, 2022 (141,000,000 ) (14,100 ) - - - - - (14,100 )\nCommon stock issued for cash, July 31, 2022 559,629,879 419,722 - - 270,179 - - 689,901\nPreferred Stock Issued - - 100,000 - - -\nShares to be issued - - - - - (23,000 ) - (23,000 )\nOther - - - - - - 3,465 3,465\nNet Loss - - - - - - (1,498,311 ) (1,498,311 )\nClosing Balance as of July 31, 2022 807,616,147 444,701 100,000 10,654,292 - (10,882,935 ) 216,158\n(The accompanying notes are an integral part of these audited consolidated financial statements)\nCYBER APPS WORLD INC.\nCONSOLIDATED STATEMENT OF CASH FLOWS (AUDITED)\nFor the year ended\nJuly 31,\n$ $\nCash flows from operating activities\nNet income (loss) for the period (1,498,311 ) (550,194 )\nAdjustments to reconcile net loss to cash used in operating activities:\nImpairment loss 1,350,000 -\nChange in operating assets and liabilities\nDeposits & prepayments 35,000 (41,668 )\nAccounts payable and accrued liabilities (102,554 ) 97,315\nNet cash used in operating activities (215,865 ) (494,547 )\nCash flows from investing activities\nSoftware development and goodwill (70,866 ) (331,387 )\nNet cash used in investing activities (70,866 ) (331,387 )\nCash flows from financing activities\nChange in convertible notes payable (392,550 ) 202,200\nChange in loan payable (43,482 ) (71,705 )\nShares to be issued (23,000 ) 23,000\nProceeds from issuance of preferred shares -\nProceeds from issuance of common shares 405,622 30,800\nProceeds from issuance of additional paid in capital 270,179 711,706\nNet cash provided by financing activities 216,869 896,001\nChange in Cash (69,862 ) 70,067\nCash - beginning of period 70,182\nCash - end of period 70,182\nSupplemental cash flow disclosures\nCash paid For:\nInterest - -\nIncome tax - -\n(The accompanying notes are an integral part of these audited consolidated financial statements)\nCYBER APPS WORLD INC.\nNOTES TO AUDITED CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2022, and 2021\nNote 1. Financial Statement Presentation\nCyber Apps World Inc. (the Company) following the merger with the Companys wholly-owned subsidiary on December 24, 2012 (formed for the sole purpose of merging with its parent), continued working on the further development of the lithium batteries technology licensed from Terra Inventions Corp. (formerly Li-ion Motors Corp.) (Terra), the Companys former parent. Consultants for the Company were also working on the solar concentrating electric power generating system working independently.\nThe summary of significant accounting policies is presented to assist in the understanding of the financial statements. The financial statements and notes are the representations of management. These accounting policies conform to accounting policies generally accepted in the United States of America and have been consistently applied in the preparation of the financial statements.\nBasis of Presentation\nGoing Concern\nThe Companys financial statements for the years ended July 31, 2022, and 2021, have been prepared on a going concern basis which contemplates the realization of assets and settlement of liabilities and commitments in the normal course of business. The Company did not have significant revenue as of July 31, 2022. Management recognized that the Companys continued existence is dependent upon its ability to obtain needed working capital through additional equity and/or debt financing and revenue to cover expenses as the Company continues to incur losses.\nSince its incorporation, the Company financed its operations almost exclusively through advances from its controlling shareholders. Managements plans are to finance operations through the sale of equity or other investments for the foreseeable future, as the Company does not receive significant revenue from its new business operations. There is no guarantee that the Company will be successful in arranging financing on acceptable terms.\nThe Companys ability to raise additional capital is affected by trends and uncertainties beyond its control. The Company does not currently have any arrangements for financing, and it may not be able to find such financing if required. Obtaining additional financing would be subject to a number of factors, including investor sentiment. Market factors may make the timing, amount, terms or conditions of additional financing unavailable to it. These uncertainties raise substantial doubt about the ability of the Company to continue as a going concern. The accompanying financial statements do not include any adjustments that might result from the outcome of these uncertainties.\nNote 2. Summary of Significant Accounting Policies\nUse of Estimates\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States of America requires the Company to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and disclosure of contingent assets and liabilities. On an on-going basis, the Company evaluates its estimates and judgments, including those related to revenue recognition, inventories, adequacy of allowances for doubtful accounts, valuation of long-lived assets and goodwill, income taxes, litigation and warranties. The Company bases its estimates on historical and anticipated results and trends and on various other assumptions that the Company believes are reasonable under the circumstances, including assumptions as to future events. The policies discussed below are considered by management to be critical to an understanding of the Companys financial statements. These estimates form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. By their nature, estimates are subject to an inherent degree of uncertainty. Actual results may differ from those estimates.\nProperty and Equipment\nProperty and equipment are recorded at cost. Depreciation of property and equipment are accounted for by accelerated methods over the following estimated useful lives:\nClassification Estimated Useful Lives\nFurniture and Fixtures 10 years\nSoftware 3-5 years\nComputers 5 years\nEvaluation of Long-Lived Assets\nThe Company reviews property and equipment for potential impairment whenever significant events or changes in circumstances indicate the carrying value may not be recoverable in accordance with the guidance in ASC 360-15-35 Impairment or Disposal of Long-Lived Assets. An impairment exists when the carrying amount of the long-lived assets is not recoverable and exceeds its fair value. The carrying amount of a long-lived asset is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset. If an impairment exists, the resulting write-down would be the difference between the fair market value of the long-lived asset and the related net book value. The Company is looking for space to work and store equipment for both battery development and solar dish.\nRevenue Recognition\nThe Company recognizes revenue in accordance with Accounting Standards Codification No. 605, Revenue Recognition (ASC-605), ASC-605 requires that four basic criteria must be met before revenue can be recognized: (1) persuasive evidence of an arrangement exists; (2) delivery has occurred; (3) the selling price is fixed and determinable; and (4) collectability is reasonably assured. Determination of criteria (3) and (4) are based on managements judgments regarding the fixed nature of the selling prices of the products delivered and the collectability of those amounts. Provisions for discounts and rebates to customers, estimated returns and allowances, and other adjustments are provided for in the same period the related sales are recorded. The Company will defer any revenue for which the product has not been delivered or is subject to refund until such time that the Company and the customer jointly determine that the product has been delivered or no refund will be required. Since August 1, 2021, to July 31, 2022, the Company has generated no significant revenue.\nGoodwill\nGoodwill represents the excess of purchase price paid over the fair value of net identifiable assets (tangible and intangible assets) acquired in business combination transactions. Goodwill is not subject to amortization and is tested for impairment annually or more frequently if events or circumstances indicate that the asset might be impaired. The Company performs a qualitative assessment of its reporting units and certain select quantitative calculations against its current long-range plan to determine whether it is more likely than not (a likelihood of more than 50 percent) that the fair value of a reporting unit is less than its carrying amount. The Company considers persistent and lasting decline in revenue, negative operating cash flows, changes in internal strategic expansion plans, changes in any applicable regulatory environments, among other factors, as part of the qualitative assessment.\nThe Company first assesses certain qualitative factors to determine whether the existence of events or circumstances leads to determination that it is more likely than not that the fair value of a reporting unit is less than its carrying amount. After assessing the totality of events or circumstances, the Company determines if it is not more likely than not that the fair value of a reporting unit is less than its carry amount, then performing the two-step impairment test is unnecessary. When necessary, impairment of goodwill is tested at the reporting unit level by comparing the reporting units carrying amount, including goodwill, to the fair value of the reporting unit. The fair value of the reporting unit is estimated using a discounted cash flow approach. If the carrying amount of the reporting unit exceeds its fair value, then a second step is performed to measure the amount of impairment loss, if any, by comparing the fair value of each identifiable asset and liability in the reporting unit to the total fair value of the reporting unit.\nFor the year ended July 31, 2022, the Company recorded an aggregate impairment loss of $1,350,000 (July 31, 2021 - $Nil) against its goodwill balance and software development balance. As of July 31, 2022, the Companys goodwill balance was $Nil (July 31, 2021 - $Nil) and a software development balance of $414,753.\nNet Loss Per Common Share\nBasic loss per common share is computed based on the weighted average number of shares outstanding during the year. Diluted earnings per common share is computed by dividing net earnings (loss) by the weighted average number of common shares and potential common shares during the specified periods. The Company has no outstanding options, warrants or other convertible instruments that could affect the calculated number of shares.\nIncome Taxes\nDeferred income tax assets or liabilities are computed based on the temporary differences between the financial statement and income tax bases of assets and liabilities using the statutory marginal income tax rate in effect for the years in which the differences are expected to reverse. Deferred income tax expenses or credits are based on the changes in the deferred income tax assets or liabilities from period to period. A valuation allowance against deferred tax assets is required if, based on the weight of available evidence, it is more likely than not that some portion or all of the deferred tax assets will not be realized. The valuation allowance should be sufficient to reduce the deferred tax asset to the amount that is more likely than not to be realized.\nEffects of Recent Accounting Pronouncements\nThe Company has elected early adoption of Accounting Standard Update (ASU) 2014-10, Topic 915, Development Stage Entities, Elimination of Certain Financial Reporting Requirements. ASU 2014-10 removes all incremental financial reporting requirements for development stage entities, including, but not limited to, inception-to-date financial information included on the statements of operations, statements of stockholders equity (deficit) and statements of cash flows. As a result of the Companys early adoption, all references to the Company as a development stage entity have been removed. The adoption of this pronouncement has no impact on the Companys financial position, results of operations or liquidity.\nNote 3. Convertible Notes Payable and Loan Payable\nAs of July 31, 2022, the Company holds a balance of convertible note payable in the amount of $77,200 (July 31, 2021 - $469,750), including interest and accumulated prepayment expense, which is convertible into common stock at deemed prices ranging from 60% to 61% of the lowest market price of the Companys stock within the prior 20 trading days prior to conversion. The convertible notes bear interest at rates ranging from 10% per annum to 12% per annum compounded monthly.\nAs of July 31, 2022, the Company has an outstanding loan payable balance of $11,597 (July 31, 2021 - $55,079).\nNote 4. Common Stock\nEffective January 18, 2013, the Company filed with Secretary of State of Nevada a Certificate of Change that affected a 1:50 reverse split in the Companys outstanding common stock and a reduction of our authorized common stock in the same 1:50 ratio, from 500,000,000 shares to 10,000,000 shares. We have retroactively restated all share amounts to show effects of the Common Stock split.\nOn January 22, 2015, the Company converted $556,267 of its debt to various lenders into convertible debt and 17,550,000 shares of Common Stock were issued as a result of the debt conversion, causing a beneficial conversion in the amount of $370,845.\nOn April 18, 2016, the Company agreed to convert $62,400 of debt into 4,800,000 shares of common stock, which will reduce the debt and notes owed. The Company recorded a loss on settlement of debt of $33,600. The shares were issued on May 31, 2016.\nOn February 1, 2019, the Company filed with the Secretary of State of Nevada a Certificate of Change that affected a 1:45 reverse split, effective February 19, 2019, in the Companys outstanding common stock and a concurrent increase in the authorized common stock to 50,000,000 shares with par value $0.01.\nOn October 23, 2019, the Companys filed with the Secretary of State of Nevada a Certificate of Change that affected a 4:1 forward split, effective February 10, 2020, in the Companys outstanding common stock and a concurrent increase in the authorized common stock to 250,000,000 shares with par value $0.00075.\nOn August 18, 2021, the Company increased its authorized capital to 5,000,000,000 shares of common stock with par value $0.00075.\nDuring the year-ended July 31, 2022, the Company issued 559,629,879 shares of common stock for total proceeds of $689,901. The Company also cancelled 141,000,000 shares of common stock for no monetary amount.\nOn June 23, 2022, the Company issued 100,000 shares of Series A Super Voting Preferred Stock for consideration of $0.001 per share, resulting in total proceeds of $100. The Series A Stock shall have the following preferences, powers, designations and other special rights:\n1. Voting.\nEach share of Series A Stock shall entitle the holder to 10,000 votes on all matters submitted to the shareholders of the Companys common stock. A holder of the Series A Stock shall vote together with the holders of Common Stock as a single class upon all matters submitted to the Common Stock shareholders.\n2. Dividends.\nThe holders of Series A Stock of the Company shall not be entitled to receive dividends paid on the Companys Common Stock.\n3. No Liquidation Preference.\nUpon liquidation, dissolution and winding up of the Company, whether voluntary or involuntary, the holders of the Series A Stock then outstanding shall not be entitled to receive out of the assets of the Company, whether from capital or earnings available for distribution, any amounts which will be otherwise available to and distributed to the holder of Common Stock.\nNote 5. Income Taxes\nAs of July 31, 2022, the Company has deferred tax assets as a result of the net operating losses incurred from inception. The resulting deferred tax assets are reduced by a valuation allowance as discussed in Note 1, equal to the deferred tax asset as it is unlikely, based on current circumstances, that the Company will ever realize a tax benefit. Deferred tax assets and the corresponding valuation allowances amounted to approximately $3.3 million and $1.9 million as of July 31, 2022, and July 31, 2021, respectively. The statutory tax rate is 21% and the effective tax rate is zero.\nUnder current tax laws, the cumulative operating losses incurred amounting to approximately $10.3 million and $8.8 million on July 31, 2022, and July 31, 2021, respectively, will begin to expire in 2024.\nSection 382 of the U.S. Internal Revenue Code imposes an annual limitation on loss carry-forwards to offset taxable income when an ownership change occurs. The Company meets the definition of an ownership change and some of the net operating loss carry forwards will be limited.\nNote 6. Related Party Transactions\nDuring the year-ended July 31, 2022, the Company issued 100,000 shares of Series A Super Voting Preferred Stock for consideration of $0.001 per share, resulting in total proceeds of $100, to a director of the Company. Each share of Series A Stock shall entitle the holder to 10,000 votes on all matters submitted to the shareholders of the Companys common stock.\nNote 7. Subsequent Events\nSubsequent to the fiscal year ended July 31, 2022, shareholders representing a majority of the Companys issued voting shares, as well as the Companys Board of Directors approved a reverse stock split whereby each 840 pre-split shares of common stock shall be exchanged for one post-split share of common stock. Concurrently with the reverse split, the Company has approved the decrease in its authorized shares of common stock from 5,000,000,000 shares with par value $0.00075 to 250,000,000 shares with par value $0.001. Item 9. Changes In and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone Item 9A. Controls and Procedures.\nAs supervised by our board of directors and our principal executive and principal financial officer, management has established a system of disclosure, controls and procedures and has evaluated the effectiveness of that system. The system and its evaluation are reported on in the below Managements Annual Report on Internal Control over Financial Reporting. Our principal executive and financial officer have concluded that our disclosure, controls and procedures (as defined in Securities Exchange Act of 1934 (Exchange Act) Rule 13a-15(e)) as of July 31, 2016, were not effective, based on the evaluation of these controls and procedures required by paragraph (b) of Rule 13a-15.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13a-15(f) of the Exchange Act. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles.\nManagement assessed the effectiveness of internal control over financial reporting as of July 31, 2022. We carried out this assessment using the criteria of the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control -Integrated Framework.\nB. Managements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over our financial reporting. In order to evaluate the effectiveness of internal control over financial reporting, as required by Section 404 of the Sarbanes-Oxley Act, management has conducted an assessment, including testing, using the criteria in the Internal Control - Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nOur system of internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.\nBased on our evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our internal controls over financial reporting were not effective as of July 31, 2022, and were subject to material weaknesses.\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. We have identified the following material weaknesses in our internal control over financial reporting using the criteria established in the COSO:\n1. Failing to have an audit committee or other independent committee that is independent of management to assess internal control over financial reporting; and\n2. Failing to have a director that qualifies as an audit committee financial expert as defined in Item 407(d)(5) (ii) of Regulation S-K.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. In addition, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions and that the degree of compliance with the policies or procedures may deteriorate.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm, pursuant to rules of the Securities and Exchange Commission that permit us to provide only managements report in this annual report. Management concluded in this assessment that as of July 31, 2022, our internal control over financial reporting is not effective.\nThere have been no significant changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d15(f) under the Exchange Act) during the fourth quarter of our 2022 fiscal year that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nOur executive officers and directors and their respective ages are as follows:\nName\nPosition\nAge\nTerm of Office\nMohammed Irfan Rafimiya Kazi\nPresident, CEO, CFO, and Director\nMarch 10, 2020, to present\nKateryna Malenko\nSecretary and Director\nNovember 2, 2018, to present\nThe following describes the business experience of our directors and executive officers, including other directorships held in reporting companies:\nMohammed Irfan Rafimiya Kazi has acted as our President, CEO, CFO, and as a director since March 10, 2020. From January 2012 to February 2020, Mr. Kazi acted as a website developer and technical manager for various companies, including Nuclear Power Corporation of India, E-Digix Technologies Pvt. Ltd., and Virtual Height IT Services Pvt. Ltd., all of which are based in India. He earned a Bachelor of Computer Application degree from Farah Institute of Computer Science in Hyderabad in 2003.\nKateryna Malenko has acted as our secretary and as a director since November 2, 2018. She has been self-employed as an independent sales and business development consultant since 2011. In June 2011, Ms. Malenko graduated from Kharkiv Business Academy with a bachelors degree in Business Administration. After graduation, she took an additional course in programming and website development at Kiev State Polytechnical University in 2015 and 2016. In 2011, Ms. Malenko was working as a junior business consultant at MMS Group LTD, Kiev, Ukraine and then a project manager for the same company. She has also acted a President, CEO, treasurer, and a director of Quantum Business Strategies, Inc., a reporting, non-trading company, since December 2016.\nTerm of Office\nOur directors are appointed for a one-year term to hold office until the next annual meeting of our shareholders or until removed from office in accordance with our bylaws. Our officers are appointed by our board of directors and hold office until removed by the board.\nSection 16(A) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires the Companys executive officers and directors, and persons who beneficially own more than five percent (5%) of the Companys equity securities, to file reports of ownership and changes in ownership with the Securities and Exchange Commission. Officers, directors and greater than ten percent shareholders are required by SEC regulation to furnish us with copies of all Section 16(a) forms they file. Based on its review of the copies of such forms received by it, we believe that during the fiscal year ended July 31, 2022, all such filing requirements applicable to its officers and directors were complied with, as required.\nCode of Ethics\nWe have not adopted a Code of Ethics that governs the conduct of our officer.\nAudit Committee\nWe do not have a formal audit committee or an audit committee financial expert. We do not have an audit committee financial expert because we believe the cost related to retaining a financial expert at this time is prohibitive. Further, because we have limited operations, at the present time, we believe the services of a financial expert are not warranted. Item 11. Executive Compensation.\nThe following table sets forth the compensation paid by us for the last three completed fiscal years ending for our officer. This information includes the dollar value of base salaries, bonus awards and number of stock options granted, and certain other compensation, if any. The compensation discussed addresses all compensation awarded to, earned by, or paid to named executive officers.\nEXECUTIVE OFFICER COMPENSATION TABLE\nName and Principal Year Salary Bonus Stock\nOption\nNon-Equity Change in pension All Other Total\nPosition\nAwards Awards Incentive Plan value and Compensation\nCompensation nonqualified\ndeferred\ncompensation\nearnings\n($) ($) ($) ($) ($) ($) ($) ($)\nMohammed Ifran Rafimiya Kazi\nPresident and CEO\nLiudmilla Voinarovska\nFormer President and CEO\n0 0\nKateryna Malenko 0 0\nSecretary 0 0\n0 0\nThe compensation discussed herein addresses all compensation awarded to, earned by, or paid to our named executive officers.\nThere are no stock option plans, retirement, pension, or profit-sharing plans for the benefit of our officers and directors.\nCompensation of Directors\nOur directors are not compensated for their services as directors. The board has not implemented a plan to award options to any directors. There are no contractual arrangements with any member of the board of directors. We have no director service contracts.\nChange of Control\nWe do not have any pension plans or compensatory plans or other arrangements which provide compensation in the event of a termination of employment or a change in our control. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth, as September , 2022, certain information with respect to the beneficial ownership of our common stock by each stockholder known by us to be the beneficial owner of more than 5% of our common stock and by each of our current directors and executive officers. Each person has sole voting and investment power with respect to the shares of common stock, except as otherwise indicated. Beneficial ownership consists of a direct interest in the shares of common stock, except as otherwise indicated.\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Ownership\nPercentage of Class\nMohammed Ifran Rafimiya Kazi\nW. Lake Mead Blvd., Ste. 5-53\nshares of common stock\n0%\nLas Vegas, NV 89134\nKateryna Malenko, Secretary and Director\n82,240,000 shares of common stock\n4.35%\nWedge Pkwy Suite 1050\n100,000 shares of Series A\n52.91%\nReno, NV 89511\nSuper Voting preferred stock\nMehboob Charania\n46,000,000\n2.43%\nNorth Gould Street, Suite R\nshares of common stock\nSheridan, WY, 82801\nAll directors and officers as a group\n82,240,000 shares of common stock\n4.35%\nthat consists of two persons\n100,000 shares of Series A Super Voting preferred stock\n52.91%\nThe shares of common stock that Kateryna Malenko beneficially owns are held in Kat Consulting Corp., a private company that she controls.\nThe shares that Mehboob Charania beneficially owns are held in Real-Time Save Online Inc., a private company that he controls.\nThe percent of common stock that each shareholder owns is based on 890,070,927 shares of common stock issued and outstanding as of the date of this annual report. It also includes the voting power attributed to 100,000 shares of Series A preferred stock issued to Kateryna Malenko. Each share of Series A preferred stock entitles her to 10,000 votes on all matters submitted to the shareholders of the Companys common stock. Thus, the total voting shares issued and outstanding for the purpose of the above calculations are 1,890,070,927.\nNone of the above shareholders have any right to acquire additional shares of our common stock. There are no arrangements that may result in our change in control of the Company. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nOn June 22, 2022, we entered into a subscription agreement with Kateryna Malenko, a director and officer of the Company, whereby she purchased 100,000 shares of Series A Super Voting preferred stock from us for total consideration of $100. Each share of Series A Super Voting preferred stock entitles Ms. Malenko to her to 10,000 votes on all matters submitted to the shareholders of the Companys common stock.\nOtherwise, during the Companys most two most recently completed fiscal years ended July 31, 2022, and 2021, and the period since our more recently completed fiscal year, we have not entered into any transactions with directors, executive officers, nominees for election as a director, any 10% shareholders of our common stock, or any immediate family members of the such persons in which they had a direct or indirect material interest in the transaction.\nDirector Independence\nWe currently have two directors: Mohammed Irfan Rafimiya Kazi and Kateryna Malenko. Our common stock is quoted on the OTC Markets Pink Sheets, which does not impose any director independence requirements. Under NASDAQ rule 5605(a)(2), a director is not independent if he or she is also an executive officer or employee of the corporation or was, at any time during the past three years, employed by the corporation. Using this definition of independent director, we do not have any independent directors. Item 14. Principal Accountant Fees and Services.\nAudit Fees.\nThe aggregate fees billed by for professional services rendered for the accounting and audit of our financial statement for the fiscal year ended July 31, 2022, was $2,000 ($2,000 in fiscal 2021).\nAudit-Related Fees.\nThere have been no audit-related fees billed by our accountants in the last fiscal year of our Company.\nTax Fees.\nThere have been no tax fees billed by our accountants in the last fiscal year of our Company.\nAll Other Fees.\nOur independent accountant has billed $4,500 for other fees in each of fiscal 2022 and 2021.\nIt is the policy of our board of directors that before the accountant is engaged to render audit or non-audit services, the engagement is approved by the Board of Directors that is at present acting as the Audit Committee. Item 15. Exhibits and Financial Statement Schedules.\nExhibit\n3.1\nArticles of Incorporation of the Company. (Incorporated herein by reference to Exhibit 3.1 to the Companys Registration Statement on Form SB-2, filed with the Commission on May 7, 2003.)\n3.1a\nCertificate of Change, effective October 23, 2019, providing for a 4-for-1 stock split and increase in authorized common stock. (Incorporated herein by reference to Exhibit 3.1a to the Companys Amended Annual report on Form 10-K/A, filed with the Commission on August 13, 2020.)\n3.2\nBy-Laws of the Company. (Incorporated herein by reference to Exhibit 3.2 to the Companys Registration Statement on Form SB-2 filed with the Commission on May 7, 2003.)\n31.\nCertification of Chief Executive Officer and Principal Financial Officer Pursuant to Section 302 of the Sarbanes- Oxley Act of 2002, filed herewith.\n32.\nCertification of Chief Executive Officer and Principal Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, filed herewith.\nCopies of the following documents are included as exhibits to this report pursuant to Item 601 of Regulation S-K.\nEC Ref.\nNo.\nTitle of Document\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Label Linkbase Document\n101.PRE\nXBRL Taxonomy Presentation Linkbase Document\nThe XBRL related information in Exhibits 101 to this Annual Report on Form 10-K shall not be deemed filed or a part of a registration statement or prospectus for purposes of Section 11 or 12 of the Securities Act of 1933, as amended, and is not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of those sections.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCYBER APPS WORLD, INC.\nBy: /s/ Mohammed Irfan Rafimiya Kazi\nChief Executive Officer and Principal Financial Officer\nDate: October 3, 2022\nIn accordance with the Securities Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nBy: /s/ Mohammed Irfan Rafimiya Kazi\nMohammed Irfan Rafimiya Kazi\n(President, Chief Executive Officer and Director)\nDate: October 3, 2022"
}