{
    "cik": "1231339",
    "company": "Astra Energy, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-14",
    "period_of_report": "2022-08-31",
    "sic": "4911",
    "state_of_inc": "NV",
    "state_location": "CA",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1231339/0001477932-22-009290-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1231339/000147793222009290/astra_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1231339/0001477932-22-009290.txt",
    "filename": "1231339_10K_2022_0001477932-22-009290.htm",
    "content": "Item 1. Business\nAstra Energy is an emerging company in the waste management industry and the electricity and power generation sectors with a focus on energy production from solar, waste conversion and clean burning fuels. The Company strives to advance clean energy initiatives globally while delivering measurable benefits to communities and value to our investors by investing in and developing renewable and clean energy projects in markets where demand is high and supply is limited.\nWASTE CONVERSION:\nIn August 2022, the Company entered into an agreement to acquire a majority interest in Regreen Technologies Inc. (Regreen), a California based company with innovative and patented waste conversion technology and equipment. The Regreen Total Waste System converts municipal solid waste, food waste and plant waste raw material into biomass pellets which are then converted to various fuels and end products. In contrast to typical incinerator based WTE systems, the Regreen Total Waste System uses pyrolysis to burn and convert waste. Pyrolysis is an oxygen-absent process that converts dehydrated biomass into flammable liquids and gases under high temperature conditions. The Regreen system works by converting MSW into dried pellets with extremely low moisture content, which are then fed into a pyrolizer. The pyrolizer produces pyro oils (which can be used in generators and engines), carbon black (typically used in rubber manufacturing), and Syngas, which is further processed to yield jet fuel, green diesel, and bitumen (which can be used for asphalt and roofing).\nWe will specialize in providing sustainable waste and energy solutions and will safely convert millions of tons of waste from municipalities and businesses into valuable clean, renewable biofuels, biodiesel and jet fuel. The Company will provide comprehensive material management services to communities seeking solutions to some of todays most complex environmental challenges. The systems used in the power facilities will greatly reduce or eliminate methane emissions from landfills, as well as reduce reliance on imported fuels by replacing them with biofuels made from agricultural products. The Company will create a valued intellectual property portfolio by way of securing global licenses for or co-developing technologies that can convert multiple different waste streams into renewable fuel sources more efficiently and at a considerably lower cost.\nRecent legislation in California which requires food waste to be composted with the goal to reduce food waste in landfills by 75%. The State is directly in support of this system as a result. SB 1383, establishes methane reduction targets for California. California SB 1383 is a bill that sets goals to reduce disposal of organic waste in landfills, including edible food. The bills purpose is to reduce greenhouse gas emissions, such as methane, and address food insecurity in California. Aspects of this law ensure that food scraps are composted and compost is purchased by cities. Composting, industrial uses, and animal feed are good environmental uses for inedible food or other organic material. Landfilling organic waste is a significant source of local air quality pollutants, which can cause respiratory issues and hospitalizations for community members. Beyond this, we are seeing the effects of climate change in California with more severe and lengthy droughts, warmer temperatures that contribute to the increasing number of wildfires (also impacting air quality), bigger storms, and coastal erosion due to rising sea levels. To address the environmental and health concerns of surplus edible food, this law requires 20% of edible food that would otherwise be disposed of in the garbage or compost be recovered for human consumption by 2025. This means surplus edible food will help feed Californians in need instead of decomposing in a landfill while emitting harmful greenhouse gases.\nIn May 2022, Regreen entered into a Letter of Intent to install a One Ton-Per-Hour system at a material recovery facility in California. Completion of the installation is pending California Local Enforcement Agency approval relating to solid waste disposal.\nOn November 20, 2022, Regreen entered into a Joint Venture Investment Cooperation Agreement with Viecotech Joint Stock Company, a Vietnamese based company for the manufacture, distribution, and deployment of the patented Regreen waste processing system in the Asia Pacific region. Regreen will hold 50% ownership in the Joint Venture.\nRegreen is currently in negotiations to sell, joint venture and deploy the Regreen system in several countries including India, Panama, Dominican Republic, Fiji, Jamaica, and Ecuador.\nAstra Energy is advancing a waste to energy project on the island of Zanzibar to convert 15 tons of municipal solid waste per hour into 10MW/hour of electric power. The project will enable the island to dispose of all its garbage, thereby avoiding the need for a garbage landfill. Landfills are major generators of methane, a major greenhouse gas that is responsible for global warming. There are continuing discussions with the island government.\nThe preliminary plan is for Astra to develop, operate, and maintain the waste to energy infrastructure. The power will be fed into the islands grid network pursuant to a power purchase agreement.\nSOLAR:\nWe are currently completing a feasibility study for the supply and installation of a 40 MW solar farm with battery storage on the island of Zanzibar, Tanzania. The plan is to secure a power purchase agreement to feed the power into the grid network. The island of Zanzibar is a semi-autonomous territory of Tanzania in the Indian ocean. Electric power to the island is currently provided using two 100MW submarine cables from mainland Tanzania. These cables are now at capacity. The island wishes to have an independent power supply. Therefore, the immediate need for an additional 50MW of power in less than two years. The Company has initiated negotiations with the government of Zanzibar to provide the required power.\nPOWER GENERATION\nIn October, 2022, the Company entered into a Joint Venture with Holcomb Scientific Research Ltd. (HSR) to manufacture and distribute the innovative and patent protected Holcomb Inline Generator for homes, commercial applications, solar projects, electric vehicles, large power scale power plants, and many more applications.\nHSR is a Research and Development company that has created the patent-protected Holcomb Energy System, a scientific breakthrough in clean energy generation. The HES utilizes the natural energy produced by the electron spin in the iron atom, converting it into usable electricity while requiring no fuel, releasing zero carbon emissions, and having no moving parts - therefore running completely silent.\nCLEAN ENERGY:\nAstra Energy in concert with the government of Tanzania is advancing a 350MW Combined Cycle Gas Power Plant project. The government of Tanzania provided a positive response to the expression of interest and they have requested a technical proposal. Astra is applying for Advocacy support for this project from the US Mission in Tanzania.\nThe Company is currently in negotiations to acquire an existing 350MW Combined Cycle Gas Power Plant (the Plant).\nAstra is in continuing discussions to secure a gas supply agreement with the Tanzania Petroleum Development Corporation for the natural gas required to fuel the Plant. Once the agreement is executed, we will begin the process of relocating the Plant to Tanzania. As the Plant is installed, the Company will finalize power purchase agreements and distribution agreements. Item 1A. Risk Factors\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nOur principal executive offices are located at 9565 Waples Street, Suite 200, San Diego, CA where we lease approximately 100 square feet of office space on a month-to-month basis. We believe our present facilities are adequate for our current needs. We do not own any real property. Item 3. Legal Proceedings\nWe are currently not involved in any litigation that we believe could have a material adverse effect on our financial condition or results of operations. Item 4. Mine Safety Disclosures\nNot applicable.\nPart II Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket for Common Stock\nOur common stock was listed for trading on the OTCQB on September 30, 2022, under the symbol \"ASRE\".\nHolders of Record of Common Stock\nAs of December 14, 2022, we had approximately 176 stockholders of record for our common stock. The foregoing number of stockholders of record does not include an unknown number of stockholders who hold their stock in \"street name\".\nDividend Policy\nWe have never declared or paid cash dividends on our common stock. We presently do not expect to declare or pay such dividends in the foreseeable future and expect to reinvest all undistributed earnings to expand our operations, which the management believes would be of the most benefit to our stockholders. The declaration of dividends, if any, will be subject to the discretion of our Board of Directors, which may consider such factors as our results of operations, financial condition, capital needs and acquisition strategy, among others.\nRecent Sales of Unregistered Securities\nUnregistered securities sold by the Company during the period covered by this report have been previously reported in our Registration Statement on Form S-1, on a Quarterly Report on Form 10-Q or Current Report on Form 8-K.\nPurchases of Equity Securities\nNone.\nEquity Compensation Plan Information\nAs of August 31, 2022, we do not have any equity compensation plans. Item 6. [Reserved] Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with our financial statements, including the notes thereto, appearing elsewhere in this Annual Report.\nThe following information contains certain forward-looking statements of our management. Forward-looking statements are statements that estimate the happening of future events and are not based on historical fact. Forward-looking statements may be identified by the use of forward-looking terminology, such as may, could, expect, estimate, anticipate, plan, predict, probable, possible, should, continue, or similar terms, variations of those terms or the negative of those terms. The forward-looking statements specified in the following information have been compiled by our management on the basis of assumptions made by management and considered by management to be reasonable. Our future operating results, however, are impossible to predict and no representation, guaranty, or warranty is to be inferred from those forward-looking statements.\nCritical Accounting Policies\nRefer to Note 2 of our financial statements contained elsewhere in this Form 10-K for a summary of our critical accounting policies and recently adopting and issued accounting standards.\nResults of Operations\nFiscal Year Ended August 31, 2022, Compared to Fiscal Year Ended August 31, 2021\nRevenue increased to $25,000 from $0 for the years ended August 31, 2022 and 2021.\nGeneral and administrative expenses increased to $179,132 from $91,149 for the years ended August 31, 2022, and 2021, respectively. General and administrative expenses increased primarily in audit and legal expenses, regulatory filing costs, transfer agent fees and general business development costs.\nBusiness development expenses increased to $712,683 from $160,012 for the years ended August 31, 2022, and 2021, respectively. Business development expenses increased primarily in legal costs, travel, engineering studies and consulting fees.\nExecutive compensation expenses increased to $1,034,450 from $515,579 for the years ended August 31, 2022, and 2021, respectively. Executive compensation expenses increased primarily as a result of stock compensation for executives for services rendered.\nStock compensation-consulting expenses increased to $595,500 from $169,250 for the years ended August 31, 2022, and 2021, respectively, primarily as a result of the issuance of stock for services rendered by advisors, consultants and other non-related parties.\nLiquidity and Capital Resources\nWe have an accumulated deficit at August 31, 2022 of $32,523,735. We expect to incur substantial expenses and generate continued operating losses until we generate revenues sufficient to meet our obligations. At August 31, 2022, the Company had cash of $198,899. We will need to rely on private capital investment or loans to fund future operations for the next 12 months.\nCash Flows\nThe following table summarizes, for the periods indicated, selected items in our Statements of Cash Flows:\nYears Ended August 31,\nNet cash (used in) provided by:\nOperating activities\n$ (1,073,866 )\n$ (461,235 )\nFinancing activities\n$ 1,178,000\n$ 556,000\nOperating Activities\nCash used in operating activities was $1,073,866 and $461,235 for the years ended August 31, 2022, and 2021, respectively. The increase in cash used for operating activities was primarily for general operating costs, executive compensation, consulting fees and business development costs.\nFinancing Activities\nCash provided by financing activities was $1,178,000 and $556,000 for the years ended August 31, 2022, and 2021, respectively. The increase in cash provided by financing activities was due to an increase in the issuances of common stock for cash.\nCritical Accounting Estimates\nThe prepaid asset of $27,026,000 relates to the potential acquisition of Regreen Technologies, Inc. The valuation of this asset is subject to the completion of milestones in the underlying agreement and all parties meeting requirements. The amount may be impacted by cancellation of the acquisition and/or inability for parties to meet milestones in future periods. There was no impact to the results of operations for the year ended August 31, 2022, as the company has only issued common stock (currently held in escrow) to Regreen for the acquisition. If, upon completion of the acquisition, there has been a material change to the financial condition of Regreen, it may impact the final valuation for the assets acquired and liabilities assumed in the acquisition.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements including arrangements that would affect the liquidity, capital resources, market risk support and credit risk support or other benefits. Item 7A. Quantitative and Qualitative Disclosure about Market Risk.\nAs a \"smaller reporting company\", we are not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data\nThe following consolidated financial statements are filed as part of this Annual Report:\nASTRA ENERGY INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm (PCAOB #05525)\nConsolidated Balance Sheets as of August 31, 2022 and 2021\nConsolidated Statements of Operations for the Years ended August 31, 2022 and 2021\nConsolidated Statements of Stockholders Equity (Deficit) for the Years ended August 31, 2022 and 2021\nConsolidated Statements of Cash Flows for the Years ended August 31, 2022 and 2021\nNotes to the Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of Astra Energy, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Astra Energy, Inc (the Company) as of August 31, 2022 and 2021, and the related consolidated statements of operations, stockholders deficit, and cash flows for each of the years in the two-year period ended August 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021 and the results of its operations and its cash flows for each of the years in the two-year period ended August 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has an accumulated deficit and minimal revenue. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of the Prepaid Acquisition Expenses - Refer to Note 4 to the financial statements\nCritical Audit Matter Description\nThe Company issued stock held in escrow for the future acquisition of Regreen Technologies, Inc. and recorded an asset for the potential merger. The valuation of the asset and stock issued are subject to management estimates and judgment. Audit of the valuation of the asset is judgmental due to reliance on the likelihood of future events.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur principal audit procedures to evaluate valuation of the related asset consisted of the following, among others:\n·\nWe evaluated managements assumptions related to the valuation of the asset and stock issued.\n·\nWe considered whether the assumptions related to the merger agreement appear reasonable.\n·\nWe performed an independent analysis of the transaction and valuation and compared to managements analysis.\nWe have served as the Companys auditor since 2021.\nSpokane, Washington\nDecember 14, 2022\nASTRA ENERGY INC.\nCONSOLIDATED BALANCE SHEETS\nAugust 31,\nAugust 31,\nASSETS\nCurrent assets:\nCash\n$ 198,899\n$ 94,765\nPrepaid stock for acquisition (Note 4)\n27,026,000\n-\nOther receivable - related party (Note 5)\n194,520\n-\nTotal current assets\n27,419,419\n94,765\nTotal Assets\n$ 27,419,419\n$ 94,765\nLIABILITIES & STOCKHOLDERS DEFICIT\nCurrent liabilities:\nAccounts payable\n$ 49,344\n$ 94,570\nAccounts payable- related parties (Note 5)\n107,200\n50,000\nDue to a related party (Note 6)\n270,185\n-\nAccrued interest payable\n-\nDebenture payable (Note 8)\n20,000\n-\nTotal current liabilities\n447,359\n144,570\nTotal Liabilities\n447,359\n144,570\nCommitments and contingencies\n-\n-\nStockholders' Equity (Deficit):\nSeries A Preferred stock, par $0.001, 8,000,000 shares authorized; 7,774 and 15,774, shares issued and outstanding, respectively\nSeries B Preferred stock, par $0.00001, 100,000 shares authorized; 207 shares issued and outstanding\n-\n-\nSeries C Preferred stock, par $0.001, 1,000,000 shares authorized; 747,870 shares issued and outstanding\nSeries D Preferred stock, par $0.001, 380,000 shares authorized; 304,558 shares issued and outstanding\nSeries A1 Preferred stock, par $0.001, 1 share authorized; no shares and 1 share issued and outstanding, respectively\n-\n-\nCommon stock, $0.001 par value; 100,000,000 shares authorized; 57,855,540 and 42,549,540 shares issued and outstanding, respectively\n57,856\n42,550\nStock subscriptions receivable (Note 11)\n(5,000 )\n(100,000 )\nCommon stock to be issued (Note 12)\n20,000\n100,000\nAdditional paid-in capital\n59,421,878\n29,795,766\nAccumulated deficit\n(32,523,735 )\n(29,889,190 )\nTotal Stockholders Equity (Deficit)\n26,972,060\n(49,805 )\nTotal Liabilities and Stockholders Deficit\n$ 27,419,419\n$ 94,765\nThe accompanying notes are an integral part of these consolidated financial statements.\nASTRA ENERGY INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended\nAugust 31,\nRevenue\n$ 25,000\n$ -\nOperating Expenses:\nGeneral and administrative\n179,132\n91,149\nInventory impairment\n75,000\n-\nBusiness development\n712,683\n160,012\nConsulting - related party\n60,000\n117,000\nExecutive compensation\n1,034,450\n515,579\nStock compensation-consulting\n595,500\n169,250\nTotal operating expenses\n2,656,765\n1,052,990\nLoss from operations\n(2,631,765 )\n(1,052,990 )\nOther Expense:\nForeign exchange\n(13 )\n(3,659 )\nInterest expense\n(2,767 )\n-\nTotal other expense\n(2,780 )\n(3,659 )\nLoss before provision for income taxes\n(2,634,545 )\n(1,056,649 )\nProvision for income taxes\n-\n-\nNet Loss\n$ (2,634,545 )\n$ (1,056,649 )\nNet loss per share, basic and diluted\n$ (0.06 )\n$ (0.03 )\nWeighted average shares outstanding, basic and diluted\n45,567,354\n35,198,315\nThe accompanying notes are an integral part of these consolidated financial statements.\nASTRA ENERGY INC.\nCONSOLIDATED STATEMENT OF STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\nSeries A\nPreferred\nSeries A1\nPreferred\nSeries B\nPreferred\nSeries C\nPreferred\nSeries D\nPreferred\nCommon\nStock\nCommon Stock to\nStock Subscription\nAdditional\nPaid-In\nAccumulated\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nBe Issued\nReceivable\nCapital\nDeficit\nTotal\nBalance,\nAugust 31, 2020\n15,774\n$ 16\n$ -\n$ -\n747,870\n$ 748\n304,558\n$ 305\n4,674,540\n$ 4,675\n$ -\n$ -\n$ 28,777,141\n$ (28,832,541 )\n$ (49,656 )\nCommon stock issued for\nservices - related party\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n6,300,000\n6,300\n-\n-\n324,950\n-\n331,250\nCommon stock cancelled - related party\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(3,000,000 )\n(3,000 )\n-\n-\n3,000\n-\n-\nCommon stock issued for services\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n1,425,000\n1,425\n-\n-\n167,825\n-\n169,250\nCommon stock issued for cash -related party\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n7,500,000\n7,500\n-\n-\n55,000\n-\n62,500\nCommon stock issued for cash\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n25,650,000\n25,650\n100,000\n(100,000 )\n467,850\n-\n493,500\nNet loss\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(1,056,649 )\n(1,056,649 )\nBalance,\nAugust 31, 2021\n15,774\n$ 16\n$ -\n$ -\n747,870\n$ 748\n304,558\n$ 305\n42,549,540\n$ 42,550\n$ 100,000\n$ (100,000 )\n29,795,766\n$ (29,889,190 )\n$ (49,805 )\nSeries A\nPreferred\nSeries A1\nPreferred\nSeries B\nPreferred\nSeries C\nPreferred\nSeries D\nPreferred\nCommon\nStock\nCommon Stock to\nStock Subscription\nAdditional\nPaid-In\nAccumulated\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nBe Issued\nReceivable\nCapital\nDeficit\nTotal\nBalance,\nAugust 31, 2021\n15,774\n$ 16\n$ -\n$ -\n747,870\n$ 748\n304,558\n$ 305\n42,549,540\n$ 42,550\n$ 100,000\n$ (100,000 )\n$ 29,795,766\n$ (29,889,190 )\n$ -\n$ (49,805 )\nCommon stock issued for\nservices - related party\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n525,000\n-\n-\n410,475\n-\n-\n411,000\nPreferred shares cancelled - related party\n(8,000 )\n(8 )\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nCommon stock issued for services\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n1,045,000\n1,045\n-\n-\n985,365\n-\n-\n986,410\nCommon stock issued for inventory\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n150,000\n-\n-\n74,850\n-\n-\n75,000\nPrepaid common stock issued for acquisition\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n11,300,000\n11,300\n-\n-\n27,014,700\n-\n-\n27,026,000\nCommon stock issued for cash\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n2,286,000\n2,286\n(80,000 )\n95,000\n1,140,714\n-\n-\n1,158,000\nNet loss\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(2,634,545 )\n(2,634,545 )\nBalance,\nAugust 31, 2022\n7,774\n$ 8\n$ -\n$ -\n747,870\n$ 748\n304,558\n$ 305\n57,855,540\n$ 57,856\n$ 20,000\n$ (5,000 )\n$ 59,421,878\n$ (32,523,735 )\n$ -\n$ 26,972,060\nThe accompanying notes are an integral part of these consolidated financial statements.\nASTRA ENERGY INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended\nAugust 31,\nCASH FLOW FROM OPERATING ACTIVITIES:\nNet loss\n$ (2,634,545 )\n$ (1,056,649 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nStock based compensation\n986,410\n500,500\nExecutive stock compensation\n411,000\n-\nChanges in assets and liabilities:\nOther receivable - related party\n(194,520 )\n-\nAccounts payable\n30,404\n94,203\nAccounts payable - related party\n57,200\n44,200\nAccrued expenses - related party\n-\n(43,489 )\nDue to a related party\n270,185\n-\nNet Cash Used in Operating Activities\n(1,073,866 )\n(461,235 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\n-\n-\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from sale of shares\n1,158,000\n556,000\nProceeds from debenture\n20,000\n-\nNet Cash Provided by Financing Activities\n1,178,000\n556,000\nNet Change in Cash\n104,134\n94,765\nCash at Beginning of Year\n94,765\n-\nCash at End of Year\n$ 198,899\n$ 94,765\nCash paid during the period for:\nInterest\n$ 2,767\n$ -\nIncome taxes\n$ -\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nASTRA ENERGY INC.\nNotes to the Consolidated Financial Statements\nAugust 31, 2022\nNOTE 1 -ORGANIZATION AND DESCRIPTION OF BUSINESS\nAstra Energy, Inc. (the Company, Astra), was incorporated in the State of Nevada on June 12, 2000.\nA Certificate of Amendment was filed on August 22, 2020 with the Nevada Secretary of State changing the name of the Company to Astra Energy, Inc.\nThe Company is an emerging leader in the acquisition and development of technology in the Waste-to-Energy project sector.\nOn October 17, 2019, there was an order by the Eight Judicial District Court of Clark County Nevada appointing a Custodian to the Company. The custodianship was discharged on June 18, 2020.\nOn September 15, 2021, the Company affected a forward stock split of 3 for 1 which was approved by the Financial Industry Regulatory Authority (FINRA). All shares throughout these statements reflect the forward split.\nOn September 21, 2021, the Company incorporated a wholly owned subsidiary in Uganda called Astra Energy Africa - SMC Limited.\nOn October 12, 2021, the Company incorporated a wholly owned subsidiary in Uganda called Astra Energy Services Limited. The Company is owned 80% by Astra Energy Inc. and 20% by Ssingo Oils and Gas - SMC Limited of Mityana, Uganda.\nOn November 15, 2021, the Company incorporated a wholly owned subsidiary in the State of California called Astra Energy California, Inc.\nOn December 22, 2021, the Company incorporated a subsidiary in Tanzania called Astra Energy Tanzania Limited. The Company is owned 80% by Astra Energy Inc. and 20% by Kiluwa Group of Companies Limited of Kinondoni, Tanzania.\nOn August 5, 2022, the Company entered into an agreement to acquire a 68.2% interest in Regreen Technologies Inc. (Regreen), a California corporation, in exchange for 10,000,000 shares of the Companys common stock and an agreement to pay $250,000 in cash. Regreen is in the business of converting organic and solid waste material into marketable bio-products utilizing its patented series of equipment and processes.\nOn August 17, 2022, the Company entered into an agreement to acquire an additional 8.7% interest in Regreen Technologies Inc. in exchange for 1,300,000 shares of the Companys common stock and an agreement to pay $400,000 in cash.\nOn August 17, 2022, the Company incorporated a wholly owned subsidiary in the State of Florida called Astra Holcomb Energy Systems Inc.\nNOTE 2 -SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation\nThe Companys consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant estimates include the estimated useful lives of property and equipment. Actual results could differ from those estimates.\nPrinciples of Consolidation\nThese financial statements include the accounts of the Company and its subsidiaries. Subsidiaries are all entities (including structured entities) which the Company controls. For accounting purposes, control is established by an investor when it is exposed to, or has rights to, variable returns from its involvement with the entity and when it can affect those returns through its power over the entity. All inter-company balances and transactions are eliminated upon consolidation.\nCash and Cash Equivalents\nThe Company considers all cash accounts, which are not subject to withdrawal restrictions or penalties, and all highly liquid debt instruments purchased with a maturity of three months or less as cash and cash equivalents. The carrying amount of financial instruments included in cash and cash equivalents approximates fair value because of the short maturities for the instruments held. The Company had no cash equivalents as of August 31, 2022 and 2021.\nStock-based Compensation\nWe account for equity-based transactions with employees and non-employees under the provisions of FASB ASC Topic 718, Compensation - Stock Compensation (Topic 718), which establishes that equity-based payments to employees and non-employees are recorded at the grant date the fair value of the equity instruments the entity is obligated to issue when the employees and non-employees have rendered the requisite service and satisfied any other conditions necessary to earn the right to benefit from the instruments. Topic 718 also states that observable market prices of identical or similar equity or liability instruments in active markets are the best evidence of fair value and, if available, should be used as the basis for the measurement for equity and liability instruments awarded in these share-based payment transactions. However, if observable market prices of identical or similar equity or liability instruments are not available, the fair value shall be estimated by using a valuation technique or model that complies with the measurement objective, as described in FASB ASC Topic 718.\nRevenue Recognition\nThe Company recognizes revenue under ASC 606, Revenue from Contracts with Customers (ASC 606). The Company determines revenue recognition through the following steps:\n●\nIdentification of a contract with a customer;\n●\nIdentification of the performance obligations in the contract;\n●\nDetermination of the transaction price;\n●\nAllocation of the transaction price to the performance obligations in the contract; and\n●\nRecognition of revenue when or as the performance obligations are satisfied.\nRevenue is recognized when control of the promised goods or services is transferred to customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services. As a practical expedient, the Company does not adjust the transaction price for the effects of a significant financing component if, at contract inception, the period between customer payment and the transfer of goods or services is expected to be one year or less.\nDuring the year ended August 31, 2022, we recognized revenue of $25,000 ($nil-August 31, 2021), all of which was from one customer.\nNet income (loss) per common share\nNet income (loss) per common share is computed pursuant to section 260-10-45 of the FASB Accounting Standards Codification. Basic net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock outstanding during the period. Diluted net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock and potentially outstanding shares of common stock during the period. The following is the calculation as of August 31, 2022 and 2021.\nNet Loss\n$ (2,634,545 )\n$ (1,056,649 )\nWeighted average shares outstanding, basic and diluted\n45,567,354\n35,198,315\nNet loss per share, basic and diluted\n$ (0.06 )\n$ (0.03 )\nThe weighted average number of common shares outstanding and potentially outstanding common shares assumes that the Company incorporated as of the beginning of the first period presented.\nFor the year ended August 31, 2022, the Company has 10,667 potentially dilutive shares from Series A preferred stock and 380,698 potentially dilutive shares from the Series D preferred stock. Any potentially dilutive shares have not been included due to their anti-dilutive effect, as the Company as a net loss.\nRecently Issued Accounting Pronouncements\nThe Company has implemented all new accounting pronouncements that are in effect. These pronouncements did not have any material impact on the financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations.\nNOTE 3 - GOING CONCERN\nAs reflected in the accompanying financial statements, the Company has an accumulated deficit of $32,523,735 as of August 31, 2022, and minimal revenue. These factors raise substantial doubt about its ability to continue as a going concern. The financial statements have been prepared assuming that the Company will continue as a going concern. These financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts or amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nIn order to continue as a going concern, the Company is planning to secure its financial capital in various ways. It will finance its operations initially through shareholder loans from the principals and through private placement investment offerings. The Company may decide to finance its project development stage by way of an equity offering by issuing shares or by engaging venture capital firms that invest in early-stage companies. Venture capital firms August do more than just supply money to small new opportunities. They can also provide advice on potential products, customers, and key employees.\nThe company will also look to develop a relationship with a bank or banks with the intention of demonstrating a track record of progress and building value and securing some form of financing in the future. Once Astra Energy Inc. has a record of at least earning significant revenues, and better still of earning profits, the firm can make a credible promise to pay interest, and so it becomes possible for the firm to borrow money. Firms have two main methods of borrowing: banks and bonds.\nIf Astra Energy is earning profits (their revenues are greater than costs), the Company can choose to reinvest some of these profits in equipment, structures, and research and development. For many established companies, reinvesting their own profits is one primary source of financial capital.\nAnother source of financial capital that will be considered at the project development stage of a specific project is a bond. A bond is a financial contract: a borrower agrees to repay the amount that was borrowed and also a rate of interest over a period of time in the future. A corporate bond is issued by firms, but bonds are also issued by various levels of government. For example, a municipal bond is issued by cities, a state bond by U.S. states, and a Treasury bond by the federal government through the U.S. Department of the Treasury. A bond specifies an amount that will be borrowed, the interest rate that will be paid, and the time until repayment. Given the nature of the renewable industry regarding long term power purchase agreements or offtake agreements bonds are a very cost effective and reliable method of funding projects.\nNOTE 4 - PREPAID STOCK FOR ACQUISITION\nDuring the year ended August 31, 2022, the Company entered into an agreement to purchase a 68.2% interest (the Interest) in Regreen Technologies Inc., a California corporation in the business of converting solid waste material into a marketable bio-product with its patented series of equipment and processes. Regreen is the owner of all the patents for the equipment and the processes.\nThe purchase price of the Interest is $250,000 cash and 10 million shares of the Companys common stock (the Astra Shares). The Closing Date is anticipated to be December 15, 2022.\nThe cash and share consideration, which will be paid into escrow, will be subject to the following milestone and payment schedules:\nOn the Closing Date, the Company will release 2,500,000 Astra Shares from escrow and pay $50,000 in cash.\nUpon completion of the installation and full operation of a Regreen System at the Hesperia, California site, or such other site as the parties agree to in writing, the Company will pay $50,000 cash and release 2,500,000 from escrow.\nUpon completion of three months of the Regreen System operating at a minimum of 50% of expected yields, the Company will pay $50,000 cash.\nUpon completion of six months of the Regreen System operating at a minimum of 50% of expected yields, the Company will pay $50,000 cash and release 2,500,000 Astra Shares from escrow.\nUpon completion of twelve months of the Regreen System operating at a minimum of 50% of expected yields, the Company will pay $50,000 and release 2,500,000 Astra Shares from escrow.\nIn exchange for the Seller assigning all patents to Regreen, it is agreed that Regreen will pay to the Seller the total sum of $3,000,000 from the proceeds of the sale of a 15TPH Regreen System if the system is sold at a minimum price of $12,500,000. If the selling price is less than $12,500,000 the the Seller will receive 8% of the sale price of the 15 TPH system sold and additional 15 TPH systems sold until the Seller has received a total of $3,000,\nDuring the year ended August 31, 2022, the Company entered into an agreement to purchase a 3.8% interest (the Interest) in Regreen Technologies Inc., a California corporation in the business of converting solid waste material into a marketable bio-product with its patented series of equipment and processes. Regreen is the owner of all the patents for the equipment and the processes.\nThe purchase price of the Interest is $400,000 cash and 1.3 million shares of the Companys common stock (the Astra Shares). The Closing Date is anticipated to be December 15, 2022.\nThe cash and share consideration, which will be paid into escrow, will be subject to the following milestone and payment schedules:\nOn the Closing Date, the Company will pay $50,000 cash and release the 1.3 Astra Shares.\nUpon completion of the installation and full operation of a Regreen System at Advanced Waste Disposal in Hesperia, California the Company will pay $50,000 cash.\nOn March 15, 2023, the Company will pay $150,000 cash.\nOn December 15, 2023, the Company will pay $150,000 cash.\nThe prepaid asset of $27,026,000 relates to the potential acquisition of Regreen Technologies, Inc. The valuation of this asset is subject to the completion of milestones in the underlying agreement and all parties meeting requirements. The amount may be impacted by cancellation of the acquisition and/or inability for parties to meet milestones in future periods. There was no impact to the results of operations for the year ended August 31, 2022, as the company has only issued common stock (currently held in escrow) to Regreen for the acquisition. If, upon completion of the acquisition, there has been a material change to the financial condition of Regreen, it may impact the final valuation for the assets acquired and liabilities assumed in the acquisition.\nNOTE 5 - OTHER RECEIVABLE - RELATED PARTY\nDuring the year ended August 31, 2022, the Company advanced $194,520 to Regreen Technologies Inc., a related party. The advance is non-interest bearing, unsecured and there are no terms of repayment. The CEO and Managing Director of Regreen Technologies is the holder of 10 million common shares of the Company.\nNOTE 6 - DUE TO A RELATED PARTY\nDuring the year ended August 31, 2022, Regreen Technologies Inc., a related party, advanced $270,185 to the Company. The advance is non-interest bearing, unsecured and there are no terms of repayment. The CEO and Managing Director of Regreen Technologies is the holder of 10 million common shares of the Company.\nNOTE 7 - OTHER RELATED PARTY TRANSACTIONS\nDuring the year ended August 31, 2022, the Company entered into a services agreement with a director of a wholly-owned subsidiary, whereby the Company agreed to issue 50,000 common shares upon execution of the Agreement. The shares were valued at $0.75 for total non-cash compensation of $37,500.\nDuring the year ended August 31, 2022, the Company issued 150,000 shares at a value of $7,500 to the Corporate Communications Officer pursuant to a services agreement dated January 1, 2021. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 250,000 shares at a value of $195,000 to the Chief Operating Officer pursuant to a services agreement dated February 1, 2021. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 25,000 shares at a value of $57,000 to a Director of the Company pursuant to a services agreement dated August 1, 2022. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 50,000 shares at a value of $114,000 to a Director of the Company pursuant to a services agreement dated August 1, 2022. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company accrued $60,000 in fees to the President. The Company owed $57,500 to the President at August 31, 2022 ($40,000 - August 31, 2021).\nDuring the year ended August 31, 2022, the Company paid $120,000 in fees to the Chief Operating Officer.\nDuring the year ended August 31, 2022, the Company paid $24,000 in fees to the Chief Financial Officer.\nDuring the year ended August 31, 2022, the Company paid $24,000 in fees to the Corporate Secretary.\nDuring the year ended August 31, 2022, the President loaned $20,000 to the Company for working capital. The loan bears no interest, is unsecured and is repayable on demand. The Company owed $20,000 to the President at August 31, 2022 ($nil -August 31, 2021).\nDuring the year ended August 31, 2022, the Chief Operating Officer loaned $20,000 to the Company for working capital. The loan bears no interest, is unsecured and is repayable on demand. The Company owed $20,000 to the Chief Operating Officer at August 31, 2022 ($nil-August 31, 2021).\nNOTE 8 - CONVERTIBLE DEBENTURE\nOn January 11, 2022, the Company entered into a Convertible Debenture agreement, wherein the Company promised to pay Ron and Monique De Jager $20,000 with interest of 8% per annum on or before January 11, 2024. The Debenture can be converted into 20,000 common shares any time within 2 years with a conversion price of $1.00 per share subject to adjustments as set out in the Debenture. As of August 31, 2022 there was $630 interest owing to the Holders.\nNOTE 9 - PREFERRED STOCK\nSeries A Convertible Preferred\nThe Series A Convertible Preferred have a conversion rate of $0.75 per share and voting rights on an as converted basis. The holders of record of shares of Series A Preferred Stock are entitled to receive, out of any assets at the time legally available therefor and when and as declared by the Board of Directors, dividends at the rate of 8% per annum in shares of our common stock. On January 19, 2022, 8,000 shares of Series A Preferred Stock were cancelled. The shares were cancelled at the direction of the holder of the Series A Preferred Stock. Subsequent to the cancellation, 7,774 shares of Series A Preferred Stock remain outstanding. The outstanding shares can be converted to 10,365 common shares.\nSeries A1 Preferred\nOn April 24, 2020, the Company created and filed a Certificate of Designation for one share of Series A1 Preferred Stock, par value $0.0001. On January 21, 2022, the board of directors of the Company changed the designation of Series A1 by eliminating its conversion and voting rights. On January 13, 2022, the Company and the sole shareholder of the Series A1 Preferred share entered into a share cancellation agreement, whereby, the sole shareholder of the Series A1 Preferred Shares agreed to the cancellation of the one share of Series A1 Preferred Shares issued and outstanding.\nSeries B Preferred\nThe Company has authorized 100,000 shares of Series B Preferred Stock. The conversion rights of Series Preferred B were required to be exercised within 5 years. The conversion rights have expired without any of the shares being converted. Series B shares are not entitled to dividends or liquidation preferences and have no voting rights.\nSeries C Preferred\nThe Company has authorized 1,000,000 shares of Series C Preferred Stock. Each share of Series C is convertible into one fully paid and nonassessable share of our common stock at an initial conversion price of $1.20, subject to adjustment. The conversion rights of Series Preferred C were required to be exercised within 5 years. The conversion rights have expired without any of the shares being converted.\nSeries D Preferred\nThe Company has authorized 380,000 shares of Series D Preferred Stock, which ranks junior to our Series A, Series B and Series C Convertible Preferred Stock, but senior to our common stock. Except with respect to specified transactions that August affect the rights, preferences, privileges or voting power of the Series D Preferred Shares and except as otherwise required by Nevada law, the Series D Preferred Shares have no voting rights. At any time on or after the issuance date, the holder of any Series D Preferred Shares August, at the holders option, elect to convert all or any portion of the Series D Preferred Shares held by such person into a number of fully paid and nonassessable shares of common stock equal to the quotient of (i) the stated value ($40.00 per share) of the Series D Preferred Shares being converted divided by (ii) the conversion price, which initially is $0.80 per share, subject to certain adjustments.\nIn the event of our liquidation, dissolution or winding up, the holders shall be entitled to receive, out of the assets of the Company available for distribution, an amount equal to the Liquidation Preference Amount which is the product of the stocks Stated Value of $40.00 per share plus 120% before any payment or distribution of assets to the holders of Common Stock or any other Junior Stock.\nNOTE 10 - COMMON STOCK\nThe Company affected a forward stock split of 3 for 1 on September 15, 2021, which was approved by the Financial Industry Regulatory Authority (FINRA). All shares throughout these financial statements have been retroactively adjusted to reflect the forward split.\nDuring the year ended August 31, 2022, the Company issued 200,000 common shares at a price of $0.90 per share in exchange for services for total non-cash compensation of $180,000. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 500,000 common shares at a price of $0.78 per share in exchange for services for total non-cash compensation of $390,000. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 70,000 common shares at a price of $1.06 per share in exchange for services for total non-cash compensation of $74,200. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 50,000 common shares at a price of $0.51 per share in exchange for services for total non-cash compensation of $25,500. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 25,000 common shares at a price of $0.53 per share in exchange for services for total non-cash compensation of $13,250. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 50,000 common shares at a price of $1.00 per share in exchange for services for total non-cash compensation of $50,000. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 100,000 common shares at a price of $2.28 per share in exchange for services for total non-cash compensation of $228,000. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 50,000 common shares at a price of $0.51 per share in exchange for services for total non-cash compensation of $25,500. The shares were valued based on the closing stock price on the date of the agreement.\nDuring the year ended August 31, 2022, the Company issued 150,000 common shares at a price of $0.50 per share in exchange for inventory. The shares were valued based on the price at which the Company was completing private placements and upon mutual agreement by the Company and the creditor.\nDuring the year ended August 31, 2022, the Company sold 2,286,000 Units of its common stock at $0.50, for total cash proceeds of $1,143,000.\nRefer to Note 7 for related party transactions.\nNOTE 11 - STOCK SUBSCRIPTIONS RECEIVABLE\nDuring the year ended August 31, 2022, the Company issued 10,000 common shares pursuant to a Share Subscription Agreement in exchange for $5,000. The shares are included in the total number of shares issued and outstanding at August 31, 2022.\nNOTE 12 - COMMON STOCK TO BE ISSUED\nDuring the year ended August 31, 2022, the Company accepted a Share Subscription Agreement for $20,000. The funds were received in August 2022 but the shares were not issued until September 2022.\nNOTE 13 - WARRANTS\nDuring the year ended August 31, 2022, the Company sold 2,286,000 Units of its common stock. Each Unit consists of one common share and one warrant to purchase one additional share of common stock.\nThe aggregate fair value of the 2,286,000 warrants, totaled $992,775 based on the Black Scholes Merton pricing model using the following estimates: exercise price of $1.00, 0.52% risk free rate, 761% volatility and expected life of the warrants of 2 years. The value of the warrants has been netted against the proceeds of the offering proceeds and accounted for in additional paid in capital up to the amount of proceeds received. The Warrant must be exercised at the earlier of Two (2) years from the date of issuance, or within 30 days after the Company stock closes at or above $1.00 for five (5) consecutive trading days.\nNumber of\nWarrants\nWeighted Average\nExercise\nPrice\nWeighted Average Remaining Contract Term\nWeighted Average Fair Value\nOutstanding, August 31, 2021\n-\n$ -\n-\nGranted\n2,326,000\n$ 1.00\n2.00\n$ 1.40\nOutstanding, August 31, 2022\n2,326,000\n$ 1.00\n1.54\n$ 1.40\nNOTE 14 - INCOME TAXES\nAt August 31, 2022, the Company had net operating loss carry forwards of approximately $6,830,000 that August be offset against future taxable income. No tax benefit has been reported in the August 31, 2022 or 2021 financial statements since the potential tax benefit is offset by a valuation allowance of the same amount.\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cut and Jobs Act (the Tax Act). The Tax Act establishes new tax laws that affects 2018 and future years, including a reduction in the U.S. federal corporate income tax rate to 21% effective January 1, 2018.\nThe provision for Federal income tax consists of the following for the years ended August 31, 2022 or 2021:\nFederal income tax benefit attributable to:\nCurrent operations\n$ 553,000\n$ 222,000\nLess: valuation allowance\n(553,000 )\n(222,000 )\nNet provision for Federal income taxes\n$ -\n$ -\nThe cumulative tax effect at the expected rate of 21% (the U.S. federal income tax rate of 21% is being used due to the new tax law recently enacted) of significant items comprising our net deferred tax amount is as follows as of August 31, 2022 or 2021:\nDeferred Tax Assets:\nNOL Carryover\n$ 6,830,000\n$ 6,278,000\nLess valuation allowance\n(6,830,000 )\n(6,278,000 )\nNet deferred tax assets\n$ -\n$ -\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards for Federal income tax reporting purposes are subject to annual limitations. Should a change in ownership occur, net operating loss carry forwards August be limited as to use in future years. The Company is evaluating the effects of its recent change in ownership on its NOL.\nASC Topic 740 provides guidance on the accounting for uncertainty in income taxes recognized in a companys financial statements. Topic 740 requires a company to determine whether it is more likely than not that a tax position will be sustained upon examination based upon the technical merits of the position. If the more-likely-than-not threshold is met, a company must measure the tax position to determine the amount to recognize in the financial statements.\nThe Company includes interest and penalties arising from the underpayment of income taxes in the statements of operations in the provision for income taxes. As of August 31, 2022, the Company had no accrued interest or penalties related to uncertain tax positions.\nNOTE 15 -SUBSEQUENT EVENTS\nDuring the quarter ended November 30, 2022, the Company acquired 3.1% interest in Regreen Technologies Inc. in exchange for 2,750,000 shares of the Companys common stock.\nDuring the quarter ended November 30, 2022, the Company issued 599,000 shares of the Company's common stock for cash proceeds of $299,500.\nDuring the quarter ended November 30, 2022, the Company issued 550,000 shares of the Company's common stock in exchange for services.\nOn October 27, 2022, the Company acquired 50% of the outstanding shares of Astra-Holcomb Energy Systems LLC., a Delaware entity, in exchange for 5 million shares of the Companys common stock. Astra-Holcomb Energy Systems LLC holds the exclusive rights to manufacture and distribute the patented Holcomb Energy System In-Line Power Generator. There are no other assets and no liabilities in Astra-Holcomb Energy Systems LLC.\nOn November 20, 2022, the Company and its subsidiary, Regreen Technologies Inc. (Regreen) entered into a Joint Venture Investment Cooperation Agreement with Viecotech Joint Stock Company, a Vietnamese based company. The Joint Venture will manufacture, distribute, and deploy the patented Regreen waste processing system in the Asia Pacific region. Regreen will hold 50% ownership in the Joint Venture. The agreement will be completed upon receipt by Regreen of certain payments from Viecotech. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nThere were no disagreements related to accounting principles or practices, financial statement disclosure, internal controls or auditing scope or procedure during the two fiscal years and interim periods. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our principal executive officer and principal financial officer, as of the end of the period covered by this report, we conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Act of 1934. Our disclosure controls and procedures are designed to provide reasonable assurance that the information required to be included in our SEC reports is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, relating to the Company, including our consolidated subsidiaries, and was made known to them by others within those entities, particularly during the period when this report was being prepared. Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures were not effective as of August 31, 2022 because of the material weaknesses identified in our internal controls over financial reporting.\nManagements Report on Internal Control over Financial Reporting\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. As of August 31, 2022, management assessed the effectiveness of the Companys internal control over financial reporting based on the criteria for effective internal control over financial reporting established in Internal Control - Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission (the COSO criteria). A Material weakness is a control deficiency (within the meaning of Public Company Accounting Oversight Board (United States) Auditing Standard No. 2) or a combination of control deficiencies that result in more than a remote likelihood that a material misstatement of the annual or interim financial statements will not be prevented or detected. Based on such assessment, management concluded that as of August 31, 2022, our internal control over financial reporting was not effective. Management has identified the following material weakness:\n·\ninadequate segregation of duties consistent with control objectives\n·\ninsufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements\nPlanned Remediation\nWith the oversight of senior management and our audit committee, we are taking the steps below and plan to take additional measures to remediate the underlying causes of the material weaknesses:\n·\nThe Company will take steps to remediate the control activities material weakness through the documentation of processes and controls for transactions that occur in the course of business, and in the financial statement close, reporting and disclosure processes.\n·\nThe Company will formalize our process and documentation for monitoring internal control over financial reporting. The documentation will serve as the evidence to ascertain whether the control activities are present and functioning, and provide a foundation for the Company to communicate internal control deficiencies in a timely manner to those parties responsible for taking corrective action.\nIn addition, under the direction of the audit committee of the Board of Directors, management will continue to review and make necessary changes to the overall design of the Companys internal control environment, as well as to refine policies and procedures to improve the overall effectiveness of internal control over financial reporting of the Company.\nWe cannot be assured that the measures we have taken to date, or plan to implement, will be sufficient to remediate the material weaknesses we have identified or avoid potential future material weaknesses.\nThis Annual Report on Form 10-K does not include an attestation report of the Companys independent registered public accounting firm regarding the effectiveness of the Companys internal control over financial reporting, as such report is not required due to the Companys status as a smaller reporting company.\nChange in Internal Control over Financial Reporting\nExcept as discussed above, there have been no changes in the Companys internal controls over financial reporting during the year ended August 31, 2022, that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable\nPart III Item 10. Directors, Executive Officers and Corporate Governance\nDirectors, Executive Officers and Significant Employees\nThe following table and text set forth the names and ages of our current directors, executive officers and significant employees as of November 30, 2022. All of the directors will serve until the next annual meeting of stockholders or until their successors are elected and qualified, or until their earlier death, retirement, resignation or removal. There are no family relationships among any of the directors and executive officers. From time to time, our directors have received compensation in the form of cash and equity grants for their services on the Board.\nName\nAge\nTitle\nKermit Harris\nPresident, Director\nDaniel Claycamp\nChief Executive Officer and Director of Astra-Holcomb Energy Systems Inc., a wholly owned subsidiary.\nDavid F. Lutz\nDirector\nBenjamin N. Grier\nDirector\nDouglas D. Hampton\nChief Executive Officer and Director of Astra Energy California, Inc., a wholly owned subsidiary and President and Director of Regreen Technologies Inc., a majority owned subsidiary.\nRachel Boulds\nChief Financial Officer\nLisa Thompson\nCorporate Secretary of our Company and Corporate Secretary of Astra-Holcomb Energy Systems Inc., a wholly owned subsidiary\nThe background and principal occupations of the directors and officers of the Company are as follows:\nKermit A. Harris, age 48, is a founder, President and Director of our Company. Mr. Harris has proven and unique transformational leadership skills with over twenty years of experience in real estate acquisition/land development, commercial financing, business development, and restaurant industries. He has demonstrated high quality cross-functional management qualifications, business strategy, international/governmental engagement, and dynamic leadership. Mr. Harris developed the Companys renewable division as well as the global bio-fuel supply chain using Regreen Technology. He has full oversight of the entire organization domestic and abroad, working closely with COO Dan Claycamp. Kermit has been with the Company since 2019. From January 2017 to January 2019, he was the Business Development/Acquisition Manager for the Donato Group, Inc. where his responsibilities included identifying opportunities to enhance and streamline operations within any construction/development project to increase the satisfaction levels of municipalities, development entity, and investors when working with their staff/sub-contractors and partners. None of the companies where Mr. Harris was employed prior to being employed by the registrant was a parent, subsidiary or other affiliate of the registrant. These skills working with private and public companies are used to carry out the strategic initiatives of our Company. He is a graduate of Eastern Michigan Universitys Gary Owen College of Business, with a Finance Major\nDaniel L. Claycamp, 58 years of age, CEO and Director of Astra-Holcomb Energy Systems Inc., and a former COO and Director of our Company. Mr. Claycamp has 36 years of management experience in Plant Construction, Manufacturing, Engineering and Production of Food Grade and USP Grade Chemicals, Corn Milling, Flour Milling, Wet Milling, Oat Milling, Extrusion, Oil Extraction, Ethanol, and Mixing and Blending of Food Grade Ingredients. Skills include: Management of operations, construction, engineering, maintenance, distribution, purchasing, human relations, and accounting management. Strengths in plant management, project management, engineering, plant design and construction, plant operations, risk management, budget finance, quality and safety programs, and team based continuous improvement projects. During the years 2017 and 2018 Dan was the General Manager of Elemental Processing, LLC located in Lexington Kentucky. His responsibilities included engineering, design of new facilities and the management of the employees on the projects. During 2018 he was hired as Vice President of GenCanna Global USA, Inc. where he Managed a $120M capital project responsible for developing, designing, engineering, and constructing a Food Grade Hemp Processing Facility, Storage Elevator, Receiving, Grinding, and Screening, Extraction, RPI, Mixing and Blending, Formulations, and Packaging facilities for processed Hemp products in Mayfield, Kentucky. He remained in this position until he joined the Issuer as the COO in February 2021. None of the companies where Mr. Claycamp was employed prior to being employed by the registrant was a parent, subsidiary or other affiliate of the registrant.\nHis educational background consists of AC/DC Electrical Theory, Allen Bradley PLC Programming, and Electrical Motor Controls and Circuits: Rend Lake College, Whittington, IL 1997 and he holds a B.S. in Milling Science and Management from Kansas State University in 1986. His managerial and technical experience with private and public companies involved in the renewable energy industry qualifies him as a major part of the Companys mission.\nDavid F. Lutz, CPA/ABV, CVA/ABAR, CBA, 71 years of age, Director has extensive experience in small business management consulting, corporate finance, and business valuation. He has performed and supervised over 200 business valuations. He helped build a valuation department that produced over 500 business valuations a year. In corporate finance he helped structure, underwrite, and syndicate over $100 million in private and public stock offerings. With over 18 years experience in the brokerage industry and seven years experience with a major Chicago-based management consulting firm, Mr. Lutz has acquired a unique and diverse experience in legal and business matters uncommon among business valuation experts.\nMr. Lutz has worked with businesses in numerous industries and has assisted clients for a variety of purposes, including merger and acquisitions, sale, succession planning, estate and gift tax, divorce, employee stock ownership plans (ESOPS), various litigation and economic damage matters. He has developed reports to assist the emerging company to achieve its goals and has developed strategies to assist the established company to enhance and improve its value in the future.\nIn addition to a Certified Public Accountant (CPA), Mr. Lutzs valuation credentials include the Accredited in Business Valuation (ABV) designation issued by the American Institute of Certified Public Accountants (AICPA) and the Certified Valuation Analyst (CVA), Certified Business Appraiser (CBA), and Accredited in Business Appraisal Review (ABAR) designations issued by the National Association of Certified Valuation Analysts (NACVA).\nHe earned the ‘The Best Certified Business Appraisal Award from the Institute of Business Appraisers (IBA) prior to its merger/acquisition by NACVA. This award has been earned by only eight other individuals since the IBA was founded in 1978, see attached award letter.\nMr. Lutz is a member of the American Institute of Certified Public Accountants (AICPA), the National Association of Certified Valuation Analysts (NACVA). He was a Captain in the United States Air Force as a Budget Officer. He earned his Bachelor of Science in Accounting at the University of Northern Colorado and graduate work in business administration and accountancy at the University of Oklahoma.\nBenjamin N. Grier, JD, CPA, CTP, 56 years of age, Director, brings with him 20 plus years of experience in accounting and auditing, finance, treasury, tax and legal matters. Mr. Griers expertise includes, financial audits, investments and cash management, financial planning & analysis (FP&A), tax, and risk and litigation management, and negotiations.\nMr. Grier has held the position of Director of Treasury Services since August 2007 with a large insurance company and served as Assistant General Counsel at the same company from 2004 to 2007. From 2000 to 2003, Mr. Grier was Associate General Counsel at another Michigan based insurance company. Mr. Grier previously worked as an attorney and an accountant in private practice and as a Credit Analyst and Commercial Loan Officer at a Michigan based bank.\nMr. Grier obtained his Juris Doctor (Tax Law), Cum Laude, from Michigan State University - College of Law and a Bachelor of Arts in Financial Administration from Michigan State University. Mr. Grier is a Certified Treasury Professional (CTP) and is a Licensed Attorney and Certified Public Accountant in the State of Michigan.\nDouglas D. Hampton, Esq, 56 years of age, Director and President of Astra Energy California, Inc., is an accomplished attorney with over 30 years of experience in corporate/business, international law, criminal defense, insurance litigation, personal injury, and real estate law. Mr. Hampton currently manages a law practice in Michigan, the Law Offices of Douglas D. Hampton PC (1996-present), where he specializes in representing SMEs. He has successfully represented numerous clients in the areas of business law, automobile negligence, simple negligence, wrongful death, insurance litigation, real estate, and landlord/tenant relations.\nMr. Hampton was previously an Associate Attorney at Dickinson Wright, formerly Dickinson, Wright, Moon, Van Dusen & Freeman (1994-1996), and Jaffe, Raitt, Huer & Weiss (1991-1994). He is also an adjunct professor at the Western Michigan University Cooley Law School (2008-present).\nHe obtained a BA in International Relations from Michigan State University and a JD degree from the University of Iowa. Douglas Hampton and Kermit Harris bring the financial, operational, legal, and marketing skills necessary to grow the business, develop key partnerships, and ensure the Companys successful expansion.\nRachel Boulds, CPA, age 52, is the contracted Chief Financial Officer of our Company with over 20 years of experience in the audit and related financial reporting fields. She is responsible for the Companys financial reporting, audit consulting, bookkeeping, and business operation consulting services. preparation of period-end financial statements, footnotes and Management Discussion and Analysis in conformity with US GAAP and SEC reporting rules as well as consultation on complex accounting matters and working closely with client staff, auditors and legal counsel to prepare, review and file periodic public financial information, including Forms 10-Q and 10-K. After graduating from San Jose University with a BS in Accounting, she stared her career in the audit department of Price WaterhouseCooper. Rachel Boulds, CPA has been engaged in her sole accounting practice which she has led since 2009.\nLisa V. Thompson, age 47, is the Companys Corporate Secretary and the Corporate Secretary of Astra-Holcomb Energy Systems Inc. She has over 20 years-experience as a dependable and resourceful securities paralegal specialist. As the Corporate Secretary, she excels at communication and collaborating with a diverse range of legal and company personnel, executive officers and board of directors. She conducts all legal business professionally with corporate counsel and with minimal supervision. Lisa is experienced in the preparation of regulatory filings for US and Canadian Securities Commissions. She is extremely organized with advanced technical and corporate skills. Her position with our publicly traded Company is very valuable. From 2016 to January of 2020, Ms. Thompson was the operations manager for PubCo Reporting Services, Inc. which was an EDGAR Filer and Corporate Secretary Consulting Services. In January of 2020 she started Meraki Corporate Services, Inc. where she provides corporate secretary consulting services. She has been under contract as an employee with our company since October 1, 2020. None of the companies where Lisa holds Legal Secretary and Paralegal certificates from Capilano University, North Vancouver BC; Legal Secretary Certificate and Business Management Diploma from Kwantlen University College, Richmond BC.\nThe Board and Committees\nOur Board has one committee, the Audit Committee.\nAudit Committee\nKermit Harris, David F. Lutz and Benjamin N. Grier are the members of our Audit Committee and David F. Lutz serves as the chairperson. David F. Lutz and Benjamin N. Grier Committee meet the independence standards promulgated by the SEC and by NASDAQ as such standards apply specifically to members of audit committees.\nDavid Lutz, a member of the audit committee is an audit committee financial expert, as that term is defined in Item 407(d)(5)(ii) of Regulation S-K, and David F. Lutz and Benjamin N. Grier are both independent as that term is defined in Rule 5605(a) of the Nasdaq Marketplace Rules.\nWe adopted and approved a charter for the Audit Committee. In accordance with our Audit Committee Charter, our Audit Committee shall perform several functions, including:\n·\nevaluate the independence and performance of, and assesses the qualifications of, our independent auditor, and engages such independent auditor;\n·\napprove the plan and fees for the annual audit, quarterly reviews, tax and other audit-related services, and approves in advance any non-audit service to be provided by the independent auditor;\n·\nmonitor the independence of the independent auditor and the rotation of partners of the independent auditor on our engagement team as required by law;\n·\nreview the financial statements to be included in our Annual Report on Form 10-K and Quarterly Reports on Form 10-Q and reviews with management and the independent auditors the results of the annual audit and reviews of our quarterly financial statements;\n·\noversee all aspects our systems of internal accounting control and corporate governance functions on behalf of the board;\n·\nreview and approves in advance any proposed related-party transactions and report to the full Board of Directors on any approved transactions; and\n·\nprovide oversight assistance in connection with legal, ethical and risk management compliance programs established by management and the Board of Directors, including Sarbanes-Oxley Act implementation, and makes recommendations to the Board of Directors regarding corporate governance issues and policy decisions.\nIt is determined that David F. Lutz possesses accounting or related financial management experience that qualifies him as an audit committee financial expert as defined by the rules and regulations of the SEC.\nIndependence of the Board\nAs required under the Nasdaq Stock Market listing standards, a majority of the members of a listed companys Board of Directors must qualify as independent, as affirmatively determined by the Board of Directors. Our Board has undertaken a review of the independence of each director. Based on information provided by each director concerning her or his background, employment, and affiliations, our board has determined that David F. Lutz and Benjamin N. Grier do not have relationships that would interfere with the exercise of independent judgment in carrying out the responsibilities of a director and that each of these directors is independent as that term is defined under the listing requirements and rules of Nasdaq.\nIn making this determination, the Board found that none of these directors had a material or other disqualifying relationship with the Company.\nConflicts of Interest\nMembers of our management are associated with other firms involved in a range of business activities. Consequently, there are potential inherent conflicts of interest in their acting as officers and directors of our company. Although the directors are engaged in other business activities, we anticipate they will devote an important amount of time to our affairs.\nOur officers and directors are now and may in the future become shareholders, officers or directors of other companies, which may be formed for the purpose of engaging in business activities similar to ours. Accordingly, additional direct conflicts of interest may arise in the future with respect to such individuals acting on behalf of us or other entities. Moreover, additional conflicts of interest may arise with respect to opportunities which come to the attention of such individuals in the performance of their duties or otherwise. Currently, we do not have a right of first refusal pertaining to opportunities that come to their attention and may relate to our business operations.\nOur officers and directors are, so long as they are our officers or directors, subject to the restriction that all opportunities contemplated by our plan of operation which come to their attention, either in the performance of their duties or in any other manner, will be considered opportunities of, and be made available to us and the companies that they are affiliated with on an equal basis. A breach of this requirement will be a breach of the fiduciary duties of the officer or director. If we or the companies with which the officers and directors are affiliated both desires to take advantage of an opportunity, then said officers and directors would abstain from negotiating and voting upon the opportunity. However, all directors may still individually take advantage of opportunities if we should decline to do so. Except as set forth above, we have not adopted any other conflict of interest policy with respect to such transactions.\nInvolvement in Certain Legal Proceedings\nNo director, person nominated to become a director, executive officer, promoter or control person of the Company has, during the last ten years: (i) been convicted in or is currently subject to a pending criminal proceeding (excluding traffic violations and other minor offenses); (ii) been a party to a civil proceeding of a judicial or administrative body of competent jurisdiction and as a result of such proceeding was or is subject to a judgment, decree or final order enjoining future violations of, or prohibiting or mandating activities subject to any Federal or state securities or banking or commodities laws including, without limitation, in any way limiting involvement in any business activity, or finding any violation with respect to such law; (iii) has any bankruptcy petition been filed by or against the business of which such person was an executive officer or a general partner, whether at the time of the bankruptcy or for the two years prior thereto; (iv) been the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of: (a) Any Federal or State securities or commodities law or regulation; or (b) any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or (c) any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; nor (v) been the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member (covering stock, commodities or derivatives exchanges, or other SROs).\nCode of Conduct and Ethics\nWe have adopted a written code of ethics that applies to all directors, officers and employees in accordance with the rules of the NASDAQ Stock Market and the SEC. We have filed a copy of our code of ethics as an exhibit to our Registration Statement filed on Form S-1. You will be able to review these documents by accessing our public filings at the SECs web site at sec.report. In addition, a copy of the code of ethics will be provided without charge upon request from us. We intend to disclose any amendments to or waivers of certain provisions of our code of ethics in a Current Report on Form 8-K. Item 11. Executive Compensation\nThe following tables set forth certain information concerning all compensation paid, earned or accrued for service by our President, Chief Operating Officer, Principal Financial Officer and Corporate Secretary in the fiscal years ended August 31, 2022 and 2021. This table consists of all the executive officers of the Company who served in such capacity at the end of the fiscal year.\n2022 AND 2021 SUMMARY COMPENSATION TABLE\nName and Principal position\nYear\nSalary\n($)\nBonus\n($)\nStock awards\n($)\nOption awards\n($)\nNon-equity incentive plan compensation\n($)\nChange in pension value and nonqualified deferred compensation earnings\n($)\nAll other compensation\n($)\nTotal\n($)\nKermit Harris\n$ 60,000\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nPresident\n$ 55,000\n$ 0.0\n$ 12,500\n$ 0.0\n$ 0.0\n$ 0.0\n$ 0.0\n$ 67,500\nDaniel Claycamp(1)\n$ 120,000\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nCEO, Astra-Holcomb Energy Systems Inc.\n$ 75,000\n$ 0.0\n$ 187,500\n$ 0.0\n$ 0.0\n$ 0.0\n$ 0.0\n$ 262,500\nRachel Boulds\n$ 24,000\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nCFO\n$ 16,000\n$ 0.0\n$ 37,500\n$ 0.0\n$ 0.0\n$ 0.0\n$ 0.0\n$ 53,500\nLisa Thompson(2)\n$ 24,000\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nCorporate Secretary\n$ 22,000\n$ 0.0\n$ 2,500\n$ 0.0\n$ 0.0\n$ 0.0\n$ 0.0\n$ 24,500\nDouglas Hampton(3)\n$ 0.0\n$ 0.0\n$ 0.0\n$ 0.0\n$ 0.0\n$ 0.0\n$ 0.0\n$ -\nPresident, Astra Energy California, Inc.\n$ N/A0.0\n$ N/A\n$ N/A\n$ N/A\n$ N/A\n$ N/A\n$ N/A\n$ N/A\n(1)\nMr. Claycamp was appointed a director of the Company on August 4, 2021 and as COO on February 1, 2021. Mr. Claycamp resigned both positions on November 3, 2022. Mr. Claycamp was appointed as CEO and a director of Astra-Holcomb Energy Systems Inc. on August 17, 2022.\n(2)\nMrs. Thompson was appointed Corporate Secretary of the Company on October 1, 2020 and was appointed Corporate Secretary of Astra-Holcomb Energy Systems Inc. on August 17, 2022.\n(3)\nMr. Hampton was appointed as President and Director of Astra Energy California, Inc. on July 15, 2022.\nCompensation of Executive Officers\nEach of the executive officers has a services or consulting agreement with our company.\nOn October 1, 2020, we entered into a services agreement with Kermit Harris, wherein, Mr. Harris will receive a monthly fee of $5,000. In addition, Mr. Harris received 500,000 pre-split shares of common stock of the Company pursuant to his agreement.\nOn October 3, 2020, we entered into a services agreement with Lisa Thompson, wherein, Ms. Thompson will receive a monthly fee of $2,000. In addition, Ms. Thompson received 100,000 pre-split shares of common stock of the Company pursuant to her agreement.\nOn January 16, 2021, we entered into a contract services agreement with Rachel Boulds, wherein, Ms. Boulds will receive a monthly fee of $2,000. In addition, Ms. Boulds received 50,000 pre-split shares of common stock of the Company pursuant to her agreement.\nOn February 1, 2021, we entered into a consulting agreement with Daniel Claycamp, wherein Mr. Claycamp will receive an hourly fee for services. In addition, Mr. Claycamp received 250,000 pre-split shares of common stock pursuant to his agreement. On February 11, 2022, Mr. Claycamp shall received an additional 250,000 shares of common stock.\nThe Company does not have a compensation committee. Given the nature of the Companys business and the current composition of management, the board of directors does not believe that the Company requires a compensation committee at this time.\nCompensation of Directors\nWe have no arrangements for the remuneration of our directors, except that they will be entitled to receive reimbursement for actual, demonstrable out-of-pocket expenses, including travel expenses, if any, made on our behalf in the investigation of business opportunities. Item 12. Security Ownership of Certain Beneficial Owners and Management Related Stockholder Matters\nThe following table sets forth, as of November 30, 2022, certain information concerning the beneficial ownership of our Common Stock by: (i) each stockholder known by us to own beneficially 5% or more of our outstanding Common Stock; (ii) each director; (iii) each named executive officer; and (iv) all of our executive officers and directors as a group, and their percentage ownership:\nTitle of Class\nName and Address of\nBeneficial Owner\nAmount and Nature of Beneficial Ownership\nPercentage\nCommon\nKermit A Harris(1)\nSouthfield, Michigan\n1,500,000 2.22 %\nCommon\nRachel Boulds(2)\nMurray, UT\n150,000 .022 %\nCommon\nDaniel L Claycamp(3)\nWest Frankfort, IL\n980,000 1.46 %\nCommon\nLisa Thompson(4)\nLangley, British Columbia, Canada\n300,000 .011 %\nCommon\nDavid F. Lutz(5)\nGolden, CO\n50,000 .007 %\nCommon\nBenjamin N. Grier(6)\nSouthfield, MI\n35,000 .005 %\nCommon\nDouglas Hampton(7)\nAtlanta, GA\n3,000 .001 %\nCommon\nAlbert Mardikian(8)\nHuntington Beach, CA\n10,000,000 14.9 %\nDirectors and Officers as a Group\n(8 persons)\n13,018,000 19.495 %\nCommon\nAlita Capital Inc.\n(Ron Loudon)\nPoway, CA\n3,989,714 5.97 %\nCommon\nTrimark Capital Partners Inc.\n(Ron Loudon)\nGrand Cayman, Cayman Islands\n6,000,000 8.98 %\nCommon\nUnited Capital Management Inc.\n(Schaad Brannon)\nLas Vegas, NV\n3,000,000 4.49 %\n__________\n(1)\nMr. Harris was appointed President and Director on October 1, 2020\n(2)\nMs. Boulds was appointed CFO on January 19, 2021.\n(3)\nMr. Claycamp was appointed a director of the Company on August 4, 2021 and as COO on February 1, 2021. Mr. Claycamp resigned both positions on November 3, 2022. Mr. Claycamp was appointed as CEO and a director of Astra-Holcomb Energy Systems Inc. on August 17, 2022.\n(4)\nMs. Thompson was appointed Corporate Secretary of the Company on October 1, 2020 and as Corporate Secretary of Astra-Holcomb Energy Systems Inc. on August 17, 2022.\n(5)\nMr. Lutz was appointed a director on July 28, 2022.\n(6)\nMr. Grier was appointed a director on July 28, 2022.\n(7)\nMr. Hampton was appointed President and Director of Astra Energy California Inc. on July 15, 2022.\n(8)\nMr. Mardikian is a Director of Regreen Technologies Inc.\nThe number of shares beneficially owned by each entity, person, director or executive officer is determined in accordance with the rules of the SEC, and the information is not necessarily indicative of beneficial ownership for any other purpose. Under such rules, beneficial ownership includes any shares over which the individual has sole or shared voting power or dispositive power as well as any shares that the individual has the right to acquire within 60 days of the date through the exercise of any stock option, warrants or other rights. Except as otherwise indicated, and subject to applicable community property laws, the persons named in the table have sole voting and dispositive power with respect to all shares of common stock held by that person. The percentage of shares beneficially owned is computed on the basis of 66,774,540 shares of our common stock outstanding as of the date of this annual report.\nThe following table sets forth, as of November 30, 2022, certain information concerning the beneficial ownership of our Preferred Stock:\nTitle of Class\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Ownership\nPercent of Class\nPreferred A\nVision Opportunity Master Fund, Ltd. 317 Madison Avenue, Suite 1220, New York, NY\n7,774 100 % Item 13. Certain Relationships and Related Transactions, and Director Independence\nOn October 1, 2020, the Company entered into a services agreement with the President, whereby the Company agreed to pay a monthly fee of $5,000 until terminated by either party. The company also issued 1,500,000 common shares to the President upon execution of the Agreement. The shares were valued at $0.008 for total non-cash compensation of $12,500. As of August 31, 2022, the Company owes $57,500 to the President for accrued fees.\nOn October 1, 2020, the Company entered into a services agreement with the Corporate Secretary, whereby the Company agreed to pay a monthly fee of $2,000 until terminated by either party. The company also issued 300,000 common shares to the Corporate Secretary for total non-cash compensation of $2,500.\nOn January 1, 2021, the Company entered into a services agreement with the Corporate Communications Officer for cash compensation of $2,500 per month. The company also issued 150,000 common shares to the officer for total non-cash compensation of $2,500.\nOn January 16, 2021, the Company entered into a services agreement with the Chief Financial Officer for cash compensation of $2,000 per month. The company also issued 150,000 common shares to the officer for total non-cash compensation of $37,500.\nOn February 1, 2021, the Company entered into a services agreement with the Chief Operating Officer for cash compensation of $10,000 per month. The Company also issued 250,000 shares of common hares to the officer for total non-cash compensation of $62,500. Item 14. Principal Accountant Fees and Services\nAudit Fees\n$ 25,820\n$ 12,020\nAudit-Related Fees\n$ -\n$ -\nTax Fees\n$ -\n$ -\nAll Other Fees\n$ -\n$ -\nAudit fees represent fees for professional services rendered by our principal accountants for the audit of our annual financial statements and review of the financial statements included in our Forms 10-Q or services that are normally provided by our principal accountants in connection with statutory and regulatory filings or engagements.\nAudit-related fees represent professional services rendered for assurance and related services by the accounting firm that are reasonably related to the performance of the audit or review of our financial statements that are not reported under audit fees.\nTax fees represent professional services rendered by the accounting firm for tax compliance, tax advice, and tax planning.\nAll other fees represent fees billed for products and services provided by the accounting firm, other than the services reported for the other three categories.\nPart IV Item 15. Exhibits\nThe following exhibits are filed herewith or are incorporated by reference to exhibits previously filed with the Securities and Exchange Commission.\nIncorporated by Reference\nFiled\nExhibit No.\nExhibit Description\nForm\nExhibit\nFiling Date\nHerewith\n3.1\nArticles of Incorporation\n10-KSB\n3.1\n12/14/2005\n3.2\nAmended and Restated Bylaws\n8-K\n3.1\n08/16/2005\n3.3\nAmendment to Articles of Incorporation\n10-KSB\n3.1\n11/28/2006\n3.4\nAmendment to the Articles of Incorporation indicating name change and forward stock split\n8-K\n3.1\n09/15/2021\n4.1\nForm of Certificate of Designation of Rights and Preferences of Series A Convertible Preferred Stock\n8-K\n10.3\n04/14/2006\n4.2\nForm of Certificate of Designation of Rights and Preferences of Series B Convertible Preferred Stock\n8-K\n10.3\n01/18/2007\n4.3\nForm of Certificate of Designation of Rights and Preferences of Series C Convertible Preferred Stock\n8-K\n10.3\n11/07/2007\n4.4\nForm of Certificate of Designation of Rights and Preferences of Series D Convertible Preferred Stock\n8-K\n10.3\n05/30/2008\n4.5\nCertificate, Amendment or Withdrawal of Designation filed with the Nevada Secretary of State on January 21, 2022.\n8-K\n4.16\n02/03/2022\n10.1\nExclusive Technology Licensing and Distribution Agreement for the Island of Jamaica dated February 24, 2021.\n8-K\n10.1\n03/17/2021\n10.2\nSale and Purchase Agreement for the Country of Jamaica dated March 5, 2021\n8-K\n10.2\n03/17/2021\n10.3\nExclusive Technology Licensing and Distribution Agreement for the Province of Alberta dated March 1, 2021\n8-K\n10.3\n03/17/2021\n10.4\nSale and Purchase Agreement for the Province of Alberta dated March 5, 2021\n8-K\n10.4\n03/17/2021\n10.5\nEffective November 1, 2021, the Company entered into an Exclusive Licensing Agreement and Promissory Note with Corporate Guarantee with Albert Mardikian, Regreen Technologies Inc. and Global Sustainable Technologies Inc.\n8-K\n10.1\n11/15/2021\n10.6\nEmployment Agreement with Kermit Harris naming him President of the Registrant dated October 1, 2020,\nS-1\n10.6\n03/03/2022\n10.7\nService Agreement with Lisa Thompson as corporate Secretary dated October 3, 2020\nS-1\n10.7\n03/03/2022\n10.8\nConsulting Agreement with Heidi Thomasen dated January 1, 2021\nS-1\n10.8\n03/03/2022\n10.9\nAgreement with Rachel Boulds, CPA as contracted Chief Financial Officer dated January 16, 2021\nS-1\n10.9\n03/03/2022\n10.10\nAgreement with Dan Claycamp appointing him as Chief Operating Officer dated February 1, 2021\nS-1\n10.10\n03/03/2022\n10.11\nStock Cancellation Agreement dated January 13, 2022\n8-K\n10.12\n02/03/2022\n10.12\nLoan/Convertible Debenture dated January 11, 2022\nS-1\n10.12\n06/02/2022\n10.13\nUganda Investment Authority Investment License dated November 5, 2021\nS-1\n10.13\n06/02/2022\n10.14\nSupply and Installation Contract for Green Hygienics Holdings Inc. dated January 12, 2022\nS-1\n10.14\n06/02/2022\n10.15\nCommon Stock Purchase Agreement between the Company and Albert Mardikian\n8-K\n10.1\n08/10/2022\n10.16\nAddendum to Common Stock Purchase Agreement\n8-K\n10.2\n08/10/2022\n10.17\nCommon Stock Purchase Agreement between the Company and Alpha Ventures LLC\n8-K\n10.1\n08/24/2022\n10.18\nCommon Stock Purchase Agreement between the Company and Garan SAS Di Serapian Aradavast Carlo & Co.\n8-K\n10.1\n09/22/2022\n10.19\nCommon Stock Purchase Agreement between the Company and Hagop Istanboulli\n8-K\n10.2\n09/22/2022\n10.20\nCommon Stock Purchase Agreement between the Company and Rafi Istanboulli\n8-K\n10.3\n09/22/2022\n10.21\nCommon Stock Purchase Agreement between the Company and Chant Istanboulli\n8-K\n10.4\n09/22/2022\n10.22\nCommon Stock Purchase Agreement between the Company and Jack Koumjian\n8-K\n10.5\n09/22/2022\n14.1\nCode of Ethics\nx\n21.1\nList of Subsidiaries\nx\n31.1\nRule 13a-14(a)/15d-14(a) Certification of Principal Executive Officer\nx\n31.2\nRule 13a-14(a)/15d-14(a) Certification of Principal Financial Officer\nx\n32.1\nSection 1350 Certification of Principal Executive Officer\nx\n32.2\nSection 1350 Certification of Principal Financial Officer\nx\n99.5\nAudit Committee Charter\nx\n101.INS\nInline XBRL Instance Document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nItem 16. Form 10-K Summary\nWe have elected to not provide information under this Item.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized.\nASTRA ENERGY INC.\n/s/ Kermit Harris\nDecember 14, 2022\nKermit Harris\nDate\nPresident\n/s/ Rachel Boulds\nDecember 14, 2022\nRachel Boulds\nDate\nChief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\n/s/ Kermit Harris\nDecember 14, 2022\nKermit Harris\nDate\nPresident and Director\n/s/ Daniel Claycamp\nDecember 14, 2022\nDaniel Claycamp\nDate\nDirector\n/s/ David F. Lutz\nDecember 14, 2022\nDavid F. Lutz\nDate\nDirector\n/s/ Benjamin N. Grier\nDecember 14, 2022\nBenjamin N. Grier\nDate\nDirector"
}