{
    "cik": "1286459",
    "company": "ALL FOR ONE MEDIA CORP.",
    "filing_type": "10-K",
    "filing_date": "2022-12-29",
    "period_of_report": "2022-09-30",
    "sic": "7900",
    "state_of_inc": "UT",
    "state_location": "NY",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1286459/0001477932-22-009557-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1286459/000147793222009557/afom_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1286459/0001477932-22-009557.txt",
    "filename": "1286459_10K_2022_0001477932-22-009557.htm",
    "content": "ITEM 1. BUSINESS\nDescription of Business\nAll for One Media Corp. (the Company) was incorporated in the State of Utah on March 2, 2004. The Company is a media and entertainment company focused on creating, launching and marketing original pop music groups commonly referred to as boy bands and girl groups.\nOn October 26, 2015, the Company entered into an Asset Exchange Agreement (the Asset Exchange) with Crazy For The Boys, LLC (CFTB), a privately held company, and certain members owning membership interest in CFTB whereby the Company acquired certain assets from CFTB in exchange for 5,201,500 shares of the Companys common stock. The assets that were acquired included a movie screenplay, master recordings, trademarks, and web domain names (the CFTB Assets).\nOn December 7, 2016, the Company organized a subsidiary in the state of Nevada, Crazy for the Boys Movie, LLC (CFTB Movie) which was created for the sole purpose of financing, producing and commercially exploiting (via all distribution sources and other means of revenue generation) one feature-length motion picture as a coming of age, musical dramedy, entitled Drama Drama (formerly with a working title of Crazy For the Boys) and all of its allied, ancillary, subsidiary and merchandising rights. The Company is the Managing Member of CFTB Movie and will have the sole and exclusive right to operate CFTB Movie. As of September 30, 2022 and 2021, the Company owns approximately 70% of CFTB Movie, the Companys majority owned subsidiary.\nIn May 2017, the Company entered into an Assignment and Transfer Agreement with Crazy for the Boys GA LLC (CFTB GA), a company organized in the state of Georgia, whereby CFTB GA assigned and transferred all ownership, asset rights and other interest in CFTB GA to CFTB Movie. CFTB GA was created for the sole purpose of producing the Movie in the State of Georgia, in the city of Savannah, which offers production incentives up to 30% of Georgia production expenditures in transferable tax credits. The Georgia tax incentive program is available for qualifying projects, including feature films, television series, commercials, music videos, animation and game development. Consequently, CFTB GA became a wholly owned subsidiary of CFTB Movie and as of September 30, 2022 and 2021, the consolidated financial statements of the Company include the accounts of CFTB GA. Filming for the Movie was completed in July 2017 and the post-production phase was completed in December 2018. The Company started to screen the movie in January 2019 for potential buyers. The Company had received several offers for the distribution of the film and the Company continues to review any offers.\nAll For One Media Corp. is in the business of targeting the lucrative tween demographic across a multitude of entertainment platforms. The Companys primary business objective is to embark on creating, launching and marketing original pop music groups, commonly referred to as boy bands and girl groups, by utilizing both traditional and social media models. All For One Media owns over fifty completed professionally produced master recordings, as well as a full-length motion picture entitled Drama Drama (formerly with a working title of Crazy For the Boys) (the Film) that is ready for release. This musical comedys backstory creates a fictional girl group by the name of Drama Drama, and the Company intends to launch a new girl group with the same name simultaneous to the release of the Film.\nThe Company expects to generate revenues from movie receipts, sales, downloads and streaming of original recorded music, videos, motion pictures, music publishing, live performances, licensed merchandise and corporate sponsorships.\nOn January 17, 2020, our parent entity, entered into a Stock Purchase and Sale Agreement with, our former subsidiary, Carmel Valley Productions Inc. (CVPI) whereby the Company sold 90% of its 100% interest in CVPI and any of the Companys right to receive revenues or repayment from the $100,000 advance on film rights under the terms of the Co-Production and Finance Agreement dated on July 24, 2019, for a total purchase price of $50,000.\nOn February 16, 2021, we entered into an agreement with Quiver Distribution RB USA, Inc (Quiver) to distribute (Distribution Agreement) our full-length PG13-rated feature film, Drama Drama, (formerly with a working title of Crazy For the Boys). Pursuant to the Distribution Agreement, rights for all forms of VOD (including but not limited to transactional, subscription and advertising), EST, television, non-theatrical were given to Quiver and all other rights were reserved to the Company including ad-free Youtube rights. In addition, after Quiver has deducted its distribution fee and recouped 100% of its actual, direct, arms-length expenses (distribution expenses), 100% of the backed participation shall go to the Company. Further, Quiver shall earn a distribution fee of 20%, increasing to 30% once Quiver has returned $400,000 to the Company. As of September 30, 2022, Quiver had not yet recouped their distribution expenses and we have not realized any revenue.\nThe film, Drama Drama, was released on June 1, 2021, available across all major platforms, including iTunes, Amazon, Google, Microsoft, Vudu, Fandango Now, Comcast, Cox, Spectrum, DirectTV, and Dish, among others. In addition, Drama Drama is available on Youtube, where it is approaching five million views and has been watched in over 100 countries on 5 continents.\nThis first window in the release process was SVOD (Streaming) as discussed above and the second window in the release process will be by International Sales, Cable and Broadcast TV. In addition, the Drama Drama Official Soundtrack has been released through all major music streaming platforms on May 18, 2021, including Spotify, Apple Music, and TikTok.\nAs previously discussed, Drama Drama (formerly with a working title of Crazy For the Boys), the motion picture, has tested well with our target tween and teen demographic in its own right, but has also been designed to serve as a 100-minute launch vehicle for Drama Drama, the girl group.\nOur goal is to generate revenues related to the Drama Drama franchise from the movie, music, merchandising, live concert performances, and additional sources.\nWe are currently exploring opportunities to expand the Drama Drama brand and has held several talks about a short or long form sequels well as new Drama Drama recordings and Music Videos. In FY 2022, the Company released the song and Dance Video Snoochie Boochie which was written by Billboard award winning song writer Sam Hollander and produced by multi-platinum producer Rob Grimaldi.\nThe Company plans on introducing a new music platform in 2023 with the release of two new singles and accompanied by Music Videos.\nIn addition, the Company is developing a new Screen Play, with the expectation that it will be produced in FY 2023 and completing a sizzle reel for the Dream Street documentary which will be released in Q2 2023.\nWe plan on introducing other entertainment initiatives that are currently in earlier stages of discussion. ITEM 1A. RISK FACTORS\nThis investment has a high degree of risk. Before you invest you should carefully consider the risks and uncertainties described below and the other information in this prospectus. If any of the following risks actually occur, our business, operating results and financial condition could be harmed and the value of our stock could go down. This means you could lose all or a part of your investment.\nRISKS RELATED TO OUR COMPANY\nAn occurrence of an uncontrollable event such as the COVID-19 pandemic may negatively affect our operations.\nThe occurrence of an uncontrollable event such as the COVID-19 pandemic may negatively affect our operations. A pandemic typically results in social distancing, travel bans and quarantine, and this may limit access to our facilities, customers, management, support staff and professional advisors. These factors, in turn, may not only impact our operations, financial condition and demand for our goods and services but our overall ability to react timely to mitigate the impact of this event. Also, it may hamper our efforts to comply with our filing obligations with the Securities and Exchange Commission.\nWe may not achieve profitability or positive cash flow.\nOur ability to achieve and maintain profitability and positive cash flow will be dependent upon such factors as our ability to organize and promote concerts. Based upon current plans, we expect to incur operating losses in future periods because we expect to incur expenses that will exceed revenues for an unknown period of time. We cannot guarantee that we will be successful in generating sufficient revenues to support operations in the future.\nWe have a limited operating history which may not be an indicator of our future results.\nWe are an early-stage company with a limited capital base. We have been engaged in organization and start-up activities related to financing the launch of a girl group band. We have no operating history investors may use to evaluate our future performance. As a result of our limited operating history, our plan for rapid growth, and the increasingly competitive nature of the markets in which we operate, the historical financial data is of limited value in evaluating our future revenue and operating expenses. Our planned expense levels will be based in part on expectations concerning future revenue, which is difficult to forecast accurately based on current plans of expansion and growth. We may be unable to adjust spending in a timely manner to compensate for any unexpected shortfall in revenue. Further, general and administrative expenses may increase significantly as we expand operations. To the extent that these expenses precede, or are not rapidly followed by, a corresponding increase in revenue, our business, operating results, and financial condition will suffer.\nWe are dependent on a limited number of proprietary copyrights.\nWe intend to derive all revenue from two properties, the Drama Drama film and the associated soundtrack, which, even if successful, will likely generate revenues for only a limited period of time. Because our licensing revenue is highly subject to the changing trends in the entertainment business, our licensing revenue may be subject to dramatic increases and decreases. Nevertheless, we feel that by promoting these two properties to launch our brand, we can successfully leverage the maturity of social media to connect tweens with content that is relevant and with which they can identify. We plan to expand our operations with other films and the creation of a girl band and boy band.\nCompetition in the entertainment industry may make it difficult to succeed long-term.\nThe recorded music, motion picture, and music publishing industries are highly competitive. Our competition includes major media and entertainment studios, independent film and music production companies, and television networks, both generally and concurrently at the time of release of our respective content. We compete with larger production studios that are better capitalized, who can fund projects based on the returns of prior productions. We will compete with these companies for artists, talent, airtime, and space in retail outlets. We are not at present, and do not expect in the foreseeable future to be, a significant participant in this marketplace. The market for music and movie production, distribution, and marketing is very competitive, and our lack of experience, compared to that of these competitors, may impair our ability to successfully produce content that creates a positive return on investment. Furthermore, we face indirect competition from alternative forms of leisure, such as travel, sporting events, outdoor recreation, and other cultural activities.\nThe entertainment industry is highly competitive, rapidly evolving and subject to constant change. Other entertainment companies currently offer one or more of each of the types of products and services we plan to offer. In addition, our music and motion picture productions will compete for audience acceptance and exhibition outlets with music and motion pictures produced and distributed by other larger, more established companies. As a result, the success of any of our recorded music products or motion pictures is dependent not only on the quality and acceptance of a particular production, but also on numerous independent companies with whom we may partner. Some of our competitors in the music business will include Motown, Time Warner Inc., Universal Music Group, Sony BMG, and EMI, and numerous independent companies. We expect that our film business will compete with well-established companies, including MGM, DreamWorks, Time Warner Inc., Sony, Paramount, and Universal, as well as numerous small independent companies, all of which produce, develop or market films, DVDs, television, and cable programming.\nThe Company must respond successfully to ongoing changes in the U.S. video entertainment industry and consumer viewing patterns to remain competitive.\nThe Company expects that a substantial portion of its revenues and profits will be derived from the production and licensing of video entertainment offerings. The U.S. video entertainment industry is evolving, with developments in technology leading to new video services that are experiencing rapid growth, resulting in higher overall video content consumption as well as a shift in consumer viewing patterns as consumers seek more control over when, where, and how they view video content. These changes pose risks to the traditional U.S. television industry and some of the Companys business models, including the disruption of the traditional television content delivery model by video streaming services, some of which are growing rapidly. The Companys strategy to address these risks, including continuing to produce high-quality original content, and investing in technology and working with partners to enhance our content offerings, may not be successful. The Company may incur significant costs to implement its strategy and respond to and mitigate the risks from these changes, and, if not successful, could experience a significant adverse impact on the Companys competitive position, businesses and results of operations.\nThe popularity of content is difficult to predict and can change rapidly and low public acceptance of the Companys content will adversely affect its results of operations.\nThe revenues expected from the sale, distribution, and licensing of television programming, feature films, music, and other content will depend primarily on widespread public acceptance of that content, which is difficult to predict and can change rapidly. The Company must invest substantial amounts in the production and marketing of its content before it learns whether such content will reach anticipated levels of popularity with consumers. The popularity of the Companys content depends on many factors, only some of which are within the Companys control. Examples include the popularity of competing content (including locally-produced content internationally), the availability of alternative forms of leisure and entertainment activities, the Companys ability to maintain or develop strong brand awareness and target key audiences and the Companys ability to successfully anticipate (and timely adapt its content to) changes in consumer tastes in the countries and territories in which the Company operates. Low public acceptance of the Companys content will adversely affect its results of operations.\nGenerally, feature films that perform well upon initial release also have commercial success in subsequent distribution channels. Therefore, the underperformance of a feature film, especially an event film, upon its public release can result in lower than expected revenues for the Company from the license of the film to broadcast and cable networks. If a new event film fails to achieve commercial success upon release, it may limit the Companys ability to create new content. The failure to develop successful new content could have an adverse effect on the Companys results of operations.\nConsumer purchasing habits are not consistent throughout the year.\nSales of music and licensed goods concepts are seasonal, with a high percentage of retail sales occurring during the third and fourth quarters of the calendar year. As a result of the seasonal nature of our industry, we would be significantly and adversely affected by unforeseen events that negatively impact the retail environment or consumer buying patterns, particularly if such events were to impact the key-selling season.\nSome initiatives to respond to and address the changes to the U.S. entertainment industry and consumer viewing and listening patterns may be outside the Companys control.\nWhile the Company supports the development of better consumer interfaces, the development and implementation of these interfaces are often outside the Companys control. In addition, the Company may not be able to introduce new business models and products to enhance the value of its content without the cooperation of affiliates or other partners.\nAdvances in technology may have a material adverse effect on our revenues.\nAdvances in technology may affect the manner in which entertainment content is distributed to consumers. These changes, which might affect the entertainment industry as a whole, include the proliferation of digital music players, cloud-based services that allow consumers to download and store single songs, and pay-per-view movie services. These developments have created new outlets for consumers to purchase entertainment content. These new outlets may affect the quantity of entertainment products available for purchase and may reduce the amount that consumers are willing to pay for particular products. As a result, there could be a negative impact on our ability to sell DVDs and CDs. Any failure to adapt our business model to these changes could have a material adverse effect on our revenues.\nOur success will depend on external factors in the music and film industries.\nOperating in the music and film industries involves a substantial degree of risk. Each planned girl group and boy band music project or film production is an individual artistic work, and unpredictable audience reactions determine commercial success. The commercial success of a music or film project also depends on:\n·\nthe quality and acceptance of other competing records or films released into the marketplace at or near the same time;\n·\ncritical reviews;\n·\nthe availability of alternative forms of entertainment and leisure activities;\n·\ngeneral economic conditions; and\n·\nvarious other tangible and intangible factors.\nEach of these factors is subject to change and cannot be predicted with certainty. There can be no assurance that our planned music and film projects will receive favorable ratings or reviews or that consumers will purchase our entertainment products and services.\nThe Companys results of operations may be adversely affected if the Companys efforts to increase sales of its video content and make digital ownership of content more compelling to consumers are not successful.\nSeveral factors have contributed to an industry-wide decline in sales of home entertainment products in physical formats in recent years, including consumers shifting to on demand video subscriptions and electronic purchases and rentals; consumers electing to rent films using discount rental kiosks; changing retailer strategies and initiatives (e.g., reduction in floor space devoted to home entertainment products in physical formats); retail store closures; weak economic conditions; increasing competition for consumer discretionary time and spending; and piracy. The Companys efforts to offset the decline in sales of home entertainment products in physical formats and to make digital ownership of content more attractive to consumers may not be successful or may take several more years to become successful.\nThe Company may be adversely affected if distributors fail to adequately promote our creative projects.\nDecisions regarding the timing of release and promotional support of our girl group and boy band music, music video, motion picture, television, and related licensing products are important in determining the success of the Company. As with most production companies, we do not control the manner in which our distributing partners distribute our content to final consumers. Although our distributors will have a financial interest in the success of our girl group and boy band projects, and decision by our distributors to not promote our products, or to promote a competitors products, could have a material adverse effect on our business and financial condition.\nIf the Company fails to compete successfully against alternative sources of entertainment, there may be an adverse effect on the Companys results of operations.\nThe Company competes with all other sources of entertainment, including television, premium pay television services, on demand video subscriptions, feature films, the Internet, home entertainment products, videogames, social networking, print media, pirated content, live sports and other events, for consumers leisure and entertainment time and discretionary spending. The increased number of media and entertainment choices available to consumers has made it much more difficult to attract and obtain their attention and time. There can be no assurance that the Company will be able to compete successfully in the future against existing or new competitors.\nThe Company must protect its intellectual property.\nWe will rely on copyright, trademark, and other proprietary rights law to protect the intellectual property of our girl group and boy band projects. Our business is subject to the risk of third parties infringing on these intellectual property rights. We may need to pursue litigation to protect our intellectual property and that of our authorized licensors, which could result in substantial costs and divert resources.\nThreats of piracy of the Companys content, products, and other intellectual property may further decrease the revenues received from the legitimate sale, licensing and distribution of its content and adversely affect its business and profitability.\nThough the Company has never been victim of copyright piracy, it may be negatively affected this practice, and any piracy of the Companys content, products and other intellectual property could reduce the revenues the Company earns from the legitimate sale, licensing and distribution of its content, products and other intellectual property. The risks relating to piracy have increased in recent years due to technological developments that have made it easier to create, distribute and store high-quality unauthorized copies of content, such as the proliferation of cloud-based storage and streaming services, increased broadband Internet speeds and penetration rates, and increased availability and speed of mobile data transmission. Piracy is particularly prevalent in countries that lack effective copyright and technical legal protections or enforcement measures, and illegitimate operators based in those parts of the world can attract viewers from anywhere in the world. Once our projects are produced for mass distribution, the Company will devote the necessary resources to protect its content, products and intellectual property, but these efforts to enforce rights and combat piracy may not be successful.\nThe Company may be subject to claims that it infringed intellectual property rights of others, which could require the Company to change its business practices.\nSuccessful claims that the Company infringes on the intellectual property rights of others could require the Company to enter into royalty or licensing agreements on unfavorable terms, incur substantial monetary liability, be prohibited preliminarily or permanently from further use of the intellectual property in question or require the Company to change its business practices to stop the infringing use, which could limit its ability to compete effectively. Even if the Company believes a claim of intellectual property infringement is without merit, defending against the claim can be time-consuming and costly and divert managements attention and resources away from its businesses.\nWe may be negatively affected by adverse general economic conditions.\nCurrent conditions in domestic and global economies are extremely uncertain. Adverse changes may occur as a result of softening global economies, wavering consumer confidence caused by the threat of terrorism and war, and other factors capable of affecting economic conditions. Such changes could have a material adverse effect on our business, financial condition, and results of operations.\nThe Companys businesses are subject to labor interruption.\nThe Company and some of its suppliers and business partners retain the services of writers, directors, actors, technicians, trade employees and others involved in the development and production of its television, feature film, and music content, who are covered by collective bargaining agreements. If negotiations to renew expiring collective bargaining agreements are not successful or become unproductive, the affected unions could take actions such as strikes, work slowdowns or work stoppages. Such actions or the possibility of such actions could result in delays in the production of the Companys television programming and feature films. The Company could also incur higher costs from such actions, new collective bargaining agreements or the renewal of collective bargaining agreements on less favorable terms. Many of the collective bargaining agreements that cover individuals providing services to the Company are industry-wide agreements, and the Company may lack practical control over the negotiations and terms of these agreements. Depending on their duration, such union or labor disputes could have an adverse effect on the Companys results of operations.\nOur success depends largely on our management.\nWe are dependent on the continued employment of Brian Lukow, our President and CEO. Although we believe that we would be able to locate a suitable replacement, if we lose the services of Mr. Lukow, we cannot assure you that we would be able to do so. Additionally, our future operating results will substantially depend on our ability to attract and retain highly qualified management, financial, technical, creative, and administrative personnel. Competition for such people is intense and can lead to increased compensation expenses. We cannot assure you that we will be able to attract and retain the personnel necessary for the development of our business.\nWe need to obtain additional financing in order to continue our operations.\nOn a prospective basis, we will require both short-term financing for operations and long-term capital to fund our expected growth. We have no existing bank lines of credit and have not established any definitive sources for additional financing programs. The entertainment industry is rapidly evolving and our inability to take advantage of opportunities because of capital constraints may have a material adverse effect on our current business and future prospects.\nRISKS RELATED TO OUR SECURITIES\nOur stock price may be volatile, which may result in losses to our shareholders.\nThe stock markets have experienced significant price and trading volume fluctuations, and the market prices of companies listed on the OTC Pink and other similarly-tiered quotation boards have been volatile in the past and have experienced sharp share price and trading volume changes. The trading price of our common stock is likely to be volatile and could fluctuate widely in response to many factors, including the following, some of which are beyond our control:\n·\nvariations in our operating results;\n·\nchanges in expectations of our future financial performance, including financial estimates by securities analysts and investors;\n·\nchanges in operating and stock price performance of other companies in our industry;\n·\nadditions or departures of key personnel; and\n·\nfuture sales of our common stock.\nDomestic and international stock markets often experience significant price and volume fluctuations. These fluctuations, as well as general economic and political conditions unrelated to our performance, may adversely affect the price of our common stock.\nOur common shares may become thinly traded and you may be unable to sell at or near ask prices, or at all.\nWe cannot predict the extent to which an active public market for trading our common stock will be sustained. This situation is attributable to a number of factors, including the fact that we are a small company that is relatively unknown to stock analysts, stockbrokers, institutional investors and others in the investment community who generate or influence sales volume. Even if we came to the attention of such persons, those persons tend to be risk-averse and may be reluctant to follow, purchase, or recommend the purchase of shares of an unproven company such as ours until such time as we become more seasoned and viable. As a consequence, there may be periods of several days or more when trading activity in our shares is minimal or non-existent, as compared to a seasoned issuer which has a large and steady volume of trading activity that will generally support continuous sales without an adverse effect on share price. We cannot give you any assurance that a broader or more active public trading market for our common stock will develop or be sustained, or that current trading levels will be sustained.\nThe market price for our common stock is particularly volatile given our status as a relatively small company, which could lead to wide fluctuations in our share price. You may be unable to sell your common stock at or above your purchase price if at all, which may result in substantial losses to you.\nShareholders should be aware that, according to SEC Release No. 34-29093, the market for penny stocks has suffered in recent years from patterns of fraud and abuse. Such patterns include (1) control of the market for the security by one or a few broker-dealers that are often related to the promoter or issuer; (2) manipulation of prices through prearranged matching of purchases and sales and false and misleading press releases; (3) boiler room practices involving high-pressure sales tactics and unrealistic price projections by inexperienced sales persons; (4) excessive and undisclosed bid-ask differential and markups by selling broker-dealers; and (5) the wholesale dumping of the same securities by promoters and broker-dealers after prices have been manipulated to a desired level, along with the resulting inevitable collapse of those prices and with consequent investor losses. Our management is aware of the abuses that have occurred historically in the penny stock market. Although we do not expect to be in a position to dictate the behavior of the market or of broker-dealers who participate in the market, management will strive within the confines of practical limitations to prevent the described patterns from being established with respect to our securities. The occurrence of these patterns or practices could increase the volatility of our share price.\nBecause the SEC imposes additional sales practice requirements on brokers who deal in shares of penny stocks, some brokers may be unwilling to trade our securities. This means that you may have difficulty reselling your shares, which may cause the value of your investment to decline.\nOur shares are classified as penny stocks and are covered by Section 15(g) of the Exchange Act, which imposes additional sales practice requirements on brokers-dealers who sell our securities. For sales of our securities, broker-dealers must make a special suitability determination and receive a written agreement prior from you to making a sale on your behalf. Because of the imposition of the foregoing additional sales practices, it is possible that broker-dealers will not want to make a market in our common stock. This could prevent you from reselling your shares and may cause the value of your investment to decline.\nFinancial Industry Regulatory Authority (FINRA) sales practice requirements may limit your ability to buy and sell our common stock, which could depress the price of our shares.\nFINRA rules require broker-dealers to have reasonable grounds for believing that an investment is suitable for a customer before recommending that investment to the customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status and investment objectives, among other things. Under interpretations of these rules, FINRA believes that there is a high probability such speculative low-priced securities will not be suitable for at least some customers. Thus, FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our shares, have an adverse effect on the market for our shares, and thereby depress our share price.\nVolatility in our common share price may subject us to securities litigation.\nThe market for our common stock is characterized by significant price volatility as compared to seasoned issuers, and we expect that our share price will continue to be more volatile than a seasoned issuer for the indefinite future. In the past, plaintiffs have often initiated securities class action litigation against a company following periods of volatility in the market price of its securities. We may, in the future, be the target of similar litigation. Securities litigation could result in substantial costs and liabilities and could divert managements attention and resources.\nOur business is subject to changing regulations related to corporate governance and public disclosure that have increased both our costs and the risk of noncompliance.\nBecause our common stock is publicly traded, we are subject to certain rules and regulations of federal, state and financial market exchange entities charged with the protection of investors and the oversight of companies whose securities are publicly traded. These entities, including the Public Company Accounting Oversight Board, the SEC and FINRA, have issued requirements and regulations and continue to develop additional regulations and requirements in response to corporate scandals and laws enacted by Congress, most notably the Sarbanes-Oxley Act of 2002. Our efforts to comply with these regulations have resulted in, and are likely to continue resulting in, increased general and administrative expenses and diversion of management time and attention from revenue-generating activities to compliance activities. Because new and modified laws, regulations and standards are subject to varying interpretations in many cases due to their lack of specificity, their application in practice may evolve over time as new guidance is provided by regulatory and governing bodies. This evolution may result in continuing uncertainty regarding compliance matters and additional costs necessitated by ongoing revisions to our disclosure and governance practices.\nSales of our currently issued and outstanding stock and conversions of notes into issued and outstanding stock may become freely tradable pursuant to Rule 144 and may dilute the market for your shares and have a depressive effect on the price of the shares of our common stock.\nA majority of the outstanding shares of our common stock are restricted securities within the meaning of Rule 144 under the Securities Act of 1933, as amended (the Securities Act) (Rule 144). As restricted shares, these shares may be resold only pursuant to an effective registration statement or under the requirements of Rule 144 or other applicable exemptions from registration under the Securities Act and as required under applicable state securities laws. Rule 144 provides in essence that one year following a company filing Form 10 information with the SEC to that effect, a non-affiliate who has held restricted securities for a period of at least six months may sell their shares of common stock. Under Rule 144, affiliates who have held restricted securities for a period of at least six months may, under certain conditions, sell every three months, in brokerage transactions, a number of shares that does not exceed the greater of 1% of a companys outstanding shares of common stock or the average weekly trading volume during the four calendar weeks prior to the sale.\nWe may seek to raise additional funds, finance acquisitions or develop strategic relationships by issuing capital stock.\nWe may finance our operations and develop strategic relationships by issuing equity or debt securities, which could significantly reduce the percentage ownership of our existing stockholders. Furthermore, any newly issued securities could have rights, preferences and privileges senior to those of our existing stock. Moreover, any issuances by us of equity securities may be at or below the prevailing market price of our stock and in any event, may have a dilutive impact on your ownership interest, which could cause the market price of our stock to decline.\nOur preferred stock could be issued to inhibit potential investors or delay or prevent a change of control that may favor you.\nSome of the provisions of our certificate of incorporation, our bylaws and Utah law could, together or separately, discourage potential acquisition proposals or delay or prevent a change in control. In particular, our board of directors has issued preferred stock with preferential voting rights to our CEO, Brian Lukow.\nOur common stock is subject to the penny stock rules of the SEC and the trading market in our securities is limited, which makes transactions in our stock cumbersome and may reduce the value of an investment in our stock.\nThe Securities and Exchange Commission has adopted Rule 15g-9 which establishes the definition of a penny stock, for the purposes relevant to us, as any equity security that has a market price of less than $5.00 per share or with an exercise price of less than $5.00 per share, subject to certain exceptions. For any transaction involving a penny stock, unless exempt, the rules require:\n·\nthat a broker or dealer approve a persons account for transactions in penny stocks; and\n·\nthe broker or dealer receive from the investor a written agreement to the transaction, setting forth the identity and quantity of the penny stock to be purchased.\nIn order to approve a persons account for transactions in penny stocks, the broker or dealer must:\n·\nobtain financial information and investment experience objectives of the person; and\n·\nmake a reasonable determination that the transaction in penny stocks are suitable for that person and the person has sufficient knowledge and experience in financial matters to be capable of evaluating the risks of transactions in penny stocks.\nThe broker or dealer must also deliver, prior to any transaction in a penny stock, a disclosure schedule prescribed by the Commission relating to the penny stock market, which, in highlight form:\n·\nsets forth the basis on which the broker or dealer made the suitability determination; and\n·\nthat the broker or dealer received a signed, written agreement from the investor prior to the transaction.\nGenerally, brokers may be less willing to execute transactions in securities subject to the penny stock rules. This may make it more difficult for investors to dispose of our common stock and cause a decline in the market value of our stock.\nDisclosure also has to be made about the risks of investing in penny stocks in both public offerings and in secondary trading and about the commissions payable to both the broker-dealer and the registered representative, current quotations for the securities and the rights and remedies available to an investor in cases of fraud in penny stock transactions. Finally, monthly statements have to be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks.\nCompetition\nThe Company competes with all forms of entertainment. A large number of companies, many with significantly more resources than All for One Media, Inc., produce and distribute film and music recordings, exploit products in the home entertainment market, and produce music for live theater and performance. Our competitive position primarily depends on the amount and quality of the content produced, its distribution and marketing success, and public response. We also compete to obtain creative and performing talents, story properties, and many other rights that are essential to the success of our business. Operating results for these offerings are influenced by seasonal consumer purchasing behavior, consumer preferences, levels of marketing and promotion, and by the timing and performance of releases, which may be directly or indirectly influenced by competitors.\nTrademarks & Copyrights\nWe own the website URLs www.dramadrama.com, www.allforone.media and www.thescab.org.\nEffect of Existing or Probable Governmental Regulations on the Business\nChildrens Privacy\nVarious laws and regulations intended to protect the interests of children are applicable to our business, including measures designed to protect the privacy of minors online. As we are currently focused on marketing content to this demographic, we will be subject to these regulations. The U.S. Childrens Online Privacy Protection Act (COPPA) limits the collection of personal information online from children under the age of 13 by operators of websites or online services. Effective July 1, 2013, the Federal Trade Commission adopted revisions to regulations under COPPA to further expand the scope of the regulations. Such regulations also limit the types of advertising we are able to sell on our websites and applications and impose strict liability for certain actions of advertisers, which could affect advertising demand and pricing. State and federal policymakers are also considering regulatory and legislative methods to protect consumer privacy on the Internet, and these efforts have focused particular attention on children and teens.\nEmerging Growth Company\nWe may be deemed to be an emerging growth company as defined in the Jumpstart Our Business Startups Act of 2012, or JOBS Act. As long as we remain an emerging growth company, we may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies, including, but not limited to, not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act; reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements; and exemptions from the requirements of holding an annual nonbinding advisory vote on executive compensation and seeking nonbinding stockholder approval of any golden parachute payments not previously approved. We may take advantage of these reporting exemptions until we are no longer an emerging growth company.\nUnder the JOBS Act, emerging growth companies can also delay adopting new or revised accounting standards until such time as those standards apply to private companies. We have irrevocably elected not to avail ourselves of this exemption from new or revised accounting standards and, therefore, will be subject to the same new or revised accounting standards as other public companies that are not emerging growth companies.\nWe will remain an emerging growth company for up to five years, although we would cease to be an emerging growth company prior to such time if we have more than $1 billion in annual revenue, more than $700 million in market value of our common stock is held by non-affiliates or we issue more than $1 billion of non-convertible debt over a three-year period. ITEM 1B: UNRESOLVED STAFF COMMENTS\nNone. ITEM 2: PROPERTIES\nThe Company currently maintains a corporate office at 236 Sarles Street, Mt. Kisco, New York 10549. The Company leases this property from its President, Brian Lukow, for $1,000 a month, which includes telephone, Internet, and electricity utilities. The Companys subsidiary also leases this space from the Companys President, under the same terms. The Company feels this space is sufficient until the Company commences full operations. ITEM 3: LEGAL PROCEEDINGS\nNone. ITEM 4: MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5: MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur shares of common stock are quoted on OTC Pink operated by the OTC Markets Group, under the symbol AFOM. The following table sets forth the range of reported high and low closing bid quotations for our common stock for the fiscal quarters indicated. These quotations reflect inter-dealer prices, without retail markup, markdown or commission, and may not represent actual transactions. Consequently, the information provided below may not be indicative of our common stock price under different conditions.\nHigh\nLow\nFiscal Year 2022\nFirst Quarter ended December 31, 2021\n$ 0.0013\n$ 0.0003\nSecond Quarter ended March 31, 2022\n$ 0.0004\n$ 0.0001\nThird Quarter ended June 30, 2022\n$ 0.0003\n$ 0.0001\nFourth Quarter Ended September 30, 2022\n$ 0.0003\n$ 0.0001\nFiscal Year 2021\nFirst Quarter ended December 31, 2020\n$ 0.0052\n$ 0.0001\nSecond Quarter ended March 31, 2021\n$ 0.0049\n$ 0.0007\nThird Quarter ended June 30, 2021\n$ 0.0014\n$ 0.0008\nFourth Quarter Ended September 30, 2021\n$ 0.0018\n$ 0.0004\nHolders\nAs of December 22, 2022, there were approximately 78 record holders of our common stock. The number of record holders does not include beneficial owners of common stock whose shares are held in the names of banks, brokers, nominees or other fiduciaries.\nDividends\nWe have not declared or paid dividends on our common stock since our formation, and we do not anticipate paying dividends in the foreseeable future. Declaration or payment of dividends, if any, in the future, will be at the discretion of our Board of Directors and will depend on our then current financial condition, results of operations, capital requirements and other factors deemed relevant by the Board of Directors. There are no contractual restrictions on our ability to declare or pay dividends.\nSecurities Authorized for Issuance under Equity Compensation Plans\n2017 Stock Incentive Plan\nIn February 2017, the Companys Board of Directors authorized the 2017 Incentive Stock Plan covering 1,000,000 shares of common stock. The purpose of the plan is designed to retain directors, executives and selected employees and consultants and reward them for making major contributions to the success of the Company. These objectives are accomplished by making long-term incentive awards under the Plan thereby providing Participants with a proprietary interest in the growth and performance of the Company. As of September 30, 2022, no stock has been issued under this plan.\nRecent Sales of Unregistered Securities; Use of Proceeds from Registered Securities\nExcept for provided below, all unregistered sales of our securities during the quarter ended September 30, 2022, were previously disclosed in a Quarterly Report on Form 10-Q or in a Current Report on Form 8-K.\n·\nDuring the three months ended September 30, 2022, the Company issued to directors and officers, an aggregate of 72,000 shares of common stock with grant date fair value of $10 as stock-based compensation. These shares were issued pursuant to an exemption from the registration requirements of the Securities Act of 1933, as amended pursuant to Section 4(a)(2) of the Act and/or Rule 506 of Regulation D promulgated thereunder since, among other things, the transactions did not involve a public offering.\n·\nDuring the three months ended September 30, 2022, the Company issued to consultants, an aggregate of 99,999,999 shares of common stock with grant date fair value of $13,334 as stock-based professional fees. These shares were issued pursuant to an exemption from the registration requirements of the Securities Act of 1933, as amended pursuant to Section 4(a)(2) of the Act and/or Rule 506 of Regulation D promulgated thereunder since, among other things, the transactions did not involve a public offering.\nThe shares of common stock, notes and warrants referenced herein were issued in reliance upon the exemption from securities registration afforded by the provisions of Section 4(a)(2) of the Securities Act of 1933, as amended, (Securities Act). ITEM 6: SELECTED FINANCIAL DATA\nNot required for smaller reporting companies. ITEM 7: MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward Looking Statements\nExcept for historical information, the following Managements Discussion and Analysis contains forward-looking statements based upon current expectations that involve certain risks and uncertainties. Such forward-looking statements include statements regarding, among other things, (a) discussions about the entertainment industry and trends, (b) our projected sales and profitability, (c) our growth strategies, (d) anticipated trends in our industry, (e) our future financing plans, (f) our anticipated needs for working capital, (g) our lack of operational experience and (h) the benefits related to ownership of our common stock. Forward-looking statements, which involve assumptions and describe our future plans, strategies, and expectations, are generally identifiable by use of the words may, will, should, expect, anticipate, estimate, believe, intend, or project or the negative of these words or other variations on these words or comparable terminology. This information may involve known and unknown risks, uncertainties, and other factors that may cause our actual results, performance, or achievements to be materially different from the future results, performance, or achievements expressed or implied by any forward-looking statements. These statements may be found under Managements Discussion and Analysis of Financial Condition and Results of Operations and Description of Business, as well as in this Report generally. Actual events or results may differ materially from those discussed in forward-looking statements as a result of various factors, including, without limitation, the following: economic, social and political conditions, global economic downturns resulting from extraordinary events such as the COVID-19 pandemic and other securities industry risks; interest rate risks; liquidity risks; credit risk with clients and counterparties; systems failures, delays and capacity constraints; network security risks; competition; reliance on external service providers; new laws and regulations affecting our business; net capital requirements; extensive regulation, regulatory uncertainties and legal matters; failure to maintain relationships with employees, customers, business partners or governmental entities; the inability to achieve synergies or to implement integration plans and other consequences associated with risks and uncertainties detailed in our filings with the SEC. We caution that the foregoing list of factors is not exclusive, and new factors may emerge, or changes to the foregoing factors may occur, that could impact our business. We undertake no obligation to publicly update or revise these statements, whether as a result of new information, future events or otherwise, except to the extent required by the federal securities laws. In light of these risks and uncertainties, there can be no assurance that the forward-looking statements contained in this Report will in fact occur as projected.\nOverview\nAll for One Media Corp. (the Company) was incorporated in the State of Utah on March 2, 2004. The Company is a media and entertainment company focused on creating, launching and marketing original pop music groups commonly referred to as boy bands and girl groups. The Companys former operations were in the business of acquiring, training, and reselling horses with an emphasis in the purchase of thoroughbred weanlings or yearlings that were resold as juveniles.\nOn October 26, 2015, the Company entered into an Asset Exchange Agreement (the Asset Exchange) with Crazy For The Boys, LLC (CFTB), a privately held company, and certain members owning membership interest in CFTB whereby the Company acquired certain assets from CFTB in exchange for 5,201,500 shares of the Companys common stock. The assets that were acquired included a movie screenplay, master recordings, trademarks, and web domain names (the CFTB Assets).\nOn December 7, 2016, the Company organized a subsidiary in the state of Nevada, Crazy for the Boys Movie, LLC (CFTB Movie) which was created for the sole purpose of financing, producing and commercially exploiting (via all distribution sources and other means of revenue generation) one feature-length motion picture as a coming of age, musical dramedy, entitled Drama Drama (formerly with a working title of Crazy For the Boys) and all of its allied, ancillary, subsidiary and merchandising rights. The Company is the Managing Member of CFTB Movie and will have the sole and exclusive right to operate CFTB Movie. As of September 30, 2022 and 2021, the Company owns approximately 70% of CFTB Movie, the Companys majority owned subsidiary.\nIn May 2017, the Company entered into an Assignment and Transfer Agreement with Crazy for the Boys GA LLC (CFTB GA), a company organized in the state of Georgia, whereby CFTB GA assigned and transferred all ownership, asset rights and other interest in CFTB GA to CFTB Movie. CFTB GA was created for the sole purpose of producing the Movie in the State of Georgia, in the city of Savannah, which offers production incentives up to 30% of Georgia production expenditures in transferable tax credits. The Georgia tax incentive program is available for qualifying projects, including feature films, television series, commercials, music videos, animation and game development. Consequently, CFTB GA became a wholly owned subsidiary of CFTB Movie and as of September 30, 2022 and 2021, the consolidated financial statements of the Company include the accounts of CFTB GA. Filming for the Movie was completed in July 2017 and the post-production phase was completed in December 2018. The Company started to screen the movie in January 2019 for potential buyers. The Company had received several offers for the distribution of the film and the Company continues to review any offers.\nAll For One Media Corp. is in the business of targeting the lucrative tween demographic across a multitude of entertainment platforms. The Companys primary business objective is to embark on creating, launching and marketing original pop music groups, commonly referred to as boy bands and girl groups, by utilizing both traditional and social media models. All For One Media owns over fifty completed professionally produced master recordings, as well as a full-length motion picture entitled Drama Drama (formerly with a working title of Crazy For the Boys) (the Film) that is ready for release. This musical comedys backstory creates a fictional girl group by the name of Drama Drama, and the Company intends to launch a new girl group with the same name simultaneous to the release of the Film.\nThe Company expects to generate revenues from movie receipts, sales, downloads and streaming of original recorded music, videos, motion pictures, music publishing, live performances, licensed merchandise and corporate sponsorships.\nOn January 17, 2020, our parent entity, entered into a Stock Purchase and Sale Agreement with, our subsidiary, Carmel Valley Productions Inc. whereby the Company sold 90% of its 100% interest in CVPI and any of the Companys right to receive revenues or repayment from the $100,000 advance on film rights under the terms of the Co-Production and Finance Agreement dated on July 24, 2019, for a total purchase price of $50,000.\nOn February 16, 2021, we entered into an agreement with Quiver Distribution RB USA, Inc (Quiver) to distribute (Distribution Agreement) our full-length PG13-rated feature film, Drama Drama, (formerly with a working title of Crazy For the Boys). Pursuant to the Distribution Agreement, rights for all forms of VOD (including but not limited to transactional, subscription and advertising), EST, television, non-theatrical were given to Quiver and all other rights were reserved to the Company including ad-free Youtube rights. In addition, after Quiver has deducted its distribution fee and recouped 100% of its actual, direct, arms-length expenses (distribution expenses), 100% of the backed participation shall go to the Company. Further, Quiver shall earn a distribution fee of 20%, increasing to 30% once Quiver has returned $400,000 to the Company. As of September 30, 2022, Quiver had not yet recouped their distribution expenses and we have not realized any revenue.\nThe film, Drama Drama, was released on June 1, 2021, available across all major platforms, including iTunes, Amazon, Google, Microsoft, Vudu, Fandango Now, Comcast, Cox, Spectrum, DirectTV, and Dish, among others.\nThis first window in the release process was SVOD (Streaming) as discussed above and the second window the release process will be by International Sales, Cable and Broadcast TV. In addition, the Drama Drama Official Soundtrack has been released through all major music streaming platforms on May 18, 2021, including Spotify, Apple Music, and TikTok.\nAs previously discussed, Drama Drama, the motion picture, has tested well with our target tween and teen demographic in its own right, but has also been designed to serve as a 100-minute launch vehicle for Drama Drama, the girl group.\nOur goal is to generate revenues related to the Drama Drama franchise from the movie, music, merchandising, live concert performances, and additional sources.\nWe are currently exploring opportunities to expand the Drama Drama brand and has held several talks about a short or long form sequels well as new Drama Drama recordings and Music Videos. In FY 2022, the Company released the song and Dance Video Snoochie Boochie which was written by Billboard award winning song writer Sam Hollander and produced by multi-platinum producer Rob Grimaldi.\nThe Company plans on introducing a new music platform in 2023 with the release of two new singles and accompanied by Music Videos.\nIn addition, the Company is developing a new Screen Play, with the expectation that it will be produced in FY 2023 and completing a sizzle reel for the Dream Street documentary which will be released in Q2 2023.\nResults of Operations\nComparison for the Years Ended September 30, 2022, and 2021:\nNet Revenues\nThe Company principally engaged in content development of media targeted at the tween demographic consisting of children between the ages of seven and fourteen.\n·\nDuring the year ended September 30, 2022, we generated minimal revenues of $8,993 from streaming music sales.\n·\nDuring the year ended September 30, 2021, we generated minimal revenues of $9,493. from streaming music sales.\nOperating Expenses\nFor the years ended September 30, 2022, and 2021, operating expenses consisted of the following:\nFor Years Ended\nSeptember 30,\nCompensation expense\n$ 96,062\n$ 96,238\nProfessional and consulting expense\n196,268\n110,992\nLicense fees\n-\n160,003\nGeneral and administrative expense\n241,535\n251,712\nTotal\n$ 533,865\n$ 618,945\nCompensation expense:\n·\nFor the year ended September 30, 2022, compensation expense decreased by $176, or less than 1%, as compared to the year ended September 30, 2021. The decrease was primarily attributable to a decrease in stock-based compensation.\nProfessional and consulting expense:\n·\nFor the year ended September 30, 2022, professional and consulting expense increased by $85,276, or 76.8%, as compared to the year ended September 30, 2021. The increase was primarily attributable to an increase in stock-based consulting fees of $36,668, an increase in consulting fees of $55,115, and an increase in legal fees of $3,320, offset by a decrease in accounting fees of $9,827.\nLicense fees:\n·\nFor the year ended September 30, 2022, license fees decreased by $160,003 or 100%, as compared to the year ended September 30, 2021. This was due to the payment of a one-time synchronization license fee paid to the song writers in 2021 for the use of their songs in the movie Drama Drama.\nGeneral and administrative expense:\n·\nFor the year ended September 30, 2022, general and administrative expense decreased by $10,117, or 4.0%, as compared to the year ended September 30, 2021. The decrease was primarily attributable to a decrease in marketing expense of $37,006 and a decrease in travel and entertainment of $5,294, offset by an increase in public company filing fees of $4,998, an increase in production expenses of $25,013, and an increase other general administrative expenses of $2,172.\nOther Income (Expenses), net\n·\nFor the year ended September 30, 2022, we had total other income, net of $2,360,369 as compared to total other expenses, net of $(2,506,018) for the year ended September 30, 2021, an increase of $4,866,387, or 194.2%. This increase was primarily due to a decrease in loss on change in fair value of derivative liabilities of $2,159,369, a decrease in initial derivative expense of $1,771,839, an increase in gain on extinguishment of debt of $96,933, an increase in gain on debt modification of $764,999, and a decrease in interest expense of $80,747, offset by an increase in loss on equity method investee of $7,500.\nNet Income (Loss)\n·\nFor the year ended September 30, 2022, net income amounted to $1,835,497 as compared to net loss of $(3,115,470) for the year ended September 30, 2021, an increase of $4,950,967, or 158.9% resulting from changes discussed above. For the year ended September 30, 2022, net income attributable to All For One Media Corp. amounted to $1,860,650 or $0.00 per share (basic and diluted), compared to a net loss attributable to All For One Media Corp. of $(3,110,176) or $(0.00) per share (basic and diluted) for the year ended September 30, 2021, an increase of $4,970,826, or 159.8% resulting from changes discussed above.\nLiquidity and Capital Resources\nLiquidity is the ability of an enterprise to generate adequate amounts of cash to meet its needs for cash requirements. We had a working capital deficit of $15,587,845 and cash of $98,612 as of September 30, 2022, and a working capital deficit of $18,491,425 and cash of $101,431 as of September 30, 2021.\nSeptember 30,\nSeptember 30,\nChange\nPercentage\nChange\nWorking capital deficit:\nTotal current assets\n$ 105,475\n$ 122,622\n$ (17,147 )\n(14.0 )%\nTotal current liabilities\n(15,693,320 )\n(18,614,047 )\n2,920,727\n15.7 %\nWorking capital deficit:\n$ (15,587,845 )\n$ (18,491,425 )\n$ 2,903,580\n15.7 %\nThe decrease in working capital deficit was primarily attributable to a decrease in current assets of $17,147 and a decrease in current liabilities of $2,920,727 primarily attributable to a decrease in derivative liabilities.\nAs of September 30, 2022, we had $2,847,637 of gross convertible notes and $2,472,500 of gross notes payable outstanding. As of September 30, 2022, we had defaulted on 6 of these convertible notes payable with aggregate outstanding principal amount of $1,047,821.\nCash Flows\nChanges in our cash balance are summarized as follows:\nYears Ended\nSeptember 30,\nNet cash used in operating activities\n$ (496,569 )\n$ (660,935 )\nNet cash used in investing activities\n(7,500 )\n-\nNet cash provided by financing activities\n501,250\n760,263\nNet change in cash\n$ (2,819 )\n$ 99,328\nNet Cash Used in Operating Activities\nNet cash used in operating activities was $496,569 for the year ended September 30, 2022, as compared to 660,935 for the year ended September 30, 2021, a decrease of $164,366, or 24.9%.\n·\nNet cash used in operating activities for the year ended September 30, 2022 primarily reflected our net income of $1,835,497 adjusted for the add-back on non-cash items such as amortization of debt discounts of $914,603, stock-based compensation expense of $62, an increase in stock-based professional fees of $36,668, gain from extinguishment of debt of $(3,935,629), gain on debt modification of $(764,999), initial derivative expense of $135,670, loss on change in fair value of derivative liabilities of $584,172, non-cash interest expense of $7,010, loss on equity-method investee of $7,500, and changes in operating asset and liabilities consisting primarily of a decrease in prepaid expenses of $14,328, increase in accounts payable and accrued liabilities - related party of $500, an increase in accrued interest of $691,313, offset by a decrease in accounts payable and accrued liabilities of $23,264.\n·\nNet cash used in operating activities for the year ended September 30, 2021 primarily reflected our net loss of $3,115,470 adjusted for the add-back on non-cash items such as amortization of debt discounts of $721,789, stock-based compensation expense of $285, gain from extinguishment of debt of $(3,838,696), initial derivative expense of $1,907,509, loss on change in fair value of derivative liabilities of $2,743,541, non-cash interest expense of $2,000, non-cash default penalty interest of $800, and changes in operating asset and liabilities consisting primarily of an increase in prepaid expenses of $13,191, increase in accounts payable and accrued liabilities - related party of $46,000 and increase in accrued interest of $910,486 offset by a decrease in accounts payable and accrued liabilities of $25,988.\nNet Cash Used in Investing Activities\nNet cash used in investing activities was $7,500 for the year ended September 30, 2022, as compared to net cash used in investing activities of $0 for the year ended September 30, 2021, a change of $7,500, or 100%.\n·\nNet cash used in investing activities for the year ended September 30, 2022, resulted from contributions to Boss Music and Entertainment in aggregate amount of $7,500 which was accounted for using the equity method.\nNet Cash Provided by Financing Activities\nNet cash provided by financing activities was $501,250 for the year ended September 30, 2022, as compared to $760,263 for the year ended September 30, 2021, a decrease of $259,013, or 34.1%.\n·\nNet cash provided by financing activities for the year ended September 30, 2022 consisted of proceeds from notes payable of $225,000, proceeds from loan payable of $50,000, and net proceeds from convertible notes payable of $276,250, offset by payment of loan payable of $50,000.\n·\nNet cash provided by financing activities for the year ended September 30, 2021 consisted of proceeds from advance from a related party of $5,316, net proceeds from convertible notes payable of $1,369,000, offset by $614,053 payment of convertible notes payable.\nCash Requirements\nWe currently have no external sources of liquidity, such as arrangements with credit institutions or off-balance sheet arrangements that will have or are reasonably likely to have a current or future effect on our financial condition or immediate access to capital. We expect to require additional financing to fund our current operations for fiscal 2023. There is no assurance that we will be able to obtain additional financing on acceptable terms or at all.\nIf we are unable to raise the funds required to fund our operations, we will seek alternative financing through other means, such as borrowings from institutions or private individuals. There can be no assurance that we will be able to raise the capital we need for our operations from the sale of our securities. We have not located any sources for these funds and may not be able to do so in the future. We expect that we will seek additional financing in the future. However, we may not be able to obtain additional capital or generate sufficient revenues to fund our operations. If we are unsuccessful at raising sufficient funds, for whatever reason, to fund our operations, we may be forced to cease operations. If we fail to raise funds, we expect that we will be required to seek protection from creditors under applicable bankruptcy laws.\nGoing Concern\nThe accompanying consolidated financial statements are prepared on a going concern basis which contemplates the realization of assets and satisfaction of liabilities and commitments in the normal course of business As reflected in the accompanying consolidated financial statements, the Company had net income and net cash used in operations of $1,835,497 and $496,569, respectively, for the year ended September 30, 2022. Additionally, the Company had an accumulated deficit of $25,708,263 and working capital deficit of $15,587,845 as of September 30, 2022. These matters raise substantial doubt about the Companys ability to continue as a going concern for twelve months from the issuance date of this report. The ability to continue as a going concern is dependent upon the Company generating profitable operations in the future such as selling the completed Movie and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. The Companys ability to raise additional capital through the future issuances of common stock is unknown. The obtainment of additional financing, the successful development of the Companys contemplated plan of operations, and its transition, ultimately, to the attainment of profitable operations are necessary for the Company to continue operations.\nThe consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern. While the Company believes in the viability of its strategy to generate revenues, there can be no assurances to that effect.\nCritical Accounting Policies\nThe discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of our financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On an on-going basis, we evaluate our estimates based on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions. Management believes the following critical accounting policies affect the significant judgments and estimates used in the preparation of the financial statements.\nUse of Estimates\nIn preparing the consolidated financial statements, management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities as of the date of the consolidated balance sheet, and expenses for the period then ended. Actual results may differ significantly from those estimates. Significant estimates made by management include but are not limited to the fair value of common stock issued for services, the valuation of derivative liabilities, the valuation of stock-based compensation and the valuation of deferred tax assets.\nFair Value Measurements and Fair Value of Financial Instruments\nFASB ASC 820 - Fair Value Measurements and Disclosures, defines fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. FASB ASC 820 requires disclosures about the fair value of all financial instruments, whether or not recognized, for financial statement purposes. Disclosures about the fair value of financial instruments are based on pertinent information available to the Company on September 30, 2022. Accordingly, the estimates presented in these financial statements are not necessarily indicative of the amounts that could be realized on disposition of the financial instruments. FASB ASC 820 specifies a hierarchy of valuation techniques based on whether the inputs to those valuation techniques are observable or unobservable. Observable inputs reflect market data obtained from independent sources, while unobservable inputs reflect market assumptions. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurement) and the lowest priority to unobservable inputs (Level 3 measurement).\nThe three levels of the fair value hierarchy are as follows:\nLevel 1:\nInputs are unadjusted quoted prices in active markets for identical assets or liabilities available at the measurement date.\nLevel 2:\nInputs are unadjusted quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, inputs other than quoted prices that are observable, and inputs derived from or corroborated by observable market data.\nLevel 3:\nInputs are unobservable inputs which reflect the reporting entitys own assumptions on what assumptions the market participants would use in pricing the asset or liability based on the best available information.\nThe carrying amounts reported in the consolidated balance sheets for cash, due from and to related parties, prepaid expenses, accounts payable and accrued liabilities approximate their fair market value based on the short-term maturity of these instruments.\nIn August 2018, the FASB issued ASU 2018-13, Changes to Disclosure Requirements for Fair Value Measurements, which will improve the effectiveness of disclosure requirements for recurring and nonrecurring fair value measurements. The standard removes, modifies, and adds certain disclosure requirements, and is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2019. During the period ended March 31, 2020, the Company adopted ASU 2018-13. This guidance did not have a material impact on its consolidated financial statements.\nFilm Production Costs\nThe Company capitalizes costs which were used in the production of films according to ASC 926, Entertainment - Films. For films produced by the Company, capitalized costs include all direct production and financing costs, capitalized interest and production overhead. Production overhead includes the costs of individuals or departments with exclusive or significant responsibility for the production of films. Production overhead does not include general and administrative expenses and marketing, selling and distribution costs. Capitalization of interest costs should generally commence when a film is set for production and end when a film is substantially complete and ready for distribution. Filming the Movie was completed in July 2017 and the post-production phase was completed in December 2018. Generally, the interest eligible for capitalization includes stated interest, imputed interest, and interest related to debt instruments as well as amortization of discounts and other debt issue costs.\nPursuant to ASC 926-20-35, the Company will begin to amortize capitalized film cost when a film is released, and it begins to recognize revenue from the film. These costs for an individual film are amortized and participation costs (see below) are accrued to direct operating expenses in the proportion that current years revenues bear to managements estimates of the ultimate revenue at the beginning of the current year expected to be recognized from the exploitation, exhibition or sale of such film. Ultimate revenue includes estimates over a period not to exceed ten years following the date of initial release of the motion picture.\nParties involved in the production of a film may be compensated in part by contingent payments based on the financial results of a film pursuant to contractual formulas (participations) and by contingent amounts due under provisions of collective bargaining agreements (residuals). Such parties are collectively referred to as participants, and such costs are collectively referred to as participation costs. Participations may be given to creative talent, such as actors or writers, or to entities from whom distribution rights are licensed. Participation costs are typically recognized evenly as the ultimate revenues are earned.\nUnamortized film costs are tested for impairment when there is an indication that the fair value of the film may be less than unamortized costs. Consistent with the rules for recognizing impairment of long-lived assets in ASC 926, the standard sets forth examples of events or changes in circumstances that indicate that the entity must assess whether the fair value of the film (whether it has been completed or is still in production) is less than the carrying amount of its unamortized film costs.\n1.\nAn adverse change in the expected performance of the film prior to its release,\n2.\nActual costs substantially in excess of budgeted costs,\n3.\nSubstantial delays in completion or release schedules,\n4.\nChanges in release plans, such as a reduction in the initial release pattern,\n5.\nInsufficient funding or resources to complete the film and to market it effectively,\n6.\nActual performance subsequent to release fails to meet prerelease expectations. (ASC 926-20-35-12)\nDerivative Liabilities\nThe Company has certain financial instruments that are embedded derivatives associated with capital raises. The Company evaluates all its financial instruments to determine if those contracts or any potential embedded components of those contracts qualify as derivatives to be separately accounted for in accordance with ASC 815-10 - Derivative and Hedging - Contract in Entitys Own Equity. This accounting treatment requires that the carrying amount of any derivatives be recorded at fair value at issuance and marked-to-market at each balance sheet date. In the event that the fair value is recorded as a liability, as is the case with the Company, the change in the fair value during the period is recorded as either other income or expense. Upon conversion, exercise or repayment, the respective derivative liability is marked to fair value at the conversion, repayment, or exercise date and then the related fair value amount is reclassified to other income or expense as part of gain or loss on debt extinguishment.\nIn July 2017, FASB issued ASU No. 2017-11, Earnings Per Share (Topic 260); Distinguishing Liabilities from Equity (Topic 480); Derivatives and Hedging (Topic 815): (Part I) Accounting for Certain Financial Instruments with Down Round Features. These amendments simplify the accounting for certain financial instruments with down-round features. The amendments require companies to disregard the down-round feature when assessing whether the instrument is indexed to its own stock, for purposes of determining liability or equity classification. For public business entities, the amendments in Part I of the ASU are effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2018.\nStock-Based Compensation\nStock-based compensation is accounted for based on the requirements of ASC 718, Share-Based Payment, which requires recognition in the financial statements of the cost of employee and director services received in exchange for an award of equity instruments over the period the employee or director is required to perform the services in exchange for the award (presumptively, the vesting period). The Financial Accounting Standards Board (FASB) also requires measurement of the cost of employee and director services received in exchange for an award based on the grant-date fair value of the award. Pursuant to ASC Topic 505-50, for share-based payments non-employees, compensation expense is determined at the measurement date defined as the earlier of: a) the date at which a commitment for performance by the counterparty to earn the equity instruments is reached or b) the date at which the counterpartys performance is complete.\nThe expense is recognized over the vesting period of the award. Until the measurement date is reached, the total amount of compensation expense remains uncertain. The Company records compensation expense based on the fair value of the award at the reporting date. The awards to consultants and other third parties are then revalued, or the total compensation is recalculated, based on the then current fair value, at each subsequent reporting date.\nRevenue Recognition\nThe Company adopted and implemented on October 1, 2018, ASU Topic 606 - Revenue from Contracts with Customers (ASU 606). ASU 606 did not have a material impact on its consolidated financial statements.\nUpon implementation of ASU 606, the Company recognizes revenue in accordance with that core principle by applying the following steps:\nStep 1: Identify the contract(s) with a customer.\nStep 2: Identify the performance obligations in the contract.\nStep 3: Determine the transaction price.\nStep 4: Allocate the transaction price to the performance obligations in the contract.\nStep 5: Recognize revenue when (or as) the entity satisfies a performance obligation.\nRecent Accounting Pronouncements\nOther accounting standards that have been issued or proposed by FASB that do not require adoption until a future date are not expected to have a material impact on the consolidated financial statements upon adoption. The Company does not discuss recent pronouncements that are not anticipated to have an impact on or are unrelated to its financial condition, results of operations, cash flows or disclosures.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements. ITEM 7A: QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nSee Index to Financial Statements and Financial Statement Schedules of this annual report on Form 10-K. ITEM 9. CHANGES AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURES\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nWe maintain disclosure controls and procedures, as that term is defined in Rule 13a-15(e), promulgated by the SEC pursuant to the Securities Exchange Act of 1934, as amended (the Exchange Act). Disclosure controls and procedures include controls and procedures designed to ensure that information required to be disclosed in our companys reports filed under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer to allow timely decisions regarding required disclosure. Our management, with the participation of our principal executive officer and principal financial officer, evaluated our companys disclosure controls and procedures as of the end of the period covered by this annual report on Form 10-K. Based on this evaluation, our principal executive officer and principal financial officer concluded that as of September 30, 2022, our disclosure controls and procedures were not effective. The ineffectiveness of our disclosure controls and procedures was due to material weaknesses, which we identified, in our report on internal control over financial reporting.\nInternal Control Over Financial Reporting\nManagements Annual Report on Internal Control over Financial Reporting\nOur management, including our principal executive officer and principal financial officer, is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our management, with the participation of our principal executive officer and principal financial officer, evaluated the effectiveness of our internal control over financial reporting as of September 30, 2022. Our managements evaluation of our internal control over financial reporting was based on the framework in Internal Control-Integrated Framework (2013), issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our management concluded that as of September 30, 2022, our internal control over financial reporting was not effective.\nThe ineffectiveness of our internal control over financial reporting was due to the following material weaknesses which we identified in our internal control over financial reporting:\n(1)\nthe lack of multiples levels of management review on complex accounting and financial reporting issues, and business transactions,\n(2)\na lack of adequate segregation of duties and necessary corporate accounting resources in our financial reporting process and accounting function as a result of our limited financial resources to support hiring of personnel and implementation of accounting systems, and\nWe expect to be materially dependent upon third parties to provide us with accounting consulting services related to accounting services for the foreseeable future. We believe this will be sufficient to remediate the material weaknesses related to our accounting discussed above.\nA material weakness is a deficiency or a combination of control deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis.\nLimitations on Effectiveness of Controls\nOur principal executive officer and principal financial officer do not expect that our disclosure controls or our internal control over financial reporting will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of a simple error or mistake. Additional controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the controls. The design of any system of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions; over time, controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the companys registered public accounting firm pursuant to SEC rules that permit us to provide only managements report on internal control over financial reporting in this annual report on Form 10-K.\nChanges in Internal Control over Financial Reporting\nThere was no change in the Companys internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Securities Exchange Act of 1934) during the quarter ended September 30, 2022, that has materially affected, or is reasonably likely to materially affect, the Companys internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNot Applicable.\nPART III ITEM 10: DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nBoard of Directors and Executive Officers\nSet forth below are the names, ages and present principal occupations or employment, and material occupations, positions, offices or employments for the past five years of our current directors and executive officers. Unless otherwise indicated, the address of each person listed is c/o All for One Media Corp., 236 Sarles Street, Mt. Kisco, New York 10549.\nName\nAge\nPosition\nBrian J. Lukow\nChief Executive Officer, Chief Financial Officer, President and Director\nAimee Ventura OBrien\nSecretary and Director\nBiographical information concerning the executive officer and director listed above is set forth below. The information presented includes information each individual has given us about all positions they hold and their principal occupation and business experience for the past five years. In addition to the information presented below regarding each directors specific experience, qualifications, attributes and skills that led our board to conclude that he should serve as a director, we also believe that all of our directors have a reputation for integrity, honesty and adherence to high ethical standards. Each has demonstrated business acumen and an ability to exercise sound judgment, as well as a commitment of service to our company and our board of directors.\nBrian J. Lukow, 63, Chief Executive Officer, Chief Financial Officer, President and Director. Brian Lukow began his professional career on Wall Street. He was a Senior Vice President of Lehman Brothers from 1984 to 1991 and a managing director of Ladenburg Thalmann from 1992 to 1994. Mr. Lukow was most recently the highly talented co-creator and co-producer of Huckapoo. Prior to that, Mr. Lukow was the co-creator and executive producer of Dream Street, a successful boy band, and a best-selling pop music acts in recent years, whose debut album reached number one on the Billboard Magazine Independent charts. The original girl group concept is his creation and is built upon his experience and success with Dream Street and Huckapoo. In addition to his production credits, Mr. Lukow is also an accomplished songwriter. Among Mr. Lukows writing credits is the song Jennifer Goodbye which was recorded by Dream Street on its first album; that album went on to sell nearly one million units. Mr. Lukow is a co-writer on five of the original Huckapoo recordings as well. Additionally, Mr. Lukow is the associate producer of the motion picture The Biggest Fan, starring Chris Trousdale, Cindy Williams, and Pat Morita. From 1994 to 1996, Mr. Lukow was President of Brirock Entertainment, a firm specializing in artist management.\nAimee Ventura OBrien, 58, Secretary and Director. Aimee Ventura OBrien has a diverse background in business, including experiences on Wall Street and in the world of architecture. On Wall Street, Ms. OBrien traded complex equity derivatives for Credit Suisse and Fidelity Investment. She eventually decided to return to school to become an architect. Since graduating, Ms. OBrien has worked for two large building envelope firms in New York, learning about the complex design of building skins. Ms. OBrien holds a bachelors degree in mathematics and business from Skidmore College and a bachelors of architecture from NY Institute of Technology. Additionally, she has taken graduate courses at New York University. Ms. OBrien has won awards from the American Institute of Architects, Henry Adams Certificate, Robert Jensen Memorial Award, and the Maria Bentel Memorial Thesis Travel Grant.\nBoard of Directors\nDirectors are elected at our annual meeting of shareholders and serve for one year until the next annual meeting of shareholders or until their successors are elected and qualified.\nFamily Relationships\nThere are no familial relationships among any of our officers or directors. None of our directors or officers is a director in any other reporting companies. The Company is not aware of any proceedings to which any of the Company‚ officers or directors, or any associate of any such officer or director, is a party adverse to the Company or any of the Company‚ subsidiaries or has a material interest adverse to it or any of its subsidiaries.\nInvolvement in Certain Legal Proceedings\nDuring the past ten years, none of our present or former directors, executive officers or persons nominated to become directors or executive officers:\n·\nhave been convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offences);\n·\nhad any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n·\nhave been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n·\nhave been found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n·\nhave been the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or have been the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26)), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29)), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires our executive officers and directors, and persons who own more than 10% of our common stock, to file reports regarding ownership of, and transactions in, our securities with the Securities and Exchange Commission and to provide us with copies of those filings.\nCode of Ethics\nThe Company does not currently have a Code of Ethics.\nCorporate Governance\nCommittees of the Board of Directors\nWe presently do not have an audit committee, compensation committee, nominating committee, corporate governance committee or any other committee of our board of directors. Our entire Board of Directors meets to undertake the responsibilities that would otherwise be delegated to a committee of our board of directors.\nAudit Committee and Audit Committee Financial Expert\nWe do not have a standing audit committee at the present time. Our board of directors has determined that we do not have a board member that qualifies as an audit committee financial expert as defined in Item 407(d)(5)(ii) of Regulation S-K.\nWe believe that our board of directors is capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. The board of directors of our Company does not believe that it is necessary to have an audit committee because we believe that the functions of an audit committee can be adequately performed by the board of directors. In addition, we believe that retaining an independent director who would qualify as an audit committee financial expert would be overly costly and burdensome and is not warranted in our circumstances given our lack of material operations. ITEM 11: EXECUTIVE COMPENSATION\nSummary Compensation\nThe following table sets forth information regarding executive compensation earned in or with respect to our fiscal year 2022 and 2021 by:\n●\neach person who served as our CEO; and\n●\neach person who served as our CFO; and\n●\neach person who served as our President.\nCompensation Table for Executives\nName and Position\nYear\nSalary\nBonus\nStock\nAwards\nNon-Equity\nIncentive\nPlan\nCompensation\nNonqualified\nDeferred\nCompensation\nEarnings\nAll Other Compensation\nTotal\nBrian Lukow:\n$ 96,000\n$ -\n$ 62\n$ -\n$ -\n$ -\n$ 96,062\nChief Executive Officer, Chief Financial Officer,\n$ 96,000\n$ -\n$ 238\n$ -\n$ -\n$ -\n$ 96,238\nPresident and Director (1)\n(1)\nThe Company has an employment contract with Brian Lukow, its President, which provides for a monthly salary of $5,000 plus 20,000 shares of common stock. On February 16, 2018, the Company amended this Employment Agreement to increase Mr. Lukows base salary from $5,000 to $8,000 per month. The employment contract also has customary provisions for other benefits and includes non-competition and non-solicitation clauses. The employment agreement was entered into October 2015, constitutes an at will employment arrangement, and may be terminated by either Lukow or the Company upon two months written notice if without cause.\nCompensation of Management\nExcept as disclosed above, we have no contractual arrangements with any executives or directors.\nOutstanding Equity Awards at 2022 Fiscal Year-End for Named Executive Officers\nThe following table sets forth certain information concerning the outstanding equity awards as of September 30, 2021, for each named executive officer.\nOption Awards\nStock Awards\nEquity\nName\nNumber of Securities Underlying Unexercised Options (#) Exercisable\nNumber of Securities Underlying Unexercised Options (#) Unexercisable\nEquity Incentive Plan Awards: Number of Securities Underlying Unexercised Unearned Options\nOption Exercise Price\n($)\nOption Expiration Date\nNumber of Shares or Units of Stock that Have Not Vested\nMarket Value of Shares or Units of Stock that Have Not Vested\nEquity Incentive Plan Awards: Number of Unearned Shares, Units or Other Rights that Have Not Vested\nIncentive Plan Awards: Market or Payout Value of Unearned Shares, Units or Other Rights that Have Not Vested\nBrian Lukow\n-\n-\n-\n-\n-\n-\n-\n-\n-\nCompensation of Directors\nThe following table sets forth information concerning the annual and long-term compensation awarded to, earned by, or paid to the named Directors for all services rendered in all capacities to our company, or any of its subsidiaries, for the years ended September 30, 2022 and 2021:\nName\nYears\nFees earned or paid in cash ($)\nStock awards ($)\nOption awards ($)\nNon-Equity\nIncentive\nPlan\nCompensation ($)\nChange in pension value and nonqualified deferred compensation earnings ($)\nAll Other\nCompensation ($)\nTotal ($)\nBrian Lukow\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nAimee Ventura OBrien\n-\n-\n-\n-\n-\n-\n-\n-\n-\n- ITEM 12: SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSecurity Ownership of Certain Beneficial Owners\nThe following table lists, as of December 26, 2022, the number of shares of common stock of our Company that are beneficially owned by (i) each person or entity known to our Company to be the beneficial owner of more than 5% of the outstanding common stock; (ii) each officer and director of our Company; and (iii) all officers and directors as a group. Information relating to beneficial ownership of common stock by our principal shareholders and management is based upon information furnished by each person using beneficial ownership‚ concepts under the rules of the Securities and Exchange Commission. Under these rules, a person is deemed to be a beneficial owner of a security if that person has or shares voting power, which includes the power to vote or direct the voting of the security, or investment power, which includes the power to vote or direct the voting of the security. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Under the Securities and Exchange Commission rules, more than one person may be deemed to be a beneficial owner of the same securities, and a person may be deemed to be a beneficial owner of securities as to which he or she may not have any pecuniary beneficial interest. Except as noted below, each person has sole voting and investment power.\nThe percentages below are calculated based on 8,135,737,831 shares of our common stock issued and outstanding and 51 shares of our Series A Preferred Stock issued and outstanding as of December 26, 2022. We do not have any outstanding options, or other securities exercisable for or convertible into shares of our common stock. Unless otherwise indicated, the address of each person listed is c/o All for One Media Corp., 236 Sarles Street, Mt. Kisco, New York 10549.\nName and Address of Beneficial Owner\nTitle of Class\nAmount and Nature of Beneficial Ownership (1)\nPercent of\nClass (2)\nFive Percent Stockholders:\nBrian Lukow (3)\nCommon Stock\n6,032,386\n0.0741 %\nPreferred Stock\n100 %\nAimee Ventura OBrien (4)\nCommon Stock\n1,140,580\n0.0140 %\nDirectors and Officers as a Group\n6,116,966\n0.13453 %\nCrazy for the Boys, LLC (5)\nCommon Stock\n5,201,500\n0.0639 %\n1.\nThe number and percentage of shares beneficially owned is determined under the rules of the SEC and the information is not necessarily indicative of beneficial ownership for any other purpose. Under such rules, beneficial ownership includes any shares as to which the individual has sole or shared voting power or investment power and also any shares, which the individual has the right to acquire within 60 days through the exercise of any stock option or other right. The persons named in the table have sole voting and investment power with respect to all shares of common stock shown as beneficially owned by them, subject to community property laws where applicable and the information contained in the footnotes to this table.\n2.\nBased on 8,135,737,831 issued and outstanding shares of common stock as of December 26, 2022.\n3.\nBrian Lukow is a director and the Companys President. Mr. Lukows ownership includes his interests in Crazy for the Boys, LLC. Mr. Lukow owns 51 shares of preferred stock with voting rights equal to (x) 0.019607 multiplied by the total issued and outstanding shares of Common Stock eligible to vote at the time of the respective vote (the Numerator), divided by (y) 0.49, minus (x) the Numerator.\n4.\nAimee Ventura OBrien is a director and the Companys Secretary.\n5.\nBrian Lukow, the Companys President and director, is the managing member of Crazy for the Boys, LLC and owns approximately 17% of CFTB.\nSEC Rule 13d-3 generally provides that beneficial owner of securities include any person who, directly or indirectly, has or shares voting power and/or investment power with respect to such securities, and any person who has the right to acquire beneficial ownership of such security within 60 days. Any securities not outstanding which are subject to such options, warrants or conversion privileges exercisable within 60 days are treated as outstanding for the purpose of computing the percentage of outstanding securities owned by that person. Such securities are not treated as outstanding for the purpose of computing the percentage of the class owned by any other person. At the present time there are no outstanding options or warrants. ITEM 13: CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nRelated Party Transactions\nParties are considered to be related to the Company if the parties directly or indirectly, through one or more intermediaries, control, are controlled by, or are under common control with the Company. Related parties also include principal stockholders of the Company, its management, members of the immediate families of principal stockholders of the Company and its management and other parties with which the Company may deal where one-party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests. The Company discloses all related party transactions. All transactions shall be recorded at fair value of the goods or services exchanged. Property purchased from a related party is recorded at the cost to the related party and any payment to or on behalf of the related party in excess of the cost is reflected as compensation or distribution to related parties depending on the transaction.\nIn October 2015, the Company entered into an Employment Agreement (the Employment Agreement) with Mr. Brian Lukow, the CEO of the Company. As compensation for his services per the terms of the Employment Agreement, the Company shall pay $5,000 per month and 20,000 shares of the Companys common stock per month calculated at $0.25 per share. The Employment Agreement may be terminated by either party upon two months written notice. On February 16, 2018, the Company amended this Employment Agreement to increase Mr. Lukows base salary from $5,000 to $8,000 per month. As September 30, 2022 and 2021, accrued salaries to Mr. Lukow amounted to $81,556 and $81,556, respectively, and was included in accounts payable and accrued liabilities - related party in the accompanying consolidated balance sheets.\nIn December 2015, the Company through its wholly owned subsidiaries, Tween Entertainment, executed a month-to-month operating lease agreement with the CEO of the Company. The lease premise is located in Mt. Kisco, New York and the initial term was for a period of 12 months commencing in December 2015 and expiring in December 2016. The lease is currently on a month-to-month basis. The lease requires the Company to pay a monthly base rent of $1,000. The Company has recorded rent expense of $12,000 for both periods for the year ended September 30, 2022 and 2021 which was included as rent expense under general and administrative expense in the accompanying consolidated statements of operations. As of September 30, 2022 and 2021, the Company had accrued rent balance of $28,000 and $27,500, respectively, reflected under ‘accounts payable and accrued liabilities - related party in the accompanying consolidated balance sheets.\nIn 2020, the CEO advanced to the Company $1,201 and an additional $5,316 in 2021, for a total of $6,517 for working capital purposes which is reflected as due to related parties. The advanced is non-interest bearing and are due on demand. As of September 30, 2022 and 2021, this advance had a balance of $6,517.\nThe CEO of the Company, who is the creator, writer and also acted as a producer of the Crazy for The Boys movie is entitled to receive a writers fee of $25,000 and producers fee of $100,000 to be paid from gross revenues derived from the Crazy for The Boys movie or the sale of ancillary products. As of September 30, 2022 and 2021, the Company has an accrued balance of $125,000 in accrued expenses - related party for services rendered by the CEO of the Company.\nDirector Independence\nBecause the Companys Common Stock is not currently listed on a national securities exchange, the Company has used the definition of independence of the NASDAQ Stock Market to make this determination. NASDAQ Listing Rule 5605(a)(2) provides that an independent director is a person other than an officer or employee of the company or any other individual having a relationship which, in the opinion of the companys board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. The NASDAQ listing rules provide that a director cannot be considered independent if:\n●\nthe director is, or at any time during the past three years was, an employee of the company;\n●\nthe director or a family member of the director accepted any compensation from the company in excess of $120,000 during any period of 12 consecutive months within the three years preceding the independence determination (subject to certain exclusions, including, among other things, compensation for board or board committee service);\n●\na family member of the director is, or at any time during the past three years was, an executive officer of the company;\n●\nthe director or a family member of the director is a partner in, controlling stockholder of, or an executive officer of an entity to which the company made, or from which the company received, payments in the current or any of the past three fiscal years that exceed 5% of the recipients gross revenue for that year or $200,000, whichever is greater (subject to certain exclusions);\n●\nthe director or a family member of the director is employed as an executive officer of an entity where, at any time during the past three years, any of the executive officers of the Company served on the compensation committee of such other entity; or\n●\nthe director or a family member of the director is a current partner of the Companys outside auditor, or at any time during the past three years was a partner or employee of the Companys outside auditor, and who worked on the Companys audit.\nBased on this review, we have no independent directors pursuant to the requirements of the NASDAQ Stock Market. ITEM 14: PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table sets forth the fees billed to our company for the years ended September 30, 2022 and 2021 for professional services rendered by our independent registered public accounting firm, Salberg & Company, P.A.:\nYears Ended\nSeptember 30,\nFee Category\nAudit Fees\n$ 62,700\n$ 56,300\nAudit-related Fees\n-\n-\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal Fees\n$ 62,700\n$ 56,300\nAudit Fees\nAudit fees were for professional services rendered for the audits of our annual financial statements and for review of our quarterly financial statements during the fiscal years ended September 30, 2022 and 2021.\nAudit-Related Fees\nThis category consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees.\nTax Fees\nAs our independent registered public accountants did not provide any services to us for tax compliance, tax advice and tax planning during the fiscal years ended September 30, 2022 and 2021, no tax fees were billed or paid during those fiscal years.\nAll Other Fees\nOur independent registered public accountants did not provide any products and services not disclosed in the table above during the 2022 and 2021 fiscal years. As a result, there were no other fees billed or paid during those fiscal years.\nPre-Approval Policies and Procedures\nOur entire board of directors, which acts as our audit committee, pre-approves all services provided by our independent auditors. All of the above services and fees were reviewed and approved by our board of directors before the respective services were rendered.\nOur board of directors has considered the nature and amount of fees billed by our independent registered public accounting firm and believe that the provision of services for activities unrelated to the audit is compatible with maintaining their respective independence.\nPART IV ITEM 15. EXHIBIT AND FINANCIAL STATEMENT SCHEDULES\n(a)\n1.\nFinancial Statements\nThe financial statements and Report of Independent Registered Public Accounting Firm are listed in the Index to Financial Statements and Schedules on page and included on page from onwards.\n2.\nFinancial Statement Schedules\nAll schedules for which provision is made in the applicable accounting regulations of the Securities and Exchange Commission (the Commission) are either not required under the related instructions, are not applicable (and therefore have been omitted), or the required disclosures are contained in the financial statements included herein.\n3.\nExhibits (including those incorporated by reference).\nExhibit\nNumber\nDescription\n3.1\nCertificate of Incorporation (1)\n3.2\nBy-Laws (1)\n3.3\nArticles of Amendment (1)\n10.1\nAsset Exchange Agreement with Crazy For the Boys, LLC dated October 26, 2015 (1)\n10.2\nEmployment Agreement with Brian Lukow (1)\n10.3\nBoard of Directors Agreement with Brian Lukow (1)\n10.4\nBoard of Directors Agreement with Brian Gold (1)\n10.5\nPromissory Note with Auctus Fund I dated July 18, 2017 (2)\n10.6\nPromissory Note with GS Capital Partners, LLC dated October 31, 2018 (3)\n10.7\nPromissory Note with GS Capital Partners, LLC dated November 6, 2018 (3)\n10.8\nPromissory Note with Coolidge Capital, LLC dated November 20, 2018 (3)\n10.9\nPromissory Note with GS Capital Partners, LLC dated November 23, 2018 (3)\n10.10\nPromissory Note with Auctus Fund, LLC dated November 27, 2018 (3)\n10.11\nPromissory Note with GS Capital Partners, LLC dated December 13, 2018 (3)\n10.12\nPromissory Note with GS Capital Partners, LLC dated December 28, 2018 (3)\n10.13\nPromissory Note with GS Capital Partners LLC dated February 8, 2019 (4)\n10.14\nPromissory Note with GS Capital Partners LLC dated March 15, 2019 (4)\n10.15\nPromissory Note with GS Capital Partners LLC dated April 8, 2019 (4)\n10.16\nPromissory Note with GS Capital Partners, LLC dated May 22, 2019 (5)\n10.17\nPromissory Note with Odyssey Capital Funding LLC dated July 12, 2019 (5)\n10.18\nPromissory Note with GS Capital Partners, LLC dated July 24, 2019 (5)\n10.19\nPromissory Note with GS Capital Partner, LLC dated September 4, 2019 (6)\n10.20\nPromissory Note with Odyssey Capital Funding LLC dated September 4, 2019 (6)\n10.21\nStock Purchase and Sale Agreement with Carmel Valley Productions Inc. (7)\n10.22\nPromissory Note with GS Capital Partners, LLC dated January 7, 2021 (7)\n10.23\nPromissory Note with GS Capital Partners, LLC dated February 3, 2021 (7)\n10.24\nPromissory Note with GS Capital Partners, LLC dated February 24, 2021 (7)\n10.25\nPromissory Note with GS Capital Partners, LLC dated April 1, 2021 (7)\n31.1*\nCertification of Principal Executive Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of Principal Financial Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1**\nCertification of the Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS*\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB*\nInline XBRL Taxonomy Extension Labels Linkbase Document.\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101).\n__________\n(1)\nAs filed with our Form 10 on January 3, 2017, as amended, and incorporated herein by reference.\n(2)\nAs filed with our form 10-K filed on January 16, 2018, and incorporated herein by reference.\n(3)\nAs filed with our Form 10-K filed on January 15, 2019.\n(4)\nAs filed with our Form 10-Q filed on May 17, 2019.\n(5)\nAs filed with our Form 10-Q filed on August 14, 2019.\n(6)\n(7)\nAs filed with our Form 10-K filed on January 14, 2020.\nAs field with our Form 10-Q filed on June 8, 2021.\n*\nFiled herewith\n**\nFurnished herewith.\nITEM 16. FORM 10-K SUMMARY\nNot Applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nALL FOR ONE MEDIA CORP.\nDate: December 29, 2022\nBy:\n/s/ Brian Lukow\nName:\nBrian Lukow\nTitle:\nChief Executive Officer\n(Principal Executive Officer)\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Brian Lukow\nChief Executive Officer, Chief Financial Officer, President and Director\nDecember 29, 2022\nBrian Lukow\n(Principal Executive, Financial and Accounting Officer)\n/s/ Aimee Ventura OBrien\nDirector\nDecember 29, 2022\nAimee Ventura OBrien\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nCONTENTS\nReport of Independent Registered Public Accounting Firm (PCAOB Firm No. 106)\nConsolidated Financial Statements:\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Operations for the Years Ended September 30, 2022 and 2021\nConsolidated Statements of Changes in Stockholders Deficit for the Years Ended September 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the Years Ended September 30, 2022 and 2021\nNotes to Consolidated Financial Statements\nto\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of:\nAll For One Media Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of All For One Media Corp. and Subsidiaries (the Company) as of September 30, 2022 and 2021, the related consolidated statements of operations, changes in stockholders deficit, and cash flows, for each of the two years in the period ended September 30, 2022 and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of September 30, 2022 and 2021, and the consolidated results of its operations and its cash flows for each of the two years in the period ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the consolidated financial statements, the Company has a net income and cash used in operations of $1,835,497 and $496,569, respectively, for the year ended September 30, 2022. The net income was primarily the result of a gain from the extinguishment of debt and gain on debt modification. Additionally, the Company had an accumulated deficit, stockholders deficit and working capital deficit of $25,708,263, $15,725,345 and $15,587,845 as of September 30, 2022. These matters raise substantial doubt about the Companys ability to continue as a going concern. Managements Plan in regards to these matters is also described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nDerivative Liabilities\nAs described in Footnote 2 Derivative Liabilities and Fair Value Measurements and Footnote 5, Convertible Notes Payable to the consolidated financial statements, the Company recorded derivative activity during fiscal 2022 that resulted primarily in a net aggregate derivative expense of $719,842, gains on extinguishment of debt from settlement of derivative liabilities of $4,434,336 and derivative liabilities of $8,149,517 at September 30, 2022.\nWe identified the evaluation of instruments and contracts to determine whether there are derivatives to be recorded, the analysis of the accounting treatment and presentation for derivative transactions and the valuation of derivatives as critical audit matters. Auditing managements analysis of the above critical audit matters was complex and involved a high degree of subjectivity.\nThe primary procedures we performed to address these critical audit matters included (a) Reviewed and tested managements conclusions as to whether certain instruments or contracts qualified for derivative treatment by comparing managements analysis and conclusions to authoritative and interpretive literature, (b) Compared the accounting treatment and presentation to that described by the authoritative and interpretive literature, (c) Tested managements process for valuing derivatives by comparing it to generally accepted methodologies for valuing derivatives, (d) Tested managements valuation of the derivatives by testing assumptions and data used in the valuation model including the term, volatility and interest rate, and (e) Recomputed the derivative valuations. We agreed with managements conclusions and determined that the derivatives treatments were fairly stated.\n/s/ Salberg & Company, P.A.\nSALBERG & COMPANY, P.A.\nWe have served as the Companys auditor since 2019.\nBoca Raton, Florida\nDecember 29, 2022\n2295 NW Corporate Blvd., Suite 240 Boca Raton, FL 33431-7328\nPhone: (561) 995-8270 Toll Free: (866) CPA-8500 Fax: (561) 995-1920\nwww.salbergco.com info@salbergco.com\nMember National Association of Certified Valuation Analysts Registered with the PCAOB\nMember CPAConnect with Affiliated Offices Worldwide Member AICPA Center for Audit Quality\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nSeptember 30,\nSeptember 30,\nASSETS\nCurrent assets:\nCash\n$ 98,612\n$ 101,431\nPrepaid expenses\n6,863\n21,191\nTotal current assets\n105,475\n122,622\nTOTAL ASSETS\n$ 105,475\n$ 122,622\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent liabilities:\nAccounts payable and accrued liabilities\n$ 37,982\n$ 61,246\nAccounts payable and accrued liabilities - related party\n234,556\n234,056\nAccrued interest\n1,695,398\n1,652,165\nConvertible notes payable, net of unamortized debt discounts\n2,628,177\n3,958,802\nNotes payable\n2,257,673\n430,000\nNotes payable - related party\n200,000\n200,000\nLoans payable\n483,500\n483,500\nDue to related party\n6,517\n6,517\nDerivative liabilities\n8,149,517\n11,587,761\nTotal current liabilities\n15,693,320\n18,614,047\nLong-term liabilities:\nConvertible note payable\n137,500\n-\nTotal liabilities\n15,830,820\n18,614,047\nCommitments and contingencies (see Note 9)\nStockholders' deficit:\nPreferred stock, $0.001 par value; 5,000,000 shares authorized\nSeries A Preferred stock ($0.001 Par Value; 51 shares designated;\n51 shares issued and outstanding at September 30, 2022 and 2021\n-\n-\nCommon stock, $0.001, 19,000,000,000 shares authorized:\n8,035,665,831 and 4,189,226,425 shares issued and outstanding\nas of September 30, 2022 and 2021, respectively\n8,035,671\n4,189,229\nAdditional paid-in capital\n2,347,420\n5,263,279\nAccumulated deficit\n(25,708,263 )\n(27,568,913 )\nTotal All For One Media Corp. Stockholders' deficit\n(15,325,172 )\n(18,116,405 )\nNon-controlling interest in subsidiaries\n(400,173 )\n(375,020 )\nTotal Stockholders' deficit\n(15,725,345 )\n(18,491,425 )\nTOTAL LIABILITIES AND STOCKHOLDERS' DEFICIT\n$ 105,475\n$ 122,622\nSee accompanying notes to consolidated financial statements.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended\nSeptember 30,\nRevenues\n$ 8,993\n$ 9,493\nOperating expenses:\nCompensation expense\n96,062\n96,238\nProfessional and consulting expense\n196,268\n110,992\nLicense fees\n-\n160,003\nGeneral and administrative expense\n241,535\n251,712\nTotal operating expense\n533,865\n618,945\nLoss from operations\n(524,872 )\n(609,452 )\nOther income (expense):\nInitial derivative expense\n(135,670 )\n(1,907,509 )\nLoss on change in fair value of derivative liabilities\n(584,172 )\n(2,743,541 )\nGain from extinguishment of debt, net\n3,935,629\n3,838,696\nGain on debt modification\n764,999\n-\nLoss on equity method investee\n(7,500 )\n-\nInterest expense\n(1,612,917 )\n(1,693,664 )\nTotal other income (expense), net\n2,360,369\n(2,506,018 )\nNet income (loss)\n1,835,497\n(3,115,470 )\nLoss attributable to non-controlling interest\n25,153\n5,294\nNet income (loss) attributable to All For One Media Corp.\n$ 1,860,650\n$ (3,110,176 )\nNET INCOME (LOSS) PER COMMON SHARE OUTSTANDING\nBasic\n$ 0.00\n$ (0.00 )\nDiluted\n$ (0.00 )\n$ (0.00 )\nWEIGHTED AVERAGE COMMON SHARES OUTSTANDING\nBasic\n5,962,775,675\n3,652,537,713\nDiluted\n57,924,366,887\n3,652,537,713\nSee accompanying notes to consolidated financial statements.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENT OF CHANGES IN STOCKHOLDERS' DEFICIT\nFOR THE YEARS ENDED SEPTEMBER 30, 2022 AND 2021\nSeries A\nCommon Stock\n$0.001\nPar Value\n$0.001\nPar Value\nAdditional\nPaid-in\nAccumulated\nNon-controlling\nTotal\nStockholders'\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nInterest\nDeficit\nBalance, September 30, 2020\n$ -\n2,292,574,092\n$ 2,292,576\n$ 4,942,567\n$ (24,458,737 )\n$ (369,726 )\n$ (17,593,320 )\nIssuance of common stock for services\n-\n-\n288,000\n(3 )\n-\n-\nIssuance of common stock in connection with conversion of principal amount and accrued interest on notes payable\n-\n-\n1,896,364,333\n1,896,365\n320,715\n-\n-\n2,217,080\nNet loss for the period\n-\n-\n-\n-\n-\n(3,110,176 )\n(5,294 )\n(3,115,470 )\nBalance, September 30, 2021\n-\n4,189,226,425\n4,189,229\n5,263,279\n(27,568,913 )\n(375,020 )\n(18,491,425 )\nIssuance of common stock for services\n-\n-\n288,000\n(226 )\n-\n-\nIssuance of common stock to consultants\n-\n-\n233,333,336\n233,334\n(196,666 )\n-\n-\n36,668\nIssuance of common stock in connection with conversion of principal amount and accrued interest on notes payable\n-\n-\n3,612,818,070\n3,612,814\n(2,718,961 )\n-\n-\n893,853\nNet income for the period\n-\n-\n-\n-\n-\n1,860,650\n(25,153 )\n1,835,497\nBalance, September 30, 2022\n$ -\n8,035,665,831\n$ 8,035,665\n$ 2,347,426\n$ (25,708,263 )\n$ (400,173 )\n$ (15,725,345 )\nSee accompanying notes to consolidated financial statements.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended\nSeptember 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income (loss)\n$ 1,835,497\n$ (3,115,470 )\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nAmortization of debt discounts\n914,603\n721,789\nStock-based compensation\nStock-based professional fees from common stock issued to consultants\n36,668\n-\nGain on extinguishment of debt, net\n(3,935,629 )\n(3,838,696 )\nGain on debt modification\n(764,999 )\n-\nInitial derivative expense\n135,670\n1,907,509\nLoss from change in fair value of derivative liabilities\n584,172\n2,743,541\nNon-cash conversion fee\n7,010\n2,000\nNon-cash default penalty interest\n-\nLoss of equity method investee\n7,500\n-\nChanges in assets and liabilities:\nPrepaid expenses and other current assets\n14,328\n(13,191 )\nAccounts payable and accrued liabilities\n(23,264 )\n(25,988 )\nAccounts payable and accrued liabilities - related party\n46,000\nAccrued interest\n691,313\n910,486\nNET CASH USED IN OPERATING ACTIVITIES\n(496,569 )\n(660,935 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nCash contributed to an equity method investee\n(7,500 )\n-\nNET CASH USED IN INVESTING ACTIVITIES\n(7,500 )\n-\nCASH FLOWS FROM FINANCING ACTIVITIES:\nAdvances from a related party\n-\n5,316\nProceeds from notes payable\n225,000\n-\nProceeds from loan payable\n50,000\n-\nProceeds from convertible notes payable, net of issuance cost\n276,250\n1,369,000\nRepayments of convertible notes\n-\n(614,053 )\nRepayments of loan payable\n(50,000 )\n-\nNET CASH PROVIDED BY FINANCING ACTIVITIES\n501,250\n760,263\nNET CHANGE IN CASH\n(2,819 )\n99,328\nCASH - beginning of year\n101,431\n2,103\nCASH - end of year\n$ 98,612\n$ 101,431\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid for:\nInterest\n$ -\n$ 48,452\nIncome taxes\n$ -\n$ -\nSUPPLEMENTAL DISCLOSURE OF NON-CASH INVESTING AND FINANCING ACTIVITIES:\nInitial valuation of derivative liabilities included in debt discount\n$ 276,250\n$ 1,369,000\nIssuance of common stock in connection with conversion of note payable and accrued interest\n$ 388,136\n$ 401,208\nReclassification of convertible notes payable to notes payable\n$ 1,601,000\n$ -\nFair value of common stock issued for prepaid services initially recorded as deferred compensation\n$ 20,000\n$ -\nSee accompanying notes to consolidated financial statements.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nNOTE 1 - ORGANIZATION AND DESCRIPTION OF BUSINESS\nAll for One Media Corp. (the Company) was incorporated in the State of Utah on March 2, 2004. The Company is a media and entertainment company focused on creating, launching and marketing original pop music groups commonly referred to as boy bands and girl groups. On October 26, 2015, the Company entered into an Asset Exchange Agreement (the Asset Exchange) with Crazy for the Boys, LLC (CFTB), a privately held company, and certain members owning membership interest in CFTB whereby the Company acquired certain assets from CFTB in exchange for 5,201,500 shares of the Companys common stock. The assets that were acquired included a movie screenplay, master song recordings, trademarks, and web domain names (the CFTB Assets).\nOn December 7, 2016, the Company organized a subsidiary in the state of Nevada, Crazy for the Boys Movie, LLC (CFTB Movie) which was created for the sole purpose of financing, producing and commercially exploiting (via all distribution sources and other means of revenue generation) one feature-length motion picture as a coming of age, musical dramedy, entitled Drama Drama (formerly with a working title of Crazy For The Boys (the Movie) and all of its allied, ancillary, subsidiaries and merchandising rights. The Company is the Managing Member of CFTB Movie and will have the sole and exclusive right to operate CFTB Movie. As of September 30, 2022 and 2021, the Company owns approximately 70% of CFTB Movie, the Companys majority owned subsidiary.\nIn May 2017, the Company entered into an Assignment and Transfer Agreement with Crazy for the Boys GA LLC (CFTB GA), a company organized in the state of Georgia, whereby CFTB GA assigned and transferred all ownership, asset rights and other interest in CFTB GA to CFTB Movie. CFTB GA was created for the sole purpose of producing the Movie in the State of Georgia, in the city of Savannah, which offers production incentives up to 30% of Georgia production expenditures in transferable tax credits. The Georgia tax incentive program is available for qualifying projects, including feature films, television series, commercials, music videos, animation and game development. Consequently, CFTB GA became a wholly owned subsidiary of CFTB Movie and as of September 30, 2022 and 2021, the consolidated financial statements of the Company include the accounts of CFTB GA. Filming for the Movie was completed in July 2017 and the post-production phase was completed in December 2018. The Company started to screen the movie in January 2019 for potential buyers. The Company had received several offers for the distribution of the film and the Company continues to review any offers.\nOn February 2, 2022, the Company and RA Production, Inc (RA Production) (collectively as Parties) entered into an Operating Agreement with Boss Music and Entertainment, LLC (BME), a Delaware limited liability company (see Note 4 and Note 9). Pursuant to the Operating Agreement, the Company has 50% interest in BME and was to contribute a total of $1,000,000 towards the BME capital account payable as follows: (i) $200,000 upon signing hereof of the Operating Agreement and (ii) $800,000 payable on the full execution of recording agreements with five artists to form a recording group, (i.e. boy band). As of September 30, 2022, of the total $200,000 only $7,500 of capital contribution had been paid which was recorded as a loss on equity method investment in the accompanying consolidated statement of operations since the project was abandoned (see Note 4).\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation and Principles of Consolidation\nThe Companys consolidated financial statements include the financial statements of its majority-owned and wholly-owned subsidiaries. In the preparation of consolidated financial statements of the Company, intercompany transactions and balances have been eliminated and net earnings are reduced by the portion of the net loss of subsidiaries applicable to non-controlling interests.\nCash\nThe Company considers all highly liquid investments with a maturity of three months or less when acquired to be cash equivalents. The Company places its cash with high credit quality financial institutions. The Companys accounts at these institutions are insured by the Federal Deposit Insurance Corporation (FDIC) up to $250,000. As of September 30, 2022 and 2021, the Company had not reached bank balances exceeding the FDIC insurance limit on interest bearing accounts. To reduce its risk associated with the failure of such financial institutions, the Company evaluates at least annually the rating of the financial institutions in which it holds deposits.\nPrepaid Expenses and Other Current Assets\nPrepaid expenses and other current assets of $6,863 and $21,191 as of September 30, 2022 and 2021, respectively, consist primarily of costs paid for future services which will occur within a year. Prepaid expenses typically include prepayments in cash for consulting which are being amortized over the terms of their respective agreements.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nUse of Estimates\nIn preparing the consolidated financial statements, management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities as of the date of the consolidated balance sheet, and expenses for the period then ended. Actual results may differ significantly from those estimates. Significant estimates made by management include but are not limited to the recoverability of the equity method investment, fair value of common stock issued, the valuation of derivative liabilities, gains from extinguishment of debt, the valuation of stock-based compensation, and the valuation of deferred tax assets.\nFilm Production Costs\nThe Company capitalizes costs which were used in the production of films according to ASC 926, Entertainment - Films. For films produced by the Company, capitalized costs include all direct production and financing costs, capitalized interest and production overhead. Production overhead includes the costs of individuals or departments with exclusive or significant responsibility for the production of films. Production overhead does not include general and administrative expenses and marketing, selling and distribution costs. Capitalization of interest costs should generally commence when a film is set for production and end when a film is substantially complete and ready for distribution. Filming the Movie was completed in July 2017 and the post-production phase was completed in December 2018. Generally, the interest eligible for capitalization includes stated interest, imputed interest, and interest related to debt instruments as well as amortization of discounts and other debt issue costs.\nPursuant to ASC 926-20-35, the Company will begin to amortize capitalized film cost when a film is released, and it begins to recognize revenue from the film. These costs for an individual film are amortized and participation costs (see below) are accrued to direct operating expenses in the proportion that current years revenues bear to managements estimates of the ultimate revenue at the beginning of the current year expected to be recognized from the exploitation, exhibition or sale of such film. Ultimate revenue includes estimates over a period not to exceed ten years following the date of initial release of the motion picture.\nParties involved in the production of a film may be compensated in part by contingent payments based on the financial results of a film pursuant to contractual formulas (participations) and by contingent amounts due under provisions of collective bargaining agreements (residuals). Such parties are collectively referred to as participants, and such costs are collectively referred to as participation costs. Participations may be given to creative talent, such as actors or writers, or to entities from whom distribution rights are licensed. Participation costs are typically recognized evenly as the ultimate revenues are earned.\nUnamortized film costs are tested for impairment when there is an indication that the fair value of the film may be less than unamortized costs. Consistent with the rules for recognizing impairment of long-lived assets in ASC 926, the standard sets forth examples of events or changes in circumstances that indicate that the entity must assess whether the fair value of the film (whether it has been completed or is still in production) is less than the carrying amount of its unamortized film costs.\n1.\nAn adverse change in the expected performance of the film prior to its release,\n2.\nActual costs substantially in excess of budgeted costs,\n3.\nSubstantial delays in completion or release schedules,\n4.\nChanges in release plans, such as a reduction in the initial release pattern,\n5.\nInsufficient funding or resources to complete the film and to market it effectively,\n6.\nActual performance subsequent to release fails to meet prerelease expectations. (ASC 926-20-35-12)\nFair Value of Financial Instruments\nFASB ASC 820 - Fair Value Measurements and Disclosures, defines fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. FASB ASC 820 requires disclosures about the fair value of all financial instruments, whether or not recognized, for financial statement purposes. Disclosures about the fair value of financial instruments are based on pertinent information available to the Company on September 30, 2022. Accordingly, the estimates presented in these financial statements are not necessarily indicative of the amounts that could be realized on disposition of the financial instruments. FASB ASC 820 specifies a hierarchy of valuation techniques based on whether the inputs to those valuation techniques are observable or unobservable. Observable inputs reflect market data obtained from independent sources, while unobservable inputs reflect market assumptions. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurement) and the lowest priority to unobservable inputs (Level 3 measurement).\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nThe three levels of the fair value hierarchy are as follows:\nLevel 1:\nInputs are unadjusted quoted prices in active markets for identical assets or liabilities available at the measurement date.\nLevel 2:\nInputs are unadjusted quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, inputs other than quoted prices that are observable, and inputs derived from or corroborated by observable market data.\nLevel 3:\nInputs are unobservable inputs which reflect the reporting entitys own assumptions on what assumptions the market participants would use in pricing the asset or liability based on the best available information.\nThe carrying amounts reported in the consolidated balance sheets for cash, due from and to related parties, prepaid expenses, accounts payable and accrued liabilities approximate their fair market value based on the short-term maturity of these instruments.\nAssets or liabilities measured at fair value or a recurring basis included embedded conversion options in convertible debt (see Note 5) and were as follows on September 30, 2022 and 2021:\nSeptember 30, 2022\nSeptember 30, 2021\nDescription\nLevel 1\nLevel 2\nLevel 3\nLevel 1\nLevel 2\nLevel 3\nDerivative liabilities\n$ -\n$ -\n$ 8,149,517\n$ -\n$ -\n$ 11,587,761\nA roll forward of the level 3 valuation financial instruments is as follows:\nFor the Year Ended\nSeptember 30,\nBalance at beginning of year\n$ 11,587,761\n$ 10,997,765\nInitial valuation of derivative liabilities included in debt discount\n276,250\n1,369,000\nInitial valuation of derivative liabilities included in derivative expense\n135,670\n1,907,509\nReclassification of derivative liabilities to gain on debt extinguishment\n(4,434,336 )\n(5,430,054 )\nChange in fair value included in derivative expense\n584,172\n2,743,541\nBalance at end of year\n$ 8,149,517\n$ 11,587,761\nASC 825-10 Financial Instruments allows entities to voluntarily choose to measure certain financial assets and liabilities at fair value (fair value option). The fair value option may be elected on an instrument-by-instrument basis and is irrevocable unless a new election date occurs. If the fair value option is elected for an instrument, unrealized gains and losses for that instrument should be reported in earnings at each subsequent reporting date. The Company did not elect to apply the fair value option to any outstanding equity instruments.\nDerivative Liabilities\nThe Company has certain financial instruments that are embedded derivatives associated with capital raises. The Company evaluates all its financial instruments to determine if those contracts or any potential embedded components of those contracts qualify as derivatives to be separately accounted for in accordance with ASC 815-10 - Derivative and Hedging - Contract in Entitys Own Equity. This accounting treatment requires that the carrying amount of any derivatives be recorded at fair value at issuance and marked-to-market at each balance sheet date. In the event that the fair value is recorded as a liability, as is the case with the Company, the change in the fair value during the period is recorded as either other income or expense. Upon conversion, exercise or repayment, the respective derivative liability is marked to fair value at the conversion, repayment, or exercise date and then the related fair value amount is reclassified to other income or expense as part of gain or loss on debt extinguishment.\nIn July 2017, FASB issued ASU No. 2017-11, Earnings Per Share (Topic 260); Distinguishing Liabilities from Equity (Topic 480); Derivatives and Hedging (Topic 815): (Part I) Accounting for Certain Financial Instruments with Down Round Features. These amendments simplify the accounting for certain financial instruments with down-round features. The amendments require companies to disregard the down-round feature when assessing whether the instrument is indexed to its own stock, for purposes of determining liability or equity classification. For public business entities, the amendments in Part I of the ASU are effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2018.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nBasic and Diluted Net Loss Per Share\nPursuant to ASC 260-10-45, basic loss per common share is computed by dividing net loss by the weighted average number of shares of common stock outstanding for the periods presented. Diluted loss per share is computed by dividing net loss by the weighted average number of shares of common stock, common stock equivalents and potentially dilutive securities outstanding during the period. Potentially dilutive common shares consist of common stock issuable for stock options and stock warrants (using the treasury stock method), convertible notes and common stock issuable. These common stock equivalents may be dilutive in the future.\nThe potentially dilutive common stock equivalents as of September 30, 2022 and 2021 were included in the dilutive income (loss) per share calculation. The following were the computation of diluted shares outstanding and in periods where the Company has a net income, all dilutive securities were included.\nSeptember 30,\nCommon Stock Equivalents:\nStock Warrants\n1,600,000\n1,600,000\nConvertible Notes\n51,961,591,212\n22,115,183,123\nTotal\n51,963,191,212\n22,116,783,123\nThe following table presents a reconciliation of basic and diluted net income (loss) per common share:\nYear Ended\nSeptember 30,\nIncome (loss) per common share - basic:\nNet income (loss) attributable to All For One Media Corp.\n$ 1,860,650\n$ (3,110,176 )\nWeighted average common shares outstanding - basic\n5,962,775,675\n3,652,537,713\nNet income (loss) per common share - basic:\n$ 0.00\n$ (0.00 )\nIncome (Loss) per common share - diluted:\nNet income (loss) attributable to All For One Media Corp.\n$ 1,860,650\n$ (3,110,176 )\nAdd: interest on debt\n1,612,917\n-\nAdd: initial derivative expense\n135,670\n-\nAdd: gain on extinguishment of debt, net\n584,172\n-\nLess: gain from change in fair value of derivative liabilities\n(3,935,629 )\n-\nLess: gain debt modification\n(764,999 )\n-\nNumerator for loss from operations per common share - diluted\n$ (507,219 )\n$ (3,110,176 )\nWeighted average common shares outstanding - basic\n5,962,775,675\n3,652,537,713\nEffect of dilutive securities:\nConvertible notes payable\n51,961,591,212\n-\nWeighted average common shares outstanding - diluted\n57,924,366,887\n3,652,537,713\nNet loss per common share - diluted\n$ (0.00 )\n$ (0.00 )\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nIncome Taxes\nThe Company accounts for income taxes pursuant to the provision of ASC 740-10, Accounting for Income Taxes (ASC 740-10), which requires, among other things, an asset and liability approach to calculating deferred income taxes. The asset and liability approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax bases of assets and liabilities. A valuation allowance is provided to offset any net deferred tax assets for which management believes it is more likely than not that the net deferred asset will not be realized.\nTax positions that meet the more-likely-than-not recognition threshold are measured at the largest amount of tax benefit that is more than 50 percent likely of being realized upon settlement with the applicable taxing authority. The portion of the benefit associated with tax positions taken that exceed the amount measured as described above should be reflected as a liability for uncertain tax benefits in the accompanying balance sheet along with any associated interest and penalties that would be payable to the taxing authorities upon examination. The Company believes its tax positions are all more likely than not to be upheld upon examination. As such, the Company has not recorded a liability for uncertain tax benefits.\nThe Company has adopted ASC 740-10-25, Definition of Settlement, which provides guidance on how an entity should determine whether a tax position is effectively settled for the purpose of recognizing previously unrecognized tax benefits and provides that a tax position can be effectively settled upon the completion and examination by a taxing authority without being legally extinguished. For tax positions considered effectively settled, an entity would recognize the full amount of tax benefit, even if the tax position is not considered more likely than not to be sustained based solely on the basis of its technical merits and the statute of limitations remains open. The federal and state income tax returns of the Company are subject to examination by the IRS and state taxing authorities, generally for three years after they are filed. The Company currently has no federal or state tax examinations nor has it had any federal or state examinations since its inception. The Companys 2022, 2021, 2020 and 2019 tax years may still be subject to federal and state tax examination.\nStock-Based Compensation\nStock-based compensation is accounted for based on the requirements of ASC 718, Share-Based Payment, which requires recognition in the financial statements of the cost of employee and director services received in exchange for an award of equity instruments over the period the employee or director is required to perform the services in exchange for the award (presumptively, the vesting period). The Financial Accounting Standards Board (FASB) also requires measurement of the cost of employee and director services received in exchange for an award based on the grant-date fair value of the award. Pursuant to ASC Topic 505-50, for share-based payments non-employees, compensation expense is determined at the measurement date defined as the earlier of: a) the date at which a commitment for performance by the counterparty to earn the equity instruments is reached or b) the date at which the counterpartys performance is complete.\nThe expense is recognized over the vesting period of the award. Until the measurement date is reached, the total amount of compensation expense remains uncertain. The Company records compensation expense based on the fair value of the award at the reporting date. The awards to consultants and other third parties are then revalued, or the total compensation is recalculated, based on the then current fair value, at each subsequent reporting date.\nNon-Controlling Interests in Consolidated Financial Statements\nIn December 2007, the FASB issued ASC 810-10-65, Non-controlling Interests in Consolidated Financial Statements, an amendment of Accounting Research Bulletin No. 51 (SFAS No. 160). This ASC clarifies that a non-controlling (minority) interest in a subsidiary is an ownership interest in the entity that should be reported as equity in the consolidated financial statements. It also requires consolidated net income to include the amounts attributable to both the parent and non-controlling interest, with disclosure on the face of the consolidated income statement of the amounts attributed to the parent and to the non-controlling interest. In accordance with ASC 810-10- 45-21, those losses attributable to the parent and the non-controlling interest in subsidiaries may exceed their interests in the subsidiarys equity. The excess and any further losses attributable to the parent and the non-controlling interest shall be attributed to those interests even if that attribution results in a deficit non-controlling interest balance. During the year ended September 30, 2017, the Company sold 8 Class A units of membership interest in CFTB Movie and assigned 1 Class B unit in CFTB Movie pursuant to a guarantee agreement which resulted in approximately 27% non-controlling interest. On November 14, 2018, the Company sold 1and ¼ Class A units of membership interest in CFTB Movie to a director of the Company for $125,000 increasing the non-controlling interest to approximately 29.9%. As of September 30, 2022 and 2021, the Company recorded a non-controlling interest balance of $(400,173) and $(375,020), respectively, in connection with the majority-owned subsidiaries, CFTB Movie and CFTB GA as reflected in the accompanying consolidated balance sheet and loss attributable to non-controlling interest of $25,153 and $5,294 during the years ended September 30, 2022 and 2021, respectively, as reflected in the accompanying consolidated statements of operations.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nEquity Method Investment\nThe Company accounts for investments in which the Company owns more than 20% or has the ability to exercise significant influence of the investee but the investee does not qualify for consolidation, using the equity method in accordance with ASC Topic 323, Investments-Equity Method. Under the equity method, an investor initially records an investment in the stock of an investee at cost and adjusts the carrying amount of the investment to recognize the investors share of the earnings or losses of the investee after the date of acquisition. The amount of the adjustment is included in the determination of net income by the investor, and such amount reflects adjustments similar to those made in preparing consolidated statements including adjustments to eliminate intercompany gains and losses, and to amortize, if appropriate, any difference between investor cost and underlying equity in net assets of the investee at the date of investment. The investment of an investor is also adjusted to reflect the investors share of changes in the investees capital. Dividends received from an investee reduce the carrying amount of the investment. A series of operating losses of an investee or other factors may indicate that a decrease in value of the investment has occurred which is other than temporary, and which should be recognized even though the decrease in value is in excess of what would otherwise be recognized by application of the equity method (see Note 4).\nIn accordance with ASC 323-10-35-20 through 35-22, the investor ordinarily shall discontinue applying the equity method if the investment (and net advances) is reduced to zero and shall not provide for additional losses unless the investor has guaranteed obligations of the investee or is otherwise committed to provide further financial support for the investee. An investor shall, however, provide for additional losses if the imminent return to profitable operations by an investee appears to be assured. For example, a material, nonrecurring loss of an isolated nature may reduce an investment below zero even though the underlying profitable operating pattern of an investee is unimpaired. If the investee subsequently reports net income, the investor shall resume applying the equity method only after its share of that net income equals the share of net losses not recognized during the period the equity method was suspended.\nEquity method investments are classified as investments in the accompanying consolidated balance sheet. The Company periodically evaluates its equity and cost method investments for impairment due to declines considered to be other than temporary. If the Company determines that a decline in fair value is other than temporary, then a charge to earnings is recorded as an impairment loss in the accompanying consolidated statements of operations.\nRevenue Recognition\nASU Topic 606 - Revenue from Contracts with Customers (ASU 606), the Company recognizes revenue in accordance with that core principle by applying the following steps:\nStep 1: Identify the contract(s) with a customer.\nStep 2: Identify the performance obligations in the contract.\nStep 3: Determine the transaction price.\nStep 4: Allocate the transaction price to the performance obligations in the contract.\nStep 5: Recognize revenue when (or as) the entity satisfies a performance obligation.\nThe Company recognized revenue of $8,993 and $9,493 during the years ended September 30, 2022 and 2021, respectively, from streaming music sales. The Company markets their master song recordings through online music streaming websites and recognizes revenues on a net basis once the songs are downloaded by the customer and the performance obligation is satisfied.\nRecent Accounting Pronouncements\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40) - Accounting for Convertible Instruments and Contracts on an Entitys Own Equity. The ASU simplifies accounting for convertible instruments by removing major separation models required under current GAAP. Consequently, more convertible debt instruments will be reported as a single liability instrument with no separate accounting for embedded conversion features. The ASU removes certain settlement conditions that are required for equity contracts to qualify for the derivative scope exception, which will permit more equity contracts to qualify for the exceptions. The ASU also simplifies the diluted net income per share calculation in certain areas. The new guidance is effective for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years, and early adoption is permitted. The Company early adopted ASU 2020-06 during the three months ended December 31, 2021 and it did not have a material effect on the consolidated financial statements.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nIn May 2021, the FASB issued ASU 2021-04, Earnings Per Share (Topic 260), Debt-Modifications and Extinguishments (Subtopic 470-50), Compensation-Stock Compensation (Topic 718), and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40). The new ASU addresses issuers accounting for certain modifications or exchanges of freestanding equity-classified written call options. This amendment is effective for all entities, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. Early adoption is permitted. The Company early adopted ASU 2021-04 during the three months ended December 31, 2021 and it did not have a material effect on the consolidated financial statements.\nIn March 2022, the FASB issued ASU 2022-01, Derivatives and Hedging (Topic 815): Fair Value Hedging-Portfolio Layer Method. Current GAAP permits only prepayable financial assets and one or more beneficial interests secured by a portfolio of prepayable financial instruments to be included in a last-of-layer closed portfolio. The amendments in ASU 2022-01 allow 3 non-prepayable financial assets also to be included in a closed portfolio hedged using the portfolio layer method. That expanded scope permits an entity to apply the same portfolio hedging method to both prepayable and non-prepayable financial assets, thereby allowing consistent accounting for similar hedges.\nThe amendments in ASU 2022-01 clarify the accounting for and promote consistency in the reporting of hedge basis adjustments applicable to both a single hedged layer and multiple hedged layers as follows:\n1.\nAn entity is required to maintain basis adjustments in an existing hedge on a closed portfolio basis (that is, not allocated to individual assets).\n2.\nAn entity is required to immediately recognize and present the basis adjustment associated with the amount of the dedesignated layer that was breached in interest income. In addition, an entity is required to disclose that amount and the circumstances that led to the breach.\n3.\nAn entity is required to disclose the total amount of the basis adjustments in existing hedges as a reconciling amount if other areas of GAAP require the disaggregated disclosure of the amortized cost basis of assets included in the closed portfolio.\n4.\nAn entity is prohibited from considering basis adjustments in an existing hedge when determining credit losses.\nFor public business entities, amendments in ASU 2022-01 are effective for fiscal years beginning after December 15, 2022, and interim periods within those fiscal years. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2023, and interim periods within those fiscal years. Early adoption is permitted on any date on or after the issuance of ASU 2022-01 for any entity that has adopted the amendments in ASU 2017-12 for the corresponding period. If an entity adopts the amendments in an interim period, the effect of adopting the amendments related to basis adjustments should be reflected as of the beginning of the fiscal year of adoption (that is, the initial application date). The Company early adopted ASU 2022-01 during the three months ended March 31, 2022 and it did not have a material effect on the consolidated financial statements.\nOther accounting standards that have been issued or proposed by FASB that do not require adoption until a future date are not expected to have a material impact on the consolidated financial statements upon adoption. The Company does not discuss recent pronouncements that are not anticipated to have an impact on or are unrelated to its financial condition, results of operations, cash flows or disclosures.\nNOTE 3 - GOING CONCERN\nThe accompanying consolidated financial statements are prepared on a going concern basis which contemplates the realization of assets and satisfaction of liabilities and commitments in the normal course of business. As reflected in the accompanying consolidated financial statements, the Company had a net income (loss) of $1,835,497 and $(3,115,470) for the years ended September 30, 2022 and 2021, net cash used in operations of $496,569 and $660,935, respectively, for the years ended September 30, 2022 and 2021, respectively. The net income for the year ended September 30, 2022, was primarily a result of the non-cash gain from extinguishment of debt of $3,935,629, loss on change in fair value of derivative liabilities and initial derivative expense of $719,842, and non-cash gain on debt modification of $764,999. Additionally, the Company had an accumulated deficit of $25,708,263, working capital deficit of $15,587,845 and a stockholders deficit of $15,725,345 as of September 30, 2022. As of September 30, 2022, the Company had $2,847,637 of gross convertible notes and $2,472,500 of gross notes payable outstanding. These matters raise substantial doubt about the Companys ability to continue as a going concern for twelve months from the issuance date of this report. The ability to continue as a going concern is dependent upon the Company generating profitable operations in the future such as selling the completed Movie and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. The Companys ability to raise additional capital through the future issuances of common stock is unknown. The obtainment of additional financing, the successful development of the Companys contemplated plan of operations, and its transition, ultimately, to the attainment of profitable operations are necessary for the Company to continue operations.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nThe consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern. While the Company believes in the viability of its strategy to generate revenues, there can be no assurances to that effect.\nNOTE 4 - EQUITY METHOD INVESTMENTS\nThe Company accounts for investments in which the Company owns more than 20% or has the ability to exercise significant influence of the investee, using the equity method in accordance with ASC Topic 323, Investments-Equity Method. Under the equity method, an investor initially records an investment in the stock of an investee at cost and adjusts the carrying amount of the investment to recognize the investors share of the earnings or losses of the investee after the date of acquisition. (see Note 2).\nOn February 2, 2022, the Company and RA Production, Inc (RA Production), a non-related entity, (collectively as Parties) entered into an Operating Agreement with Boss Music and Entertainment, LLC (BME), a Delaware limited liability company (see Note 1 and Note 9). Pursuant to the Operating Agreement, the Company has 50% interest in BME and was to contribute a total of $1,000,000 of towards the BME capital account payable as follows: (i) $200,000 upon signing hereof of the Operating Agreement and (ii) $800,000 payable on the full execution of recording agreements with five artists to form a recording group, (i.e. boy band). As of September 30, 2022, of the total $200,000 only $7,500 of capital contribution had been paid which was recorded as a loss on equity method investment in the accompanying consolidated statements of operations since the project was abandoned. During the year ended September 30, 2022, the Company recognized $7,500 of loss from its equity method investment reflected in the accompanying consolidated statement of operations.\nSummary of equity investment activities:\nSeptember 30,\nEquity investment balance\n$ -\nCapital contributions to Boss Music & Entertainment LLC\n7,500\nLess: loss on equity method investment - Boss Music & Entertainment LLC\n(7,500 )\nEquity investment balance as of September 30, 2022\n$ -\nNOTE 5 - CONVERTIBLE NOTES PAYABLE\nAs of September 30, 2022 and 2021, convertible notes payable - unrelated party consisted of the following:\nSeptember 30,\nSeptember 30,\nPrincipal amount\n$ 2,847,637\n$ 4,665,641\nLess: unamortized debt discount\n(81,960 )\n(706,839 )\nConvertible notes payable, net - current\n$ 2,765,677\n$ 3,958,802\nAs of September 30, 2021, the Company had defaulted on 22 of its convertible notes payable with aggregate outstanding principal amount of $3,239,876. During the year ended September 30, 2022, the Company defaulted on additional convertible notes. During the year ended September 30, 2022, the Company and a lender (Parties) entered into agreements to extend the maturity date of their convertible and non-convertibles notes dated between October 2018 and September 2021 to December 31, 2022 (Amendment Agreements). Pursuant to the Amendment Agreements, the Parties agreed to extend the maturity dated of all these convertible notes to December 31, 2022 and waived any penalty interest that would otherwise have occurred due to the failure to timely repay the convertible notes on or prior to the original maturity date (see Note 11). As of September 30, 2022, the Company had defaulted on 6 of its convertible notes payable with aggregate outstanding principal amount of $1,047,821. All other terms of the convertible notes not modified in the Amendment Agreements shall remain in full force and effect.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn July 18, 2017, the Company issued 12% Convertible Promissory Note for principal borrowings of up to $110,000. The note is unsecured and bears interest at the rate of 12% per annum (24% default rate) and matured in April 2018. The note holder had the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 50% of the volume weighted average price of the Companys common stock during the 20 trading days immediately preceding the conversion date. The Company paid original issue discount and related loan fees of $11,000 in connection with this note payable which was amortized over the term of the note. During 2018, the Company issued an aggregate of 4,124,200 common stock to the note holder upon the conversion of $31,969 of principal amount, accrued interest of $23,818 and fees of $2,000. In April 2018, the Company entered into an amendment agreement with this note holder for the forbearance from converting the notes into shares of common stock of the Company until October 1, 2018, unless an event of default as defined in the note agreements occurs or the Companys stocks trades at a price less than $0.02 per share. During the year ended September 30, 2020, the Company issued an aggregate of 5,665,900 shares of common stock to the note holder upon the conversion of accrued interest of $5,126 and conversion fees of $1,000. This note is currently in default pursuant to the note terms and accrues interest at the default interest rate, and during the year ended September 30, 2020, $43,487 of default penalty was added to the principal balance. As of September 30, 2022 and 2021, the principal balance of this note was $121,518.\nOn September 25, 2017, the Company issued 12% Convertible Promissory Notes for principal borrowings of up to $110,000. The note is unsecured, bears an interest rate of 12% per annum (24% default rate) and matured in June 2018. The note holder had the right to convert beginning on the date which is the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is the lower of (1) 50% of the volume weighted average price of the Companys common stock during the last 20 trading days prior to the date of conversion or (2) 50% of the lowest closing price during the last 20 trading days immediately preceding the conversion date. The Company paid original issue discount and related loan fees of $11,000 in connection with this note payable which was amortized over the term of the note. In April 2018, the Company entered into an amendment agreement with this note holder for the forbearance from converting the notes into shares of common stock of the Company until October 1, 2018, unless an event of default as defined in the note agreements occurs or the Companys stocks trades at a price less than $0.02 per share. This note is currently in default and $80,248 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and this note accrues interest at the default interest rate. As of September 30, 2022 and 2021, the principal balance of this note was $190,248.\nOn March 26, 2018, the Company issued 10% Convertible Promissory Note for principal borrowings of up to $80,000 and on January 22, 2019, the Company issued another 10% Convertible Promissory Note for principal borrowings of up to $80,000 (collectively as Notes). The Notes bore an interest rate of 10% per annum (24% default rate) and matured one year from the date of issuance and. The note holder had the right to convert beginning on the issuance date, the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price to a price which is 52% of the lowest trading price of the Companys common stock during the 18 prior trading days including the day of the conversion date. These Notes may not be prepaid. The Company paid total original issue discount and related loan fees of $20,000 in connection with these Notes and amortized over the term of the Notes. On September 8, 2019, the Company paid off a total principal amount of $80,000 including accrued interest of $4,664 and prepayment penalty of $15,336. During year ended September 30, 2020, the Company issued an aggregate of 817,526,314 shares of common stock to the note holder upon the conversion of $58,100 of principal amount and accrued interest of $6,409. This note defaulted for non-payment and $5,875 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrued interest at the default interest rate upon default. During the year ended September 30, 2021, the Company issued an aggregate of 87,787,912 shares of common stock to the note holder upon the conversion of $21,900 of principal balance and accrued interest of $10,055. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). As of September 30, 2022 and 2021, the principal balance of this note was $0 and $5,875, respectively.\nOn October 31, 2018, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $250,000. The note was unsecured, bore an interest rate of 10% per annum (24% default rate) and matured on October 31, 2019. The note holder had the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 55% of the lowest trading price during the 15 prior trading days immediately preceding including the day of the conversion date. The Company paid original issue discount and related loan fees of $16,000 in connection with this note payable which was amortized over the term of the note. This note defaulted for non-payment and $25,000 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrued interest at the default interest rate upon default. During the year ended September 30, 2021, the Company issued an aggregate of 835,656,596 shares of common stock to the note holder upon the conversion of $148,220 of principal balance and accrued interest of $61,513. As of September 30, 2021, the note had principal balance of $126,780. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. During the year ended September 30, 2022, the Company issued an aggregate of 1,009,871,832 shares of common stock to the note holder upon the conversion of $101,780 of principal, accrued interest of $32,522 and conversion fee of $2,800. As of September 30, 2022, the note was fully converted and had no outstanding balance.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn November 6, 2018, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $120,000. The note was unsecured, bore an interest rate of 10% per annum (24% default rate) and matured on November 6, 2019. The note holder had the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. The Company paid original issue discount and related loan fees of $2,000 in connection with this note payable which was amortized over the term of the note. This note defaulted for non-payment and $12,000 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrued interest at the default interest rate upon default. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). On February 18, 2022, the Company and the lender entered into a second note amendment agreement extending to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. During the year ended September 30, 2022, the Company issued an aggregate of 918,587,164 shares of common stock to the note holder upon the conversion of $120,000 of principal balance, accrued interest of $37,918 and conversion fee of $2,100. As of September 30, 2021, the principal balance of this note was $132,000. As of September 30, 2022, the note was fully converted and had no outstanding balance.\nOn November 23, 2018, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $140,000. The note was unsecured, bears an interest rate of 10% per annum and matured on November 23, 2019. The note holder shall have the right to convert beginning on the date which was 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 60 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 100% to 136% as defined in the note agreement. After this initial 180-day period, the Company had no right to prepay the note. The Company paid original issue discount and related loan fees of $4,000 in connection with this note payable which was amortized over the term of the note. This note came into default for non-payment and $14,000 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrue interest at the default interest rate upon default On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. During the year ended September 30, 2022, the Company issued an aggregate of 197,141,500 shares of common stock to the note holder upon the conversion of $8,500 of principal balance, accrued interest of $2,978 and conversion fee of $350. As of September 30, 2022 and 2021, the principal balance of this note was $131,500 and $154,000, respectively.\nOn November 27, 2018, the Company issued a 12% Convertible Promissory Note with a certain note holder for principal borrowings of up to $250,000. The note is unsecured, bears an interest rate of 12% per annum and matured on May 27, 2019. The note holder shall have the right to convert beginning on the date which was 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. The Company paid original issue discount and related loan fees of $20,750 in connection with this note payable which was amortized over the term of the note. During the year ended September 30, 2020, the Company issued an aggregate of 635,470,205 common stock to the note holder upon the conversion of $34,738 of principal amount, accrued interest of $1,511 and fees of $9,500. During the year ended September 30, 2021, the Company issued an aggregate of 493,005,626 common stock to the note holder upon the conversion of accrued interest of $33,142 and fees of $2,000. This note defaulted for non-payment and $115,294 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrues interest at the default interest rate upon default. As of September 30, 2022 and 2021, the principal balance of this note was $330,556.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn December 13, 2018, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $150,000. The note is unsecured, bears an interest rate of 10% per annum and matured on December 13, 2019. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 60 to 180 days following the date of the note, the Company has the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 134% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issue discount and related loan fees of $6,000 in connection with this note payable which will be amortized over the term of the note. This note came into default for non-payment and $15,000 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrue interest at the default interest rate upon default. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. During the year ended September 30, 2022, the Company issued an aggregate of 878,344,665 shares of common stock to the note holder upon the conversion of $37,500 of principal balance, accrued interest of $13,451 and conversion fee of $1,750. As of September 30, 2022 and 2021, the principal balance of this note was $112,500 and $165,000, respectively.\nOn December 28, 2018, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $240,000. The note is unsecured, bears an interest rate of 10% per annum (24% default rate) and matured on December 28, 2019. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. The Company paid original issue discount and related loan fees of $11,000 in connection with this note payable which was amortized over the term of the note. This note defaulted for non-payment and $24,000 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrues interest at the default interest rate upon default. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022 and 2021, the principal balance of this note was $240,000 and $264,000, respectively.\nOn January 9, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $163,000. The note is unsecured, bears an interest rate of 10% per annum and matured on January 9, 2020. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. The Company paid original issue discount and related loan fees of $8,000 in connection with this note payable which was amortized over the term of the note. This note defaulted for non-payment and $16,300 of default penalty was added to the principal balance during the during the year ended September 30, 2020, pursuant to the note and accrue interest at the default interest rate upon default. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022 and 2021, the principal balance of this note was $163,000 and $179,300, respectively.\nOn February 1, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for aggregate principal borrowings of up to $90,000. Additionally, on February 1, 2019, the Company issued another 10% Convertible Promissory Notes for principal borrowings of up to $90,000. The 10% convertible promissory notes and all accrued interest were due one year from the date of issuance. The note are unsecured and bears interest at the rate of 10% per annum (24% default rate) from the issuance date thereof until the notes are paid. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 54% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. The Company does not have a right to prepay the note. Any amount of principal or interest on this note which is not paid when due shall bear interest at the rate of 18% per annum from the due date thereof until the same is paid. The Company paid total original issue discount and related loan fees of $14,000 in connection with these notes payable which was amortized over the term of the notes. This note defaulted for non-payment and $9,000 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrues interest at the default interest rate upon default. During the year ended September 30, 2021, the Company issued an aggregate of 319,673,835 shares of common stock to the note holder upon the conversion of principal amount of $90,000, and accrued interest of $30,837. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). As of September 30, 2022 and 2021, the principal balance of this note was $0 and $9,000, respectively.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn February 8, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $110,000. The note is unsecured, bears an interest rate of 10% per annum and matured on February 8, 2020. The note is unsecured and bears interest at the rate of 10% per annum from the issuance date thereof until the note is paid. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 60 to 180 days following the date of the note, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 134% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issue discount and related loan fees of $4,000 in connection with this note payable which was amortized over the term of the note. This note defaulted for non-payment and $11,000 of default penalty was added to the principal balance during the during the year ended September 30, 2020, pursuant to the note and accrues interest at the default interest rate upon default. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022 and 2021, the principal balance of this note was $110,000 and $121,000, respectively.\nOn March 15, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $350,000. The note is unsecured, bears an interest rate of 10% per annum and matured on March 15, 2020. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 90 to 180 days following the date of the note, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issue discount and related loan fees of $15,000 in connection with this note payable which was amortized over the term of the note. This note defaulted for non-payment and $35,000 of default penalty was added to the principal balance during the during the year ended September 30, 2020, pursuant to the note and accrues interest at the default interest rate upon default. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The Note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see below). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022 and 2021, the principal balance of this note was $350,000 and $385,000, respectively.\nOn July 12, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $125,000 and received proceeds of $118,750, net of discount. The note is unsecured, bears an interest rate of 10% per annum (24% default rate) and matured on June 12, 2020. The note holder shall have the right to convert on the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 55% of the lowest trading price during the 20 prior trading days immediately preceding including the day of the conversion date. During the first 60 to 180 days following the date of the note, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 130% to 145% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $6,250 in connection with this note payable which was amortized over the term of the note. This note defaulted for non-payment and $12,500 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrues interest at the default interest rate upon default. As of September 30, 2022 and 2021, the principal balance of this note was $137,500.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn September 5, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $220,000 and received proceeds of $209,000, net of discount. The note is unsecured, bears an interest rate of 10% per annum (24% default rate) and matured on September 5, 2020. The note holder shall have the right to convert on the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 55% of the lowest trading price during the 20 prior trading days immediately preceding including the day of the conversion date. During the first 60 to 180 days following the date of the note, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 130% to 145% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $11,000 in connection with this note payable which was amortized over the term of the note. This note defaulted for non-payment and $22,000 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrues interest at the default interest rate upon default. During the year ended September 30, 2021, the Company issued an aggregate of 118,918,182 shares of common stock to the note holder upon the conversion of $2,900 of principal amount and accrued interest of $370. During the year ended September 30, 2022, the Company issued an aggregate of 608,872,909 shares of common stock to the note holder upon the conversion of $22,100 of principal balance and accrued interest of $11,388. As of September 30, 2022 and 2021, the principal balance of this note was $217,000 and $239,100, respectively.\nOn October 9, 2019, the Company issued 12% Convertible Promissory Notes for principal borrowings of up to $36,000 and received proceeds of $30,250, net of discount. The note is unsecured, bears an interest rate of 12% per annum and matured on July 9, 2020. The note holder has the right to convert beginning on the date which is the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is the lesser of (1) lowest 25 trading days prior to the date of this note or (2) 50% of the lowest closing price during the last 25 trading days immediately preceding the conversion date. If the conversion price is less than $0.10 at any time after the issue date, the principal amount of the note shall increase by $15,000 and the conversion price shall decrease to 30% instead of 50%. During the first 90 to 180 days following the date of this note, the Company had the right to prepay the principal and accrued but unpaid interest due under this note, together with any other amounts that the Company may owe the holder under the terms of this note, at a premium ranging from 135% to 150% as defined in the note agreement. After this initial 180-day period, the Company had no right to prepay the note. The Company paid original issue discount and related loan fees of $5,750 in connection with this note payable which was amortized over the term of the note. This note defaulted for non-payment and $15,000 of default penalty was added to the principal balance during the year ended September 30, 2020, pursuant to the note and accrues interest at the default interest rate upon default. Additionally, on October 9, 2019, the Company granted a 1,200,000 warrant to purchase shares of the Companys common stock in connection with the issuance of a convertible note. The warrant expires five-years from the date of grant and has an exercise price of $0.015. The exercise price and the number of warrants were subject to adjustment upon distribution of assets and anti-dilution protection provision as defined in the stock warrant agreement. The Company accounted for the warrants by using the relative fair value method and recorded debt discount from the relative fair value of the warrants of $10,616 using the Black-Scholes option pricing (see Note 8) which was amortized over the term of the note. As of September 30, 2022 and 2021, the principal balance of this note was $51,000.\nOn May 3, 2021, the Company issued a 10% Convertible Promissory Note with a certain note holder, for principal borrowings of $67,650 and received proceeds of $65,000, net of discount of $2,650. The 10% convertible promissory note and all accrued interest was due on May 3, 2022. The note is unsecured and bears interest at the rate of 10% per annum (24% default rate) from the issuance date thereof until the note is paid. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $2,650 in connection with this note payable which was amortized over the term of the note. On February 18, 2022, the Note was amended whereby the lender extended the maturity date to December 31, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Exchanges and no gain or loss was recognized. As of September 30, 2022 and 2021, the principal balance of this note was $67,650.\nOn June 21, 2021, the Company issued a 10% Convertible Promissory Note with a certain note holder, for principal borrowings of $83,250 and received proceeds of $80,000, net of discount of $3,250. The 10% convertible promissory note and all accrued interest was due on June 21, 2022. The note is unsecured and bears interest at the rate of 10% per annum (24% default rate) from the issuance date thereof until the note is paid. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $3,250 in connection with this note payable which was amortized over the term of the note. On February 18, 2022, the Note was amended whereby the lender extended the maturity date to December 31, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized. As of September 30, 2022 and 2021, the principal balance of this note was $83,250.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn July 12, 2021, the Company issued a 10% Convertible Promissory Note with a certain note holder, for principal borrowings of $45,787 and received proceeds of $44,000, net of discount of $1,787. The 10% convertible promissory note and all accrued interest was due on July 12, 2022. The note is unsecured and bears interest at the rate of 10% per annum from the issuance date thereof until the note is paid. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $1,787 in connection with this note payable which was amortized over the term of the note. On February 18, 2022, the Note was amended whereby the lender extended the maturity date to December 31, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized. As of September 30, 2022 and 2021, the principal balance of this note was $45,787.\nOn July 27, 2021, the Company issued a 10% Convertible Promissory Note to with a certain note holder, for principal borrowings of $46,828 and received proceeds of $45,000, net of discount of $1,828. The 10% convertible promissory note and all accrued interest was due on July 27, 2022. The note is unsecured and bears interest at the rate of 10% per annum from the issuance date thereof until the note is paid. The note holder shall have the right to convert beginning on the date which is 180 days following the issuance date the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $1,828 in connection with this note payable which was amortized over the term of the note. On February 18, 2022, the Note was amended whereby the lender extended the maturity date to December 31, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized. As of September 30, 2022 and 2021, the principal balance of this note was $46,828.\nOn September 17, 2021, the Company issued a 10% Convertible Promissory Note to with a certain note holder, for principal borrowings of $161,250 and received proceeds of $155,000, net of discount of $6,250. The 10% convertible promissory note and all accrued interest was due on September 17, 2022. The note is unsecured and bears interest at the rate of 10% per annum from the issuance date thereof until the note is paid. The note holder shall have the right to convert the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $6,250 in connection with this note payable which was amortized over the term of the note. On February 18, 2022, the Note was amended whereby the lender extended the maturity date to December 31, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized. As of September 30, 2022 and 2021, the principal balance of this note was $161,250.\nOn December 6, 2021, the Company issued a 10% Convertible Promissory Note to with a certain note holder, for principal borrowings of $116,525 and received proceeds of $112,000, net of discount of $4,525. The 10% convertible promissory note and all accrued interest is due on December 6, 2022. The note is unsecured and bears interest at the rate of 10% per annum from the issuance date thereof until the note is paid. The note holder shall have the right to convert the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $4,525 in connection with this note payable which is being amortized over the term of the note. As of September 30, 2022, the principal balance of this note was $116,525.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn December 23, 2021, the Company issued a 10% Convertible Promissory Note to with a certain note holder, for principal borrowings of $116,525 and received proceeds of $112,000, net of discount of $4,525. The 10% convertible promissory note and all accrued interest is due on December 23, 2022. The note is unsecured and bears interest at the rate of 10% per annum from the issuance date thereof until the note is paid. The note holder shall have the right to convert the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $4,525 in connection with this note payable which is being amortized over the term of the note. As of September 30, 2022, the principal balance of this note was $116,525.\nOn May 12, 2022, the Company issued a 10% Convertible Promissory Note to with a certain note holder, for principal borrowings of $55,000 and received proceeds of $52,250, net of discount of $2,750. The 10% convertible promissory note and all accrued interest is due on May 12, 2023. The note is unsecured and bears interest at the rate of 10% per annum (24% default rate) from the issuance date thereof until the note is paid. The note holder shall have the right to convert the outstanding principal amount and accrued but unpaid interest into the Companys common stock at a conversion price equal to a price which is 60% of the lowest trading price during the 20 prior trading days immediately preceding including the day of the conversion date. During the first 180 days following the date of these notes, the Company has the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 130% to 145% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $2,750 in connection with this note payable which is being amortized over the term of the note. As of September 30, 2022, the principal balance of this note was $55,000.\nAs of September 30, 2022 and 2021, accrued interest related to the convertible notes payable amounted to $1,192,824 and $1,587,435, respectively, which was included in accrued interest on the accompanying consolidated balance sheets.\nAmendment of Convertible Notes\nOn October 18, 2021, several aforementioned convertible notes payable (Notes) held by one lender were amended whereby the lender extended the maturity dates to April 18, 2022 and waived the penalty interests, incurred on the respective original maturity dates of the Notes, which includes; (i) the 10% default penalty added to the principal balance of the Notes and; (ii) the difference between the interest accrued at the original interest rate and default interest rate. The amendment of the Notes resulted in; (i) a reduction of outstanding principal balances in total amount of $215,175 which was the total amount of default penalty added to the principal balance of the Notes upon the respective default dates and; (ii) a reduction of accrued interest in total amount of $549,824 which was the difference in accrued interest incurred at the original and default interest rate. Based on the result of the amendment of the Notes the Company accounted for it as a trouble debt restructuring in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors and recognized and gain on debt modification of $764,999 during the year ended September 30, 2022.\nOn February 18, 2022, several convertible notes payable (Notes) discussed above were amended whereby the lender extended the maturity date to December 31, 2022. The amendment of these Notes was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn April 5, 2022, the Company and a lender (collectively as Parties) entered into a Master Note Amendment (April 2022 Note Amendment) to amend six convertible notes dated: (i) April 8, 2019 with principal balance of $54,000, convertible at a price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date, (ii) May 22, 2019 with principal balance of $108,000, convertible at a price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date, (iii) May 24, 2019 with principal balance of $100,000, convertible at price equal to 61% of the average of the lowest 2 trading prices during the 10 prior trading days immediately preceding including the day of the conversion date, (iv) July 24, 2019 with principal balance of $145,000, convertible at a price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date, (v) September 4, 2019 with principal balance of $165,000, convertible at a price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date and (vi) January 14, 2020 with principal balance of $8,000, convertible at a price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date (collectively as Amended Notes) (see Note 6). The April 2022 Note Amendment provides for (i) the removal the Amended Notes conversion features in its entirety and (ii) a payoff covenant whereby the Company agreed to use 25% of the net proceeds received in any capital raise equal to $300,000 or more to repay the outstanding balance of the Amended Notes. The elimination of the Amended Notes conversion features resulted in a substantial change in the terms of the Amended Notes which was accounted for in accordance with ASC 470-50 - Debt Modifications and Extinguishment. The Company revalued the embedded conversion option derivative liabilities associated with the Amended Notes which amounted to $1,365,641, recorded as gain on debt extinguishment in the accompanying consolidated statement of operations. On April 5, 2022, in connection with the April 2022 Note Amendment, an aggregate principal balance of $580,000 was reclassified from convertible notes payable to notes payable.\nOn September 13, 2022, the Company and a lender (collectively as Parties) entered into a Master Note Amendment (September 2022 Note Amendment) to amend five convertible notes dated: (i) January 7, 2021 with principal balance of $328,200, convertible at a price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date, (ii) February 3, 2021 with principal balance of $248,000, convertible at a price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date, (iii) February 24, 2021 with principal balance of $218,800, convertible at price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date, (iv) April 1, 2021 with principal balance of $75,000, convertible at a price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date and (v) April 8, 2021 with principal balance of $151,000, convertible at a price equal to 60% of the lowest trading price during the 18 prior trading days immediately preceding including the day of the conversion date (collectively as September 2022 Amended Notes) (see Note 6). The September 2022 Note Amendment provides for (i) the removal the Amended Notes conversion features in its entirety and (ii) a payoff covenant whereby the Company agreed to use 25% of the net proceeds received in any capital raise equal to $50,000 or more to repay the outstanding balance of the September 2022 Amended Notes. The elimination of the September 2022 Amended Notes conversion features resulted in a substantial change in the terms of the Amended Notes which was accounted for in accordance with ASC 470-50 - Debt Modifications and Extinguishment. The Company revalued the embedded conversion option derivative liabilities associated with the Amended Notes which amounted to $2,488,936, recorded as gain on debt extinguishment in the accompanying consolidated statement of operations. On September 13, 2022, in connection with the September 2022 Note Amendment, an aggregate principal balance of $1,021,000 was reclassified from convertible notes payable to notes payable.\nDerivative Liabilities Pursuant to Convertible Notes and Warrants\nIn connection with the issuance of the unrelated party convertible notes (collectively referred to as Notes) and warrants (collectively referred to as Warrants), discussed above, the Company determined that the terms of the Notes and Warrants contain an embedded conversion option to be accounted for as derivative liabilities due to the holder having the potential to gain value upon conversion and provisions which includes events not within the control of the Company. Additionally, as of September 30, 2022 and 2021, the Convertible Notes and Warrants outstanding were accounted for as derivatives as the Company does not have sufficient authorized shares to cover these dilutive securities. In accordance with ASC 815-40 -Derivatives and Hedging - Contracts in an Entitys Own Stock, the embedded conversion option contained in the Notes and the Warrants were accounted for as derivative liabilities at the date of issuance and shall be adjusted to fair value through earnings at each reporting date. The fair value of the embedded conversion options was determined using the Binomial Lattice valuation model. At the end of each period and on note conversion date or repayment, the Company revalues the derivative liabilities resulting from the embedded option.\nDuring the year ended September 30, 2022, in connection with the issuance of the Notes, on the initial measurement date, the fair values of the embedded conversion option of $411,920 was recorded as derivative liabilities of which $276,250 was allocated as a debt discount and $135,670 as initial derivative expense. During the year ended September 30, 2021, in connection with the issuance of the Notes and Warrants, on the initial measurement date, the fair values of the embedded conversion option of $3,276,509 was recorded as derivative liabilities of which $1,369,000 was allocated as a debt discount and $1,907,509 as initial derivative expense.\nAt the end of the periods, the Company revalued the embedded conversion option and warrant derivative liabilities. In connection with these revaluations, the Company recorded a loss from the change in the derivative liabilities fair value of $584,172 and $2,743,541 for the years ended September 30, 2022 and 2021, respectively.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nDuring the years ended September 30, 2022 and 2021, the fair value of the derivative liabilities was estimated at issuance, upon revaluation, and on September 30, 2022 and 2021, using the Binomial Lattice valuation model with the following assumptions:\nDividend rate\n-\n%\n-\n%\nTerm (in years)\n0.01 to 1 year\n0.01 to 1 year\nVolatility\n128%to567\n%\n242%to304\n%\nRisk-free interest rate\n0.05%to3.8\n%\n0.05%to1.61\n%\nFor the years ended September 30, 2022 and 2021, amortization of debt discounts related to the convertible notes amounted to $912,930 and $721,789, respectively, which was recorded as interest expense on the accompanying consolidated statements of operations. As of September 30, 2022 and 2021, the unamortized debt discounts were $81,960 and $706,839, respectively.\nOn September 30, 2022, future maturities of convertible notes payable are as follows:\nFiscal year ended September 30,\nAmount\n$ 2,710,137\n137,500\nTotal principal amounts due\n$ 2,847,637\nNOTE 6 - NOTES AND LOANS PAYABLE\nNotes Payable\nOn September 30, 2022 and 2021, notes payable consisted of the following:\nSeptember 30,\nSeptember 30,\nNotes principal amount - related party\n$ 200,000\n$ 200,000\nNotes principal amount - unrelated party\n2,272,500\n430,000\nLess unamortized discount\n(14,827 )\n-\nNotes payable, net\n$ 2,457,673\n$ 630,000\nNotes Payable - Related Party\nOn April 1, 2018, the Company issued a due on demand 5% promissory note to an affiliated company for $200,000. The Company may prepay the note without a prepayment penalty. The former COO of the Company is a trustee of the affiliated company. As of September 30, 2022 and 2021, the principal balance of this note was $200,000 and is reflected as note payable - related party on the accompanying consolidated balance sheets. On September 30, 2022 and 2021, accrued interest payable on this note was $44,219 and $34,219, respectively, which is included in accounts payable and accrued liabilities - related party on the accompanying consolidated balance sheets.\nNotes Payable - Unrelated Party\nIn June 2017, through the Companys subsidiary, CFTB Movie, the Company entered into a 12% loan and security agreement for a loan amount of $400,000 (June 2017 Note). The 12% secured note and all accrued interest was due on August 15, 2017. The default interest rate was 22% after the maturity date. The Company received net proceeds of $350,000 and paid original issue discount and related loan fees of $50,000 in connection with the June 2017 Note which was amortized over the term of the loan. The June 2017 Note was used for the production of the Movie. The Company had granted a security interest in all the Companys property, tangible and intangible, existing or subsequently in effect, including but not limited to; (i) all bank accounts; (ii) all of the Companys right under any contract; (iii) all accounts payable; (iv) all chattel paper, documents and instruments related to accounts; (v) all intellectual property; (vi) all inventory, furniture, fixtures, equipment and supplies and; (vii) all proceeds, products and accessions of, and to, any and all of the foregoing. In July 2017, the Company entered into an Agreement (the Extension Agreement), to extend the maturity date of the June 2017 Note to December 1, 2017, from August 15, 2017, and to release the guarantee as discussed below. Beginning on December 1, 2017 and continuing until such time as this loan is repaid, CFTB Movie at its sole option, may choose to make monthly partial payments that will be applied to the outstanding amount, due no later than the first business day of each month, in denominations of no less than $100,000. In consideration for extending the maturity date to December 1, 2017, and the release of the guarantee, the Company shall pay; (i) $25,000 fee; (ii) 6% of adjusted gross revenue from the Movie as defined in the Extension Agreement and; (iii) shall be first position of senior secured creditor after repayment of a loan to a certain lender as defined in the Extension Agreement. The $25,000 fee for such extension was amortized up to the extended maturity date of December 1, 2017 and recorded the amortization to film production cost as capitalized interest and was added to the principal amount of loan in fiscal year 2018. In July 2017, through the Companys majority owned subsidiary, CFTB GA, the Company received from same lender above, additional proceeds from issuance of a Note (July 2017 Note) for a principal amount of $98,465. On December 12, 2017, the Company paid $25,000 towards the July 2017 Note. In January 2018, through the Companys majority owned subsidiary, CFTB GA, the Company received from same lender above, additional proceeds from issuance of a Note (January 2018 Note) for a principal amount of $11,250. The January 2018 Note bore 12% interest per annum and was considered due on demand as there was no set maturity.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn September 16, 2019, the Company and a lender (collectively as Parties) entered into a Settlement Agreement and Release (Settlement Agreement) to settle the June 2017 Note, July 2017 Note and January 2018 Note with an aggregate principal of $509,715 and accrued interest of $258,250, for a total outstanding balance of $767,965. Pursuant to the Settlement Agreement, the Parties agreed to settle the outstanding balance of $767,965 for a settlement payment of $430,000 of which $250,000 was paid in cash and $180,000 in form of a 24-month interest free promissory which matured on September 16, 2021, and shall accrue default interest rate of 16% upon default notice from the lender, after which the original notes shall be retired and extinguished, and the Company released from any and all claims relating to the note including liens and foreclosures. The settlement resulted in a gain from extinguishment of debt in the amount of $337,965 during the year ended September 30, 2019. To date, the Company has not received a default notice from the lender.\nIn connection with the Settlement Agreement, the Company, through its majority owned subsidiaries, CFTB Movie and CFTB GA, issued two separate 6% promissory notes to former director of the Company for $125,000 and a third-party note holder for $125,000 (the collectively as Notes), for a total principal amount of $250,000 which were both due on July 16, 2021. The Notes bear an interest rate of 6% and 16% upon the event of default. The Notes shall be paid in equal monthly installments of $6,014 including accrued interest with the first installment due on December 1, 2019. The payment of the 6% promissory notes are guaranteed by the Company. In the event the Company sells the Movie, the Notes including the accrued interest shall become immediately due and payable from the proceeds of such sale. These Notes defaulted at maturity for non-payment. However, the lenders have waived the default interest rate and these notes accrue interest at 6% per annum. The Company and Brian Lukow, CEO of the Company, have not transferred and assigned any of its rights, title and interest in the Movie equally to each holder of the Notes.\nDuring the years ended September 30, 2022 and 2021, the Company recorded interest expense of $84,046 and $15,000, respectively, in connection with these notes payable. As of September 30, 2022, these notes payable had an aggregate principal $430,000 and aggregate accrued interest of $109,704. As of September 30, 2021, these notes payable had an aggregate principal $430,000 and aggregate accrued interest of $30,658. As of September 30, 2022, the Company had not made any payments towards these notes payable.\nOn March 15, 2022, the Company entered into a Securities Purchase Agreement (SPA) with a certain note holder for issuance of two 10% Promissory Notes (collectively as Notes) for an aggregate principal borrowing of $104,000 with aggregate original issue discount (OID) of $4,000. The Notes are unsecured and bears interest at the rate of 10% per annum (which shall increase to 18% upon default) from the issuance date thereof until the note is paid and matures twelve months from the issuance date. On March 15, 2022, the Company issued the first promissory note (Note I), with principal amount of $52,000 and received $50,000 of net proceeds, net of $2,000 original issuance discount. The principal and all accrued interest of Note I is due March 15, 2023. The Company recorded a discount of $2,000 in connection with Note I which is being amortized over the term of the Note I. On July 28, 2022, the Company issued the second promissory note (Note II), with principal amount of $52,000 and received $50,000 of net proceeds, net of $2,000 original issuance discount. The principal and all accrued interest of Note II is due July 28, 2023. The Company recorded a discount of $2,000 in connection with Note II which is being amortized over the term of the Note II. As of September 30, 2022, the principal balance of these note was $104,000.\nOn September 16, 2022, the Company entered into a Securities Purchase Agreement (SPA) with a certain note holder for issuance of two 10% Promissory Notes (collectively as Notes) for an aggregate principal borrowing of $275,000 with aggregate original issue discount (OID) of $25,000. The Notes are unsecured and bears interest at the rate of 10% per annum (which shall increase to 18% upon default) from the issuance date thereof until the note is paid and matures twelve months from the issuance date. On September 16, 2022, the Company issued the first promissory note (September 2022 Note I), with principal amount of $137,500 and received $125,000 of net proceeds, net of $12,500 original issuance discount. The principal and all accrued interest of September 2022 Note I is due September 16, 2023. The Company recorded a discount of $12,500 in connection with September Note I which is being amortized over the term of the September 2022 Note I. As of September 30, 2022, the principal balance of this note was $137,500.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nApril 2022 and September 2022 Note Payable Amendments (see Note 5)\nOn April 5, 2022, the Company and a lender (collectively as Parties) entered into a Master Note Amendment (April 2022 Note Amendment) to amend six convertible notes dated: (i) April 8, 2019 with principal balance of $54,000, (ii) May 22, 2019 with principal balance of $108,000, (iii) May 24, 2019 with principal balance of $100,000, (iv) July 24, 2019 with principal balance of $145,000, (v) September 4, 2019 with principal balance of $165,000 and (vi) January 14, 2020 with principal balance of $8,000 (collectively as Amended Notes). The April 2022 Note Amendment provides for (i) the removal the Amended Notes conversion features in its entirety and (ii) a payoff covenant whereby the Company agreed to use 25% of the net proceeds received in any capital raise equal to $300,000 or more to repay the outstanding balance of the Amended Notes (see Note 5).\nOn September 13, 2022, the Company and a lender (collectively as Parties) entered into a Master Note Amendment (September 2022 Note Amendment) to amend five convertible notes dated: (i) January 7, 2021 with principal balance of $328,200, (ii) February 3, 2021 with principal balance of $248,000, (iii) February 24, 2021 with principal balance of $218,800, (iv) April 1, 2021 with principal balance of $75,000, and (v) April 8, 2021 with principal balance of $151,000 (collectively as September 2022 Amended Notes) (see Note 5). The September 2022 Note Amendment provides for (i) the removal the Amended Notes conversion features in its entirety and (ii) a payoff covenant whereby the Company agreed to use 25% of the net proceeds received in any capital raise equal to $50,000 or more to repay the outstanding balance of the September 2022 Amended Notes.\nBelow are the details of the Amended Notes.\nOn April 8, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $54,000 and received proceeds of $50,000, net of discount. The note is unsecured, bears an interest rate of 10% per annum and matured on April 8, 2020. During the first 90 to 180 days following the date of the note, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid an original issuance discount of $4,000 in connection with this note payable which was amortized over the term of the note. This note came into default for non-payment and pursuant to the note, $5,400 of default penalty was added to the principal balance during the year ended September 30, 2020 and accrues interest at the default interest rate. On October 18, 2021, the note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see Note 5). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022, the principal balance of this note was $54,000.\nOn May 22, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $108,000 and received proceeds of $100,000, net of discount. The note is unsecured, bears an interest rate of 10% per annum and matured on May 22, 2020. During the first 90 to 180 days following the date of this note, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $8,000 in connection with this note payable which was amortized over the term of the note. This note came into default for non-payment and pursuant to the note, $10,800 of default penalty was added to the principal balance during the year ended September 30, 2020 and the note accrues interest at the default interest rate. On October 18, 2021, the note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see Note 5). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022, the principal balance of this note was $108,000.\nOn May 24, 2019, the Company issued a 12% Convertible Promissory Note with a certain note holder for principal borrowings of up to $100,000 and received proceed of $94,000. The note is unsecured, bears an interest rate of 12% per annum and matured on February 20, 2020. The note is unsecured and bears interest at the rate of 12% per annum from the issuance date thereof until the note is paid. During the first 30 to 180 days following the date of the note, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 140% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issue discount and related loan fees of $6,000 in connection with this note payable which was amortized over the term of the note. This note came into default for non-payment during the year ended September 30, 2020 and pursuant to the note started accruing interest at the default interest rate. On October 18, 2021, the note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see Note 5). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022, the principal balance of this note was $100,000.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn July 24, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $145,000 and received proceeds of $135,000, net of discount. The note is unsecured, bears an interest rate of 10% per annum and matured on July 24, 2020. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $10,000 in connection with this note payable which was amortized over the term of the note. This note came into default for non-payment and pursuant to the note, $14,500 of default penalty was added to the principal balance during the year ended September 30, 2020 and accrue interest at the default interest rate. On October 18, 2021, the note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see Note 5). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022, the principal balance of this note was $145,000.\nOn September 4, 2019, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $165,000 and received proceeds of $150,000, net of discount. The note is unsecured, bears an interest rate of 10% per annum and matured on September 4, 2020. During the first 90 to 180 days following the date of this note, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $15,000 in connection with this note payable which was amortized over the term of the note. This note came into default for non-payment and pursuant to the note, $16,500 of default penalty was added to the principal balance during the year ended September 30, 2020, and accrues interest at the default interest rate. On October 18, 2021, the note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see Note 5). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022, the principal balance of this note was $165,000.\nOn January 14, 2020, the Company issued a 10% Convertible Promissory Note with a certain note holder for principal borrowings of up to $8,000 and received proceeds of $7,200, net of discount. The note is unsecured, bears an interest rate of 10% per annum and matures on January 14, 2021. During the first 90 to 180 days following the date of this note, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $800 in connection with this note payable which was amortized over the term of the note. This note came into default for non-payment and pursuant to the note, $800 of default penalty was added to the principal balance during the year ended September 30, 2021 and accrues interest at the default interest rate. On October 18, 2021, the note was amended whereby the lender extended the maturity date to April 18, 2022 and waived all the default penalty and accrued default interest incurred. The note amendment was accounted for in accordance with ASC 470-60, Debt - Troubled Debt Restructurings by Debtors, and on October 18, 2021, the Company recognized a gain on debt modification on the accompanying consolidated statement of operations (see Note 5). On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022, the principal balance of this note was $8,000.\nOn January 7, 2021, the Company issued a 10% Convertible Promissory Note with a certain note holder, for principal borrowings of $328,200 and received proceeds of $315,000, net of discount of $13,200. The 10% convertible promissory note and all accrued interest was due on January 7, 2022. The note is unsecured and bears interest at the rate of 10% per annum (24% default rate) from the issuance date thereof until the note is paid. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $13,200 in connection with this note payable which was being amortized over the term of the note. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized. On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022 and 2021, the principal balance of this note was $328,200.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOn February 3, 2021, the Company issued a 10% Convertible Promissory Note with a certain note holder, for principal borrowings of $248,000 and received proceeds of $238,000, net of discount of $10,000. The 10% convertible promissory note and all accrued interest was due on February 3, 2022. The note is unsecured and bears interest at the rate of 10% per annum (24% default rate) from the issuance date thereof until the note is paid. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $10,000 in connection with this note payable which was being amortized over the term of the note. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized. On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022 and 2021, the principal balance of this note was $248,000.\nOn February 24, 2021, the Company issued a 10% Convertible Promissory Note with a certain note holder, for principal borrowings of $218,800 and received proceeds of $210,000, net of discount of $8,800. The 10% convertible promissory note and all accrued interest was due on February 24, 2022. The note is unsecured and bears interest at the rate of 10% per annum (24% default rate) from the issuance date thereof until the note is paid. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $8,800 in connection with this note payable which was amortized over the term of the note. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized. On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022 and 2021, the principal balance of this note was $218,800.\nOn April 1, 2021, the Company issued a 10% Convertible Promissory Note with a certain note holder, for principal borrowings of $75,000 and received proceeds of $72,000, net of discount of $3,000. The 10% convertible promissory note and all accrued interest was due on April 1, 2022. The note is unsecured and bears interest at the rate of 10% per annum (24% default rate) from the issuance date thereof until the note is paid. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $3,000 in connection with this note payable which was amortized over the term of the note. October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized. On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022 and 2021, the principal balance of this note was $75,000.\nOn April 8, 2021, the Company issued a 10% Convertible Promissory Note with a certain note holder, for principal borrowings of $151,000 and received proceeds of $145,000, net of discount of $6,000. The 10% convertible promissory note and all accrued interest is due on April 8, 2022.he note is unsecured and bears interest at the rate of 10% per annum (24% default rate) from the issuance date thereof until the note is paid. During the first 90 to 180 days following the date of these notes, the Company had the right to prepay the principal and accrued but unpaid interest due under the note, together with any other amounts that the Company may owe the holder under the terms of the note, at a premium ranging from 110% to 128% as defined in the note agreement. After this initial 180-day period, the Company does not have a right to prepay the note. The Company paid original issuance discount of $6,000 in connection with this note payable which was amortized over the term of the note. On October 18, 2021, the Note was amended whereby the lender extended the maturity date to April 18, 2022. The note amendment was accounted for as a debt modification in accordance with ASC 470-50 - Debt Modifications or Extinguishments and no gain or loss was recognized. On February 18, 2022, the Company and the lender entered into a second note amendment agreement to further extend the Notes maturity date from April 18, 2022 to December 31, 2022. As of September 30, 2022 and 2021, the principal balance of this note was $151,000.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nFor the years ended September 30, 2022 and 2021, amortization of debt discounts related to the notes payable amounted to $1,673 and $0, respectively, which was recorded as interest expense on the accompanying consolidated statements of operations. As of September 30, 2022 and 2021, the unamortized debt discounts were $14,827 and $0, respectively.\nAs of September 30, 2022 and 2021, accrued interest related to the notes payable amounted to $387,870 and $34,219, respectively, which was included in accrued interest on the accompanying consolidated balance sheets.\nLoans Payable\nOn September 30, 2022 and 2021, loans payable consisted of the following:\nSeptember 30,\nSeptember 30,\nLoans principal amount\n$ 483,500\n$ 483,500\nLoans payable\n$ 483,500\n$ 483,500\nBetween June and August 2017, through the Companys majority owned subsidiary, CFTB GA, the Company received proceeds aggregating $450,000 from an unrelated party (see below) for the purpose of completing the production of the Movie. Such loans bear no interest and are considered due on demand as there was no set maturity. The Company provided this lender a senior secured position with all the tax credits that will be due from the state of Georgia and city of Savannah and all excess deposits posted related to the filming of the Movie. In return for providing the additional loan, the Company agreed to; (1) issue a note payable of $25,000 to the lender and; (2) the lender shall be entitled to a 50% net profit from the Movie. During fiscal year 2017, the Company recorded capitalized interest of $25,000 in production film cost and a corresponding increase in debt of $25,000 in connection with the issuance of this loan bringing the loan balance to $475,000. The Company accounted for the above agreement in accordance with ASC 470-10-25, which requires that cash received from an investor in exchange for the future payment of a specified percentage or amount of future revenue shall be classified as debt. The Company does not purport the arrangements to be a sale and the Company has significant continuing involvement in the generation of cash flows due to the loan holder or investor. As of September 30, 2022 and 2021, loan payable amounted $475,000. As of September 30, 2022, no demand for payment has been made.\nIn April 2016, a former member of the Board of Directors advanced the Company $2,500 to cover the Companys working capital which is reflected as loan payable and is due on demand. As of September 30, 2022 and 2021, the advance had an outstanding balance of $2,500.\nOn July 1, 2020, the Company issued a Promissory Note to a former member of the Board of Directors, with a principal amount $11,000 to cover the Companys working capital. The note has a maturity date of August 13, 2033, which shall be paid in eleven annual installments of $1,000 commencing August 2022. In 2020, the Company repaid $5,000 of the principal balance. As of September 30, 2022 and 2021, the note had a principal balance of $6,000.\nOn October 29, 2021, the Company issued a Promissory Note to a former member of the Board of Directors, with a principal amount $50,000 to cover the Companys working capital. The note matured on December 13, 2021. During the year ended September 30, 2022, the Company repaid the outstanding balance of the note. As of September 30, 2022, the note had no outstanding balance.\nNOTE 7 - RELATED PARTY TRANSACTIONS\nParties are considered to be related to the Company if the parties directly or indirectly, through one or more intermediaries, control, are controlled by, or are under common control with the Company. Related parties also include principal stockholders of the Company, its management, members of the immediate families of principal stockholders of the Company and its management and other parties with which the Company may deal where one-party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests. The Company discloses all related party transactions. All transactions shall be recorded at fair value of the goods or services exchanged. Property purchased from a related party is recorded at the cost to the related party and any payment to or on behalf of the related party in excess of the cost is reflected as compensation or distribution to related parties depending on the transaction.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nIn October 2015, the Company entered into an Employment Agreement (the Employment Agreement) with Mr. Brian Lukow, the CEO of the Company. As compensation for his services per the terms of the Employment Agreement, the Company shall pay $5,000 per month and 20,000 shares of the Companys common stock per month (see Note 8). The Employment Agreement may be terminated by either party upon two months written notice. On February 16, 2018, the Company amended this Employment Agreement to increase Mr. Lukows base salary from $5,000 to $8,000 per month. As of September 30, 2022 and 2021, accrued salaries to Mr. Lukow amounted to $81,556 and $81,556, respectively, and was included in accounts payable and accrued liabilities - related party on the accompanying consolidated balance sheets.\nIn December 2015, the Company executed a month-to-month operating lease agreement with the CEO of the Company. The lease premise is located in Mt. Kisco, New York and the initial term was for a period of 12 months commencing in December 2015 and expiring in December 2016. The lease is currently on a month-to-month basis. The lease requires the Company to pay a monthly base rent of $1,000. The Company has recorded rent expense of $12,000 and $12,000 for the years ended September 30, 2022 and 2021, respectively, which was included as rent expense under general and administrative expense in the accompanying consolidated statements of operations. As of September 30, 2022 and 2021, the Company had accrued rent balance of $28,000 and $27,500, respectively, which is reflected as accounts payable and accrued liabilities - related party on the accompanying consolidated balance sheets.\nThe CEO of the Company, who is the creator, writer and also acted as a producer of the Crazy for The Boys movie is entitled to receive a writers fee of $25,000 and producers fee of $100,000 to be paid from gross revenues derived from the Crazy for The Boys movie or the sale of ancillary products. As of September 30, 2022 and 2021, the Company had an accrued balance of $125,000 included in accounts payable and accrued expenses - related party on the accompanying consolidated balance sheets, for services rendered by the CEO of the Company.\nOn April 1, 2018, the Company issued a due on demand 5% promissory note to an affiliated company for $200,000. The Company may prepay the note without a prepayment penalty. The former COO of the Company is a trustee of the affiliated company. The Company and former COO entered into separation agreement in January 2018 (see Note 6 and 9).\nIn 2020, the CEO advanced to the Company $1,201 and an additional $5,316 in 2021, for a total of $6,517 for working capital purposes which is reflected as due to related parties. The advanced is non-interest bearing and are due on demand. As of September 30, 2022 and 2021, this advance had a balance of $6,517.\nNOTE 8 - STOCKHOLDERS DEFICIT\nOn November 1, 2021, the Company filed an amendment to its Articles of Incorporation increasing the Companys authorized common stock from 4,200,000,000 to 19,000,000,000 shares.\nCommon Stock\nCommon Stock Issued for Services to Employee and Directors\n·\nDuring the year ended September 30, 2021, the Company issued an aggregate of 48,000 shares of the Companys common stock to two directors of the Company as payment for services rendered pursuant to corporate director agreements (see Note 9). The Company valued these common shares at the fair value ranging from $0.0001 to $0.0015 per common share or $46 based on the quoted trading price on the dates of grants. The Company recorded stock-based compensation expense of $46 during the year ended September 30, 2021.\n·\nDuring the year ended September 30, 2021, the Company issued an aggregate of 240,000 shares of the Companys common stock to the CEO as payment for services rendered pursuant to an Employment agreement (see Note 9). The Company valued these common shares at the fair value ranging from $0.0001 to $0.0015 per common share or $239 based on the quoted trading price on the dates of grants. The Company recorded stock-based compensation of $239 during the year ended September 30, 2021.\n·\nDuring the year ended September 30, 2022, the Company issued an aggregate of 240,000 shares of the Companys common stock to the CEO as payment for services rendered pursuant to an Employment agreement (see Note 9). The Company valued these common shares at the fair value ranging from $0.0001 to $0.0008 per common share or $54 based on the quoted trading price on the dates of grants. The Company recorded stock-based compensation of $54 during the year ended September 30, 2022.\n·\nDuring the year ended September 30, 2022, the Company issued an aggregate of 48,000 shares of the Companys common stock to two directors of the Company as payment for services rendered pursuant to corporate director agreements (see Note 9). The Company valued these common shares at the fair value ranging from $0.0001 to $0.0008 per common share or $8 based on the quoted trading price on the dates of grants. The Company recorded stock-based compensation of $8 during the year ended September 30, 2022.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nCommon Stock Issued Upon Conversion of Convertible Notes Payable\n·\nDuring the year ended September 30, 2021, the Company issued an aggregate of 1,896,364,333 shares of the Companys common stock to various note holders upon the conversion of $265,293 of principal amount, $135,917 of accrued interest and $2,000 of conversion fee, pursuant to the conversion terms of the convertible notes which contained embedded derivatives (see Note 5). The Company valued these shares of common stock at the fair value ranging from 0.0009 to $0.0027 per share or $2,217,080 based on the quoted trading price on the date of the conversions. Accordingly, the Company recorded the difference between the converted amount and the fair value of the common stock issued as a loss from extinguishment of debt which amounted to $(1,813,870) and derivative fair value of $5,430,054 was recorded as a gain from extinguishment, with the net gain from extinguishment of debt related to note conversions amounting to $3,616,184 during the year ended September 30, 2021.\n·\nDuring the year ended September 30, 2022, the Company issued an aggregate of 3,612,818,070 shares of the Companys common stock to a note holder upon the conversion of $289,880 of principal amount, $98,256 of accrued interest and $7,010 of conversion fee, pursuant to the conversion terms of the convertible notes which contained embedded derivatives (see Note 5). The Company valued these shares of common stock at the fair value ranging from $0.0001 to $0.0008 per share or $893,853 based on the quoted trading price on the date of the conversions. Accordingly, the Company recorded the difference between the converted amount and the fair value of the common stock issued as a loss from extinguishment of debt which amounted to $498,707, and upon conversion of convertible notes to common shares, on the conversion dates, the Company revalued the derivative liabilities and recorded a gain from extinguishment of debt of $579,759 related to the removal of derivative liabilities, for a net gain on extinguishment of debt of $81,052. In summary, the net gain on extinguishment of debt upon the conversion of debt to common shares of $81,052 plus the gain on extinguishment of debt of $3,854,577 upon conversion of certain convertible notes to non-convertible notes (see Note 5) aggregates to a net gain on extinguishment of debt of $3,935,629 which is reflected on the accompanying consolidated statement of operations for the year ended September 30, 2022.\nCommon Stock Issued for Professional Services\n·\nDuring the year ended September 30, 2022, the Company issued an aggregate of 233,333,336 shares of the Companys common stock to two consultants, pursuant to a consulting agreement dated March 14, 2022 (see Note 9) with aggregate grant date fair value of $36,668 or $0.0001 to $0.0002 per share, based on the quoted trading price of the Companys common stock, which was recorded as deferred compensation and was amortized over the service term. During the year ended September 30, 2022, the Company recorded stock-based professional fees of $36,668 on the accompanying consolidated statement of operations.\nAs of September 30, 2022, the Company had 8,035,665,831 common stock outstanding of which 141,123,669 shares are unissued.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nStock Warrants\nA summary of outstanding stock warrants as of September 30, 2022 and 2021, and changes during the period ended are presented below:\nNumber of\nWarrants\nWeighted\nAverage\nExercise\nPrice\nWeighted\nAverage\nRemaining\nContractual\nLife\n(Years)\nBalance on September 30, 2020\n1,600,000\n$ 0.061\n3.65\nGranted\n-\n-\n-\nBalance on September 30, 2021\n1,600,000\n$ 0.061\n2.65\nGranted\n-\nBalance on September 30, 2022\n1,600,000\n$ 0.061\n1.65\nWarrants exercisable on September 30, 2022\n1,600,000\n$ 0.061\n1.65\nWeighted average fair value of warrants granted during the period\n-\n$ 0.00\nIn April 2018, the Company entered into an amendment agreement with a certain note holder of convertible notes issued in July 2017 and September 2017, whereby the Company agreed to grant 5 year 400,000 warrants to purchase the Companys common stock. The warrants have a term of 5 years from the date of grant and was exercisable at an exercise price of $0.20. The Company determined that the terms of the warrants granted discussed above include a down-round provision under which the exercise price could be affected by future equity offerings undertaken by the Company which cause the warrants to be accounted for as derivative liabilities.\nIn October 2019, the Company granted warrant to purchase 1,200,000 of the Companys common stock in connection with the issuance of a convertible note (see Note 5). The warrant expires five years from the date of grant and has an exercise price of $0.015. The exercise price and the number of warrants is subject to adjustment pursuant to anti-dilution protection provision and other provisions as defined in the stock warrant agreement.\nThe Company accounted for all outstanding warrants as a derivative liability since there were not enough authorized shares to cover all common stock equivalents (See Note 6 under Derivative Liabilities Pursuant to Convertible Notes and Warrants above).\n2017 Stock Incentive Plan\nIn February 2017, the Companys Board of Directors authorized the 2017 Incentive Stock Plan covering 1,000,000 shares of common stock. The purpose of the plan is designed to retain directors, executives and selected employees and consultants and reward them for making major contributions to the success of the Company. These objectives are accomplished by making long-term incentive awards under the Plan thereby providing Participants with a proprietary interest in the growth and performance of the Company. As of September 30, 2022, no stock has been issued under this plan.\nNOTE 9 - COMMITMENTS AND CONTINGENCIES\nEmployment Agreement\nIn October 2015, the Company entered into an Employment Agreement (the Employment Agreement) with Mr. Brian Lukow, the CEO of the Company. As compensation for his services per the terms of the Employment Agreement, the Company shall pay $5,000 per month and 20,000 shares of the Companys common stock per month (see Note 8). The Employment Agreement may be terminated by either party upon two months written notice. On February 16, 2018, the Company amended this Employment Agreement to increase Mr. Lukows base salary from $5,000 to $8,000 per month. As of September 30, 2022 and 2021, accrued salaries to Mr. Lukow amounted to $81,556 and $81,556, respectively, and was included in accounts payable and accrued liabilities - related party in the accompanying consolidated balance sheets (see Note 7).\nCorporate Director Agreements\nIn October 2015, the Company entered into three corporate director agreements with Mr. Brian Lukow, Mr. Brian Gold and Ms. Aimee OBrien to serve as members of the Companys board of directors. The term of the agreements shall continue until September 30, 2016, unless earlier terminated by the Company. The term shall be automatically renewed for as long as the board of directors are re-elected or otherwise serve as members of the board of directors of the Company. As compensation for their services per the terms of their respective corporate director agreements, the Company pays fees to (i) Mr. Lukow of 2,000 shares of the Companys common stock per month, (ii) Ms. OBrien of 2,000 shares of the Companys common stock per month, and (iii) Mr. Gold of 2,000 shares of the Companys common stock per month during the month of service. Pursuant to the agreement, the director who will introduce and arrange for equity funding and acquisitions shall be entitled with a 10% commission fee as defined in the agreement. On August 29, 2019, the Company accepted the resignation of Brian Gold as a director of the Company.\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nOperating Agreement\nOn February 2, 2022, the Company and RA Production, Inc (RA Production) (collectively as Parties) entered into an Operating Agreement with Boss Music and Entertainment, LLC (BME), a Delaware limited liability company (see Note 1 and Note 4). Pursuant to the Operating Agreement, the Company has 50% interest in BME and shall contribute a total of $1,000,000 of towards the BME capital account payable as follows: (i) $200,000 upon signing hereof of the Operating Agreement and (ii) $800,000 payable on the full execution of recording agreements with five artists to form a recording group, (i.e. boy band). As of September 30, 2022, of the total $200,000 only $7,500 of capital contribution has been paid which was recorded as a loss on equity method investment in the accompanying consolidated statement of operations since the project was abandoned and no additional contributions will be made to BME.\nConsulting Agreements\nIn October 2016, the Company entered into a video production agreement with a third-party vendor. The vendor provided production and post-production services to the Company. The fees for such services were cash payment of $15,000 and 100,000 shares of the Companys common stock. The Company paid $15,000 during the fiscal year ended September 30, 2017. As of September 30, 2022 and 2021, the Company has not issued the 100,000 shares, but has accrued the value of the 100,000 shares of common stock upon completion of the services which amounted to $4,000 which was included in accounts payable and accrued liabilities as reflected on the accompanying consolidated balance sheets.\nOn March 14, 2022, the Company entered into a consulting agreement with two consultants (collectively as Parties) with a twelve-month term which shall end in March 2023. Pursuant to the consulting agreement the Company shall issue an aggregate of 400,000,000 shares of common stock over the twelve-month of the agreement. The Company issued an aggregate of 100,000,004 shares of common stock to with an aggregate grant date fair value of $20,000, to the consultants upon the close of the agreement which was recorded as deferred compensation (see Note 8) which was fully amortized during the nine months ended June 30, 2022. In addition, pursuant to the consulting agreement, the Company shall issue an aggregate of 299,999,996 shares of common stock to the consultants, over a nine-month period commencing on June 1, 2022. During the six months ended September 30, 2022, the Company granted 133,333,332 shares of commons stock with grant date fair value of $16,668 in connection with this consulting agreement (see Note 8).\nNOTE 10 - INCOME TAXES\nThe Company maintains deferred tax assets and liabilities that reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. The deferred tax assets on September 30, 2022 and 2021 consist of net operating loss carryforwards. The net deferred tax asset has been fully offset by a valuation allowance because of the uncertainty of the attainment of future taxable income.\nThe items accounting for the difference between income taxes at the effective statutory rate and the provision for income taxes for the years ended September 30, 2022 and 2021 were as follows:\nYears Ended\nSeptember 30,\nIncome tax provision (benefit) at U.S. statutory rate of 21%\n$ 385,454\n$ (654,249 )\nIncome tax provision (benefit) - State tax rate at 5%\n91,775\n(155,774 )\nNon-deductible expenses (gain)\n(588,758 )\n1,397,013\nIncrease (decrease) in valuation allowance\n111,529\n(586,990 )\nTotal provision for income tax\n$ -\n$ -\nThe Companys approximate net deferred tax asset as of September 30, 2022 and 2021 was as follows:\nAs of\nSeptember 30,\nNet operating loss carryforward\n$ 870,830\n$ 759,301\nValuation allowance\n(870,830 )\n(759,301 )\nNet deferred tax asset\n$ -\n$ -\nALL FOR ONE MEDIA CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 30, 2022\nThe net operating loss carryforward was $3,349,346 on September 30, 2022. The Company provided a valuation allowance equal to the deferred income tax asset for the year ended September 30, 2022 and 2021, because it was not known whether future taxable income will be sufficient to utilize the loss carryforward. The increase in the allowance was $111,529 in fiscal year 2022. The potential tax benefit arising from the loss carryforward of approximately $1,909,458 accumulated through September 30, 2018, will expire in 2037. The potential tax benefit arising from the net operating loss carryforward of $1,439,888 from the period following to the Acts effective date can be carried forward indefinitely within the annual usage limitations.\nAdditionally, the future utilization of the net operating loss carryforward to offset future taxable income may be subject to an annual limitation as a result of ownership changes that could occur in the future. If necessary, the deferred tax assets will be reduced by any carryforward that expires prior to utilization as a result of such limitations, with a corresponding reduction of the valuation allowance. The Company does not have any uncertain tax positions or events leading to uncertainty in a tax position. The Companys 2022, 2021, 2020 and 2019 Corporate Income Tax Returns are subject to Internal Revenue Service examination.\nNOTE 11 - SUBSEQUENT EVENTS\nIssuance of Common Stock\nSubsequent to September 30, 2022, the Company issued an aggregate of 72,000 shares of common stock to officers and directors as stock-based compensation with grant date fair value of $10, or between $0.0001 and $0.0002 per share, based on the quoted trading price of the Companys common stock.\nSubsequent to September 30, 2022, in connection with the March 14, 2022 consulting agreement (see Note 9), the Company granted 100,000,000 shares of commons stock with grant date fair value of $13,333, or between $0.0001 and $0.0002 per share, based on the quoted trading price of the Companys common stock."
}