{
    "cik": "1297937",
    "company": "PARKS AMERICA, INC",
    "filing_type": "10-K",
    "filing_date": "2023-12-12",
    "period_of_report": "2023-10-01",
    "sic": "7990",
    "state_of_inc": "NV",
    "state_location": "GA",
    "fiscal_year_end": "1001",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1297937/0001493152-23-044561-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1297937/000149315223044561/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1297937/0001493152-23-044561.txt",
    "filename": "1297937_10K_2023_0001493152-23-044561.htm",
    "content": "ITEM 1. BUSINESS\nOverview\nParks! America, Inc., through our wholly owned subsidiaries, owns and operates three regional safari parks and is in the business of acquiring, developing and operating local and regional entertainment assets in the United States. Our wholly owned subsidiaries are Wild Animal Safari, Inc., a Georgia corporation (Wild Animal - Georgia), Wild Animal, Inc., a Missouri corporation (Wild Animal - Missouri), and Aggieland-Parks, Inc., a Texas corporation (Aggieland Wild Animal - Texas). Wild Animal - Georgia owns and operates the Wild Animal Safari park in Pine Mountain, Georgia (the Georgia Park). Wild Animal - Missouri owns and operates the Wild Animal Safari park located in Strafford, Missouri (the Missouri Park). Aggieland Wild Animal - Texas owns and operates the Aggieland Wild Animal Safari park near Bryan/College Station, Texas (the Texas Park). We acquired our Georgia Park on June 13, 2005, our Missouri Park on March 5, 2008, and our Texas Park on April 27, 2020.\nOur parks are open year round, but experience increased seasonal attendance, typically beginning in the latter half of March through early September. Combined third and fourth quarter park revenues were 60.4% and 62.1% of annual park revenues for our 2023 and 2022 fiscal years, respectively. Since the acquisition of our Texas Park, the combined third and fourth quarter concentration of our park revenues has been reduced.\nOur business plan includes expansion via the acquisition of additional local or regional safari parks and entertainment assets. We believe acquisitions, if any, should not unnecessarily encumber the Company with additional debt that cannot be justified by current operations. We may also pursue contract management opportunities for themed attractions owned by third parties. By using a combination of equity, debt and other financing options, we intend to carefully monitor stockholder value in conjunction with the pursuit of growth.\nShares of our common stock trade on the OTC Markets Group OTCPink marketplace (OTCPink) under the symbol, PRKA.\nFor an overview of our business operations, see MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITIONS AND RESULTS OF OPERATIONS herein.\nCorporate History\nThe Company was originally incorporated on July 30, 1954 as Painted Desert Uranium & Oil Co., Inc. in Washington State. On October 1, 2002, Painted Desert Uranium & Oil Co., Inc. changed its name to Royal Pacific Resources, Inc. and its corporate domicile to the State of Nevada. On December 19, 2003, Royal Pacific Resources, Inc. acquired the assets of Great Western Parks LLC pursuant to a Share Exchange Agreement that set the stage for our current corporate structure and operating strategy. We changed the name of the Company to Great American Family Parks, Inc. The acquisition was accounted for as a reverse acquisition in which Great Western Parks was considered the acquirer of Royal Pacific Resources for reporting purposes. As of June 11, 2008, the Company changed its name from Great American Family Parks, Inc. to its current name, Parks! America, Inc. In addition, effective June 25, 2008, the Companys quotation symbol on the OTCPink was changed from GFAM to PRKA.\nWild Animal Safari, Inc. - Our Georgia Park\nOn June 13, 2005, Wild Animal - Georgia acquired our Georgia Park in Pine Mountain, Georgia. Our Georgia Park is situated within a 200-acre portion of a 500-acre plot, which is owned by Wild Animal - Georgia, located approximately 75 miles southwest of Atlanta. Our Georgia Park features a three-mile drive-through animal viewing area that opened in 1991. It is home to over 500 animals, birds and reptiles, comprised of over 65 species. Most of the animals roam wild in a natural habitat. Visitors can observe, photograph and feed the animals along the paved road that runs through the drive-through section of our Georgia Parks natural habitat area. Some animals are contained in special fenced-in exhibit areas within the natural habitat, drive-through section of our Georgia Park, while others are in a more traditional zoo-like walk through section of the park, the Walkabout Adventure Zoo, which also includes a reptile house, featuring reptiles from several continents.\nIn late March 2023, our Georgia Park experienced extensive damage, caused by an EF-3 tornado and over nine inches of rain, resulting in more than 4,500 fallen trees and damage to many of the Parks animal enclosures, fencing and other infrastructure. The Walkabout Adventure Zoo (Walkabout) portion of the property was particularly hard hit. Our Georgia Park was closed for 20 days, including for most of its traditionally busy spring break period, which has historically comprised approximately 10%-15% of its annual revenue. The drive-through safari section of the Georgia Park reopened on April 15th. The Walkabout portion of the park has reopened in phases, with the first phase on May 6th and the second phase on July 2nd. Approximately one-quarter of the Walkabout remains closed. Our 2024 fiscal year capital projects reflect further strategic rebuild of our Georgia Park following the March 2023 weather event and continue to set the stage for longer-term master planning.\nWild Animal, Inc. - Our Missouri Park\nWild Animal - Missouri purchased our Missouri Park as of March 5, 2008. Our Missouri Park is situated in Strafford, Missouri on 255 acres of land located 12 miles east of Springfield and approximately 45 miles north of Branson. Our Missouri Park features a five-mile drive-through wild animal viewing area that opened in 1971. It is home to approximately 350 animals, birds and reptiles, comprised of over 65 species. Most of the animals roam wild throughout a natural habitat. Visitors can observe, photograph and feed the animals along the paved road that runs throughout the drive-through section of our Missouri Parks natural habitat area. Some animals are contained in special fenced-in exhibit areas within the natural habitat, drive-through section of our Missouri Park and other animals are in a more traditional zoo-like walk through section of the park, the Walkabout Adventure Zoo, which also contains a reptile house, featuring reptiles from several continents.\nAggieland-Parks, Inc. - Our Texas Park\nAggieland Wild Animal - Texas acquired our Texas Park on April 27, 2020. Our Texas Park is situated on 250 acres of a 450-acre property, located approximately 25 miles northeast of Bryan/College Station, Texas and 120 miles northwest of downtown Houston. Our Texas Park features a two-and-a-half mile drive-through animal viewing area that opened in 2019. It is home to over 600 animals, birds and reptiles, comprised of over 70 species. Most of the animals roam wild throughout a natural habitat. Visitors can observe, photograph and feed the animals along a crushed-gravel road that runs throughout the drive-through section of our Texas Parks natural habitat area. Our Texas Park also includes a 20-acre Walkabout Adventure Zoo, featuring outdoor and indoor animal exhibits, a reptile house, an aviary, an extensive giraffe encounter area, an otter exhibit, and a large hippopotamus enclosure and pond.\nAnimal Park Operations\nPark revenues are primarily derived from admission fees, food and beverage sales, gift shop and specialty item sales, and sales of animal food. During our 2022 fiscal year, we introduced private and semi-private animal keeper guided animal encounters at each of our parks. We also introduced vehicle rentals at our Missouri and Texas Parks, which have been a customer favorite at our Georgia Park for over a decade. Managements plans to grow revenues at each of our parks include ongoing improvements to existing facilities, making each park more attractive to visitors and developing unused acreage. We also believe that increasing local and regional awareness of each park via advertising and promotion is a critical element of our revenue growth plans, especially for our Texas and Missouri Parks.\nIn addition to the animal environments, each of our parks contains a gift shop, a restaurant or concessions areas, and picnic areas. We sell food and beverages in our restaurants or concession areas, and a variety of items in our gift shops, including shirts, hats, plush, educational books, toys and novelty items, many of which are animal themed. Our 2024 fiscal year plans include the continuing renovation of Walkabout animal habitats and enclosures, especially at our Georgia Park following the impact of the March 2023 weather event, the rebuild of a new restroom building and main entry plaza at our Georgia park and maintenance capital on roadways and core infrastructure. Our plan to open a significant new giraffe exhibit at our Georgia Park during our 2022 fiscal year experienced delays due to a highly inflationary period for building materials and a challenging labor market. While we remain committed to this showcase attraction, the project has been further delayed due to the extensive damage and ongoing rebuild efforts following the March 2023 severe weather and tornado event. We expect to establish a revised timeline for this project during our 2024 fiscal year. Increasing attendance, and overall guest satisfaction, as well as increasing the per capita revenue generated in our gift shops and from concessions, continues to be a primary focus.\nMost of the animals at each of our parks have been born on-site or domestically acquired. We rarely import animals and have not imported any animals in the past 15 years. Auctions and sales of animals across the United States occur often and we may acquire animals in these auctions if we see an opportunity to enhance the animal population at our parks. As a result of natural breeding, animal populations at our Parks tend to grow over time. Periodically, we sell surplus animals, and the proceeds are recorded as revenue. The periodic acquisition and sale of animals is also part of our herd and genetic management program. From time-to-time, we may also relocate animals between our parks as part of this program. Each park is subject to routine inspection by federal and state agencies. Each park maintains a high standard of animal care and has passed all recent inspections.\nEmployees\nOur Georgia Park has approximately 25 full-time employees and engages 20-35 additional part-time and seasonal employees. Our Missouri Park has approximately 11 full-time employees and engages 6-12 additional part-time and seasonal employees. Our Texas Park has approximately 13 full-time employees and engages 8-12 additional part-time and seasonal employees. We also engage consultants from time to time. We have no collective bargaining agreements with our employees and believe our relations with our employees are good. Parks! America has two officers and one manager who oversee the strategy of the Company, the operations and capital investment activities of our parks, as well as the overall financial activities, controls and reporting for the Company and each park. ITEM 1A. RISK FACTORS\nYou should read the following discussion and analysis together with our consolidated financial statements and related notes included elsewhere in this Annual Report on Form 10-K. Some of the information contained in this discussion and analysis or set forth elsewhere in this Annual Report on Form 10-K, including information with respect to our plans and strategies for our business, includes forward-looking statements that involve risks and uncertainties. You should review the Risk Factors below for a discussion of important factors that could cause actual results to differ materially from the results described in or implied by the forward-looking statements contained in this report. If any of the following risks actually occur, our business, financial condition and results of operations could be adversely affected.\nRisk Factors Relating to Our Business:\nConditions beyond our control, including natural disasters or extreme weather, could damage our properties and could adversely impact attendance at our parks and result in decreased revenues.\nNatural disasters, public heath crises, epidemics, pandemics, such as the outbreak of COVID-19, terrorist activities, power outages or other events outside our control could disrupt our operations, impair critical systems, damage our properties or reduce attendance at our parks or require temporary park closures. Damage to our properties could take a long time to repair and there is no guarantee that we would have adequate insurance to cover the costs of repair or the expense of the interruption to our business. Furthermore, natural disasters such as fires, earthquakes, hurricanes or extreme weather events linked to climate change, may interrupt or impede access to our affected properties or require evacuations and may cause attendance at our affected properties to decrease for an indefinite period.\nFor example, during March 26-27, 2023, our Georgia Park experienced extensive damage, caused by an EF-3 tornado and over nine inches of rain, resulting in more than 4,500 fallen trees and damage to many of the Parks animal enclosures, fencing and other infrastructure. Our Georgia park was subsequently closed for 20 days, including for most of its traditionally busy spring break period, which has historically comprised approximately 10%-15% of its annual revenue. Also, during February 2021 our Texas Park was closed for several weeks, experienced power outages and sustained property damage associated with several severe winter storms.\nThe occurrence of such events could have a material adverse effect on our business, financial condition and results of operations. We cannot predict the frequency, duration or severity of these activities and the effect that they may have on our business, financial condition or results of operations.\nGeneral economic conditions may have an adverse impact on our business, financial condition or results of operations.\nOur business and operating results can be impacted by a number of macroeconomic factors, including but not limited to consumer confidence and spending levels, tax rates, unemployment, consumer credit availability, raw materials costs, pandemics (such as the COVID-19 pandemic) and natural disasters, fuel and energy costs (including oil prices), and credit market conditions. A general economic slowdown or recession resulting in a decrease in discretionary spending could adversely affect the frequency with which guests choose to visit our parks and the amount that our guests spend when they visit. Our ability to source supplies, materials and services at reasonable costs and in a timely manner could be impacted by adverse economic conditions in the U.S. and abroad. For example, our ability to obtain gift shop merchandise was adversely impacted by supply chain distributions at least in part attributed to collateral impacts from COVID-19. Similarly, our plans to open a new giraffe exhibit at out Georgia Park experienced delays during our 2022 fiscal year, in large part due building material price increases and labor storages in the construction industry.\nThe Theme Park Industry is highly competitive, and we may be unable to compete effectively.\nThe theme park industry is highly competitive, highly fragmented, rapidly evolving, and subject to technological change and intense marketing by providers with similar products. One of our competitors for attracting general recreation dollars, Callaway Gardens, is located within five miles of our Georgia Park. In May 2018, Great Wolf Resorts opened an expansive lodge and indoor waterpark within 10 miles of our Georgia Park. In September 2017, the founder of Bass Pro Shops opened Johnny Morris Wonders of Wildlife National Museum and Aquarium, approximately 12 miles from our Missouri Park in Springfield, Missouri. Branson, Missouri is located just 45 minutes from our Missouri Park. There are a variety of animal attractions throughout southeastern Texas; the nearest is Franklin Drive Thru Safari, within a 35-40 minute drive of our Texas Park. Many of our current competitors are significantly larger and have substantially greater market presence as well as greater financial, technical, operational, marketing and other resources and experience than we have. In the event that a competitor expends significant sales and marketing resources in one or several markets we may not be able to compete successfully in such markets. We believe that competition will continue to increase, potentially placing downward pressure on prices. Such pressure could adversely affect our gross margins if we are not able to reduce costs commensurate with such price reductions. In addition, the pace of technological change makes it impossible for us to predict whether we will face new competitors using different technologies to provide the same or similar products offered or proposed to be offered by us. If our competitors were to provide better and more cost effective products, our business could be materially and adversely affected.\nWe face strong competition from numerous entertainment alternatives.\nIn addition to competing with other themed and amusement parks, our venues compete with other types of recreational venues and entertainment alternatives, including but not limited to movies, sports attractions, vacation travel and video games. There can be no assurance that we will successfully differentiate ourselves from these entertainment alternatives or that consumers will consider our entertainment offerings to be more appealing than those of our competitors. The increasing availability and quality of technology-based entertainment has provided families with a wider selection of entertainment alternatives in their homes, including home entertainment units, in-home and online gaming, as well as on-demand streaming video and related access to various forms of entertainment. In addition, traditional theme parks have been able to reduce the cost and increase the variety of their attractions by implementing technologies that cannot be readily incorporated by wild animal attractions such as our parks.\nThe suspension or termination of any of our business licenses may have a negative impact on our business.\nWe maintain a variety of business licenses issued by federal, state and local government agencies that are required to be renewed periodically. We cannot guarantee that we will be successful in renewing all our licenses on a periodic basis. The suspension, termination or expiration of one or more of these licenses could have a significant adverse effect on our revenues and profits. In addition, any changes to the requirements for any of our licenses could affect our ability to maintain the licenses.\nOur insurance coverage may not be adequate to cover all possible losses that we could suffer, and our insurance costs may increase.\nCompanies engaged in the theme park business may be sued for substantial damages in the event of an actual or alleged accident. An accident occurring at our parks or at competing parks may reduce attendance, increase insurance premiums, and negatively impact our operating results. Our properties contain drive-through, safari style animal parks, and there are inherent risks associated with allowing the public to interact with animals. Although we carry liability insurance to cover this risk, there can be no assurance that our coverage will be adequate to cover liabilities, or that we will be able to afford or obtain adequate coverage should a catastrophic incident occur.\nWe currently have $6.0 million of liability insurance per occurrence, which is capped at $10.0 million in aggregate. We will continue to use reasonable commercial efforts to maintain policies of liability, fire and casualty insurance sufficient to provide reasonable coverage for risks arising from accidents, fire, weather, other acts of God, and other potential casualties. There can be no assurance that we will be able to obtain adequate levels of insurance to protect against suits and judgments in connection with accidents or other disasters that may occur in our parks.\nWe may not identify or complete acquisitions in a timely, cost-effective manner, if at all.\nOur business plan includes expansion via the acquisition of additional local or regional entertainment assets and attractions. There can be no assurance that we will be successful in acquiring and operating additional local or regional entertainment assets and attractions. Competition for acquisition opportunities in the attractions industry is intense as there are a limited number of parks within the United States that could reasonably qualify as acquisition targets for us. Our acquisition strategy is dependent upon, among other things, our ability to: identify acquisition opportunities; obtain debt and equity financing; and obtain necessary regulatory approvals. Our ability to pursue our acquisition strategy may be hindered if we are not able to successfully identify acquisition targets or obtain the necessary financing or regulatory approvals, including but not limited to those arising under federal and state antitrust and environmental laws.\nSignificant amounts of additional financing may be necessary for the implementation of our Business Plan.\nThe Company may require additional debt and equity financing to pursue its business plan. There can be no assurance that we will be successful in obtaining additional financing. Lack of additional funding could force us to substantially curtail our expansion plans. Furthermore, the issuance by the Company of any additional securities would dilute the ownership of existing stockholders and may affect the price of our common stock.\nOur ownership of real property subjects us to environmental regulation, which creates uncertainty regarding future environmental expenditures and liabilities.\nWe may be required to incur costs to comply with environmental requirements, such as those relating to discharges to air, water and land; the handling and disposal of solid and hazardous waste; and the cleanup of properties affected by hazardous substances. Under these and other environmental requirements we may be required to investigate and clean up hazardous or toxic substances or chemical releases at one of our properties. As an owner or operator, we could also be held responsible to a governmental entity or third party for property damage, personal injury and investigation and cleanup costs incurred by them in connection with any contamination. Environmental laws typically impose cleanup responsibility and liability without regard to whether the owner or operator knew of or caused the presence of the contaminants. The liability under environmental laws has been interpreted to be joint and several unless the harm is divisible and there is a reasonable basis for allocation of the responsibility. The costs of investigation, remediation or removal of those substances may be substantial, and the presence of those substances, or the failure to remediate a property properly, may impair our ability to use our property. We are not currently aware of any material environmental risks regarding our properties. However, we may be required to incur costs to remediate potential environmental hazards or to mitigate environmental risks in the future.\nWe are dependent upon the services of our Executive Officers, key personnel and consultants.\nOur success is heavily dependent on the continued active participation of our executive officers. Loss of the services of one or more of these officers could have a material adverse effect upon our business, financial condition or results of operations. Further, our success and achievement of our growth plans depend on our ability to recruit, hire, train and retain other highly qualified technical and managerial personnel. Competition for qualified employees among companies in the theme park industry is intense, and the loss of any such persons, or an inability to attract, retain and motivate any additional highly skilled employees required for the expansion of the Companys activities, could have a materially adverse effect on the Company. The inability of the Company to attract and retain the necessary personnel, and consultants and advisors could have a material adverse effect on the Companys business, financial condition or results of operations.\nIncreased labor and employee benefit costs may negatively impact our results of operations. We also depend on a seasonal workforce, many of whom are paid at or near minimum wage.\nLabor is a primary component in the cost of operating our business. Our ability to control labor costs is subject to numerous external factors, including market pressures with respect to prevailing wage rates, unemployment levels, and health and other insurance costs, as well as the impact of legislation or regulations governing labor relations, minimum wage, and healthcare benefits. Furthermore, our operations are dependent in part on a seasonal workforce, many of whom are paid at or near minimum wage. We seek to manage seasonal wages and the timing of the hiring process to ensure the appropriate workforce is in place for peak and low seasons; however, we may be unable to recruit and hire sufficient personnel to meet our business needs. In addition, we cannot guarantee that material increases in the cost of securing our workforce will not occur in the future. Increased state or federal minimum wage requirements, general wages or an inadequate workforce could have an adverse impact on our results of operations. We anticipate that the recent upward pressures on general wage rates may increase our salary, wage and benefit expenses in our 2024 fiscal year and beyond, and further legislative changes or competitive wage rates could continue to increase these expenses in the future.\nData privacy regulation and our ability to comply could harm our business.\nWe (or third parties on our behalf) collect, store and use personal information and other customer data we receive through online ticket sales, marketing, mailing lists, and guest reservations. There are multiple federal, state and local laws regarding privacy and protection of personal information and data, and these laws and regulations continue to evolve. For example, many states have passed laws requiring notification to customers when there is a security breach involving their personal data and multiple jurisdictions are considering legislation that may impose liability if a business fails to properly safeguard personal information of its customers. Maintaining compliance with applicable security and privacy regulations may increase our operating costs. While we believe our cybersecurity measures are adequate, however, if we were to experience a data breach, we could be subject to fines, penalties and/or costly litigation.\nRisk Factors Relating to Our Common Stock:\nOur Common Stock is subject to the penny stock rules of the SEC and the trading market in our Common Stock is limited, which makes transactions in our Common Stock cumbersome and may reduce the value of an investment in our Common Stock.\nOur common stock is considered a penny stock and the sale of our stock by you will be subject to the penny stock rules of the SEC. The penny stock rules require broker-dealers to take steps before making any penny stock trades in customer accounts. As a result, the market for our shares could be illiquid and there could be delays in the trading of our stock, which would negatively affect your ability to sell your shares and could negatively affect the trading price of your shares.\nWe do not expect to pay dividends for some time, if at all.\nAs of the date of this report, no cash dividends have been paid on our common stock. We expect that any income from operations will be devoted to our future operations and growth, as well as to service our debt. We do not expect to pay cash dividends in the near future. Any future determination as to the payment of dividends on our common stock will be at the discretion of our Board of Directors and will depend on our earnings, operating and financial condition, capital requirements and other factors deemed relevant by our Board of Directors. The provisions of credit agreements, which we may enter from time to time, may also restrict the declaration of dividends on our common stock. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone ITEM 2. PROPERTIES\nThe Company owns and operates the following wild animal safari parks:\nWild Animal Safari, Inc. - Our Georgia Park\nOur Georgia Park is situated within a 200-acre portion of a 500-acre plot, which is owned by Wild Animal - Georgia, located approximately 75 miles southwest of Atlanta. Our Georgia Park features a three-mile drive-through animal viewing area that opened in 1991. Some animals are contained in special fenced-in exhibit areas within the natural habitat, drive-through section of our Georgia Park, while others are in a more traditional zoo-like walk through section, the Walkabout Adventure Zoo, which also includes a reptile house, featuring reptiles from several continents. In addition to the animal environments, our Georgia Park contains a gift shop, a restaurant and picnic areas.\nWild Animal, Inc. - Our Missouri Park\nOur Missouri Park is situated in Strafford, Missouri on 255 acres of land located 12 miles east of Springfield and approximately 45 miles north of Branson. Our Missouri Park features a five-mile drive-through wild animal viewing area that opened in 1971 Some animals are contained in special fenced-in areas within the natural habitat, drive-through section of our Missouri Park and other animals are in a more traditional zoo-like atmosphere, the Walkabout Adventure Zoo, which also contains a reptile house, featuring reptiles from several continents. Our Missouri Park also has a gift shop, a restaurant, several party rooms for rental and a play structure.\nAggieland-Parks, Inc. - Our Texas Park\nOur Texas Park is situated on 250 acres of a 450-acre property, located approximately 25 miles northeast Bryan/College Station, Texas and 120 miles northwest of downtown Houston. Our Texas Park features a two-and-a-half mile drive-through animal viewing area that opened in 2019. Our Texas Park includes a 20-acre Walkabout Adventure Zoo, featuring outdoor and indoor animal exhibits, a reptile house, an aviary, an extensive giraffe encounter area, an otter exhibit, and a large hippopotamus enclosure and pond. Our Texas Park also includes a gift shop, several party rooms for rental, a large, covered patio and a playground. ITEM 3. LEGAL PROCEEDINGS\nOn December 16, 2022, we received notice that on August 10, 2022 a former employee of Aggieland Wild Animal - Texas, filed a Complaint in the 361st District Court of Brazos County, Texas (case no. 22-001839-CV-361), alleging the Company and Aggieland-Parks, Inc. committed several instances of employment discrimination. The Complaint seeks unspecified economic, compensatory and punitive damages, as well as attorneys fees and costs. We are defending this claim.\nOn February 17, 2021, two children of James Meikle, our former Chief Operating Officer, filed a Complaint in the Eighth Judicial District Court, Clark County, Nevada (case no. A-21-829563-C), alleging we were obligated under Mr. Meikles Employment Agreement to purchase at least $540,000 of life insurance for Mr. Meikle, who passed away on November 28, 2018. The Complaint was seeking damages of $540,000, as well as interest and expenses. The trial date was set for August 15, 2022. Effective August 5, 2022, we agreed to pay the plaintiffs $100,000 to settle this Compliant and obtain a full release for any related complaints. The release was completed August 26, 2022, we issued payment for the settlement amount on August 31, 2022 and an order of dismissal was filed on September 19, 2022.\nOther Matters\nExcept as noted above, we are not a party to any pending legal proceeding, nor are any of our properties the subject of a pending legal proceeding, that is not in the ordinary course of business or otherwise material to the financial condition of its business. None of our directors, officers or affiliates is involved in a proceeding adverse to our business or has a material interest adverse to our business. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable\nPART II ITEM 5. MARKET FOR COMMON EQUITY, RELATED STOCKHOLDERS MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock trades on the OTCPink under the symbol PRKA. The table below sets forth, for the periods indicated, the high and low closing prices per share of our common stock as reported on the OTCPink. These quotations reflect prices between dealers, do not include retail mark-ups, markdowns, and commissions and may not necessarily represent actual transactions. The prices are adjusted to reflect all stock splits. As of October 1, 2023, there were 75,517,763 shares outstanding held by approximately 3,200 stockholders of record. The number of stockholders of record does not reflect shares held beneficially or those shares held in street name.\nHigh Low\nFirst Quarter $ 0.430 $ 0.330\nSecond Quarter $ 0.470 $ 0.325\nThird Quarter $ 0.400 $ 0.320\nFourth Quarter $ 0.428 $ 0.260\nFirst Quarter $ 0.740 $ 0.524\nSecond Quarter $ 0.630 $ 0.429\nThird Quarter $ 0.530 $ 0.328\nFourth Quarter $ 0.475 $ 0.320\nWe do not currently pay any dividends on our common stock, and for the foreseeable future we intend to retain future earnings, if any, for use in our business. Any future determination as to the payment of dividends on our common stock will be at the discretion of our Board of Directors and will depend on our earnings, operating and financial condition, capital requirements and other factors deemed relevant by our Board of Directors. The provisions of our credit agreements, which we may enter into from time to time, may also restrict the declaration of dividends on our common stock. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagements discussion and analysis of results of operations and financial condition (MD&A) is a supplement to the accompanying consolidated financial statements and provides additional information on our businesses, current developments, financial condition, cash flows and results of operations. The following discussion should be read in conjunction with our consolidated financial statements for the fiscal year ended October 1, 2023 provided in this Annual Report on Form 10-K. Certain statements contained herein may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements involve a number of risks, uncertainties and other factors that could cause actual results to differ materially, as discussed more fully herein.\nThe forward-looking information set forth in this Annual Report on Form 10-K is based on managements current views and assumptions regarding future events, and speak only as of the date of this report. We assume no obligation to update any of these forward-looking statements to reflect actual results, changes in assumptions or changes in other factors affecting these forward-looking statements, except as required by applicable law, including the securities laws of the United States and the rules and regulations of the SEC. More information about potential factors that could affect our business and financial results is included in the section entitled Risk Factors in this Annual Report on Form 10-K.\nOverview\nThrough our wholly owned subsidiaries, we own and operate three regional safari parks and are in the business of acquiring, developing and operating local and regional entertainment assets and attractions in the United States. Our wholly owned subsidiaries are Wild Animal Safari, Inc., a Georgia corporation (Wild Animal - Georgia), Wild Animal, Inc., a Missouri corporation (Wild Animal - Missouri), and Aggieland-Parks, Inc., a Texas corporation (Aggieland Wild Animal - Texas). Wild Animal - Georgia owns and operates the Wild Animal Safari park in Pine Mountain, Georgia (the Georgia Park). Wild Animal - Missouri owns and operates the Wild Animal Safari park located in Strafford, Missouri (the Missouri Park). Aggieland Wild Animal - Texas owns and operates the Aggieland Wild Animal Safari park near Bryan/College Station, Texas (the Texas Park). On April 27, 2020, we acquired substantially all the assets of Aggieland Safari LLC and related entities (Aggieland Safari).\nOur parks are open year round, but experience increased seasonal attendance, typically beginning in the latter half of March through early September. Combined third and fourth quarter park revenues were 60.4% and 62.1% of annual park revenues for our 2023 and 2022 fiscal years, respectively. Since the acquisition of our Texas Park, the combined third and fourth quarter concentration of our park revenues has been reduced.\nDuring March 26-27, 2023, our Georgia Park experienced extensive damage, caused by an EF-3 tornado and over nine inches of rain, resulting in more than 4,500 fallen trees and damage to many of the Parks animal enclosures, fencing and other infrastructure. The Walkabout Adventure Zoo (Walkabout) portion of the property was particularly hard hit. Our Georgia Park was closed for 20 days, including for most of its traditionally busy spring break period, which has historically comprised approximately 10%-15% of its annual revenue. The drive-through safari section of the Georgia Park reopened on April 15th. The Walkabout portion of the Park has reopened in phases, with the first phase on May 6th and the second phase on July 2nd. Approximately one-quarter of the Walkabout remains closed.\nThe table below outlines our annual net sales, reported and adjusted income before income taxes, earnings before interest, taxes, depreciation and amortization (EBITDA), and net cash provided by operating activities for the last five fiscal years. Attendance at our parks benefited in 2020 and 2021 from the COVID-19 pandemic which drove an increase in demand for outdoor entertainment. Our park revenue remains above pre-pandemic levels, however, is down from the high in 2021. In 2023, our park revenue was negatively impacted by approximately $1.0 million at our Georgia Park from the March severe weather and tornado event, subsequent closure and multi-phased reopening.\nFiscal Year\n2020\nTotal revenues $ 9,440,248 $ 10,741,417 $ 11,862,491 $ 9,507,264 $ 6,184,254\n% change -12.1 % -9.5 % 24.8 % 53.7 % 2.3 %\nReported income (loss) before income taxes (572,421 ) 1,030,291 3,680,546 3,693,869 1,495,438\n% change na -72.0 % -0.4 % 147.0 % 5.1 %\n% of total revenues -6.1 % 9.6 % 31.0 % 38.9 % 24.2 %\nAdjusted income (loss) before income taxes (*) (203,466 ) 1,130,291 3,490,558 3,669,496 1,575,882\n% change na -67.6 % -4.9 % 132.9 % 1.5 %\n% of total revenues -2.2 % 10.5 % 29.4 % 38.6 % 25.5 %\nEBITDA 1,220,535 2,168,161 4,620,623 4,457,682 2,138,546\n% change -43.7 % -53.1 % 3.7 % 108.4 % -2.3 %\n% of total revenues 12.9 % 20.2 % 39.0 % 46.9 % 34.6 %\nNet cash provided by operating activities 927,478 1,540,719 3,308,718 3,680,401 1,858,158\n% change -39.8 % -53.4 % -10.1 % 98.1 % 5.1 %\n% of total revenues 9.8 % 14.3 % 27.9 % 38.7 % 30.0 %\n* Excludes net tornado expenses and asset write-offs of $368,955 in 2023, a $100,000 legal settlement charge in 2022, a $189,988 gain on extinguishment of debt in 2021, $24,373 of tornado related insurance proceeds in 2020, and $80,444 of tornado damage asset write-offs and costs in 2019.\nEBITDA is not a measurement of operating performance computed in accordance with generally accepted accounting principles (GAAP) and should not be considered as a substitute for operating income, net income or cash flows from operating activities computed in accordance with GAAP. We believe that EBITDA is a meaningful measure as it is widely used by analysts, investors and comparable companies in the entertainment and attractions industry to evaluate our operating performance on a consistent basis, as well as more easily compare our results with those of other companies in our industry. We also believe EBITDA is a meaningful measure of park-level operating profitability. EBITDA is a supplemental measure of our operating results and is not intended to be a substitute for operating income, net income or cash flows from operating activities as defined under GAAP.\nThe following table provides a reconciliation of our income before income taxes to our EBITDA for our five most recent fiscal years:\nFiscal Year\n2020\nIncome (loss) before income taxes $ (572,421 ) $ 1,030,291 $ 3,680,546 $ 3,693,869 $ 1,495,438\nInterest expense 222,396 261,621 335,944 182,926 76,003\nDepreciation and amortization 884,459 782,987 704,016 576,139 453,968\n(Gain) loss on disposal of operating assets, net 317,146 (6,738 ) 90,105 29,121 32,693\nTornado damage and expenses, net 368,955 - - (24,373 ) 80,444\nLegal settlement - 100,000 - - -\nGain on extinguishment of debt - - (189,988 ) - -\nEBITDA $ 1,220,535 $ 2,168,161 $ 4,620,623 $ 4,457,682 $ 2,138,546\nFor the year ended October 1, 2023, we incurred $780,941 of Georgia Park severe weather and tornado related expenses, primarily due to tree and other debris removal, repairing and replacing underground water pipes throughout the property, as well as general clean-up efforts. In addition, related asset write-offs of $275,297, primarily associated with damage to various animal exhibits, several buildings, fencing and other infrastructure. These expenses and asset write-offs were partially offset by insurance proceeds totaling $687,283, net of deductibles and co-insurance. During our 2023 fiscal year we also made capital investments of approximately $615,000 at our Georgia Park for rebuilding projects as a direct result of the tornado event.\nAs a result of the near-term needs associated with the tornado recovery effort at our Georgia Park, we revised our 2023 fiscal year capital investment plan. Two significant new marketable attractions in our Georgia Park Walkabout, an enhanced ring-tailed lemur exhibit and new aviary, featuring macaws and a budgie parrot feeding experience, were not significantly impacted by the tornado event and opened on May 6, 2023. In addition, a new marquee otter exhibit opened in May 2023 at our Missouri Park Walkabout and a fourth drive-through pasture at our Texas Park opened in early March 2023, allowing guests to feed zebras and camels directly from their vehicles.\nOur 2023 fiscal year capital also included investment in fleet vehicles, roadways and other necessary safety-related capital projects. Due to the significant unplanned spending driven by the Georgia severe weather and tornado event, we paused our project related to accessing public water in Texas as well as several other minor projects to manage cash flow. Our plan to open a significant new giraffe exhibit at our Georgia Park, initiated during our 2022 fiscal year, experienced delays due to a highly inflationary period for building materials and a challenging labor market. While we remain committed to this showcase attraction, the severe weather and tornado event caused the management team to reprioritize capital projects. We also mutually agreed to terminate the contract with the initial design and general contracting partner for this project, resulting in a $196,000 project cost write-off. We expect to establish a revised timeline for a new giraffe exhibit at our Georgia Park during our 2024 fiscal year.\nOur 2024 fiscal year capital plan reflects the further strategic rebuild of our Georgia Park following the March 2023 severe weather event and continues to set the stage for longer-term master planning and optimization at each of our parks. The centerpiece of our 2024 capital plan is a new restroom building and main entry plaza at our Georgia Park. The existing restroom building was near the end of its useful life, and the tornado damage rendered it beyond repair. We believe this investment is paramount in improving the overall guest experience and will pave the way for a new standard. The new main entry plaza will provide an improved arrival experience and a place for our guests to dwell, which we believe will positively impact our Georgia Park for decades to come.\nAlso in Georgia, our carnivore night house will be rebuilt, a capybara encounter area will be added, roadway infrastructure improved, and additional fencing and sidewalks repaired. We continue to take a strategic and measured approach to the rebuild at our Georgia Park, ensuring we put in place a product that will withstand the test of time and improve the guest, animal and staff experience, ultimately delivering higher revenue and profitability. At our Missouri Park, the 2024 capital plan is focused on activation of a guest-facing pond within the Walkabout featuring a nature trail and floating dock, the expansion of shade structures, additional rental vehicles, and equipment capital. Capital spending planned for 2024 at our Texas Park will be focused on key infrastructure needs, including hay storage, the completion of the keeper facility and general safety related improvements. We remain committed to our long-term vision for our parks, and we believe our 2024 capital plan balances additional needs from the Georgia Park tornado and deferred maintenance, along with the addition of guest facing improvements and amenities. Our 2024 fiscal year capital plan anticipates spending approximately $1.4 million, which will again be fully funded from our existing cash and continues to demonstrate our commitment to building for long-term, sustainable growth.\nWe are committed to leveraging the strong operating model we have established at our Georgia Park at all three of our properties, with a focus on increasing attendance through enhanced marketing efforts and focused capital investments, as well as continuing to prudently increase the average revenue generated per guest visit via concession and gift shop revenues. In addition to rebuilding and improving our Georgia Park Walkabout, among our highest priorities over the next several years are the enhancement of the overall guest experience, streamlining and optimizing our systems, operating standards and practices, and increasing per capita revenue, through the introduction of new programming and more targeted marketing efforts. Our Texas Park opened to the public in May 2019 and we believe there remains long-term potential to increase attendance by increasing the local and regional awareness of this facility via advertising and promotion. We remain encouraged by the higher levels of attendance at our Missouri Park which began in the spring of 2020 and plan on prudently leveraging the increased exposure of this facility to continue to build on this success.\nOur long-term business plan also includes adjacent expansion and expansion via the acquisition of additional local or regional entertainment assets and attractions. We believe adjacent development and acquisitions, if any, should not unnecessarily encumber the Company with additional debt that cannot be justified by current operations. We may also pursue contract management opportunities for attractions owned by third parties. By using a combination of equity, debt and other financing options, we intend to carefully monitor stockholder value in conjunction with the pursuit of growth.\nStrong annual operating cash flow over the past several fiscal years has provided us with incremental operating margin, funded significant increases in capital investment, allowed us to paydown debt following the Aggieland Safari acquisition in 2020, and quickly reopen after the significant damage and business interruption caused by the March 2023 severe weather event at our Georgia Park. However, our current size and operating model leaves us little room for error. Any future capital raised by us may result in dilution to existing stockholders. It is possible that the cash generated by, or available to, us may not be sufficient to fund our capital and liquidity needs for the near term.\nConsolidated and Segment Results of Operations for the Year Ended October 1, 2023 as Compared to the Year Ended October 2, 2022\nWe manage our operations on an individual location basis. Discrete financial information is maintained for each park and provided to our corporate management for review and as a basis for decision-making. The primary performance measures used to allocate resources are Park earnings before interest and tax expense, and free cash flow. We use this measure of operating profit to gauge segment performance because we believe this measure is the most indicative of performance trends and the overall earnings potential of each segment.\nThe following table shows our consolidated and segment operating results for the years ended October 1, 2023 and October 2, 2022:\nGeorgia Park Missouri Park Texas Park Consolidated\nFiscal 2023 Fiscal 2022 Fiscal 2023 Fiscal 2022 Fiscal 2023 Fiscal 2022 Fiscal 2023 Fiscal 2022\nTotal revenues $ 5,873,526 $ 7,086,232 $ 1,692,765 $ 1,691,602 $ 1,873,957 $ 1,963,583 $ 9,440,248 $ 10,741,417\nSegment income (loss) from operations 1,511,142 2,895,820 (18,153 ) (344,404 ) (353,982 ) (254,834 ) 1,139,007 2,296,582\nSegment operating margin % 25.7 % 40.9 % -1.1 % -20.4 % -18.9 % -13.0 % 12.1 % 21.4 %\nCorporate expenses\n(1,200,307 ) (995,946 )\nTornado expenses and write-offs, net\n368,955 -\nLegal settlement\n- 100,000\nOther income, net\n80,230 91,276\nInterest expense\n(222,396 ) (261,621 )\nIncome (loss) before income taxes\n$ (572,421 ) $ 1,030,291\nTotal Net Sales\nOur total revenues for the year ended October 1, 2023 were $9.44 million, a decrease of $1.30 million, compared to the year ended October 1, 2022. Our park revenues decreased by $1.34 million or 12.6%, while animal sales increased by $34,457. As a result of a severe weather and tornado event on March 26-27, 2023, our Georgia Park was closed for 20 days, with the drive through section of the park reopening on April 15th and roughly three-quarters of the Walkabout portion reopening in two phases, on May 6th and July 2nd, respectively. Based on the comparable prior year period, we believe Georgia Park revenues were negatively impacted by approximately $1.0 million due to the severe weather and tornado related closure and phased reopening during the year ended October 1, 2023. On a pro forma basis, assuming flat park revenues for our Georgia Park from March 26th through May 6th, our park revenues for the year ended October 1, 2023 decreased by approximately $356,000 or 3.2%.\nGeorgia park revenues were $5.82 million, a decrease of $1.24 million or 17.5%, while animal sales increased by $27,473. On a pro forma basis, assuming flat sales during the severe weather and tornado closure and phased reopening period, Georgia park revenues decreased by approximately $240,000 or 3.4%. Missouri park revenues increased by $25,220 or 1.5%, to $1.69 million, while animal sales decreased by $24,057. Texas park revenues decreased by $120,667 or 6.4%, to $1.76 million, while animal sales increased by $31,041.\nFor the year ended October 1, 2023, paid attendance at our Missouri Park increased by 15.3%, while paid attendance at our Georgia and Texas Parks decreased by 17.1% and 6.7%, respectively. Adjusted for the severe weather and tornado closure and phased reopening impact, on a pro forma basis, Georgia Park paid attendance decreased by approximately 3.8%, which we believe was driven by lost momentum following the closure and phased reopening, and increased regional competition. We also believe unfavorable weather and a challenged consumer spending landscape, particularly in our fiscal fourth quarter, proved to be a headwind across all three of our parks, as well as for the overall industry.\nSegment Operating Margin\nOur consolidated segment operating margin decreased $1.16 million, resulting in segment income from operations of $1.14 million for the year ended October 1, 2023 compared to segment income from operations of $2.30 million for the year ended October 2, 2022. Our Georgia Parks segment income was $1.51 million, a decrease of $1.38 million, principally attributable to lower park revenues and the associated margin loss related to the severe weather and tornado closure, as well as higher general operations spending and higher asset write-offs, partially offset by lower advertising expense and higher animal sales. Our Missouri Park generated a segment operating loss of $18,153, compared to a segment operating loss of $344,404 for the year ended October 2,2022, resulting in a net improvement of $326,251, primarily attributable to higher park revenues and expenses for a drive-through Christmas lights display which negatively impacted fiscal 2022. Our Missouri Park segment income was also favorably impacted by lower advertising and wage expenses, and improved margins on in-park revenues, partially offset by lower animal sales and higher depreciation expense. Our Texas Park generated a segment loss of $353,982, compared to $254,834 for the year ended October 2, 2022, resulting in an increase of $99,148, primarily attributable to lower park revenues, as well as higher depreciation expense and asset write-offs, partially offset by higher animal sales and improved margins on in-park revenues.\nCorporate Expenses\nCorporate spending increased by $204,361 to $1.20 million for the year ended October 1, 2023, primarily attributable to higher wages due to management redundancies during the executive transition period and higher professional fees.\nTornado Expenses and Write-offs, Net\nAs a result of the damage caused by the March 2023 severe weather and tornado event at our Georgia Park, we recorded $780,941 of related expenses, primarily due to tree and other debris removal, repairing and replacing underground water pipes throughout the property, as well as general clean-up and reopening efforts. In addition, we recorded asset write-offs of $275,297, primarily associated with damage to various animal exhibits, several buildings, fencing and other infrastructure. These expenses and write-offs were partially offset by $687,283 of insurance proceeds from our commercial property coverage. For additional information, see Note 3. TORNADO EXPENSES AND ASSET WRITE-OFFS of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K.\nLegal Settlement Charge\nEffective August 5, 2022, we agreed to pay $100,000 to two children of a former officer of the Company to settle a complaint alleging we were obligated to purchase life insurance of at least $540,000 for said officer. The release was obtained, and the full payment was made prior to October 2, 2022. For additional information, see Note 8. COMMITMENTS AND CONTINGENCIES of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K.\nOther Income, Net\nOther income, net, was $80,230 for the year ended October 1, 2023, a decrease of $11,046, primarily attributable to higher other expenses and lower mineral rights royalty income from our Texas Park property, partially offset by higher interest income.\nInterest Expense\nInterest expense for the year ended October 1, 2023 was $222,396, a decrease of $39,225, primarily attributable to a reduction in term loan interest expense, as well as imputed interest on a right of use asset in the prior year.\nIncome Taxes\nFor the year ended October 1, 2023, we generated a pre-tax loss of $572,421 and recorded a tax benefit provision of $88,683, resulting in an effective tax rate of approximately 15.5%, which was unfavorably impacted by state income taxes due to operating losses for our Missouri and Texas Parks. For the year ended October 2, 2022, we generated income before income taxes of $1.03 million and recorded a tax provision of $302,000, resulting in an effective tax rate of approximately 29.4%, which was also unfavorably impacted by state income taxes due to operating losses for our Missouri and Texas Parks. For additional information, see Note 7. Income Taxes of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K.\nNet Income and Income Per Share\nOur reported net loss for the year ended October 1, 2023 was $483,738 or $0.01 per basic share and per fully diluted share, a net decrease of $1.21 million or $0.02 per basic and fully diluted share, as compared with reported net income of $727,491 million or $0.01 per basic share and per fully diluted share, for the year ended October 2, 2022.\nFor the year ended\nOctober 1, 2023 October 2, 2022\nNet income (loss) $ (483,738 ) $ 727,491\nTornado expenses and write-offs, net 368,955 -\nTax impact - Tornado expenses and write-offs (99,620 ) -\nLegal settlement - 100,000\nTax impact - legal settlement - (27,000 )\nAdjusted net income (loss) $ (214,403 ) $ 800,491\nAs shown in the table above, several one-time items impacted our year-over-year reported net income comparison. Our 2023 fiscal year included $368,955 of Georgia Park severe weather and tornado related expenses and asset write-offs, net of insurance proceeds. Our 2022 fiscal year included a legal settlement charge of $100,000. Management believes that adjusted net income, excluding one-time items, should be considered in evaluating the ongoing operating performance of our business. Excluding the $269,335 after-tax effect of the Georgia Park net tornado expenses and asset write-offs for the year ended October 1, 2023, as well as the $73,000 after-tax expense associated with a legal settlement during the year ended October 2, 2022, our adjusted net income decreased $1.01 million. This decrease is primarily attributable to a $1.38 million decrease in segment income for our Georgia Park, a $204,361 increase in Corporate expenses, a $99,148 increase in the segment loss for our Texas Park, and a $11,046 decrease in other income, partially offset by a $326,251 decrease in the segment loss for our Missouri Park, a $39,225 decrease in interest expense and a $318,863 net decrease in our adjusted income tax expense.\nFinancial Condition, Liquidity and Capital Resources\nFinancial Condition and Liquidity\nOur primary sources of liquidity are cash generated by operations and borrowings under our loan agreements. Historically, our slow season starts after Labor Day in September and runs until Spring Break, which typically begins toward the end of March. The first and second quarters of our fiscal year have historically generated negative cash flow, requiring us to use cash generated from prior fiscal years, as well as borrowing on a seasonal basis, to fund operations and prepare our parks for the busy season during the third and fourth quarters of our fiscal year. As a result of our improved cash position, during our 2023 and 2022 fiscal years we did not utilize any seasonal borrowing.\nOur working capital was $3.69 million as of October 1, 2023, compared to $4.67 million as of October 2, 2022. The year-over-year decrease in working capital primarily reflects cash used for capital investments, Georgia Park tornado clean-up expenses, net of insurance proceeds, and scheduled term loan payments, partially offset by cash generated by operating activities during our 2023 fiscal year.\nTotal loan debt, including current maturities, as of October 1, 2023 was $4.23 million compared to $4.96 million as of October 2, 2022. The year-over-year decrease in total loan debt was the result of scheduled term loan payments during our 2023 fiscal year.\nAs of October 1, 2023, we had equity of $14.99 million and total loan debt of $4.23 million, resulting in a debt to equity ratio of 0.28 to 1.0, compared to 0.32 to 1.0 as of October 2, 2022.\nOperating Activities\nNet cash provided by operating activities was $927,478 for our 2023 fiscal year, compared to $1.54 million, for our 2022 fiscal year, resulting in a decrease of $613,241, principally due to lower net income and net working capital usage, partially offset by non-cash expenses.\nInvesting Activities\nOur 2023 fiscal year investing activities included $1.56 million of capital improvements, compared to $1.84 million spent on capital improvements during our 2022 fiscal year, a decrease of $281,547, and other net investing activities decreased by $12,781.\nDuring our 2023 fiscal year, property and equipment investing at our Georgia Park included various enclosure updates including the addition of a state-of-the-art ring-tailed lemur exhibit, an aviary and walk-in budgie parrot feeding experience, the general rebuild of many areas impacted by the severe weather and tornado event, as well as guest rental vehicle fleet and capital equipment additions. For our Missouri Park, 2023 fiscal year property and equipment investments included the completion of a new otter exhibit which opened in May 2023, renovations of various animal shelters and exhibits, and capital equipment additions. For our Texas Park, 2023 fiscal year property and equipment investments included several animal acquisitions, an additional drive-through zone for zebras and camels, and several capital maintenance projects.\nDuring our 2022 fiscal year, property and equipment investing at our Georgia Park included various animal acquisitions, additions to animal shelters and exhibits, the addition of a guest party pavilion, enhancements to and expansion of our food service capabilities, improvements to our gift shop, annual improvements to our drive-through roads, and spending on annual requirements for our rental vehicle fleet. For our Missouri Park, 2022 fiscal year property and equipment investments included various animal acquisitions, the initial phases of a new otter exhibit which opened in 2023, renovations of various animal shelters and exhibits, ground and electrical improvements to support a new Christmas Lights display, enhancements to and expansion of our food service capabilities, the addition of playground equipment in the Walkabout section, and the acquisition of various equipment. For our Texas Park, 2022 fiscal year property and equipment investments included various animal acquisitions, the addition of and enhancements to various animal shelters, the acquisition of several vehicles for customer rental and related service equipment, other equipment additions, and various improvements focused on introducing expanded food service operations.\nFinancing Activities\nNet cash used in financing activities totaled $738,617 for the year ended October 1, 2023, compared to $866,193 million for the year ended October 2, 2022, resulting in a decrease of $127,576, primarily due to principal payments on a Missouri Park Christmas Lights financing lease obligation entered into near the beginning of our 2022 fiscal year and terminated before the end of our 2022 fiscal year.\nBorrowing Agreements\nOn June 18, 2021, through our wholly owned subsidiary Wild Animal - Georgia, we completed a refinancing transaction (the 2021 Refinancing) with Synovus Bank. The 2021 Refinancing included a term loan in the original principal amount of $1.95 million. The 2021 Term Loan bears interest at a rate of 3.75% per annum and is payable in monthly installments of approximately $26,480, based on a seven-year amortization period. The 2021 Term Loan has a maturity date of June 18, 2028. The 2021 Term Loan is secured by a security deed on the assets of Wild Animal - Georgia. We paid a total of approximately $1,514 in fees and expenses in connection with the 2021 Refinancing. The outstanding balance of the 2021 Term Loan was $1.38 million as of October 1, 2023.\nOn April 27, 2020, through our wholly owned subsidiary Aggieland-Parks Inc., we acquired Aggieland Wild Animal - Texas. In part, this acquisition was financed with the 2020 Term Loan from First Financial Bank (First Financial). The 2020 Term Loan in the original principal amount of $5.0 million from First Financial is secured by substantially all the Aggieland Wild Animal - Texas assets, as well as guarantees from the Company and its subsidiaries. The 2020 Term Loan bears interest at a rate of 5.0% per annum, has a maturity date of April 27, 2031, and required interest only monthly payments through April 2021. The 2020 Term Loan requires monthly payments of approximately $53,213 beginning in May 2021. We paid a total of approximately $62,375 in fees and expenses in connection with the 2020 Term Loan. On June 30, 2021, the Company used the incremental proceeds of the 2021 Term Loan, combined with additional funds, to paydown $1.0 million against the 2020 Term Loan, which had an outstanding balance of $2.89 million as of October 1, 2023.\nSubsequent Events\nNone\nOff Balance Sheet Arrangements\nWe do not have any off balance sheet arrangements that are reasonably likely to have a current or future effect on our financial condition, revenues, results of operations, liquidity or capital expenditures.\nCritical Accounting Policies and Estimates\nOur discussion and analysis of financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. Our significant accounting policies are set forth in NOTE 2. SIGNIFICANT ACCOUNTNG POLICIES of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K, which should be reviewed as they are integral to understanding our results of operations and financial position. Our critical accounting policies are periodically reviewed with the Audit Committee of the Board of Directors of the Company.\nThe preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of any contingent assets and liabilities. On an on-going basis, we evaluate our estimates, including those related to long-lived assets, revenue recognition, income taxes, and contingencies and litigation. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about carrying values of assets and liabilities that are not readily apparent from other sources. Although actual results historically have not deviated significantly from those determined using our estimates, our results of operations or financial condition could differ, perhaps materially, from these estimates under different assumptions or conditions.\nLong-lived Assets, including Property and Equipment\nProperty and equipment are stated at cost. Improvements and replacements are capitalized when they extend the useful life, increase capacity or improve the efficiency of the assets. Repairs and maintenance are charged to expense as incurred. Depreciation of property and equipment is provided on the straight-line method and is based on the estimated useful economic lives of the respective assets. We make subjective assessments as to these useful lives for purposes of determining the amount of depreciation to record annually with respect to our investments in property and equipment. These assessments have a direct impact on our net income or loss, as a change in the estimated useful economic lives of our investments in property and equipment would increase or decrease depreciation expense, thereby decreasing or increasing net income or loss. We review long-lived assets whenever circumstances change such that the recorded value of an asset may not be recoverable and therefore impaired.\nRevenue Recognition\nWe recognize revenues when a performance obligation has been satisfied by transferring control of promised services or products to our guests/customers in an amount that reflects the amount we have received or expect to receive in exchange for those services or products. Park admission revenues for annual passes and memberships are deferred and recognized as revenue on a pro-rata basis over the term of the pass or membership. Park admission fee revenues from advance online ticket purchases are deferred until the customers visit to the parks. Advance online tickets can generally be used anytime during the one year period from the date of purchase. Revenues from retail and concession sales are generally recognized upon the concurrent receipt of payment and delivery of goods to the customer. Sales taxes billed and collected are not included in revenue.\nAccounting for Income Taxes\nWe account for income taxes under the asset and liability method, under which deferred tax assets and liabilities are recognized for the anticipated future tax consequences attributable to differences between financial statement amounts and their respective tax bases using enacted tax rates in effect for the year in which the differences are expected to reverse. We review our deferred tax assets to determine whether their value can be realized based upon available evidence. A valuation allowance is established when we believe that it is more likely than not that some portion of our deferred tax assets will not be realized.\nSignificant judgment is required in determining our provision or benefit for income taxes, our deferred tax assets and liabilities, and any valuation allowance recorded against our net deferred tax assets. We record deferred tax assets, primarily resulting from net operating loss carry-forwards to the extent we believe these assets will more likely than not be realized. In making such a determination, we consider all available evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies and recent results of operations. In the event we determine it is more likely than not we will not realize our deferred tax assets we establish a valuation allowance.\nContingencies\nWe have various contingencies, as described in NOTE 8. COMMITMENTS AND CONTINGENCIES of the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K. We are not aware of any other legal matters involving the Company, however, there can be no assurance that all proceedings that may currently be brought against us are known by us at this time. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nOur financial statements and related notes are set forth on pages through. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone ITEM 9A. CONTROLS AND PROCEDURES\n(a) Disclosure Controls and Procedures\nWith the participation of the principal executive officer and principal financial officer of Parks! America, Inc. (the Registrant), the Registrants management has evaluated the effectiveness of the Registrants disclosure controls and procedures, as required by Rule 13a-15(e) of the Securities Exchange Act of 1934, as amended (the Exchange Act), as of the end of the fiscal year covered by this Annual Report on Form 10-K. Based upon that evaluation, the Registrants principal executive officer and principal financial officer have concluded that the Registrants disclosure controls and procedures were effective as of the end of the fiscal year covered by this Annual Report on Form 10-K.\n(b) Managements Annual Report on Internal Control over Financial Reporting\nOverview\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, the Companys principal executive and principal financial officers and effected by the Companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States and includes those policies and procedures that:\n1. Pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n2. Provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n3. Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Because of the inherent limitations of internal control, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce this risk.\nManagement based its assessment of the Companys internal control over financial reporting on criteria established in Internal Control - Integrated Framework (1992) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on its assessment, management has concluded that the Companys disclosure controls and procedures and internal control over financial reporting are effective as of October 1, 2023.\n(c) Changes in Internal Control over Financial Reporting\nThere has been no change in our internal control over financial reporting, as defined in Rules 13a-15(f) of the Exchange Act, during our most recent fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting as of October 1, 2023. ITEM 9B. OTHER INFORMATION\nNone\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nOur executive officers and directors are as follows:\nName Age Title\nLisa Brady President, Chief Executive Officer and Director\nTodd R. White Chief Financial Officer and Director\nDale Van Voorhis Chairman of the Board of Directors\nJohn Gannon Director\nCharles Kohnen Director\nJeffery Lococo Secretary and Director\nRick Ruffolo Director\nLisa Brady\nLisa Brady was appointed President and Chief Executive Officer of the Company effective November 14, 2022. Ms. Brady has served as a Director of the Company since November 2021. Ms. Brady brings more than a decade of experience in the entertainment, leisure, and hospitality industry with executive-level experience in strategic planning, mergers and acquisitions, investor relations, financial modeling, and real estate development. For the decade proceeding her joining the Company, Ms. Brady served in a variety of leadership roles of increasing responsibility with Cedar Fair Entertainment Company including investor relations, strategic planning, M&A activities, resort and adjacent development and implementation of key growth initiatives. Prior to joining Cedar Fair Entertainment, Ms. Brady was a sell-side analyst at KeyBank Capital markets, covering the fitness, leisure and hospitality sector. Ms. Brady graduated summa cum laude from Penn State University and received the John Zahniser Female Scholar Athlete Award.\nTodd R. White\nTodd R. White was appointed the Chief Financial Officer of Parks! America in May 2013 and has served as a Director of the Company since January 2014. Prior to joining the Company, from 1992 through 2011, Mr. White was an executive with The Scotts Miracle-Gro Company in a variety of roles, and served most recently as its Vice President, Global Controller from 2005 through 2011. Mr. White was with Price Waterhouse in Cincinnati, Ohio from 1986 to 1992. He received a B.A. in business administration from The Ohio State University and an MBA from the University of Wisconsin-Madison.\nDale Van Voorhis\nDale Van Voorhis currently serves as Chairman of the Companys Board of Directors. Mr. Van Voorhis served as the Companys interim President and CEO from June 1, 2022 until November 14, 2022. Mr. Van Voorhis served as the Companys CEO from January 2011 through May 2022. Mr. Van Voorhis was re-appointed to our Board of Directors in March 2009 and served as the Companys Chief Operating Officer from March 2009 until January 2011. Mr. Van Voorhis previously served the Company in various management and board of director roles from December 2003 through December 2006. In addition, Mr. Van Voorhis has been the President of Amusement Business Consultants, Inc., an amusement industry consulting company since its inception in 1994. Mr. Van Voorhis was President and CEO of Funtime Parks Inc. (Funtime) from 1982 until 1994. Funtime consisted of three parks in New York and Ohio, and they generated total attendance of 2.6 million visitors in 1993. Funtime sold the three parks for $60 million in 1994. Mr. Van Voorhis has over 55 years of experience in the amusement/entertainment industry.\nJohn Gannon\nJohn Gannon has served as a Director of the Company since December 2019 and was appointed Chairman of the Audit Committee in June 2021. Mr. Gannon has 33 years of experience in the amusement park, water park, and zoo industry. After 14 years of service, Mr. Gannon retired from the Columbus Zoo and Aquarium in January 2020, most recently serving as its Senior Vice President responsible for managing all for profit ventures, including its water park, its amusement park section and its golf course. Prior to joining the Columbus Zoo and Aquarium, Mr. Gannon was with Six Flags, Premier Parks and Funtime Inc. for a combined total of 19 years. During his time with Six Flags, Mr. Gannon served as Vice President of Finance, with responsibility over the eastern United States and Europe. Mr. Gannon started his career as a CPA with Ernst & Young. Mr. Gannon is a member of the International Association of Amusement Parks and Attractions (IAAPA) and the World Waterpark Association (WWA). In 2017, Governor John Kasich appointed Mr. Gannon to the Ohio Department of Agriculture Advisory Board on Amusement Ride Safety. Mr. Gannon earned a Bachelor of Science degree in Accounting from the University of Akron.\nCharles Kohnen\nCharles Kohnen has served as a Director of the Company since October 2010. Mr. Kohnen has a diverse business background including experience with planning and executing management strategies for turnaround companies. From 1998 to 2006 he was Managing Partner of Kohnen Realty Co., a real estate and stock investment company that he co-founded, where he was responsible for all aspects of the business including the coordination of all legal, accounting and buyout matters. Mr. Kohnen has also served as Chairman of a privately held restaurant located in Cincinnati, Ohio. Mr. Kohnen also serves on the Board of a non-profit organization and earned a Bachelor of Science degree in General Business from Miami University in Oxford, Ohio.\nJeffery Lococo\nJeffery Lococo has served as a Director of the Company since May 2006 and was appointed Secretary of the Company in January 2011. Mr. Lococo is President of Lococo Company LLC, an industry-leading consulting firm in the amusement and resort industry segment. Mr. Lococo began his career with the Marriott Corporation theme park division and progressed through middle management to General Manager level in 1990 with Funtime. From 1994 to 2000, Mr. Lococo held various executive vice president level positions with Six Flags Inc. Mr. Lococo joined Great Wolf Resorts Inc. in March of 2000 as General Manager of Great Wolf Lodge Sandusky, Ohio, and in 2005, was promoted to Corporate Vice President of Resort Operations for all Great Wolf Lodge Resorts. Mr. Lococo has over 35 years of experience in the theme/water park, entertainment and hospitality industry.\nRick Ruffolo\nRick Ruffolo has served as a Director of the Company since November 2021 and was appointed Chairman of the Strategic Growth Committee in May 2022. Mr. Ruffolo has over three decades of consumer goods, specialty retail, marketing, innovation, and executive leadership experience. In his first twenty years, Mr. Ruffolo held brand management roles at P&G, SC Johnson, and Nestle Purina, as well as senior executive roles leading the brand, marketing, and innovation departments at Yankee Candle and Bath & Body Works where he received multiple patents including for the multi-billion dollar launch of the Wallflowers home fragrance business. Over the last eleven years, as CEO & President, Mr. Ruffolo has led the successful turnaround and growth of several private equity-backed portfolio companies including Sensible Organics, CR Brands, Enviroscent, and Phelps Pet Products. Mr. Ruffolo is a dual citizen of the U.S. and Italy, was a NCAA Division I athlete and graduated summa cum laude in marketing and business administration from the University of Dayton, and received his MBA with honors from Washington University in St. Louis.\nInvolvement in Certain Legal Proceedings\nDuring the past ten years none of the following events have occurred with respect to any of our directors or executive officers or any of the persons nominated by our board to become a director of the Company.\n1. A petition under the Federal bankruptcy laws or any state insolvency law was filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two years before the time of such filing;\n2. Such person was convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. Such person was the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\ni.\nActing as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\nii.\nEngaging in any type of business practice; or\niii. Engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n4. Such person was the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in paragraph (3)(i) above, or to be associated with persons engaged in any such activity;\n5. Such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6. Such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7. Such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\ni.\nAny Federal or State securities or commodities law or regulation; or\nii.\nAny law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease- and-desist order, or removal or prohibition order; or\niii. Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nAudit Committee\nOur Audit Committee is responsible for: (1) overseeing the accounting and financial reporting processes of the Company, including the audits of the Companys consolidated financial statements; (2) appointing, compensating and overseeing the work of the independent registered public accounting firm employed by the Company; (3) assisting the Board in its oversight of: (a) the integrity of the Companys consolidated financial statements and (b) the independent registered public accounting firms qualifications and independence; and (4) undertaking the other matters required by applicable rules and regulations of the SEC. Our Audit Committee is comprised of three directors, John Gannon (Chairman), Charles Kohnen, and Dale Van Voorhis. The Board has determined that John Gannon qualifies as an audit committee financial expert as that term is defined in the applicable SEC Rules.\nOur Audit Committee met four times in the twelve-month period ended October 1, 2023.\nCompensation Committee\nOur Compensation Committee determines matters pertaining to the compensation and expense reporting of certain of our executive officers, and administers our stock option, incentive compensation, and employee stock purchase plans. The Compensation Committee is composed of three directors, John Gannon, Charles Kohnen, and Jeffery Lococo (Chairman).\nOur Compensation Committee met one time during the twelve-month period ended October 1, 2023.\nStrategic Growth Committee\nOur Strategic Growth Committee was established effective May 31, 2022 and is responsible for: (1) working with the CEO to lead the development of a strategic plan and associated periodic updates, and annual goal setting; and (2) leading or assisting in the process of recruitment and hiring of key Company personnel. The Strategic Growth Committee is composed of three directors, Charles Kohnen, Rick Ruffolo (Chairman) and Dale Van Voorhis, and Lisa Brady works closely with this Committee.\nOur Strategic Growth Committee met one time during the twelve-month period ended October 1, 2023.\nCode of Ethics\nOn December 4, 2023 our Board of Directors adopted a Code of Conduct, effective January 1, 2024.\nSECTION 16(A) BENEFICIAL OWNERSHIP REPORTING COMPLIANCE\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires our executive officers and directors and persons who own more than 10% of a registered class of our equity securities to file with the SEC initial statements of beneficial ownership, reports of changes in ownership and annual reports concerning their ownership of our common stock and other equity securities, on Forms 3, 4 and 5 respectively. Executive officers, directors and greater than 10% stockholders are required by the SEC regulations to furnish our Company with copies of all Section 16(a) reports they file. Based upon a review of those forms and any written representations regarding the need for filing Forms 5, to the best of the Companys knowledge, no required Section 16(a) reports were filed late. ITEM 11. EXECUTIVE COMPENSATION\nSUMMARY COMPENSATION TABLE\nThe following table sets forth information regarding compensation paid to our principal executive officer, principal financial officer, and our other executive officers, for the years ended October 1, 2023, October 2, 2022 and September 27, 2020.\nName & Principal\nSalary Bonus Stock Award Option Awards Non-Equity Incentive Plan Compensation Change in Pension Value and Non-Qualified Deferred Compensation Earnings All Other Compensation Total\nPosition Year ($) ($) ($) ($) ($) ($) ($) ($)\nLisa Brady 153,125 5,000 76,667\n2,227 237,019\nPresident, Chief Executive Officer and Director\nDale Van Voorhis (1) 83,333 -\n10,305 93,638\nChairman of the Board 100,000 20,000\n10,056 130,056\nof Directors\n100,000 25,000\n10,006 135,006\nMark Whitfield (2) 132,901 - -\n2,624 135,525\nExecutive Vice President 142,500 30,000 10,000\n3,466 185,966\nTodd R. White 90,000 - 10,000\n3,627 103,627\nChief Financial Officer and 90,000 20,000 10,000\n3,466 123,466\nDirector 86,250 25,000 10,000\n121,540\nMichael D. Newman (3) - - -\n- -\nVice President of Safari 14,000 - -\n- 14,000\nOperations 108,000 25,000 -\n3,661 136,661\n(1) Mr. Van Voorhis currently serves as Chairman of the Companys Board of Directors and was a special advisor to the CEO from November 14, 2022 through May 31, 2023. Mr. Van Voorhis served as the Companys interim President and CEO from June 1, 2022 until November 14, 2022, and as its President and CEO prior to June 1, 2022.\n(2) Mr. Whitfield left employment with the Company effective June 5, 2023.\n(3) Effective October 31, 2021, Mr. Newman resigned his employment with the Company. Mr. Newman was rehired in a non-executive capacity effective August 1, 2023.\nDIRECTOR COMPENSATION\nThe following table sets forth with respect to the named director, compensation information inclusive of equity awards and payments made in the year ended October 1, 2023.\nFees Earned\nor Paid\nin Cash Stock\nAwards Option\nAwards Non-Equity\nIncentive Plan\nCompensation Change in Pension\nValue and\nNon-Qualified\nDeferred\nCompensation\nEarnings All Other\nCompensation Total\nName ($) Shares/($) ($) ($) ($) ($) ($)\nDale Van Voorhis $ 10,000 - - - - - $ 10,000\n$ -\nLisa Brady - 25,000 - - - - $ 10,000\n$ (10,000 )\nJohn Gannon $ 5,000 18,750 - - - - $ 12,500\n$ (7,500 )\nCharles Kohnen - 25,000 - - - - $ 10,000\n$ (10,000 )\nJeffery Lococo - 37,500 - - - - $ 15,000\n$ (15,000 )\nTodd R. White - 25,000 - - - - $ 10,000\n$ (10,000 )\nRichard Ruffolo - 31,250 - - - - $ 12,500\n$ (12,500 )\nEmployment Agreements\nEffective November 14, 2022, the Company and Ms. Brady, the Companys President and Chief Executive Officer entered into an employment agreement (the Brady Employment Agreement). Pursuant to the Brady Employment Agreement, Ms. Brady receives an initial base annual compensation in the amount of $175,000 per year, subject to annual review by the Board of Directors. Ms. Brady is entitled to receive an annual Performance Incentive of up to 25% of her base annual compensation, subject to performance milestones. Ms. Brady received a $50,000 award of shares of Company stock, which vested on February 14, 2023, after her first ninety days of employment. The number of shares of this award totaled 128,205 based on the $0.39 closing price of the Companys stock on November 14, 2022. Ms. Brady is also scheduled to receive share awards of the Companys common stock with a total value of $50,000, $60,000, $70,000 and $75,000 as of the last day of the Companys fiscal year from its 2023 fiscal year through its 2026 fiscal year, respectively. The number of shares awarded is to be based on the average price of the Companys stock on the date of the award. Each award will vest in one-third increments, with the first third vesting on the date of the award, the second third vesting on the first anniversary of the award and the final third vesting on the second anniversary of the award. The Company recorded an expense of $16,667 related to the one-third vesting 2023 fiscal year grant during the fiscal year ended October 1, 2023. The number of shares of the 2023 fiscal year award totaled 135,135 based on the closing price of the Companys stock on September 29, 2023, of which 45,045 vested as of that date. The Company anticipates issuing these shares prior to December 31, 2023. Ms. Brady also received a $5,000 sign-on bonus. The Brady Employment Agreement has a term of five years and entitles Ms. Brady to participate in any deferred compensation plan the Company may adopt during the term of her employment with the Company.\nEffective June 1, 2022, the Company and Dale Van Voorhis, the Companys Chairman of the Board, entered into an employment agreement (the 2022 Van Voorhis Employment Agreement). Mr. Van Voorhis has been part of the Companys executive management since 2009, and most recently served as the Companys Interim CEO until Ms. Brady was hired. Mr. Van Voorhis served as Special Advisor to the CEO through May 31, 2023. Pursuant to the 2022 Van Voorhis Employment Agreement, Mr. Van Voorhis receives annual compensation in the amount of $100,000 through May 31, 2023 and $50,000 from June 1, 2023 through May 31, 2024. In addition, Mr. Van Voorhis will serve as a member of the Companys Strategic Growth and Audit Committees during the two year term of his employment with the Company.\nEffective as of January 1, 2022, the Company and Todd R. White, the Companys Chief Financial Officer, entered into an employment agreement (the 2022 White Employment Agreement). Pursuant to the 2022 White Employment Agreement, Mr. White receives an initial base annual compensation in the amount of $90,000 per year, subject to annual review by the Board of Directors. The 2022 White Employment Agreement has a term of two years and entitles Mr. White to participate in any deferred compensation plan the Company may adopt during the term of his employment with the Company.\nEach of the foregoing employment agreements contains provisions for severance compensation in the event an agreement is (i) terminated early by the Company without cause ($258,333 in aggregate) or (ii) in the event of a change in control of the Company ($348,333 in aggregate), as well as disability and death payment provisions ($157,500 in aggregate). As of October 1, 2023, the Company has not adopted any deferred compensation plans.\nEffective May 1, 2018, the Company entered into an employment agreement with Michael D. Newman (the Newman Employment Agreement) to serve as the Companys Vice President of Safari Operations. Mr. Newman had been the general manager of Wild Animal - Georgia since February 2011. Pursuant to the Newman Employment Agreement, Mr. Newman received an initial base annual compensation of $95,000 per year, subject to annual review by the Board of Directors. Mr. Newman also received a $5,000 signing bonus. Effective as of May 1, 2020, Mr. Newmans annual compensation was changed to $108,000. The Newman Employment Agreement had a term of five years. Effective October 31, 2021, Mr. Newman resigned his employment with the Company. Effective August 1, 2023, Mr. Newman was rehired in a non-executive position.\nStock Option and Award Plan\nA Stock Option and Award Plan (the Plan) providing for incentive stock options and performance bonus awards for executives, employees, and directors was approved by our Board of Directors on February 1, 2005, however, the Plan has not been submitted to the stockholders for approval. The Plan sets aside five million (5,000,000) shares for award of stock options, including qualified incentive stock options and performance stock bonuses. To date, no grants or awards have been made pursuant to the Plan and we did not submit the Plan for consideration to the Companys stockholders at the last meeting of stockholders. ITEM 12. EQUITY COMPENSATION PLAN INFORMATION AND SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information relating to the ownership of common stock by (i) each person known by us to be the beneficial owner of more than five percent of the outstanding shares of our common stock, (ii) each of our directors, (iii) each of our named executive officers, and (iv) all of our executive officers and directors as a group. Unless otherwise indicated, the information relates to these persons, beneficial ownership as of December 7, 2023. Except as may be indicated in the footnotes to the table and subject to applicable community property laws, each person has the sole voting and investment power with respect to the shares owned.\nThe address of each beneficial owner is care of Parks! America, Inc., 1300 Oak Grove Road, Pine Mountain, GA 31822, unless otherwise set forth below that persons name.\nName Number of\nShares Owned\nPercent (1) Title\nLisa Brady 157,223 0.2 % President, Chief Executive Officer and Director\nTodd R. White (2) 1,308,192 1.7 % Chief Financial Officer and Director\nDale Van Voorhis 16,012,700 21.2 % Chairman of the Board of Directors\nCharles Kohnen (3) 22,918,108 30.3 % Director\nJeffery Lococo 619,383 0.8 % Secretary and Director\nJohn Gannon 43,706 0.1 % Director\nRick Ruffolo 35,268 0.0 % Director\nFocused Compounding Fund, LP 1700 Alma Drive, Suite 460 Plano, TX 75075 13,097,450 17.3 %\n(1) Based upon shares of common stock issued and outstanding as of December 7, 2023, except that shares of common stock underlying options and warrants exercisable within 60 days of the date hereof are deemed to be outstanding.\n(2) 410,350 of the Companys shares owned by Mr. White are held jointly with his spouse.\n(3) 16,032,600 of the Companys shares owned by Mr. Kohnen are held jointly with his spouse.\nOfficers, directors and their controlled entities, as a group, controlled approximately 54.4% of the outstanding common stock of the Company as of December 7, 2023.\nThe information as to shares beneficially owned has been individually furnished by our respective directors, named executive officers and other stockholders, or taken from documents filed with the SEC. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nExcept as set forth below, none of the following parties has, since our date of incorporation, had any material interest, direct or indirect, in any transaction with the Company or in any presently proposed transaction that has or will materially affect the Company:\n● Any of our directors or officers;\n● Any person proposed as a nominee for election as a director;\n● Any person who beneficially owns, directly or indirectly, shares carrying more than 10% of the voting rights attached to our outstanding shares of common stock;\n● Any of our promoters; and\n● Any relative or spouse of any of the foregoing persons who has the same house as such person.\nDirector Independence\nOf the members of the Companys Board of Directors, John Gannon, Charles Kohnen, Jeffery Lococo and Rick Ruffolo are considered independent under the listing standards of the Rules of NASDAQ set forth in the NASDAQ Manual (note, our common shares are not currently listed on NASDAQ or any other national securities exchange, and this reference is used for definitional purposes only). ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nGBQ Partners LLC was appointed as our independent registered accounting firm effective April 8, 2020.\nFees billed by our independent registered public accounting firm, for the audit and quarterly reviews of our financial statements and services that are normally provided by an accountant in connection with statutory and regulatory filings or engagements for the years ended October 1, 2023 and October 2, 2022 were approximately $61,000 and $55,000, respectively.\nAll Other Fees\nOur independent registered public accounting firm billed no other fees for the years ended October 1, 2023 and October 2, 2022.\nAudit Committee Pre-Approval Policies and Procedures\nThe audit committee is required to pre-approve the audit and non-audit services performed by our independent registered public accounting firm to assure that the provision of such services do not impair the registered public accounting firms independence.\nPART IV ITEM 15. EXHIBITS\n3.1 Articles of Incorporation of Great American Family Parks, Inc. dated July 17, 2002 (incorporated by reference to the Registration Statement on Form SB-2 filed with the Securities and Exchange Commission on August 4, 2005).\n3.2 Amended Articles of Incorporation of Great American Family Parks, Inc. dated January 26, 2004 (incorporated by reference to the Registration Statement on Form SB-2 filed with the Securities and Exchange Commission on August 4, 2005).\n3.3 Bylaws of Great American Family Parks, Inc. dated January 30, 2004 (incorporated by reference to the Registration Statement on Form SB-2 filed with the Securities and Exchange Commission on August 4, 2005).\n3.4 Great American Family Parks 2005 Stock Option Plan dated February 1, 2005 (incorporated by reference to the Registration Statement on Form SB-2 filed with the Securities and Exchange Commission on August 4, 2005).\n3.5 Amended Bylaws of the Company, as of January 17, 2011 (incorporated by reference to the Annual Report on Form 10-KT filed by the Company on December 29, 2012).\n3.6 Amended Bylaws of the Company as of June 12, 2012 (incorporated by reference to the Report on Form 8-K filed by with the Securities and Exchange Commission on July 16, 2012).\n14.1 Code of Conduct\n21.1 Subsidiaries of the Registrant.\n23.1 Consent of GBQ Partners LLC dated December 12, 2023.\n31.1 Certification by Chief Executive Officer, required by Rule 13a-14(a) or Rule 15d-14(a) of the Exchange Act, promulgated pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2 Certification by Chief Financial Officer, required by Rule 13a-14(a) or Rule 15d-14(a) of the Exchange Act, promulgated pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1 Certification by Chief Executive Officer, required by Rule 13a-14(b) or Rule 15d-14(b) of the Exchange Act and Section 1350 of Chapter 63 of Title 18 of the United States Code, promulgated pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nCertification by Chief Financial Officer, required by Rule 13a-14(b) or Rule 15d-14(b) of the Exchange Act and Section 1350 of Chapter 63 of Title 18 of the United States Code, promulgated pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS Inline XBRL Instance Document\n101.SCH Inline XBRL Taxonomy Extension Schema Document\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF Inline XBRL Taxonomy Extension Definitions Linkbase Document\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf as of December 12, 2023 by the undersigned, thereunto duly authorized.\nPARKS! AMERICA, INC.\nBy:\n/s/ Lisa Brady\nLisa Brady\nChief Executive Officer and Director\n(Principal Executive Officer)\nIn accordance with the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSIGNATURE\nTITLE\nDATE\nBy: /s/ Lisa Brady\nChief Executive Officer and Director\nLisa Brady\n(Principal Executive Officer)\nDecember 12, 2023\nBy:\n/s/ Dale Van Voorhis\nDale Van Voorhis\nChairman of the Board\nDecember 12, 2023\nBy: /s/ John Gannon\nJohn Gannon\nDirector\nDecember 12, 2023\nBy: /s/ Charles Kohnen\nCharles Kohnen\nDirector\nDecember 12, 2023\nBy: /s/ Jeffery Lococo\nJeffery Lococo\nSecretary and Director\nDecember 12, 2023\nBy: /s/ Rick Ruffolo\nRick Ruffolo\nDirector\nDecember 12, 2023\nBy:\n/s/ Todd R. White\nChief Financial Officer and Director\nTodd R. White\n(Principal Financial Officer)\nDecember 12, 2023\nITEM\nPARKS! AMERICA, INC. and SUBSIDIARIES\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nConsolidated Financial Statements of Parks! America and Subsidiaries\nPage\nReport of Independent Registered Public Accounting Firm PCAOB ID 1808\nConsolidated Balance Sheets as of October 1, 2023 and October 2, 2022\nConsolidated Statements of Operations for the years ended October 1, 2023 and October 2, 2022\nConsolidated Statement of Changes in Stockholders Equity for the years ended October 1, 2023 and October 2, 2022\nConsolidated Statements of Cash Flows for the years ended October 1, 2023 and October 2, 2022\nNotes to the Consolidated Financial Statements\nBoard of Directors and Shareholders\nParks! America, Inc.\nReport of Independent Registered Public Accounting Firm\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Parks! America, Inc. (the Company) as of October 1, 2023 and October 2, 2022, the related consolidated statements of operations, stockholders equity, and cash flows for the years then ended, and related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of October 1, 2023 and October 2, 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nAssessment of Impairment on Long Lived Assets\nAs described in Note 2 of the consolidated financial statements, the Companys long-lived tangible assets are stated at cost, less accumulated depreciation and amortization. The Company evaluates its long-lived assets for impairment whenever events or changes in circumstances indicate the carrying value of an asset or group of assets may not be recoverable. If such conditions are present, the Company determines if the assets are recoverable by comparing the sum of the undiscounted cash flows to the assets carrying amounts. If the carrying amounts are greater, then the assets are not recoverable.\nWe identified the Companys recoverability analyses of long lived assets as a critical audit matter because of the operating losses at the Missouri and Texas parks and the significant judgments made by management to estimate the recoverability of these groups of assets. A higher degree of auditor judgment and an increased extent of effort was required when performing audit procedures to evaluate the reasonableness of managements estimates and assumptions.\nOur audit procedures related to the recoverability analyses of these long-lived asset groups included obtaining an understanding and evaluating the procedures and assumptions utilized in managements recoverability analyses. To test the Companys estimated future undiscounted cash flow analyses, we performed audit procedures that included, among others, testing significant assumptions and the underlying data used by the Company in its recoverability analyses, and evaluating the methodologies applied by management.\n/s/ GBQ Partners LLC\nGBQ Partners LLC\nWe have served as the Companys auditor since 2020.\nColumbus, Ohio\nDecember 12, 2023\nPARKS! AMERICA, INC. and SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nAs of October 1, 2023 and October 2, 2022\nOctober 1, 2023 October 2, 2022\nASSETS\nCash $ 4,098,387 $ 5,472,036\nAccounts receivable 36,172 4,405\nInventory 419,149 541,986\nPrepaid expenses 558,678 170,782\nTotal current assets 5,112,386 6,189,209\nProperty and equipment, net 14,910,097 14,811,742\nIntangible assets, net 52,331 79,565\nOther assets 20,909 23,090\nTotal assets $ 20,095,723 $ 21,103,606\nLIABILITIES AND STOCKHOLDERS EQUITY\nLiabilities\nAccounts payable $ 79,352 $ 267,567\nOther current liabilities 571,343 521,872\nCurrent portion of long-term debt, net 767,675 732,779\nTotal current liabilities 1,418,370 1,522,218\nLong-term debt, net 3,459,816 4,227,442\nDeferred tax liability, net 232,329 -\nTotal liabilities 5,110,515 5,749,660\nStockholders equity\nCommon stock; 300,000,000 shares authorized, at $.001 par value;\n75,517,763 and 75,227,058 shares issued and outstanding, respectively 75,518 75,227\nCommon stock; 300,000,000 shares authorized, at $.001 par value;75,517,763 and 75,227,058 shares issued and outstanding, respectively 75,518 75,227\nCapital in excess of par 5,102,471 4,987,762\nRetained earnings 9,807,219 10,290,957\nTotal stockholders equity 14,985,208 15,353,946\nTotal liabilities and stockholders equity $ 20,095,723 $ 21,103,606\nThe accompanying notes are an integral part of these consolidated financial statements.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended October 1, 2023 and October 2, 2022\nOctober 1, 2023 October 2, 2022\nFor the year ended\nOctober 1, 2023 October 2, 2022\nPark revenues $ 9,274,565 $ 10,610,191\nSale of animals 165,683 131,226\nTotal revenues 9,440,248 10,741,417\nCost of sales 1,284,877 1,446,640\nSelling, general and administrative 7,015,066 7,217,892\nDepreciation and amortization 884,459 782,987\nTornado expenses and write-offs, net 368,955 -\nLegal settlement - 100,000\n(Gain) loss on disposal of operating assets 317,146 (6,738 )\nIncome (loss) from operations (430,255 ) 1,200,636\nOther income, net 80,230 91,276\nInterest expense (222,396 ) (261,621 )\nIncome (loss) before income taxes (572,421 ) 1,030,291\nIncome tax expense (benefit) (88,683 ) 302,800\nNet income (loss) $ (483,738 ) $ 727,491\nIncome (loss) per share - basic and diluted $ (0.01 ) $ 0.01\nWeighted average shares outstanding (in 000s) - basic and diluted 75,365 75,186\nThe accompanying notes are an integral part of these consolidated financial statements.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nFor the Years Ended October 1, 2023 and October 2, 2022\nCapital in\nShares Amount Excess of Par Treasury Stock Retained Earnings Total\nBalance at October 3, 2021 75,124,087 $ 75,124 $ 4,934,212 $ (3,250 ) $ 9,563,466 $ 14,569,552\nIssuance of common stock to Directors & Officer 102,971 56,800 - - 56,903\nRetirement of Treasury Stock\n(3,250 ) 3,250\n-\nNet income for the year ended October 2, 2022 - - - - 727,491 727,491\nBalance at October 2, 2022 75,227,058 75,227 4,987,762 - 10,290,957 15,353,946\nBalance 75,227,058 75,227 4,987,762 - 10,290,957 15,353,946\nIssuance of common stock to Directors & Officer 290,705 114,709\n115,000\nNet loss for the year ended October 1, 2023 - - - - (483,738 ) (483,738 )\nBalance at October 1, 75,517,763 $ 75,518 $ 5,102,471 $ - $ 9,807,219 $ 14,985,208\nBalance 75,517,763 $ 75,518 $ 5,102,471 $ - $ 9,807,219 $ 14,985,208\nThe accompanying notes are an integral part of these consolidated financial statements.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended October 1, 2023 and October 2, 2022\nOctober 1, 2023 October 2, 2022\nFor the year ended\nOctober 1, 2023 October 2, 2022\nOPERATING ACTIVITIES:\nNet (loss) income $ (483,738 ) $ 727,491\nReconciliation of net (loss) income to net cash provided by operating activities:\nDepreciation and amortization expense 884,459 782,987\nAmortization of right of use asset - 154,831\nInterest expense - debt financing cost amortization 5,888 5,888\nInterest expense - financing lease - 6,032\nStock-based compensation 131,667 56,903\nDeferred tax liability 232,329 -\nTornado asset write-offs 275,297 -\nLoss (gain) loss on disposal of assets 317,146 (6,738 )\nChanges in assets and liabilities\n(Increase) decrease in accounts receivable (31,767 )\n(Increase) decrease in inventory 122,837 (227,883 )\n(Increase) decrease in prepaid expenses (387,896 ) 4,466\nIncrease (decrease) in accounts payable (188,215 ) 46,153\nIncrease (decrease) in other current liabilities 49,471 (9,475 )\nNet cash provided by operating activities 927,478 1,540,719\nINVESTING ACTIVITIES:\nAcquisition of property and equipment (1,557,844 ) (1,839,391 )\nInvestment in intangible assets (5,466 ) (32,500 )\nProceeds from the disposition of property and equipment 15,053\nNet cash used in investing activities (1,562,510 ) (1,856,838 )\nFINANCING ACTIVITIES:\nPayments on 2020 Term Loan (478,679 ) (455,068 )\nPayments on 2021 Term Loan (259,938 ) (250,262 )\nPayments on Term Loan (259,938 ) (250,262 )\nPrincipal payments on finance lease obligation - (160,863 )\nNet cash used in financing activities (738,617 ) (866,193 )\nNet decrease in cash (1,373,649 ) (1,182,312 )\nCash at beginning of period 5,472,036 6,654,348\nCash at end of period $ 4,098,387 $ 5,472,036\nSupplemental Cash Flow Information:\nCash paid for interest $ 217,496 $ 257,009\nCash paid for income taxes $ 125,000 $ 321,000\nSupplemental Disclosure of Noncash Investing and Financing Activities:\nRight of use asset obtained in exchange for finance lease liability $ - $ 464,492\nThe accompanying notes are an integral part of these consolidated financial statements.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 1. ORGANIZATION\nParks! America, Inc. (Parks! or the Company) owns and operates through wholly owned subsidiaries three regional safari parks and is in the business of acquiring, developing and operating local and regional entertainment assets and attractions in the United States. The Companys wholly owned subsidiaries are Wild Animal Safari, Inc. a Georgia corporation (Wild Animal - Georgia), Wild Animal, Inc., a Missouri corporation (Wild Animal - Missouri), and Aggieland-Parks, Inc., a Texas corporation (Aggieland Wild Animal - Texas). Wild Animal - Georgia owns and operates the Wild Animal Safari park in Pine Mountain, Georgia (the Georgia Park). Wild Animal - Missouri owns and operates the Wild Animal Safari park located in Strafford, Missouri (the Missouri Park). Aggieland Wild Animal - Texas owns and operates the Aggieland Wild Animal Safari park near Bryan/College Station, Texas (the Texas Park). The Company acquired the Georgia Park on June 13, 2005, the Missouri Park on March 5, 2008, and the Texas Park on April 27, 2020.\nThe Company was originally incorporated on July 30, 1954 as Painted Desert Uranium & Oil Co., Inc. in Washington State. On October 1, 2002, Painted Desert Uranium & Oil Co., Inc. changed its name to Royal Pacific Resources, Inc. and its corporate domicile to the State of Nevada. On December 19, 2003, Royal Pacific Resources, Inc. acquired the assets of Great Western Parks LLC pursuant to a Share Exchange Agreement that resulted in the Company assuming control and changing the corporate name to Great American Family Parks, Inc. The acquisition was accounted for as a reverse acquisition in which Great Western Parks was considered the acquirer of Royal Pacific Resources for reporting purposes. On June 11, 2008, the Company changed its name from Great American Family Parks, Inc. to Parks! America, Inc.\nThe Companys Parks are open year round, but experience increased seasonal attendance, typically beginning in the latter half of March through early September. Combined third and fourth quarter park revenues were 60.4% and 62.1% of annual park revenues for the Companys 2023 and 2022 fiscal years, respectively.\nNOTE 2. SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation: The Companys consolidated financial statements are presented in accordance with accounting principles generally accepted in the United States of America (GAAP). The Company believes that the disclosures made are adequate to make the information presented not misleading. The information reflects all adjustments that, in the opinion of management, are necessary for a fair presentation of the Companys financial position and results of its operations for the periods set forth herein.\nPrinciples of Consolidation: The accompanying consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries (Wild Animal - Georgia, Wild Animal - Missouri and Aggieland Wild Animal - Texas). All inter-company accounts and transactions have been eliminated in consolidation.\nAccounting Method: The Company recognizes income and expenses based on the accrual method of accounting.\nEstimates and Assumptions: Management uses estimates and assumptions in preparing financial statements in accordance with GAAP. Those estimates and assumptions affect the reported amounts of the assets and liabilities, the disclosure of contingent assets and liabilities, and the reported revenues and expenses. Actual results could vary from the estimates that were assumed in preparing these financial statements.\nFiscal Year End: The Companys fiscal year-end is the Sunday closest to September 30, and its quarterly close dates are also determined by the Sunday closest to the end of each quarterly reporting period. For the 2023 fiscal year, October 1 was the closest Sunday, and for the 2022 fiscal year, October 2 was the closest Sunday. This fiscal calendar aligns the Companys fiscal periods closely with the seasonality of its business. The high season typically ends after the Labor Day holiday weekend. The period from October through early March is geared towards maintenance and preparation for the next busy season, which typically begins in the latter half of March through early September.\nFinancial and Concentrations Risk: The Company does not have any concentration or related financial credit risks. The Company maintains its cash in bank deposit accounts, which at times may exceed federally insured limits.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 2. SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nFair Value: Fair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants, or an exit price. Inputs to valuation techniques used to measure fair value may be observable or unobservable, and valuation techniques used to measure fair value should maximize the use of relevant observable inputs and minimize the use of unobservable inputs. The fair value hierarchy consists of three broad levels based on the ranks of the quality and reliability of inputs used to determine the fair values. Level 1 inputs consist of quoted prices in active markets for identical assets or liabilities. Level 2 inputs consist of quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable and market-corroborated inputs which are derived principally from or corroborated by observable market data. Level 3 inputs are derived from valuation techniques in which one or more significant inputs or value drivers are unobservable. A financial instruments categorization within the valuation hierarchy is based upon the lowest level of input that is significant to the fair value measurement. Assets and liabilities recognized or disclosed at fair value on a recurring basis include our term debt.\nAccounts Receivable: The safari parks are primarily a payment upfront business; therefore, the Company typically carries little or no accounts receivable. The Company had accounts receivable of $36,172 and $4,405 as of October 1, 2023 and October 2, 2022, respectively.\nInventory: Inventory consists of gift shop items, animal food, and concession and park supplies, and is stated at the lower of cost or net realizable value. Cost is determined by the first-in, first-out method. The gross profit method is used to determine the change in gift shop inventory for interim periods. Inventories are reviewed and reconciled annually because inventory levels turn over rapidly. The Company had inventory of $419,149 and $541,986 as of October 1, 2023 and October 2, 2022, respectively.\nPrepaid Expenses: The Company prepays certain expenses primarily due to legal or contractual requirements. Prepaid expenses consist primarily of federal and state income taxes and insurance premiums. The Company had prepaid expenses of $558,678 and $170,782 as of October 1, 2023 and October 2, 2022, respectively.\nProperty and Equipment: Property and equipment are stated at cost. Depreciation is computed on the straight-line method over the estimated useful lives of the assets, which range from three to thirty-nine years. A summary is included below.\nSCHEDULE OF PROPERTY, PLANT AND EQUIPMENT\nOctober 1, 2023 October 2, 2022 Depreciable Lives\nLand $ 6,389,470 $ 6,389,470 not applicable\nMineral rights 276,000 276,000 25 years\nGround improvements 2,941,958 2,797,694 7-25 years\nBuildings and structures 3,812,223 3,922,106 10-39 years\nAnimal shelters and habitats 3,428,620 2,479,832 10-39 years\nPark animals 1,279,080 1,247,777 5-25 years\nEquipment - concession and related 509,078 464,988 3-15 years\nEquipment and vehicles - yard and field 817,809 766,149 3-15 years\nVehicles - buses and rental 299,206 267,483 3-5 years\nRides and entertainment 172,154 106,247 5-7 years\nFurniture and fixtures 27,160 28,694 5-10 years\nProjects in process 212,248 808,526\nProperty and equipment, cost 20,165,006 19,554,966\nLess accumulated depreciation (5,254,909 ) (4,743,224 )\nProperty and equipment, net $ 14,910,097 $ 14,811,742\nDepreciation expense for the years ended October 1, 2023 and October 2, 2022 totaled $865,969 and $766,859, respectively.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 2. SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nIntangible Assets: Intangible assets consist primarily of a site master plan, website domains and tradename registrations, which are reported at cost and are being amortized over a period of three to ten years. Amortization expense for the years ended October 1, 2023 and October 2, 2022 totaled $18,490 and $16,128, respectively.\nImpairment of Long-Lived Assets: The Company reviews its major assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. If an asset is considered impaired, then impairment will be recognized in an amount determined by the excess of the carrying amount of the asset over its fair value.\nOther Current Liabilities: The following is a breakdown of other current liabilities:\nSCHEDULE OF OTHER CURRENT LIABILITIES\nOctober 1, 2023 October 2, 2022\nAccrued wages and payroll taxes $ 177,868 $ 122,265\nDeferred revenue 143,511 193,912\nAccrued sales taxes 46,718 49,123\nAccrued property taxes 49,183 46,814\nOther accrued liabilities 154,063 109,758\nOther current liabilities $ 571,343 $ 521,872\nRevenue Recognition: The Company recognizes revenues in accordance with ASC 606, Revenues from Contracts with Customers. Under ASC 606, the Company recognizes revenue when a customer obtains control of promised goods or services, in an amount that reflects the consideration that the Company expects to receive in exchange for those goods or services. To determine revenue recognition for arrangements that the Company determines are within the scope of ASC 606, the Company performs the following five steps: (1) identify the contract with the customer; (2) identify the performance obligations in the contract; (3) determine the transaction price; (4) allocation the transaction price to the performance obligation in the contract; and (5) recognize revenue when (or as) the Company satisfies the performance obligation. The Company only applies the five-step model to contracts when it is probable that it will collect the consideration it is entitled to in exchange for the goods or services it transfers to the customer.\nRevenues from park admission fees are recognized at the point in time control transfers to the customer, which is generally when the customer accepts access to the park and the Company is entitled to payment. Park admission revenues for annual passes and memberships are deferred and recognized as revenue on a pro-rata basis over the term of the pass or membership. Park admission fee revenues from advance online ticket purchases are deferred until the customers visit to the parks. Advance online tickets can generally be used anytime during the one year period from the date of purchase. Revenues from retail and concession sales are generally recognized upon the concurrent receipt of payment and delivery of goods to the customer. Sales taxes billed and collected are not included in revenue.\nDeferred revenues from advance online admission tickets, season passes, and memberships were $143,511 and $193,912 as of October 1, 2023 and October 2, 2022, respectively, and are included within Other Current Liabilities in the accompanying consolidated balance sheets.\nThe Company periodically sells surplus animals created from the natural breeding process that occurs within the parks. All animal sales are reported as a separate revenue line item. Animal sales are recognized at a point in time when control transfers to the customer, which is generally determined when title, ownership and risk of loss pass to the customer, all of which generally occurs upon delivery of the animal. Based on the Companys assessment of control indicators, sales are recognized when animals are delivered to the customer.\nThe Company provides disaggregation of revenue based on geography in Note 9: Business Segments, as it believes this best depicts how the nature, amount, timing, and uncertainty of revenue and cash flows are affected by economic factors.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 2. SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nAdvertising and Marketing Costs: The Company expenses advertising and marketing costs as incurred. Advertising and marketing expense for the years ended October 1, 2023 and October 2, 2022 totaled $1,084,376 and $1,238,618, respectively.\nLeases: The Company determines if an arrangement contains a lease at inception and accounts for all leases in accordance with ASC 842, Leases. If an arrangement contains a lease, the Company performs a classification test to determine if the lease is an operating lease or a financing lease. Right of use assets represent the right to use an underlying asset for the lease term and lease liabilities represent the obligation to make lease payments arising from the lease. Right of use assets are valued at the initial measurement of the lease liability, plus any indirect costs or rent prepayments, and reduced by any lease incentives and any deferred lease payments. Right of use assets are amortized over the lease term. Lease liabilities are recognized on the commencement date of the lease based on the present value of the future lease payments over the lease term. The discount rate used to determine the present value of the future lease payments is the Companys incremental borrowing rate, unless the rate implicit in the lease is readily determinable. Lease terms may include options to extend or terminate the lease when it is reasonably certain that the Company will exercise that option. Lease expense is recognized on a straight-line basis over the life of the lease, unless management believes there is an alternative systematic basis which better represents the pattern which the Company will consume the economic benefits thereof and is included within general and administrative expenses. As a practical expedient, a relief provided in the accounting standard to simplify compliance, the Company does not recognize right-of-use assets and lease liabilities for leases with an original term of one year or less. Any non-lease components are not included within the lease right-of-use asset and lease liability, are reflected as an expense in the period incurred.\nIn October 2021, the Company entered a financing lease for certain property related to a Christmas Lights drive through display at its Missouri Park. Effective September 27, 2022, the Company terminated this financing lease, acquiring the leased property related to the Christmas Lights display for $85,000 in exchange for a mutual release of obligations under the lease agreement and recognized a lease termination gain of $2,011. Prior to termination of the lease, during the fiscal year ended October 1, 2023 the Company recognized right of use asset amortization and interest expense related to this lease of $154,831 and $6,032, respectively.\nStock Based Compensation: The Company recognizes stock based compensation costs on a straight-line basis over the requisite service period associated with the grant. The Company awards shares to its Board of Directors for service on the Board. The shares issued to the Board are restricted and are not to be re-sold unless an exemption is available, such as the exemption afforded by Rule 144 promulgated under the Securities Act of 1933, as amended (the Securities Act). The Company recognizes the expense based on the fair market value at time of the grant. The Company typically awards its annual Director compensation around the end of each calendar year.\nA Stock Option and Award Plan (the Plan) providing for incentive stock options and performance bonus awards for executives, employees, and directors was approved by the Companys Board of Directors on February 1, 2005, however, the Plan has not been submitted to the stockholders for approval. The Plan sets aside five million (5,000,000) shares for award of stock options, including qualified incentive stock options and performance stock bonuses. To date, no grants or awards have been made pursuant to the Plan and the Company did not submit the Plan for consideration to the Companys stockholders at its last meeting of stockholders.\nIncome Taxes: The Company utilizes the asset and liability method of accounting for income taxes, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements. Under this method, deferred tax assets and liabilities are determined based on the differences between the financial reporting basis and the tax basis of the assets and liabilities, and are measured using the enacted tax rates and laws. Management periodically reviews the Companys deferred tax assets to determine whether their value can be realized based on available evidence. A valuation allowance is established when management believes it is more likely than not, that such tax benefits will not be realized. Changes in valuation allowances from period to period are included in the Companys income tax provision in the period of change.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 2. SIGNIFICANT ACCOUNTING POLICIES (CONTINUED)\nBasic and Diluted Net Income (Loss) Per Share: Basic net income (loss) per share amounts are computed based on the weighted average number of shares actually outstanding. Diluted net income (loss) per share amounts are computed using the weighted average number of common shares and common equivalent shares outstanding as if shares had been issued on the exercise any common share rights unless the exercise becomes anti-dilutive.\nBasic and diluted net income (loss) per share is computed by dividing net income (loss) available to common stockholders by the applicable weighted average number of common shares outstanding in each period.\nDividend Policy: The Company has not yet adopted a policy regarding payment of dividends.\nRecent Accounting Pronouncements:\nCredit Losses - Financial Instruments\nIn June 2016, the FASB issued Accounting Standards Update (ASU) 2016-13, Financial Instruments - Credit Losses (Topic 326), which changes the impairment model for most financial assets to require measurement and recognition of expected credit losses for financial assets held, replacing the existing incurred loss model. ASU 2016-13 is effective for annual reporting periods beginning after December 15, 2022, including interim reporting periods within those annual reporting periods. Early adoption is permitted. The Company is currently evaluating the impact of the new guidance on its consolidated financial statements and related disclosures, however, it is not anticipated to be material.\nExcept as noted, the Company does not expect recently issued accounting standards or interpretations to have a material impact on the Companys financial position, results of operations, cash flows or financial statement disclosures.\nNOTE 3. TORNADO EXPENSES AND ASSET WRITE-OFFS\nDuring March 26-27, 2023, the Companys Georgia Park experienced extensive damage, caused by an EF-3 tornado and over nine inches of rain, resulting in more than 4,500 fallen trees and damage to many of the Parks animal enclosures, fencing and other infrastructure. The Walkabout Adventure Zoo (Walkabout) portion of the property was particularly hard hit. The Georgia Park was closed for 20 days, including for most of its traditionally busy spring break period, which has historically comprised approximately 10%-15% of its annual revenue. The drive-through safari section of the Georgia Park reopened on April 15th. The Walkabout portion of the park has reopened in phases, with the first phase on May 6th and the second phase on July 2nd. Approximately one-quarter of the Walkabout remains closed.\nFor the year ended October 1, 2023, the Company incurred $780,941 of severe weather and tornado related expenses, primarily due to tree and other debris removal, repairing and replacing underground water pipes throughout the property, as well as general clean-up efforts. In addition, the Company recorded related asset write-offs of $275,297, primarily associated with damage to various animal exhibits, several buildings, fencing and other infrastructure. The Company has also made capital investments of $615,000 through October 1, 2023 related to severe weather and tornado damage rebuilding projects.\nThe Company has been working with its insurance providers regarding tornado damage related coverage and insurance proceeds totaling $687,283 have been received as of October 1, 2023, factoring in deductibles and co-insurance. The Company expects to receive additional insurance proceeds of up to $50,000. The Company continues to work with local, state, and federal agencies to explore options to assist with offsetting tornado related clean-up, repair and rebuilding costs.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 4. LONG-TERM DEBT\nOn June 18, 2021, the Company, through its wholly owned subsidiary Wild Animal - Georgia, completed a refinancing transaction (the 2021 Refinancing) with Synovus Bank (Synovus). The 2021 Refinancing included a term loan in the original principal amount of $1.95 million (the 2021 Term Loan). The 2021 Term Loan bears interest at a rate of 3.75% per annum and is payable in monthly installments of approximately $26,480, based on a seven-year amortization period. The 2021 Term Loan has a maturity date of June 18, 2028. The 2021 Term Loan is secured by a security deed on the assets of Wild Animal - Georgia. The Company paid a total of approximately $1,514 in fees and expenses in connection with the 2021 Refinancing. The outstanding balance of the 2021 Term Loan was $1.38 million as of October 1, 2023.\nOn April 27, 2020, the Company, through its wholly owned subsidiary Aggieland-Parks, Inc., acquired Aggieland Wild Animal - Texas. The purchase price of $7.1 million was financed with a $5.0 million loan (the 2020 Term Loan) from First Financial Bank, N.A. (First Financial), a seller note with a face value of $750,000 (the Aggieland Seller Note), and cash totaling $1.38 million. The 2020 Term Loan is secured by substantially all the Aggieland Wild Animal - Texas assets, as well as guarantees from the Company and its subsidiaries. The 2020 Term Loan bears interest at a rate of 5.0% per annum, has a maturity date of April 27, 2031, and required interest only monthly payments through April 2021. The 2020 Term Loan requires monthly payments of $53,213 beginning in May 2021. The Company paid a total of approximately $62,375 in fees and expenses in connection with the 2020 Term Loan. On June 30, 2021, the Company used the incremental proceeds of the 2021 Term Loan, combined with additional funds, to paydown $1.0 million against the 2020 Term Loan, which had an outstanding balance of $2.89 million as of October 1, 2023. The Company was in compliance with the liquidity covenant of the 2020 Term Loan as of October 2, 2022 and October 1, 2023. The Company was in compliance with the annual debt service coverage ratio covenant of the 2020 Term Loan for the year ended October 2, 2022. For the year ended October 1, 2023, the Company was not in compliance with the annual debt service coverage ratio covenant of the 2020 Term Loan, due to the lost revenues, as well as net expenses and write-offs driven by the March 2023 severe weather and tornado damage at its Georgia Park. The Company requested and First Financial granted a waiver of this violation for the year ended October 1, 2023.\nInterest expense of $222,396 and $261,621 for the years ended October 1, 2023 and October 2, 2022, respectively, includes $5,888 of debt financing costs amortization in each period. Interest expense for the year ended October 2, 2022 also includes financial lease cost amortization of $6,032.\nThe following table represents the aggregate of the Companys outstanding long-term debt:\nSCHEDULE OF DEBT\nOctober 1, 2023 October 2, 2022\nAs of\nOctober 1, 2023 October 2, 2022\nLoan principal outstanding $ 4,271,521 $ 5,010,136\nLess: unamortized debt financing costs (44,030 ) (49,915 )\nGross long-term debt 4,227,491 4,960,221\nLess current portion of long-term debt, net of unamortized costs and discount (767,675 ) (732,779 )\nLong-term debt $ 3,459,816 $ 4,227,442\nAs of October 1, 2023, the scheduled future principal maturities, by fiscal year, are as follows:\nSCHEDULE OF MATURITIES OF LONG-TERM DEBT\n$ 773,561\n810,136\n848,472\n888,654\n850,954\nthereafter 99,744\nTotal $ 4,271,521\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 5. STOCKHOLDERS EQUITY\nShares of common stock issued for service to the Company are valued based on market price on the date of the award.\nOn February 2, 2023, the Company declared its annual compensation award to seven directors for their service on the Board of Directors. Seven directors were awarded $10,000 each and three directors received a total of $10,000 for serving as committee chairpersons and as a non-employee officer, with such compensation to be paid all in shares of the Companys common stock, all in cash or a combination thereof, at each directors election. Five directors elected to receive all shares, one director elected to receive 60% in shares and 40% in cash, and one director elected all cash. Based on the closing stock price of $0.40 per share on February 2, 2023, a total of 162,500 shares were issued on March 9, 2023. The total compensation award cost of $80,000 was reported as an expense in the three month period ended April 2, 2023.\nEffective February 14, 2023, Lisa Brady the Companys President and Chief Executive Officer vested in 128,205 shares of the Companys common stock, in accordance with the terms of her employment agreement. The Company recorded compensation award cost of $50,000 in the three month period ended April 2, 2023 and the shares were issued on May 23, 2023.\nOn December 13, 2021, the Company declared its annual compensation award to seven directors for their service on the Board of Directors. Five directors were awarded $10,000 each, two new directors were awarded $2,222 each, and two directors received a total of $7,500 for serving as committee chairpersons and as a non-employee officer, with such compensation to be paid all in shares of the Companys common stock, all in cash or a combination thereof, at each directors election. Five directors elected to receive all shares, one director elected to receive 60% in shares and 40% in cash, and one director elected all cash. Based on the closing stock price of $0.553 per share on December 13, 2021, a total of 84,888 shares were issued on February 21, 2022. The total compensation award cost of $61,944 was reported as an expense in the three month period ended January 2, 2022.\nOn December 13, 2021, the Company awarded a non-director officer $10,000 to be paid in shares of the Companys common stock, totaling 18,083 shares based on the closing stock price of $0.553 per share on December 13, 2021, which were distributed on February 21, 2022, and $10,000 of compensation expense was reported in the three month period ended January 2, 2022.\nOfficers, directors and their controlled entities own approximately 54.3% of the outstanding common stock of the Company as of October 1, 2023.\nNOTE 6. SIGNIFICANT TRANSACTIONS WITH RELATED PARTIES\nEmployment Agreements:\nEffective November 14, 2022, the Company and Ms. Brady, entered into an employment agreement (the Brady Employment Agreement). Pursuant to the Brady Employment Agreement, Ms. Brady receives an initial base annual compensation in the amount of $175,000 per year, subject to annual review by the Board of Directors. Ms. Brady is entitled to receive an annual Performance Incentive of up to 25% of her base annual compensation, subject to performance milestones. Ms. Brady received a $50,000 award of shares of Company stock, which vested on February 14, 2023, after her first ninety days of employment. The number of shares of this award totaled 128,205 based on the $0.39 closing price of the Companys stock on November 14, 2022. Ms. Brady is also scheduled to receive share awards of the Companys common stock with a total value of $50,000, $60,000, $70,000 and $75,000 as of the last day of the Companys fiscal year from its 2023 fiscal year through its 2026 fiscal year, respectively. The number of shares awarded is to be based on the average price of the Companys stock on the date of the award. Each award will vest in one-third increments, with the first third vesting on the date of the award, the second third vesting on the first anniversary of the award and the final third vesting on the second anniversary of the award. The Company recorded an expense of $16,667 related to the one-third vesting of the 2023 fiscal year grant during the fiscal year ended October 1, 2023. The number of shares of the 2023 fiscal year award totaled 135,135 based on the $0.37 closing price of the Companys stock on September 29, 2023, of which 45,045 vested as of that date. The Company anticipates issuing these shares prior to December 31, 2023. Ms. Brady also received a $5,000 sign-on bonus. The Brady Employment Agreement has a term of five years and entitles Ms. Brady to participate in any deferred compensation plan the Company may adopt during the term of her employment with the Company.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 6. SIGNIFICANT TRANSACTIONS WITH RELATED PARTIES (CONTINUED)\nEmployment Agreements (continued):\nEffective June 1, 2022, the Company and Dale Van Voorhis, the Companys Chairman of the Board, entered into an employment agreement (the 2022 Van Voorhis Employment Agreement). Mr. Van Voorhis has been part of the Companys executive management since 2009, and most recently served as the Companys Interim CEO until Ms. Brady was hired. Mr. Van Voorhis served as Special Advisor to the CEO through May 31, 2023. Pursuant to the 2022 Van Voorhis Employment Agreement, Mr. Van Voorhis receives annual compensation in the amount of $100,000 through May 31, 2023 and $50,000 from June 1, 2023 through May 31, 2024. In addition, Mr. Van Voorhis will serve as a member of the Companys Strategic Growth and Audit Committees during the two year term of his employment with the Company.\nEffective as of January 1, 2022, the Company and Todd R. White, the Companys Chief Financial Officer, entered into an employment agreement (the 2022 White Employment Agreement). Pursuant to the 2022 White Employment Agreement, Mr. White receives an initial base annual compensation in the amount of $90,000 per year, subject to annual review by the Board of Directors. The 2022 White Employment Agreement has a term of two years and entitles Mr. White to participate in any deferred compensation plan the Company may adopt during the term of his employment with the Company.\nEach of the foregoing employment agreements contains provisions for severance compensation in the event an agreement is (i) terminated early by the Company without cause ($258,333 in aggregate) or (ii) in the event of a change in control of the Company ($348,333 in aggregate), as well as disability and death payment provisions ($157,500 in aggregate). As of October 1, 2023, the Company has not adopted any deferred compensation plans.\nNOTE 7. INCOME TAXES\nFor the year ended October 1, 2023, the Company reported a pre-tax loss of $572,421 and for the year ended October 2, 2022, the Company reported a pre-tax profit of $1.03 million. The Companys provision for income taxes consists of the following:\nSCHEDULE OF PROVISION FOR INCOME TAX\nOctober 1, 2023 October 2, 2022\nFor the year ended\nOctober 1, 2023 October 2, 2022\nCurrent\nFederal $ (196,871 ) $ 198,400\nState (124,141 ) 104,400\nTotal current (321,012 ) 302,800\nDeferred\nFederal 68,106 -\nState 164,223 -\nTotal deferred 232,329 -\nIncome tax expense (benefit) $ (88,683 ) $ 302,800\nA reconciliation of the federal corporate statutory income tax rate and the effective rate for the provisions for income taxes consists of the following:\nSCHEDULE OF FEDERAL CORPORATE STATUTORY INCOME TAX RATE AND THE EFFECTIVE RATE\nOctober 1, 2023 October 2, 2022\nFor the year ended\nOctober 1, 2023 October 2, 2022\nFederal statutory rate 21.0 % 21.0 %\nState taxes, net of federal benefit (5.5 ) 8.4\nNon-deductible expenses (0.4 ) -\nOther 0.4 -\nEffective income tax rate 15.5 % 29.4 %\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 7. INCOME TAXES (CONTINUED)\nDeferred tax assets and liabilities arise from temporary differences between financial reporting and tax reporting bases of assets and liabilities, and operating loss carryforwards for tax purposes. The components of Companys deferred income tax assets and liabilities consist of the following as of October 1, 2023:\nSCHEDULE OF DEFERRED INCOME TAX ASSETS AND LIABILITIES\nOctober 1, 2023\nDeferred tax assets (liabilities)\nNet operating loss carryforwards $ 1,336,696\nAccrued liabilities 5,109\nProperty and equipment (1,457,959 )\nIntangibles assets (6,879 )\nValuation allowance (109,296 )\nNet deferred tax liability $ (232,329 )\nGAAP requires a valuation allowance be recorded against a deferred tax asset if it is more likely than not that the tax benefit associated with the asset will not be realized in the future. As shown in the table above, the Company had a valuation allowance of $109,296 as of October 1, 2023. This valuation allowance is based on the Companys State of Missouri net operating loss carryforwards totaling $3.46 million as of October 1, 2023, which expire in varying amounts from 2028 through 2042. Due to the Companys history of losses in the State of Missouri, it has established a full valuation allowance against the related net operating loss carryforward asset as of October 1, 2023.\nThe Company also had net operating loss carryforwards available for federal and State of Georgia tax purposes of $4.09 million and $202,468, respectively, as of October 1, 2023. Each of these has an indefinite carryforward period; however, each is limited to offset 80% of taxable income any period applied.\nThe Company follows guidance issued by the FASB ASC 740 with respect to accounting for uncertainty in income taxes. A tax position is recognized as a benefit only if it is more-likely-than-not that the tax position would be sustained in a tax examination, with a tax examination being presumed to occur. The amount recognized is the largest amount of tax benefit that is greater than fifty percent likely of being realized on examination. For tax positions not meeting the more-likely-than-not test, no tax benefit is recorded. The Company has no unrecognized tax benefits under guidance related to tax uncertainties. The Company does not anticipate its unrecognized tax benefits will significantly change in the next twelve months. Any tax penalties or interest expense will be recognized in income tax expense. No interest and penalties related to unrecognized tax benefits were accrued as of October 1, 2023 or October 2, 2022.\nThe Company or one of its subsidiaries files income tax returns in the U.S. federal jurisdiction and various state jurisdictions. The Company is open to federal and state tax audits until the applicable statute of limitations expire; however, the Company currently has no federal or state income tax examinations underway. The tax years 2019 through 2022 remain open to examination by the major taxing jurisdictions in which the Company and its subsidiaries operate.\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 8. COMMITMENTS AND CONTINGENCIES\nOn December 16, 2022, the Company received notice that on August 10, 2022 a former employee of Aggieland Wild Animal - Texas, filed a Complaint in the 361st District Court of Brazos County, Texas (case no. 22-001839-CV-361), alleging the Company and Aggieland-Parks, Inc. committed several instances of employment discrimination. The Complaint seeks unspecified economic, compensatory and punitive damages, as well as attorneys fees and costs. The Company is defending this claim.\nOn February 17, 2021, two children of James Meikle, the Companys former Chief Operating Officer, filed a Complaint in the Eighth Judicial District Court, Clark County, Nevada (case no. A-21-829563-C), alleging the Company was obligated under Mr. Meikles Employment Agreement to purchase at least $540,000 of life insurance for Mr. Meikle, who passed away on November 28, 2018. The Complaint was seeking damages of $540,000, as well as interest and expenses. The trial date was set for August 15, 2022. Effective August 5, 2022, the Company agreed to pay the plaintiffs $100,000 to settle this Compliant and obtain a full release for any related complaints. The release was obtained, and the full payment was made prior to October 2, 2022.\nExcept as noted above, the Company is not a party to any pending legal proceeding, nor is its property the subject of a pending legal proceeding, that is not in the ordinary course of business or otherwise material to the financial condition of its business. None of the Companys directors, officers or affiliates is involved in a proceeding adverse to its business or has a material interest adverse to its business.\nNOTE 9. BUSINESS SEGMENTS\nThe Company manages its operations on an individual location basis. Discrete financial information is maintained for each park and provided to corporate management for review and as a basis for decision-making. The primary performance measures used to allocate resources are Park earnings before interest and tax expense, and free cash flow.\nThe following tables present financial information regarding each of the Companys reportable segments:\nSCHEDULE OF REVENUE BY REPORTING SEGMENTS\nOctober 1, 2023 October 2, 2022\nFor the year ended\nOctober 1, 2023 October 2, 2022\nTotal revenues:\nGeorgia $ 5,873,526 $ 7,086,232\nMissouri 1,692,765 1,691,602\nTexas 1,873,957 1,963,583\nConsolidated $ 9,440,248 $ 10,741,417\nTotal revenues $ 9,440,248 $ 10,741,417\nIncome (loss) before income taxes:\nGeorgia $ 1,511,142 $ 2,895,820\nMissouri (18,153 ) (344,404 )\nTexas (353,982 ) (254,834 )\nSegment total 1,139,007 2,296,582\nCorporate (1,200,307 ) (995,946 )\nTornado expenses and write-offs, net 368,955 -\nLegal settlement - 100,000\nOther income, net 80,230 91,276\nInterest expense (222,396 ) (261,621 )\nConsolidated $ (572,421 ) $ 1,030,291\nIncome (loss) before income taxes $ (572,421 ) $ 1,030,291\nPARKS! AMERICA, INC. and SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOctober 1, 2023\nNOTE 9. BUSINESS SEGMENTS (CONTINUED)\nOctober 1, 2023 October 2, 2022\nFor the year ended\nOctober 1, 2023 October 2, 2022\nDepreciation and amortization:\nGeorgia $ 324,252 $ 289,961\nMissouri 275,533 253,182\nTexas 283,020 238,744\nCorporate 1,654 1,100\nConsolidated $ 884,459 $ 782,987\nDepreciation and amortization $ 884,459 $ 782,987\nCapital expenditures\nGeorgia $ 1,208,762 $ 695,285\nMissouri 134,987 601,842\nTexas 214,095 542,264\nConsolidated $ 1,557,844 $ 1,839,391\nCapital expenditures $ 1,557,844 $ 1,839,391\nOctober 1, 2023 October 2, 2022\nAs of\nOctober 1, 2023 October 2, 2022\nTotal assets:\nGeorgia $ 8,519,619 $ 9,402,877\nMissouri 3,335,794 3,468,730\nTexas 7,698,400 8,074,421\nCorporate 541,910 157,578\nConsolidated $ 20,095,723 $ 21,103,606\nTotal assets $ 20,095,723 $ 21,103,606\nNOTE 10. FAIR VALUE MEASUREMENTS\nAs of October 1, 2023 and October 2, 2022, the fair value of our long-term debt was $3.83 million and $4.61 million, respectively. The measurement of the fair value of long-term debt is based upon inquiries of the financial institutions holding the respective loans and is considered a Level 2 fair value measurement.\nThe respective carrying values of cash, accounts receivable, accounts payable, and accrued liabilities approximate fair value because of the short maturity of these instruments.\nNOTE 11. SUBSEQUENT EVENTS\nThe Company has analyzed its operations subsequent to October 1, 2023 to the date these financial statements were issued and has determined that no material subsequent events have occurred from the date of these consolidated financial statements."
}