{
    "cik": "1308027",
    "company": "Vystar Corp",
    "filing_type": "10-K",
    "filing_date": "2023-10-10",
    "period_of_report": "2022-12-31",
    "sic": "3060",
    "state_of_inc": "GA",
    "state_location": "MA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1308027/0001493152-23-036786-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1308027/000149315223036786/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1308027/0001493152-23-036786.txt",
    "filename": "1308027_10K_2022_0001493152-23-036786.htm",
    "content": "ITEM 1. BUSINESS\nOverview\nVystar Corporation (Vystar, the Company, we, us, or our) is based in Worcester, Massachusetts. The Company uses patented technology to produce a line of innovative air purifiers, which destroy viruses and bacteria through the use of ultraviolet light. In addition, Vystar manufactures and sells reduced allergen natural rubber latex used primarily in various bedding products.\nVystar has a majority ownership in Murida Furniture Co., Inc. dba Rotmans Furniture, formerly one of the largest independent furniture stores in the U.S.\nCompany Background\nIn May of 2018, Vystar acquired substantially all of the assets of UV Flu Technologies, Inc. (formerly traded on the OTC under the ticker UVFT), whose patented ViraTech™ UV light air purification technology destroys greater than 99% of airborne bacteria, viruses and other microorganisms and virtually eliminates concentrations of odors and volatile organic compounds (VOCs) and created the RxAir division.\nThe RxAir product line includes:\n● RXair™ Residential Filterless Air Purifier\n● RX400 ™ U.S. Food and Drug Administration (FDA) cleared Class II Filterless Air Purifier\n● RX3000™ Commercial FDA cleared Class II Air Purifier\nRxAir promotes a healthy lifestyle improving the quality of life of each and every customer. Independently tested by the U.S. Environmental Protection Agency (EPA) and FDA-certified laboratories, the RxAir has been proven to destroy greater than 99% of bacteria and viruses and reduce concentrations of odors and VOCs. The RxAir uses high-intensity germicidal UV lamps that destroy bacteria and viruses instead of just trapping them, setting it apart from ordinary air filtration units. RxAir units are sold online at www.RxAir.com and are available through multiple third-party distributors. RxAir® and ViraTech ® are registered trademarks of Vystar Corporation.\nVystar is the exclusive creator of Vytex Natural Rubber Latex (NRL), a multi-patented, all-natural, raw material that contains significantly reduced levels of the proteins found in natural rubber latex and can be used in over 40,000 products. Vytex NRL is a 100% renewable resource, environmentally safe, green and fully biodegradable. Vystar is working with manufacturers across a broad range of consumer and medical products bringing Vytex NRL to market in adhesives, gloves, balloons, condoms, other medical devices and natural rubber latex foam mattresses, toppers, and pillows.\nIn April of 2018, Vystar acquired the assets of NHS Holdings, LLC (NHS) to move into direct product offerings made from Vytex® latex. NHS was the exclusive U.S. distributor of Vystars Vytex® natural rubber latex foam to manufacturers for use in over 200 home furnishings products, including mattresses, toppers, pillows and upholstery, sold through multiple channels.\nIn May of 2019, Vystar acquired the assets of Fluid Energy Conversion Inc. (FEC), primarily consisting of its patent on the Hughes Reactor, which has the ability to control, enhance, and focus energy in flowing liquids and gases. Vystar intends to use this technology to enhance the effectiveness of Vystars RxAir purification system to destroy airborne pathogens while decreasing the cost and size of Vystars RxAir units.\nIn July of 2019, Vystar acquired 58% of the outstanding shares of common stock of Murida Furniture Co., Inc. dba Rotmans Furniture (Rotmans), formerly one of the largest independent furniture retailers in the U.S. Rotmans sold a broad line of residential furniture and decorative accessories and served customers throughout the New England region. The acquisition enabled Vystar to capitalize on the infrastructure already in place at Rotmans for accounting, retail sales facilities and staff, customer service, warehousing, and delivery. Rotmans closed its showroom at the end of 2022.\nIn December of 2020, Vystar selected Corrie MacColl Limited, a subsidiary of global natural rubber supply chain manager Halcyon Agri, as its exclusive global partner for all aspects of product market development and distribution of patented Vytex deproteinized latex.\nCompetition\nRxAir\nThe residential air purification market is a highly fragmented competitive business. Vystar competes with a large number of companies on many factors including price, quality, innovation, reputation, distribution and promotion.\nFurniture Store\nRotmans closed in December 2022. The retail sale of home furnishings is a highly competitive business. There has been growth in the e-commerce channel both from internet only retailers and those with a brick-and-mortar presence. We also competed with numerous individual retail stores as well as chains in our immediate geographic area. Mass merchants and certain department stores also have limited furniture product offerings.\nNatural Rubber Latex\nSynthetic raw materials such as ethylene, propylene, styrene and butadiene compete with NRL. Currently, it is estimated that NRL processors have lost one-half of the overall latex market to synthetic latex. Despite the switch to non-latex alternatives, it is estimated that almost 70% of exam gloves and nearly 80% of surgical gloves used in U.S. hospitals are still made with NRL.\nIntellectual Property\nVystar currently holds a portfolio of patents and trademarks in the U.S. and other various foreign countries. No assurance can be given that such patent and trademark protection will provide substantial protection from competition. We are committed to aggressively challenging any infringements of our patents and/or trademarks.\nGovernment Regulation\nWe are not subject to direct governmental regulation other than the laws and regulations generally applicable to businesses in the domestic and foreign jurisdictions in which we operate.\nOur RxAir400 product was cleared by the FDA as a Class II medical device in November 2008. FDA clearance to sell our product as a Class II medical device provides invaluable credibility in the marketplace. By granting a listing, the FDA indicates it has reviewed all aspects of a product, including efficacy of the technology, independent test results and product safety to ensure that the product complies with our claims. Few air purification products are listed by the FDA, and it is extremely important that we expend the resources necessary to maintain this listing as a Class II medical device with the FDA.\nSeasonality\nOur business is affected by traditional retail seasonality, advertising and promotion programs and general economic trends.\nEmployees\nAs of December 31, 2022, Vystar had one employee, Steven Rotman, CEO. Rotmans had 4 full-time employees. None of the employees are represented by a labor organization or a party to any collective bargaining arrangement.\nCorporate Information\nVystar Corporation is a Georgia corporation that was incorporated in 2003. Our predecessor company, Vystar LLC, was formed by our founder, Travis Honeycutt, in February 2000 as a Georgia limited liability company. Our corporate office is located at 725 Southbridge Street, Worcester, Massachusetts 01610. Our website address is www.vystarcorp.com.\nThe information contained on, or that can be accessed through, our website is not a part of this Report. We have links on our website to reports, information statements, and other information that we file electronically with the Securities and Exchange Commission, or SEC, at the Internet website maintained by the SEC, www.sec.gov. In addition to visiting our website and the SECs website, you may read and copy public reports we file with or furnish to the SEC at the SECs Public Reference Room at 100 F Street, N.E., Washington, D.C. 20549. You may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. ITEM 1A. RISK FACTORS\nOur business is subject to a number of risks and uncertainties - many of which are beyond our control - that may cause our actual operating results or financial performance to be materially different from our expectations. If one or more of the events discussed below were to occur, actual outcomes could differ materially from those expressed in or implied by any forward-looking statements we make in this report or our other filings with the SEC, and our business, financial condition, results of operations or liquidity could be materially adversely affected; furthermore, the trading price of our common stock could decline and our shareholders could lose all or part of their investment.\nVystar presently does not generate the cash needed to finance its current and anticipated operations.\nThe Company is still in the early stage of establishing our business including attracting new customers and increasing sales. Our financial success will be dependent upon the soundness of our business concept, our managements ability to successfully and profitably execute our plan, and our ability to raise additional capital.\nOur limited operating history makes it difficult to evaluate our business. We expect to make significant future operating expenditures to develop and expand our business into areas such as OEM product lines and offerings in the mattress and furniture arenas. We may incur significant losses in the future for a number of reasons, including due to the other risks described in this Report, and we may encounter unforeseen expenses, difficulties, complications and delays and other unknown events. Accordingly, we may not be able to achieve or maintain profitability, and we may incur significant losses for the foreseeable future. See additional discussion under Liquidity and Capital Resources.\nAt December 31, 2022 our cash position was $12,274 and we had an accumulated deficit of $55,386,668. We plan to finance our operations for the next twelve (12) months through the use of cash on hand, raising capital through private placement and increased sales from RxAir products by exploring sales partnerships with third-party wholesalers and retailers. You should consider, among other factors, our prospects for success in light of the risks and uncertainties encountered by companies that, like us, have not generated net earnings on an annual basis. Various factors, such as economic conditions, regulatory and legislative considerations, and competition, may also impede our ability to expand our market presence. We may not successfully address these risks and uncertainties or successfully implement our operating strategies. If we fail to do so, it could materially harm our business and impair the value of our common stock. Even if we accomplish these objectives, we may not generate positive cash flows or profits we anticipate in the future.\nThe following risk factors apply to our RxAir business:\nWe face significant competition from multinational and regional manufacturers.\nThe growing air purification market is highly competitive with companies offering wide range of air purifiers sold through e-commerce websites, company-owned websites, retailer and their websites and distributors. Market participants compete on product performance, quality, price and reputation.\nWe are dependent upon the ability of our third-party producers to meet our requirements.\nWe source our products from non-exclusive, third-party producers, many of which are located in foreign countries. We depend upon the ability of third-party producers to secure a sufficient supply of raw materials, a skilled workforce, adequately finance the production of goods ordered and maintain sufficient manufacturing and shipping capacity. We cannot be certain that we will not experience operational difficulties with our manufacturers, such as insufficient quality control, failures to meet production deadlines or increases in manufacturing costs.\nThe following risk factors apply to our Vytex business:\nOur Vytex operating results could fluctuate and differ considerably from our financial forecasts.\nOur business model is based on experience derived from the marketplace. There are no assurances that this experience will prove to be valid for our future operations or plans.\nOur operating results may fluctuate significantly as a result of a variety of factors, including:\n● Acceptance by manufacturers of the Vytex Natural Rubber Latex technology;\n● Our ability to achieve and sustain profitability;\n● Consumer confidence in products manufactured using our Vytex Natural Rubber Latex technology;\n● Our ability to raise additional capital.\nOur Vytex NRL business is totally dependent on market demand for, and acceptance of, the Vytex Natural Rubber Latex process.\nWe expect to derive most of our Vytex NRL business revenue from the sales of our Vytex Natural Rubber Latex raw material to various manufacturers of rubber and rubber end products using NRL through our distribution agreement with CMC Global. We pay natural rubber latex processors a fee for the service of manufacturing and creating Vytex NRL for us under our manufacturing and distribution agreements. Conversely, Vystar collects a fee under the CMC Global licensing model. Our Vytex NRL product operates within broad, diverse and rapidly changing markets. As a result, widespread acceptance and use of product is critical to our future growth and success. If the market for our product fails to grow or grows more slowly than we currently anticipate, demand for our product could be negatively affected.\nOur ability to generate significant revenue in the Vytex business is substantially dependent upon the willingness of consumers to make discretionary purchases and the willingness of manufacturers to utilize capital for research and development and the retooling of their manufacturing process, both of which are impacted by the state of the economy.\nThe current state of the world economy has and likely will in the future impact upon our ability to increase revenue. Certain products that we anticipate will be manufactured with our Vystar NRL process, such as mattresses and sponge products, are considered discretionary consumer purchases which decline during economic downturns. Additionally, certain manufacturers who might otherwise utilize the Vytex NRL process in the manufacturing of products with NRL have determined not to expend capital to complete the research of the Vytex NRL process or to retool their manufacturing process because of the general downturn in the economy. As part of a strategy to increase awareness of the Vytex NRL brand, the Company has been aggressively seeking to have end products produced and labeled made with Vytex NRL such as mattresses, toppers and pillows. As these products enter the market, the Company plans to create consumer awareness of these end products and in so doing begin to develop consumer demand pull through as part of the Companys efforts to complete the push-pull cycle using an ingredient branding strategy.\nAssertions by a third party that our Vytex process infringes its intellectual property, whether or not correct, could subject us to costly and time-consuming litigation or expensive licenses.\nThere is frequent litigation based on allegations of infringement or other violations of intellectual property rights. As we face increasing competition and become increasingly visible as an operating company, the possibility of intellectual property rights claims against us may grow.\nAny intellectual property rights claim against us or our customers, with or without merit, could be time-consuming, expensive to litigate or settle and could divert management attention and financial resources. An adverse determination also could prevent us from offering our process, require us to pay damages, require us to obtain a license or require that we stop using technology found to be in violation of a third partys rights or procure or develop substitute services that do not infringe, which could require significant resources and expenses.\nThe latex market in which we will participate is competitive and if we do not compete effectively, our operating results may be harmed.\nThe markets for our product are competitive and rapidly changing. With the introduction of new technologies, increasing scrutiny of alternative lattices such as Russian dandelion, and new market entrants, we expect competition to intensify in the future. In addition, pricing pressures and increased competition generally could result in reduced sales, reduced license fees or the failure of our products to achieve or maintain widespread market acceptance.\nWhile continued interest is strong in a new innovative product in the natural rubber latex industry, pricing and regulatory approvals remain a key selling factor.\nOur Vytex revenue will vary based on fluctuations in commodity prices for NRL.\nNRL is a commodity and, as such, its price fluctuates daily. Our raw material revenue including licensing fees and cost of goods will also fluctuate upward or downward based upon changing market prices for the raw material used to produce Vytex NRL. Prolonged periods of lowered market prices can also cause manufacturers to review synthetic price drops as they look for even lower cost alternatives to NRL.\nWhile Vytex NRL has received 510(k) clearance from the FDA for condoms and exam gloves, there is no assurance that future applications will be cleared.\nIn order for Vytex to be used in medical device applications, the manufacturer of the end product must submit an application to the FDA. If the device is classified by the FDA as Class II (e.g., condoms, surgical gloves, and most non-cardiac and non-renal/dialysis catheters) and in some cases Class I (e.g., exam gloves), a 510(k) application must\nbe filed with the FDA seeking clearance to market the device based on the fact that there is at least one other predicate or similar device already marketed. If the product is classified as a Class III product (e.g., most cardiac and renal/dialysis catheters, certain adhesives and other in vivo devices), or is otherwise a new device with no predicate on the market already, then the manufacturer of the end product must submit a Pre-Market Approval (PMA) application seeking approval by the FDA to market the device. The PMA approval process is much more in depth and lengthy and requires a greater degree of clinical data and FDA review than does a 510(k) clearance process.\nSince Vytex is a raw material and not an end-product, Vystar is not the entity that files with the FDA for any clearance or approval to market a device. Instead, the end-product manufacturers who will be selling and marketing the device(s) must submit applications and seek FDA clearance or approval depending upon the device classification. Vystars role in this process is only as background support to the manufacturers to supply information and any technical or test data regarding the Vytex raw material.\nAn American manufacturer of condoms and exam gloves had been engaged in production work and had completed required testing and received FDA clearance for using Vytex NRL in their condom and exam glove lines. However, this manufacturer is not currently producing products made with Vytex NRL or any other type of raw material. Notwithstanding such approvals, we have no assurance that future products will provide acceptable test results and even if they do, there is no certainty that the FDA will approve the applications.\nEach of the above mentioned 510(k)s have been sold to other manufacturers hence the need to pursue 510(k)s for the newer manufacturing facilities.\nVytex may seek to have lower protein claims than what is currently on the market today for exam gloves and may ultimately seek to have latex warnings removed from or modified on all FDA-regulated products, but it cannot guarantee that either of such actions will be approved by the FDA.\nThe FDA heavily scrutinizes any and all claims categorizing the protein levels and other claims of an NRL product. Currently, the FDA has allowed claims only stating the level of less than 50 micrograms/gram of total extractable proteins pursuant to only one of two FDA-recognized standards on exam or surgical gloves. Vystar intends to claim protein levels pursuant to both of the two FDA-recognized standards, which will result in claiming the lowest level of antigenic proteins for a Hevea NRL product currently on the market. Although the FDA has cleared such claims on the condom using Vytex NRL, the FDA rejected those claims for the exam glove. There is no guarantee that the FDA will ultimately or ever allow these claims on an exam glove.\nAdditionally, for many years, the FDA has required warnings on products containing latex due to the latex allergy issue that exists. Vystar plans on petitioning the FDA to have that label removed from or modified on products manufactured with Vytex NRL, by filing a Citizens Petition. The Petition will be filed when we see that the benefits of filing will far outweigh the costs since such Petition is likely to require clinical test results indicating acceptable allergic reactions associated with Vytex NRL. There are no assurances that the FDA will grant that request.\nManufacturers are implementing trials of Vytex NRL in their facilities but final data is not yet available from all these manufacturers on its viability for their particular environments.\nOver the past several years, samples of Vytex NRL have been made available to over 50 natural rubber latex and latex substitute end product manufacturers, 30 of which have been in place since early 2009. Since the completion of the Vytex NRL Standard Operation Procedures (SOPs), Vytex has been produced at Revertex (Malaysia), Occidente (Guatemala), KAPVL (India) and most recently Mardec-Yala (Thailand) and MMG (Thailand). Under the 2020 agreement with CMC Global, that entity is responsible for manufacturing, marketing and selling Vytex exclusively including sampling. Manufacturers that have signed a ‘sampling agreement with us have been provided with samples of Vytex NRL for validating its use in their manufacturing processes.\nAnother risk is the validity of the customer as testing completes. Recently Vystar has completed more than three years of a specialized version of Vytex NRL only to have the end product manufacturer fail to upgrade their production line and fulfill their own contract. As part of the Companys learnings, we have found that in listening closely to customer challenges and needs, our technical team has been able to develop solutions. The Company has come to realize that what we offer is not just a raw material but often a technology solution to a production or product development challenge.\nWhile many of these new formulations look promising, there is no guarantee that these technological innovations will be successfully scaled up or successfully implemented by the customer.\nThe following risk factors apply to our company as a whole:\nOur use of foreign sources of production for a portion of our products exposes us to certain additional risks associated with international operations.\nOur use of foreign sources for the supply of certain of our products exposes us to risks associated with overseas sourcing. These risks are related to government regulation, volatile ocean freight costs, delays in shipments, and extended lead time in ordering. Governments in the foreign countries where we source our products may change their laws, regulations and policies, including those related to tariffs and trade barriers, investments, taxation and exchange controls which could make it more difficult to service our customers resulting in an adverse effect on our earnings. We could also experience increases in the cost of ocean freight shipping which could have an adverse effect on our earnings. Shipping delays and extended order lead times may adversely affect our ability to respond to sudden changes in demand, resulting in the purchase of excess inventory in the face of declining demand, or lost sales due to insufficient inventory in the face of increasing demand, either of which would also have an adverse effect on our earnings or liquidity.\nSignificant fluctuations in the cost of raw materials could adversely affect our profits.\nOn a global and regional basis, the raw materials used in our products are susceptible to significant price fluctuations due to supply/demand trends, transportation costs, government regulations and tariffs, changes in currency rates, the economic and political climate and other circumstances. Significant increases in the future could materially affect our costs and profits.\nBecause our stock price may be volatile due to factors beyond our control, you could lose all or part of your investment.\nPrice and volume of stock, including additional stock issuances may cause price decline and dilution.\nIf we do not attract and retain highly qualified employees, we may not be able to grow effectively.\nOur ability to compete and grow depends in large part on the efforts and talents of our executive officers or employees. We require the key employee(s) to enter into employment agreements, but in the U.S., employees are free to leave an employer at any time without penalties. The loss of key employees or the inability to hire additional skilled employees as necessary could result in significant disruptions of our business, and the integration of replacement personnel could be time-consuming and expensive and cause us additional disruptions.\nWe do not expect to declare any dividends in the foreseeable future.\nWe do not anticipate declaring any cash dividends to holders of our common stock in the foreseeable future. Consequently, shareholders must rely on sales of their common stock after price appreciation, which may never occur, as the only way to realize any future gains on their investment. Investors seeking cash dividends should not purchase our common stock.\nThere is no assurance that any significant public market for our shares of common stock will develop.\nWhile our shares of common stock trade on the OTC Bulletin Board under the symbol VYST, there is currently no significant public market for our common stock and there is no assurance that there will be any such significant public market for our common stock in the future.\nThe utilization of our tax losses could be substantially limited if we experience an ownership change as defined in the Internal Revenue Code.\nBecause of net operating losses we have experienced for federal income tax purposes at December 31, 2022, we had federal net operating loss (NOL) carry-forwards of approximately $40 million ($36 million for 2021) available to offset future taxable income. Our ability to utilize NOL carry-forwards to reduce future taxable income may be limited under Section 382 of the Internal Revenue Code if certain ownership changes in our Company occur during a rolling three-year period. These ownership changes include purchases of common stock under share repurchase programs, the offering of stock by us, the purchase or sale of our stock by 5% shareholders, as defined in the Treasury regulations, or the issuance or exercise of rights to acquire our stock. If such ownership changes by 5% shareholders result in aggregate increases that exceed 50 percentage points during the three-year period, then Section 382 imposes an annual limitation on the amount of our taxable income that may be offset by our NOL carry-forwards or tax credit carry-forwards at the time of ownership change. The limitation may affect the amount of our deferred income tax asset and, depending on the limitation, a significant portion of our NOL carry-forwards or tax credit carry-forwards could expire before we are able to use them. In such an event, our business, financial condition, results of operations or cash flows could be adversely affected. We believe we have not experienced an ownership change under Section 382 of the Internal Revenue Code as of December 31, 2022; however, the amount by which our ownership may change in the future could be affected by purchases and sales of stock by 5% shareholders and new issuances of stock by us, should we choose to do so. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nAlthough we believe that our current space is adequate for the foreseeable future, if additional office space is required, we believe that suitable space will be available at market rates. ITEM 3. LEGAL PROCEEDINGS\nEMA Financial\nOn February 19, 2019, EMA Financial, Inc. filed a lawsuit in the Southern District of New York against the Company. The lawsuit alleged various breaches of an underlying convertible promissory note and stock purchase agreement and sought four claims for relief: (i) specific performance to enforce a stock conversion and contractual obligations; (ii) breach of contract; (iii) permanent injunction to enforce the stock conversion and contractual obligations; and (iv) legal fees and costs of the litigation. The complaint was filed with a motion seeking: (i) a preliminary injunction seeking an immediate resolution of the case through the stock conversion; (ii) a consolidation of the trial with the preliminary injunctive hearing; and (iii) summary judgment on the first and third claims for relief.\nThe Company filed an opposition to the motion and upon oral argument the motion for injunctive relief was denied. The Court issued a decision permitting a motion for summary judgment to proceed and permitted the Company the opportunity to supplement its opposition papers together with the plaintiff who was also provided opportunity to submit reply papers. On April 5, 2019, the Company filed the opposition papers as well as a motion to dismiss the first and third causes of action in the complaint. On March 13, 2020, the Court granted the Companys motion dismissing the first and third claims for relief and denied the motion for summary judgment as moot.\nThe Company subsequently filed an amended answer with counterclaims. The affirmative defenses if granted collectively preclude the relief sought. In addition, Vystar filed counterclaims asserting: (a) violation of 10(b)(5) of the Securities and Exchange Act; (b) violation of Section 15(a)(1) of the Exchange Act (failure to register as a broker-dealer); (c) pursuant to the Uniform Declaratory Judgment Act, 28 U.S.C. §§ 2201, the Company requests the Court to declare: (i) pursuant to Delaware law, the underlying agreements are unconscionable; (ii) the underlying agreements are unenforceable and/or portions are unenforceable, such as the liquidated damages sections; (iii) to the extent the agreement is enforceable, Vystar in good faith requests the Court to declare the legal fee provisions of the agreements be mutual (d) unjust enrichment; (e) breach of contract (in the alternative); and (f) attorneys fees.\nOn June 10, 2020, EMA filed a motion for summary judgment as to its remaining claims for relief and a motion to dismiss the Companys affirmative defenses and counterclaims. The Company opposed the motion on July 10, 2020, and the same was fully submitted to the Court on July 28, 2020. On March 29, 2021, the Court issued a decision granting in part and denying in part the motion. Specifically, the Court granted that part of the motion seeking summary judgment and dismissal on the Companys affirmative defense and counterclaim regarding Sections 15(a)/29(b) of the Exchange Act. Two weeks later the Company filed a motion for reconsideration as to the dismissal portion of the order, or, for the alternative, a motion for certification for the right to file a petition to the Second Circuit Court of Appeals on the issue. The Court denied the motion for reconsideration and certification. Subsequently, fact discovery has been completed and on June 24, 2022, both parties submitted competing motions for summary judgment.\nEMA seeks summary judgment on its breach of contract and attorneys fees claims, specifically seeking damages in the amount of $1,820,000 with 24% interest premised on the argument it was entitled to effectuate a January 15 and February 5, 2019, notices of conversions. EMA further seeks to dismiss Vystars affirmative defenses and counterclaims. Conversely, Vystar filed its motion for summary judgment seeking an order to dismiss the EMA complaint on the grounds: (i) the underlying note was satisfied on December 11, 2018; and (ii) EMA, through multiple breaches of the note, over-converted the note by 36,575,555 shares equating to a request of damages against EMA and in favor of Vystar for $4,802,000, with interest accruing at 24%, and attorneys fees. The briefing by the parties was fully submitted on July 29, 2022.\nOn January 6, 2023, the Court issued a series of preliminary rulings based upon the parties respective summary judgment motions. Those rulings narrowed the outstanding issues (and claims) to only the parties breach of contract claim and counterclaim (and affirmative defenses) regarding the conversion process. Of particular importance, the Court found EMA breached the note by failing to effectuate the conversions in the manner outlined by the controlling note. The Court further found the principal balance at issue was $80,000, interest accrued from the date set in the note and default interest, to the extent applicable, was to accrue at the default rate from September 2018, forward. The Court left undecided whether EMAs breach of the note was material, whether affirmative defenses as previously raised by the parties were applicable to each parties contractual claim, and a damages analysis associated with the same. The Court then requested a supplemental briefing as to the issues of materiality, liability and damages. The issues were fully briefed and submitted on February 24 and March 15, 2023. The parties await a final decision from the Court. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II. ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND PURCHASES OF EQUITY SECURITIES\nMarket Price Information\nOur common stock is traded in the United States on the Over the Counter Bulletin Board (OTCBB) under the symbol VYST. The following table shows the range of high and low closing prices for our common stock.\nHigh Low\nDecember 31, 2021\nFirst Quarter $ 5.70 $ 2.79\nSecond Quarter $ 3.37 $ 1.87\nThird Quarter $ 3.15 $ 1.67\nFourth Quarter $ 1.89 $ 0.81\nDecember 31, 2022\nFirst Quarter $ 1.00 $ 0.62\nSecond Quarter $ 0.78 $ 0.41\nThird Quarter $ 0.46 $ 0.27\nFourth Quarter $ 0.28 $ 0.10\nThese quotations do not reflect retail markup, markdown or commission and may not necessarily represent the prices of actual transactions during these quarterly periods.\nHolders of Record\nAs of December 31, 2022, there were 209 holders of record of our common stock. Because some of our shares are held by brokers and other institutions on behalf of shareholders, we are unable to estimate the total number of stockholders represented by these record holders.\nDividend Policy\nWe have never paid or declared any cash dividends on our common stock and we do not intend to pay or declare dividends on our common stock in the near future. We presently expect to retain any future earnings to fund continuing development and growth of our business. Our payment of dividends is subject to the discretion of our board of directors and will depend on earnings, financial condition, capital requirements and other relevant factors.\nIssuer Purchases of Equity Securities\nNone.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nInformation concerning our equity compensation plans is set forth in Item 12 of Part III of this Annual Report on Form 10-K.\nRecent Sales of Unregistered Securities\nCommon Stock and Warrant Grants\nFrom January 1, 2022 through December 31, 2022, Vystar retired 200 shares of our common stock.\nStock Option Grants\nThere were no stock option grants issued from January 1, 2022 through December 31, 2022.\nProceeds from loans and shareholder, convertible and contingently convertible notes payable\nThere were no proceeds from October 1, 2022 through December 31, 2022.\nApplication of Securities Laws and Other Matters\nNo underwriters were involved in the foregoing sales of securities. The securities described above were issued to investors in reliance upon the exemption from the registration requirements of the Securities Act, as set forth in Section 4 (2) under the Securities Act and Regulation D promulgated thereunder, as applicable, relative to sales by an issuer not involving any public offering, to the extent an exemption from such registration was required.\nThe issuance of stock options as described above were issued pursuant to written compensatory plans or arrangements with our employees, directors and consultants, in reliance on the exemption provided by Rule 701 promulgated under the Securities Act. All recipients either received adequate information about us or had access, through employment or other relationships, to such information.\nAll of the foregoing securities are deemed restricted securities for purposes of the Securities Act. All certificates representing the issued shares of common stock, warrants and options described above included appropriate legends setting forth that the securities had not been registered and the applicable restrictions on transfer. ITEM 6. SELECTED FINANCIAL DATA\nAs a smaller reporting company, we are not required to provide the information required by this Item pursuant to 301(c) of Regulation S-K. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis analysis of our results of operations should be read in conjunction with the accompanying financial statements, including notes thereto, contained in Item 8 of this Report. This Report contains certain forward-looking statements within the meaning of Section 27A of the Securities Act, and Section 21E of the Exchange Act. Statements that are predictive in nature and that depend upon or refer to future events or conditions are forward-looking statements. Although we believe that these statements are based upon reasonable expectations, we can give no assurance that projections will be achieved. Please refer to the discussion of forward-looking statements included in Part I of this Report.\nOverview\nAbout RxAir\nRxAir promotes a healthy lifestyle through the use of its innovative, patented ViraTech air purification technology, thereby improving the quality of life of each and every customer. Independently tested by EPA- and FDA-certified laboratories, the RxAir has been proven to destroy greater than 99% of bacteria and viruses and reduce concentrations of odors and VOCs. The RxAir uses high-intensity germicidal UV lamps that destroy bacteria and viruses instead of just trapping them, setting it apart from ordinary air filtration units. RxAir® and ViraTech® are registered trademarks of Vystar Corp. For more information, visit http://www.RxAir.com.\nThe Companys RxAir product line use 48 inches of high-intensity germicidal UV lamps that destroy bacteria, viruses and other germs instead of just trapping them, setting it apart from ordinary air filtration units. RxAir is one of the few UV air purifiers that have been proven in independent EPA- and FDA- certified testing laboratories to destroy on the first pass 99.6% of harmful airborne viruses and bacteria. In addition to inactivating airborne viruses that cause influenza (flu) and colds, RxAirs device disarms the airborne pathogens that cause MRSA (staph), strep (whooping cough), tuberculosis (TB), measles, pneumonia and a myriad of other antibiotic-resistant and viral infections.\nThe RxAir product line includes:\n● RxAir™ Residential Filterless Air Purifier\n● RX400 ™ FDA cleared Class II Filterless Air Purifier\n● RX3000™ Commercial FDA cleared Class II Air Purifier\nVystar produces the RxAir product line with a world-class manufacturer and an expert U.S. engineer with a full understanding of the RxAir technology. Vystar sells RxAir residential and commercial units via distributors, online and through retail channels. Vystar is assembling the distribution network to relaunch sales of RX400 and RX3000 units to the healthcare and medical markets, which UV Flu had ceased due to a lack of sales force, distribution and cash flow constraints. Once sales are firmly re-established, Vystar expects that the air purification products will produce margins of approximately 70%.\nAbout Rotmans\nRotmans, formerly the largest furniture and flooring store in New England and one of the largest independent furniture retailers in the U.S., encompassed over 170,000 square feet in Worcester, Mass., employed approximately 50 people, was founded and had been under the leadership of the Rotman family for the past 50 years. Rotmans added approximately $20 million annually to Vystars top line revenue and enabled Vystar to capitalize on the infrastructure already in place for accounting, retail sales facilities and staff, customer service, warehousing, and delivery. Steven Rotman and a group of dedicated employees provided continuity of management and customer-focused values for the Company until closure in late December 2022.\nAbout Vytex\nVytex is a multi-patented latex raw material in which the allergy causing proteins are reduced to a level that falls at or below detection based on ASTM approved test methods. Vytex has been available as a raw material commercially for fourteen years and through that time has a group of manufacturers who use it in end products such as electrical gloves, condoms, adhesives, etc. Ironically, most use Vytex as its better for their manufacturing process as an easier to use raw material and not for protein properties. As of mid-2020 Vystar and the Indian Rubber Manufacturers Research Associations (IRMRA) had been actively collaborating to develop viscoelastic deproteinized natural rubber (DPNR) variants having properties for expanding applications in specific new arenas such as green tires, biodegradable and other unique bioelastoplast product lines that desire a new approach. Additionally, this research, while slowed by the COVID-19 pandemic, showed attributes with extra low ammonia offerings that are desired.\nTowards the end of 2020, Vystar entered into a Market Development and Distribution Agreement with Corrie MacColl, Ltd. (CMC Global) to produce, develop and manage the Vytex product and supply lines. This agreement allows Vystar to expand the market for its Natural Rubber Latex products and has garnered much attention across a broad range of industries including liquid Vytex as well as the newly developed dry rubber Vytex. As of the date of this report, CMC Global has provided numerous opportunities that are in a trial basis or moving towards manufacturing trials in industries that use a significant amount of natural rubber latex, hence Vytex that now includes production size trial runs in a large dipped product consumer line starting late 2022. As of January 2023, Vytex is now in full R&D phase for a large corporation focused on replacing a petrochemical based binder with a water-based coating using Vytex. As the move to use sustainable materials grows so does interest in Vytex through Corrie MacColl. Additionally, Vystar now has a testing supply of Vytex dry rubber for larger trials. The success of early trials and the shipping crisis has led to broader spectrum of manufacturers combining the potential of Cameroon production with strategically placed contract manufacturers based on geographical needs including the North American market. Also, Vystar research has shown great strides in specializing liquid Vytex (ultra-low protein latex, ULPL) to meet the immediate needs of customers such as low or no nitrosamine and others (discussed in the presentation below available in the pdf) and additional patents have been proposed to cover these findings. Research into dry rubber continues at a moderate pace as tire companies seek out alternatives to synthetics.\nIn Halcyon Agri (owner of CMC Global), 2020 Corporate Report: Our group-wide innovation capabilities have enabled us to engage in innovative commercial partnerships. Corrie MacColl is collaborating with Vystar to transform our Cameroon plantation output into ultra-pure latex with stronger molecular bond that offers enhanced strength, durability, and flexibility in the end products. This is achieved by removing non-rubber components and 99.85% of the proteins. CMC Global continues to work with the facility at Cameroon to produce Vytex at their owned processing plant.\nVytex researcher Dr. Ranjit Matthan and CMC Global Director John Heath presented at The International Latex Conference which was held virtually July 20 to 22, 2021 and offered a plenary session entitled Innovations and Sustainability in Natural Rubber Latex - The New Paradigm. The presentation discussed the dramatic effect the COVID-19 pandemic has had on the natural rubber supply chain, and how the industry is reacting the new economic circumstances; including strategy and policy shifts in supply chain management and restoring greater geographic diversification of latex processing and product manufacturing. The R&D association with IRMRA promises quicker laboratory and field-based testing and evaluations downstream. At Vystar, the recalibrated sustainability programme (FSC, nitrosamines & ammonia free, ultralow proteins, no SVHC and green carbon neutrality) emphasize certifications with Corrie MacColl market reach facilitating faster rollouts. Nontraditional/non Hevea brasiliensis based production efforts are likely to continue to face new penetration and high cost-benefit acceptance challenges in this decade. A PDF of the full presentation is available on vytex.com.\nAdditionally, in August 2021, Dr. Matthan presented new data to the Automotive Tyre Manufacturers Association including Vytex dry rubber.\nManagement Objectives\nThe COVID-19 pandemic has raised awareness of airborne disease transmission and consumers desire to reduce their risk of infection through the use of air purifiers. The Company has pivoted its resources to meeting the demand for air purifiers by adding additional distributors to the RxAir sales network and contracting the development of the next generation RxAir Ultraviolet-C light air purifiers.\nVystar and the Indian Rubber Manufacturers Research Associations (IRMRA) are actively collaborating to develop viscoelastic deproteinized natural rubber (DPNR) variants having properties for expanding applications in specific new arenas such as green tires, biodegradable and other unique bioelastoplast product lines that desire a new approach.\nVystar entered into a Market Development and Distribution Agreement with Corrie MacColl to produce, develop and manage the Vytex product and supply lines. This agreement allows Vystar to expand the market for its Natural Rubber Latex products.\nCritical Accounting Policies and Estimates\nOur discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles. As such, we are required to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. By their nature, these estimates and judgments are subject to an inherent degree of uncertainty. Our management reviews its estimates on an on-going basis. We base our estimates and assumptions on historical experience, knowledge of current conditions and our understanding of what we believe to be reasonable that might occur in the future considering available information. Actual results may differ from these estimates, and material effects on our operating results and financial position may result.\nWe believe the following critical accounting policies affect our more significant judgments and estimates used in the preparation of our financial statements.\nFair Value Inputs Related to Share-based and Other Equity Compensation\nGenerally accepted accounting principles require all share-based payments, including grants of employee stock options, stock grants and warrants, to be recognized in the financial statements based on their fair values. We compute the value of option awards granted by utilizing the Black-Scholes valuation model based upon their expected lives, expected volatility, expected dividend yield, and the risk-free interest rate. The value of the awards is then straight-line expensed over the service period of the awards. Issuance in shares of common stock is valued using the closing market price on the measurement date.\nInventories\nInventories include those costs directly attributable to the product before sale. Inventories consist primarily of RxAir purifiers, foam toppers and pillows and are carried at net realizable value, which is defined as selling price less cost of completion, disposal and transportation. The Company evaluates the need to record write-downs for inventories on a regular basis. Approximate consideration is given to obsolescence, slow-moving and other factors in evaluating net realizable values. Inventories not expected to be sold within 12 months are classified as long-term.\nRevenue\nWe recognize revenue when we satisfy a performance obligation in a contract by transferring control over a product to a customer when product is shipped based on fulfillment by the Company. The Company considers fulfillment when it passes all liability at the point of shipping through third party carriers. Consideration is typically paid prior to shipment via credit card or check when our products are sold direct to consumers, which is typically within a 1 to 2 days or approximately 30 days from the time control is transferred when sold to wholesalers, distributors and retailers. Taxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue-producing transaction, that are collected by us from a customer, are excluded from revenue. Shipping and handling costs associated with outbound freight after control over a product has transferred to a customer are accounted for as a fulfillment cost and are included in cost of revenue. We assess our estimates of expected returns at each financial reporting date.\nValuation and Impairment of Intangible and Long-Lived Assets\nWe perform an impairment assessment of intangible assets including goodwill annually or more frequently as warranted by events or changes in circumstances. We review long-lived assets such as property and equipment for impairment whenever events or changes in circumstances indicate the carrying value may not be recoverable. If the total of the estimated undiscounted future cash flows is less than the carrying value of the assets, an impairment loss is recognized for the excess of the carrying value over the fair value of the long-lived assets. The Company recorded a loss on impairment in 2022 of $297,723 related to our reassessment of the UV Flu intangible assets. The Company recorded a loss on impairment in 2021 of $245,050 related to the discontinuation of NHS proprietary technology and customer relationships.\nAccounting for Derivative Financial Instruments\nThe Company evaluates stock options, stock warrants, notes payable or other contracts to determine if those contracts or embedded components of those contracts qualify as derivatives to be separately accounted for under the relevant sections of ASC 815-40, Derivative Instruments and Hedging: Contracts in Entitys Own Equity. The result of this accounting treatment could be that the fair value of a financial instrument is classified as a derivative instrument and is marked-to-market at each balance sheet date and recorded as a liability. In the event that the fair value is recorded as a liability, the change in fair value is recorded in the statement of operations as other income or other expense. Upon conversion or exercise of a derivative instrument, the instrument is marked to fair value at the conversion date and then that fair value is reclassified to equity. Financial instruments that are initially classified as equity that become subject to reclassification under ASC 815-40 are reclassified to a liability account at the fair value of the instrument on the reclassification date.\nLeases\nThe Company has adopted and implemented ASC 842, Leases, where Rotmans recognized right-of use assets and lease liabilities. For leases in which the acquiree is a lessee, the Company measured the lease liability at the present value of the remaining lease payments, as if the acquired lease were a new lease at the acquisition date. The Company measured the right-of-use asset at the same amount as the lease liability as adjusted to reflect favorable and unfavorable terms of the lease when compared with market terms.\nRESULTS OF OPERATIONS\nYear ended December 31, 2022 compared to year ended December 31, 2021\nYear Ended December 31,\n$ Change % Change\nCONSOLIDATED\nRevenue $ 116,533 $ 1,669,002 $ (1,552,469 ) -93.0 %\nCost of revenue 505,225 1,910,902 (1,405,677 ) -73.6 %\nGross loss (388,692 ) (241,900 ) (146,792 ) 60.7 %\nOperating expenses:\nSalaries, wages and benefits 256,704 326,398 (69,694 ) -21.4 %\nShare-based compensation 837,468 822,070 15,398 1.9 %\nProfessional fees 201,056 557,666 (356,610 ) -63.9 %\nAdvertising 34,855 251,391 (216,536 ) -86.1 %\nConsulting 257,511 199,923 57,588 28.8 %\nRent 8,393 85,184 (76,791 ) -90.1 %\nService charges 9,480 10,883 (1,403 ) -12.9 %\nDepreciation and amortization 140,472 179,472 (39,000 ) -21.7 %\nLoss on impairment 444,815 245,050 199,765 81.5 %\nOther operating 367,954 875,625 (507,671 ) -58.0 %\nTotal operating expenses 2,558,708 3,553,662 (994,954 ) -28.0 %\nLoss from operations (2,947,400 ) (3,795,562 ) 848,162 -22.3 %\nOther income (expense):\nInterest expense (214,104 ) (296,850 ) 82,746 -27.9 %\nChange in fair value of derivative liabilities 1,778,100 53,600 1,724,500 3217.4 %\nLoss on settlement of debt, net (2,060,123 ) (117,700 ) (1,942,423 ) 1650.3 %\nTotal other expense, net (496,127 ) (360,950 ) (135,177 ) 37.5 %\nNet loss from continuing operations (3,443,527 ) (4,156,512 ) 712,985 -17.72 %\nDiscontinued operations:\nIncome (loss) from operations (887,628 ) 2,515,827 (3,403,455 ) -135.3 %\nNet loss (4,331,155 ) (1,640,685 ) (2,690,470 ) 164.0 %\nNet (income) loss attributable to noncontrolling interest 372,803 (1,056,647 ) 1,429,450 -135.3 %\nNet loss attributable to Vystar $ (3,958,352 ) $ (2,697,332 ) $ (1,261,020 ) 46.8 %\nRevenues\nConsolidated revenues for the year ended December 31, 2022 and 2021 were $116,533 and $1,669,002, respectively, for a decrease of $1,552,469 or 93.0%. The decrease in revenues from operations was principally due to an increased return allowance and reduced market demand for our products with the lessening COVID-19 pandemic.\nConsolidated gross loss for the year ended December 31, 2022 and 2021 was $388,692 and $241,900, respectively, for an increase of $146,792 or 60.7%. Consolidated cost of revenue for year ended December 31, 2022 and 2021 was $505,225 and $1,910,902, respectively, a decrease of $1,405,677 or 73.6%. The increase in gross loss and cost of revenue was primarily due to decreased revenues.\nOperating Expenses\nThe Companys operating expenses consist primarily of compensation and support costs for management, sales and administrative staff, and for other general and administrative costs, including professional fees related to accounting, finance, and legal services as well as other operating expenses such as advertising and consulting. The Companys consolidated operating expenses was $2,558,708 and $3,553,662 for the year ended December 31, 2022 and 2021, respectively, for a decrease of $994,954 or 28%. The decrease in operating expenses was due to reduced professional fees, advertising and other operating expenses in connection with reduced revenues.\nOther Income (Expense)\nOther income (expense) for the year ended December 31, 2022 and 2021 was ($496,127) and ($360,950), respectively, for a net increase in expense of $135,177 or 37.5%. Increases in other income (expense) in 2022 included an increase in loss on settlement of debt, net of $1,942,423, an increase in change in value of derivative liabilities of $1,778,100 and a reduction of interest expense of $82,746.\nDiscontinued Operations\nIncome (loss) from discontinued operations for the year ended December 31, 2022 and 2021 was ($887,628) and $2,515,827, respectively, for a decrease of $3,403,455 or 135.3%. Income from discontinued operations in 2021 included forgiveness of Paycheck Protection Program loans of $2,805,800 and Employee Rentention Credits of $771,287.\nNet Loss\nNet loss for the year ended December 31, 2022 and 2021 was $4,331,155 and $1,640,685, respectively, for an increase in net loss of $2,690,470 or 164%. Net loss in 2022 and 2021 includes net (income) loss attributable to noncontrolling interest of $372,803 and ($1,056,647), respectively. The smaller net loss the Company experienced in the year ended December 31, 2021 was attributable to COVID-19 programs mainly the Paycheck Protection Program loans forgiven of $2,805,800 and Employee Retention Credits of $771,287.\nLIQUIDITY AND CAPITAL RESOURCES\nThe Companys financial statements are prepared using the accrual method of accounting in accordance with accounting principles generally accepted in the United States of America and have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities in the normal course of business. However, we have incurred significant losses and experienced negative cash flow since inception. At December 31, 2022, the Company had cash of $12,274 and a deficit in working capital of $3,069,379. For the year ended December 31, 2022, the Company had a net loss of $4,331,155 and an accumulated deficit of $55,368,868. For the year ended December 31, 2021, the Company had a net loss of $1,640,685 and the accumulated deficit amounted to $51,410,516. We use working capital to finance our ongoing operations, and since those operations do not currently cover all of our operating costs, managing working capital is essential to our Companys future success. Because of this history of losses and financial condition, there is substantial doubt about the Companys ability to continue as a going concern.\nNet cash used in operating activities was $617,193 for the year ended December 31, 2022 as compared to $2,499,954 for the year ended December 31, 2021. During the year ended December 31, 2022, cash used in operations was primarily due to the net loss for the year of $4,348,955 net of non-cash related add-back of share-based compensation, depreciation, amortization, change in fair value of derivative liabilities and loss on settlement of debt, net.\nThe Company had no investing activities during the year ended December 31, 2022 as compared to $371,431 cash used in investing activities for the year ended December 31, 2021.\nNet cash provided by financing activities was $499,947 during the year ended December 31, 2022, as compared to cash provided of $2,023,347 during the year ended December 31, 2021. During 2022, cash was provided from the proceeds from related party advances of $266,541 and issuance of preferred stock of $85,000. During 2021, cash was provided from the proceeds in notes payable in the amount of $290,000 and related party advances of $533,039.\nA successful transition to profitable operations is dependent upon obtaining sufficient financing to fund the Companys planned expenses and achieving a level of revenue adequate to support the Companys cost structure. Management plans to finance future operations using cash on hand, as well as increased revenue from RxAir air purifier sales and Vytex license fees, that now also include the Companys association with foam cores made from Vytex used in mattresses, mattress toppers and pillows.\nThere can be no assurances that we will be able to achieve projected levels of revenue in 2023 and beyond. If we are not able to achieve projected revenue and obtain alternate additional financing of equity or debt, we would need to significantly curtail or reorient operations during 2023, which could have a material adverse effect on our ability to achieve our business objectives and as a result, may require the Company to file for bankruptcy or cease operations. The financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts or amounts classified as liabilities that might be necessary should the Company be forced to take any such actions.\nOur future expenditures will depend on numerous factors, including: the rate at which we can introduce RxAir products and license Vytex NRL raw material and the foam cores made from Vytex to manufacturers and subsequently retailers; the costs of filing, prosecuting, defending and enforcing any patent claims and other intellectual property rights, along with market acceptance of our products, and services and competing technological developments. As we expand our activities and operations, our cash requirements are expected to increase at a rate consistent with revenue growth after we achieve sustained revenue generation.\nOff-Balance Sheet Arrangements\nWe do not have any material off-balance sheet arrangements.\nCertain Relationships and Related Transactions\nPer Steven Rotmans Employment agreement dated July 22, 2019, as amended, he is to be paid $125,000 per year in cash, $10,417 per month in shares based on a 20-day average price at a 50% discount to market, $5,000 per month in cash for expenses as well as access to a Company provided vehicle and health and life insurance. During the year ended December 31, 2022, the Company expensed approximately $417,000 related to this employment agreement. In addition, the Company issued 1,330,066 shares of Series C Preferred Stock for the settlement of debt totaling $3,552,321 in 2022. A loss of $1,900,950 was recognized on the issuance and is included in other expenses for the year. As of December 31, 2022, the Company had a stock subscription payable balance of $619,084, or approximately 920,000 shares to be issued in the future, $183,155 of reimbursable expenses payable and $116,403 of unpaid salary.\nBlue Oar Consulting, Inc. (Blue Oar) provides business consulting services to the Company. This entity is owned by Gregory Rotman, who is the son of the Companys CEO, Steven Rotman. Blue Oar provides business consulting services to the Company. In exchange for such services, the Company has entered into a consulting agreement with the related party entity. Per the consulting agreement, Blue Oar is to be paid $15,000 per month in cash for expenses, and $12,500 per month to be paid in shares based on a 20-day average at a 50% discount to market. During the year ended December 31, 2022, the Company expensed approximately $459,000 related to the consulting agreement. In addition, the Company issued 221,385 shares of Series C Preferred Stock for the settlement of debt and payables totaling $702,161 in 2022. A loss of $313,340 was recognized on the issuance and is included in other expenses for the year. As of December 31, 2022, the Company had a stock subscription payable balance of $629,903, or approximately 1,049,000 shares. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a smaller reporting company, we are not required to provide the information required by this Item pursuant to 301(c) of Regulation S-K. ITEM 8.\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Stockholders Deficit\nConsolidated Statements of Cash Flows\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Vystar Corporation:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Vystar Corporation. (the Company) as of December 31, 2022 and 2021, and the related consolidated statements of operations, stockholders equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has incurred significant losses and experienced negative cash flow since inception. At December 31, 2022, the Company had cash of $12,274 and a deficit in working capital of approximately $3 million. Further, at December 31, 2022 the accumulated deficit amounted to approximately $55 million. These conditions and the ability to successfully resolve these factors raise substantial doubt about the Companys ability to continue as a going concern.\nBasis for Opinion\nThese financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Macias, Gini, and OConnell LLP\nIrvine, California\nWe have served as the Companys auditor since 2020\nOctober 10, 2023\nPCAOB ID: 324\nVYSTAR CORPORATION\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\nASSETS\nCurrent assets:\nCash $ 12,274 $ 129,520\nAccounts receivable, net 12,145 22,131\nInventories 91,724 89,346\nPrepaid expenses and other 633,769 54,740\nAssets of discontinued operations 3,026,971 4,994,399\nTotal current assets 3,776,883 5,290,136\nProperty and equipment, net 140,886 184,442\nOther assets:\nIntangible assets, net 154,371 549,010\nGoodwill - 147,092\nInventories, long-term 63,009 429,147\nOther - 15,000\nAssets of discontinued operations 7,503,970 10,242,631\nTotal other assets 7,721,350 11,382,880\nTotal assets $ 11,639,119 $ 16,857,458\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent liabilities:\nAccounts payable $ 1,361,483 $ 1,983,898\nAccrued expenses 684,147 585,628\nStock subscription payable 1,655,208 1,247,549\nShareholder, convertible and contingently convertible notes payable and accrued interest - current maturities 336,263 1,388,904\nRelated party debt - current maturities 169,552 1,487,000\nUnearned revenue 44,479 79,368\nDerivative liabilities - 1,778,100\nRelated party advances 266,541 -\nLiabilities of discontinued operations 2,328,589 5,046,300\nTotal current liabilities 6,846,262 13,596,747\nLong-term liabilities:\nRelated party debt, net of current maturities and debt discount - 2,791,401\nLiabilities of discontinued operations 5,513,667 6,369,609\nTotal long-term liabilities 5,513,667 9,161,010\nTotal liabilities 12,359,929 22,757,757\nStockholders deficit:\nConvertible preferred stock series class A, $0.0001 par value 15,000,000 shares authorized; 8,698 shares issued and outstanding at December 31, 2022 and 2021 (liquidation preference of $170,000 and $162,000 at December 31, 2022 and 2021, respectively)\nConvertible preferred stock series B, $0.0001 par value 2,500,000 shares authorized; 370,969 and 0 shares issued and outstanding at December 31, 2022 and 2021, respectively (liquidation preference of $2,710,000 at December 31, 2022) -\nConvertible preferred stock series C, $0.0001 par value 2,500,000 shares authorized; 1,917,973 and 0 shares issued and outstanding at December 31, 2022 and 2021, respectively (liquidation preference of $5,233,000 at December 31, 2022) -\nConvertible preferred stock\n-\nCommon stock, $0.0001 par value, 500,000,000 shares authorized; 12,942,892 and 12,943,092 shares issued at December 31, 2022 and December 31, 2021, respectively, and 12,942,592 and 12,942,792 shares outstanding at December 31, 2022 and respectively 1,294 1,294\nAdditional paid-in capital 53,361,925 43,851,510\nAccumulated deficit (55,368,868 ) (51,410,516 )\nCommon stock in treasury, at cost; 300 shares (30 ) (30 )\nTotal Vystar stockholders deficit (2,005,449 ) (7,557,741 )\nNoncontrolling interest 1,284,639 1,657,442\nTotal stockholders deficit (720,810 ) (5,900,299 )\nTotal liabilities and stockholders deficit $ 11,639,119 $ 16,857,458\nThe accompanying notes are an integral part of these consolidated financial statements.\nVYSTAR CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended\nDecember 31,\nRevenue $ 116,533 $ 1,669,002\nCost of revenue 505,225 1,910,902\nGross loss (388,692 ) (241,900 )\nOperating expenses:\nSalaries, wages and benefits 256,704 326,398\nShare-based compensation 837,468 822,070\nProfessional fees 201,056 557,666\nAdvertising 34,855 251,391\nConsulting 257,511 199,923\nRent 8,393 85,184\nService charges 9,480 10,883\nDepreciation and amortization 140,472 179,472\nLoss on impairment 444,815 245,050\nOther operating 367,954 875,625\nTotal operating expenses 2,558,708 3,553,662\nLoss from operations (2,947,400 ) (3,795,562 )\nOther income (expense):\nInterest expense (214,104 ) (296,850 )\nChange in fair value of derivative liabilities 1,778,100 53,600\nLoss on settlement of debt, net (2,060,123 ) (117,700 )\nTotal other expense, net (496,127 ) (360,950 )\nNet loss from continuing operations (3,443,527 ) (4,156,512 )\nDiscontinued operations:\nIncome (loss) from operations (887,628 ) 2,515,827\nNet loss (4,331,155 ) (1,640,685 )\nNet (income) loss attributable to noncontrolling interest 372,803 (1,056,647 )\nNet loss attributable to Vystar $ (3,958,352 ) $ (2,697,332 )\nBasic and diluted loss per share:\nNet loss from continuing operations $ (0.27 ) $ (0.33 )\nNet income (loss) from discontinued operations $ (0.07 ) $ 0.20\nNet income (loss) attributable to noncontrolling interest $ (0.03 ) $ 0.08\nNet loss attributable to common shareholders $ (0.31 ) $ (0.21 )\nBasic and diluted weighted average number of common shares outstanding 12,942,605 12,706,056\nThe accompanying notes are an integral part of these consolidated financial statements.\nVYSTAR CORPORATION\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nShares A Stock A Shares B Stock B Shares C Stock C Shares Stock Capital Deficit Shares Stock Deficit Interest Deficit\nAttributable to Vystar\nNumber\nNumber\nNumber\nNumber\nNumber\nTotal\nof\nof\nof\nof\nAdditional\nof\nVystar\nTotal\nPreferred Preferred Preferred Preferred Preferred Preferred Common Common Paid-in Accumulated Treasury Treasury Stockholders Noncontrolling Stockholders\nShares A Stock A Shares B Stock B Shares C Stock C Shares Stock Capital Deficit Shares Stock Deficit Interest Deficit\nEnding balance December 31, 2020 13,698 $ 1 - $ - - $ - 12,000,352 $ 1,200 $ 41,352,261 $ (48,713,184 ) (300 ) $ (30 ) $ (7,359,752 ) $ 600,795 $ (6,758,957 )\nCommon stock issued for services\n785,778 2,110,010 -\n- 2,110,089\n2,110,089\nShare-based compensation - options\n15,989 -\n15,989\n15,989\nCommon stock issued for settlement of related party payable\n113,648 335,254\n335,265\n335,265\nCommon stock issued for cash received in prior period\n25,334 37,998\n38,000\n38,000\nPreferred stock conversion (5,000 )\n17,680 (2 )\n-\n-\nNet loss - - - - - - - - - (2,697,332 ) - - (2,697,332 ) 1,056,647 (1,640,685 )\nEnding balance December 31, 2021 8,698 $ 1 - $ - - $ - 12,942,792 $ 1,294 $ 43,851,510 $ (51,410,516 ) (300 ) $ (30 ) $ (7,557,741 ) $ 1,657,442 $ (5,900,299 )\nBalance 8,698 $ 1 - $ - - $ - 12,942,792 $ 1,294 $ 43,851,510 $ (51,410,516 ) (300 ) $ (30 ) $ (7,557,741 ) $ 1,657,442 $ (5,900,299 )\nShare-based compensation - options\n11,072 -\n11,072\n11,072\nRetirement of common stock\n(200 )\n-\n-\nPreferred stock issued for services\n73,428 291,188\n1,595,211\n1,595,247\n1,595,247\nPreferred stock issued for cash\n32,566\n84,997\n85,000\n85,000\nPreferred stock issued for settlement of accounts payable\n127,857\n511,415\n511,428\n511,428\nPreferred stock issued for settlement of shareholder notes payable\n152,755\n893,602\n893,617\n893,617\nPreferred stock issued for settlement of related party notes payable\n1,594,219\n6,346,404\n6,346,564\n6,346,564\nPreferred stock issued for settlement of stock payable\n16,929\n67,714\n67,716\n67,716\nNet loss - - - - - - - - - (3,958,352 ) - - (3,958,352 ) (372,803 ) (4,331,155 )\nEnding balance December 31, 2022 8,698 $ 1 370,969 $ 37 1,917,973 $ 192 12,942,592 $ 1,294 $ 53,361,925 $ (55,368,868 ) (300 ) $ (30 ) $ (2,005,449 ) $ 1,284,639 $ (720,810 )\nBalance 8,698 $ 1 370,969 $ 37 1,917,973 $ 192 12,942,592 $ 1,294 $ 53,361,925 $ (55,368,868 ) (300 ) $ (30 ) $ (2,005,449 ) $ 1,284,639 $ (720,810 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nVYSTAR CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended\nDecember 31,\nCash flows from operating activities:\nNet loss $ (4,331,155 ) $ (1,640,685 )\nAdjustments to reconcile net loss to net cash used in continuing operations:\nShare-based compensation 837,468 822,070\nDepreciation 178,714 353,833\nBad debts 26,080 278,377\nAmortization of intangible assets 345,249 384,250\nNoncash lease expense 267,009 345,355\nAmortization of debt discount 27,083 42,585\nImpairment loss 1,835,424 245,050\nChange in fair value of derivative liabilities (1,778,100 ) (53,600 )\n(Gain) loss on settlement of debt, net 2,008,267 (2,688,100 )\nLoss on sale of property and equipment\n22,080\n210,951\nLoss on sale of investments\n- 4,180\nNet unrealized gain on available-for-sale investments - (20,480\n)\n(Increase) decrease in assets:\nAccounts receivable (181,631 )\nInventories 363,760 311,509\nPrepaid expenses and other 76,545 144,595\nAssets of discontinued operations\n2,341,200\n1,623,868\nIncrease (decrease) in liabilities:\nAccounts payable 301,356 1,151,596\nAccrued expenses and interest payable 289,374 511,168\nUnearned revenue (34,889 ) (548,907 )\nLiabilities of discontinued operations (3,291,408\n) (4,160,126\n)\nNet cash used in operating activities (515,523 ) (2,864,142 )\nCash flows from investing activities:\nPatents and trademark fees - (2,183 )\nCash flows from discontinued operations, net - 373,614\nNet cash provided by investing activities\n- 371,431\nCash flows from financing activities:\nProceeds from issuance of term debt - 290,000\nProceeds from related party advances 266,541 533,039\nProceeds from issuance of preferred stock 85,000 -\nCash flows from discontinued operations, net\n148,406\n1,200,308\nNet cash provided by financing activities 499,947 2,023,347\nNet decrease in cash (15,576 ) (469,364 )\nCash - beginning of year 151,175 620,539\nCash - end of year 135,599 151,175\nLess: cash of discontinued operations 123,325 21,655\nCash of continuing operations - end of year $ 12,274 $ 129,520\nCash paid during the year for:\nInterest $ 10,874 $ 6,579\nNon-cash transactions:\nPrepaid expenses with preferred stock $ 866,630 $ -\nPreferred stock issued for settlement of related party payable 270,000 -\nPreferred stock issued for settlement of debt and accrued interest 893,617 -\nPreferred stock issued for settlement of related party debt and accrued interest 6,346,564 -\nPreferred stock issued for stock subscription payable 67,716 -\nPreferred stock issued for settlement of vendor payables 886,401 -\nRotmans vendor payables paid directly by related party 100,000 -\nRotmans lease liabilities arising from obtaining right-of-use assets 325,471 24,603\nCommon stock issued for accrued compensation - 2,110,089\nDerivatives issued as a debt discount - 65,000\nCommon stock issued for settlement of related party payable - 335,265\nCommon stock issued for cash received in prior year - 38,000\nCommon stock issued for preferred stock -\nReduction of third-party vendor payable with transfer of Rotmans inventories - 2,886,497\nAcquisition of Rotmans inventories with third-party vendor payable at commencement of second sale agreement - 2,886,497\nThe accompanying notes are an integral part of these consolidated financial statements.\nVYSTAR CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2022 and 2021\nNOTE 1 - DESCRIPTION OF BUSINESS\nNature of Business\nVystar Corporation (Vystar, the Company, we, us, or our) is based in Worcester, Massachusetts and produces a line of innovative air purifiers, which destroy viruses and bacteria through the use of ultraviolet light. Vystar is also the creator and exclusive owner of the innovative technology to produce Vytex® Natural Rubber Latex (NRL). Vystar manufactures and sells NRL used primarily in various bedding products. In addition, Vystar has a majority ownership in Murida Furniture Co., Inc. dba Rotmans Furniture (Rotmans), formerly one of the largest independent furniture retailers in the U.S.\nAll activities of Rotmans have been included in discontinued operations. Additional disclosure can be found in Note 17. Other references to Rotmans in the accompanying notes, excluding Note 17, are for informational purposes only.\nNOTE 2 - BASIS OF PRESENTATION AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nOn September 1, 2022, our 1-for-100 reverse stock split of our common stock was effective, which was previously approved by our Board of Directors on July 26, 2022. The total number of shares which the Company is authorized to issue is 520,000,000, of which 500,000,000 is common and 20,000,000 is preferred. All share and per share amounts have been adjusted in these consolidated financial statements to reflect the effects of the reverse stock split, unless otherwise noted.\nBasis of Presentation\nThe consolidated financial statements are presented in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP) as codified in the Financial Accounting Standards Boards (FASB) Accounting Standards Codification.\nThe Company has evaluated subsequent events through the date of the filing of its Form 10-K with the Securities and Exchange Commission. Other than those events disclosed in Note 18, the Company is not aware of any other significant events that occurred subsequent to the balance sheet date but prior to the filing of this report that would have a material impact on the Companys financial statements.\nBasis of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly-owned or controlled operating subsidiaries. All significant intercompany accounts and transactions have been eliminated.\nDiscontinued Operations\nIn accordance with ASC No. 205-20, Discontinued Operations, for all periods presented, the results of operations and related balance sheet items associated with Rotmans are reported in discontinued operations in the accompanying consolidated financial statements. See Note 17 for further details.\nCOVID-19\nThe COVID-19 pandemic caused, among other things, interruptions to our supply chains and suppliers, including problems with inventory availability with price volatility and higher cost of products and international freight due to the high demand of products and low supply for a period of time. Most disruptions were resolved in the second half of 2022.\nSegment Reporting\nOperating segments are identified as components of an enterprise about which separate discrete financial information is available for evaluation by the chief operating decision maker, or decision-making group, in making decisions on how to allocate resources and assess performance. The Companys chief operating decision maker is the chief executive officer. The Company and the chief executive officer view the Companys operations and manage its business as one reportable segment with different operating segments.\nEstimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying disclosures. Significant estimates made by management include, among others, allowance for obsolete inventory, the recoverability of long-lived assets, valuation and impairment of intangible assets, fair values of right of use assets and lease liabilities, valuation of derivative liabilities, share-based compensation and other equity issuances. Although these estimates are based on managements best knowledge of current events and actions the Company may undertake in the future, actual results could differ from these estimates.\nFair Value of Financial Instruments\nThe Companys financial instruments consist principally of cash, accounts receivable, investments - equity securities, accounts payable, accrued expenses and interest payable, shareholder notes payable, long-term debt and unearned revenue. The carrying values of all the Companys financial instruments approximate or equal fair value because of their short maturities and market interest rates or, in the case of equity securities, being stated at fair value.\nIn specific circumstances, certain assets and liabilities are reported or disclosed at fair value. Fair value is the exit price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date in the Companys principal market for such transactions. If there is not an established principal market, fair value is derived from the most advantageous market.\nValuation inputs are classified in the following hierarchy:\n● Level 1 inputs are unadjusted quoted prices in active markets for identical assets or liabilities.\n● Level 2 inputs are directly or indirectly observable valuation inputs for the asset or liability, excluding Level 1 inputs.\n● Level 3 inputs are unobservable inputs for the asset or liability.\nHighest priority is given to Level 1 inputs and the lowest priority to Level 3 inputs. Acceptable valuation techniques include the market approach, income approach, and cost approach. In some cases, more than one valuation technique is used. The derivative liabilities were recognized at fair value on a recurring basis through the date of the settlement and December 31, 2022 and are level 3 measurements. There have been no transfers between levels during the year ended December 31, 2022.\nAcquisitions\nAmounts paid for acquisitions are allocated to the assets acquired and liabilities assumed based on their estimated fair value at the date of acquisition. The fair value of identifiable intangible assets is based on valuations that use information and assumptions provided by management. Identifiable intangible assets with finite lives are amortized over their useful lives. Acquisition-related costs, including, legal, accounting, and other costs, are capitalized in asset acquisitions and for business combinations are expensed in the periods in which the costs are incurred. The results of operations of acquired assets are included in the financial statements from the acquisition date.\nCash, Cash Equivalents and Restricted Cash\nCash and cash equivalents include all liquid investments with a maturity date of less than three months when purchased. Cash equivalents also include amounts due from third-party financial institutions for credit and debit card transactions which typically settle within five days. Restricted cash represents cash balances restricted as to withdrawal or use and are included in prepaid expenses and other on the consolidated balance sheets.\nAccounts Receivable\nAccounts receivable are stated at the amount management expects to collect from outstanding balances. Rotmans routinely sells, without recourse, trade receivables resulting from retail furniture sales to two financial institutions at an average service charge of 2.75% in 2022. Amounts sold during the year ending December 31, 2022 were approximately $2,579,000. Retail furniture receivables retained by Rotmans are generally collateralized by the merchandise sold, represent valid claims against debtors for sales arising on or before the balance sheet date and are reduced to their estimated net realizable value. In addition, the Company grants credit to Vystar customers without requiring collateral. The amount of accounting loss for which Vystar is at risk in these unsecured accounts receivable is limited to their carrying value. Management provides for uncollectible amounts through a charge to earnings and a credit to an allowance for doubtful accounts based upon its assessment of the current status of individual accounts. Balances that are still outstanding after management has performed reasonable collection efforts are written off through a charge to the allowance and a credit to accounts receivable. An allowance for doubtful accounts was not needed at December 31, 2022. As of December 31, 2021, Vystar has recorded an allowance for doubtful accounts of $273,000.\nOther Receivables\nUnder the provisions of the Coronavirus Aid, Relief, and Economic Security Act (the CARES Act) signed into law on March 27, 2020 and the subsequent extension of the CARES Act, Rotmans was eligible for a refundable employee retention credit subject to certain criteria. Rotmans recognized employee retention credits of $771,287 during the year ended December 31, 2021. Rotmans has filed for refunds of the employee retention credits and as of the date of this Annual Report on Form 10-K has subsequently received all of the remaining refunds.\nRotmans terminated its agreement with a supplier in 2021 and will receive $100,000 in consideration. As of December 31, 2022, the remaining account balance of $66,667 represents funds due from this termination.\nInventories\nInventories include those costs directly attributable to the product before sale. Inventories consist primarily of finished goods of furniture, mattresses, RxAir purifier units, foam toppers and pillows and are carried at net realizable value, which is defined as selling price less cost of completion, disposal and transportation. Both Rotmans and Vystar evaluate the need to record write-downs for inventory on a regular basis. Appropriate consideration is given to obsolescence, slow-moving and other factors in evaluating net realizable values. Inventories not expected to be sold within 12 months are classified as long-term.\nPrepaid Expenses and Other\nPrepaid expenses and other include restricted cash, amounts related to prepaid insurance policies, which are expensed on a straight-line basis over the life of the underlying policy, and other expenses.\nProperty and Equipment\nProperty and equipment are stated at cost less accumulated depreciation. Depreciation is provided over the estimated useful lives of the assets, generally 5 to 10 years, using straight-line and accelerated methods.\nExpenditures for major renewals and betterments are capitalized, while routine repairs and maintenance are expensed as incurred. When property items are retired or otherwise disposed of, the asset and related reserve accounts are relieved of the cost and accumulated depreciation, respectively, and the resultant gain or loss is reflected in earnings. As of December 31, 2022 and 2021, the net balance of property and equipment for Vystar is $140,886 and $184,442, respectively, with accumulated depreciation of $201,517 and $157,961, respectively. As of December 31, 2022 and 2021, the net balance of property and equipment for Rotmans is $490,420 and $647,657, respectively, with accumulated depreciation of $114,041 and $486,023, respectively.\nIntangible Assets\nPatents represent legal and other fees associated with the registration of patents. Vystar has five issued patents with the United States Patent and Trade Office (USPTO), as well as five issued international Patent Cooperation Treaty (PCT) patents. Patents are carried at cost and are being amortized on a straight-line basis over their estimated useful lives, typically ranging from 9 to 20 years.\nVystar has trademark protection for Vystar, Vytex, and RxAir among others. Trademarks are carried at cost and since their estimated life is indeterminable, no amortization is recognized. Instead, they are evaluated annually for impairment.\nCustomer relationships, tradename and marketing related intangibles are carried at cost and are being amortized on a straight-line basis over their estimated useful lives, typically ranging from 5 to 10 years.\nOur intangible assets are reviewed for impairment annually or more frequently as warranted by events of changes in circumstances. During the year ended December 31, 2022, Vystar recognized an impairment charge of $297,723 related to customer relationships, proprietary technology, tradename and brand, and noncompete involving UV Flu. During the year ended December 31, 2022, Rotmans recognized an impairment charge of $411,527 related to the closing of the showroom and abandonment of customer relationships, tradename and brand, and marketing related intangibles. During the year ended December 31, 2021, Vystar recognized an impairment charge of $245,050 related to the proprietary technology and customer relationships involving NHS.\nLong-Lived Assets\nWe review our long-lived assets for impairment whenever events or changes in circumstances indicate the carrying amount of the assets may not be fully recoverable. We evaluate assets for potential impairment by comparing estimated future undiscounted net cash flows to the carrying amount of the assets. If the carrying amount of the assets exceeds the estimated future undiscounted cash flows, impairment is measured based on the difference between the carrying amount of the assets and fair value. Assets to be disposed of would be separately presented in the consolidated balance sheet and reported at the lower of the carrying amount or fair value less costs to sell and are no longer depreciated. The assets and liabilities of a disposal group classified as held-for-sale would be presented separately in the appropriate asset and liability sections of the consolidated balance sheet, if material.\nGoodwill\nGoodwill reflects the cost of an acquisition in excess of the fair values assigned to identifiable net assets acquired. Goodwill is not amortized, rather, it is subject to a periodic assessment for impairment by applying a fair value-based test. We perform our annual impairment test at the end of each calendar year, or more frequently if events or changes in circumstances indicate the asset might be impaired.\nAccounting for acquisitions requires us to recognize, separately from goodwill, the assets acquired and the liabilities assumed at their acquisition-date fair values. Goodwill as of the acquisition date is measured as the excess of consideration transferred and the net of the acquisition-date fair values of the assets acquired and the liabilities assumed. While we use best estimates and assumptions to accurately value assets acquired and liabilities assumed at the acquisition date, the estimates are inherently uncertain and subject to refinement.\nThe impairment model permits, and we utilize, a simplified approach for determining goodwill impairment. In the first step, we evaluate the recoverability of goodwill by estimating the fair value of our reporting unit using multiple techniques, including an income approach using a discounted cash flow model and a market approach. Based on an equal weighting of the results of these two approaches, a conclusion of fair value is estimated. The fair value is then compared to the carrying value of our reporting unit. If the fair value of a reporting unit is less than its carrying value, the Company recognizes this amount as an impairment loss. Impairment losses, limited to the carrying value of goodwill, represent the excess of the carrying amount of goodwill over its implied fair value. Vystar recognized an impairment loss of $147,092 during the year ended December 31, 2022 related to a prior acquisition. Rotmans recognized an impairment loss of $313,209 during the year ended December 31, 2022.\nConvertible Notes Payable\nBorrowings are recognized initially at the principal amount received. Borrowings are subsequently carried at amortized cost; any difference between the proceeds (net of transaction costs) and the redemption value is recognized as interest expense in the statements of operations over the period of the borrowings using the effective interest method.\nDerivatives\nVystar evaluates its debt instruments or other contracts to determine if those contracts or embedded components of those contracts qualify as derivatives to be separately accounted for under the relevant sections of Accounting Standards Codification (ASC) Topic 815-40, Derivative Instruments and Hedging: Contracts in Entitys Own Equity. The result of this accounting treatment could be that the fair value of a financial instrument is classified as a derivative instrument and is marked-to-market at each balance sheet date and recorded as a liability. In the event the fair value is recorded as a liability, the change in fair value is recorded in the statements of operations as other income or other expense. Upon conversion or exercise of a derivative instrument, the instrument is marked to fair value at the conversion date and then that fair value is reclassified to equity. Financial instruments that are initially classified as equity that become subject to reclassification under ASC Topic 815-40 are reclassified to a liability account at the fair value of the instrument on the reclassification date.\nVystar applies the accounting standard that provides guidance for determining whether an equity-linked financial instrument, or embedded feature, is indexed to an entitys own stock. The standard applies to any freestanding financial instrument or embedded features that have the characteristics of a derivative, and to any freestanding financial instruments that are potentially settled in an entitys own common stock. From time to time, Vystar has issued notes with embedded conversion features. Certain of the embedded conversion features contain price protection or anti-dilution features that result in these instruments being treated as derivatives for accounting purposes. Accordingly, as of December 31, 2022, the Company has classified all conversion features as derivative liabilities and has estimated the fair value of these embedded conversion features using a Monte Carlo simulation model.\nUnearned Revenue\nUnearned revenue consists of customer advance payments, deposits on sales of undelivered merchandise and deferred warranty revenue on self-insured stain protection warranty coverage.\nChanges to unearned revenue during the years ended December 31, 2022 and 2021 are summarized as follows:\nSCHEDULE OF UNEARNED REVENUE\nVystar Rotmans Vystar Rotmans\nVystar Rotmans Vystar Rotmans\nBalance, beginning of the year $ 79,368 $ 1,042,827 $ 628,276 $ 1,799,495\nCustomer deposits received 1,042 18,535,198 554,215 23,967,846\nGift cards purchased - 1,200 - 15,860\nRevenue earned (35,931 ) (19,579,225 ) (1,103,123 ) (24,740,374 )\nBalance, end of the year $ 44,479 $ - $ 79,368 $ 1,042,827\nLoss Per Share\nThe Company presents basic and diluted loss per share and is reported separately for continuing operations and discontinued operations. Because the Company reported a net loss for 2022 and 2021, common stock equivalents, including stock options and warrants, were anti-dilutive; therefore, the amounts reported for basic and dilutive loss per share were the same. Excluded from the computation of diluted loss per share were options to purchase 266,750 and 268,750 shares of common stock for 2022 and 2021, respectively, as their effect would be anti-dilutive. Warrants to purchase 37,266 and 101,743 shares of common stock for 2022 and 2021, respectively, were also excluded from the computation of diluted loss per share as their effect would be anti-dilutive. In addition, preferred stock convertible to 23,952,603 and 32,302 shares of common stock for 2022 and 2021, respectively, were excluded from the computation of diluted loss per share as their effect would be anti-dilutive. Both shareholder and Rotman Family contingently convertible notes payable convertible to 4,081,316 and 7,647,906 shares of common stock for 2022 and 2021, respectively, were also excluded from the computation of diluted loss per share as their effect would be anti-dilutive.\nRevenue\nOur principal activities from which we generate our revenue are product sales. Revenue is measured based on considerations specified in a contract with a customer. A contract exists when it becomes a legally enforceable agreement with a customer. The contract is based on either the acceptance of standard terms and conditions at the retail store and on the websites for e-commerce customers, or the execution of terms and conditions contracts with retailers and wholesalers. These contracts define each partys rights, payment terms and other contractual terms and conditions of the sale.\nConsideration is typically paid prior to shipment via credit card or check when our products are sold direct to consumers, which is typically within 1 to 2 days or approximately 30 days from the time control is transferred when sold to wholesalers, distributors and retailers. We apply judgment in determining the customers ability and intention to pay, which is based on a variety of factors including the customers historical payment experience and, in some circumstances, published credit and financial information pertaining to the customer.\nA performance obligation is a promise in a contract to transfer a distinct product to the customer, which for us is transfer of finished goods to our customers. Performance obligations promised in a contract are identified based on the goods that will be transferred to the customer that are both capable of being distinct and are distinct in the context of the contract, whereby the transfer of the goods is separately identifiable from other promises in the contract. We have concluded the sale of finished goods and related shipping and handling are accounted for as the single performance obligation.\nThe transaction price of a contract is allocated to each distinct performance obligation and recognized as revenue when or as the customer receives the benefit of the performance obligation. The transaction price is determined based on the consideration to which we will be entitled to receive in exchange for transferring goods to the customer. We issue refunds to retail, e-commerce and print media customers, upon request, within 30 days of delivery. We estimate the amount of potential refunds at each reporting period using a portfolio approach of historical data, adjusted for changes in expected customer experience, including seasonality and changes in economic factors. For retailers, distributors and wholesalers, we do not offer a right of return or refund and revenue is recognized at the time products are shipped to customers. In all cases, judgment is required in estimating these reserves. Actual claims for returns could be materially different from the estimates. As of December 31, 2022 and 2021, estimated sales returns totaled $415,000 and $337,000, respectively, and are included in the accompanying consolidated balance sheets as accrued expenses.\nWe recognize revenue when we satisfy a performance obligation in a contract by transferring control over a product to a customer when product is shipped based on fulfillment by the Company. The Company considers fulfillment when it passes all liability at the point of shipping through third-party carriers or delivery services. Delivery fees are charged to customers and are included in revenue in the accompanying consolidated statements of operations and the costs associated with these deliveries are included in revenues as a third-party delivery service is engaged. Taxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue-producing transaction, that are collected by us from a customer, are excluded from revenue. Shipping and handling costs associated with outbound freight after control over a product has transferred to a customer are accounted for as a fulfillment cost and are included in cost of revenue in the accompanying consolidated statements of operations.\nRotmans also defers revenues for separately-priced stain protection warranty coverage for which it is ultimately self-insured. Revenue is recognized from the extended warranty sales on a straight-line basis over the respective contract term. The extended warranty terms primarily range from three to five years from the date of delivery. Rotmans ended this warranty program during 2020 but amortized the previously contracted warranties over their original terms until store closing in December 2022. At December 31, 2021, deferred warranty revenue was approximately $524,000 and is included in the liabilities of discontinued operations as unearned revenue in the accompanying consolidated balance sheets. During 2022 and 2021, the Company recognized total revenues of approximately $524,000 and $388,000, respectively, related to deferred warranty revenue arrangements. Commission costs in obtaining extended warranty contracts are capitalized and recognized as expense on a straight-line basis over the period of the warranty contract until store closing in December 2022. At December 31, 2021, deferred commission costs were approximately $134,000 and are included in the assets of discontinued operations in the accompanying consolidated balance sheets. All other costs, such as costs of services performed under the contract, general and administrative expenses, and advertising costs are expensed as incurred.\nCost of Revenue\nCost of revenue consists primarily of product and freight costs and fees paid to online retailers.\nResearch and Development\nResearch and development costs are expensed when incurred. Research and development costs include all costs incurred related to the research, development and testing. For the years ended December 31, 2022 and 2021, Vystars research and development costs were not significant.\nAdvertising Costs\nAdvertising costs, which include television, radio, newspaper, digital and other media advertising, are expensed upon first showing. Vystar costs included in general and administrative expenses in the accompanying consolidated statements of operations were approximately $35,000 and $251,000 for the years ended December 31, 2022 and 2021, respectively. Rotmans costs included in discontinued operations were approximately $1,212,000 and $1,923,000 for the years ended December 31, 2022 and 2021, respectively.\nShare-Based Compensation\nThe fair value of stock options is estimated on the grant date using the Black-Scholes option pricing model, based on weighted average assumptions. Expected volatility is based on historical volatility of our common stock. Vystar has elected to use the simplified method described in the Securities and Exchange Commission Staff Accounting Bulletin Topic 14C to estimate the expected term of employee stock options. The risk-free rate is based on the U.S. Treasury yield curve in effect at the time of grant. The value of restricted stock awards is determined using the fair value of the Vystars common stock on the date of grant. Vystar accounts for forfeitures as they occur. Compensation expense is recognized on a straight-line basis over the requisite service period of the award.\nIncome Taxes\nVystar recognizes income taxes on an accrual basis based on a tax position taken or expected to be taken in its tax returns. A tax position is defined as a position in a previously filed tax return or a position expected to be taken in a future tax filing that is reflected in measuring current or deferred income tax assets or liabilities. Tax positions are recognized only when it is more likely than not (i.e., likelihood of greater than 50%), based on technical merits, that the position would be sustained upon examination by taxing authorities. Tax positions that meet the more likely than not threshold will be measured using a probability-weighted approach as the largest amount of tax benefit that is greater than 50% likely of being realized upon settlement. Income taxes are accounted for using an asset and liability approach that requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been recognized in our financial statements or tax returns. A valuation allowance is established to reduce deferred tax assets if all, or some portion, of such assets will more likely than not be realized. Should they occur, interest and penalties related to tax positions are recorded as interest expense. No such interest or penalties have been incurred for the years ended December 31, 2022 and 2021.\nVystar and Rotmans remain subject to income tax examinations from Federal and state taxing jurisdictions for 2019 through 2022.\nConcentration of Credit Risk\nCertain financial instruments potentially subject the Company to concentrations of credit risk. These financial instruments consist primarily of cash and accounts receivable. Cash held in operating accounts may exceed the Federal Deposit Insurance Corporation, or FDIC, insurance limits. While the Company monitors cash balances in our operating accounts on a regular basis and adjust the balances as appropriate, these balances could be impacted if the underlying financial institutions fail. To date, the Company has experienced no loss or lack of access to our cash; however, the Company can provide no assurances that access to our cash will not be impacted by adverse conditions in the financial markets. Credit concentration risk related to accounts receivable is mitigated as customer credit is checked prior to the sales.\nOther Risks and Uncertainties\nVystar is exposed to risks pertinent to the operations of a retailer, including, but not limited to, the ability to acquire new customers and maintain a strong brand as well as broader economic factors such as interest rates and changes in customer spending patterns.\nRecent Accounting Pronouncements\nIn May 2021, the FASB issued ASU 2021-04, Earnings Per Share (Topic 260), Debt-Modifications and Extinguishments (Subtopic 470-50), Compensation-Stock Compensation (Topic 718), and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40), which addresses issuers accounting for certain modifications or exchanges of freestanding equity-classified written call options. This amendment is effective for all entities, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. The adoption of ASU 2021-04 in 2022 had no effect on the Companys financial position, results of operations and cash flows.\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40). The new ASU eliminates the beneficial conversion and cash conversion accounting models for convertible instruments. It also amends the accounting for certain contracts in an entitys own equity that are currently accounted for as derivatives because of specific settlement provisions. In addition, the new guidance modifies how particular convertible instruments and certain contracts that may be settled in cash or shares impact the diluted EPS computation. The amendments in the ASU are effective for public business entities that meet the definition of an SEC filer, excluding entities eligible to be smaller reporting companies as defined by the SEC, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. The FASB also specified that an entity should adopt the guidance as of the beginning of its annual fiscal year and is not permitted to adopt the guidance in an interim period. Vystar is still evaluating the effect the adoption will have on its financial statements.\nNOTE 3 - LIQUIDITY AND GOING CONCERN\nThe Companys financial statements are prepared using the accrual method of accounting in accordance with U.S. GAAP and have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities in the normal course of business. However, Vystar has incurred significant losses and experienced negative cash flow since inception. At December 31, 2022, the Company had cash of $12,274 and a deficit in working capital of approximately $3.1 million. Further, at December 31, 2022 the accumulated deficit amounted to approximately $55.4 million. We use working capital to finance our ongoing operations, and since those operations do not currently cover all our operating costs, managing working capital is essential to Vystars future success. Because of this history of losses and financial condition, there is substantial doubt about Vystars ability to continue as a going concern.\nA successful transition to attaining profitable operations is dependent upon obtaining sufficient financing to fund the Vystars planned expenses and achieving a level of revenue adequate to support the Vystars cost structure. Management plans to finance future operations using cash on hand, increased revenue from RxAir air purification units,Vytex license fees and stock issuances to new and existing shareholders.\nThere can be no assurances Vystar will be able to achieve projected levels of revenue in 2023 and beyond. If Vystar is not able to achieve projected revenue and obtain alternate additional financing of equity or debt, Vystar would need to significantly curtail or reorient operations during 2023, which could have a material adverse effect on the ability to achieve the business objectives, and as a result, may require Vystar to file for bankruptcy or cease operations. The financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts or amounts classified as liabilities that might be necessary should Vystar be forced to take any such actions.\nVystars future expenditures will depend on numerous factors, including the rate at which the Company can introduce RxAir air purification units and license Vytex NRL raw materials to manufacturers, and subsequently retailers; the costs of filing, prosecuting, defending and enforcing any patent claims and other intellectual property rights; market acceptance of Vystars products, services and competing technological developments; acquire new customers and maintain a strong brand; and broader economic factors such as interest rates and changes in customer spending patterns. As Vystar expands its activities and operations, cash requirements are expected to increase at a rate consistent with revenue growth after Vystar has achieved sustained revenue generation.\nNOTE 4 - PROPERTY AND EQUIPMENT\nProperty and equipment, net consists of the following:\nSCHEDULE OF PROPERTY AND EQUIPMENT, NET\nVystar Rotmans Vystar Rotmans\nVystar Rotmans Vystar Rotmans\nFurniture, fixtures and equipment $ 3,831 $ 55,574 $ 3,831 $ 584,793\nTooling and testing equipment 338,572 - 338,572 -\nParking lots - 365,707 - 365,707\nLeasehold improvements - 134,014 - 134,014\nMotor vehicles - 49,166 - 49,166\nProperty and equipment, gross 342,403 604,461 342,403 1,133,680\nAccumulated depreciation (201,517 ) (114,041 ) (157,961 ) (486,023 )\nProperty and equipment, net $ 140,886 $ 490,420 $ 184,442 $ 647,657\nDepreciation expense for the years ended December 31, 2022 and 2021 was $178,714 and $353,833, respectively, of which $135,158 and $310,277 is included in net income (loss) from discontinued operations in 2022 and 2021, respectively.\nNOTE 5 - INTANGIBLE ASSETS\nIntangible assets consist of the following:\nSCHEDULE OF INTANGIBLE ASSETS\nAmortization\nPeriod\nVystar Rotmans Vystar Rotmans (in Years)\nAmortized intangible assets:\nPatents $ 361,284 $ - $ 361,284 $ - - 20\nProprietary technology 13,000 - 280,000 -\nTradename and brand 13,000 - 280,000 770,000 - 10\nNoncompete - - 50,000 -\nCustomer relationships - - 40,000 110,000 - 10\nMarketing related - - - 380,000\nTotal 387,284 - 1,011,284 1,260,000\nIntangible assets, gross 387,284 - 1,011,284 1,260,000\nAccumulated amortization (241,985 ) - (471,346 ) (600,140 )\nIntangible assets, net 145,299 - 539,938 659,860\nIndefinite-lived intangible assets:\nTrademarks 9,072 - 9,072 -\nTotal intangible assets $ 154,371 $ - $ 549,010 $ 659,860\nAmortization expense for the years ended December 31, 2022 and 2021 was $345,249 and $384,250, respectively, of which $248,333 and $248,334 is included in net income (loss) from discontinued operations in 2022 and 2021, respectively.\nDuring the year ended December 31, 2022, Vystar recognized an impairment charge of $297,723 related to its UV Flu intangibles. During the year ended December 31, 2022, Rotmans recognized an impairment charge of $1,390,609 related to its store closing in December 2022. The charge is included in net loss from discontinued operations. During the year ended December 31, 2021, Vystar recognized an impairment charge of $245,050 related to customer relationships and proprietary technology acquired from NHS.\nEstimated future amortization expense for finite-lived intangible assets is as follows:\nSCHEDULE OF ESTIMATED FUTURE AMORTIZATION EXPENSE\nAmount\n$ 31,716\n31,716\n24,652\n16,032\n16,032\nThereafter 25,151\nTotal $ 145,299\nNOTE 6 - LEASES (DISCONTINUED OPERATIONS)\nRotmans leases equipment, a showroom, offices and warehouse facilities. These leases expire at various dates through 2031 and have monthly base rents which range from $800 to $81,000. In connection with the store closing in 2022, Rotmans has recorded an impairment loss on the right-of-use assets totaling approximately $666,000. In September 2021, Rotmans entered into a lease termination agreement involving one of its warehouses effective September 30, 2021. Included in net income (loss) from discontinued operations for the year ended December 31, 2021 is a gain on the derecognition of the lease of approximately $5,000.\nThe table below presents the lease costs for years ended December 31, 2022 and 2021:\nSCHEDULE OF LEASE COST\nYear Ended\nDecember 31,\nOperating lease cost $ 1,155,451 $ 1,479,444\nFinance lease cost:\nAmortization of right-of-use assets 143,937 182,204\nInterest on lease liabilities 28,408 34,601\nTotal lease cost $ 1,327,796 $ 1,696,249\nDuring the year ended December 31, 2022 and 2021, the Company recognized sublease income of approximately $137,000 and $145,000, respectively, which in included in net income (loss) from discontinued operations in 2022 and 2021.\nRotmans leases generally do not provide an implicit rate, and therefore we use our incremental borrowing rate as the discount rate when measuring operating lease liabilities. The incremental borrowing rate represents an estimate of the interest rate we would incur at lease commencement to borrow an amount equal to the lease payments on a collateralized basis over the term of the lease. We used incremental borrowing rates as of the implementation date for operating leases that commenced prior to that date.\nThe following table presents other information related to the Rotmans leases:\nSCHEDULE OF OTHER INFORMATION RELATED TO LEASES\nYear Ended\nDecember 31,\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows used for operating leases $ 1,054,698\n$ 1,394,135\nFinancing cash flows used for financing leases 165,502\n231,414\nAssets obtained in exchange for operating lease liabilities 320,732\n-\nAssets obtained in exchange for finance lease liabilities 4,739\n24,603\nWeighted average remaining lease term:\nOperating leases 7.8 years\n8.9 years\nFinance leases 3.4 years\n4.3 years\nWeighted average discount rate:\nOperating leases 5.61 %\n5.59 %\nFinance leases 5.16 %\n5.16 %\nThe future minimum lease payments required under Rotmans operating and financing lease obligations as of December 31, 2022 having initial or remaining non-cancelable lease terms in excess of one year are summarized as follows:\nSCHEDULE OF FUTURE MINIMUM LEASE PAYMENTS REQUIRED UNDER OPERATING AND FINANCING LEASE OBLIGATIONS\nOperating Leases Finance Leases Total\n$ 1,049,351 $ 139,080 $ 1,188,431\n955,272 139,080 1,094,352\n870,000 139,080 1,009,080\n870,000 68,395 938,395\n870,000 - 870,000\nThereafter 2,682,500 - 2,682,500\nTotal undiscounted lease liabilities 7,297,123 485,635 7,782,758\nLess: imputed interest (1,370,983 ) (42,108 ) (1,413,091 )\nNet lease liabilities $ 5,926,140 $ 443,527 $ 6,369,667\nAs of December 31, 2022, Rotmans or Vystar does not have additional operating and finance leases that have not yet commenced.\nNOTE 7 - NOTES PAYABLE AND LOAN FACILITY\nDiscontinued Operations\nLetter of Credit\nRotmans entered into a $125,000 letter of credit agreement with Fidelity Co-operative Bank in November 2020. The pledged collateral of a $125,000 cash deposit account is included in prepaid expenses and other, of assets of discontinued operations. The letter of credit was required pursuant to an agreement with a third-party financial institution for customer financing. The requirements were removed in March 2023 and the funds released.\nAdvances\nOn May 29, 2020, Rotmans entered into a sale promotion consulting agreement with a national furniture sales event company. Under the agreement, Rotmans appointed the third-party as its exclusive agent to assist with a high-impact sale. Before the sale, the agent advanced the Company funds of approximately $2,300,000 to pay off the Fidelity line of credit and certain other vendors. The agent was reimbursed for the advance from the proceeds of the sale. The initial sales agreement with the agent ended in May 2021. A new agreement was entered into with the agent in June 2021. The agreement has been amended numerous times and ended in December 2022. The agent had a senior first priority security interest and lien on Rotmans inventories and other assets until all obligations and liabilities were satisfied. At the conclusion of the agreement, the remaining inventories were transferred to the agent. As of December 31, 2022, a receivable is due from the agent for the inventories and sales receipts in the amount of $1,853,972 and is included in assets of discontinued operations in the accompanying consolidated balance sheet. As of December 31, 2021, the outstanding balance of the advance is approximately $2,082,000 and is included in liabilities of discontinued operations in the accompanying consolidated balance sheet.\nTerm Notes\nOn April 16, 2020, Rotmans received $1,402,900 in loan funding from the Paycheck Protection Program (the PPP), established pursuant to the CARES Act and administered by the U.S. Small Business Administration (SBA). The unsecured loan (the PPP Loan) is evidenced by a promissory note of the Company dated April 16, 2020 (the Note) in the principal amount of $1,402,900 with United Community Bank (the Bank), the lender. Under the terms of the Note and the PPP Loan, interest accrues on the outstanding principal at the rate of 1.0% per annum. The term of the Note is two years, though it may be payable sooner in connection with an event of default under the Note. On January 24, 2021, the PPP loan was fully forgiven by the SBA.\nOn February 2, 2021, Rotmans received a second PPP loan of $1,402,900 from the SBA. The terms of the Note are the same of the original PPP loan. On June 25, 2021, the PPP loan was fully forgiven by the SBA. Included in gain (loss) on settlement of debt, net for the year ended December 31, 2021 is $2,805,800 related to the forgiveness of both PPP loans.\nContinuing Operations\nShareholder, Convertible and Contingently Convertible Notes Payable\nThe following table summarizes shareholder, convertible and contingently convertible notes payable:\nSCHEDULE OF LONG - TERM DEBT\nDecember 31,\nShareholder, convertible and contingently convertible notes $ 309,500 $ 1,241,895\nAccrued interest 26,763 147,009\nTotal shareholder notes and accrued interest 336,263 1,388,904\nLess: current maturities (336,263 ) (1,388,904 )\nTotal long-term debt $ - $ -\nShareholder Convertible Notes Payable\nDuring the year ended December 31, 2018, the Vystar issued shareholder contingently convertible notes payable, some of which were for contract work performed by other entities in lieu of compensation and expense reimbursement, totaling approximately $338,000. The notes are (i) unsecured, (ii) bear interest at an annual rate of five percent (5%) from date of issuance, and (iii) are convertible at Vystars option post April 19, 2018. The notes mature one year from issuance but may be extended one (1) additional year by Vystar. If converted, the notes plus accrued interest are convertible into shares of Vystars common stock at the prior twenty (20) day average closing price with a 50% discount. The outstanding balance of all of these notes of as December 31, 2022 and 2021 is $19,500 and $338,195, respectively. The notes matured in January 2020 and continue to accrue interest until settlement. The notes were in default at December 31, 2021 and bore interest at an annual rate of eight percent (8%) in arrears. All of these notes except one were settled in April 2022 at a gain of approximately $98,000. Vystar issued 53,822 shares of its Series B Preferred Stock in July to complete the settlement. The remaining note is in default at December 31, 2022.\nDuring the year ended December 31, 2019, Vystar issued certain contingently convertible promissory notes in varying amounts to existing shareholders which totaled $613,700. The face amount of the note represents the amount due at maturity along with the accrued interest at an annual rate of five percent (5%). The notes mature one year from issuance but may be extended one (1) additional year by Vystar. The face amount can be converted into shares of Vystars stock, at the option of the Company, based on the average closing price for the trailing 20 days prior to conversion and carrying a 35% to 50% discount. These notes can be converted only after an acceleration event which involves a symbol change, uplisting, or reverse stock split and such conversion is in the control of Vystar. All of these notes were outstanding and in default as of December 31, 2021. The unpaid balance on the notes bore interest at an annual rate of eight percent (8%) in arrears. All of these notes were settled in April 2022 at a gain of approximately $142,000. Vystar issued 98,933 shares of its Series B Preferred Stock in July to complete the settlement.\nDuring the year ended December 31, 2021, Vystar issued certain contingently convertible promissory notes in varying amounts to existing shareholders which totaled $290,000. The notes are unsecured and bear interest at an annual rate of five percent (5%) from date of issuance. The face amount of the notes represents the amount due at maturity along with the accrued interest. The notes were extended by Vystar for an additional year. In the event that the spin-off of RxAir does not occur within 2023, Vystar will convert these notes into common stock at a conversion price of $1.60. If the spin-off does occur, these notes will convert into RxAir common stock with two conversion prices of $0.15 and $2, which equates to a blended conversion price of $0.18. All of these notes are outstanding as of December 31, 2022 and 2021. At the issuance date of these notes, it was determined they contain a beneficial conversion feature amounting to approximately $90,000. As these notes are contingently convertible, the beneficial conversion feature will not be recorded on the consolidated financial statements until the actual conversion occurs.\nBased on the variable conversion price of the notes issued prior to 2021, Vystar recorded the embedded conversion features as derivative liabilities, which amounted to $647,100 at December 31, 2021. With the debt settlements in April 2022, the value of the embedded conversion features on the one remaining note was de minimis at December 31, 2022.\nRelated Party Debt\nThe following table summarizes related party debt:\nSCHEDULE OF RELATED PARTY DEBT\nDecember 31,\nRotman Family convertible notes $ 5,000 $ 1,967,737\nRotman Family nonconvertible notes 140,000 1,953,509\nAccrued interest 24,552 384,238\nDebt discount - (27,083 )\nDue to related party 169,552 4,278,401\nLess: current maturities (169,552 ) (1,487,000 )\nDue to related party, noncurrent $ - $ 2,791,401\nRotman Family Convertible Notes\nOn September 30, 2019, Vystar issued contingently convertible promissory notes totaling $180,000 to Steven Rotman ($105,000) and Greg Rotman ($75,000). These notes are (i) unsecured, (ii) bear interest at an annual rate of eight percent (8%) from date of issuance, (iii) are convertible at Vystars option after December 31, 2019, and (iv) mature five years from issuance. If converted, the notes plus accrued interest are convertible into shares of Vystars common stock at the average of the five lowest closing prices in the 90-day period prior to conversion with a 50% discount. These notes were settled by Vystar in July 2022 with the issuance of 48,276 and 25,812 shares of Series C Preferred Stock to Steven and Greg Rotman, respectively. A loss of approximately $68,000 and $37,000 was incurred on the settlement to Steven and Greg Rotman, respectively. The balance of the notes payable including accrued interest to Steven and Greg Rotman was approximately $126,000 and $66,000, respectively, at December 31, 2021.\nOn July 18, 2019, Vystar issued contingently convertible notes totaling $1,522,500 to Steven Rotman ($1,102,500) and Bernard Rotman ($420,000) as partial consideration for the acquisition of 58% of Rotmans. These notes are (i) unsecured, and (ii) bear interest at an annual rate of five percent (5%) from date of issuance. These notes can be converted only after an acceleration event which involves a symbol change, or reverse stock split and such conversion is in the control of the Company. Steven Rotmans note matures eight years from issuance and Bernard Rotmans note matures four years from issuance. If converted, the notes plus accrued interest are convertible into shares of Vystars common stock at a 20-day average closing price at a 50% discount. These notes were settled by Vystar in July and September 2022 with the issuance of 474,336 and 180,699 shares of Series C Preferred Stock to Steven and Bernard Rotman, respectively. A loss of approximately $679,000 and $69,000 was incurred on the settlement to Steven and Bernard Rotman, respectively. The balance of the notes payable including accrued interest to Steven and Bernard Rotman was approximately $1,238,000 and $472,000, respectively, at December 31, 2021.\nOn December 19, 2019, Vystar issued a contingently convertible promissory note totaling $100,000 to Steven Rotman. The face amount of the note represents the amount due at maturity along with the accrued interest at 5%. The amount can be converted into shares of Vystars stock, at the option of the Company, based on the average closing price for the trailing 20 days prior to conversion and carrying 50% discount. The note can be converted only after an acceleration event which involves a symbol change, uplisting, or reverse stock split and such conversion is in the control of Vystar. The note was extended to mature two years from issuance. This note was settled by Vystar in July 2022 with the issuance of 42,225 shares of Series C Preferred Stock at a loss of approximately $60,000. The balance of the note payable including accrued interest to Steven Rotman was approximately $110,000 at December 31, 2021, respectively.\nOn February 20, 2020, Vystar issued a contingently convertible promissory note totaling $50,000 to Steven Rotman. The face amount of the note represents the amount due at maturity along with the accrued interest at 5%. The amount can be converted into shares of Vystars stock, at the option of the Company, based on the average closing price for the trailing 20 days prior to conversion and carrying 50% discount. The note can be converted only after an acceleration event which involves a symbol change, uplisting, or reverse stock split and such conversion is in the control of Vystar. The note matures two years from issuance. This note was settled by Vystar in July 2022 with the issuance of 20,913 shares of Series C Preferred Stock at a loss of approximately $30,000. The balance of the note payable including accrued interest to Steven Rotman was approximately $55,000 at December 31, 2021.\nOn June 3, 2021, Vystar issued a contingently convertible promissory note totaling $130,030 to Gregory Rotman. The face amount of the note represents the amount due at maturity along with the accrued interest at 5%. The amount can be converted into shares of Vystars stock, at the holders option, based on the average closing price for the trailing 20 days prior to conversion and carrying 50% discount or $1.65 per share whichever is lower. The holder may elect to accelerate conversion in the event of a spin-out or reverse split. The note matures two years from issuance. This note was settled by Vystar in July 2022 with the issuance of 51,896 shares of Series C Preferred Stock at a loss of approximately $76,000. The balance of the note payable including accrued interest to Gregory Rotman was approximately $134,000 December 31, 2021.\nOn August 17, 2021, Vystar issued a contingently convertible promissory note totaling $5,000 to Jamie Rotman. The note is unsecured and bears interest at an annual rate of five percent (5%) from date of issuance. The face amount of the note represents the amount due at maturity along with the accrued interest. In the event that the spin-off of RxAir does not occur within 2023, Vystar will convert the note into common stock at a conversion price of $1.60. If the spin-off does occur, the note will convert into RxAir common stock with two conversion prices of $0.15 and $2, which equates to a blended conversion price of $0.18. At the issuance date of this note, it was determined to contain a beneficial conversion feature amounting to approximately $2,000. As this note is contingently convertible, the beneficial conversion feature will not be recorded on the consolidated financial statements until the actual conversion occurs. The balance of the note payable including accrued interest to Jamie Rotman was approximately $5,000 at December 31, 2022 and 2021.\nThe following table summarizes the Rotman Family Convertible Notes:\nSCHEDULE OF NOTES PAYABLE\nIssue Date Principal Amount\nCarrying Amount\nDecember 31, December 31,\nIssue Date Principal Amount\nSteven Rotman 8% note due July 07/18/19 $ 105,000 $ - $ 126,000\nGregory Rotman 8% note due July 2024 07/18/19 55,207 - 66,264\nSteven Rotman 5% note due July 2027 07/18/19 1,102,500 - 1,238,016\nBernard Rotman 5% note due July 2023 07/18/19 420,000 - 471,625\nSteven Rotman 5% note due December 2021 12/19/19 100,000 - 110,208\nSteven Rotman 5% note due February 2022 02/02/20 50,000 - 54,583\nGregory Rotman 5% note due June 2023 06/03/21 130,030 - 133,822\nJamie Rotman 5% note due August 2023 08/17/21 5,000 5,344 5,094\nDebt instrument, carrying amount\n$ 1,967,737 5,344 2,205,612\nDebt Discount\n- (27,083 )\nNotes payable\n$ 5,344 $ 2,178,529\nBased on the variable conversion price for these convertible notes excluding the one issued in August 2021, Vystar recorded the embedded conversion features as derivative liabilities, which amounted to $1,131,000 at December 31, 2021. With the subsequent conversions in July 2022, there was no value of the embedded conversion features at December 31, 2022.\nAs of December 31, 2022, the one remaining note is due in 2023 and is included in current maturities.\nRotman Family Nonconvertible Notes\nIn connection with the acquisition of 58% of Rotmans, Steven and Bernard Rotman were issued related party notes payable in the amounts of $367,500 and $140,000, respectively. The notes bear interest at an annual rate of five percent (5%). Steven Rotmans note matures eight years from issuance and Bernard Rotmans note matures four years from issuance. Payments of $3,828 and $2,917 to Steven and Bernard Rotman, respectively, per month were scheduled to begin six months from issuance until maturity in December 2027 and 2023, respectively. Steven Rotmans note was settled by Vystar in July 2022 with the issuance of 158,112 shares of Series C Preferred Stock at a loss of approximately $225,000. The balance of Bernard Rotmans note including accrued interest was approximately $164,000 at December 31, 2022. The balance of these notes payable including accrued interest to Steven and Bernard Rotman was approximately $413,000 and $157,000, respectively, at December 31, 2021.\nDuring 2020, Steven Rotman advanced Vystar funds totaling $1,048,000. In December 2020, Vystar formalized the advances and issued a promissory note to Steven Rotman. The note bears interest at an annual rate of five percent (5%) and was due one year from issuance. The maturity date was extended to December 2022 at the end of 2021. The face amount of the note represents the amount due at maturity along with accrued interest. Vystar settled this note in July 2022 with the issuance of 427,296 shares of Series C Preferred Stock at a loss of approximately $611,000. The balance of the note payable including accrued interest to Steven Rotman was approximately $1,115,000, at December 31, 2021.\nDuring 2021, Steven Rotman advanced Vystar funds totaling $398,009. Vystar formalized the advances and issued promissory notes to Steven Rotman. The notes bear interest at an annual rate of five percent (5%) and are due no later than two years from the issuance date. The face amount of the notes represents the amount due at maturity along with accrued interest. Vystar settled these notes in July 2022 with the issuance of 158,908 shares of Series C Preferred Stock at a loss of approximately $228,000. The balance of the notes payable including accrued interest to Steven Rotman was approximately $415,000 at December 31, 2021.\nThe following table summarizes the Rotman Family Nonconvertible Notes:\nSCHEDULE OF NOTES PAYABLE\nDecember 31, December 31,\nCarrying Amount\nDecember 31, December 31,\nIssue Date Principal Amount\nSteven Rotman 5% note due July 07/18/19 $ 367,500 $ - $ 412,672\nBernard Rotman 5% note due July 2023 07/18/19 140,000 164,208 157,208\nSteven Rotman 5% note due December 2022 12/22/20 1,048,000 - 1,115,243\nSteven Rotman 5% note due March 2023 03/31/21 395,000 - 411,652\nSteven Rotman 5% note due June 2023 06/02/21 3,009 - 3,097\nPrincipal amount\n$ 1,953,509 $ 164,208 $ 2,099,872\nAs of December 31, 2022, the one remaining note is due in 2023 and included in current maturities.\nDiscontinued Operations Note\nIn April 2022, Blue Oar Consulting, Inc. (Blue Oar), an entity wholly owned by Gregory Rotman, advanced Rotmans $500,000 and paid bills totaling $100,000 on Rotmans behalf. Rotmans formalized the advances and issued a promissory note to Blue Oar. The note bears interest at an annual rate of six percent (6%) and requires weekly payments of $12,500 until the note and interest is paid in full in 2023. Rotmans also granted Blue Oar a security interest in its inventory. As of December 31, 2022, the balance of the note payable including accrued interest was approximately $407,000 and is included in liabilities from discontinued operations in the accompanying consolidated balance sheet.\nNOTE 8 - DERIVATIVE LIABILITIES\nAs of December 31, 2021 Vystar had a $1,778,100 derivative liability balance on the consolidated balance sheet and recorded a gain from change in fair value of derivative liabilities of $1,778,100 and $53,600 for the years ended December 31, 2022 and 2021, respectively. The derivative liability activity comes from the convertible notes payable. Vystar analyzed the conversion features and warrants of the various note agreements for derivative accounting consideration under ASC 815-15 Derivatives and Hedging and determined that the embedded conversion features should be classified as a derivative because the exercise price of these convertible notes are subject to a variable conversion rate. Vystar has determined that the conversion feature is not considered to be solely indexed to the Companys own stock and is therefore not afforded equity treatment. In accordance with ASC 815, Vystar has bifurcated the conversion feature of the notes and recorded a derivative liability.\nThe embedded derivatives for the notes are carried on the Companys consolidated balance sheet at fair value. The derivative liability is marked-to-market each measurement period and any unrealized change in fair value is recorded as a component of the consolidated statement of operations and the associated fair value carrying amount on the consolidated balance sheet is adjusted by the change. Vystar fair values the embedded derivative using a lattice-based valuation model or Monte Carlo simulation.\nThe following table summarizes the derivative liabilities included in the consolidated balance sheet at December 31, 2022 and 2021:\nFair Value of Embedded Derivative Liabilities:\nSCHEDULE OF DERIVATIVE LIABILITIES\nBalance, beginning of the year $ 1,778,100 $ 1,766,700\nInitial measurement of liabilities - 65,000\nChange in fair value (1,778,100 ) (53,600 )\nBalance, end of the year $ - $ 1,778,100\nNOTE 9 - STOCKHOLDERS DEFICIT\nCumulative Convertible Preferred Stock\nSeries A Preferred Stock\nOn May 2, 2013, Vystar began a private placement offering to sell up to 200,000 shares of the Companys 10% Series A Cumulative Convertible Preferred Stock. Under the terms of the offering, Vystar offered to sell up to 200,000 shares of preferred stock at $10 per share for a value of $2,000,000. The preferred stock was convertible at a conversion price of $7.50 per common share at the option of the holder after a nine-month holding period. The conversion price was lowered to $5.00 per common share for those holders who invested an additional $25,000 or more in Vystars common stock in the aforementioned September 2014 Private Placement. The preferred shares have full voting rights as if converted and have a fully participating liquidation preference. In the event of a liquidation, dissolution or winding up of the Company, the holders of Series A Preferred Stock shall be entitled to receive an amount equal to the dividends accumulated and unpaid thereon to the date of final distribution to such holders, whether or not declared, without interest, plus a sum equal to $10 per share. As of December 31, 2022, the liquidation preference totals approximately $170,000.\nAs of December 31, 2022, the 8,698 shares of outstanding preferred stock had undeclared dividends of approximately $83,000 and could be converted into 33,292 shares of common stock, at the option of the holder.\nAs of December 31, 2021, the 8,698 shares of outstanding preferred stock had undeclared dividends of approximately $75,000 and could be converted into 31,591 shares of common stock, at the option of the holder.\nSeries B Preferred Stock\nOn April 11, 2022, Vystar amended its Articles of Incorporation to add the terms of a 10% Series B Cumulative Convertible Preferred Stock. Under the amendment, the number of shares authorized are 2,500,000. The preferred stock accumulates a 10% per annum dividend and is convertible into 10 shares of common stock at the option of the holder. The holders of Series B Preferred Stock have full voting rights as if converted and have a fully participating liquidation preference. In the event of a liquidation, dissolution or winding up of the Company, the holders of Series B Preferred Stock shall be entitled to receive an amount equal to the dividends accumulated and unpaid thereon to the date of final distribution to such holders, whether or not declared, without interest, plus a sum equal to $7 per share. As of December 31, 2022, the liquidation preference totals approximately $2,710,000.\nAs of December 31, 2022, the 370,969 shares of outstanding preferred stock had undeclared dividends of approximately $113,000 and could be converted into 3,871,290 shares of common stock, at the option of the holder.\nSeries C Preferred Stock\nOn July 8, 2022, Vystar amended its Articles of Incorporation to add the terms of a 10% Series C Cumulative Convertible Preferred Stock. Under the amendment, the number of shares authorized are 2,500,000. The preferred stock accumulates a 10% per annum dividend and is convertible into 10 shares of common stock at the option of the holder. The holders of Series C Preferred Stock have full voting rights as if converted and have a fully participating liquidation preference. In the event of a liquidation, dissolution or winding up of the Company, the holders of Series C Preferred Stock shall be entitled to receive an amount equal to the dividends accumulated and unpaid thereon to the date of final distribution to such holders, whether or not declared, without interest, plus a sum equal to $2.61 per share. As of December 31, 2022, the liquidation preference totals approximately $5,233,000.\nAs of December 31, 2022, the 1,917,973 shares of outstanding preferred stock had undeclared dividends of approximately $227,000 and could be converted into 20,048,021 shares of common stock, at the option of the holder.\nCommon Stock and Warrants\nDuring the year ended December 31, 2022, the Company retired 200 shares of previously issued common stock.\nDuring the year ended December 31, 2021, Vystar issued 25,334 shares of common stock under equity purchase agreements for cash proceeds totaling $38,000. In addition, 17,680 shares of common stock were issued for the conversion of 5,000 shares of Series A Preferred Stock.\nIncluded in stock subscription payable at December 31, 2022 and 2021, is $270,000 received under common stock subscription agreements for 180,000 shares during the year ended December 31, 2020.\nStock Subscription Payable\nAt December 31, 2022 and 2021, Vystar recorded $1,655,208 and $1,247,549, respectively, of stock subscription payable related to common stock to be issued. The following summarizes the activity of stock subscription payable during the year ended December 31, 2022 and 2021:\nSCHEDULE OF ACTIVITY OF STOCK SUBSCRIPTION PAYABLE\nAmount Shares\nBalance, January 1, 2021 $ 2,589,556 994,314\nAdditions 806,082 421,854\nIssuances (2,148,089 ) (811,110 )\nBalance, December 31, 2021 1,247,549 605,058\nAdditions 659,647 1,552,386\nIssuances (251,988 ) (25,568 )\nBalance, December 31, 2022 $ 1,655,208 2,131,876\nNOTE 10 - REVENUES\nThe following table presents our revenues disaggregated by each major product category and service for the last two years:\nSCHEDULE OF REVENUES\nNet Sales Net Sales Net Sales Net Sales Net Sales Net Sales Net Sales\nNet Sales\nVystar Rotmans Vystar Rotmans\n% of\n% of\n% of\n% of\nNet Sales Net Sales Net Sales Net Sales Net Sales Net Sales Net Sales\nNet Sales\nMerchandise:\nCase Goods\nBedroom Furniture $ - - $ 2,032,560 10.1 $ - - $ 2,276,316\n8.8\nDining Room Furniture - - 1,366,535 6.7 - - 1,641,966\n6.3\nOccasional - - 2,584,788 12.8 - - 3,800,158\n14.6\nTotal case goods - - 5,983,883 29.6 - - 7,718,440\n29.7\nUpholstery - - 7,953,727 39.3 - - 10,162,377\n39.1\nMattresses and Toppers 26,607 22.8 3,456,839 17.1 74,536 4.5 4,487,838\n17.3\nBroadloom, Flooring and Rugs - - 1,679,606 8.3 - - 2,213,054\n8.5\nWarranty - - 783,329 3.9 - - 740,864\n2.9\nAir Purification Units 74,105 63.6 - - 1,519,529 91.0 -\n-\nAccessories and Other 15,821 13.6 363,907 1.8 74,937 4.5 656,304\n2.5\nNet sales $ 116,533 100.0 $ 20,221,291 100.0 $ 1,669,002 100.0 $ 25,978,877\n100.0\nNOTE 11 - SHARE-BASED COMPENSATION\nGenerally accepted accounting principles require share-based payments to employees, including grants of employee stock options, warrants, and common stock to be recognized in the income statement based on their fair values at the date of grant, net of estimated forfeitures.\nIn total, Vystar recorded $837,468 and $822,070 of stock-based compensation for the years ended December 31, 2022 and 2021, respectively, including shares to be issued related to consultants and board member stock options and common stock and warrants issued to non-employees. Included in stock subscription payable is accrued stock-based compensation of $1,385,208 and $873,799 at December 31, 2022 and 2021, respectively.\nVystar used the Black-Scholes option pricing model to estimate the grant-date fair value of option and warrant awards:\n● Expected Dividend Yield - because Vystar does not currently pay dividends, the expected dividend yield is zero;\n● Expected Volatility in Stock Price - volatility based on Vystars trading activity was used to determine expected volatility;\n● Risk-free Interest Rate - reflects the average rate on a United States Treasury Bond with a maturity equal to the expected term of the option; and\n● Expected Life of Award - because we have minimal experience with the exercise of options or warrants for use in determining the expected life of each award, we used the option or warrants contractual term as the expected life.\nIn total for the years ending December 31, 2022 and 2021, Vystar recorded $11,072 and $15,989, respectively, of share-based compensation expense related to employee and board members stock options. There is no unrecognized compensation expense as of December 31, 2022.\nOptions\nDuring 2004, the Board of Directors of Vystar adopted a stock option plan (the Plan) and authorized up to 40,000 shares to be issued under the Plan. In April 2009, Vystars Board of Directors authorized an increase in the number of shares to be issued under the Plan to 100,000 shares and to include the independent Board Members in the Plan in lieu of continuing the previous practice of granting warrants each quarter to independent Board Members for services. At December 31, 2022, there are 22,518 shares of common stock available for issuance under the Plan. In 2014, the Board of Directors adopted an additional stock option plan which provides for an additional 50,000 shares, which are all available as of December 31, 2022. In 2019, the Board of Directors adopted an additional stock option plan which provides for an additional 500,000 shares, which are all available as of December 31, 2022. The Plan is intended to permit stock options granted to employees to qualify as incentive stock options under Section 422 of the Internal Revenue Code of 1986, as amended (Incentive Stock Options). All options granted under the Plan that are not intended to qualify as Incentive Stock Options are deemed to be non-qualified options. Stock options are granted at an exercise price equal to the fair market value of Vystars common stock on the date of grant, typically vest over periods up to 4 years and are typically exercisable up to 10 years.\nThere were no options granted during the years ended December 31, 2022 and 2021, respectively. Forfeitures are recognized as they occur.\nThe following table summarizes all stock option activity of Vystar for the years ended December 31, 2022 and 2021:\nSCHEDULE OF STOCK OPTION ACTIVITY\nWeighted\nWeighted Average\nAverage Remaining\nNumber Exercise Contractual\nof Shares Price Life (Years)\nOutstanding, December 31, 2020 278,750 $ 20.38 2.47\nGranted - - -\nExercised - - -\nForfeited (7,000 ) $ 59.00 -\nOutstanding, December 31, 2021 271,750 $ 19.45 1.53\nGranted - - -\nCancelled (5,000 ) $ 11.00 -\nForfeited (1,483 ) $ 41.40 -\nOutstanding, December 31, 2022 265,267 $ 19.54 0.51\nExercisable, December 31, 2022 265,267 $ 19.54 0.51\nExercisable, December 31, 2021 268,750 $ 19.66 1.48\nAs of December 31, 2022 and 2021, there was no aggregate intrinsic value on the outstanding options. The aggregate intrinsic value will change based on the fair market value of Vystars common stock.\nWarrants\nWarrants are issued to third parties as payment for services, debt financing compensation and conversion, and in conjunction with the issuance of common stock. The fair value of each common stock warrant issued for services is estimated on the date of grant using the Black-Scholes option pricing model.\nThe following table represents Vystars warrant activity for the years ended December 31, 2022 and 2021:\nSCHEDULE OF WARRANT ACTIVITY\nWeighted\nAverage\nWeighted Weighted Remaining\nNumber Average Average Contractual\nof Shares Fair Value Exercise Price Life (Years)\nOutstanding, December 31, 2020 142,060 - $ 8.48 2.53\nGranted - - - -\nExercised - - - -\nForfeited (40,317 ) - $ 25.09 -\nExpired - - - -\nOutstanding, December 31, 2021 101,743 - $ 8.19 2.36\nGranted - - - -\nCancelled (52,033 ) - $ 10.96 -\nForfeited (12,444 ) - $ 19.65 -\nExpired - - - -\nOutstanding, December 31, 2022 37,266 - $ 7.57 1.31\nExercisable, December 31, 2022 37,266 - $ 7.57 1.31\nExercisable, December 31, 2021 101,743 - $ 8.19 2.36\nNOTE 12 - RELATED PARTY TRANSACTIONS\nOfficers and Directors\nPer Steven Rotmans Employment agreement dated July 22, 2019, as amended, he is to be paid $125,000 per year in cash, $10,417 per month in shares based on a 20-day average price at a 50% discount to market, $5,000 per month in cash for expenses, as well as access to a Company provided vehicle and health and life insurance. During the year ended December 31, 2022, Vystar and Rotmans expensed approximately $417,000 related to this employment agreement. In addition, Vystar issued 1,330,066 shares of Series C Preferred Stock for the settlement of debt totaling $3,552,321. A loss of $1,900,950 was recognized on the issuance and is included in other expenses for 2022. As of December 31, 2022, Vystar had a stock subscription payable balance of $619,084, or approximately 920,000 shares to be issued in the future and $183,155 of reimbursable expenses payable and $116,403 of unpaid salary.\nThe Board of Directors authorized their board fees for 2021 be paid in common stock of Vystar. Included in stock subscription payable at December 31, 2022 and 2021 is 100,000 shares valued at $291,000, of which 20,000 shares valued at $58,200 is included in Steven Rotmans balance above.\nBlue Oar Consulting, Inc.\nThis entity is owned by Gregory Rotman, who is the son of the Companys CEO, Steven Rotman. Blue Oar provides business consulting services to Vystar. In exchange for such services, Vystar has entered into a consulting agreement with the related party entity.\nPer the consulting agreement, Blue Oar is to be paid $15,000 per month in cash for expenses, and $12,500 per month to be paid in shares based on a 20-day average at a 50% discount to market. During the year ended December 31, 2022, Vystar expensed approximately $459,000 related to the consulting agreement. In addition, Vystar issued 221,385 shares of Series C Preferred Stock for the settlement of debt and payables totaling $702,161. A loss of $313,340 was recognized on the issuance and is included in other expenses for 2022. As of December 31, 2022, Vystar had a stock subscription payable balance of $629,903, or approximately 1,049,000 shares.\nRelated Party Advances\nAs of December 31, 2022, Gregory Rotman and Steven Rotman advanced Vystar funds totaling $242,454 and $24,087, respectively. The advances are due on demand as repayment terms have not yet been finalized.\nBernard Rotman\nOn July 18, 2019, Vystar issued a contingently convertible note totaling $420,000 to Bernard Rotman as partial consideration for the acquisition of 58% of Rotmans. During the year ended December 31, 2022, Vystar issued 180,699 shares of Series C Preferred Stock for the settlement of this debt totaling $482,125. A loss of $69,007 was recognized on the issuance and is included in other expenses for 2022.\nFluid Energy Conversion Inc.\nIn May of 2019, Vystar acquired the assets of Fluid Energy Conversion, Inc. (FEC) for 25,000 shares of common stock. FEC is owned by Dr. Bryan Stone, one of Vystars directors. The assets consist of a patent on the Hughes Reactor, which has the ability to control, enhance and focus energy in flowing liquids and gases. Included in subscription stock payable at December 31, 2021 is $103,750 representing the value of the 25,000 shares on the purchase date. Vystar entered into a settlement in July 2022 and issued 16,929 shares of Series B Preferred Stock in lieu of common stock. A gain of $36,034 was realized on the settlement during the year ended December 31, 2022 and is included in other expenses for 2022.\nDesigncenters.com\nThis entity is owned by Jamie Rotman, who is the daughter of the Companys CEO, Steven Rotman. Designcenters.com (Design) provided bookkeeping and management services to the Company through July 2019. In exchange for such services, the Company had entered into a consulting agreement with the related party entity. As of December 31, 2022, the Company had a stock subscription payable balance of approximately $42,000, for approximately 8,500 shares related to this party for services incurred and expensed in 2019.\nNOTE 13 - COMMITMENTS\nEmployment and Consulting Agreements\nThe Company has entered into employment and consulting agreements with certain of our officers, employees, and affiliates. For employees, payment and benefits would become payable in the event of termination by us for any reason other than cause, or upon change in control of our Company, or by the employee for good reason.\nThere is currently one employment agreement in place with the CEO, Steven Rotman. See compensation terms in Note 12.\nDuring the year ended December 31, 2022 and 2021, the Company entered into various service agreements with consultants for financial reporting, advisory, and compliance services.\nLitigation\nFrom time to time, the Company is party to certain legal proceedings that arise in the ordinary course and are incidental to our business. Future events or circumstances, currently unknown to management, will determine whether the resolution of pending or threatened litigation or claims will ultimately have a material effect on our consolidated financial position, liquidity or results of operations in any future reporting periods.\nEMA Financial\nOn February 19, 2019, EMA Financial, Inc. filed a lawsuit in the Southern District of New York against the Company. The lawsuit alleged various breaches of an underlying convertible promissory note and stock purchase agreement and sought four claims for relief: (i) specific performance to enforce a stock conversion and contractual obligations; (ii) breach of contract; (iii) permanent injunction to enforce the stock conversion and contractual obligations; and (iv) legal fees and costs of the litigation. The complaint was filed with a motion seeking: (i) a preliminary injunction seeking an immediate resolution of the case through the stock conversion; (ii) a consolidation of the trial with the preliminary injunctive hearing; and (iii) summary judgment on the first and third claims for relief.\nThe Company filed an opposition to the motion and upon oral argument the motion for injunctive relief was denied. The Court issued a decision permitting a motion for summary judgment to proceed and permitted the Company the opportunity to supplement its opposition papers together with the plaintiff who was also provided opportunity to submit reply papers. On April 5, 2019, the Company filed the opposition papers as well as a motion to dismiss the first and third causes of action in the complaint. On March 13, 2020, the Court granted the Companys motion dismissing the first and third claims for relief and denied the motion for summary judgment as moot.\nThe Company subsequently filed an amended answer with counterclaims. The affirmative defenses if granted collectively preclude the relief sought. In addition, Vystar filed counterclaims asserting: (a) violation of 10(b)(5) of the Securities and Exchange Act; (b) violation of Section 15(a)(1) of the Exchange Act (failure to register as a broker-dealer); (c) pursuant to the Uniform Declaratory Judgment Act, 28 U.S.C. §§ 2201, the Company requests the Court to declare: (i) pursuant to Delaware law, the underlying agreements are unconscionable; (ii) the underlying agreements are unenforceable and/or portions are unenforceable, such as the liquidated damages sections; (iii) to the extent the agreement is enforceable, Vystar in good faith requests the Court to declare the legal fee provisions of the agreements be mutual (d) unjust enrichment; (e) breach of contract (in the alternative); and (f) attorneys fees.\nOn June 10, 2020, EMA filed a motion for summary judgment as to its remaining claims for relief and a motion to dismiss the Companys affirmative defenses and counterclaims. The Company opposed the motion on July 10, 2020, and the same was fully submitted to the Court on July 28, 2020. On March 29, 2021, the Court issued a decision granting in part and denying in part the motion. Specifically, the Court granted that part of the motion seeking summary judgment and dismissal on the Companys affirmative defense and counterclaim regarding Sections 15(a)/29(b) of the Exchange Act. Two weeks later the Company filed a motion for reconsideration as to the dismissal portion of the order, or, for the alternative, a motion for certification for the right to file a petition to the Second Circuit Court of Appeals on the issue. The Court denied the motion for reconsideration and certification. Subsequently, fact discovery has been completed and on June 24, 2022 both parties submitted competing motions for summary judgment.\nEMA seeks summary judgment on its breach of contract and attorneys fees claims, specifically seeking damages in the amount of $1,820,000 with 24% interest premised on the argument it was entitled to effectuate a January 15 and February 5, 2019, notices of conversions. EMA further seeks to dismiss Vystars affirmative defenses and counterclaims. Conversely, Vystar filed its motion for summary judgment seeking an order to dismiss the EMA complaint on the grounds: (i) the underlying note was satisfied on December 11, 2018; and (ii) EMA, through multiple breaches of the note, over-converted the note by 36,575,555 shares equating to a request of damages against EMA and in favor of Vystar for $4,802,000, with interest accruing at 24%, and attorneys fees. The briefing by the parties was fully submitted on July 29, 2022.\nOn January 6, 2023, the Court issued a series of preliminary rulings based upon the parties respective summary judgment motions. Those rulings narrowed the outstanding issues (and claims) to only the parties breach of contract claim and counterclaim (and affirmative defenses) regarding the conversion process. Of particular importance, the Court found EMA breached the note by failing to effectuate the conversions in the manner outlined by the controlling note. The Court further found the principal balance at issue was $80,000, interest accrued from the date set in the note and default interest, to the extent applicable, was to accrue at the default rate from September 2018, forward. The Court left undecided whether EMAs breach of the note was material, whether affirmative defenses as previously raised by the parties were applicable to each parties contractual claim, and a damages analysis associated with the same. The Court then requested a supplemental briefing as to the issues of materiality, liability and damages. The issues were fully briefed and submitted on February 24 and March 15, 2023. The parties await a final decision from the Court.\nNOTE 14 - MAJOR CUSTOMERS AND VENDORS\nMajor customers and vendors are defined as a customer or vendor from which Vystar and Rotmans derive at least 10% of its revenue and cost of revenue, respectively.\nDuring the years ended December 31, 2022 and 2021, Vystar and Rotmans made approximately 11% and 14%, respectively, of its purchases from one major vendor. There was no balance owed at December 31, 2022. They owed its major vendor approximately $167,000 at December 31, 2021.\nNOTE 15 - INCOME TAXES\nThe provision (benefit) for income taxes for the years ended December 31, 2022 and 2021 assumes a 21% effective tax rate for federal income taxes. A reconciliation of the federal statutory income tax rate and the effective income tax rate as a percentage of income before income taxes is as follows:\nSCHEDULE OF PROVISION FOR INCOME TAXES\nYear Ended\nDecember 31,\nFederal statutory income tax rate (21.0 )% (21.0 )%\nChange in valuation allowance on net operating loss carryforwards 21.0 21.0\nEffective income tax rate 0.0 % 0.0 %\nDeferred tax assets as of December 31, 2022 and 2021 are as follows:\nSCHEDULE OF DEFERRED TAX ASSETS\nNOL carryforwards $ 8,300,000 $ 7,500,000\nLess valuation allowance (8,300,000 ) (7,500,000 )\nDeferred tax assets $ - $ -\nDeferred taxes are caused primarily by net operating loss carryforwards. U.S. Tax Legislation enacted in 2017 (the TCJA) has significantly changed certain aspects of U.S. federal income taxation. Net Operating Losses (NOLs) generated in 2017 and prior years can be carried forward for 20 years. NOLs generated in 2018 - 2020, as enacted by the CARES Act, can be carried forward indefinitely. However, NOLs generated after 2020 can also carried forward indefinitely but limited to 80% of taxable income.\nFor federal income tax purposes, Vystar has a net operating loss carryforward of approximately $39,700,000 as of December 31, 2022, of which approximately $18,400,000 expires beginning in 2024 and $21,300,000 which can be carried forward indefinitely. For state income tax purposes, Vystar has a net operating loss carryforward of approximately $18,400,000 and $21,000,000 as of December 31, 2022 in Georgia and Massachusetts, respectively, which expires beginning in 2038.\nIn addition, as of December 31, 2022, Rotmans has a net operating loss carryforward of approximately $4,400,000 for federal income tax purposes of which $1,800,000 expires beginning in 2029 and $2,600,000 can be carried forward indefinitely. Rotmans has a state operating loss carryforward of approximately $3,500,000 which expires beginning in 2038.\nPursuant to Internal Revenue Code Section 382, the future realization of our net operating loss carryforwards to offset future taxable income may be subject to an annual limitation as a result of ownership changes that may have occurred previously or that could occur in the future.\nNOTE 16 - PROFIT SHARING PLAN (DISCONTINUED OPERATIONS)\nRotmans sponsored a qualified 401(k) profit sharing plan covering all eligible employees. The plan permitted participants to make tax-deferred contributions to the plan by salary reduction. Company contributions were discretionary and determined annually by the Board of Directors.\nThere were no contributions from Rotmans in 2022 and 2021. Participant and Company contributions were limited to amounts allowed under the Internal Revenue Code. The plan was terminated on December 1, 2022.\nRotmans offered no post-retirement benefits other than the plan discussed above and no significant post-employment benefits.\nNOTE 17 - DISCONTINUED OPERATIONS\nAt the completion of its Going Out of Business sale, Rotmans closed its showroom on December 14, 2022. The Company has accounted for the closing as discontinued operations in accordance with ASC No. 205-20, Discontinued Operations. The results of operations are presented as discontinued operations in 2022 and 2021. The assets and liabilities have been presented in the consolidated balance sheets as assets and liabilities of discontinued operations.\nThe income (loss) from discontinued operations are as follows:\nSCHEDULE OF DISCONTINUED OPERATIONS\nRevenue $ 20,221,291 $ 25,978,877\nCost of revenue 8,391,180 11,594,698\nGross profit 11,830,111 14,384,179\nOperating expenses:\nSalaries, wages and benefits 3,118,238 4,165,466\nAgent fees 2,894,478 4,273,308\nProfessional fees 291,579 30,471\nAdvertising 1,212,426 1,922,614\nConsulting 3,500 -\nRent 746,321 1,080,794\nService charges 557,923 563,786\nDepreciation and amortization 383,491 558,611\nLoss on impairment 1,390,609 -\nOther operating 1,897,927 2,378,862\nTotal operating expenses 12,496,492 14,973,912\nLoss from operations (666,381 ) (589,733 )\nOther income (expense):\nInterest expense (389,667 ) (425,019 )\nGain on settlement of debt, net 51,856 2,805,800\nOther income, net 116,564 724,779\nTotal other income (expense), net (221,247 ) 3,105,560\nNet income (loss) from discontinued operations $ (887,628 ) $ 2,515,827\nDetails of the balance sheet items for discontinued operations are as follows:\nCurrent assets:\nCash $ 123,325 $ 21,655\nAccounts receivable 1,853,972 46,410\nOther receivables 684,775 875,362\nInventories 76,379 3,695,074\nPrepaid expenses and other 288,520 282,273\nDeferred commission costs - 73,625\nTotal current assets $ 3,026,971 $ 4,994,399\nNon-current assets:\nProperty and equipment, net $ 490,420 $ 647,657\nOperating lease right-of-use assets, net 7,008,276 7,776,978\nFinance lease right-of-use assets, net - 551,037\nIntangible assets, net - 659,860\nGoodwill - 313,209\nInventories, long-term - 228,030\nOther assets 5,274 65,860\nTotal non-current assets $ 7,503,970 $ 10,242,631\nCurrent liabilities:\nAccounts payable $ 339,426 $ 3,165,672\nAccrued expenses 726,410 311,792\nOperating lease liabilities - current maturities 737,000 634,000\nFinance lease liabilities - current maturities 119,000 134,000\nRelated party debt - current maturities 406,753 -\nUnearned revenue - 800,836\nTotal current liabilities $ 2,328,589 $ 5,046,300\nNon-current liabilities:\nOperating lease liabilities, net of current maturities $ 5,189,140 $ 5,683,736\nFinance lease liabilities, net of current maturities 324,527 443,882\nUnearned revenue, net of current maturities - 241,991\nTotal non-current liabilities $ 5,513,667 $ 6,369,609\nThe consolidated statements of cash flows do not present the cash flows from discontinued operations separately from cash flows from continuing operations. Included in adjustments to reconcile net loss to net cash used in operating activities are the following discontinued operations items:\nDepreciation $ 135,158 $ 310,277\nBad debts 16,514 (1,362 )\nAmortization of intangible assets 248,333 248,334\nNoncash lease expense 267,009 345,355\nImpairment loss 1,390,609 -\n(Gain) loss on settlement of debt, net (51,856 ) (2,805,800 )\nGain on sale of property and equipment 22,080 210,951\nLoss on sale of investments - 4,180\nNet unrealized gain on available-for-sale investments - (20,480 )\nNOTE 18 - SUBSEQUENT EVENTS\nRotmans final principal payment to Blue Oar was made in April 2023.\nRotmans sold its parking lots to a third-party in May 2023 at a gain of approximately $200,000. The lots were not classified as held for sale at year-end as no plan to sell the lots was made at December 31, 2022.\nRotmans facilities lease was amended on August 10, 2023. Beginning in September 2023, in addition to the monthly base rent, Rotmans will be responsible for the base year heating costs of $9,833 per month with any annual increase over the base year due within thirty days of receipt. A supplementary payment of $10,106 for insurance costs was made with the amendment. Rotmans also assumed liability for roof repairs for a specified building within the facilities; subleases will be deemed approved by the lessor unless notified to the contrary within ten days, and the lessor has the option, with a six-month notice, to terminate the lease after December 31, 2028. Simultaneously, two subleases were approved with occupancy scheduled to begin shortly. Base sublease rent in the aggregate totals $30,993 per month with annual increases based on the consumer price index. Each lease term is at least five years. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nThe Companys Chief Executive Officer and Chief Financial Officer (the Certifying Officer) is responsible for establishing and maintaining disclosure controls and procedures for the Company. Although the Certifying Officer has designed such disclosure controls and procedures to ensure that material information is made known to them, particularly during the period in which this report was prepared, certain material weaknesses occurred during the year ended December 31, 2022 and subsequent to year end. The Certifying Officer has evaluated the effectiveness of the Companys disclosure controls and procedures (as such term is defined in Exchange Act Rules 13a-15(e) and 15d-15(e) (the Rules) under the Securities Exchange Act of 1934 (or Exchange Act) as of the end of the period covered by this Annual Report and is working on improving controls with an outside CPA firm and internal resources.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Exchange Act Rule 13a-15(f) and 15d - 15(f) under the Securities Exchange Act of 1934). Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. Internal control over financial reporting includes those policies and procedures that: (i) in reasonable detail accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements; (iii) provide reasonable assurance that our receipts and expenditures are made in accordance with management authorization; and (iv) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting, however well designed and operated, can provide only reasonable, and not absolute, assurance that the controls will prevent or detect misstatements. In addition, the design of any control system is based in part upon certain assumptions about the likelihood of future events. Because of these and other inherent limitations of control systems, there is only the reasonable assurance that our controls will succeed in achieving their goals under all potential future conditions.\nManagement, under the supervision and with the participation of our Chief Executive Officer and our acting Chief Financial Officer, conducted an evaluation of our internal control over financial reporting as of December 31, 2022 based on the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) 2013. Based on our evaluation under the COSO framework, management concluded that our internal control over financial reporting was not effective as of December 31, 2022. Such conclusion was reached based on the following material weaknesses noted by management:\na) We have a lack of segregation of duties due to the small size of the Company.\nb) The Company did not maintain reasonable control over records underlying transactions necessary to permit preparation of the Companys financial statements.\nc) Lack of controls that provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposal of the Companys assets that could have a material effect on the financial statements.\nd) Lack of a formal CFO position who can devote significant attention to financial reporting resulted in multiple audit adjustments.\ne) Lack of a functioning audit committee, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures. Management believes the lack of a functioning audit committee results in ineffective oversight in the establishment and monitoring of required internal controls and procedures, which could result in a material misstatement in our financial statements in future period.\nManagement expects to strengthen internal control during 2023 by developing stronger business and financial processes for accounting for transactions such as warrant/stock issuances, which will enhance internal control for the Company. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nBoard of Directors\nThe following tables set forth the name and information of each director of Vystar as of December 31, 2022. Each director is elected to serve until the next Annual Meeting of Stockholders.\nName\nPrincipal Occupation During Last Five Years\nAge\nDirector\nSince\nJoseph C. Allegra, Jr., PhD\nJoseph Allegra, PhD was elected Chairman of the Board on February 14, 2018 and has followed Vystars progress for numerous years and has assisted as an investment advisor and investor, providing insight into positioning the company to attract investors, particularly in the healthcare sector. He currently is an Instructor of Epidemiology and Biostatistics at the University of Georgia and an Investment Advisor at Lincoln Lee Investments in Atlanta. Previously he was a Senior Drug Safety Associate at Genentech. Dr. Allegra received his BA in Psychology from Boston University, and his Master of Public Health and Doctor of Philosophy degrees from the University of Georgia.\nSteven Rotman\nSteven Rotman was elected Chief Executive Officer and a Director of Vystar Corporation. Mr. Rotman has been President and CEO of Rotmans, one of the oldest and largest, furniture and carpet retailers in New England, for more than 40 years. In addition, he is the founder and managing partner of NHS Holdings, a company that in 2015 became the exclusive distributor of Vytex™ natural rubber latex foam in the U.S. and laid the groundwork for Vytexs entrance to the home furnishings industry. Mr. Rotman received a BBA degree from Clark University and an MS from New York University.\nBryan Stone, MD\nBryan Stone, M.D, has advised Vystar over the past years relating to product development for the healthcare industry and brings to the Board an understanding of the challenges of new product development for start-up companies. He is the Chairman of Medicine at Desert Regional Medical Center in Palm Springs, California, and is the Medical Director at multiple DaVita Dialysis Centers. He is also an entrepreneur, serving as the Interim CEO of Fluid Energy Conversion, Inc., a firm specializing in molecular fluid mechanics, specifically high efficiency mass producible energy conversion technologies.\nByron L. Novosad, DDS\nByron L. Novosad, DDS was appointed to the Board on January 25, 2021.Dr Novosad received a BA in Chemistry from Baylor University and graduated from the University of Texas Dental School in Houston and later received his Certificate in Periodontics in 1982. Dr. Novosad brings experience to the Board in the medical and health care field, and served previously as a consultant to UV Flu Technologies from 2011 to 2015 and a consultant to Vystar Corporation from 2013 to 2015. He has operated a private periodontal practice in the Houston, Texas area for 30 years and has been a Clinical Assistant Professor of Periodontics at the Periodontic Graduate Clinic for the University of Texas Dental branch in Houston since 2007. He was on the Advisory Board of Wharton County Jr. College School of Dental Hygiene for 37 years.\nDirector Independence\nUnder Rule 5605(b)(1) of the Nasdaq Marketplace Rules, independent directors must comprise a majority of a listed companys board of directors within one year of listing. In addition, Nasdaq Marketplace Rules require that, subject to specified exceptions, each member of a listed companys audit, compensation and nominating and governance committees be independent. While Vystar does not currently qualify for listing on Nasdaq and will likely not qualify for some time after the date of this proxy statement, it does intend to seek such listing as soon as possible and complies with its Marketplace Rules. Audit committee members must also satisfy the independence criteria set forth in Rule 10A-3 under the Securities Exchange Act of 1934, as amended. Under Nasdaq Marketplace Rule 5605(a)(2), a director will only qualify as an independent director if, in the opinion of that companys board of directors, that person does not have a relationship that would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. In order to be considered to be independent for purposes of Rule 10A-3, a member of an audit committee of a public company may not, other than in his or her capacity as a member of the audit committee, the board of directors, or any other board committee: (1) accept, directly or indirectly, any consulting, advisory, or other compensatory fee from the public company or any of its subsidiaries; or (2) be an affiliated person of the listed company or any of its subsidiaries.\nIn March of 2013, our Board undertook a review of its composition, the composition of its committees and the independence of each director. Based upon information requested from and provided by each director concerning his or her background, employment and affiliations, including family relationships, our Board has determined none of the directors has a relationship that would interfere with the exercise of independent judgment in carrying out the responsibilities of a director and that each of these directors is independent as that term is defined under Nasdaq Marketplace Rule 5605(a)(2).\nAudit Committee\nThe Board member serving on our Audit Committee was Dr. Stone. Our Board has determined that Dr. Stone satisfies the requirements for financial literacy under the current requirements of the Nasdaq Marketplace Rules. He is an audit committee financial expert, as defined by SEC rules and satisfy the financial sophistication requirements of The NASDAQ Global Market. Our Audit Committee assists our Board in its oversight of our accounting and financial reporting process and the audits of our financial statements. The Audit Committees responsibilities include:\n● appointing, approving the compensation of, and assessing the independence of our independent registered public accounting firm;\n● overseeing the work of our independent registered public accounting firm, including through the receipt and consideration of reports from such firm;\n● reviewing and discussing with management and the independent registered public accounting firm our annual and quarterly financial statements and related disclosures;\n● monitoring our internal control over financial reporting, disclosure controls and procedures and code of business conduct and ethics;\n● discussing our risk management policies;\n● establishing policies regarding hiring employees from the independent registered public accounting firm and procedures for the receipt and resolution of accounting related complaints and concerns;\n● meeting independently with our independent registered public accounting firm and management;\n● reviewing and approving or ratifying any related person transactions; and\n● preparing the audit committee report required by SEC rules.\nAll audit and non-audit services, other than de minimus non-audit services, to be provided to us by our independent registered public accounting firm must be approved in advance by our Audit Committee.\nAudit Committee Charter\nWe have adopted an Audit Committee Charter which sets out the duties and responsibilities of our Audit Committee. The Audit Committee Charter is available on our website at www.vystarcorp.com. Any amendments to the Charter, or any waivers of its requirements, will be disclosed on our website.\nMeetings of the Board and Committees\nDuring fiscal year 2022, our Board held one meeting, and its Audit Committee held one meeting. Each director attended the meeting in fiscal year 2022. Members of our Board are encouraged to attend our annual meetings of shareholders.\nCORPORATE GOVERNANCE\nCorporate Governance Guidelines\nWe believe in sound corporate governance practices and have adopted formal Corporate Governance Guidelines to enhance our effectiveness. Our Board adopted these Corporate Governance Guidelines in order to ensure that it has the necessary practices in place to review and evaluate our business operations as needed and to make decisions that are independent of our management. The Corporate Governance Guidelines are also intended to align the interests of directors and management with those of our shareholders. The Corporate Governance Guidelines set forth the practices our Board follows with respect to Board and committee composition and selection, Board meetings, chief executive officer performance evaluation and management development and succession planning for senior management, including the chief executive officer position. A copy of our Corporate Governance Guidelines is available on our website at www.vystarcorp.com.\nCode of Business Conduct and Ethics\nWe adopted a Code of Business Conduct and Ethics applicable to all officers, directors and employees of Vystar that comply with NASDAQ listing standards. The Code of Business Conduct and Ethics includes an enforcement mechanism, and any waivers for directors or executive officers must be approved by our Board and disclosed in a current report on Form 8-K with the SEC. This Code of Business Conduct is publicly available on our website at www.vystarcorp.com. There were no waivers of the Code of Business Conduct and Ethics for any of our directors or executive officers during fiscal year 2022. ITEM 11. EXECUTIVE COMPENSATION\nOverview\nEXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following table sets forth information regarding compensation earned by our, Chief Executive Officer and President for 2022 and 2021.\nName and Principal Position Salary Option\nAwards(1)\nTotal\nSteven Rotman - 2022 $ 185,000 $ 236,150 $ 421,150\nChief Executive Officer, Chief Financial Officer and President\nSteven Rotman - 2021 $ 185,000 $ 292,329 $ 447,329\nChief Executive Officer, Chief Financial Officer and President\n(1) These amounts do not reflect the actual economic value realized by the executive officers. In accordance with SEC rules, the amounts in this column for 2022 and 2021 represent the dollar amount recognized as compensation expense by Vystar for financial statement reporting purposes for fiscal years 2022 and 2021 for stock and options granted to each of the executive officers in each such fiscal year in accordance with applicable accounting guidance related to stock-based compensation. Pursuant to SEC rules, the amounts shown disregard the impact of estimated forfeitures related to service-based vesting conditions.\nDIRECTOR COMPENSATION\nThe following table sets forth certain information with respect to compensation awarded to, paid to or earned by each of Vystars non-employee directors during fiscal year 2022.\nName Fees\nEarned\nor\nPaid in\nCash ($)\nStock\nAwards\n($)(3)\nOption Awards ($) (1) Total\n($)(2)\nJoseph C. Allegra, Jr., PhD - - 3,691 3,691\nBryan Stone, M.D. - - 3,691 3,691\nByron L. Novosad, DDS - - - -\n(1) On December 15, 2017, Dr. Stone and Dr. Allegra as non-employee directors were granted 500,000 options at $0.05 per share which vest 25,000 options at the end of each fiscal quarter for five (5) years beginning December 31, 2017.\nThe amounts included represent the portion of the original total grant date fair value of options that vested in 2022 together with the dollar amount recognized as compensation expense by Vystar for financial statement reporting purposes for fiscal year 2022 in accordance with applicable accounting guidance related to stock-based compensation.\n(2) These amounts do not reflect the actual economic value realized by the directors. In accordance with SEC rules, this column represents the dollar amount recognized as compensation expense by Vystar for financial statement reporting purposes for fiscal year 2022 for stock options granted to each of the non-employee directors during fiscal years 2017 through 2022 in accordance with applicable accounting guidance related to stock-based compensation. Pursuant to SEC rules, the amounts shown disregard the impact of estimated forfeitures related to service-based vesting conditions.\nCompensation Philosophy\nThe current policy of our Board is that compensation for non-employee directors should be equity-based compensation to reward directors for quarterly periods of service in fulfilling their oversight responsibilities.\nExpenses\nWe reimburse our directors for their travel and related expenses in connection with attending Board and committee meetings, as well as costs and expenses incurred in attending director education programs and other Vystar-related seminars and conferences. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth the beneficial ownership of our common stock as of December 31, 2022 by each entity or person who is known to beneficially own 5% or more of our common stock, each of our directors, each Executive Officer identified in Executive Compensation-Summary Compensation Table contained in this proxy statement and all of our directors and current executive officers as a group. This table is based upon information supplied by executive officers, directors and principal shareholders. Unless otherwise indicated in the footnotes to this table and subject to community property laws where applicable, each of the shareholders named in this table has sole voting and investment power with respect to the shares indicated as beneficially owned. None of the shares beneficially owned by our executive officers and directors are pledged as security. Applicable percentages are based on shares outstanding on December 31, 2022, adjusted as required by rules promulgated by the SEC.\nOfficers and Directors\nSteven Rotman\nWorcester, MA 348,035 2.689 %\nBryan Stone, M.D.\nPalm Springs, CA 209,663 1.620 %\nJoseph Carmen Allegra, Jr., PhD\nAtlanta, GA 10,000 0.077 %\nByron L. Novosad, DDS\nHouston, TX 6,667 0.052 %\nAll Directors and Executive Officers as a Group 574,365 4.438 %\nTotal Shares Outstanding 12,942,592\nSECTION 16(A) BENEFICIAL OWNERSHIP REPORTING COMPLIANCE\nSection 16(a) of the Exchange Act requires our executive officers and directors, and any person or entity who owns more than ten percent of a registered class of our common stock or other equity securities, to file with the SEC certain reports of ownership and changes in ownership of our securities. Executive officers, directors and shareholders who hold more than ten percent of our outstanding common stock are required by the SEC to furnish us with copies of all required forms filed under Section 16(a). We prepare Section 16(a) forms on behalf of our executive officers and directors based on the information provided by them.\nBased solely on review of this information and written representations by our executive officers and directors that no other reports were required, we believe that, during fiscal year 2022 each director filed the forms required by Section 16(a) of the Exchange Act on a timely basis with respect to the repricing of option and warrants.\nEQUITY COMPENSATION PLAN INFORMATION\nThe following table shows information related to our common stock which may be issued under our compensation plans, as amended, as of December 31, 2022:\nPlan Category Number of securities\nto be issued\nupon\nexercise of\noutstanding options\nWeighted Average Exercise price of outstanding options Number of\nsecurities\nremaining\navailable\nfor future\nissuance\nunder equity\ncompensation\nplans\n(excluding\nsecurities\nreflected\nin first column)\n2004 Long-Term Incentive Compensation Plan, as amended, approved by shareholders 77,483 $ 580 22,517\n2014 Long-Term Incentive Compensation Plan 50,000\n2019 Equity Incentive Plan 500,000\nTotal 77,483 $ 580 572,517\nOur 2004 Long-Term Incentive Compensation Plan, as amended, which we refer to as the 2004 Plan, was adopted by our Board in 2004, and amended and approved by our shareholders in 2009. A maximum of 100,000 shares of common stock were authorized for issuance under the 2004 Plan.\nThe 2004 Plan provides for the grant of incentive stock options, non-statutory stock options, restricted stock and other stock-based awards. Our officers, employees, consultants and directors are eligible to receive awards under the 2004 Plan; however, incentive stock options may only be granted to our employees. In accordance with the terms of the 2004 Plan, our Board administers the 2004 Plan and, subject to any limitations in the 2004 Plan, selects the recipients of awards and determines:\n● the number of shares of common stock covered by options and the dates upon which those options become exercisable;\n● the exercise prices of options;\n● the duration of options;\n● the methods of payment of the exercise price; and\n● the number of shares of common stock subject to any restricted stock or other stock-based awards and the terms and conditions of those awards, including the conditions for repurchase, issue price and repurchase price.\nPursuant to the terms of the 2004 Plan, in the event of a change in control of our company, each outstanding option under the 2004 Plan will vest, but the holders shall have the right, assuming the holder still maintains a continuous service relationship with us, immediately prior to such dissolution or liquidation, to exercise the option to the extent exercisable on the date of such dissolution or liquidation.\nIn the event of a merger or other reorganization event, our Board shall have the discretion to provide for any or all of the following: (a) the acceleration of vesting or the termination of our repurchase rights of any or all of the outstanding awards, (b) the assumption or substitution of all options by the acquitting or succeeding entity or (c) the termination of all options that remain outstanding at the time of the merger or other reorganization event. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nReview, Approval or Ratification of Transactions with Related Persons\nVystars Code of Business Conduct requires that all employees and directors avoid conflicts of interests that interfere with the performance of their duties or are not in the best interests of Vystar.\nIn addition, pursuant to its written charter, the Audit Committee considers and approves or disapproves any related person transaction as defined under Item 404 of Regulation S-K promulgated by the SEC, after examining each such transaction for potential conflicts of interest and other improprieties. The Audit Committee has not adopted any specific written procedures for conducting such reviews and considers each transaction in light of the specific facts and circumstances presented.\nTransactions with Related Persons\nPer Steven Rotmans Employment agreement dated July 22, 2019, as amended, he is to be paid $125,000 per year in cash, $10,417 per month in shares based on a 20-day average price at a 50% discount to market, $5,000 per month in cash for expenses, as well as access to a Company provided vehicle and health and life insurance. During the year ended December 31, 2022, Vystar and Rotmans expensed approximately $417,000 related to this employment agreement. In addition, Vystar issued 1,330,066 shares of Series C Preferred Stock for the settlement of debt totaling $3,552,321. A loss of $1,900,950 was recognized on the issuance and is included in other expenses for 2022. As of December 31, 2022, Vystar had a stock subscription payable balance of $619,084, or approximately 920,000 shares to be issued in the future and $183,155 of reimbursable expenses payable and $116,403 of unpaid salary.\nThe Board of Directors authorized their board fees for 2021 be paid in common stock of Vystar. Included in stock subscription payable at December 31, 2022 and 2021 is 100,000 shares valued at $291,000, of which 20,000 shares valued at $58,200 is included in Steven Rotmans balance above.\nSteven Rotman advanced Vystar $24,087 in 2022 for working capital purposes. The advances are due on demand as repayment terms have not yet been finalized.\nBlue Oar Consulting, Inc. (Blue Oar) is owned by Gregory Rotman, who is the son of the Companys CEO, Steven Rotman. Blue Oar provides business consulting services to Vystar. In exchange for such services, Vystar has entered into a consulting agreement with the related party entity. Per the consulting agreement, Blue Oar is to be paid $15,000 per month in cash for expenses, and $12,500 per month to be paid in shares based on a 20-day average at a 50% discount to market. During the year ended December 31, 2022, Vystar expensed approximately $459,000 related to the consulting agreement. In addition, Vystar issued 221,385 shares of Series C Preferred Stock for the settlement of debt and payables totaling $702,161. A loss of $313,340 was recognized on the issuance and is included in other expenses for 2022. As of December 31, 2022, Vystar had a stock subscription payable balance of $629,903, or approximately 1,049,000 shares.\nGregory Rotman advanced Vystar $242,454 in 2022 for working capital purposes. The advances are due on demand as repayment terms have not yet been finalized.\nBlue Oar advanced Rotmans $500,000 and paid expenses totaling $100,000 on their behalf in 2022. Rotmans formalized the advances and issued a promissory note to Blue Oar. The note bears interest at an annual rate of six percent (6%) and requires weekly payments of $12,500 until the note and interest is paid in full in 2023. Rotmans also granted Blue Oar a security interest in its inventory. As of December 31, 2022, the balance of the note payable including accrued interest is approximately $407,000.\nDirector Independence\nUnder Rule 5605(b)(1) of the Nasdaq Marketplace Rules, independent directors must comprise a majority of a listed companys board of directors within one year of listing. In addition, Nasdaq Marketplace Rules require that, subject to specified exceptions, each member of a listed companys audit, compensation and nominating and governance committees be independent. While Vystar does not currently qualify for listing on Nasdaq and will likely not qualify for some time after the date of this proxy statement, it does intend to seek such listing as soon as possible and complies with its Marketplace Rules. Audit committee members must also satisfy the independence criteria set forth in Rule 10A-3 under the Securities Exchange Act of 1934, as amended. Under Nasdaq Marketplace Rule 5605(a)(2), a director will only qualify as an independent director if, in the opinion of that companys board of directors, that person does not have a relationship that would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. In order to be considered to be independent for purposes of Rule 10A-3, a member of an audit committee of a public company may not, other than in his or her capacity as a member of the audit committee, the board of directors, or any other board committee: (1) accept, directly or indirectly, any consulting, advisory, or other compensatory fee from the public company or any of its subsidiaries; or (2) be an affiliated person of the listed company or any of its subsidiaries. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nDuring fiscal year 2022 and 2021, we retained the firm of Macias Gini & OConnell (MGO) to provide audit services. Below is a table of fees incurred in the following categories and amounts:\nFee Category 2022($) 2021($)\nAudit Fees 190,000 190,000\nAudit-Related Fees - -\nTax Fees - -\nAll Other Fees - -\nTotal 190,000 190,000\nAudit fees include the audit of Vystars annual financial statements, review of financial statements included in each of our Quarterly Reports on Form 10-Q, and services that are normally provided in connection with statutory and regulatory filings or engagements for those fiscal years.\nAudit-related fees consist of fees for assurance and related services that are reasonably related to the performance of the audit or review of our financial statements.\nTax fees consist of fees for professional services for tax compliance, tax advice and tax planning. This category includes fees primarily related to the preparation and review of federal, state and assistance with tax audits. No tax fees were incurred for the current or previous period.\nAll other fees include assurance services not related to the audit or review of our financial statements. No other fees were incurred for the current or previous period.\nThere were no non-audit services provided by MGO for the current or previous period.\nAUDIT COMMITTEE PRE-APPROVAL OF SERVICES PERFORMED BY OUR\nINDEPENDENT REGISTERED PUBLIC ACCOUNTANTS\nIt is the policy of our Audit Committee to pre-approve all audit and permissible non-audit services to be performed by MGO. Our Audit Committee pre-approves services by authorizing specific projects within the categories outlined above, subject to a budget for each category. Our Audit Committees charter delegates to one or more members of the Audit Committee the authority to address any requests for pre-approval of services between Audit Committee meetings, and the subcommittee or such member or members must report any pre-approval decisions to our Audit Committee at its next scheduled meeting.\nAll services related to audit fees provided by MGO during fiscal year 2022 and 2021 were pre-approved by the Audit Committee in accordance with the pre-approval policy described above.\nREPORT OF THE AUDIT COMMITTEE\nThe Audit Committees role includes the oversight of our financial, accounting and reporting processes; our system of internal accounting and financial controls; our enterprise risk management program; and our compliance with related legal, regulatory and ethical requirements. The Audit Committee oversees the appointment, compensation, engagement, retention, termination and services of our independent registered public accounting firm, including conducting a review of its independence; reviewing and approving the planned scope of our annual audit; overseeing our independent registered public accounting firms audit work; reviewing and pre-approving any audit and non-audit services that may be performed by it; reviewing with management and our independent registered public accounting firm the adequacy of our internal financial and disclosure controls; reviewing our critical accounting policies and the application of accounting principles; and monitoring the rotation of partners of our independent registered public accounting firm on our audit engagement team as required by regulation. The Audit Committee establishes procedures, as required under applicable regulation, for the receipt, retention and treatment of complaints received by us regarding accounting, internal accounting controls or auditing matters and the submission by employees of concerns regarding questionable accounting or auditing matters. The Audit Committees role also includes meeting to review our annual audited financial statements and quarterly financial statements with management and our independent registered public accounting firm. The Audit Committee held one meeting during fiscal year 2022.\nThe member of the Audit Committee met the independence criteria prescribed by applicable regulation and the rules of the SEC for audit committee membership and are independent director within the meaning of NASDAQ listing standards. The Audit Committee member meets NASDAQs financial literacy requirements, and the Board further determined that the member is an audit committee financial expert as such term is defined in Item 407(d) of Regulation S-K promulgated by the SEC also meets NASDAQs financial sophistication requirements. The Audit Committee acts pursuant to a written charter, which complies with the applicable provisions of the Sarbanes-Oxley Act of 2002 and related rules of the SEC and NASDAQ, a copy of which can be found on our website at www.vystarcorp.com.\nI have reviewed and discussed with management and MGO Vystars audited financial statements. I discussed with MGO and Vystars Chief Financial Officer the overall scope and plans of MGOs audit. I met with MGO, with and without management present, to discuss results of its examinations, its evaluation of Vystars internal controls, and the overall quality of Vystars financial reporting.\nI have reviewed and discussed with MGO matters required to be discussed pursuant to Statement on Auditing Standards No. 61, as amended (AICPA, Professional Standards, Vol. 1. AU section 380), as adopted by the Public Company Accounting Oversight Board in Rule 3200T. I have received from MGO the written disclosures and letter required by the applicable requirements of the Public Company Accounting Oversight Board regarding MGOs communications with the Audit Committee concerning independence. I have discussed with MGO matters relating to its independence.\nBased on the reviews and discussions referred to above and my review of Vystars audited financial statements for fiscal year 2022, I recommended to the Board that Vystars audited financial statements be included in the Annual Report on Form 10-K for the fiscal year ended December 31, 2022, for filing with the SEC.\nRespectfully submitted,\nAUDIT COMMITTEE\nBryan Stone, M.D., Chair\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n1. FINANCIAL STATEMENTS\nThe following financial statements and notes thereto of Vystar Corporation, and the related Report of Independent Registered Public Accounting Firm are set forth in Item 8.\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Stockholders Deficit\nConsolidated Statements of Cash Flows\n2. FINANCIAL STATEMENT SCHEDULES\nAll schedules for which provision is made in the applicable accounting regulations of the SEC have been omitted because they are not applicable, or the required information is included in the financial statements or notes thereto.\n3. EXHIBITS\nExhibit Index *\n* Some Exhibits have certain confidential information redacted pursuant to a request for confidential treatment\nNumber\nDescription\n3.1\nArticles of Incorporation of Vystar Acquisition Corporation (now named Vystar Corporation) dated December 17, 2003 (as amended) (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n3.2\nArticles of Amendment to the Articles of Incorporation of Vystar Corporation (incorporated by reference to Vystar Corporations Annual Report on Form 10-K for the year ended December 31, 2015 filed on April 14, 2016.)\n3.3\nBylaws of Vystar Corporation (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n4.1\nSpecimen Certificate evidencing shares of Vystar common stock (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n4.2\nForm of Share Subscription Agreements and Investment Letter (First Private Placement) (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n4.3\nForm of Share Subscription Agreement and Investment Letter (Second Private Placement) (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n4.4\nForm of Vystar Corporation Investor Questionnaire and Subscription Agreement (Third Private Placement) (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n4.5\nWarrant to Purchase Shares of Common Stock of Vystar Corporation dated March 11, 2011 issued to Topping Lift Capital LLC (incorporated by reference to Vystars Current Report on Form 8-K dated March 11, 2011 and filed on March 15, 2011)\n4.6\nForm of Warrant issued to Investor note holders (incorporated by reference to Vystars Current Report on Form 8-K dated March 11, 2011 and filed on March 15, 2011)\n4.7\nForm of Series A-1 Warrant (incorporated by reference to Vystars Current Report on Form 8-K filed on June 11, 2012)\n10.1*\nManufacturing Agreement between Vystar Corporation and Revertex (Malaysia) Sdn. Bhd. effective April 1, 2008 (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.2\nExecutive Employment Agreement between Vystar Corporation and William R. Doyle, dated November 11, 2008 (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.3\nManagement Agreement dated January 31, 2008 between Universal Capital Management, Inc. and Vystar Corporation (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.4\nLetter Agreement dated August 15, 2008 between Universal Capital Management, Inc. and Vystar Corporation (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.5\nAddendum to Management Agreement dated February 29, 2008 between Universal Capital Management, Inc. and Vystar Corporation (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.6\nWarrant Purchase Agreement dated January 31, 2008 between Universal Capital Management, Inc. and Vystar Corporation (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.7\nManagement Agreement dated April 30, 2008 between Universal Capital Management, Inc. and Vystar Corporation (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.8\nWarrant Purchase Agreement dated April 30, 2008 between Universal Capital Management, Inc. and Vystar Corporation (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.9\nVystar Corporation 2004 Long-Term Compensation Plan, as amended (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.10\nEmployment Agreement between Vystar Corporation and Sandra Parker dated April 1, 2008 (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.10*\nDistributor Agreement among Vystar Corporation, Centrotrade Minerals & Metals, Inc. and Centrotrade Deutschland, GmbH dated January 6, 2009 (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.11\nNote agreement between Vystar Corporation and Climax Global Energy, Inc. dated August 15, 2008 (incorporated by reference to Vystars Registration Statement on Form S-1 originally filed on November 13, 2008, Registration Statement No. 333-155344)\n10.12\nForm of Investor Note (incorporated by reference to Vystars Current Report on Form 8-K dated March 11, 2011 and filed on March 15, 2011)\n10.13\nPromissory Grid Note dated April 29, 2011, in a principal amount of $800,000 from Vystar Corporation to CMA Investments, LLC (incorporated by reference to Vystars Current Report on Form 8-K dated April 29, 2011 and filed on May 2, 2011)\n10.14\nFirst Amendment to Agreement dated September 9, 2011, between Vystar Corporation, CMA Investments, LLC and Italia-Eire, LP, a Georgia limited partnership (incorporated by reference from Exhibit 10.14 to Vystar Corporations Annual Report on Form 10-K for the year ended December 31, 2011 filed on March 30, 2012)\n10.15\nForm of Securities Purchase Agreement dated May 2012 between Vystar and investors (incorporated by reference to Vystars Quarterly Report on Form 10-Q filed on August 10, 2012)\n10.16\nLLC Ownership Interest Purchase Agreement dated September 13, 2012, between Vystar and Mary Ailene Miller (incorporated by reference to Vystars Current Report on Form 8-K filed on September 19, 2012)\n10.17\nSecond Amendment to Agreement dated November 2, 2012, among Vystar, CMA Investments, LLC and Italia - Eire LP (incorporated by reference to Vystars Quarterly Report on Form 10-Q filed on November 11, 2012)\n10.18\nLLC Ownership Interest Purchase Agreement dated June 28, 2013, between the Company and Michal Soo, M.D. (incorporated by reference to the Companys Current Report on Form 8-K filed on July 2, 2013)\n10.19\nNote Subscription Agreement dated June 28, 2013 between the Company and the Investors (incorporated by reference to the Companys Current Report on Form 8-K filed on July 2, 2013)\n10.20\nForm of Senior Secured Convertible Promissory Note dated June 30, 2013 (incorporated by reference to the Companys Current Report on Form 8-K filed on July 2, 2013)\n10.21\nForm of Security Agreement dated July 1, 2013 (incorporated by reference to the Companys Current Report on Form 8-K filed on July 2, 2013)\n31***\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32***\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS***\nXBRL Instance Document\n101.SCH***\nXBRL Taxonomy Extension Schema Document\n101.CAL***\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF***\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB***\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE***\nXBRL Taxonomy Extension Presentation Linkbase Document\n* Some Exhibits have certain confidential information redacted pursuant to a request for confidential treatment.\n** Exhibits and schedules to this exhibit have been omitted pursuant to Item 601(b)(2) of Regulation S-K. The Company will furnish copies of the omitted exhibits and schedules to the Securities and Exchange Commission upon its request. Confidential treatment has been requested as to a portion of this exhibit, which portion has been omitted and filed separately with the Securities and Exchange Commission.\n*** Filed herewith.\nITEM 16. FORM 10-K SUMMARY\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nVYSTAR CORPORATION\nDate: October 10, 2023 By: /s/ Steven Rotman\nSteven Rotman\nChairman, President, Chief Executive Officer (Principal\nExecutive Officer), Chief Financial Officer (Principal\nFinancial and Accounting Officer) and Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated, on October 10, 2023.\nSignature\nTitle\n/s/ Steven Rotman\nPresident, Chief Executive Officer, and Chief Financial Officer\nSteven Rotman\n/s/ Joseph Allegra\nChairman of the Board of Directors\nJoseph Allegra, PhD\n/s/ Bryan Stone\nDirector\nBryan Stone, MD\n/s/ Byron Novosad\nDirector\nByron Novosad, DDS"
}