{
    "cik": "1309057",
    "company": "China Health Industries Holdings, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-11-13",
    "period_of_report": "2023-06-30",
    "sic": "2834",
    "state_of_inc": null,
    "state_location": "F4",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1309057/0001213900-23-085612-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1309057/000121390023085612/f10k2023_chinahealth.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1309057/0001213900-23-085612.txt",
    "filename": "1309057_10K_2023_0001213900-23-085612.htm",
    "content": "Item 1. Business.\nChina Health Industries Holdings, Inc. (China Health US, we, our, or us) is not a Chinese operating Company, but a Delaware holding company. Our operations are solely conducted through our subsidiaries in PRC. By investing in the securities of us, you are holding the common stock of the Delaware holding company, under no circumstance will you have any shares of any of our operating PRC subsidiaries.\nOur History and Corporate Structure\nChina Health Industries Holdings, Inc. (China Health US) was incorporated in the State of Arizona on July 11, 1996 and was the successor of the business known as Arizona Mist, Inc. which began in 1989. On May 9, 2005, it entered into a stock purchase agreement and share exchange (effecting a reverse merger) with Edmonds 6, Inc. (Edmonds 6), a Delaware corporation, and changed its name to Universal Fog, Inc. Pursuant to this agreement, Universal Fog, Inc. (which has been in continuous operation since 1996) became a wholly-owned subsidiary of Edmonds 6.\nChina Health Industries Holdings Limited (China Health HK) was incorporated on July 20, 2007 in Hong Kong under the Companies Ordinance as a limited liability company. China Health HK was formed for the purpose of seeking and consummating a merger or acquisition with a business entity organized as a private corporation, partnership, or sole proprietorship as defined by FASB ACS Topic 915 (Development Stage Entities).\nHarbin Humankind Biology Technology Co., Limited (Humankind) was incorporated in Harbin City, Heilongjiang Province, the Peoples Republic of China (the PRC) on December 14, 2003, as a limited liability company under the Company Law of the PRC. Humankind is engaged in the manufacturing and sale of health products.\nOn August 20, 2007, the sole shareholder of China Health HK entered into a share purchase agreement (the Share Purchase Agreement) with the owners of Humankind. Pursuant to the Share Purchase Agreement, China Health HK purchased 100% of the ownership in Humankind for a cash consideration of $60,408 (the Share Purchase). Subsequent to the completion of the Share Purchase, Humankind became a wholly-owned subsidiary of China Health HK. The Share Purchase was accounted for as a reverse merger since the owner of Humankind owned a majority of the outstanding shares of China Health HKs common stock immediately following the execution of the Share Purchase Agreement, it was deemed to be the accounting acquirer in the reverse merger. Consequently, the assets and liabilities and the historical operations that have been reflected in the financial statements for periods prior to the Share Purchase are those of Humankind and have been recorded at the historical cost basis. After completion of the Share Purchase, China Health HKs consolidated financial statements include the assets and liabilities of both China Health HK and Humankind, the historical operations of Humankind, and the operations of China Health HK and its subsidiaries from the closing date of the Share Purchase onward.\nOn October 14, 2008, Humankind set up a 99% owned subsidiary, Harbin Huimeijia Medicine Company (Huimeijia), with its primary business being manufacturing and distributing medicine. Mr. Xin Sun, the Companys majority owner, owns 1% of Huimeijia. Huimeijia is consolidated in the consolidated financial statements of China Health HK.\nOn December 31, 2008, China Health HK entered into a reverse merger with Universal Fog, Inc., a U.S. publicly traded shell company (the Transaction). China Health HK is the acquirer in the Transaction, and the Transaction was treated as a recapitalization of China Health US. After the Transaction and a 20:1 reverse stock split, Mr. Xin Sun owned 61,203,088 shares of common stock, representing 98.3% of the 62,234,737 total outstanding shares of common stock of China Health US. On April 7, 2009, Mr. Sun transferred 28,200,000 shares of common stock to 296 individuals, leaving him with 33,003,088 shares of common stock of China Health US, or approximately 53.03% of the total outstanding shares of common stock. Universal Fog, Inc. changed its name to China Health Industries Holdings, Inc. on February 19, 2009.\nOn November 22, 2013, Humankind completed the acquisition of Heilongjiang Huimeijia Pharmaceutical Co., Ltd. (HLJ Huimeijia) for a total purchase price of $16,339,869 (RMB100,000,000). HLJ Huimeijia was founded on October 30, 2003, and is engaged in the manufacturing and distribution of tincture, ointments, rubber paste (including hormones), topical solution, suppositories, liniment (including traditional Chinese medicine extractions), enemas and oral liquids. HLJ Huimeijias predecessor is Heilongjiang Xue Du Pharmaceutical Co., Ltd., which has established its brand name in the market through its supply of high-quality medical products. HLJ Huimeijia is categorized as a high and new technology enterprise by the Science Technology Department in Heilongjiang Province. HLJ Huimeijia has 21 products which have been approved by, and have received approval numbers issued by, the National Medical Products Administration (NMPA). In addition, HLJ Huimeijia is the holder of one patent for utility models, five patents for external design and three trademarks in China, including the Chinese brand name of Xue Du which has an established reputation among customers in northeastern China.\nOn December 24, 2014, Humankind entered into a stock transfer agreement (the Original Agreement) with (i) Xiuzheng Pharmaceutical Group Co., Ltd. a company incorporated under the laws of the PRC and located in Jilin province (Xiuzheng Pharmacy or the Buyer), (ii) Mr. Xin Sun, the CEO of the Company, and (iii) Huimeijia, a subsidiary of Humankind that is 99% owned by Humankind and 1% owned by Mr. Xin Sun. Pursuant to the Original Agreement, Humankind and Mr. Xin Sun (collectively, the Equity Holders), would sell their respective equity interests in Huimeijia to Xiuzheng Pharmacy.\nOn February 9, 2015, the four parties entered into a supplementary agreement (the Supplementary Agreement) to modify the terms of the Original Agreement, pursuant to which the Equity Holders and Huimeijia (collectively, the Asset Transferors) would only sell 19 drug approval numbers (the Assets) to Xiuzheng Pharmacy. The Equity Holders would have retained their equity interests in Huimeijia, but would have pledged such equity interests to Xiuzheng Pharmacy until the Assets were transferred.\nOn October 12, 2016, the four parties agreed to rescind the Supplementary Agreement and entered into a new supplementary agreement pursuant to which the parties agreed to execute the transfer of the equity interests based on the Original Agreement, and the Equity Holders sold their respective equity interests in Huimeijia to Xiuzheng Pharmacy for total cash consideration of RMB 8,000,000 (approximately $1,306,186 USD, the Purchase Price) to the Equity Holders. As of October 12, 2016, Huimeijia had completed changes in its business registration, and Xiuzheng Pharmacy had obtained a new business license issued by the local State Administration of Industry and Commerce in Harbin (Harbin SAIC) for Huimeijia, in which Huimeijias ownership was recorded as held by Xiuzheng Pharmacy, and the legal representative (a person that is authorized to take most corporate actions on behalf of a company under PRC corporate laws) of Huimeijia had been appointed by the Buyer.\nOn June 27, 2023 (the Signing Date), Harbin Humankind Biology Technology Co., Limited (Humankind), a wholly owned subsidiary of China Health Industries Holdings, Inc. (China Health), a corporation incorporated under the laws of the State of Delaware, entered into certain equity transfer agreements (collectively, the Agreements) with Mr. Xin Sun and Mr. Kai Sun (collectively, the Sellers). Pursuant to the Agreements, the Sellers agreed to transfer to Humankind 99% and 1% of the equity interests of Heilongjiang HempCan Pharmaceuticals Co., Ltd. (HempCan), for a consideration of RMB292,050,000 (approximately $40,275,537) and RMB2,950,000 (approximately $406,824) respectively, totaling RMB295 million (approximately $40,682,360) (collectively, the Purchase Prices). The Purchase Prices shall be fully paid to Sellers within 15 business days after the Signing Date, and the Sellers shall complete certain registration procedures, such as change of equity ownership and change of business registration within 15 business days after full Purchase Prices are received. If Humankind is late in paying the Purchase Prices, a 0.1% per day late penalty on the amount of Purchase Prices that is paid late shall be paid to the Sellers. Mr. Xin Sun is China Healths Chairman, sole director and sole executive officer and Mr. Kai Sun is Mr. Xin Suns younger brother.\nChina Health US, China Health HK, Humankind and HLJ Huimeijia are collectively referred herein to as the Company.\nAs of June 30, 2023, the Companys corporate structure was as follows:\nBusiness Overview\nOur principal business operations are conducted through our wholly-owned subsidiaries, Humankind and HLJ Huimeijia.\nThe Company owns a GMP-certified plant and production facilities and has the capacity to produce 21 different NMPA-approved medicines, 14 NMPA-approved health supplement products and 10 hemp derivative products in soft capsule, hard capsule, tablet, granule, oral liquid forms. These products address the needs of some key sectors in China, including the feminine, geriatric, and childrens markets.\nHLJ Huimeijia was founded on October 30, 2003 and its latest GMP certificate is effective until April 24, 2023. On December 1, 2019, NMPA announced that it will no longer issue GMP certificate for any pharmaceutical companies. However, NMPA will carry out conformity inspection to do compliance testing, as well as flight check (unannounced inspection) for all pharmaceutical companies. HLJ Huimeijia engages in the manufacture and distribution of tincture, ointments, rubber paste, including hormones, topical solution, suppositories, enemas, oral liquids, and liniment, including traditional Chinese medicine extractions. HLJ Huimeijias predecessor was Heilongjiang Xue Du Pharmaceutical Co., Ltd., which established brand recognition in the market through its supply of high-quality drug products. HLJ Huimeijia is a high and new technology enterprise that provides the most comprehensive types of topical medical products in Heilongjiang Province, a northeastern province of China.\nFor the fiscal year 2023, we sell our products to end customers through our own sales personnel as well as our sales agents, operating primarily in Heilongjiang Province, where most of our revenues are generated. However, there is no such sales for the fiscal year 2022, which was primarily due to Humankinds enterprise transformation, and the lock down of factory due to COVID-19. Humankind is using existing materials to research and develop new products. Humankind decided to transform the primary business to CBD extractive project, because the government intended to support the company research in CBD aspect. However, by the end of fiscal year 2023, the support guidelines had not been published. Although the research process is slow and unpredictable due to the zero-case policy and periodic quarantines caused by COVID-19 resurgence in the first half of the fiscal year 2023, we expect the CBD extractive project to be completed by the end of calendar year of 2024 (Transformation). We do not currently sell our products online, but we expect to do so in the future.\nCash Transfer\nFor the years ended June 30, 2023 and 2022, there is no cash transfer among China Health US, China Health HK, or any of our PRC subsidiaries.\nWe have not paid dividends on our common stock and do not anticipate to pay such dividends in the foreseeable future. We will rely on dividends from Humankind for our funds and PRC regulations may limit the amount of funds distributed to us from Humankind, which will affect our ability to declare any dividends.\nChina Health US may encounter several limitations related to cash transfer among its PRC subsidiaries, the holding company and its investors. Any funds we transfer to the PRC subsidiaries, either as a shareholder loan or as an increase in registered capital, are subject to permission and approval by or registration with relevant governmental authorities in China. According to the relevant PRC regulations on foreign invested enterprises in China, capital contributions to our PRC subsidiaries are subject to the registration with the State Administration for Market Regulation or its local counterpart and registration with a local bank authorized by SAFE. In addition, (i) any foreign loan procured by our PRC subsidiaries is required to be registered with the SAFE or its local branches and (ii) any of our PRC subsidiaries may not procure loans which exceed the difference between its total investment amount and registered capital or, as an alternative, only procure loans subject to the calculation approach and limitation as provided by the Peoples Bank of China. As a holding company with no operations, our ability to distribute dividends largely depends on the distribution from our PRC subsidiaries. In addition, if China Health US is determined to be a PRC resident enterprise for enterprise income tax purposes, we could be subject to PRC tax at a rate of 25% on our worldwide income, which could materially reduce our net income, and we may be required to withhold a 10% withholding tax from dividends we pay to our shareholders that are non-resident enterprises, including the holders of our ordinary shares, and non-resident enterprise shareholders (including our ordinary shareholders) may be subject to PRC tax at a rate of 10% on gains realized on the sale or other disposition of ordinary shares, if such income is treated as sourced from within China. An indirect transfer of PRC assets, including a transfer of equity interests in an unlisted non-PRC holding company of a PRC resident enterprise, by non-PRC resident enterprises may be re-characterized and treated as a direct transfer of the underlying PRC assets, if such arrangement does not have a reasonable commercial purpose and was established for the purpose of avoiding payment of PRC enterprise income tax. As a result, gains derived from such indirect transfer may be subject to PRC enterprise income tax, and the transferee or other person who is obligated to pay for the transfer is obligated to withhold the applicable taxes, currently at a rate of 10% for the transfer of equity interests in a PRC resident enterprise.\nProducts\nWe are licensed to sell our products, including our medical drugs, only in the PRC.\n(i) Hemp Derivative Products\nWe have developed the following products that are derived from hemp and obtained business license to manufacture and sell these products. We have begun to sell these products since May 2018. Hemp Seed Beer, Hemp Oil, Hemp Protein Powder, Hemp Polypeptide and Collagen Peptide are sold through Humankind. Other products are sold through HLJ Huimeijia. The revenue of the Hemp Seed Beer, Hemp Oil and Hemp Seed accounted for 100% and nil of the total revenues for the fiscal year of 2023 and 2022, respectively.\nSerial No.\nName\nHemp Oil\nHemp Protein Powder\nHemp Polypeptide\nCollagen Peptide\nNatural Hemp Essence Repair Lotion\nNatural Hemp Revitalizing Essence\nNatural Hemp Anit-aging Brightening Eye Cream\nNatural Hemp Frozen Age Nourishing Cream\nHemp Seed Beer\nHemp Seed\n(ii) Health Products\nOur QunLe brand Sailuozhi soft capsule, a supplement made from frog oil, soybean isoflavone, procyanidine (made from grape seeds) and vitamin E, is for freckle removal and skin moisture. QunLe brand Sailuozhi soft capsulechanged name to QunLe brand Frog Oil, Soybean Isoflavone and Vitamin E Soft Capsul, register number is G20070356, which expired on April 6, 2026.\nOn May 12, 2010, we received a patent for this product (Patent No. 200610010394.4) under the name Run Chao (which has since been changed to QunLe) with the National Bureau of Intellectual Property.\nPursuant to a technology transfer agreement dated October 12, 2007 (the 2007 Technology Transfer Agreement), we purchased a health product known as Kindlink brand propolis and black ant capsule made from propolis, black ant, acanthopanax and astragalus root from Beijing Jindelikang Bio-Technology Co., Ltd (Jindelikang). The change of the ownership has been approved by the NMPA. This product is intended to boost ones immunity. The certification number issued by the NMPA on August 20, 2004, for the license to manufacture the product is GuoShiJianZi G20040906. We have no continuing obligations under the 2007 Technology Transfer Agreement.\nPursuant to a technology transfer agreement dated January 18, 2013 (the 2013 Technology Transfer Agreement), we purchased 12 health products from Guangzhou Aoda Biology Beauty Healthy Technology Co., Ltd, a non-affiliated party. These twelve products are the following:\n- Dr. Xiao Brand Honeysuckle Pearl Capsule (Guo Shi Jian Zi G20100656), which is designed to be effective in acne removal;\n- Dr. Xiao Brand Multivitamin Tablet (Guo Shi Jian Zi G20080176), which is a multivitamin and mineral supplement;\n- Dr. Xiao Brand Zhengdian Capsule (Guo Shi Jian Zi 20070261), which is designed to be effective in relieving eyestrain;\n- Dr. Xiao Brand Shengui Capsule (Guo Shi Jian Zi G20080297), which is designed to be effective in increasing bone density;\n- Dr. Xiao Brand Multivitamin Tablet (Woman) (Guo Shi Jian Zi G20070338), which is an iron and multivitamin supplement;\n- Dr. Xiao Brand Shikong Soft Capsule (Guo Shi Jian Zi 20080096), which is designed to be effective in improving memory;\n- Dr. Xiao Brand Huangjingdanggui Tablet (Guo Shi Jian Zi G20080201), which is designed to be effective in improving nutritional anemia and chloasma;\n- Dr. Xiao Brand Xingxing Soft Capsule (Guo Shi Jian Zi G20080080), which is designed to be effective in improving memory;\n- Dr. Xiao Brand Vitamin A Fish Oil Soft Capsule (Guo Shi Jian Zi G20080406), which is designed to be effective in relieving eyestrain;\n- Dr. Xiao Brand Colon Cleanser Granules (Guo Shi Jian Zi G20060061), which is designed to be effective in relaxing bowels and promoting the discharge of lead;\n- Dr. Xiao Brand Jianli Soft Capsule (Guo Shi Jian Zi G20050710), which is designed to be effective in increasing immunity and relieving physical fatigue; and\n- LB Brand Xinpin Capsule (Guo Shi Jian Zi G20050770), which is designed to be effective in dispelling chloasma.\nThe major suppliers of raw materials for our products who exceeded 10% of our total purchases in the fiscal years 2023 and 2022 are the following:\nPurchases\n(in U.S. % of\nName of Supplier Dollars) Purchases\nFY2023\nHarbin Delunbao Beer Co., Ltd\n68,803 96.71 %\nFY2022 Nil\nThe Company typically signs monthly purchase orders with its major suppliers. All purchase orders with our other suppliers are on similar terms. We shall remit payment to a suppliers account no later than three business days after receiving raw materials. A supplier shall deliver raw materials no later than three business days after receiving a purchase order. The cost of delivery is borne by the supplier.\n(iii) Medical Drugs\nHLJ Huimeijia has 21 products with approval numbers issued by the NMPA as following:\nEnglish Name\nEfficacy\nEnema Glycerini\nLubricating laxative. Used for constipation.\nUmguentumAcidi Borici Camphoratum\nDermerethistica. Used for chilblain.\nGe Hong Beriberi Water\nDehumidification insecticide. Used for tinea pedis and tinea manuum caused by damp toxin brewing and binding, and other skin diseases caused by enzyme.\nPelvic Inflammation Suppository\nHeat-clearing and detoxifying; activating blood to promote menstruation disperse swelling and relieve pain. Used for toxin and blood stasis stagnation in the uterus, distending pain in the lower abdomen, irregular menses, algomenorrhea and leukorrhagia, as well as pelvic inflammation and annexitis with the aforementioned symptoms.\nInjury and Paralysis Tincture\nWarm channel and expelling cold, promoting blood circulation to arrest pain. Used to relieve pain caused by traumatic injury and sprain.\nIndometacin and Furazolidone Suppositories\nAnti - inflammatory painkiller. Used to treat acute hemorrhoid, including internal hemorrhoids, external hemorrhoids, mixed hemorrhoids, anal fissure or archosyrinx and relieve pain; Used to ease pain after the operation of anal fissure, archosyrinx or hemorrhoids.\nInjury and Rheumatism Relieving Paste\nDispelling rheumatism and relieving pain. Used for headache, rheumatalgia, neuralgia, sprain and muscular soreness.\nRefining GouPi Cream\nRelaxing tendon, invigorating the circulation of blood, dissipating cold and relieving pain. Used for arthralgia and myalgia, acute contusion, sprain, rheumatalgia, arthralgia, hypochondriac pain, muscular soreness, etc.\nMuskiness Pain Relieving Paste\nExpelling wind and removing dampness, relaxing the tendons and unblocking collateral. Used for rheumatic arthralgia, low back cold pain, traumatic injury, etc.\nEnglish Name\nEfficacy\nMuskiness Bone Strengthener Paste\nAnalgesia and anti-inflammatory. Used for rheumatalgia, arthralgia, backache, neuralgia, muscular soreness, sprain and contusion.\nMatrine Suppositories\nAntibacterial and antiphlogistic drugs. Used for trichomonas and candida vaginitis, chronic cervicitis, pelvic inflammation, etc.\nEthacriding Lactate Solution\nDisinfectant and preservative drug. Used for disinfection of traumatic and disinfected wounds.\nTriamcinolone Acetonide and Neomycin Paste\nUsed for neurodermatitis circumscripta and chronic eczema. Also used for small-scale psoriasis.\nDouble - Coptis Suppository\nCourse wind and resolving the exterior, heat-clearing and detoxifying. Used for influenza caused by affection of exogenous wind-heat, with symptoms of fever, cough and sore throat. Also used for upper respiratory tract infections and pneumonia, with symptoms of fever, cough and sore throat.\nMethylrosanilinium Chloride Solution\nDisinfectant and preservative drug.\nIodine Tincture\nDisinfectant and preservative drug.\nMercurochrome Solution\nDisinfectant and preservative drug.\nHydrogen Peroxide Solution\nDisinfectant and preservative drug.\nHalcinonide Cream\nGrucocorticoid. External use drug only to be used on the skin. Used for dermatoneuritis and psoriasis.\nCompound Fluocinonide Tincture\nGrucocorticoid. Used for dermatoneuritis and psoriasis.\nPolicresulen Vaginal Suppository\nAnti-microbial and hemostasis drug.\nDistribution\nMost of our products are sold to sales agents. In the fiscal year of 2022, because of COVID-19 influence and the Transformation, we did not sell our products to sales agents. In the fiscal year of 2023, our sales network covered Heilongjiang provinces or cities.\nE-business\nWe are in the process of building the infrastructure to conduct our business over the internet. A B2C e-business call and sales center has been established and will become an integral part of our distribution channel in the future. We have employed graduates from Tsinghua University, Harbin Industry University and Harbin Engineering University to develop the ERP (Enterprise Resource Planning), CRM (Customer Relationship Management) and Office Automation software (OA Software) for our e-business. The OA Software has been used in our daily operation. The Company plans to sell its products via internet in the fiscal year of 2024.\nOur Customers\nWe sell most of our products to sales agents, who are our customers. The sales agents sell the products to the end users.\nOur customers who contributed more than 10% of our consolidated revenues during the past two fiscal years are as follows:\nSales Percent of\nName Products Sold (in U.S. Dollars) Sales\nFY2023\nHarbin Magic Nature Technology Co., Ltd Hemp Seed Beer, Hemp Oil 70,824 63.47 %\nRuiping Ji Hemp Seed 36,516 32.73 %\nFY2022 nil\nManufacture\nWe manufacture our health food products on a plot of land located in Jin Xing Industrial Park, Songbei District, Harbin. On June 7, 2004, the Company entered into a Land Use Purchase Contract with the local government, pursuant to which the Company agreed to purchase the right to use a piece of land, approximately 8 acres (32,000 square meters), located in Harbin City, Heilongjiang Province for commercial purposes for a fifty-year period from June 7, 2004 through June 6, 2054, for $637,261 (RMB5,248,000). The Company fully paid to the government the consideration for the land use right on June 13, 2004. The Department of Housing and Urban Development of Harbin City approved this transaction. The Company is in the process of applying for the title certificate from the local government. The manufacturing facility on the land is 4,000 square meters and there are five production lines which are sufficient for our purposes. We package our products in bottles, plastic containers and aluminum foil bags there.\nSince we acquired HLJ Huimeijia on November 22, 2013, we also manufacture our medicines and drugs using HLJ Huimeijias land, approximately 43,350 square meters, located in Hai-lin Economic Development Zone, Mudanjiang City. The manufacturing facilities occupy approximately 5,710 square meters. We plan to build new manufacturing facilities on the land. The expected construction cost is approximately $7,520,000 (RMB50,000,000).\nOur Development Strategy\nWe will continue to focus on combining our products with traditional Chinese medicine, creating new products such as our hemp-based products, and developing our B2C e-business and chain-stores. We plan to implement health management projects in our future chain-stores throughout China and establish a database of our clients health data obtained from our B2C e-business and call center.\nWe plan to establish a one-stop shop for our customers health needs. From conducting a genetic profile of our customer to determine his/her susceptibility to certain types of diseases and then customizing health supplements and organic/green food to meet his/her needs, we plan to cater to our customers needs at all levels. With the distribution network we hope to establish through our chain stores and B2C e-businesses, we plan to eventually branch out into the sale and distribution of beauty products and medical appliances.\nWe plan to open chain stores of up to 100 stores within the next 24 months; establish our oversea sales to North America, South Asia and European Union; acquire pharmaceuticals to enhance marketing network and production capacity and increase investment in research and development of CBD drugs and hemp-based products.\nThe Future\nWithin the next ten years, our goals are to:\n1. Increase product coverage in target markets to achieve 20%-30% coverage\nOur target market is the health industry market. Presently, we believe that our product coverage is approximately 0.2%. We plan to open distribution stores in different provinces of China to expand our coverage. We also plan to sell our products through B2C websites to our customers.\n2. Develop to be among top 500 companies in the medicine, health product, health industry in the PRC\nCurrently, we are not ranked in the top 500 medicine, health product and health industry companies in the PRC. We believe that if our projected increase in revenue is achieved, we will achieve our goal of becoming one of the top 500 medicine, health product, health industry companies in China.\n3. Form a diversified management group\nCurrently, our management group comprises graduates from the most prestigious universities in the PRC, such as Peking University and Renmin University of China. We plan to further diversify our management group by hiring talent both in the PRC and abroad.\n4. Enter into the international market and create an internationally famous brand\nCurrently, our products are sold under the brand names Qunle, Kindlink, Huimeijia and Dr. Xiao in the PRC. Our goal is eventually to establish stable sales abroad in countries such as the United States of America, Russia, and Eastern Europe and South-east Asian countries.\nOur Business Plan\nThe plans designed to meet our manufacturing, marketing and profit targets include:\nManufacturing:\n(a) improving the manufacturing techniques and staff training;\n(b) guaranteeing high quality material supply;\n(c) strengthening the working procedure controls;\n(d) implementing GMP to ensure a compliance standard in the food and medical industries;\n(e) ensuring that all employees have adequate training in health regulations.\nMarketing:\nAdopt an effective marketing strategy to:\n(a) utilize direct distribution of products to chain stores nationwide;\n(b) build business alliances with well-known enterprises to create private label brands;\n(c) expand the marketing of our products beyond the traditional methods.\nProduct Distribution:\n(a) enlarge our sales and marketing force while developing new markets;\n(b) strengthen the distribution channel by developing promotion strategies and participating in trade shows;\n(c) Develop 3-5 new products to market each year;\n(d) develop new markets through innovation and research.\nOur approach to manufacturing, marketing, cost control and products distribution, which is detailed above, is designed to minimize production costs and increase revenue at the same time. We feel that our procedures will enable us to reach our sales goals with an optimal manufacturing cost. The result should yield profits and a return to our investors.\nGood Manufacturing Practice or GMP is a term that is recognized worldwide for the control and management of manufacturing and quality control testing of foods and pharmaceutical products. An important part of GMP is documentation of every aspect of the process, activities, and operations involved with drug and medical device manufacture. Additionally, GMP requires that all manufacturing and testing equipment has been qualified as suitable for use, and that all operational methodologies and procedures (such as manufacturing, cleaning, and analytical testing) utilized in the drug manufacturing process have been validated (according to predetermined specifications), to demonstrate that they can perform their purported function(s). On December 1, 2019 the newly revised Drug Administration Law (the New Law) came into effect. One of the major amendments is the cancellation of GMP certification. The New Law eliminated the requirement that drug administration authorities shall assess drug manufacture enterprises and drug trading enterprises, and issue assessment certificates. Instead, it requires that drug manufacturing enterprises and drug trading enterprises establish and improve the quality management systems of manufacture and trade of drugs, and ensure that the process of manufacturing and trading of drugs always meets all legal requirements. This means a stricter form of supervision is implemented comparing to the prior GMP certificates system and our production lines are subject pilot inspection under the New Law.\nThe Market for Healthcare and Beauty Products\nThe health product industry is one of the mainstream industries in the PRC, since it has a high level of recognition and importance. Recently there have been new policies for health products, which control quality, manufacturing, manufacturing environments and techniques.\nThe Healthcare Product Market in the PRC\nWith thousands of years of history in health culture and traditional Chinese medicine, the PRC currently utilizes advanced techniques and production capacity to initiate new health care trends, from drugs and medicines to traditional health food and nutritional supplements, and from medical devices to health management and advice. These trends demonstrate huge potential in the PRCs health products market.\nWith the rise of the concept of Great Health, the per capita expenditure of health products and the consumer group have been significantly improved.\nDriven by the change of consumer treatment to prevention, the promotion of health awareness, the refinement of health needs and the pursuit of high-quality health products, the market scale of health products in China broke through RMB100 billion (USD16.2 billion) in 2014 and nearly RMB150 billion (USD22.2 billion) in 2017. Qianzhan Industry Research Institute in China predicted that the market scale of health products in China will reach RMB 243.5 billion (USD37.7 billion) in 2025.\nComparing the consumption habits of Chinese and American health products, we can see that there is still much room for development in Chinas market. The penetration rate of health products in the United States is 50%, while that in China is only 20%, and in terms of per capita consumption, China is only one-eighth of that in the United States.\nLegal and Operation Risks Associated with Being Based in or Having the Majority of the Companys Operations in China\nChina Health USs PRC subsidiaries (as defined below) face various legal and operational risks and uncertainties related to doing business in China. These risks could result in a material adverse change in the Companys business operations and cause the value of such securities to significantly decline or be worthless.\nThe PRC subsidiaries were formed under and are governed by the laws of the PRC. The PRC legal system is based on written statutes. Prior court decisions may be cited for reference, but have limited precedential value. As a significant part of our business is conducted in China, our operations are principally governed by PRC laws and regulations. However, since the PRC legal system continues to evolve rapidly, the interpretations of many laws, regulations and rules are not always uniform and enforcement of these laws, regulations and rules involves uncertainties, which may limit legal protections available to us. In addition, some regulatory requirements issued by certain PRC government authorities may not be consistently applied by other PRC government authorities (including local government authorities), thus making strict compliance with all regulatory requirements impractical, or in some circumstances impossible. Considering PRC administrative and court authorities have discretion in interpreting and implementing statutory and contractual terms, it may be more difficult to predict the outcome of administrative and court proceedings and the level of legal protection we enjoy than in more developed legal systems. Furthermore, the PRC legal system is based in part on government policies and internal rules, some of which are not published on a timely basis or at all and may have retroactive effect. As a result, we may not be aware of our violation of these policies and rules until sometime after the violation. Such uncertainties, including uncertainty over the scope and effect of our contractual, property (including intellectual property) and procedural rights, could materially and adversely affect our business and impede our ability to continue our operations.\nFurthermore, if China adopts more stringent standards with respect to environmental protection or corporate social responsibilities, we may incur increased compliance costs or become subject to additional restrictions in our operations. Intellectual property rights and confidentiality protections in China may also not be as effective as in the United States or other countries. In addition, we cannot predict the effects of future developments in the PRC legal system on our business operations, including the promulgation of new laws, or changes to existing laws or the interpretation or enforcement thereof. These uncertainties could limit the legal protections available to us and our investors, including you. Moreover, any litigation in China may be protracted and result in substantial costs and diversion of our resources and management attention.\nChina Health USs corporate structure as a Delaware holding company with operations primarily conducted by its subsidiaries in China involves unique risks to investors. Chinese regulatory authorities could disallow this structure, which cause the incapability to continue operation without changing the corporate structure or switching the business focus. This may in turn cause the value of the securities to significantly decline or even become worthless. According to the Foreign Investment Law in China, the State Council shall promulgate or approve a list of special administrative measures for market access of foreign investments, or the Negative List. The Foreign Investment Law grants national treatment to foreign-invested entities, except for those foreign-invested entities that operate in industries specified as either restricted or prohibited from foreign investment in the Negative List. The Foreign Investment Law provides that foreign-invested entities operating in restricted or prohibited industries will require market entry clearance and other permissions or approvals from relevant PRC government authorities. On December 27, 2021, the National Development and Reform Commission of China (NDRC) and the Ministry of Commerce (MOFCOM) jointly issued the Special Administrative Measures for Foreign Investment Access (Negative List) (2021 Edition), and the Special Administrative Measures for Foreign Investment Access in Pilot Free Trade Zones (Negative List) (2021 Edition), effective January 1, 2022. As a company operating its business in pharmaceutical manufacture and distribution, which are not included in the 2021 Negative List, China Health US believes its business is not subject to any ownership restrictions. However, since the Negative List has been adjusted and updated almost on an annual basis in the recent years, we cannot assure you that the aforementioned business segments will continuously be beyond the prohibited category, which may significantly limit or completely hinder your ability to offer or continue to offer securities to investors and cause the value of such securities to significantly decline or be worthless. The PRC government will also establish a foreign investment information reporting system, according to which foreign investors or foreign-invested enterprises shall submit investment information to the competent department for commerce concerned through the enterprise registration system and the enterprise credit information publicity system, and a security review system under which the security review shall be conducted for foreign investment affecting or likely affecting the state security.\nThe Chinese government has exercised and continues to exercise substantial control over virtually every sector of the Chinese economy through regulation and state ownership. Furthermore, recent statements made by the Chinese government have indicated an intent to increase the governments oversight and control over offerings of companies with significant operations in China that are to be conducted in foreign markets, as well as foreign investment in China-based issuers like us. Our ability to operate in China may be harmed by changes in its laws and regulations. The central or local governments of these jurisdictions may impose new, stricter regulations or interpretations of existing regulations that would require additional expenditures and efforts on our part to ensure our compliance with such regulations or interpretations. Accordingly, government actions in the future could have a significant effect on economic conditions in China or particular regions thereof, and could require us to divest ourselves of any interest we then hold in Chinese properties. As such, our business segments may be subject to various government and regulatory interference in the provinces in which they operate. We may incur increased costs necessary to comply with existing and newly adopted laws and regulations or penalties for any failure to comply. The Chinese government may intervene or influence our operations at any time with little advance notice, which could result in a material change in our operations and in the value of our ordinary shares. Any actions by the Chinese government to exert more oversight and control over transaction that are conducted overseas and/or foreign investment in China-based issuers could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and cause the value of such securities to significantly decline or be worthless.\nOn February 17, 2023, the CSRC promulgated the Trial Administrative Measures of Overseas Securities Offering and Listing by Domestic Companies (the Trial Measures), which became effective on March 31, 2023. The Trial Measures clarified and emphasized several aspects, which include but are not limited to: (1) criteria and exemptions to determine whether an issuer will be required to go through the filing procedures under the Trial Measures; (2) a negative list of types of issuers banned from listing or offering overseas, such as issuers whose affiliates have been recently convicted of bribery and corruption; (3) issuers compliance with web security, data security, and other national security laws and regulations; (4) issuers filing and reporting obligations, such as obligation to file with the CSRC after it submits an application for initial public offering to overseas regulators, and obligation after offering or listing overseas to report to the CSRC material events including change of control or voluntary or forced delisting of the issuer. Because the Companys shares have been trading on the over-the-counter market, the Trial Measures do not impose additional regulatory burden on us beyond the obligation to report to the CSRC any future offerings of our securities, or material events such as a change of control. As the Trial Measures are newly issued, there remains uncertainty as to how it will be interpreted or implemented. Therefore, there is uncertainty that if we are subject to such filing requirements under the Trial Measures, we will be able to get clearance from the CSRC in a timely fashion.\nPermissions and Approvals\nRecently, the General Office of the Central Committee of the Communist Party of China and the General Office of the State Council jointly issued the Opinions on Severe and Lawful Crackdown on Illegal Securities Activities, which was available to the public on July 6, 2021. These opinions emphasized the need to strengthen the administration over illegal securities activities and the supervision on overseas listings by China-based companies. These opinions proposed to take effective measures, such as promoting the construction of relevant regulatory systems, to deal with the risks and incidents facing China-based overseas-listed companies and the demand for cybersecurity and data privacy protection. Moreover, on January 4, 2022, thirteen PRC regulatory agencies, namely, the Cyberspace Administration of China (CAC), the NDRC, the Ministry of Industry and Information Technology, the Ministry of Public Security, the Ministry of State Security, the Ministry of Finance, MOFCOM, China State Administration for Market Regulation (SAMR), the China Securities Regulatory Commission (CSRC), the Peoples Bank of China, the National Radio and Television Administration, National Administration of State Secrets Protection Network Data Security (draft for public comments), and the National Cryptography Administration, jointly adopted and published the Measures for Cybersecurity Review (2021), which became effective on February 15, 2022. The Measures for Cybersecurity Review (2021) required that, among others, in addition to operator of critical information infrastructure, any operator of network platform holding personal information of more than one million users which seeks to list in a foreign stock exchange should also be subject to cybersecurity review. As of the date of this annual report, (i) the Company does not hold personal information of over one million users; (ii) the Company does not involve data processing activities that affect or may affect national security, and (iii) the Company has not been informed by any PRC governmental authority of any requirement that it file for a cybersecurity review; therefore, based on the foregoing, the Company believes it is not required to pass cybersecurity review of CAC. However, we cannot assure you that the Company will remain fully compliant with all new regulatory requirements of these opinions or any future implementation rules on a timely basis, or at all and any failure to comply with applicable laws and obligations could have a material and adverse effect on our business, our trading, our financial condition, and our results of operations.\nAs of the date of this annual report, the Company has obtained all the approvals and permissions required to operate business in the relevant industry. A list of permissions and approvals is below:\nNo.\nName of Certificate/License\nIssued Entity\nIssuing Authority\nIssuance Date\nExpiration Date\nFood Manufacturing Certificate\nHarbin Humankind Biology Technology Co., Limited\nHeilongjiang Harbin New District Administrative Examination and Approval Bureau\nDecember 6, 2021\nDecember 5, 2026\nFood Distribution License\nHarbin Humankind Biology Technology Co., Limited\nHeilongjiang Harbin New District Administrative Examination and Approval Bureau\nFebruary 14, 2019\nFebruary 13, 2024\nHowever, if China Health US or its PRC subsidiaries i) do not maintain such permissions or approvals; (ii) inadvertently conclude that such permissions or approvals are not required; or (iii) applicable laws, regulations, or interpretations change and we are required to obtain such permissions or approvals, we may have to spend great efforts and expenses to obtain such clearance, otherwise it may materially and adversely affect our business, operating results, financial condition and the value of our ordinary shares, significantly limit or completely hinder our ability to offer or continue to offer securities to investors, or cause such securities to significantly decline in value or become worthless.\nHemp and its Market and Industry in the PRC\nHemp was originated from the middle and lower reaches of Yellow River with over eight-thousand years planting history. The hemp textile technology in our country has matured as early as two thousand years in the Western Han Dynasty. Plain Color Zen Clothing, coming up from Han Tombs at Mawangdui and other hemp textile products have become the milestone in the developing history of hemp textile technology.\nHemp, also known as Huoma, Xianma, Kuima, Hanma, Dama. Species that containing less than 0.3% of tetrahydrocannabinol (THC) is considered as Hemp, and more than 0.3% is considered as Marijuana and Hashish internationally. Hemp is a kind of economic plant with special effects and can be grown in large areas in all parts of China. It has low requirements for soil and climate and can grow on relatively barren land. Planting hemp has become a way to get rich and get out of poverty in some poor areas.\nHemp is full of treasures. The skin, stem, seed, root, leaf and flower of hemp have utility value which can be widely applied in the fields of textile, paper-making, food, medicine, construction, transportation, national defense and military industry and so on. As a kind of traditional economic plant, hemp fiber has the functions of moisture absorption and perspiration, natural antimicrobial health care, good quality of adsorption, excellent quality of anti-UV and unique wave adsorption and sound attenuation. The stem of hemp has high degree of lignification and can be used to produce high value biologic additives, viscose fibers, top grade cigarette paper and wooden ceramics and so on. The leaf and flower of hemp can be used to produce various kinds of health products and the seed of hemp can be used to manufacture top grade edible oil, essential oil and hemp protein.\nA hemp plant contains over 400 kinds of chemical components and can be divided into cannabinoid and non-cannabinoid compounds. Cannabinol (CBN) in cannabinoid has the functions of anti-inflammatory, analgesia, anti-convulsion and suppressing female hormone secretion. Cannabidiol (CBD) has the functions of anti-inflammatory, sterilization, analgesia, antianxiety, antipsychotic, antioxidation, neural protection, reducing enterocinesia and improving learning and memory ability.\nHemp is the major high-yielding crop of making traditional fiber products in China. It is a kind of high value-added economic crop with a wide range of uses and multi-purpose crop with market prospects that provides fiber, hemp stem and seed. Hemp has many unique natural characteristics, especially its environmental benefits and its natural versatility, which is a valuable kind of crop for ecological economy.\nTextiles, clothing, military industry, construction materials, food, medicines, health supplements, cosmetics and skin care products of the downstream of hemp industry in China are relatively well-developed. The bottleneck that restricts the development of downstream industries is that the cultivation of hemp in the upstream has long been the planting mode of scattered peasant households, and has not formed large-scale industrialized cultivation and local initial processing capacity.\nAfter years of development, Chinese consumers have gradually rationalized their attitude and behavior in the consumption of health care products, paying more attention to the safety and efficacy of health care products. At the same time, the government has gradually improved the laws and regulations of the health care industry and tightened its supervision.\nThe rejuvenation of the modern industry of hemp resulted from the major breakthrough in research and mass production of hemp. Firstly, cultivate new varieties of hemp with low activity of anesthetic in agricultural scientific research. The main component of these varieties of anesthetics is THC and the content of THC is controlled at 0.3% which approximates to non-toxicity. This has led to a renewed understanding and affirmation of the industrial use of hemp, and made the cultivation of hemp mechanize, effectively contributing to the development of hemp industry.\nIn order to meet the needs of the development of domestic and foreign market, China has successively reactivated the hemp industry projects in Yunnan, Heilongjiang, Shandong, Shanxi, Anhui and Hubei provinces to set up factories and scientific research institutes to carry out research and development of various products. The natural functional advantages of its related products are favored by consumers at home and abroad. The products are exported to countries such as the United States, Canada, Australia, Japan, and Korea. Currently, related products of hemp have also become an export-oriented pillar industry in China.\nAt present, on the basis of solving scientific and technological problems of deep degumming of hemp, extraction of fine fiber, extraction of CBD, purification of hemp seed oil, extraction of essential oil of hemp, extraction of hemp protein, biocomposites, fiber reinforced composite materials, carry out pilot plant test and industrialized mass production of related products of hemp, and gradually develop the deep comprehensive utilization of hemp products, demonstrating the strength of deep processing in the hemp industry.\nCompetition in the Healthcare Products Industry\nWe believe our competitors are:\nHarbin DaZhong Pharmaceutical Co., Ltd. (Located in Harbin, Heilongjiang Province);\nTsinghua Unisplendour Corporation Limited (Located in Weihai City, Shandong Province);\nHeilongjiang Tianlong Pharmaceuticals Co., Ltd (Located in Heilongjiang Province);\nHPGC Renmintongtai Pharmaceuticals Co., Ltd (Located in Heilongjiang Province); and\nYunnan Hansu Biotechnology Co., Ltd. (Located in Yunnan Province).\nOur Competitive Advantages and Strategy\nWe believe that we have the following advantages over our competitors:\n● We have more categories of products and a diversified production line;\n● We have a strong and effective research and development team;\n● We are a self-owned enterprise, and have the support of the local government; and\n● We have a geographical advantage being located in Heilongjiang Province, the center of the healthcare industry in the PRC.\nSales and Marketing\nWe plan to open more chain stores throughout the PRC. Customers of our stores would be able to enjoy discounts on the price of our products and services. After establishing a sufficient number of stores, we plan to develop a 24-hour delivery system for our B2C e-business.\nIntellectual Property\nWe received a patent (200610010394.4) for our Qunle brand Sailuozhi soft capsule from the National Bureau of Intellectual Property. We had initially applied for and used the trade name of RunChao soft capsules, but the trade name was changed to Qunle, and the change was approved by the National Bureau of Intellectual Property. The expiration date for Qunle is May 12, 2030.\nPursuant to a Technology Transfer Agreement dated October 12, 2007 (Kindlink Technology Transfer Agreement), we purchased, for a total of RMB350,000, the technology, manufacturing, and trademark rights to the health product known as Kindlink brand propolis and black ant capsule made from propolis, black ant, acanthopanax, astragalus root from Jindelikang. The change of the ownership was approved by the NMPA. This product is consumed to boost ones immunity. The certification number issued by the NMPA on August 20, 2004, to permit the manufacture of the product is GuoShiJianZi G20040906. We have no continuing obligations under the Kindlink Technology Transfer Agreement.\nAs of the date of this report, we have registered the following 14 trademarks(1):\nTrademark\nCertificate No.\nCategory\nRegistrant\nValid Term\nQunle\nNo.5: Food preparations adapted for medical purposes; Albuminous milk; Dietetic beverages adapted for medical purposes; Milk sugar; Diabetic bread; Albuminous foodstuffs for medical purposes; Food for babies; Dietetic substances adapted for medical use; Nutritional additives for medical purposes\nHumankind\n7/7/2016 to 7/6/2026\nWangzu\nNo.30: Molasses for food; Honey; pollen healthy grease; tortoise tuchahoe paste; breed columbine extract; helix alga; non-medical nutrition liquid; non-medical nutrition powder; non-medical nutrition capsule; sugar candy birds nest\nHumankind\n5/14/2018 to 5/13/2028\nKindlink\nNo.5: Food preparations adapted for medical purposes; Dietetic substances adapted for medical use\nHumankind\n12/7/2013 to 12/06/2023\nHuimeijia\nNo.5: Medicine for human consumption; Medical nutrition capsule; Fibres (Edible plant) [non-nutritive]; Injection; Raw material drug; Troche; suppository; Food preparations adapted for medical purposes; Dietetic foods adapted for medical purposes; Dietetic substances adapted for medical use\nHumankind\n7/21/2019 to 7/20/2029\nHuide\nNo.5: Medicines for human consumption; Medical nutrition capsule; Fibres (Edible plant) [non-nutritive]; Injection; Raw material drug; Troche; suppository; Food preparations adapted for medical purposes; Dietetic foods adapted for medical purposes; Dietetic substances adapted for medical use\nHumankind\n7/21/2019 to 7/20/2029\nTrademark\nCertificate No.\nCategory\nRegistrant\nValid Term\nKDLK\nNo.5: Food preparations adapted for medical purposes; Dietetic foods adapted for medical purposes; Dietetic substances adapted for medical use\nHumankind\n9/28/2023 to 9/27/2033\ndr.xiao\nNo.5: Disinfectant; Medicines for veterinary purposes; Insecticide; Sanitary napkin; Medicine health bag; Dental lacquer\nHumankind\n8/14/2019 to 8/13/2029\ndr.xiao\nNo.30: non-medical nutrition liquid; non-medical nutrition cream; non-medical nutrition powder; Honey; non-medical nutrition capsule; non-medical nutrition gum; Candy for food; Spirulina (non-medical nutrient); Candy; Pollen healthy grease\nHumankind\n7/28/2021 to 7/27/2031\nDaLeNing\nNo.5: Medicine for human; Chinese patent drugs; Suppository; Tincture; Water aqua; Paste; Liniment; Medical lotion; Patch; Chemical pharmaceuticals preparations\nHLJ Huimeijia\n5/7/2019 to 5/6/2029\nXuedu\nNo.5: Medicine for human; Chinese patent drugs; Suppository; Tincture; Water aqua; Paste; Liniment; Medical lotion; Patch; Chemical pharmaceuticals preparations\nHLJ Huimeijia\n5/7/2019 to 5/6/2029\nXuedu with an image\nNo.5: Paste\nHLJ Huimeijia\n5/21/2023 to 5/20/2033\nTai Yan Li\nNo.30: Honey, spirulina (non-medical), non-medical nutrient solution, non-medical nutrient lotion, non-medical nutrient powder, non-medical nutrient capsule, pastry, cereal, flour product.\nHumankind\n11/28/2022 to 11/27/2032\nTai Yan Li\nNo.3: Cleanser lotion, soup, anti -bacterial hand soup, cleanser, cosmetics, conditioning gel, polish, essential oil.\nHumankind\n11/28/2022 to 11/27/2032\nLuo Qian\nNo.3: essential oil, fragrance essential oil, nourishing essential oil, cosmetic mask, cosmetic tools, cosmetics, cosmetic cleanser, perfume, weight-losing cosmetics, banishing essence.\nHumankind\n6/14/2021 to 6/13/2031\n(1) The trademarks listed here have been spelt in Pinyin for the U.S. readers convenience. The original trademarks are in Chinese characters.\nWe have the right to use the following patents under the approval of National Bureau of Intellectual Property:\nPatent\nCategories\nName\nInventor/Designer\nPatent No.\nDuration\nOwner\nInvention Patent\nRunchao Soft Capsule and Its Manufacturing Method\nXin Sun\nZL200610010394.4\nAugust 10, 2006-\nAugust 9, 2026\nXin Sun*\n* Mr. Sun verbally authorized the Company the right to use the patent.\nThe following is a list of our patent applications:\nThe applicant of all the following patents is Humankind, with their inventor being Mr. Xin Sun. In March 2017, we submitted the below patent applications which are currently in the reviewing process and pending for approval.\nSerial No.\nName\nApplication\nTechnology Field\nCannabidiol (CBD) Cataplasmata\nCannabidiol (CBD) is used for relieving muscle pain and its preparation method.\nThe invention belongs to the research and application field of industrial hemp and relates to a kind of cataplasmata, in particular to Cannabidiol (CBD) which is used for relieving muscle pain and its preparation method.\nCannabidiol (CBD) Suspension\nCannabidiol (CBD) Suspension is used for treating arthritis and its preparation method.\nThe invention relates to the field of pharmaceutical preparations, in particular to a kind of Cannabidiol (CBD) Suspension which is used for treating arthritis and its preparation method.\nCannabidiol (CBD) Gel\nCannabidiol (CBD) Gel has the effect of relieving nervous headache and its preparation method.\nThe invention relates to gel preparations for medicine, in particular to a kind of Cannabidiol (CBD) Gel which has the effect of relieving nervous headache and its preparation method.\nCannabidiol (CBD) Paste\nCannabidiol (CBD) Paste has the effect of relieving swelling and pain and its preparation method.\nThe invention relates to the field of medicine, in particular to a kind of Cannabidiol (CBD) Paste which has the effect of relieving swelling and pain and its preparation method.\nSerial No.\nName\nApplication\nTechnology Field\nCannabidiol (CBD) Soft Capsule\nCannabidiol (CBD) Soft Capsule has the effect of improving diabetes and its preparation method.\nThe invention relates to the field of soft capsule, in particular to a kind of Cannabidiol (CBD) Soft Capsule which has the effect of improving diabetes and its preparation method.\nCannabidiol (CBD) Suppository\nCannabidiol (CBD) Suppository has the effect of heat sterilization and its preparation method.\nThe invention relates to the field of medicine, in particular to a kind of Cannabidiol (CBD) Suppository which has the effect of heat sterilization and its preparation method.\nCannabidiol (CBD) Plaster\nCannabidiol (CBD) Rubber Plaster has the effect of treating old bone disease and its preparation method.\nThe invention relates to the field of medical plaster, in particular to a kind of Cannabidiol (CBD) Rubber Plaster which has the effect of treating old bone disease and its preparation method.\nCannabidiol (CBD) Rubber Plaster\nCannabidiol (CBD) Rubber Plaster has the effect of dispelling wind and eliminating dampness and its preparation method.\nThe invention relates to the field of medical plaster, in particular to a kind of Cannabidiol (CBD) Rubber Plaster which has the effect of dispelling wind and eliminating dampness and its preparation method.\nCannabidiol (CBD) Liquid Pharmaceutical Preparations\nCannabidiol (CBD) Liquid Pharmaceutical Preparations has the anti-anxiety effect and its preparation method.\nThe invention relates to the field of liquid pharmaceutical preparations, in particular to a kind of Cannabidiol (CBD) Liquid Pharmaceutical Preparations which has the anti-anxiety effect and its preparation method.\nMoisturizing Cream with Hemp Seed Oil\nMoisturizing Cream with Hemp Seed Oil and its preparation method.\nThe invention relates to the field of cosmetics, in particular to a kind of Moisturizing Cream which contains hemp seed oil and its preparation method.\nThe laws governing our business are as follows:\n● Drug administration law of the PRC enacted August 27, 2019\n● Healthcare registration and administration law, enacted January 7, 2005\n● Measures for the Administration of Pharmaceutical Trade License, enacted January 4, 2004\n● Measures for the Supervision Over and Administration of Pharmaceutical Production, enacted May 8, 2004\n● Food Safety Law of the PRC, enacted June 1, 2009\n● Regulation on the Implementation of the Food Safety Law of the PRC, enacted July 20, 2009\n● Regional regulation: Heilongjiang Regional Medicinal Materials Resource Protection Bylaw, enacted January 8, 2005\n● Good Manufacturing Practice (GMP) Amendment, enacted January 17, 2011\n● Hemp Industry 3-year Special Action Plan of Heilongjiang Province (2018-2020) and\n● Hemp Legislation of Heilongjiang Province in May 2017.\nIn the PRC, a Good Manufacturing Practice Certification (GMP Certification) is required for companies that produce medical drugs and health supplements. It is also required to market our medical drugs and health supplements. According to the Administrative Rules of Drug Manufacturing and Certification issued by the NMPA of the PRC on September 7, 2005, the NMPA is responsible for the review and issuance of GMP Certification. To obtain a GMP Certification, a company shall submit its application; the NMPA will then conduct a technical review of the application materials; if such company passes the technical review, the NMPA will inspect the manufacturing site. The NMPA also conducts follow-up inspections on the manufacturing site. After the issuance of the GMP Certification, the NMPA may inspect the manufacturing site from time to time. However, instead of issuing GMP, the NMPA now issues SC Permit to food manufacturers in China, allowing them to manufacture and sell health products. The GMP Certifications of our wholly owned subsidiaries, Humankind, HLJ Huimeijia, are valid through February 14, 2019 and December 31, 2015, respectively. For the GMP Certificate of HLJ Huimeijia, the Company applied for a new certificate, which was obtained on April 25, 2018. Since obtaining the GMP Certification, we have been able to manufacture and market our products without further governmental approval. As Humankind is in the business of manufacturing and selling health products, it is considered as a food manufacturer in China. Humankind received its SC Permit on July 26, 2018, which will expire on September 12, 2021.The Company has applied for extension which is expect to be approved at the end of October 2021. On December 1, 2019 the newly revised Drug Administration Law (the New Law) came into effect. One of the major amendments is the cancellation of GMP certification. The New Law eliminated the requirement that drug administration authorities shall assess drug manufacture enterprises and drug trading enterprises, and issue assessment certificates. Instead, it requires that drug manufacturing enterprises and drug trading enterprises establish and improve the quality management systems of manufacture and trade of drugs, and ensure that the process of manufacturing and trading of drugs always meets all legal requirements. This means a stricter form of supervision is implemented comparing to the prior GMP certificates system and our production lines are subject pilot inspection under the New Law.\nPCAOB and Auditors Regulation\nOn April 21, 2020, SEC released a joint statement highlighting the risks associated with investing in companies based in or have substantial operations in emerging markets including China. The joint statement emphasized the risks associated with lack of access for the PCAOB to inspect auditors and audit work papers in China and higher risks of fraud in emerging markets. On May 18, 2020, Nasdaq filed three proposals with the SEC to (i) apply minimum offering size requirement for companies primarily operating in Restrictive Market, (ii) adopt a new requirement relating to the qualification of management or board of director for Restrictive Market companies, and (iii) apply additional and more stringent criteria to an applicant or listed company based on the qualifications of the Companys auditors.\nOn May 20, 2020, the U.S. Senate passed the Holding Foreign Companies Accountable Act (the HFCAA) requiring a foreign company to certify it is not owned or controlled by a foreign government if the PCAOB is unable to audit specified reports because the Company uses a foreign auditor not subject to PCAOB inspection. If the PCAOB is unable to inspect the Companys auditors for three consecutive years, the issuers securities are prohibited to trade on a national securities exchange or in the over the counter trading market in the U.S. On December 18, 2020, the HFCAA was signed into law. The HFCAA has since then been subject to amendments by the U.S. Congress and interpretations and rulemaking by the SEC.\nOn June 22, 2021, the U.S. Senate passed the Accelerating Holding Foreign Companies Accountable Act, which proposes to reduce the period of time for foreign companies to comply with PCAOB audits from three to two consecutive years, thus reducing the time period before the securities of such foreign companies may be prohibited from trading or delisted. On December 29, 2022, the Consolidated Appropriations Act, 2023 (the CAA), which the AHFCAA forms a part, was signed into law, and it officially reduced the number of consecutive non-inspection years required for triggering the prohibitions under the HFCAA from three years to two, thus, would reduce the time before an applicable issuers securities may be prohibited from trading or delisted.\nOn December 16, 2021, PCAOB announced the PCAOB HFCAA determinations relating to the PCAOBs inability to inspect or investigate completely registered public accounting firms headquartered in mainland China of the PRC or Hong Kong, a Special Administrative Region and dependency of the PRC, because of a position taken by one or more authorities in the PRC or Hong Kong. The inability of the PCAOB to conduct inspections of auditors in China made it more difficult to evaluate the effectiveness of these accounting firms audit procedures or quality control procedures as compared to auditors outside of China that are subject to the PCAOB inspections, which could cause existing and potential investors in issuers operating in China to lose confidence in such issuers procedures and reported financial information and the quality of financial statements.\nOur auditor, Centurion ZD CPA & Co., the independent registered public accounting firm that issues the audit report included herein, as an auditor of companies that are traded publicly in the United States and a firm registered with the PCAOB, is subject to laws in the United States pursuant to which the PCAOB conducts regular inspections to assess our auditors compliance with the applicable professional standards. Our auditor is headquartered in Hong Kong, and was listed as an account firm subject to the Hong Kong determination in the PCAOBs HFCAA Determination Report dated December 2021 (the PCAOB 2021 Determinations), as an accounting firm the PCAOB is unable to inspect or investigate completely.\nOn August 26, 2022, the PCAOB announced and signed a Statement of Protocol (the Protocol) with the China Securities Regulatory Commission and the Ministry of Finance of the Peoples Republic of China (together, the PRC Authorities). The Protocol provides the PCAOB with: (1) sole discretion to select the firms, audit engagements and potential violations it inspects and investigates, without any involvement of Chinese authorities; (2) procedures for PCAOB inspectors and investigators to view complete audit work papers with all information included and for the PCAOB to retain information as needed; (3) direct access to interview and take testimony from all personnel associated with the audits the PCAOB inspects or investigates.\nOn October 21, 2022, the SEC issued its updated Conclusive list of issuers identified under the HFCAA (the List) indicating that those companies are now formally subject to the trading prohibition provisions if they remain on the List for two consecutive years, which we are included. As of the date of this transition report, more than 170 public companies have been listed in as issuers identified under the AHFCAA, including us. As we have been conclusively identified on October 21, 2022, if we continue to be so identified on the list until October 21, 2024, the SEC will be required under the HFCAA to prohibit the trading of our securities on a national securities exchange and in the over-the-counter market.\nOn December 15, 2022, the PCAOB announced in its 2022 HFCAA Determination Report (the 2022 Report) its determination that the PCAOB was able to secure complete access to inspect and investigate audit firms in the Peoples Republic of China (PRC), and the PCAOB Board voted to vacate previous determinations to the contrary. According to the 2022 Report, this determination was reached after the PCAOB had thoroughly tested compliance with every aspect of the Protocol necessary to determine complete access, including on-site inspections and investigations in a manner fully consistent with the PCAOBs methodology and approach in the U.S. and globally. According to the 2022 Report, the PRC Authorities had fully assisted and cooperated with the PCAOB in carrying out the inspections and investigations according to the Protocol, and have agreed to continue to assist the PCAOBs investigations and inspections in the future. Thus the PCAOB has vacated the PCAOB 2021 Determinations, including the determination that the PCAOB is unable to inspect or investigate completely our auditor. The PCAOB may reassess its determinations and issue new determinations consistent with the HFCAA at any time. We cannot assure you that the PRC Authorities will continue to fully assist the PCAOB in the future. The PRC Authorities may, in the future, prevent or hinder the PCAOB from continuing to inspect or investigate, either partially or completely, accounting firms headquartered in mainland China or Hong Kong, in which case we may get delisted from the OTC Market if PCAOB determines that it is not able to fully inspect and investigate our auditors for two consecutive years if we do not in time engage an alternative auditor fully subject to PCAOB inspection and investigation.\nFurther developments related to the HFCAA could add uncertainties to our offering. Although PCAOB has now temporarily confirm the capability to inspect the auditors firms in PRC, and thus the AHFCAA and the List will not affect our listing, we cannot assure you that will always be the case and what further actions the SEC, the PCAOB or the stock exchanges will take to address these issues and what impact such actions will have on U.S. companies that have significant operations in the PRC and have securities listed on a U.S. stock exchange (including a national securities exchange or over-the-counter stock market). In addition, any additional actions, proceedings, or new rules resulting from these efforts to increase U.S. regulatory access to audit information could create uncertainty for investors, the market price of our ordinary shares could be adversely affected, and trading of our securities could become prohibited if we or our auditor are unable to meet the PCAOB inspection requirement. Such a trading prohibitions would substantially impair your ability to sell or purchase our ordinary shares when you wish to do so, and would have negative impacts on trading our ordinary shares, including decrease in trading price, increase in price volatility, decrease in trading volume and liquidity, and loss of trading venues.\nEnforceability\nChina Health US is a Delaware holding company with its operation in PRC conducted by its PRC subsidiaries, with substantially all of the Companys assets located there. In addition, all Companys senior executive officers, all reside within China for a significant portion of the time and most are PRC nationals. As a result, it may be difficult for the shareholders to effect service of process upon China Health US or those persons inside China.\nShareholder claims that are common in the United States, including securities law class actions and fraud claims, generally are difficult to pursue as a matter of law or practicality in China. For example, in China, there are significant legal and other obstacles to obtaining information needed for shareholder investigations or litigation outside China or otherwise with respect to foreign entities. Although the local authorities in China may establish a regulatory cooperation mechanism with the securities regulatory authorities of another country or region to implement cross-border supervision and administration, such regulatory cooperation with the securities regulatory authorities in the Unities States have not been efficient in the absence of mutual and practical cooperation mechanism.\nAs China does not have treaties providing for the reciprocal recognition and enforcement of judgments of courts with the United States and many other countries and regions, recognition and enforcement in China of judgments of a court in any of these non-PRC jurisdictions in relation to any matter not subject to a binding arbitration provision may be difficult or impossible. As a result, it may be difficult to enforce against us or them judgments obtained in United States courts, including judgments predicated upon the civil liability provisions of the securities laws of the United States or any state in the United States. It may also be difficult for a shareholder to enforce judgments obtained in U.S. courts based on the civil liability provisions of the U.S. federal securities laws against us and these persons located in China.\nEmployees\nAs of June 30, 2023, we have 32 full-time employees including 6 officers, 5 administrators, 12 workers, 4 technicians, and 5 accountants. Besides, we have 2 sales persons as part-time employees. We believe that we are in compliance with local prevailing wage, contractor licensing and insurance regulations, and have good relations with our employees. Item 1A. Risk Factors.\nWe are a smaller reporting company and therefore this item is not applicable to us. Item 1B. Unresolved Staff Comments.\nNot applicable.\nItem 1C. Cybersecurity\nNot applicable. Item 2. Properties.\nThere is no private land ownership in PRC. Enterprises and individuals can pay the government a fee to obtain a right to use a piece of land for commercial purpose or residential purpose for an initial period of 50 years or 70 years, respectively. The land use right can be sold, purchased, and exchanged in the market. The land use right of a successor owner will be reduced by the amount of time consumed by the predecessor owner.\nWe manufacture our products on a plot of land located in Jin Xing Industrial Park, Songbei District, Harbin. On June 7, 2004, the Company entered into a Land Use Purchase Contract with the local government, pursuant to which the Company agreed to purchase the right to use a piece of land, approximately 8 acres (32,000 square meters), located in Harbin County, Heilongjiang Province for commercial purposes for a fifty-year period from June 7, 2004 through June 6, 2054, for $637,261 (RMB 5,248,000). The Company fully paid to the government the consideration for the land use right on June 13, 2004. The Department of Housing and Urban Development of Harbin City approved this transaction. The Company is in the process of applying for the title certificate from the local government. Due to certain re-zoning conducted by the local government, the estimate time to receive the title certificate is uncertain. The Company is striving to accelerate the process. The manufacturing facility on the land is 4,000 square meters and there are five production lines which are sufficient for our operation. We package our products in bottles, plastic containers and aluminum foil bags.\nSince we acquired HLJ Huimeijia on November 22, 2013, we also manufacture our medicines and drugs using HLJ Huimeijias land, approximately 43,350 square meters, located in Hai-lin Economic Development Zone, Mudanjiang City. The manufacturing facilities occupy approximately 5,710 square meters. We plan to build new manufacturing facilities on the land. The expected construction cost is approximately $7,520,000 (RMB 50,000,000). Item 3. Legal Proceedings.\nWe do not know of any material, active, pending or threatened proceeding against us or our subsidiaries, nor are we, or any subsidiary, involved as a plaintiff or defendant in any material proceeding or pending litigation. Item 4. Mine Safety Disclosures.\nThis item is not applicable to us.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common stock is quoted over-the-counter on the OTC Markets QB Tier under the ticker CHHE and the market for the stock has been relatively inactive. The quotations on the OTC Markets reflect inter-dealer prices, without retail mark-up, mark-down or commission, and may not necessarily represent actual transactions.\nAs of November 10, 2023, we had approximately 502 shareholders of record of our common stock, such number of holders does not include street name holders who hold shares by brokerage firms. The holders of common stock are entitled to one vote for each share held of record on all matters submitted to a vote of shareholders. Holders of the common stock have no preemptive rights and no right to convert their common stock into any other securities. There are no redemption or sinking fund provisions applicable to the common stock.\nDividends\nWe have not paid dividends on our common stock and do not anticipate to pay such dividends in the foreseeable future. We will rely on dividends from Humankind for our funds and PRC regulations may limit the amount of funds distributed to us from Humankind, which will affect our ability to declare any dividends.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nOn March 27, 2015 the Board of Directors (the Board) adopted the Companys 2015 Equity Incentive Plan (the Plan), which became effective as of such date. The total number of authorized shares under the Plan is 6,000,000 shares of common stock.\nThe following table summarizes the number of shares of our common stock authorized for issuance under our Plan as of June 30, 2023.\nEquity Compensation Plan Information\nPlan category Number of\nsecurities\nto be issued\nupon\nexercise of\noutstanding\noptions,\nwarrants\nand rights\n(a)\nWeighted-\naverage\nexercise\nprice of\noutstanding\noptions,\nwarrants\nand rights\n(b)\nNumber of\nsecurities\nremaining\navailable for\nfuture\nissuance\nunder equity\ncompensation\nplans\n(excluding\nsecurities\nreflected in\ncolumn(a))\n(c)\nEquity compensation plans approved by security holders - - -\nEquity compensation plans not approved by security holders - - 2,700,000 (1)\nTotal\n2,700,000\n(1) The Company granted an aggregate of 3.3 million shares of restricted shares to its CEO and an employee on March 30, 2015. The shares of the Company are quoted on the OTC Markets. As a result, no security holders approval is required for the Companys adoption of an equity compensation plan.\nRegistrar and Stock Transfer Agent\nOur stock transfer agent is Direct Transfer LLC at 1981 Murray Holladay Road, Suite 100, Salt Lake City, UT 84117. Their telephone number is (801) 272-9294, and their fax number is (801) 277-3147.\nShares Eligible for Future Sale\nThere is no active trading market for our common stock. Future sales of substantial amounts of our common stock in the trading market could adversely affect market prices.\nPenny Stock Regulations\nOur shares of common stock are subject to the penny stock rules of the Securities Exchange Act of 1934, as amended (the Exchange Act) and various rules thereunder. In general terms, penny stock is defined as any equity security that has a market price less than $5.00 per share, subject to certain exceptions. The rules provide that any equity security is considered to be a penny stock unless that security is registered and traded on a national securities exchange meeting specified criteria set by the SEC, issued by a registered investment company, and excluded from the definition on the basis of price (at least $5.00 per share), or based on the issuers net tangible assets or revenues. In the last case, the issuers net tangible assets must exceed $3,000,000 if in continuous operation for at least three years or $5,000,000 if in operation for less than three years or the issuers average revenues for each of the past three years must exceed $6,000,000.\nTrading in shares of penny stock is subject to additional sales practice requirements for broker-dealers who sell penny stocks to persons other than established customers and accredited investors. Accredited investors, in general, include individuals with assets in excess of $1,000,000 or annual income exceeding $200,000 (or $300,000 together with their spouse), and certain institutional investors. For transactions covered by these rules, broker-dealers must make a special suitability determination for the purchase of the security and must have received the purchasers written consent to the transaction prior to the purchase. Additionally, for any transaction involving a penny stock, the rules require the delivery, prior to the first transaction, of a risk disclosure document relating to the penny stock. A broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative, and current quotations for the security. Finally, monthly statements must be sent disclosing recent price information for the penny stocks. These rules may restrict the ability of broker-dealers to trade or maintain a market in our common stock, to the extent it is penny stock, and may affect the ability of shareholders to sell their shares.\nRecent Sale of Unregistered Securities\nNone.\nRepurchase of Equity Securities\nNone. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nFORWARD LOOKING STATEMENTS\nWe make certain forward-looking statements in this report. Statements concerning our future operations, prospects, strategies, financial condition, future economic performance (including growth and earnings), demand for our services, and other statements of our plans, beliefs, or expectations, including the statements contained under this caption as well as under captions elsewhere in this document, are forward-looking statements. In some cases, these statements are identifiable through the use of words such as anticipate, believe, estimate, expect, intend, plan, project, target, can, could, may, should, will, would, and similar expressions. The forward-looking statements we make are not guarantees of future performance and are subject to various assumptions, risks, and other factors that could cause actual results to differ materially from those suggested by these forward-looking statements. These risks and uncertainties, together with the other risks described from time to time in reports and documents that we file with the SEC should be considered in evaluating forward-looking statements. Because such statements are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by the forward-looking statements. Indeed, it is likely that some of our assumptions will prove to be incorrect. Our actual results and financial position will vary from those projected or implied in the forward-looking statements and the variances may be material. You are cautioned not to place undue reliance on such forward-looking statements, which reflect our view only as of the date of this report.\nImportant factors that could cause actual results to differ from those in the forward-looking statements include, without limitation, the following:\n● the effect of political conditions, economic conditions, market conditions, and geopolitical events;\n● legislative and regulatory changes that affect our business;\n● the availability of funds and working capital; and\n● the actions and initiatives of current and potential competitors.\nExcept as required by applicable laws, regulations, or rules, we do not undertake any responsibility to publicly release any revisions to these forward-looking statements to take into account events or circumstances that occur after the date of this report. Additionally, we do not undertake any responsibility to update you on the occurrence of any unanticipated events which may cause actual results to differ from those expressed or implied by any forward-looking statements.\nThe following discussion and analysis should be read in conjunction with our consolidated financial statements and the related notes thereto as filed with the SEC and other financial information contained elsewhere in this report.\nExcept as otherwise indicated by the context, references in this report to we, us, our, the Registrant, our Company, or the Company are to China Health Industries Holdings, Inc., a Delaware corporation, China Health Industries Holdings Limited, a limited liability company incorporated under the laws of Hong Kong, its wholly owned subsidiary in China, Harbin Humankind Biology Technology Co. Limited (Humankind), and indirect wholly owned subsidiary, Heilongjiang Huimeijia Pharmaceutical Co., Ltd. (HLJ Huimeijia). Unless the context otherwise requires, all references to (i) the PRC and China are to the Peoples Republic of China; (ii) U.S. dollar, $ and US$ are to United States dollars; (iii) RMB are to Renminbi Yuan of China; (iv) Securities Act are to the Securities Act of 1933, as amended; and (v) Exchange Act are to the Securities Exchange Act of 1934, as amended.\nBusiness Overview\nOur principal business operations are conducted through our wholly-owned subsidiaries, Humankind and HLJ Huimeijia.\nThe Company owns a GMP-certified plant and production facilities and has the capacity to produce 21 different NMPA-approved medicines, 14 NMPA-approved health supplement products and 10 hemp derivative products in soft capsule, hard capsule, tablet, granule, oral liquid forms. These products address the needs of some key sectors in China, including the feminine, geriatric, and childrens markets.\nHLJ Huimeijia was founded on October 30, 2003 and its latest GMP certificate is effective until April 24, 2023. On December 1, 2019, NMPA announced that it will no longer issue GMP certificate for any pharmaceutical companies. However, NMPA will carry out conformity inspection to do compliance testing, as well as flight check (unannounced inspection) for all pharmaceutical companies. HLJ Huimeijia engages in the manufacture and distribution of tincture, ointments, rubber paste, including hormones, topical solution, suppositories, enemas, oral liquids, and liniment, including traditional Chinese medicine extractions. HLJ Huimeijias predecessor was Heilongjiang Xue Du Pharmaceutical Co., Ltd., which established brand recognition in the market through its supply of high-quality drug products. HLJ Huimeijia is a high and new technology enterprise that provides the most comprehensive types of topical medical products in Heilongjiang Province, a northeastern province of China.\nWe have developed the following products that are derived from hemp and obtained business license to manufacture and sell these products. We have begun to sell these products since May 2018. Hemp Seed Beer, Hemp Oil, Hemp Protein Powder, Hemp Polypeptide and Collagen Peptide are sold through Humankind. Other products are sold through HLJ Huimeijia. The revenue of the Hemp Seed Beer, Hemp Oil and Hemp Seed accounted for 100% and nil of the total revenues for the fiscal year of 2023 and 2022, respectively.\nSerial No.\nName\nHemp Oil\nHemp Protein Powder\nHemp Polypeptide\nCollagen Peptide\nNatural Hemp Essence Repair Lotion\nNatural Hemp Revitalizing Essence\nNatural Hemp Anit-aging Brightening Eye Cream\nNatural Hemp Frozen Age Nourishing Cream\nHemp Seed Beer\nHemp Seed\nWe sell most of our products to sales agents, who are our customers. The sales agents sell the products to the end users.\n2023 Outlook\nOverall, we anticipate our total revenues for the year ended June 30, 2024 to reach to $5.5 million, with growth in all categories of our product sales, including the anticipated revenue from Humankind for approximately $0.5 million, from HLJ Huimeijia for approximately $1.5 million and from HempCan for approximately $3.5 million. The gross profit margin for the year ended June 30, 2024 is expected to be approximately 40%, and we estimate our overall net profit margin for the year ended June 30, 2024 to be approximately 15%. There is, however, no assurance that we will reach these projections.\nResults of Operations\nThe following table summarizes the top lines of the results of our operations for the years ended June 30, 2023 and 2022, respectively:\nJune 30,\nJune 30,\nVariance %\nRevenues $ 111,579 $ 267 111,312 41,689.9 %\nHumankind 111,579 - 111,579 100.0 %\nHLJ Huimeijia - (267 ) (100.0 )%\nCost of Goods Sold $ 111,359 $ 1,748 109,611 6,270.7 %\nHumankind 111,359 - 111,359 100.0 %\nHLJ Huimeijia - 1,748 (1,748 ) (100.0 )%\nGross Profit/(Loss) $ 220 $ (1,481 ) 1,701 (114.9 )%\nHumankind - 100.0 %\nHLJ Huimeijia - (1,481 ) 1,481 (100.0 )%\nRevenue\nTotal revenues of the Company increased by $111,312 or 41,689.9%, for the year ended June 30, 2023 as compared to the year ended June 30, 2022. The increase in revenues was primarily due to an increase of $111,579 or 100.0% in Humankinds revenues for the year ended June 30, 2023 as compared to the year ended June 30, 2022.The increase in Humankinds sales revenues was primarily derived from selling a new product, Hemp Seed Beer and selling raw material Hemp Seed.\nOur total cost of sales increased by $109,611 or 6,270.7% for the year ended June 30, 2023 as compared to the year ended June 30, 2022. The increase in the overall cost of sales was attributable to an increase of $111,359 or 100.0% in Humankinds cost of sales in 2023 as compared to the year ended June 30, 2022. The increase in Humankinds sales revenues was primarily derived from cost on selling a new product, Hemp Seed Beer and selling raw material Hemp Seed.\nOur gross profit increased by $1,701 from gross loss $1,481 for the year ended June 30, 2022 to $220 for the year ended June 30, 2023. This change was consistent with the change of sales and costs in Humankind. This growth mainly comes from the sales of the new product hemp seed beer and the raw material hemp seed.\nSales by Product Line\nThe following table summarizes a breakdown of our sales by major product line for the years ended June 30, 2023 and 2022, respectively:\nJune 30, 2023 June 30, 2022\nQuantity Sales\nQuantity Sales\n(Unit) US$ % of (Unit) US$ % of\nHumankind\nHemp Oil - - - - - -\nCollagen Peptide - - - - - -\nHemp Polypeptide - - - - - -\nHemp Protein Powder - - - - - -\nHemp Seed Beer 14,202 $ 75,063 67.3 % - $ - -\nHemp Seed 35,000 36,516 32.7 % - - -\nHLJ Huimeijia - - - - - -\nNatural Hemp Cosmetics - - - - - -\nMuskiness Bone Strengthener Paste - - - 6.7 %\nShangBiTongDing - - - - - -\nIndometacin and Furazolidone Suppositories - - - 12.1 %\nEnema Glycerini - - - - - -\nGe Hong Beriberi Water - - - - - -\nUmguentumAcidi Borici Camphoratum - - - - - -\nInjury and Rheumatism Relieving Paste - - - 1,852 56.9 %\nRefining GouPi Cream - - - 24.3 %\nNatural Hemp supplies - - - - - -\nTotal\n$ 111,579 100.0 %\n$ 267 100.0 %\nOperating Expenses\nThe following table summarizes our operating expenses for the years ended June 30, 2023 and 2022, respectively:\nJune 30,\nJune 30,\nVariance %\nOperating Expenses\nSelling, general and administrative $ 1,285,313 $ 934,927 350,386 37.5 %\nDepreciation and amortization 557,508 711,515 (154,007 ) (21.6 )%\nTotal Operating Expenses $ 1,842,821 $ 1,646,442 196,379 11.9 %\nTotal operating expenses for the year ended June 30, 2023 increased by $196,379 or 11.9%, as compared to the corresponding period in 2022. The increase in operating expenses was primarily attributable to an increase of $320,070 or 34.2% in selling, general and administrative expenses. The increase in selling, general and administrative expenses was mainly due to an increase in the amount of expired inventory destroyed in 2023 compared to the previous year.\nInterest Income and Interest Expenses\nInterest income was $113,615 for the year ended June 30, 2023, as compared to $157,860 for the year ended June 30, 2022. This decrease of $44,245, or 28.0%, was primarily due to the decreased average balance of bank deposits compared with the same period of 2022. This decline in bank balances was mainly due to the effects of currency translation difference from RMB to USD during the periods and normal daily operating expenses payment.\nInterest expense was $nil for the year ended June 30, 2023, and for the year ended June 30, 2022.\nOther Income\nOther income was $1,320,791 expense for the year ended June 30, 2023, as compared to $1,139,746 for the year ended June 30, 2022. This increase of $181,045 or 15.9%, was primarily due to revenue earned by the transfer of one of Huimeijias production technique. This technique transfer would not affect future production of Huimeijia.\nIncome Taxes\nIncome taxes decreased by $2,934, or 100.0%, from $2,934 for the year ended June 30, 2022 to $nil for the year ended June 30, 2023. This decrease of income tax expense incurred in the fiscal year ended June 30, 2023 was primarily due to the decrease of net profits before income taxes.\nNet Income (Loss) and Net Income per Share\nNet loss after provision for income taxes increased to $408,772, an increase of $54,822 for the year ended June 30, 2023, as compared to net loss of $353,950 for the year ended June 30, 2022. This increase of net loss was mainly because HLJ Huimeijia wrote off a large amount of inventory.\nNet loss per share was $0.0062 for the year ended June 30, 2023 and net loss per share was $0.0054 for the year ended June 30, 2022. This increase in net loss per share was primarily a result of the aforementioned increase in net loss.\nLiquidity and Capital Resources\nWe believe our current working capital position, together with our expected future cash flows from operations, loans from our major shareholder, will be adequate to fund our operations in the ordinary course of business, anticipated capital expenditures, debt payment requirements and other contractual obligations for at least the next twelve months. However, this belief is based upon many assumptions and is subject to numerous risks, and there can be no assurance that we will not require additional funding in the future.\nThe following table summarizes our cash and cash equivalents position, our working capital, and our cash flow activity as of the fiscal years ended June 30, 2023 and 2022:\nFor the years ended June 30:\nCash and cash equivalent $ 47,246 $ 44,789,999\nWorking capital $ 34,997,532 $ 37,652,693\nInventories, net $ 40,608 $ 521,229\nFor the years ended June 30:\nCash provided by (used in):\nOperating activities $ (42,272,498 ) $ 2,115,726\nInvesting activities $ - $ -\nFinancing activities $ - $ -\nDue to investments in subsidiaries,Cash and cash equivalents decreased by $44,742,753 from $44,789,999 as of June 30, 2022 to $47,246 as of June 30, 2023.\nOur working capital as of June 30, 2023 was $34,997,532, compared to working capital of $37,652,693 as of June 30, 2022. This decrease of $2,655,161 or 7.1% was mainly due to the decrease of cash and cash equivalents in the amount of $44,742,753, which offset by the decrease of prepaid investment funds of $40,665,602.\nNet cash used in operating activities was $42,272,498 for the year ended June 30, 2023, compared to $2,115,726 for the year ended June 30, 2022. The decrease of $44,388,224 in the net cash provided by operating activities was primarily due to the purchase of subsidiary shares in June 2023.\nNet cash used in investing activities was $nil for both years ended June 30, 2023 and 2022.\nNet cash provided by financing activities was $nil for both years ended June 30, 2023 and 2022.\nOther than as described in this report, we have no present agreements or commitments with respect to any material acquisitions of businesses, products, product rights or technologies or any other material capital expenditures. However, we will continue to evaluate acquisitions of, and/or investments in, products, technologies, capital equipment or improvements or companies that complement our business and may make such acquisitions and/or investments in the future. Accordingly, we may need to obtain additional sources of capital in the future to finance any such acquisitions and/or investments. We may not be able to obtain such financing on commercially reasonable terms, if at all. Even if we are able to obtain additional financing, it may contain undue restrictions on our operations, in the case of debt financing, or cause substantial dilution for our shareholders, in the case of equity financing.\nRelated Party Debts\nWe had related party debts of $5,154,024 as of June 30, 2023, as compared to $6,759,761 as of June 30, 2022, a decrease of $1,605,737 or 23.8%. The amount of related party debts mainly consists of a loan from Mr. Xin Sun, the CEO of the Company. The loan is unsecured and non-interest bearing and has no fixed terms of repayment. There was no written agreement for the loan. See Note 9.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that are currently material or reasonably likely to be material to our financial position or results of operations.\nCritical Accounting Policies and Estimates\nWe regularly evaluate the accounting policies and estimates that we use to make budgetary and financial statement assumptions. A complete summary of these policies is included in Note 2 to our consolidated financial statements, Significant Accounting Policies, and is incorporated herein by reference. In general, managements estimates are based on historical experience, on information from third party professionals, and on various other assumptions that are believed to be reasonable under the facts and circumstances. Actual results could differ from those estimates made by management. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nNot Applicable. Item 8. Financial Statements and Supplementary Data.\nThe financial statements required by this item are set forth beginning on page.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm (PCAOB Firm ID# 6783)\nReport of Independent Registered Public Accounting Firm (PCAOB Firm ID# 2769)\nConsolidated Balance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations and Comprehensive Income (Loss) For the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Equity For the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows For the Years Ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements -\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors of\nChina Health Industries Holdings, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheet of China Health Industries Holdings, Inc. and subsidiaries (the Company) as of June 30, 2023, and the related consolidated statements of operations, comprehensive income (loss), changes in shareholders equity, and cash flows for the year then ended, and the related notes and Schedule I (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ Assentsure PAC\nWe have served as the Companys auditors since 2023.\nThe Bencoolen, Singapore\nNovember 13, 2023\n中正達會計師事務所\nCenturion ZD CPA & Co.\nCertified Public Accountants (Practising)\nUnit 1304, 13/F, Two Harbourfront, 22 Tak Fung Street, Hunghom, Hong Kong.\n香港 紅磡 德豐街22號 海濱廣場二期 13樓1304室\nTel 電話: (852) 2126 2388 Fax 傳真: (852) 2122 9078\nEmail 電郵: info@czdcpa.com\nTo: The board of directors and stockholders of\nChina Health Industries Holdings, Inc. (the Company)\nReport of Independent Registered Public Accounting Firm\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of China Health Industries Holdings, Inc. and its subsidiaries (the Company) as of June 30, 2022 and the related consolidated statements of operations and comprehensive income, changes in shareholders equity and cash flows for the year then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of June 30, 2022 and the consolidated results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\n中正達會計師事務所\nCenturion ZD CPA & Co.\nValuation of Inventory\nInventories consist of growing and processed plants and oils and are valued at the lower of cost or net realizable value. In evaluating whether inventories are stated at lower of cost or net realizable value, management considers such factors as inventories in hand, estimated time to sell such inventories and current market conditions. Write-offs for inventory obsolescence are recorded when, in the opinion of management, the value of specific inventory items has been impaired.\nOur audit procedures to address the Companys valuation of inventory included the following, among others. We updated to our understanding of the Companys inventory process, observations of year end quantities, and the testing of the cultivation, manufacturing and processing costs allocated to the various stages of inventory during the year. We also tested the Companys net realizable values across each inventory and the assumptions used.\nImpairment of long-lived assets\nThe carrying value of long-lived assets are reviewed when facts and circumstances suggest that the assets may be impaired or that the amortization period may need to be changed. The Company considers internal and external factors relating to each asset, including cash flows, local market developments, industry trends and other publicly available information. If these factors and the projected undiscounted cash flows of the Company over the remaining amortization period indicate that the asset will not be recoverable, the carrying value will be adjusted to the fair market value\nOur audit procedures relating to the Companys assessment of impairment of long-lived assets included the following, among others. We evaluated the methodologies and tested the significant assumptions and underlying data used by the Company. Such testing included assessing the reasonableness of the undiscounted cash flow projections used by the Company in their assessment of impairment in comparison with historical data and the Companys assumptions used for the projections.\n/s/ Centurion ZD CPA & Co.\nCenturion ZD CPA & Co.\nWe have served as the Companys auditor since 2017\nHong Kong, China\nSeptember 15, 2022\nCHINA HEALTH INDUSTRIES HOLDINGS, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nIN US DOLLARS\n(Audited)\nJune 30,\nJune 30,\nASSETS\nCurrent assets\nCash and cash equivalents $ 47,246 $ 44,789,999\nAccounts receivable, net -\n9,567\nInventory 40,608 521,229\nOther receivables, net 1,921 31,778\nAdvances to suppliers 198,157 214,915\nPrepaid investment funds 40,682,360 -\nPrepayments -\n30,004\nTotal current assets $ 40,970,292 $ 45,597,492\nProperty, plants and equipment, net 2,727,170 3,158,021\nIntangible assets, net 964,775 1,412,603\nConstruction in progress 420,092 579,402\nTotal assets $ 45,082,329 $ 50,747,518\nLIABILITIES AND EQUITY\nCurrent liabilities\nAccounts payable and accrued expenses 286,902 334,972\nOther payables 94,293 82,323\nAdvances from customers 208,966 472,307\nRelated party debts 5,154,024 6,759,761\nWages payable 90,990 162,431\nTaxes payable 137,585 133,005\nTotal current liabilities $ 5,972,760 $ 7,944,799\nEquity\nCommon stock, ($0.0001 par value per share, 300,000,000 shares authorized, 65,539,737 and\n65,539,737 shares issued and outstanding as of June 30, 2023 and June 30, 2022, respectively) 6,554 6,554\nAdditional paid-in capital 521,987 521,987\nAccumulated other comprehensive income (2,745,558 ) 538,820\nStatutory reserves 38,679 38,679\nRetained earnings 41,287,907 41,696,679\nTotal stockholders equity $ 39,109,569 $ 42,802,719\nTotal equity $ 39,109,569 $ 42,802,719\nTotal liabilities and equity $ 45,082,329 $ 50,747,518\nThe accompanying notes are an integral part of these consolidated financial statements.\nCHINA HEALTH INDUSTRIES HOLDINGS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME\nIN US DOLLARS\n(Audited)\nFor the Year Ended\nJune 30,\nJune 30,\nREVENUE $ 111,579 $ 267\nCOST OF GOODS SOLD 111,359 1,748\nGROSS PROFIT/(LOSS) (1,481 )\nOPERATING EXPENSES\nSelling, general and administrative expenses 1,285,313 934,927\nDepreciation and amortization expenses 557,508 711,515\nTotal operating expenses 1,842,821 1,646,442\nLOSS FROM OPERATIONS (1,842,601 ) (1,647,923 )\nOTHER INCOME/(EXPENSES)\nInterest income 113,615 157,860\nOther income, net 1,320,791 1,139,746\nBank charges (577 ) (699 )\nTotal other income, net 1,433,829 1,296,907\nLOSS BEFORE INCOME TAXES (408,772 ) (351,016 )\nProvision for income taxes -\n(2,934 )\nNET LOSS (408,772 ) (353,950 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nCHINA HEALTH INDUSTRIES HOLDINGS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME\nIN US DOLLARS\n(Audited) (CONTINUED)\nFor the Year Ended\nJune 30,\nJune 30,\nForeign currency translation adjustment (3,284,378 ) (1,617,972 )\nCOMPREHENSIVE LOSS $ (3,693,150 ) $ (1,971,922 )\nNet (loss)/income per share:\nNet loss per share Basic & diluted\n$ (0.0062 ) $ (0.0054 )\nWeighted average shares outstanding:\nBasic & diluted\n65,539,737 65,539,737\nThe accompanying notes are an integral part of these consolidated financial statements.\nCHINA HEALTH INDUSTRIES HOLDINGS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nIN US DOLLARS\n(Audited)\nCommon Shares Additional\nPaid-in Retained Statutory Accumulated\nOther\nComprehensive Total\nStockholders Non-\ncontrolling Total\nShares Amount Capital Earnings Reserve Income (loss) Equity Interest Equity\nBalance, June 30, 2021 65,539,737 $ 6,554 $ 521,987 42,050,629 38,679 2,156,792 44,774,641 -\n44,774,641\nNet loss - -\n-\n(353,950 ) -\n-\n(353,950 ) -\n(353,950 )\nOther comprehensive loss - Translation adjustment - -\n-\n-\n-\n(1,617,972 ) (1,617,972 ) -\n(1,617,972 )\nBalance, June 30, 2022 65,539,737 6,554 521,987 41,696,679 38,679 538,820 42,802,719 -\n42,802,719\nNet loss - -\n-\n(408, 772) -\n-\n(408, 772) -\n(408, 772)\nOther comprehensive loss - Translation adjustment - -\n-\n-\n-\n(3,284,378 ) (3,284,378 ) -\n(3,284,378 )\nBalance, June 30, 2023 65,539,737 6,554 521,987 41,287,907 38,679 (2,745,558 ) 39,109,569 -\n39,109,569\nThe accompanying notes are an integral part of these consolidated financial statements.\nCHINA HEALTH INDUSTRIES HOLDINGS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nIN US DOLLARS\n(Audited)\nFor the Year Ended\nJune 30,\nJune 30,\nCash Flows from Operating Activities\nNet loss attributable to China Health Industries Holdings $ (408,772 ) $ (353,950 )\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization expenses 686,676 830,545\nProvision for doubtful accounts 6,403 (9,556 )\nDeferred taxes gain - 2,860\nChanges in operating assets and liabilities:\nInventory 459,731 215,391\nAccounts receivable 2,813 2,288,077\nOther receivables 12,737 (114 )\nAdvance to suppliers and prepaid expenses 29,278 (11,024 )\nPrepaid investment funds (42,424,029 ) -\nAccounts payables and accrued expenses (19,886 ) (57,912 )\nAdvance from customers and other payables (171,488 ) 358,179\nAmounts due to related parties (374,064 ) (1,057,059 )\nWages payable (61,577 ) (48,844 )\nTaxes payable (10,320 ) (40,867 )\nNet cash provided by operating activities $ (42,272,498 ) $ 2,115,726\nCash Flows from Investing Activities\nNet cash (used in)/provided by investing activities -\n-\nCash Flows from Financing Activities\nNet cash (used in)/provided by financing activities -\n-\nEffect of exchange rates change on cash and cash equivalents (2,470,255 ) (1,672,471 )\nNet (decrease)/increase in cash and cash equivalents (44,742,753 ) 443,255\nCash and cash equivalents, beginning of period 44,789,999 44,346,744\nCash and cash equivalents, end of period $ 47,246 $ 44,789,999\nSupplemental disclosure of cash flow information\nInterest paid $ -\n$ -\nTaxes paid $ -\n$ -\nNon-cash activities:\nLoan from related party for the construction of a facility $ -\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nCHINA HEALTH INDUSTRIES HOLDINGS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 - ORGANIZATION AND BUSINESS BACKGROUND\nChina Health Industries Holdings, Inc. (China Health US) was incorporated in the State of Arizona on July 11, 1996 and was the successor of the business known as Arizona Mist, Inc. which began in 1989. On May 9, 2005, it entered into a stock purchase agreement and Share Exchange (effecting a reverse merger) with Edmonds 6, Inc. (Edmonds 6), a Delaware corporation, and changed its name to Universal Fog, Inc. Pursuant to this agreement, Universal Fog, Inc. (which has been in continuous operation since 1996) became a wholly-owned subsidiary of Edmonds 6.\nChina Health Industries Holdings Limited (China Health HK) was incorporated on July 20, 2007 in Hong Kong under the Companies Ordinance as a limited liability company. China Health HK was formed for the purpose of seeking and consummating a merger or acquisition with a business entity organized as a private corporation, partnership, or sole proprietorship as defined by FASB ACS Topic 915 (Development Stage Entities).\nHarbin Humankind Biology Technology Co., Limited (Humankind) was incorporated in Harbin City, Heilongjiang Province, the Peoples Republic of China (the PRC) on December 14, 2003, as a limited liability company under the Company Law of the PRC. Humankind is engaged in the manufacturing and sale of health products.\nOn August 20, 2007, the sole shareholder of China Health HK entered into a share purchase agreement (the Share Purchase Agreement) with the owners of Humankind. Pursuant to the Share Purchase Agreement, China Health HK purchased 100% of the ownership in Humankind for a cash consideration of $60,408 (the Share Purchase). Subsequent to the completion of the Share Purchase, Humankind became a wholly-owned subsidiary of China Health HK. The Share Purchase was accounted for as a reverse merger since the owner of Humankind owned a majority of the outstanding shares of China Health HKs common stock immediately following the execution of the Share Purchase Agreement, it was deemed to be the accounting acquirer in the reverse merger. Consequently, the assets and liabilities and the historical operations that have been reflected in the financial statements for periods prior to the Share Purchase are those of Humankind and have been recorded at the historical cost basis. After completion of the Share Purchase, China Health HKs consolidated financial statements include the assets and liabilities of both China Health HK and Humankind, the historical operations of Humankind, and the operations of China Health HK and its subsidiaries from the closing date of the Share Purchase.\nOn October 14, 2008, Humankind set up a 99% owned subsidiary, Harbin Huimeijia Medicine Company (Huimeijia), with its primary business being manufacturing and distributing medicine. Mr. Xin Sun, the Companys majority owner, owns 1% of Huimeijia. Huimeijia is consolidated in the consolidated financial statements of China Health HK.\nOn December 31, 2008, China Health HK entered into a reverse merger with Universal Fog, Inc., a U.S. publicly traded shell company (the Transaction). China Health HK is the acquirer in the Transaction, and the Transaction has been treated as a recapitalization of China Health US. After the Transaction and a 20:1 reverse stock split, Mr. Xin Sun owned 61,203,088 shares of common stock, representing 98.3% of the 62,234,737 total outstanding shares of common stock of China Health US. On April 7, 2009, Mr. Sun transferred 28,200,000 shares of common stock to 296 individuals, leaving him with 33,003,088 shares of common stock of China Health US, or approximately 53.03% of the total outstanding shares of common stock. Universal Fog, Inc. changed its name to China Health Industries Holdings, Inc. on February 19, 2009.\nOn November 22, 2013, Humankind completed the acquisition of Heilongjiang Huimeijia Pharmaceutical Co., Ltd. (HLJ Huimeijia) for a total purchase price of $16,339,869 (RMB100,000,000). HLJ Huimeijia was founded on October 30, 2003, and is engaged in the manufacturing and distribution of tincture, ointments, rubber paste (including hormones), topical solution, suppositories, liniment (including traditional Chinese medicine extractions), enemas and oral liquids. HLJ Huimeijias predecessor is Heilongjiang Xue Du Pharmaceutical Co., Ltd., which has established its brand name in the market through its supply of high quality medical products. HLJ Huimeijia is categorized as a high and new technology enterprise by the Science Technology Department in Heilongjiang Province. HLJ Huimeijia has 21 products which have been approved by, and have received approval numbers issued by, the National Medical Products Administration (the NMPA). In addition, HLJ Huimeijia is the holder of one patent for utility models, five patents for external design and three trademarks in China, including the Chinese brand name of Xue Du which has an established reputation among customers in northeastern China.\nOn December 24, 2014, Humankind entered into a stock transfer agreement (the Original Agreement) with Xiuzheng Pharmaceutical Group Co., Ltd. a company incorporated under the laws of the PRC and located in Jilin province (Xiuzheng Pharmacy or the Buyer), Mr. Xin Sun, the CEO of the Company, and Huimeijia, 99% owned by Humankind and 1% owned by Mr. Xin Sun. Pursuant to the Original Agreement, Humankind and Mr. Xin Sun (the Equity Holders), would sell their respective equity interests in Huimeijia to Xiuzheng Pharmacy.\nOn February 9, 2015, the four parties entered into a supplementary agreement (the Supplementary Agreement) to modify the terms of the Original Agreement, pursuant to which the Equity Holders and Huimeijia (collectively the Asset Transferors) would sell only the 19 drug approval numbers (including the tablet, capsule, powder, mixture, oral liquid, syrup and oral solution under the 19 approval numbers; licenses including the original copies of Business License, Organization Code Certificate, Tax Registration Certificate, Drug Production Permit and GMP Certificate, and other documents and original copies related to the production and operation of the 19 drugs) (the Assets) to Xiuzheng Pharmacy. The Equity Holders would have retained their equity interests in Huimeijia, but would have pledged such equity interests to Xiuzheng Pharmacy until the Assets were transferred, at which time the cash consideration would have been paid by the Buyer. Total cash consideration would have been the same as under the Original Agreement, i.e., RMB 8,000,000 (approximately $1,306,186) to the Asset Transferors. In the event that the Assets had failed to be transferred to the Buyer due to the fault of the Asset Transferors, the paid consideration would have been returned to the Buyer with interest accrued. If the failure of the transfer of the Assets were a result of changes in government policy or force majeure, the paid cash consideration would have been returned to the Buyer but without any interest.\nOn October 12, 2016, the four parties agreed to rescind the Supplementary Agreement and entered into a new supplementary agreement (the New Supplementary Agreement), pursuant to which the four parties agreed to execute the transfer of the equity interests based on the Original Agreement and the Equity Holders agreed to sell their respective equity interests in Huimeijia to Xiuzheng Pharmacy. The transfer of 100% of the equity interests of Huimeijia to the Buyer was for total cash consideration of RMB 8,000,000 (approximately $1,306,186) (the Purchase Price) to the Equity Holders. 40% of the Purchase Price was due within 10 business days after the signing of the New Supplementary Agreement; 40% of the Purchase Price was due within 10 business days after the completion of the changes in business registration described in the Original Agreement and Xiuzheng Pharmacy obtaining documents evidencing its ownership on Huimeijia; 15% of the Purchase Price is due within 10 business days after the transfer of all of the Assets is approved by Heilongjiang FDA; and 5% of the Purchase Price is due within 10 business days after all of the Assets have been transferred to Xiuzheng Pharmacy or its designee and Humankind and Mr. Xin Sun have instructed Xiuzheng Pharmacy complete three-batches production of all forms of the drugs included in the Assets. As of the date of this report, 80% of the Purchase Price has been paid, the Company has completed changes in its business registration, and Xiuzheng Pharmacy has obtained a business license issued by the local State Administration of Industry and Commerce in Harbin (Harbin SAIC) to Huimeijia, in which the ownership of Huimeijia has been recorded as held by Xiuzheng Pharmacy, with Harbin SAIC and the legal representative (a person that is authorized to take most of the corporate actions on behalf of a company under the corporate laws in China) of Huimeijia has been appointed by the Buyer.\nOn June 27, 2023 (the Signing Date), Harbin Humankind Biology Technology Co., Limited (Humankind), a wholly owned subsidiary of China Health Industries Holdings, Inc. (China Health), a corporation incorporated under the laws of the State of Delaware, entered into certain equity transfer agreements (collectively, the Agreements) with Mr. Xin Sun and Mr. Kai Sun (collectively, the Sellers). Pursuant to the Agreements, the Sellers agreed to transfer to Humankind 99% and 1% of the equity interests of Heilongjiang HempCan Pharmaceuticals Co., Ltd. (HempCan), for a consideration of RMB292,050,000 (approximately $40,275,537) and RMB2,950,000 (approximately $406,824) respectively, totaling RMB295 million (approximately $40,682,360) (collectively, the Purchase Prices). The Purchase Prices shall be fully paid to Sellers within 15 business days after the Signing Date, and the Sellers shall complete certain registration procedures, such as change of equity ownership and change of business registration within 15 business days after full Purchase Prices are received. If Humankind is late in paying the Purchase Prices, a 0.1% per day late penalty on the amount of Purchase Prices that is paid late shall be paid to the Sellers. Mr. Xin Sun is China Healths Chairman, sole director and sole executive officer and Mr. Kai Sun is Mr. Xin Suns younger brother.\nChina Health US, China Health HK, Humankind and HLJ Huimeijia are collectively referred herein to as the Company.\nAs of June 30, 2023, the Companys corporate structure was as follows:\nNote 2 - SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThis summary of significant accounting policies of the Company is presented to assist in understanding the Companys consolidated financial statements. The financial statements and notes are representations of the Companys management, which is responsible for their integrity and objectivity. These accounting policies conform to generally accepted accounting principles in the United States (US GAAP) and have been consistently applied in the preparation of the consolidated financial statements.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include China Health US and its four subsidiary companies, including China Health HK, Humankind and HLJ Huimeijia. All significant intercompany balances and transactions have been eliminated in consolidation and combination.\nOn November 22, 2013, China Health US, through its wholly owned subsidiary Humankind, completed the acquisition of HLJ Huimeijia. HLJ Huimeijia and Humankind are under the common control of Mr. Xin Sun, the CEO of the Company before and after the date of transfer. Humankinds accounting policy adopted the guidance in ASC 805-50-05-5 for the transfer of net assets between entities under common control to apply a method similar to the pooling-of-interests method. Under this method, the financial statements of Humankind shall report results of operations for the period in which the transfer occurs as though the transfer of net assets had occurred at the beginning of the period. Results of operations for that period will thus comprise both those of the previously separate entities combined from the beginning of the period to the date the transfer is completed and those of the combined operations from that date to the end of the period. Similarly, Humankind shall present the statements of financial position and other financial information as of the beginning of the period as though the assets and liabilities had been transferred at that date. Financial statements and financial information of Humankind presented for prior years also shall be retrospectively adjusted to furnish comparative information.\nSegment Reporting\nFASB ASC Topic 280, Segment Reporting, established standards for reporting information about operating segments on a basis consistent with the Companys internal organizational structure as well as information about geographical areas, business segments and major customers in financial statements for details on the Companys business segments. The Company has three reportable operating segments: Humankind, HLJ Huimeijia and Others. The segments are grouped based on the types of products provided.\nFair Value of Financial Instruments\nThe provisions of accounting guidance, FASB ASC Topic 820 that applies to the Company requires all entities to disclose the fair value of financial instruments, both assets and liabilities recognized and not recognized on the balance sheet, for which it is practicable to estimate fair value, and defines fair value of a financial instrument as the amount at which the instrument could be exchanged in a current transaction between willing parties.\nFair Value Measurements\nFASB ASC Topic 820, Fair Value Measurements and Disclosures, clarifies the definition of fair value for financial reporting, establishes a framework for measuring fair value and requires additional disclosures about the use of fair value measurements.\nVarious inputs are considered when determining the fair value of the Companys debt. The inputs or methodologies used for valuing securities are not necessarily an indication of the risk associated with investing in these securities. These inputs are summarized in the three broad levels listed below.\nLevel 1 - observable market inputs that are unadjusted quoted prices for identical assets or liabilities in active markets.\nLevel 2 - other significant observable inputs (including quoted prices for similar securities, interest rates, credit risk, etc.).\nLevel 3 - significant unobservable inputs (including the Companys own assumptions in determining the fair value of investments).\nThe carrying value of financial assets and liabilities recorded at fair value is measured on a recurring or nonrecurring basis. Financial assets and liabilities measured on a non-recurring basis are those that are adjusted to fair value when a significant event occurs. The Company had no financial assets or liabilities carried and measured on a nonrecurring basis during the reporting periods. Financial assets and liabilities measured on a recurring basis are those that are adjusted to fair value each time a financial statement is prepared. The Company had no financial assets or liabilities carried and measured on a recurring basis during the reporting periods.\nThe availability of inputs observable in the market varies from instrument to instrument and depends on a variety of factors including the type of instrument, whether the instrument is actively traded, and other characteristics particular to the transaction. For many financial instruments, pricing inputs are readily observable in the market, the valuation methodology used is widely accepted by market participants, and the valuation does not require significant management discretion. For other financial instruments, pricing inputs are less observable in the market and may require management judgment.\nForeign Currency Translation and Transaction\nHumankind, Huimeijia and HLJ Huimeijia maintain their books and accounting records in PRC currency Renminbi (RMB), which has been determined as the functional currency. The functional currency of China Health HK is the Hong Kong Dollar (HKD).\nTransactions denominated in currencies other than the functional currencies are recorded at the exchange rates prevailing on the date of the transactions, as quoted by the Federal Reserve Board. Foreign currency exchange gains and losses resulting from these transactions are included in operations.\nHumankind, Huimeijia, HLJ Huimeijia and China Health Hong Kongs financial statements are translated into the reporting currency, the United States Dollar (USD). Assets and liabilities of the above entities are translated at the prevailing exchange rate at each reporting period end date. Contributed capital accounts are translated using the historical rate of exchange when capital is injected. Income and expense accounts are translated at the average rate of exchange during the reporting period. Translation adjustments resulting from the translation of these financial statements are reflected as accumulated other comprehensive income in shareholders equity and non-controlling interests.\nFor the purpose of presenting these financial statements, the Companys assets and liabilities with functional currency of HKD are expressed in USD at the exchange rate on the balance sheet date, which was 7.8363 and 7.8472 as of June 30, 2023 and June 30, 2022, respectively; stockholders equity accounts are translated at historical rates, and income and expense items are translated at the weighted average exchange rates during the year, which was 7.8373 and 7.8049 for the years ended June 30, 2023 and 2022, respectively. For Renminbi currency, the Companys assets and liabilities are expressed in USD at the exchange rate on the balance sheet date, which was 7.2513 and 6.6981 as of June 30, 2023 and June 30, 2022, respectively; stockholders equity accounts are translated at historical rates, and income and expense items are translated at the weighted average exchange rates during the year, which was 6.9536 and 6.4554 for the years ended June 30, 2023 and 2022, respectively.\nStatement of Cash Flows\nIn accordance with Statement FASB ASC Topic 230, Statement of Cash Flows, cash flow from the Companys operations is calculated based upon the local currencies and translated to the reporting currency using an average foreign exchange rate for the reporting period. As a result, amounts related to assets and liabilities reported in the statement of cash flows will not necessarily agree with changes in the corresponding balances on the balance sheet.\nUse of Estimates and Assumptions\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and judgments that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities on the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. The Company bases its estimates and judgments on historical experience and on various other assumptions and information that are believed to be reasonable under the circumstances. Estimates and assumptions of future events and their effects cannot be perceived with certainty and, accordingly, these estimates may change as new events occur, as more experience is acquired, as additional information is obtained and as the Companys operating environment changes. Significant estimates and assumptions by management include, among others; useful lives of long-lived assets and intangible assets, valuation of inventory, accounts receivable and notes receivable, impairment analysis of long-lived assets, construction in progress, intangible assets and deferred taxes. While the Company believes that the estimates and assumptions used in the preparation of the financial statements are appropriate, actual results could differ from those estimates. Estimates and assumptions are periodically reviewed and the effects of revisions are reflected in the financial statements in the period they are determined to be necessary.\nCash and Cash Equivalents\nCash and cash equivalents include cash on hand, deposits in banks with maturities of three months or less, and all highly liquid investments which are unrestricted as to withdrawal or use, and which have original maturities of three months or less at the time of purchase.\nAs of June 30, 2023, and 2022, the Companys uninsured bank balance was mainly maintained at financial institutions located in the PRC and Hong Kong, totaled $47,246 and $44,789,999, respectively. The Company has no insured bank balance as of June 30, 2023 and 2022, respectively.\nAccounts Receivable\nAccounts receivable are recorded at the invoiced amount and do not bear interest. The Company extends unsecured credit to its customers in the ordinary course of business but mitigates the associated risks by performing credit checks and actively pursuing past due accounts. An allowance for doubtful accounts is established and determined based on managements assessment of known requirements, aging of receivables, payment and bad debt history, the customers current credit worthiness, changes in customer payment patterns and the economic environment. From November 1, 2013, the Company changed its credit policy by offering ninety (90) day payment terms for sales agents, whereas the payment terms for sales agents before November 1, 2013 were thirty (30) day. As of June 30, 2023 and 2022, the balances of accounts receivable were $nil and $9,567, respectively. The Company determines the allowance based on aging data, historical collection experience, customer specific facts and economic conditions. Account balances are charged off against the allowance after all means of collection have been exhausted and the potential for recovery is considered remote. The Company evaluated the nature of all accounts receivable then provided allowance for doubtful accounts. As of June 30, 2023, and 2022, the balances of allowance for doubtful accounts were $51,188 and $48,769 respectively.\nAdvance to Suppliers\nThe Company periodically makes advances to certain vendors for purchases of raw materials, or service providers for services relating to construction plans for our plant, equipment and production lines for the GMP upgrading, and records these payments as advance to suppliers. The decrease in the amount of advance to suppliers is due to fluctuation of exchange rate. As a result, as of June 30, 2023, and 2022, advance to suppliers amounted to $198,157 and $214,915, respectively.\nInventory\nInventory consists of raw materials, work in progress and finished goods of manufactured products.\nInventory is stated at lower of cost or market and consists of materials, labor and overhead. HLJ Huimeijia uses the weighted average method for inventory valuation. The other entities of the Company use the first-in, first-out (FIFO) method for inventory valuation. Overhead costs included in finished goods include direct labor cost and other costs directly applicable to the manufacturing process. The Company evaluates inventory for excess, slow moving, and obsolete inventory as well as inventory the value of which is in excess of its net realizable value. This evaluation includes analysis of sales levels by product and projections of future demand. If future demand or market conditions are less favorable than the Companys projections, a write-down of inventory may be required, and would be reflected in cost of goods sold in the period the revision is made. The inventory allowance with an amount of $nil and $nil were provided for the years ended June 30, 2023, and 2022, respectively.\nImpairment of Long-Lived Assets\nThe Companys long-lived assets and other assets are reviewed for impairment in accordance with the guidance of the FASB ASC Topic 360-10, Property, Plant, and Equipment, and FASB ASC Topic 205, Presentation of Financial Statements. The Company tests for impairment losses on long-lived assets used in operations whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable. Recoverability of an asset to be held and used is measured by a comparison of the carrying amount of the asset to the future undiscounted cash flows expected to be generated by the asset. If such asset is considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the asset exceeds its fair value. Impairment evaluations involve managements estimates on asset useful lives and future cash flows. Actual useful lives and cash flows could be different from those estimated by management which could have a material effect on the Companys reporting results and financial position. Fair value is determined through various valuation techniques including discounted cash flow models, quoted market values and third-party independent appraisals, as considered necessary. As of June 30, 2023, and 2022, the Company has not experienced impairment losses on its long-lived assets. However, there can be no assurances that demand for the Companys products or services will continue, which could result in an impairment of long-lived assets in the future.\nProperty, Plant and Equipment\nProperty, plant and equipment are stated at cost less accumulated depreciation and impairment losses. Maintenance, repairs and minor renewals are expensed as incurred, major renewals and improvements that extend the lives or increase the capacity of plant assets are capitalized.\nWhen assets are retired or disposed of, the cost and accumulated depreciation are removed from the accounts, and any resulting gains or losses are included in the results of operations in the reporting period of disposition.\nDepreciation is calculated on a straight-line basis over the estimated useful life of the assets. The depreciable lives applied are:\nBuilding, Warehouse and Improvements 20 to 30 years\nOffice Equipment 3 to 7 years\nVehicles 5 to15 years\nMachinery and Equipment 7 to 15 years\nIntangible Assets\nThe Company evaluates intangible assets in accordance with FASB ASC Topic 350, Intangibles - Goodwill and Other. Intangible assets deemed to have indefinite lives are not amortized, but are subject to annual impairment tests. If the assumptions and estimates used to allocate the purchase price are not correct, or if business conditions change, purchase price adjustments or future asset impairment charges could be required. The value of the Companys intangible assets could be impacted by future adverse changes such as: (i) any future declines in the Companys operating results, (ii) a decline in the valuation of technology, including the valuation of the Companys common stock, (iii) a significant slowdown in the worldwide economy, or (iv) any failure to meet the performance projections included in the Companys forecasts of future operating results. In accordance with FASB ASC Topic 350, the Company tests intangible assets for impairment on an annual basis or more frequently if the Company believes indicators of impairment exist. Impairment evaluations involve management estimates of asset useful lives and future cash flows. Significant judgment by management is required in the forecasts of future operating results that are used in the evaluations. It is possible, however, that the plans and estimates used may be incorrect. If the Companys actual results, or the plans and estimates used in future impairment analysis, are lower than the original estimates used to assess the recoverability of these assets, we could incur additional impairment charges in a future period. Based on such evaluations, there were no impairments recorded for intangible assets for the years ended June 30, 2023 and 2022, respectively.\nConstruction in Progress\nConstruction in progress represents the costs incurred in connection with the construction of buildings or new additions to the Companys plant facilities. Costs classified as construction in progress include all costs of obtaining the asset and bringing it to the location in the condition necessary for its intended use. No depreciation is provided for construction in progress until such time as the assets are completed and are placed into service.\nThe Company reviews the carrying value of construction in progress for impairment whenever events and circumstances indicate that the carrying value of an asset may not be recoverable from the estimated future cash flows expected to result from its use and eventual disposition. In cases where undiscounted expected future cash flows are less than the carrying value of the assets, an impairment loss is recognized equal to an amount by which the carrying value exceeds the fair value of the assets. The factors considered by Management in performing this assessment include current operating results, trends and prospects, the manner in which the property is used, and the effects of obsolescence, demand, competition and other economic factors. Based on this assessment, there were no impairments recorded for construction in progress, for the years ended June 30, 2023 and June 30, 2022, respectively. However, there can be no assurances that demand for the Companys products or services will continue, which could result in an impairment of long-lived assets in the future.\nRevenue Recognition\nThe Company recognizes revenue at the amount to which it expects to be entitled when control of the products or services is transferred to its customers based on any contract which has been identified. Control is generally transferred when the Company has a present right to payment and title and the significant risks and rewards of ownership of products or services are transferred to its customers while performance obligation are identified and completed. For most of the Companys products net sales, control transfers when products are shipped and transaction price are determined. The majority of the Companys revenue relates to the sale of inventory to customers, and revenue is recognized when control of the products or services is transferred to its customers that reflects the performance obligations are properly allocated and satisfied with transaction price determined. Given the nature of the Companys business and the applicable rules guiding revenue recognition, the Companys revenue recognition practices do not contain estimates that materially affect the results of operations. The Company records revenue at the discounted selling price and allows its customers to return products for exchange or credit subject to certain limitations. A provision for such returns is recorded based upon historical experience. There has been no provision recorded for returns based upon historical experience for the years ended June 30, 2023 and 2022, respectively.\nCost of Goods Sold\nCost of goods sold consists primarily of the costs of raw materials, freight charges, direct labor, depreciation of plants and machinery, warehousing and overhead costs associated with the manufacturing process and commission expenses.\nIncome Taxes\nThe Company adopts FASB ASC Topic 740, Income Taxes, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns. Under this method, deferred income taxes are recognized for the tax consequences in future years of differences between the tax bases of assets and liabilities and their financial reporting amounts at each period end based on enacted tax laws and statutory tax rates applicable to the periods in which the differences are expected to affect taxable income. A valuation allowance is established for deferred tax assets if it is more likely than not that these items will either expire before the Company is able to realize the benefits or that future deductibility is uncertain.\nUnder ASC 740, a tax position is recognized as a benefit only if it is more likely than not that the tax position would be sustained in a tax examination, with a tax examination being presumed to occur. The evaluation of a tax position is a two-step process. The first step is to determine whether it is more-likely-than-not that a tax position will be sustained upon examination, including the resolution of any related appeals or litigations based on the technical merits of that position. The second step is to measure a tax position that meets the more-likely-than-not threshold to determine the amount of benefit to be recognized in the financial statements. A tax position is measured at the largest amount of benefit that is greater than 50 percent likely of being realized upon ultimate settlement. Tax positions that previously failed to meet the more-likely-than-not recognition threshold should be recognized in the first subsequent period in which the threshold is met. Previously recognized tax positions that no longer meet the more-likely-than-not criteria should be de-recognized in the first subsequent financial reporting period in which the threshold is no longer met. Penalties and interest incurred related to underpayment of income tax are classified as income tax expense in the year incurred. GAAP also provides guidance on de-recognition, classification, interest and penalties, accounting in interim periods, disclosures and transition.\nAs a result of the implementation of FIN 48 (ASC 740-10), the Company undertook a comprehensive review of its portfolio of tax positions in accordance with recognition standards established by FIN 48 (ASC 740-10). The Company recognized no material adjustments to liabilities or shareholders equity as a result of the implementation. The adoption of FIN 48 did not have a material impact on the Companys financial statements.\nThe application of tax laws and regulations is subject to legal and factual interpretation, judgment and uncertainty. Tax laws and regulations themselves are subject to change as a result of changes in fiscal policy, changes in legislation, the evolution of regulations and court rulings. Therefore, the actual liability may be materially different from the Companys estimates, which could result in the need to record additional tax liabilities or potentially reverse previously recorded tax liabilities or deferred tax asset valuation allowance.\nEnterprise Income Tax\nUnder the Provisional Regulations of PRC Concerning Income Tax on Enterprises promulgated by the PRC (the EIT Law), income tax is payable by enterprises at a rate of 25% of their taxable income.\nValue Added Tax\nThe Provisional Regulations of the PRC Concerning Value Added Tax promulgated by the State Council came into effect on January 1, 1994 and revised on January 1, 2009. Under these regulations and the Implementing Rules of the Provisional Regulations of the PRC Concerning Value Added Tax, value added tax (VAT) is imposed on goods sold in, or imported into, the PRC and on processing, repair and replacement services provided within the PRC.\nVAT payable in the PRC is charged on an aggregated basis at a rate of 13% or 16% (depending on the type of goods involved) on the full price collected for the goods sold or, in the case of taxable services provided, at a rate of 16% on the charges for the taxable services provided, but excluding, in respect of both goods and services, any amount paid in respect of VAT included in the price or charges, and less any deductible VAT already paid by the taxpayer on purchases of goods and services in the same financial year. As of June 30, 2023 and June 30, 2022, VAT payables were $37,119 and $29,835, respectively.\nSales-Related Taxes\nPursuant to the tax law and regulations of the PRC, the Company is obligated to pay 7% and 5% of the annual aggregate VAT paid by the Company as taxes for the purposes of maintaining and building cities and educational facilities, which fees are included as sales-related taxes. Sales-related taxes are recorded when sales revenue is recognized.\nConcentrations of Business and Credit Risks\nAll of the Companys manufacturing is located in the PRC. There can be no assurance that the Company will be able to successfully continue to manufacture its products and failure to do so would have a material adverse effect on the Companys financial position, results of operations and cash flows. Moreover, the success of the Companys operations is subject to numerous contingencies, some of which are beyond managements control. These contingencies include general economic conditions, prices of raw materials, competition, governmental and political conditions, and changes in regulations. Since the Company is dependent on trade in the PRC, the Company is subject to various additional political, economic and other uncertainties. Among other risks, the Companys operations will be subject to the risks of restrictions on transfer of funds, domestic customs, changing taxation policies, foreign exchange restrictions, and political and governmental regulations. The Company operates in China, which may give rise to significant foreign currency risks from fluctuations and the degree of volatility of foreign exchange rates between U.S. dollars and the Chinese currency RMB. The results of operations denominated in foreign currency are translated at the average rate of exchange during the reporting periods.\nEarnings Per Share\nBasic earnings per common share is computed by dividing net earnings applicable to common shareholders by the weighted-average number of common shares outstanding during the period. When applicable, diluted earnings per common share is determined using the weighted-average number of common shares outstanding during the period, adjusted for the dilutive effect of common stock equivalents, consisting of shares that might be issued upon exercise of common stock options and warrants. For the years ended June 30, 2023 and 2022, the Company had no potential dilutive common stock equivalents outstanding.\nPotential common shares issued are calculated using the treasury stock method, which recognizes the use of proceeds that could be obtained upon the exercise of options and warrants in computing diluted earnings per share. It assumes that any proceeds would be used to purchase common stock at the average market price of the common stock during the period.\nFASB ASC Topic 260, Earnings Per Share, requires a reconciliation of the numerator and denominator of the basic and diluted earnings per share (EPS) computations.\nRecent Accounting Pronouncements\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments-Credit Losses (Topic 326) - Measurement of Credit Losses on Financial Instruments (ASU 2016-13). The main objective of the standard is to provide financial statement users with more decision-useful information about the expected credit losses on financial instruments and other commitments to extend credit held by a reporting entity at each reporting date. In issuing this standard, the FASB is responding to criticism that todays guidance delays recognition of credit losses. The standard will replace todays incurred loss approach with an expected loss model. The new model, referred to as the current expected credit loss (CECL) model, will apply to: (1) financial assets subject to credit losses and measured at amortized cost, and (2) certain off-balance sheet credit exposures. The standard is applicable to loans, accounts receivable, trade receivables, and other financial assets measured at amortized cost, loan commitments and certain other off-balance sheet credit exposures, debt securities (including those held-to-maturity) and other financial assets measured at fair value through other comprehensive income, and beneficial interests in securitized financial assets. The CECL model does not apply to available-for-sale debt securities. For available-for-sale debt securities with unrealized losses, entities will measure credit losses in a manner similar to what they do today, except that the credit losses will be recognized as allowances rather than reductions in the amortized cost of the securities. Accordingly, the new methodology will be utilized when assessing the Companys financial instruments for impairment. As a result, entities will recognize improvements to estimated credit losses immediately in earnings rather than as interest income over time, as they do today. The ASU also simplifies the accounting model for purchased credit-impaired debt securities and loans. ASU 2016-13 also expands the disclosure requirements regarding an entitys assumptions, models, and methods for estimating the allowance for loan and lease losses. ASU 2016-13 is effective for years beginning after December 15, 2019, including interim periods within those fiscal years under a modified retrospective approach. Early adoption is permitted for the periods beginning after December 15, 2018. The Company adopted the guidance from July 1, 2020. The Company finalized its analysis and determined that the adoption of this guidance has no material impact on the Companys consolidated financial statements and its internal controls over financial reporting.\nIn August 2018, the FASB issued ASU 2018-13, Fair Value Measurement (Topic 820) - Disclosure Framework - Changes to the Disclosure Requirements for Fair Value Measurement (ASU 2018-13), which modifies the disclosure requirements on fair value measurements, including removing the requirement to disclose (1) the amount of and reasons for transfers between Level 1 and Level 2 of the fair value hierarchy, (2) the policy for timing of transfers between levels and (3) the valuation processes for Level 3 fair value measurements. ASU 2018-13 also added new disclosures including the requirement to disclose (a) the changes in unrealized gains and losses for the period included in other comprehensive income for recurring Level 3 fair value measurements held at the end of the reporting period and (b) the range and weighted average of significant unobservable inputs used to develop Level 3 fair value measurements. ASU 2018-13 is effective for fiscal years (and interim reporting periods within those years) beginning after December 15, 2019 and early adoption is permitted. This standard will only impact the disclosures pertaining to fair value measurements. The Company adopted the guidance from July 1, 2020. The Company finalized its analysis and determined that the adoption of this guidance has no material impact on the Companys consolidated financial statements and its internal controls over financial reporting.\nNOTE 3 - ASSETS SALE\nOn December 24, 2014, Humankind entered into a stock transfer agreement (the Agreement) with Xiuzheng Pharmaceutical Group Co., Ltd a company incorporated under the laws of the Peoples Republic of China and located in Jilin province (Xiuzheng Pharmacy or the Buyer), and Mr. Xin Sun, the CEO of the Company, and Huimeijia, pursuant to which, Humankind and Mr. Xin Sun (the Equity Holders), shall sell their respective equity interests in Huimeijia to Xiuzheng Pharmacy. The transfer of the 100% equity interests of Huimeijia to the Buyer was for a total cash consideration of RMB 8,000,000 (approximately $1,306,186) to the Equity Holders.\nOn February 9, 2015, the four parties entered into a supplementary agreement (the Supplementary Agreement) to modify the terms of the Agreement, pursuant to which, the Equity Holders and Huimeijia (collectively the Assets Transferors) shall only sell the 19 drug approval numbers (including the tablet, capsule, powder, mixture, oral liquid, syrup and oral solution under the 19 approval numbers; licenses including the original copies of Business License, Organization Code Certificate, Tax Registration Certificate, Drug Production Permit and GMP Certificate, and other documents and original copies related to the production and operation of the 19 drugs) (the Assets) to Xiuzheng Pharmacy. The Equity Holders will retain the equity interests in Huimeijia, but will have the equity interests pledged to Xiuzheng Pharmacy until the Assets are transferred, at which time all the cash consideration shall be paid by the Buyer. The total cash consideration remains to be the same as under the Agreement, i.e., RMB 8,000,000 (approximately $1,306,186) to the Assets Transferors. In the event that the Assets are failed to be transferred to the Buyer due to the fault of the Assets Transferors, the paid consideration shall be returned to the Buyer with interests accrued. If the failure of the transfer of the Assets is a result of the government policy changes or force majeure, the paid cash consideration shall be returned to the Buyer but without any interests.\nAs of June 30, 2016, the transfer of the Assets had not been completed because the assets transfer crossed different provinces which resulted in a complicated interaction among the local administrations of Heilongjiang Province, where Huimeijia is located and Jilin Province, where the transferee is located.\nOn October 12, 2016, the four parties agreed to rescind the Supplementary Agreement and entered into a new supplementary agreement (the New Supplementary Agreement), pursuant to which the four parties agreed to execute the transfer of the equity interests based on the Original Agreement and the Equity Holders agreed to sell their respective equity interests in Huimeijia to Xiuzheng Pharmacy. The transfer of 100% of the equity interests of Huimeijia to the Buyer was for a total cash consideration of RMB 8,000,000 (approximately $1,306,186) (the Purchase Price) to the Equity Holders. 40% of the Purchase Price was due within 10 business days after the signing of the New Supplementary Agreement; 40% of the Purchase Price was due within 10 business days after the completion of the changes in business registration described in the Original Agreement and Xiuzheng Pharmacy obtaining documents evidencing its ownership on Huimeijia; 15% of the Purchase Price is due within 10 business days after the transfer of all of the Assets is approved by Heilongjiang FDA; and 5% of the Purchase Price is due within 10 business days after all of the Assets have been transferred to Xiuzheng Pharmacy or its designee and Humankind and Mr. Xin Sun have instructed Xiuzheng Pharmacy to complete three-batches production of all forms of the drugs included in the Assets. As of the date of this report, 80% of the Purchase Price has been paid, the Company has completed changes in its business registration, and Xiuzheng Pharmacy has obtained a business license issued by the local State Administration of Industry and Commerce in Harbin (Harbin SAIC) to Huimeijia, in which the ownership of Huimeijia has been recorded as held by Xiuzheng Pharmacy, with Harbin SAIC and the legal representative (a person that is authorized to take most of the corporate actions on behalf of a company under the corporate laws in China) of Huimeijia has been appointed by the Buyer.\nOn June 27, 2023 (the Signing Date), Harbin Humankind Biology Technology Co., Limited (Humankind), a wholly owned subsidiary of China Health Industries Holdings, Inc. (China Health), a corporation incorporated under the laws of the State of Delaware, entered into certain equity transfer agreements (collectively, the Agreements) with Mr. Xin Sun and Mr. Kai Sun (collectively, the Sellers). Pursuant to the Agreements, the Sellers agreed to transfer to Humankind 99% and 1% of the equity interests of Heilongjiang HempCan Pharmaceuticals Co., Ltd. (HempCan), for a consideration of RMB292,050,000 (approximately $40,275,537) and RMB2,950,000 (approximately $406,824) respectively, totaling RMB295 million (approximately $40,682,360) (collectively, the Purchase Prices). The Purchase Prices shall be fully paid to Sellers within 15 business days after the Signing Date, and the Sellers shall complete certain registration procedures, such as change of equity ownership and change of business registration within 15 business days after full Purchase Prices are received. If Humankind is late in paying the Purchase Prices, a 0.1% per day late penalty on the amount of Purchase Prices that is paid late shall be paid to the Sellers. Mr. Xin Sun is China Healths Chairman, sole director and sole executive officer and Mr. Kai Sun is Mr. Xin Suns younger brother.\nNOTE 4 - ACCOUNTS RECEIVABLE\nThe Companys accounts receivable amounted to $nil and $9,567 net of allowance for doubtful accounts amounting to $51,188 and $48,769 as of June 30, 2023 and 2022, respectively.\nNOTE 5 - INVENTORIES\nInventory consists of following:\nJune 30,\nJune 30,\nRaw Materials $ 1,769 $ 213,055\nSupplies and Packing Materials -\n90,303\nWork-in-Progress -\n82,412\nFinished Goods 135,459\nSelf-made semi finished goods 38,264 -\nTotal $ 40,608 $ 521,229\nThe decrease in raw materials is mainly due to the destruction of expired materials and the sale of hemp seeds.The inventory allowance with an amount of $nil and $nil were provided for the years ended June 30, 2023 and 2022, respectively. The decrease in raw materials is mainly due to the destruction of expired raw materials.\nNOTE 6 - CONSTRUCTION IN PROGRESS\nConstruction in progress consisted of the following:\nJune 30,\nJune 30,\nPlant - HLJ Huimeijia $ 420,092 $ 579,402\nTotal $ 420,092 $ 579,402\nOn April 6, 2012, HLJ Huimeijia entered into an agreement with a contractor for construction of the HLJ Huimeijia plant. The estimated total cost of construction was approximately $1.86 million (RMB12,800,000). As of June 30, 2023, 71.36% of construction has been completed, $1,259,608 (RMB9,133,796) has been recorded as costs of construction in progress and construction in progress at an amount of $724,409 (RMB5,252,904) has been completed and converted into property, plant and equipment.\nNOTE 7 - PROPERTY, PLANTS AND EQUIPMENT\nProperty, plants and equipment consisted of the following:\nJune 30,\nJune 30,\nBuilding, Warehouses and Improvements $ 3,768,300 $ 3,946,492\nMachinery and Equipment 1,693,740 1,832,446\nOffice Equipment 72,382 78,360\nVehicles 75,117 217,808\nOthers 889,225 962,667\nLess Accumulated Depreciation (3,771,594 ) (3,879,752 )\nTotal $ 2,727,170 $ 3,158,021\nDepreciation expense was $332,057 and $344,919 for the years ended June 30, 2023 and 2022, respectively. Depreciation expense charged to operations was $202,889 and $344,919 for the years ended June 30, 2023 and 2022, respectively. Depreciation expense charged to cost of goods sold was $nil and $nil for the years ended June 30, 2023 and 2022, respectively.\nNOTE 8 - INTANGIBLE ASSETS\nThe following is a summary of intangible assets:\nJune 30,\nJune 30,\nLand Use Rights - Humankind $ 874,048 $ 946,237\nHealth Supplement Product Patents - Humankind 4,137,188 4,478,882\nPharmaceutical Patents - HLJ Huimeijia 360,511 390,285\nLand Use Rights - HLJ Huimeijia 597,836 647,211\nLess: Accumulated Amortization (5,004,808 ) (5,050,012 )\nIntangible Assets, net, Held for Continuing Operations $ 964,775 $ 1,412,603\nThere is no private land ownership in PRC Enterprises and individuals can pay the government a fee to obtain the right to use a piece of land for commercial purposes or residential purposes for an initial period of 50 years or 70 years, respectively. The land use right can be sold, purchased, and exchanged in the market. The successor owner of the land use right will have the right to use the land for the time remaining on the initial period. The patent has amortized life of 10 years.\nAmortization expense charged to operations was $354,619 and $485,625 for the years ended June 30, 2023 and 2022, respectively.\nNOTE 9 - RELATED PARTY DEBTS\nRelated party debts, which represent temporary short-term loans from Mr. Xin Sun and Mr. Kai Sun consisted of the following:\nJune 30,\nJune 30,\nMr. Xin Sun $ 5,121,776 $ 6,724,850\nMr. Kai Sun 32,248 34,911\nRelated Party Debts, Held for Continuing Operations $ 5,154,024 $ 6,759,761\nThese loans are unsecured and non-interest bearing and have no fixed terms of repayment; therefore, they are deemed payable on demand. Mr. Kai Sun, a director of Humankind, is a PRC citizen and a family member of Mr. Xin Sun, the CEO of the Company.\nNOTE 10 - INCOME TAXES\n(a) Corporate income taxes\nChina Health US was incorporated in the State of Arizona on July 11, 1996. After the Company had acquired the business of China Health HK through the acquisition of all the share capital of China Health HK under a share exchange agreement dated December 31, 2008, it became a holding company and did not conduct any substantial operations or business of its own in the State of Delaware and in the U.S.\nThe Company also does not provide for U.S. taxes or foreign withholding taxes on undistributed earnings from its non-U.S. subsidiaries, either owned directly or indirectly, because it was elected to indefinitely reinvest such earnings outside the U.S to support non-U.S. liquidity needs to fund operations and growth of its foreign subsidiaries and acquisitions.\nUnited States\nChina Health US had no taxable income for U.S. corporate income tax purposes for the years ended June 30, 2023 and 2022, respectively. As of June 30, 2023 and 2022, China Health US had $1,470,989 and $1,793,042 in net operating loss carry forwards available to offset future taxable income, respectively. The federal corporate net operating loss carryover is expired in 20 taxable years following the taxable year of the loss. If not utilized, the federal net operating loss for the fiscal years 2023 and 2022 in an amount of $322,053 and $223,833, respectively, will begin to expire in the years 2042 and 2041, respectively. Management believes that it is more likely than not that the benefits from these accumulated net operating losses will not be realized in the future due to the Companys operating history and the continued losses of its U.S. operation. Accordingly, the Company has provided a full valuation allowance on the deferred tax assets under its U.S. entity.\nHong Kong\nChina Health Industries Holdings Limited (China Health HK) was incorporated in Hong Kong on July 20, 2007 and is subject to Hong Kong profits taxation on its business activities conducted in Hong Kong and income sourced in Hong Kong. As of June 30, 2023, and 2022, China Health Hong Kong had $10,646 and $11,030 in net operating loss carry forwards available to offset future taxable income, respectively. Net operating losses of Hong Kong can generally be carried forward indefinitely. The Company believes that it is more likely than not that these accumulated net operating losses will not be utilized in the future due to the fact that the Company does not have and probably will not have any business operations in HK. Therefore, the Company had provided full valuation allowance for the deferred tax assets arising from the losses in Hong Kong during the years ended June 30, 2023, and 2022, amounting $384 and $441, respectively. Accordingly, there is no net deferred tax assets under this entity.\nPeoples Republic of China\nUnder the EIT Law, the standard EIT rate is 25%. The PRC subsidiaries of the Company are subject to PRC income taxes on an entity basis on income arising in or derived from the tax jurisdiction in which they operate.\nThe provision for income taxes consisted of the following for the years ended June 30, 2023 and 2022:\nAs of June 30, 2023, and 2022, taxes payable consists of:\nJune 30,\nJune 30,\nIncome tax payable $ 22,020 $ 23,839\nValue-added tax payable 37,119 29,835\nOther taxes payable 78,446 79,331\nTotal $ 137,585 $ 133,005\nA reconciliation between the Companys actual provision for income taxes and the provision at the statutory rate is as follows:\nJune 30,\nJune 30,\nPre-tax book income $ (408,772 ) $ (351,016 )\nFederal statutory rate 21 % 21 %\nIncome tax computed at U.S. federal statutory rate (85,842 ) (73,714 )\nNon-deductible staff welfare -\n-\nForeign rate differential 175,725 (7,874 )\nChange in valuation allowance (89,883 ) 84,522\nTotal provision for income taxes $ -\n$ 2,934\nThe Companys effective tax rate was nil and 0.8% for the years ended June 30, 2023 and 2022, respectively.\nThe provision for income taxes on income consists of the following for the years ended June 30, 2023 and 2022:\nProvision for income taxes consisted of:\nFor the Years Ended\nJune 30,\nCurrent provision:\nDomestic $ -\n$ -\nForeign -\n-\nTotal current provision -\n-\nDeferred provision: - -\nDomestic -\n-\nForeign -\n2,934\nTotal deferred provision -\n2,934\nTotal provision for income taxes $ -\n$ 2,934\nSignificant components of deferred tax assets were as follows:\nJune 30,\nJune 30,\nDeferred tax assets\nNet operating loss carry forward $ 1,007,658 $ 1,096,936\nAllowance for doubtful accounts (12,797 ) (12,192 )\nValuation allowance (994,861 ) (1,084,744 )\nDeferred tax assets, net $ -\n$ -\n(b) Uncertain tax positions\nThere were no unrecognized tax benefits as of June 30, 2023 and 2022, respectively. Management does not anticipate any potential future adjustments in the next twelve months which would result in a material change to its tax positions. There was no interests and penalties arising from its tax payments for the years ended June 30, 2023.\nNOTE 11 - EARNINGS PER SHARE\nBasic earnings per common share is computed by dividing net earnings applicable to common shareholders by the weighted-average number of common shares outstanding during the period. When applicable, diluted earnings per common share is determined using the weighted-average number of common shares outstanding during the period, adjusted for the dilutive effect of common stock equivalents, consisting of shares that might be issued upon exercise of common stock options and warrants.\nPotential common shares issued are calculated using the treasury stock method, which recognizes the use of proceeds that could be obtained upon the exercise of options and warrants in computing diluted earnings per share. It assumes that any proceeds would be used to purchase common stock at the average market price of the common stock during the period.\nFASB ASC Topic 260, Earnings Per Share, requires a reconciliation of the numerator and denominator of the basic and diluted earnings per share (EPS) computations.\nFor the years ended June 30, 2023, and 2022, the Company does not have potential dilutive shares. The following table sets forth the computation of basic and diluted net income per share:\nFor the Years Ended\nJune 30, June 30,\nNet loss $ (408,772 ) $ (353,950 )\nNet income/(loss) per share:\nNet loss per share Basic & diluted\n$ (0.0062 ) $ (0.0054 )\nWeighted average shares outstanding:\nBasic & diluted\n65,539,737 65,539,737\nNOTE 12 - COMMITMENTS AND CONTINGENCIES\nThe Companys assets are located in the PRC and revenues are derived from operations in the PRC.\nIn terms of industry regulations and policies, the economy of the PRC has been transitioning from a planned economy to market oriented economy. Although in recent years the Chinese government has implemented measures emphasizing the utilization of market forces for economic reforms, the reduction of state ownership of productive assets and the establishment of sound corporate governance in business enterprises, a substantial portion of productive assets in the PRC is still owned by the Chinese government. For example, there is no private land ownership in PRC and all land is leased by government to business entities or individuals through the governments granting of Land Use Rights. The granting process is typically based on government policies at the time of granting and can be lengthy and complex. This process may adversely affect the Companys future manufacturing expansions. The Chinese government also exercises significant control over the PRCs economic growth through the allocation of resources and providing preferential treatment to particular industries or companies. Uncertainties may arise with changing of governmental policies and measures.\nThe Company faces a number of risks and challenges not typically associated with companies in North America and Western Europe, since its assets exist solely in the PRC, and its revenues are derived from its operations therein. The PRC is a developing country with an early stage market economic system, overshadowed by the state. Its political and economic systems are very different from the more developed countries and are in a state of change. The PRC also faces many social, economic and political challenges that may produce major shocks, instabilities and even crises, in both its domestic arena and in its relationships with other countries, including the United States. Such shocks, instabilities and crises may in turn significantly and negatively affect the Companys performance.\nThe Company had no rental commitment as of June 30, 2023.\nNOTE 13 - MAJOR SUPPLIERS AND CUSTOMERS\nFor the year ended June 30, 2023, the Company had five raw material suppliers,of which the largest proportion was the supplier of health products, with a purchase amount of $68,803, accounting for 97%. For the year ended June 30, 2022, the Company had no suppliers due to its being temporarily out of production.\nFor the year ended June 30, 2023, the Company had three customers that in aggregate accounted for 100% of the Companys total sales, with each customer accounting for 63%, 33%, and 4%, respectively. For the year ended June 30, 2022, the Company had no customers due to the enterprise Transformation and the COVID-19 resurgence.\nNOTE 14 - SEGMENT REPORTING\nThe Company was organized into three main business segments based on the types of products being provided to customers: HLJ Huimeijia, Humankind and others. Each of the three operating segments referenced above has separate and distinct general ledgers. The chief operating decision maker (CODM) receives financial information, including revenue, gross margin, operating income, and net income produced from the various general ledger systems to make decisions about allocating resources and assessing performance; however, the principal measure of segment profitability or loss used by the CODM is net income or loss by segment.\nThe following tables present summary information by segment for the years ended June 30, 2023 and 2022, respectively:\nFor the Year Ended\nJune 30, 2023\nFor the Year Ended\nJune 30, 2022\nHLJ\nConsolidated HLJ\nConsolidated\nHuimeijia Humankind Others operations Huimeijia Humankind Others operations\nRevenues $ -\n$ 111,597 $ -\n$ 111,597 $ 267 $ -\n$ -\n$ 267\nCost of revenues -\n111,359 -\n111,359 1,748 -\n-\n1,748\nGross profit (loss) -\n-\n(1,481 ) -\n-\n(1,481 )\nInterest income 113,201 113,615 157,536 157,860\nInterest expense -\n-\n-\n-\n-\n-\n-\n-\nDepreciation and amortization 74,972 482,536 -\n557,508 60,962 650,553 -\n711,515\nIncome tax -\n-\n-\n-\n-\n2,934 -\n2,934\nNet income (loss) 525,522 (611,857 ) (322,437 ) (408,772 ) 509,990 (637,666 ) (226,274 ) (353,950 )\nTotal capital expenditures -\n-\n-\n-\n-\n-\n-\n-\nTotal assets $ 2,178,524 $ 42,874,722 $ 29,083 $ 45,082,329 $ 2,994,826 $ 47,724,803 $ 27,889 $ 50,747,518\nNOTE 15 - SUBSEQUENT EVENTS\nThe Company has evaluated subsequent events from the balance sheet date through the date the financial statements were issued and determined that there are no additional items required to disclose. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nWe maintain a set of disclosure controls and procedures designed to ensure that information required to be disclosed by us in our reports filed under the Securities Exchange Act, is recorded, processed, summarized and reported within the time periods specified by the SECs rules and forms. Disclosure controls are also designed with the objective of ensuring that this information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nBased upon their evaluation as of the end of the periods covered by this report, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were not effective to satisfy the objectives, due to the material weakness in our internal control over financial reporting discussed below.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control system was designed to provide reasonable assurance to our management and our sole board member regarding the preparation and fair presentation of published financial statements.\nOur management assessed the effectiveness of our internal control over financial reporting as of June 30, 2023. In making this assessment, it used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in 2013 in Internal Control-Integrated Framework. Our management has implemented and tested our internal control over financial reporting based on these criteria and did not identify any significant deficiencies and material weaknesses as of June 30, 2023. However, based on the fact that we do not have any full-time accounting personnel who have U.S. GAAP experience, our management has considered this as a material weakness and determined that as of June 30, 2023, the internal control over financial reporting was not effective.\nIn an effort to remedy this material weakness in the future, we intend to do the following:\n● Develop a comprehensive training and development plan, for our finance, accounting and internal audit personnel, including our Chief Financial Officer, Financial Manager, and others, in the principles and rules of U.S. GAAP, SEC reporting requirements and the application thereof.\n● Design and implement a program to provide ongoing company-wide training regarding the Companys internal controls, with particular emphasis on our finance and accounting staff.\n● Implement an internal review process over financial reporting to review all recent accounting pronouncements and to verify that the accounting treatment identified in such report have been fully implemented and confirmed by our internal control department. In the future, we will continue to improve our ongoing review and supervision of our internal control over financial reporting.\n● Hire an individual that possesses the requisite U.S. GAAP experience and education.\nDespite the material weakness reported above, our management believes that our consolidated financial statements included in this report fairly present in all material respects our financial condition, results of operations and cash flows for the periods presented.\nThis report does not include an attestation report of our registered accounting firm regarding internal control over financial reporting. The managements report was not subject to attestation by our registered public accounting firm because we are a smaller reporting company.\nChanges in Internal Control over Financial Reporting\nNo changes in our internal control over financial reporting have come to managements attention during our last fiscal year that have materially affected, or are likely to materially affect, our internal control over financial reporting.\nLimitations on Controls\nManagement does not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all error and fraud. Any control system, no matter how well designed and operated, is based upon certain assumptions and can provide only reasonable, not absolute, assurance that its objectives will be met. Further, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, within the Company have been detected. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNone.\nPart III Item 10. Directors, Executive Officers and Corporate Governance.\nThe following table sets forth information regarding our sole board member and executive officer. Our sole director holds office until the election and qualification of his successor.\nName\nAge\nPosition\nXin Sun\nChairman (sole director), Chief Executive Officer, Chief Financial Officer and Treasurer\nBiography\nMr. Xin Sun, age 57, has been serving as our Chairman of Board of Directors, Chief Executive Officer and Chief Financial Officer since 2009. From 1988 to 1991, he was the Production Manager at Ha Yao Group Sanchine Medicine Joint-Stock Company Ltd. From 1991 to 1994, he was the District Director for the Northeast District of China for Pfizer Pharmaceuticals Limited. Thereafter, he spent one year as the Director of Marketing for Ha Yao Group Sanchine Medicine Joint-Stock Company Ltd. From 1996 to 2002, he was the Chief Executive Officer of a company he founded, Heilongjiang Bijie Chemical Industry Co., Ltd., which is no longer in existence. From 2003 to the present, he has been the President and Chief Executive Officer of Humankind. Mr. Sun is also President and General Manager of Huimeijia. Mr. Xin Sun attended Jia Mu Si Medical College with a major in Pharmacy from 1984 to 1988. He obtained his Masters of Business Administration from Renmin University of China in 2004. Mr. Sun attended the Doctor of Business Administration program in Business Institute of Pennsylvania since September 2018 and received a doctors degree in 2019.\nAs a result of his professional experience, Mr. Xin Sun is well known in the pharmaceutical field in Harbin, PRC. While he was studying at Renmin University, Mr. Xin Sun developed many contacts in the pharmaceutical field, many of which later became district agents and other employees in Humankinds distribution system.\nOur sole director, Mr. Xin Sun, does not hold any directorships in other reporting companies and does not qualify as an independent director under the Rules of NASDAQ, Marketplace Rule 4200(a)(15).\nTo our knowledge, during the last ten years, none of our directors and executive officers (including those of our subsidiaries) have:\n(a) had a bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time.\n(b) been convicted in a criminal proceeding or been subject to a pending criminal proceeding, excluding traffic violations and other minor offenses.\n(c) been subject to any order, judgment or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities.\n(d) been found by a court of competent jurisdiction (in a civil action), the SEC, or the Commodities Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended or vacated.\nDirector Qualifications\nDirectors are responsible for overseeing the Companys business consistent with their fiduciary duty to the shareholders. This significant responsibility requires highly-skilled individuals with various qualities, attributes and professional experience. Our sole director believes that there are general requirements for service on the Board that are applicable to all directors and that there are other skills and experience that should be represented on the Board as a whole but not necessarily by each director. The existing board member considers the qualifications of director and director candidates individually and in the broader context of the Boards overall composition and the Companys current and future needs.\nQualifications for All Directors\nIn its assessment of each potential candidate, including those recommended by the shareholders, the Board will consider the nominees judgment, integrity, experience, independence, understanding of the Companys business or other related industries and such other factors it determines are pertinent in light of the current needs of the Board.\nThe Board also takes into account the ability of a director to devote the time and effort necessary to fulfill his or her responsibilities to the Company.\nThe Board requires that each director be a recognized person of high integrity with a proven record of success in his or her field. Each director must demonstrate innovative thinking, familiarity with and respect for corporate governance requirements and practices, an appreciation of multiple cultures and a commitment to sustainability and to dealing responsibly with social issues. In addition to the qualifications required of all directors, the Board conducts interviews of potential director candidates to assess intangible qualities including the individuals ability to ask difficult questions and, simultaneously, to work collegially. The Board does not have a specific diversity policy, but considers diversity of race, ethnicity, gender, age, cultural background and professional experiences in evaluating candidates for Board membership. Diversity is important because a variety of points of view contribute to a more effective decision-making process.\nQualifications, Attributes, Skills and Experience to be Represented on the Board as a Whole\nThe Board has identified particular qualifications, attributes, skills and experiences that should be represented on the Board as a whole, in light of the Companys current needs and its business priorities. The Board believes that it should include some directors with a high level of financial literacy and some directors who possess relevant business experiences as a chief executive officer, president or similar position at a company. Marketing is the core focus of our business and the Company seeks to develop and deploy innovative and effective marketing and technology. Therefore, the Board believes that marketing and technology experience should be represented on the Board.\nPresently, Mr. Xin Sun is the sole director of the Company. Mr. Xin Sun possesses many of the skills and experiences needed for our business. He has experience in the pharmaceutical industry, having previously been the District Director for the Northeast District of China for Pfizer Pharmaceuticals Limited from 1991 to 1994. He has also been the Director of Marketing for Ha Yao Group Sanchine Medicine Joint-Stock Company Ltd., where he acquired strong marketing experience. From 1996 to 2002, Mr. Xin Sun was the chief executive officer of a company he founded, Heilongjiang Bijie Chemical Industry Co., Ltd., and from 2003 to the present, he has been the president and chief executive officer of Humankind.\nThe Board plans to eventually increase its membership to include directors with skills and experiences complementary to Mr. Xin Suns background.\nBoard Leadership Structure and Role in Risk Oversight\nMr. Xin Sun is the Companys Chairman and Chief Executive Officer. The Boards role in the risk oversight of the Company includes, among other things:\n- appointing, retaining and overseeing the work of the independent auditors, including resolving disagreements between the management and the independent auditors relating to financial reporting;\n- approving all auditing and non-auditing services permitted to be performed by the independent auditors;\n- reviewing annually the independence and quality control procedures of the independent auditors;\n- reviewing and approving all proposed related party transactions;\n- discussing the annual audited financial statements with the management; and\n- meeting separately with the independent auditors to discuss critical accounting policies, management letters, recommendations on internal controls, the auditors engagement letter and independence letter and other material written communications between the independent auditors and the management.\nCompliance with Section 16(a) of Exchange Act\nSection 16(a) of the Exchange Act requires our executive officers and directors and persons who own more than ten percent of a registered class of our equity securities to file with the SEC initial statements of beneficial ownership, reports of changes in ownership and annual reports concerning their ownership of our common stock and other equity securities, on Form 3, 4 and 5 respectively. Executive officers, directors and greater than ten percent shareholders are required by the SEC regulations to furnish the Company with copies of all Section 16(a) reports they file.\nBased solely on our review of the copies of such reports, we believe that, with respect to the fiscal year ended June 30, 2023, there is no triggering event for the filing of any report under Section 16(a) by our sole officer and director, or by any of the persons known to us to own more than ten percent of our common stock.\nMeetings of Our Board of Directors\nThe Board held no meetings; however, the Board had resolved matters in written consent one time during the fiscal year ended June 30, 2023.\nBoard Committees\nAudit Committee. We intend to establish an audit committee of the Board which will consist of soon-to-be-nominated independent directors. The audit committees duties will be to recommend to the Board the engagement of independent auditors to audit our financial statements and to review our accounting and auditing principles. The audit committee will review the scope, timing and fees for the annual audit and the results of audit examinations performed by the internal auditors and independent public accountants, including their recommendations to improve the system of accounting and internal controls. The audit committee will at all times be composed exclusively of directors who are, in the opinion of the Board, free from any relationship which would interfere with the exercise of independent judgment as a committee member and who possess an understanding of financial statements and generally accepted accounting principles.\nAudit Committee Financial Expert. The Board currently acts as our audit committee. Since we are still a developing company, the Board is still in the process of finding an audit committee financial expert as defined in Regulation S-K and directors that are independent as that term is used in Section 10A of the Exchange Act.\nCompensation Committee. We intend to establish a compensation committee of the Board. The compensation committee will review and approve our salary and benefits policies, including compensation of executive officers.\nCode of Ethics\nWe currently do not have a Code of Ethics because we presently only have one director and one officer. We plan to adopt a Code of Ethics when the size of the Board and management increases.\nDirector Compensation\nWe did not compensate our director for the fiscal year ended June 30, 2023. Going forward, however, we intend to implement a market-based director compensation program.\nLimitations on Liability\nUnder Delaware law, a corporation may indemnify its officers, directors, employees and agents under certain circumstances, including indemnification of such persons against liability under the Securities Act. Those circumstances include that an officer, director, employee or agent may be indemnified if the person acted in good faith and in a manner that he or she reasonably believed to be in, or not opposed to, the best interests of the corporation and, with respect to any criminal action or proceeding, had no reasonable cause to believe that his or her conduct was unlawful.\nArticle Seven of our Articles of Incorporation provides that no director shall be personally liable to the Company or the shareholders for monetary damages for any breach of fiduciary duty by such person in his or her capacity as a director. Notwithstanding the foregoing sentence, a director shall be liable to the extent provided by applicable law, (i) for breach of his or her duty of loyalty to the Company or the shareholders, (ii) for acts or omissions not in good faith or which involve intentional misconduct or a knowing violation of law, (iii) pursuant to Section 174 of the Delaware General Corporation law, or (iv) for any transaction from which he or she derived an improper personal benefit. No amendment to or repeal of this provision shall apply to or have any effect on the liability or alleged liability of any director of the Company for or with respect to any acts or omissions of such director occurring prior to such amendment.\nWe are also permitted to apply for insurance on behalf of any director, officer, employee or other agent for liability arising out of his or her actions, whether or not the Delaware General Corporation Law would permit indemnification.\nIndemnification against Public Policy\nInsofar as indemnification for liabilities arising under the Securities Act may be permitted to directors, officers or persons controlling an issuer pursuant to the foregoing provisions, the opinion of the SEC is that such indemnification is against public policy as expressed in the Securities Act and is therefore unenforceable. In the event that a claim for indemnification against such liabilities (other than by a director, officer or controlling person in the successful defense of any action, suit or proceeding) is asserted by such director, officer or controlling person in connection with the securities being registered, we will, unless in the opinion of our counsel the matter has been settled by controlling precedent, submit to a court of appropriate jurisdiction the question whether such indemnification by us is against public policy as expressed in the Securities Act and will be governed by the final adjudication of such issue.\nThe effect of indemnification may be to limit the rights of the Company and the shareholders (through shareholders derivative suits on behalf of the Company) to recover monetary damages and expenses against a director for breach of fiduciary duty.\nDirectors and Officers of Humankind\nThe following table sets forth certain information as of June 30, 2023 concerning the directors and executive officers of Humankind:\nDirectors and Executive Officers\nPosition/Title\nAge\nXin Sun\nChairman, Chief Financial Officer, Treasurer\nBaosen Ma\nPresident, Secretary, Director\nKai Sun\nDirector\nThe following is a summary of the biographical information of those directors and officers of Humankind whose biographical information does not appear above:\nXin Sun, Chairman, Chief Financial Officer, Treasurer\nMr. Suns biography is discussed above under Item 10. Directors, Executive Officers and Corporate Governance and incorporated herein by reference.\nBaosen Ma, President, Secretary and Director\nMr. Baosen Ma graduated from China University of Political Science and Law with a major in Financial Accounting. From 1987 to 1992, he was an accountant with Harbin Keluola Solar Power Co., Ltd. Thereafter, from 1992 to 1996, he was Vice General Manager and Sales Manager for Shanghai Dahua Solar Battery Co., Ltd. From 1996 to 2004, he was the East China Manager for the Ha Yao Group Sanchine Medicine Joint-Stock Ltd. In January 2004, Mr. Ma was appointed President, Secretary and Director of Humankind.\nKai Sun, Director\nMr. Kai Sun graduated from Mu Dan Jiang University with a major in Economics. From 1993 to 1995, he was Vice Director of Mu Dan Jiang Engine Factory. Thereafter, from 1995 to 1998, he was a Director at Mu Dan Jiang Engine Factory. From 1998 to 2004, he was an Administration Director for Mu Dan Jiang Lysine Co., Ltd. Since 2004, he has been the Administration Director at Humankind. Mr. Kai Sun is the younger brother of Mr. Xin Sun, the Companys Chairman, Chief Financial Officer, Treasurer and sole director. In January 2004, Mr. Kai Sun was appointed a director of Humankind. Item 11. Executive Compensation.\nThe following Summary Compensation Table sets forth, for the years indicated, all cash compensation paid, distributed or accrued for services, including salary and bonus amounts, rendered in all capacities by our Chief Executive Officer and all other executive officers who received or are entitled to receive remuneration in excess of $100,000 during the stated periods. Mr. Xin Sun, our Chief Executive Officer and sole director, receives no additional compensation for the services he provides in his capacity as director.\nSUMMARY COMPENSATION TABLE\n(all figures in US Dollars)\nNon-Equity Non-qualified\nIncentive Deferred All\nStock Option Plan Compensation Other\nSalary Bonus Awards Awards Compensation Earnings Compensation Total\nName and Principal Position Year ($) ($) ($) ($) ($) ($) ($) ($)\nXin Sun, Chief Executive Officer, 12,523 - - N/A N/A N/A N/A 12,523\nChief Financial Officer 9,016 - - N/A N/A N/A N/A 9,016\nEmployment Agreements\nWe have no employment agreement with our sole principal executive officer, Mr. Xin Sun.\nEquity Compensation Plan Information\nThe following table sets forth information regarding grants of awards and outstanding equity awards to Named Executive Officer during the year ended June 30, 2023:\nGrants of Plan-Based Awards\nEstimated future payouts\nunder non-equity incentive\nplan awards\nEstimated future payouts\nunder equity incentive plan\nawards\nAll other\nstock\nawards:\nNumber of\nshares of\nstock or All other option\nawards:\nNumber of\nsecurities\nunderlying Exercise\nor base price of\noption Grant date fair\nvalue of\nstock\nand\nName Grant\ndate\nThreshold($) Target($) Maximum($) Threshold(#) Target(#) Maximum(#) units\n(#)\noptions\n(#)\nawards\n($/Sh)\noption\nawards\n(a) (b) (c) (d) (e) (f) (g) (h) (i) (j) (k) (l)\nXin Sun, Chief Executive Officer, Chief Financial Officer - - - - - - - - - - $ -\nOutstanding Equity Awards at Fiscal Year-End\nOption awards Stock awards\nName Number of securities underlying unexercised options(#) exercisable Number of securities underlying unexercised options(#) unexercisable Equity incentive plan awards: number of securities underlying unexercised unearned options(#) Option exercise price($) Option expiration date Number of\nshares or\nunits of\nstock that have not vested(#) Market value of shares or units of stock that have not vested(#) Equity incentive plan awards: number of unearned shares, units or other rights that have not vested(#) Equity incentive plan awards: market or payout value of unearned shares, units or other rights that have not vested($)\n(a) (b) (c) (d) (e) (f) (g) (h) (i) (j)\nXin Sun, Chief Executive Officer, Chief Financial Officer - - - - - - - - -\nOption Exercises and Stock Vested\nOption awards Stock awards\nName Number of\nshares acquired on\nexercise (#) Value\nrealized on\nexercise ($) Number of\nshares acquired on\nvesting (#) Value realized on\nvesting ($)\n(a) (b) (c) (d) (e)\nXin Sun, Chief Executive Officer, Chief Financial Officer - - - -\nDirectors and Officers Liability Insurance\nWe currently do not have insurance insuring directors and officers against liability; however, we are in the process of investigating the availability of such insurance. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth certain information with respect to the beneficial ownership of our voting securities by (i) any person or group owning more than five percent of any class of voting securities, (ii) our director, (iii) our chief executive officer and president and (iv) all executive officers and directors as a group as of November 10, 2023.\nThe address of the beneficial owner listed below is Harbin Humankind Biology Technology Co. Limited, 3199-1 Longxiang Road, Songbei District, Harbin, Heilongjiang Province, PRC.\nAmount and\nNature of\nTitle of Class Name Beneficial\nOwner Percent of\nClass (1)\nCommon Stock Xin Sun, Chairman, Chief Executive Officer,\nChief Financial Officer and Treasurer 20,507,188 31.3 %\nCommon Stock All officers and directors as a group (1 person) 20,507,188 31.3 %\n(1) Based on 65,539,737 total issued and outstanding shares of the Company as of November 10, 2023. Beneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission and generally includes voting or investment power with respect to securities. Shares of common stock subject to options or warrants currently exercisable or convertible, or exercisable or convertible within 60 days of November 10, 2023 are deemed outstanding for computing the percentage of the person holding such option or warrant but are not deemed outstanding for computing the percentage of any other person.\nMr. Xin Sun has the sole power to vote and dispose all shares of common stock listed opposite his name. Mr. Sun did not and does not own any options or convertible securities. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe Company received temporary short-term loans from its majority owner and our sole director and principal executive officer, Mr. Xin Sun, a PRC citizen. These loans are unsecured and non-interest bearing, and have no fixed terms of repayment; therefore, they are deemed payable on demand. Cash flows classified as due to majority owner are classified as cash flows from financing activities.\nThe amounts due to related parties are used to support the normal business operation of the Company, the related cash flows are classified as operating activities. The total amounts due to Mr. Sun were $5,121,776 and $6,724,850 as of June 30, 2023 and June 30, 2022, respectively.\nThere were no interested imputed on the loans for the fiscal years 2023 and 2022, respectively. Item 14. Principal Accountant Fees and Services.\nWe were billed by Assentsure PAC (Assentsure), our independent public accountants and CENTURION ZD CPA & CO. (Centurion), our former independent public accountants, for the following professional services they performed for us during the fiscal year ended June 30, 2023 and 2022, as set forth in the table below:\nAudit-\nAudit Related Tax Other\nAuditors Fees Fees Fees Fees\nAssentsure $ 150,000 - - -\nCenturion $ 48,000\nCenturion $ 140,000 - - -\nAudit Fees - This category includes the audit of our annual financial statements and services that are normally provided by the independent auditors in connection with engagements for those fiscal years.\nAudit-Related Fees - This category consists of assurance and related services by the independent auditors that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees.\nTax Fees - This category consists of professional services rendered by the Companys independent registered public accounting firm for tax compliance and tax advice. The services for the fees disclosed under this category include tax return preparation and technical tax advice.\nAll Other Fees - This category consists of fees for other miscellaneous items.\nPre-Approval Policies and Procedures\nAll of the services rendered to us by our independent registered public accountants were pre-approved by the Board.\nPART IV Item 15. Exhibits and Financial Statement Schedules\nExhibit\nFiled\nIndex\nDescription of Document\nHerewith\nIncorporated by Reference To:\n3.1\nArticles of Incorporation.\nExhibit 3.1 of the Companys Registration Statement on Form 10-SB filed with the SEC on December 1, 2004.\n3.2\nBy-laws.\nExhibits 3.2 of the Companys Registration Statement on Form 10-SB filed with the SEC on December 1, 2004.\n3.3\nCertificate of Amendment, dated May 11, 2005.\nExhibits 3.3 of the Companys Annual Report on Form 10-K/A filed with the SEC on November 16, 2010.\n3.4\nCertificate of Amendment, dated November 12, 2008.\nExhibit 3.4 of the Companys Annual Report on Form 10-K/A filed with the SEC on November 16, 2010.\n3.5\nCertificate of Amendment, dated February 11, 2009.\nExhibit 3.5 of the Companys Annual Report on Form 10-K/A filed with the SEC on November 16, 2010.\n4.1\nSpecimen of Common Stock Certificate\nExhibit 4.1 of the Companys Annual Report on Form 10-K filed with the SEC on September 29, 2014.\n4.2\nDescription of Securities Registered Pursuant to Section 12 of the Exchange Act.\nExhibit 4.2 of the Companys Annual Report on Form 10-K filed with the SEC on September 15, 2022.\n10.1\nEnglish Translation of Land Use Agreement, dated June 7, 2004, between Harbin Humankind Biology Technology Co. Limited and Harbin City, Daochu District, Songbei Township, Jinxin Village.\nExhibit 10.3 of the Companys Annual Report on Form 10-K/A filed with the SEC on November 16, 2010.\n10.2\nEnglish Translation of Cooperative Agreement, dated September 17, 2008, between Harbin Humankind Biology Technology Co. Limited and the Commercial Bureau of Qingan County.\nExhibit 10.5 of the Companys Annual Report on Form 10-K/A filed with the SEC on November 16, 2010.\n10.3\nEnglish Translation of Land Purchase Agreement, dated July 7, 2009, between Harbin Humankind Biology Technology Co. Limited and Harbin Songbei District Construction and Development Management Committee.\nExhibit 10.6 of the Companys Annual Report on Form 10-K/A filed with the SEC on November 16, 2010.\n10.4\nEnglish Translation of Technology Transfer Agreement, dated October 12, 2007, between Harbin Humankind Biology Technology Co. Limited and Beijing Jindelikang Bio- Technology Co., Ltd.\nExhibit 10.7 of the Companys Annual Report on Form 10-K/A filed with the SEC on November 16, 2010.\nExhibit\nFiled\nIndex\nDescription of Document\nHerewith\nIncorporated by Reference To:\n10.5\nEnglish Translation of Health Food Technology Transfer Agreement, dated January 18, 2013 by and between Harbin Humankind Biology Technology Co., Limited and Guangzhou Aoda Biology Beauty Healthy Technology Co., Ltd.\nExhibit 10.22 of the Companys Annual Report on Form 10-K filed with the SEC on October 15, 2013.\n10.6\nEnglish Translation of Stock Transfer Agreement, dated April 10, 2013, by and between Stockholder of Heilongjiang Huimeijia Pharmaceuticals Co., Ltd, Liyuan Sun and Harbin Humankind Biology Technology Co., Limited. and its addendum dated June 18, 2013.\nExhibit 10.23 of the Companys Annual Report on Form 10-K filed with the SEC on October 15, 2013.\n10.7\nEnglish Translation of Stock Transfer Agreement, dated April 10, 2013, by and between Stockholder of Heilongjiang Huimeijia Pharmaceuticals Co., Ltd, Wenbin Zhang and Harbin Humankind Biology Technology Co., Limited. and its addendum dated June 18, 2013.\nExhibit 10.24 of the Companys Annual Report on Form 10-K filed with the SEC on October 15, 2013.\n10.8\nEnglish Translation of Stock Transfer Agreement dated December 24, 2014, by and among Harbin Humankind Biology Technology Co., Limited., Xin Sun, Harbin Huimeijia Medicine Company, and Xiuzheng Pharmaceutical Group Co., Ltd.\nExhibit 10.1 of the Companys Current Report on Form 8-K filed with the SEC on December 31, 2014.\n10.9\nEnglish Translation of the Supplementary Agreement dated February 9, 2015, by and among Harbin Humankind Biology Technology Co., Limited., Xin Sun, Harbin Huimeijia Medicine Company, and Xiuzheng Pharmaceutical Group Co., Ltd.\nExhibit 10.2 of the Companys Quarterly Report on Form 10-Q filed with the SEC on February 13, 2015.\n10.10\nChina Health Industries Holdings, Inc. 2015 Equity Incentive Plan, effective as of March 27, 2015\nExhibit 10.1 of the Companys Current Report on Form 8-K filed with the SEC on April 2, 2015.\n10.11\nForm of the Restricted Stock Award Agreement\nExhibit 10.2 of the Companys Current Report on Form 8-K filed with the SEC on April 2, 2015.\nExhibit\nFiled\nIndex\nDescription of Document\nHerewith\nIncorporated by Reference To:\n21.1\nList of Subsidiaries.\nExhibit 21.1 of the Companys Annual Report on Form 10-K filed with the SEC on September 28, 2018.\n23.1\nConsent of the Independent Publicly Registered Accountants\nx\n31.1\nCertification of the Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nx\n31.2\nCertification of the Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nx\n32.1\nCertification pursuant to U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes- Oxley Act of 2002.\nx\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCHINA HEALTH INDUSTRIES HOLDINGS, INC.\nBy: /s/ Xin Sun\nDate: November 13, 2023 Name: Xin Sun\nTitle:\nChief Executive Officer\n(principal executive officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nBy: /s/ Xin Sun\nName: Xin Sun\nTitle: Chief Executive Officer\n(principal executive officer),\nChief Financial Officer\n(principal financial officer and\nprincipal accounting officer) and sole director\nDate: November 13, 2023\n10-K 86-451\n0.0054 0.0062\n0.0054 0.0062\nfalse FY\n2022-07-01 2023-06-30\n2022-12-31\n2023-11-10\n2023-06-30\n2022-06-30\nus-gaap:RelatedPartyMember\n2023-06-30\nus-gaap:RelatedPartyMember\n2022-06-30\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2021-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-06-30\nus-gaap:RetainedEarningsMember\n2021-06-30\nchhe:StatutoryReservesMember\n2021-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-06-30\nus-gaap:ParentMember\n2021-06-30\nus-gaap:NoncontrollingInterestMember\n2021-06-30\n2021-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-07-01 2022-06-30\nus-gaap:RetainedEarningsMember\n2021-07-01 2022-06-30\nchhe:StatutoryReservesMember\n2021-07-01 2022-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-07-01 2022-06-30\nus-gaap:ParentMember\n2021-07-01 2022-06-30\nus-gaap:NoncontrollingInterestMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-06-30\nus-gaap:RetainedEarningsMember\n2022-06-30\nchhe:StatutoryReservesMember\n2022-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-06-30\nus-gaap:ParentMember\n2022-06-30\nus-gaap:NoncontrollingInterestMember\n2022-06-30\nus-gaap:CommonStockMember\n2022-07-01 2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-07-01 2023-06-30\nus-gaap:RetainedEarningsMember\n2022-07-01 2023-06-30\nchhe:StatutoryReservesMember\n2022-07-01 2023-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-07-01 2023-06-30\nus-gaap:ParentMember\n2022-07-01 2023-06-30\nus-gaap:NoncontrollingInterestMember\n2022-07-01 2023-06-30\nus-gaap:CommonStockMember\n2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-06-30\nus-gaap:RetainedEarningsMember\n2023-06-30\nchhe:StatutoryReservesMember\n2023-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2023-06-30\nus-gaap:ParentMember\n2023-06-30\nus-gaap:NoncontrollingInterestMember\n2023-06-30\nchhe:SharePurchaseAgreementMember chhe:HarbinHumankindBiologyTechnologyCoLimitedMember\n2007-08-20\nchhe:HarbinHumankindBiologyTechnologyCoLimitedMember\n2007-08-02 2007-08-20\nchhe:BusinessCombinationMember chhe:HarbinHuimeijiaMedicineCompanyMember\n2008-10-14\nchhe:MrXinSunMember\n2008-10-14\nchhe:ChinaHealthIndustriesHoldingsLimitedMember\n2022-07-01 2023-06-30\nchhe:MrXinSunMember chhe:ChinaHealthIndustriesHoldingsLimitedMember\n2009-04-07\nchhe:HeilongjiangHuimeijiaPharmaceuticalCoLtdMember\n2013-11-01 2013-11-22\nchhe:BusinessCombinationMember chhe:HarbinHumankindBiologyTechnologyCoLimitedMember\n2014-12-24\nchhe:MrXinSunMember chhe:BusinessCombinationMember\n2014-12-24\nchhe:SupplementaryAgreementMember\n2015-02-02 2015-02-09\nchhe:NewSupplementaryAgreementMember chhe:ChinaHealthIndustriesHoldingsLimitedMember\n2016-10-12\nchhe:NewSupplementaryAgreementMember\n2016-10-01 2016-10-12\nchhe:NewSupplementaryAgreementMember\n2022-07-01 2023-06-30\nchhe:SupplementaryAgreementMember\n2022-07-01 2023-06-30\nchhe:ChinaHealthIndustriesHoldingsLimitedMember srt:MaximumMember\n2023-06-27\nchhe:ChinaHealthIndustriesHoldingsLimitedMember srt:MinimumMember\n2023-06-27\n2023-06-27 2023-06-27\nchhe:ChinaHealthIndustriesHoldingsLimitedMember\n2023-06-27 2023-06-27\nchhe:ExchangeRateMember\n2023-06-30\nchhe:ExchangeRateMember\n2022-06-30\nchhe:ExchangeRateOneMember\n2023-06-30\nchhe:ExchangeRateOneMember\n2022-06-30\nchhe:ExchangeRateTwoMember\n2023-06-30\nchhe:ExchangeRateTwoMember\n2022-06-30\nsrt:MinimumMember\n2022-07-01 2023-06-30\nsrt:MaximumMember\n2022-07-01 2023-06-30\nsrt:MinimumMember us-gaap:BuildingAndBuildingImprovementsMember\n2023-06-30\nsrt:MaximumMember us-gaap:BuildingAndBuildingImprovementsMember\n2023-06-30\nsrt:MinimumMember us-gaap:OfficeEquipmentMember\n2023-06-30\nsrt:MaximumMember us-gaap:OfficeEquipmentMember\n2023-06-30\nsrt:MinimumMember us-gaap:VehiclesMember\n2023-06-30\nsrt:MaximumMember us-gaap:VehiclesMember\n2023-06-30\nsrt:MinimumMember us-gaap:MachineryAndEquipmentMember\n2023-06-30\nsrt:MaximumMember us-gaap:MachineryAndEquipmentMember\n2023-06-30\nchhe:EquityInterestHuimeijiaMember\n2014-12-24\n2014-12-24 2014-12-24\n2015-02-09 2015-02-09\nchhe:SupplementaryAgreementMember\n2015-02-09 2015-02-09\nchhe:NewSupplementaryAgreementMember chhe:EquityInterestHuimeijiaMember\n2016-10-12\nchhe:NewSupplementaryAgreementMember\n2016-10-12 2016-10-12\nus-gaap:AccountsReceivableMember\n2023-06-30\nus-gaap:AccountsReceivableMember\n2022-06-30\n2012-04-06\nchhe:PlantMember\n2023-06-30\nchhe:PlantMember\n2022-06-30\nus-gaap:BuildingAndBuildingImprovementsMember\n2023-06-30\nus-gaap:BuildingAndBuildingImprovementsMember\n2022-06-30\nus-gaap:MachineryAndEquipmentMember\n2023-06-30\nus-gaap:MachineryAndEquipmentMember\n2022-06-30\nus-gaap:OfficeEquipmentMember\n2023-06-30\nus-gaap:OfficeEquipmentMember\n2022-06-30\nus-gaap:VehiclesMember\n2023-06-30\nus-gaap:VehiclesMember\n2022-06-30\nus-gaap:OtherCapitalizedPropertyPlantAndEquipmentMember\n2023-06-30\nus-gaap:OtherCapitalizedPropertyPlantAndEquipmentMember\n2022-06-30\nchhe:CommercialPurposeMember\n2023-06-30\nchhe:ResidentialPurposeMember\n2023-06-30\nchhe:LandUseRightMember chhe:HumankindMember\n2023-06-30\nchhe:LandUseRightMember chhe:HumankindMember\n2022-06-30\nchhe:HealthSupplementProductPatentsMember chhe:HumankindMember\n2023-06-30\nchhe:HealthSupplementProductPatentsMember chhe:HumankindMember\n2022-06-30\nchhe:PharmaceuticalPatentsMember chhe:HLJHuimeijiaMember\n2023-06-30\nchhe:PharmaceuticalPatentsMember chhe:HLJHuimeijiaMember\n2022-06-30\nchhe:LandUseRightMember chhe:HLJHuimeijiaMember\n2023-06-30\nchhe:LandUseRightMember chhe:HLJHuimeijiaMember\n2022-06-30\nchhe:MrXinSunMember\n2023-06-30\nchhe:MrXinSunMember\n2022-06-30\nchhe:MrKaiSunMember\n2023-06-30\nchhe:MrKaiSunMember\n2022-06-30\ncountry:US\n2023-06-30\ncountry:US\n2022-06-30\ncountry:US\n2022-07-01 2023-06-30\ncountry:HK\n2023-06-30\ncountry:HK\n2022-06-30\nchhe:PeoplesRepublicOfChinaMember\n2022-07-01 2023-06-30\nchhe:PeoplesRepublicOfChinaMember\n2021-07-01 2022-06-30\nus-gaap:SalesMember chhe:SupplierOneMember chhe:SupplierMember\n2022-07-01 2023-06-30\nus-gaap:OtherCustomerMember us-gaap:SalesMember us-gaap:CustomerConcentrationRiskMember\n2022-07-01 2023-06-30\nchhe:CustomerOneMember us-gaap:SalesMember us-gaap:CustomerConcentrationRiskMember\n2022-07-01 2023-06-30\nchhe:CustomerTwoMember us-gaap:SalesMember us-gaap:CustomerConcentrationRiskMember\n2022-07-01 2023-06-30\nchhe:CustomerThreeMember us-gaap:SalesMember us-gaap:CustomerConcentrationRiskMember\n2022-07-01 2023-06-30\nchhe:HLJHuimeijiaMember\n2022-07-01 2023-06-30\nchhe:HumankindMember\n2022-07-01 2023-06-30\nchhe:OthersMember\n2022-07-01 2023-06-30\nchhe:ConsolIdatedOperationsMember\n2022-07-01 2023-06-30\nchhe:HLJHuimeijiaMember\n2021-07-01 2022-06-30\nchhe:HumankindMember\n2021-07-01 2022-06-30\nchhe:OthersMember\n2021-07-01 2022-06-30\nchhe:ConsolIdatedOperationsMember\n2021-07-01 2022-06-30\nchhe:HLJHuimeijiaMember\n2023-06-30\nchhe:HumankindMember\n2023-06-30\nchhe:OthersMember\n2023-06-30\nchhe:ConsolIdatedOperationsMember\n2023-06-30\nchhe:HLJHuimeijiaMember\n2022-06-30\nchhe:HumankindMember\n2022-06-30\nchhe:OthersMember\n2022-06-30\nchhe:ConsolIdatedOperationsMember\n2022-06-30\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure\niso4217:CNY"
}