{
    "cik": "1331612",
    "company": "INNOVATIVE MEDTECH, INC.",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-06-30",
    "sic": "5040",
    "state_of_inc": "DE",
    "state_location": "IL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1331612/0001477932-22-007620-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1331612/000147793222007620/imth_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1331612/0001477932-22-007620.txt",
    "filename": "1331612_10K_2022_0001477932-22-007620.htm",
    "content": "Item 1. Description of Business\nCorporate Background\nInnovative MedTech, Inc. (the Company) was originally formed on April 21, 2005, in New Jersey as Serino 1, Corp.,. On December 16, 2005, the Company merged with Fresh Harvest Products, Inc., and then changed its name to Fresh Harvest Products, Inc., and began operating as a natural and organic food and beverage company. In 2012, the Company began focusing its efforts on developing software and mobile application development and video production and developing an e-book company, and in the intervening years, expanded its technology development and development efforts, creating a revenue sharing partnership with a mobile app, TreatER (available for free on the Apple App Store) in 2017 and in 2018, focusing on building a software program for financially valuing a film concept and mapping the predicted human behavior by region to films using a combination of geographical based social sentiment and the distribution data and financial performance of historically released films. On November 4, 2017, the Company redomiciled from New Jersey to Delaware, and changed its fiscal year end from October 31st to June 30th. On March 9, 2021, the Company effectuated a 10,000:1 reverse split, changed its stock symbol from FRHV to IMTH, and changed its name to Innovative MedTech, Inc. On March 25, 2021, the Company acquired two companies, Sarah Adult Day Services, Inc., and Sarah Day Care Centers, Inc. (collectively SarahCare), an adult day care center franchisor and provider. With 26 centers (2 corporate and 24 franchise locations) located in 13 states, SarahCare offers seniors daytime care and activities focusing on meeting their physical and medical needs on a daily basis, and ranging from nursing care to salon services and providing meals, to offering engaging and enriching activities to allow them to continue to lead active and engaged lives. We are now focusing all of our efforts on our senior care operations.\nThe Company has also been working on launching an RX Vitality wallet digital offering and mobile app which, once implemented and live, the Companys digital healthcare wallet will be able to be accessed by customers via mobile wallet on both the Apple iOS and Android App Stores. The Company intends to have a physical healthcare card as well.\nOn April 1, 2022, the Company partnered with TruCash Group of Companies Inc. (TruCash), a leading global payments provider, to launch an all-in-one Super Healthcare App, called RX Vitality Wallet, that will be designed to cater to consumers, patients, hospitals, seniors, and governments, with a solid platform of benefits and online banking. The RX Vitality digital healthcare wallet is being designed to offer 20%-75% pharmaceutical discounts at 65,000 pharmacies across the United States, including Walgreens and CVS. In addition, we plan to offer health and wellness discounts at 500+ online merchants, as well as earning points on our Loyalty Program. The Company intends to generate revenue from its digital wallet and mobile app in multiple ways, including but not limited to monthly recurring fees, transfer fees, and the inter-exchange rate. On June 15, 2022, the Companys RX Vitality digital healthcare wallet became for download at the Apple iOS App store for Apple iPhone users. The Companys app has also been approved and is available on the Google Play Store.\nOn April 5, 2022, the Company engaged mPulse Mobile, a leader in conversational AI and digital engagement solutions for the healthcare industry, to drive engagement with the Companys digital app and wallet (currently under development).\nOn April 28, 2022, the Company entered into a share exchange agreement with RX Vitality, Inc. (RX Vitality), a media and finance advisory company.\nOn May 13, 2022, the Company entered into a partnership with VSUSA Corp. (VSUSA), a non-for-profit organization that empowers Veterans and Seniors by offering services designed to build successful life transitions with access to workforce and independent housing; health services; and social service programs in communities across the United States. The partnership will permit the Company to use the VSUSA logo on the back of its Vitality Debit Card. For this, the Company will give up to 1% of its revenue generated from its Vitality Debit Card to VSUSA. The Companys Chairman is a principal and co-Founder of VSUSA.\nOn June 1, 2022, the Company announced that Dr. Merle Griff, SarahCares Founder and CEO, will also be CEO of the Company.\nGeneral Overview\nDescription of Business\nThe Company is a provider of health and wellness services, and has two divisions: the RX Vitality digital wallet and health care app (available on both the iOS and Google Play App Stores), and the companys wholly owned subsidiary SarahCare, an adult day care center franchisor with 2 corporate owned centers and 24 franchise locations across the United States. SarahCare offers seniors daytime care and activities ranging from exercise and medical needs daily to nursing care and salon services. On March 25, 2021, the Company acquired SarahCare for a total of $3,718,833; $2,000,110 was paid in cash and the Company assumed approximately $393,885 in debt due to sellers, and the remaining is payable through a royalty fee liability due in the amount of $1,500,000. With 26 centers (2 corporate and 24 franchise locations) located in 13 states, SarahCare offers seniors daytime care and activities focusing on meeting their physical and medical needs on a daily basis, and ranging from nursing care to salon services and providing meals, to offering engaging and enriching activities to allow them to continue to lead active and engaged lives.\nOn April 1, 2022, the Company partnered with TruCash Group of Companies Inc. (TruCash), a leading global payments provider, to launch an all-in-one Super Healthcare App, called RX Vitality Wallet, that will be designed to cater to consumers, patients, hospitals, Seniors, and governments, with a solid platform of benefits and online banking. The RX Vitality digital healthcare wallet is being designed to offer 20%-75% pharmaceutical discounts at 65,000 pharmacies across the United States, including Walgreens and CVS. In addition, we plan to offer health and wellness discounts at 500+ online merchants, as well as earning points on our Loyalty Program. The Company intends to generate revenue from its digital wallet and mobile app in multiple ways, including but not limited to monthly recurring fees, transfer fees, and the inter-exchange rate. On June 15, 2022, the Companys RX Vitality digital healthcare wallet became available for download at the Apple iOS App store for Apple iPhone users. The Companys app has also been approved and is available on the Google Play Store.\nOverview and Mission\nOur mission is to be one of the market leaders in the adult day care center market and to be a leader in related technologies in the health and wellness category. We believe that this is a fragmented market, and this is an opportune time to consolidate and grow our SarahCare brand. We have an experienced management team of adult day care industry and financial markets executives that have strong relationships in the industry.\nOperational Overview - SarahCare, our wholly owned subsidiary\nSarahCare provides health-care related services and companionship for older adults, aged 60 and above, and for adults aged 18-60 who are in need of health-related care and supervision (a SARAH Business) since February 1985. In 1985, the very first SarahCare Center opened its doors in Canton, Ohio. Originally called S.A.R.A.H. (Senior Adult Recreation and Health), the facility was one of the first intergenerational sites in the U.S. The senior adult day care center was located next to a child day care center and served as a training and research site for the development of other unique intergenerational programs across the country. Eventually, directors transitioned S.A.R.A.H.s name to Sarah Center and, finally, to SarahCare demonstrating the philosophy of care administered to our seniors and their families.\nWe grant franchises for the operation of a SARAH Business. A SARAH Business provides non-medical care for elderly individuals and others in need of health-related care and supervision who desire compassionate care and stimulating activity in a secure, structured environment. We provide service that offers an effective solution for individuals who are in need of support services in order to continue living in their communities.\nCurrently, SarahCare operates 26 unique locations in the United States (24 franchised locations and 2 corporate owned centers) and internationally in the United Arab Emirates and Saudi Arabia. Center members who visit any one of our locations across 13 states are offered daytime care and activities ranging from exercise and health-care related needs on a daily basis to nursing care and salon services. Visitors benefit from additional services that include specialized dietary menus and engaging social activities allowing them to continue to lead active and enriched lives.\nAccreditation\nSarahCares two corporate-owned centers have achieved accreditation through the Aging Services division of CARF, an independent, non-profit accreditor of health and human services. Through accreditation, CARF assists service providers in improving the quality of their services, demonstrating value, and meeting internationally recognized organizational and program standards. The accreditation process applies sets of standards to service areas and business practices during an on-site survey. Accreditation, however, is an ongoing process, signaling to the public that a service provider is committed to continuously improving services, encouraging feedback, and serving the center. Accreditation also demonstrates a providers commitment to enhance its performance, manage its risk, and distinguish its service delivery.\nWho we care for\nWe have trained staff including nurses who specialize in caring for those with various impairments and health related problems, including but not limited to: frailty and physical dependence, memory impairment, stroke and Parkinsons disease, chronic diseases, and isolation and depression.\nNursing assistants and other trained staff are always there to assist participants in ambulating and moving through all of our activities throughout the day. Activities are adapted for specific physical challenges so that no one ever feels left out. Yes, seniors who are wheelchair bound are very welcome in our centers. We handle a loved ones challenging issues with care and consideration. If a loved one is wheelchair bound, multiple staff members are available at any given time if they need the assistance of more than one person. If a loved one needs help with toileting and/or bathing, we have specially trained staff to assist them. Our bathing areas are designed to give them as much privacy and dignity as possible.\nActivities - Our centers offer versatile daily services and activities. Some of the benefits included in our daily fee are:\n·\nNURSING - licensed nursing staff under the supervision of an RN for better care of chronic diseases\n·\nFOOD - delicious catered meals with special diets accommodated\n·\nACTIVITIES - customized to your loved ones interests and abilities\n·\nSOCIALIZATION - be with friends, remain active, and enjoy the day\nNursing Services - While our participants enjoy their day at SarahCare, our center nurses provide the care and monitoring they need on a regular basis. Care is provided in the privacy of our nurses clinic. Our centers are staffed with the qualified Registered and/or Licensed nurses. They are often specially certified and trained to work with issues related to aging and the elderly, and are passionate about caring for seniors. Nursing services that are offered include:\n·\nMedication administration and oversight\n·\nWeight and vital signs monitored and recorded regularly\n·\nDiabetic care\n·\nCare of feeding tubes and ostomies\n·\nDressing changes\n·\nOther services needed by you or your loved one or as ordered by a physician\nMeals - We offer delicious and nutritious meals at no extra cost. Meals are the perfect time for friends to socialize and celebrate, sharing memories and exchanging jokes. Our beautiful dining rooms and delicious food help turn each meal into a special event. A light breakfast, a delicious catered lunch, and afternoon snack are all included in the daily rate. Special diets are easily accommodated and assistance at meal time is always available.\nIntergenerational - Our intergenerational program brings together seniors and children in a safe and engaging environment. ‘Grandparents and ‘grandchildren have so much to share and can be a great source of joy to each other, yet they rarely have these opportunities. SarahCare intergenerational programs bring both generations together in a structured environment where they can learn from each other - sharing their feelings, ideas, skills, and affection. Unlike other informal and casual get-togethers, our intergenerational program was scientifically designed and researched to encourage these interactions and allow our seniors to participate fully - from disabled and frail elders to sufferers of dementia and Parkinsons.\nCustomized Programs - Home Care - A participants time with SarahCares specially-trained staff doesnt have to stop at the end of the day. Some seniors who are still living independently at home may require assistance during evenings and weekends, when they cant spend time at the center. Or, if a loved one resides with their family, occurrences may come up that require the family to be away from home during an evening or weekend when your senior requires care.\nFranchisees - Our franchisees pay us a variety of royalties and fees. Typical locations are commercial or professional office locations convenient to working caregivers. The approximate size of a SARAH Business facility is 5,000-6,000 square feet. Rent is estimated to be $96,000-$140,000 annually depending on size, condition and location of leased premises.\nState and Federal Licenses. Both the company owned centers and the franchise centers acquire the required licenses prior to opening in their respective states. Not all states, such as Ohio, require a license to operate an ADHC (Adult Day Health Center), while other states, such as Pennsylvania, have strict licensing regulations. If a center wants to accept Medicaid participants, then they must complete the Medicaid certification process. The VA (Veterans Affairs) has their own standards and survey process in order to obtain an agreement/contract with the VA. All of these programs are administered by individual states. Every center follows the regulations as interpreted by the VA center in the specific area in which their center is located.\nThe federal program the Child Adult Food Care Program (CACFP) is for the reimbursement of food, and is administered by the Department of Agriculture. If a center wants to utilize CACFP, then they must complete the Department of Agricultures application and survey process.\nAll centers are surveyed annually by their state licensing department (if applicable), Medicaid, the VA, the CACFP (if applicable) and any additional funding source they may be using. In addition, most centers are surveyed by their local Health and Fire Departments annually.\nGoods and Services One Must Acquire From An Approved Supplier Or In Accordance With Our Standards and Specifications\nThe trademarks, trade names, service marks, and logos must be properly depicted on any brochures, business cards and stationery, signage, forms, and public relations materials you purchase for use in your operation of the SARAH Business. These items, and other products, supply items and services, may be purchased from any source; however, we retain the right to, at any time in the future, condition the right to buy or lease goods and/or services on their meeting minimum standards and specifications and/or being acquired from suppliers we specifically designate or approve. We may issue and modify standards from time to time and enumerate them in our Operations Manual or other communications.\nA Franchisee must purchase software to be used in the operation of the SARAH Business from a designated supplier. They may acquire certain pre-approved social media channels and online content for the SARAH Business only through us or our designated supplier. (Currently our System standards include Facebook, YouTube, Twitter, Instagram, Pinterest, and LinkedIn and no other channels, as approved social media outlets through which SARAH Businesses may be promoted.) A Franchisee must use the e-mail accounts we provide to you. We also currently recommend that they use our approved suppliers for: real estate site selection services; furniture, fixtures and equipment; marketing materials; computer software, and printing services. Otherwise, there currently are no goods, services, supplies, fixtures, equipment, inventory, computer hardware, real estate, or comparable items related to establishing or operating the SARAH Business that you must buy from us, our affiliate, or an approved supplier. None of our officers currently owns an interest in any supplier to SARAH Businesses.\nIf a Franchisee wants to purchase or lease any product, supply, item or service from a supplier or provider that we have not already approved, they must first obtain our approval. They may request our approval by providing us with a sample of the item they would like us to approve. We will use commercially reasonable efforts to notify the Franchisee within 30 days after receiving all samples and any other requested information or specifications, whether they are authorized to purchase or lease the product or service from that supplier or provider. We do not charge a fee for engaging in this approval process.\nIn the event we receive rebates from any suppliers to our franchisees, these funds will be used for marketing and promotional purposes. We estimate that, collectively, the purchases and leases you obtain according to our specifications or from approved or designated suppliers represent between 2.5%-7.5% of your total purchases and leases in connection with the establishment and operation of the SARAH Business. During the fiscal year ending June 30, 2022, we did not receive any rebates or other payments from suppliers based on their sales to franchisees and neither we nor our affiliates sold or leased any products or services to franchisees.\nInsurance\nBesides these purchases or leases, a potential Franchisee must obtain and maintain, at their own expense, the insurance coverage that we periodically require and satisfy other insurance-related obligations. They currently must obtain the following insurance: (i) comprehensive commercial general liability insurance, including bodily injury, property damage, personal injury, products and completed operations liability coverage with a combined single limit of not less than $1,000,000 per occurrence for bodily injuries, $1,000,000 per occurrence for property damage and $2,000,000 annual aggregate, (ii) workers compensation and employers liability insurance to meet statutory requirements of that of operation where the SARAH Business is located; (iii) commercial property insurance at replacement value, including fire, vandalism, and extended coverage insurance with primary and excess limits of not less than the full replacement value of the SARAH Business and its furniture, fixtures and equipment; (iv) automobile liability insurance for all owned, non-owned and hired automobiles with a single coverage limit of not less than $1,000,000; (v) other insurance as may be required by the state or locality in which the SARAH Business is located and operated; and (vi) professional liability insurance of not less than $1,000,000. All of the policies they maintain must contain the minimum coverage described above and must have deductibles not to exceed the amounts we specify. Each of the insurance policies must be issued by an insurance company of recognized responsibility and satisfactory to us. We may periodically increase the amounts of coverage required under these insurance policies and/or require different or additional insurance coverages at any time. The commercial general liability, automobile, and umbrella insurance policies must list us as additional insured parties and provide for 30 days prior written notice to us in the event of a policys material modification, cancellation, or expiration. They must furnish us with a copy of your Certificate of Insurance within 10 business days upon receipt of your Occupancy Permit for the SARAH Business. If they fail or refuse to obtain or maintain the insurance we specify, in addition to our other remedies including termination, we may obtain such insurance for you and the SARAH Business, on the potential Franchisees behalf, in which event they must cooperate with us and reimburse us for all premiums, costs and expenses we incur in obtaining and maintaining the insurance, plus a reasonable fee for our time incurred in obtaining such insurance.\nAdvertising Materials\nBefore a potential Franchisee uses them, they must send to us for review samples of all advertising, promotional and marketing materials which we have not prepared or previously approved. They must not use any advertising, promotional, or marketing materials that we have not approved or have disapproved. During approximately the first 3 months of operating the SARAH Business, we will use the Marketing Deposit to pay vendors selected to provide advertising and related services for the promotion of the SARAH Business, which may include, for example, arranging online Internet advertising and marketing content, including Facebook, YouTube, Twitter, Instagram, Pinterest, LinkedIn or other social media outlets and paying click-through charges to search engines, banner advertising sources, and advertising host sites to promote the SARAH Business. We may develop certain promotional materials and/or designate or approve specific suppliers of promotional materials during the franchise term that we may require them to purchase and use. All online marketing activities you conduct for the SARAH Business must meet our then-current guidelines for franchisee use of social media that we include as part of the Operations Manual or otherwise communicate as part of our System standards.\nDevelopment of Your SARAH Business\nA potential Franchisee is responsible for locating, obtaining, and developing a site for the SARAH Business within the Territory. They must submit a proposed site for the SARAH Business for our approval in a form we specify that includes detailed construction drawings and other site-specific information. After we approve a site for the SARAH Business, they are responsible for constructing and equipping the SARAH Business at that site. They may not begin developing any site or constructing or remodeling any structures or fixtures before we have approved the site. They may consult with real estate and other professionals of their choosing, and we may also assist you in the development of the SARAH Business. They must submit to us for our approval detailed plans and specifications adopting our then-current plans and specifications for SARAH Businesses.\nSarahCare, as the franchisor, supplies the Franchisees with initial assistance and approval with the following:\n1.\nGive you our site selection criteria for the SARAH Business and, upon a potential Franchisees request, provide input regarding possible sites. We do not own and lease any site to franchisees. After they select and we approve a site, we will designate the geographic area within which they may establish the SARAH Business.\n2.\nApprove the signage.\n3.\nIdentify the standards and specifications for products, services, and materials that comply with the System, and, if we require, the approved suppliers of these items. We will furnish a potential Franchisee with the listing of the package of initial franchise items as detailed in the Operations Manual. Neither we nor our affiliate provide, deliver, or install any of these items.\n4.\nProvide an Initial Training Program.\n5.\nProvide an Operations Training Program.\nOnce the Franchisees SarahCare business is operational, we will:\n1.\nIssue and modify System standards for SARAH Businesses.\n2.\nProvide access to a copy of our Operations Manual as we make available through our intranet. The Operations Manual contains mandatory and suggested specifications, standards and operating procedure.\n3.\nGive you additional or special guidance and assistance and training as we deem appropriate and for which a potential Franchisee are financially responsible.\n4.\nInspect and observe the operation of the SARAH Business to help a potential Franchisee comply with the Franchise Agreement and all System standards.\n5.\nLet you use the confidential information.\n6.\nLet you use the Marks.\nOpening\nWe estimate that a potential Franchisee will open the SARAH Business within 8 to 10 months after they sign the Franchise Agreement. The interval between signing the Franchise Agreement and opening the SARAH Business depends on the sites location and condition, the construction schedule for the SARAH Business, the extent to which they must upgrade or remodel an existing location, the delivery schedule for equipment and supplies, securing financing arrangements, completing training, and complying with local laws and regulations.\nCurrent Locations\nBelow is a list of our current franchised (24) locations:\nCalifornia - 450 Marathon Dr. Campbell, CA 95008\nConnecticut - 870 Burnside Avenue East Hartford, CT 06108\nFlorida - 1504 S. Harbor City Blvd. Melbourne, FL 32901\n1200 N. University Dr. Pembroke Pines, FL 33024\n754 Riverside Drive, Coral Springs, FL 33071\nGeorgia - 801 Oakhurst Drive Evans, GA 30808\n286 SW Highway 138 Riverdale, GA 30078\nIdaho - 1655 S. Vinnell Boise, ID 83709\nIndiana - 2805 E. 96th Indianapolis, IN 46240\nMassachusetts - 1225 Dorchester Avenue Dorchester, MA 02125\n1217 Grafton St. Worcester, MA 01604\nMichigan - 2211 E. Beltline Ave. NE Suites B & C Grand Rapids, MI 49525\n13425 19 Mile Rd., Suite 500 Sterling Heights, MI 49519\n2024 Health Dr., Suite B Wyoming, MI 49519\nNew Jersey - 1115 Glove Avenue, Mountainside, NJ 07092\nNorth Carolina - 2245 Gateway Access Pt. Suite 101 Raleigh, NC 27607\nOhio - 10901 Prospect Road Strongsville, OH 44149\nPennsylvania - 7010 Snowdrift Rd. Allentown, PA 18106\n261 Old York Rd., Suite A51 Jenkintown, PA 19046\n425 Technology Dr. Malvern, PA 19355\n2030 Ardmore Blvd. Pittsburgh, PA 15221\n1726 S. Broad St, Philadelphia, PA 19145\nTexas - 157 Nursery Road The Woodlands, TX 77380\n23972 Highway 59 N. Kingwood, TX 77339\nWe have two international centers in the United Arab Emirates and Saudi Arabia, that are franchised, but are not yet open. We do not have an expected date as to when they will be open, if ever.\nBelow is a list of our current corporate (2) locations:\nSarahCare of Belden - 6199 Frank Ave NW, North Canton, OH 44720\nSarahCare of Stow - 4472 Darrow Road, Stow, OH 44224\nOur Growth Strategy\nOur sales and marketing teams intend to leverage our value proposition and strong participant satisfaction to promote our brand and attract new participants to our centers. The size of our centers depends on the size of the addressable population within each service area. We first determine whether we can fill a centers expected participant census, then, as a center reaches its initial capacity, we plan to increase its size through pre-planned facility expansions. Once we have reached planned capacity, we intend to expand to other locations.\nOur growth strategy includes renewing our current franchised locations. Recently, SarahCare renewed its agreements regarding two SarahCare franchised locations, one in The Woodlands, Texas, and one in Kingwood, Texas. Both renewals are for five years.\nLeasing New Market Space\nWe plan to build new centers or lease from existing market space to enter new markets for our daycare centers into adjacent or new geographies.\nThe placement of our centers in attractive locations is critical to our success. We regularly conduct zip code level analyses and convene small focus groups with potential participants and caregivers to identify service areas with attractive concentrations of seniors eligible for our daycare services and select optimal sites for our centers. We prioritize service areas with populations that include more than 4,000 potential participants within a 60-minute drive of a center. Our approach to building new daycare centers or leasing space in favorable market areas is based on our experience-based specifications, with flexibility for future center expansion factored into the blueprints where possible.\nOn April 21, 2021, the Company, through ten newly-formed, wholly-owned limited liability companies, entered into lease agreements with entities controlled by our Chairman, Charles Everhardt, for ten additional SarahCare locations to be operated by the Company. All of the leases are for a ten-year period beginning on July 1, 2021, and ending on June 30, 2031, with a 5-year renewal option. The rent for each location is $7,500 per month. As of June 30, 2021, the Company amended the leases to delay commencement until November 1, 2021.As of November 1, 2021, the Company amended the leases to delay commencement until May 1, 2022. As of April 30, 2022, the Company amended the leases to delay commencement until November 1, 2022. On August 19, 2022, the Company and landlord mutually agreed to terminate the Austin lease.\nThe nine locations are as follows:\nTexas - 9090 Southwest Freeway, Houston, TX 77074 - approximately 8,500 sq. ft.\nOhio - 33 East 5th Street, Dayton, OH 45402 - approximately 8,500 sq. ft.\nMississippi - 200 E Amite Street, Jackson, MS 39201 - approximately 8,500 sq. ft.\nGeorgia - 1775 Parkway Place SE, Marietta, GA 30067 - approximately 8,500 sq. ft.\nTennessee - 2625 Thousand Oaks, Memphis, TN 38118 - approximately 8,500 sq. ft.\nFlorida - 3835 McCoy Road, Orlando, FL 32812 - approximately 8,500 sq. ft.\nPennsylvania - 1741 Papermill Road, Wyomissing, PA 19610 - approximately 8,500 sq. ft.\nNew Jersey - 1 West Lafayette Street, Trenton, NJ 08608 - approximately 8,500 sq. ft.\nOklahoma - 7902 South Lewis Avenue, Tulsa, OK 74136 - approximately 8,500 sq. ft.\nPotential Acquisitions\nWe believe we are the logical acquiror in a fragmented market made up of mostly small independent local operators. We are looking for potential acquisitions in new geographic markets along with existing markets that meet certain criteria. We maintain discipline in our approach in regards to purchase price for acquisitions. We consider many factors in determining the purchase price that include potential market expansion, healthcare employee base, demographics of our target market of seniors, daycare demand both future and present is also considered along with other factors before a decision is made to acquire a potential acquisition target. We work closely with key constituencies, including local governments, health systems and senior housing providers, to ensure participants continue to receive the high quality care we demand in our operations and that potential acquisition targets can achieve our important quality standards.\nReinvest in our Technology\nWe are continuing to examine ways to improve and enhance our technology offerings to improve efficiencies in our operations. Further, we are evaluating new software and medical device technology to use at our centers to help with our participants who are experiencing chronic conditions. We believe placing new technologies at our centers to further meet the needs of our participants will help us to stand out in the daycare market and attract further participants to our centers. As we continue to evaluate new ways of bringing new technologies and efficiencies to our operations, we believe we will be able to attract new participants and potentially reduce medical costs.\nIndustry Overview\nHealthcare spending in the United States has grown at approximately 5% per year from 2013 to 2018, and in 2018 represented $3.6 trillion of annual spend, or 17.7% of U.S. GDP. The overall growth rate of healthcare spending is expected to accelerate due to the aging population. Furthermore, the governments share of total healthcare spend through programs such as Medicare and Medicaid is expected to grow from approximately 37% today to more than 40% as early as 2025, indicating faster growth in government-sponsored healthcare than the overall market. There are approximately 6,000 senior daycare centers across the United States. The industry market size is approximately $6.4 billion and expected to rise 25% over the next five years. Each senior daycare center has an average of 60 participants with daily participants of 351,900 using senior daycare services.\nEmployees\nAs of June 30, 2022, the Company had 40 employees. This does not include the employees of the independently owned and run franchise locations.\nIntellectual Property\nThe Company owns the following intellectual property (trademarks): SarahCare and Sarah Adult Day Services.\nCompetition\nThere are approximately 4,600 adult day care centers (from the CDC) in the U.S. may be part of stand-alone adult centers specifically set up to provide day care to seniors, 70 percent are affiliated with or operate within senior centers, churches, medical centers or residential care facilities. Two of our larger competitors include Active Day, with approximately 100 locations, and Easter Seals, a non-profit with 69 affiliates. Programs run from several hours to a full day. Participants may attend daily, a few times a week, weekly, or just for special activities. Weekend and evening care are less common, although this is changing as demand for adult day care rises. We also compete with home care and in-home medical care professionals and enterprises.\nGovernmental Regulations\nWe will be governed by government laws and regulations governing adult day care facilities. We believe that we are currently in compliance with all laws which govern our operations and have no current liabilities thereunder. Our intent is to maintain strict compliance with all relevant laws, rules and regulations.\nReports to Security Holders\nWe intend to furnish our shareholders annual reports containing financial statements audited by our independent registered public accounting firm and to make available quarterly reports containing unaudited financial statements for each of the first three quarters of each year. We file Quarterly Reports on Form 10-Q, Annual Reports on Form 10-K and Current Reports on Form 8-K with the Securities and Exchange Commission in order to meet our timely and continuous disclosure requirements. We may also file additional documents with the Commission if they become necessary in the course of our companys operations.\nThe public may read and copy any materials that we file with the SEC at the SECs Public Reference Room at 100 F Street, NE, Washington, D.C. 20549. The public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The address of that site is www.sec.gov.\nEnvironmental Regulations\nWe do not believe that we are or will become subject to any environmental laws or regulations of the United States. While our products and business activities do not currently violate any laws, any regulatory changes that impose additional restrictions or requirements on us or on our products or potential customers could adversely affect us by increasing our operating costs or decreasing demand for our products or services, which could have a material adverse effect on our results of operations. Item 1A. Risk Factors\nAs a smaller reporting company, we are not required to provide the information required by this item. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties\nAs of June 30, 2022, the Company maintains its corporate address in at 2310 York Street, Suite 200, Blue Island, IL, 60406. This space is provided by the Companys Chairman, Charles Everhardt, a related party, on a rent free basis at the present time. The Company does not currently have a lease for this space at this time but expects to enter into a month-to-month office lease for this space.\nSarahCare leases three properties for its corporate office and its two corporate owned centers. SarahCares corporate office is approximately 3,470 square feet and is located at 4580 Stephen Circle NW, Canton, Ohio, 44718. The lease began in 2017 and ends in 2023.\nSarahCares lease for its first corporate-owned SarahCare location is for approximately 5,300 square feet located at 6199 Frank Ave. NW, North Canton, Ohio, 44720. The lease began in 2018 and ends in 2026.\nSarahCares lease for its second corporate-owned SarahCare location is for approximately 6,000 square feet located at SarahCare of Stow, 4472 Darrow Road, Stow, Ohio, 44224. The lease began in 2018 and ends in 2026.\nOn April 21, 2021, the Company, through ten newly-formed, wholly-owned limited liability companies, entered into lease agreements with entities controlled by our Chairman, Charles Everhardt, for ten additional SarahCare locations to be operated by the Company. All of the leases are for a ten-year period beginning on July 1, 2021, and ending on June 30, 2031, with a 5-year renewal option. The rent for each location is $7,500 per month. As of the June 30, 2021, the Company amended the leases to delay commencement until November 1, 2021. As of November 1, 2021, the Company amended the leases to delay commencement until May 1, 2022. As of April 30, 2022 the Company amended the leases to delay commencement until November 1, 2022. On August 19, 2022, the Company and landlord mutually agreed to terminate the Austin lease.\nThe 9 leases are in the following locations:\nTexas - 9090 Southwest Freeway, Houston, TX 77074 - approximately 8,500 sq ft.\nOhio - 33 East 5th Street, Dayton, OH 45402 - approximately 8,500 sq, ft.\nMississippi - 200 E Amite Street, Jackson, MS 39201 - approximately 8,500 sq, ft.\nGeorgia - 1775 Parkway Place SE, Marietta, GA 30067- approximately 8,500 sq, ft.\nTennessee - 2625 Thousand Oaks, Memphis, TN 38118- approximately 8,500 sq, ft.\nFlorida - 3835 McCoy Road, Orlando, FL 32812- approximately 8,500 sq, ft.\nPennsylvania - 1741 Papermill Road, Wyomissing, PA 19610- approximately 8,500 sq, ft.\nNew Jersey - 1 West Lafayette Street, Trenton, NJ 08608- approximately 8,500 sq, ft.\nOklahoma - 7902 South Lewis Avenue, Tulsa, OK 74136- approximately 8,500 sq, ft. Item 3. Legal Proceedings\nFrom time to time, we may be involved in litigation relating to claims arising out of our operations in the normal course of business. Other than disclosed herein, there were no pending or threatened lawsuits that could reasonably be expected to have a material effect on the results of our operations.\nAs of June 30, 2022, we were not a party to any material legal proceedings. We currently have twenty (20) convertible promissory notes that are in default, and we may be subject to legal proceedings or lawsuits from any number of those convertible noteholders, including the below.\nOn April 7, 2013, three note holders (Brook Hazelton, Benjamin M. Manalaysay, Jr., and Diego McDonald, the Plaintiffs), whom together invested a total principal amount of $45,000 in the form of Convertible Promissory Notes (the Notes) to the Company, together filed a Notice of Commencement of Action Subject to Mandatory Electronic Filing in the Supreme Count of the State of New York, County of New York. The Plaintiffs alleged that the Company breached their contracts with the Plaintiffs and included causes of action for unjust enrichment and related claims, seeking repayment of each of their respective convertible promissory notes plus interest. On or about February 24, 2014, the three Plaintiffs received judgment against the Company from the court in the amounts of $33,686.82, $8,546.87 and $33,696.69, respectively.\nOur wholly owned subsidiary, SarahCare, is not involved in any legal proceedings at this time.\nAs of the date of this Annual Report, no director, officer or affiliate is (i) a party adverse to us in any legal proceeding, or (ii) has an adverse interest to us in any legal proceedings. Management is not aware of any other legal proceedings pending or that have been threatened against us or our properties. Item 4. Mine Safety Disclosures\nNot applicable to our Company.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nThe Companys common stock is traded on the OTC Link ATS (the alternative trading system operated by OTC Markets Group, Inc.) under the symbol IMTH. As of June 30, 2022, the Companys common stock was held by 168 shareholders of record, which does not include shareholders whose shares are held in street or nominee name.\nThe Companys shares commenced trading on or about May 7, 2007. On February 11, 2021, the Company filed with FINRA to effectuate a 10,000:1 reverse stock split. FINRA permitted this corporate actions on March 8, 2021. The 10,000:1 reverse split took effect at the open of business on March 9, 2021.\nThe following information reflects the high and low prices of the Companys common stock, and the Companys reverse stock split is reflected in the increase in the high and low bid prices for the fourth quarter of 2022. High and low prices are from prices reported by OTCMarkets.com.\nQuarterly period\nHigh\nLow\nFiscal year ended June 30, 2022:\nFirst Quarter\n$ 1.765\n$ 0.35\nSecond Quarter\n$ 1.59\n$ 0.28\nThird Quarter\n$ 1.84\n$ 0.53\nFourth Quarter\n$ 3.49\n$ 0.80\nFiscal year ended June 30, 2021:\nFirst Quarter\n$ 0.0002\n$ 0.0001\nSecond Quarter\n$ 0.0003\n$ 0.0001\nThird Quarter\n$ 0.0024\n$ 0.0001\nFourth Quarter\n$ 4.99\n$ 0.90\nWe have engaged Clear Trust Transfer as the Companys transfer agent to serve as agent for shares of our common stock, Series A Convertible Preferred Stock, and Series B Convertible Preferred Stock. Our transfer agents contact information is as follows:\n16540 Pointe Village Dr., Suite 205\nLutz, FL 33558\nTelephone: (813) 235-4490\nDividend Distributions\nWe have not paid any cash dividends on our common stock and have no present intention of paying any dividends on the shares of our common stock. Our current policy is to retain earnings, if any, for use in our operations and in the development of our business. Our future dividend policy will be determined from time to time by our board of directors.\nSecurities authorized for issuance under equity compensation plans\nThe Company does not have a stock option plan.\nPenny Stock\nOur common stock is considered penny stock under the rules the Securities and Exchange Commission (the SEC) under the Securities Exchange Act of 1934. The SEC has adopted rules that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a price of less than $5.00, other than securities registered on certain national securities exchanges or quoted on the NASDAQ Stock Market System, provided that current price and volume information with respect to transactions in such securities is provided by the exchange or quotation system. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock, to deliver a standardized risk disclosure document prepared by the Commission, that:\n·\ncontains a description of the nature and level of risks in the market for penny stocks in both public offerings and secondary trading;\n·\ncontains a description of the broker's or dealer's duties to the customer and of the rights and remedies available to the customer with respect to a violation to such duties or other requirements of Securities' laws; contains a brief, clear, narrative description of a dealer market, including bid and ask prices for penny stocks and the significance of the spread between the bid and ask price;\n·\ncontains a toll-free telephone number for inquiries on disciplinary actions;\n·\ndefines significant terms in the disclosure document or in the conduct of trading in penny stocks; and\n·\ncontains such other information and is in such form, including language, type, size and format, as the Commission shall require by rule or regulation.\nThe broker-dealer also must provide, prior to effecting any transaction in a penny stock, the customer with:\n·\nbid and offer quotations for the penny stock;\n·\nthe compensation of the broker-dealer and its salesperson in the transaction;\n·\nthe number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the marker for such stock; and\n·\nmonthly account statements showing the market value of each penny stock held in the customers account.\nIn addition, the penny stock rules that require that prior to a transaction in a penny stock not otherwise exempt from those rules; the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written acknowledgement of the receipt of a risk disclosure statement, a written agreement to transactions involving penny stocks, and a signed and dated copy of a written suitably statement.\nThese disclosure requirements may have the effect of reducing the trading activity in the secondary market for our stock.\nRelated Stockholder Matters\nNone.\nPurchase of Equity Securities\nNone.\nRecent Sales of Unregistered Equity Securities\nDuring the fiscal quarter ended June 30, 2022, the Company did not have any unregistered sales of any equity securities, except as described below.\nOn or about April 26, 2022, the Company issued the Sellers of Vitality RX, Inc. 5,500,000 common shares, par value, $0.000001 per share, valued at $5,500,000. These shares were issued pursuant to the exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933, as amended, as there was no general solicitation, and the transaction did not involve a public offering.\nOn or about April 26, 2022, the Company issued the Sellers of Vitality RX, Inc. 50,000 shares of Series A Convertible Preferred Stock, par value, $0.000001 per share, valued at $5,000,000. These shares were issued pursuant to the exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933, as amended, as there was no general solicitation, and the transaction did not involve a public offering. Item 6. Selected Financial Data\nAs the Company is a smaller reporting company, this item is inapplicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThis Annual Report on Form 10-K contains forward-looking statements within the meaning of Rule 175 of the Securities Act of 1933, as amended, and Rule 3b-6 of the Securities Act of 1934, as amended, that involve substantial risks and uncertainties. These forward-looking statements are not historical facts, but rather are based on current expectations, estimates and projections about our industry, our beliefs and our assumptions. Words such as anticipate, expects, intends, plans, believes, seeks and estimates and variations of these words and similar expressions are intended to identify forward-looking statements. These statements are not guarantees of future performance and are subject to risks, uncertainties and other factors, some of which are beyond our control and difficult to predict and could cause actual results to differ materially from those expressed or forecasted in the forward-looking statements. You should not place undue reliance on these forward-looking statements, which apply only as of the date of this Form 10-K. Investors should carefully consider all of such risks before making an investment decision with respect to the Companys stock. The following discussion and analysis should be read in conjunction with our financial statements and summary of selected financial data for Innovative MedTech, Inc. Such discussion represents only the best present assessment from our Management.\nDESCRIPTION OF COMPANY\nInnovative MedTech, Inc. (the Company) was originally formed on April 21, 2005, in New Jersey as Serino 1, Corp.,. On December 16, 2005, the Company merged with Fresh Harvest Products, Inc., and then changed its name to Fresh Harvest Products, Inc., and began operating as a natural and organic food and beverage company, changing its name to Fresh Harvest Products, Inc. In 2012, the Company redomiciled to Delaware and began focusing its efforts on developing software and mobile application development and video production and developing an e-book company, and in the intervening years, expanded its technology development and development efforts, creating a revenue sharing partnership with a mobile app, TreatER (available for free on the Apple App Store) in 2017, and in 2018, focusing on building a software program for financially valuing a film concept and mapping the predicted human behavior by region to films using a combination of geographical based social sentiment and the distribution data and financial performance of historically released films. On November 4, 2017, the Company redomiciled from New Jersey to Delaware, and changed its fiscal year end from October 31st to June 30th. On March 9, 2021, the Company effectuated a 10,000:1 reverse split, changed its stock symbol from FRHV to IMTH, and changed its name to Innovative MedTech, Inc. On March 25, 2021, the Company acquired two companies, Sarah Adult Day Services, Inc., and Sarah Day Care Centers, Inc. (collectively SarahCare), an adult day care center franchisor and provider. On March 25, 2021, the Company acquired two companies, Sarah Adult Day Services, Inc., and Sarah Day Care Centers, Inc. (collectively SarahCare), an adult day care center franchisor and provider. With 26 centers (2 corporate and 24 franchise locations) located in 13 states, SarahCare offers seniors daytime care and activities focusing on meeting their physical and medical needs on a daily basis, and ranging from nursing care to salon services and providing meals, to offering engaging and enriching activities to allow them to continue to lead active and engaged lives. We are now focusing all of our efforts on our senior care operations.\nThe Company has also been working on launching an RX Vitality wallet digital offering and mobile app which, once implemented and live, the Companys digital healthcare wallet will be able to be accessed by customers via mobile wallet on both the Apple iOS and Android App Stores. The Company intends to have a physical healthcare card as well.\nOn April 1, 2022, the Company partnered with TruCash Group of Companies Inc. (TruCash), a leading global payments provider, to launch an all-in-one Super Healthcare App, called RX Vitality Wallet, that will be designed to cater to consumers, patients, hospitals, Seniors, and governments, with a solid platform of benefits and online banking. The RX Vitality digital healthcare wallet is being designed to offer 20%-75% pharmaceutical discounts at 65,000 pharmacies across the United States, including Walgreens and CVS. In addition, we plan to offer health and wellness discounts at 500+ online merchants, as well as earning points on our Loyalty Program. The Company intends to generate revenue from its digital wallet and mobile app in multiple ways, including but not limited to monthly recurring fees, transfer fees, and the inter-exchange rate. On June 15, 2022, the Companys RX Vitality digital healthcare wallet became available for download at the Apple iOS App store for Apple iPhone users. The Companys app has also been approved and is available on the Google Play Store.\nOn April 5, 2022, the Company engaged mPulse Mobile, a leader in conversational AI and digital engagement solutions for the healthcare industry, to drive engagement with the Companys digital app and wallet (currently under development).\nOn April 28, 2022, the Company entered into a share exchange agreement to acquire RX Vitality, Inc. (RX Vitality), a media and finance advisory company.\nOn May 13, 2022, the Company entered into a partnership with VSUSA Corp. (VSUSA), a non-for-profit organization that empowers Veterans and Seniors by offering services designed to build successful life transitions with access to workforce and independent housing; health services; and social service programs in communities across the United States. The partnership will permit the Company to use the VSUSA logo on the back of its Vitality Debit Card. For this the Company will give up to 1% of its revenue generated from its Vitality Debit Card to VSUSA. The Companys Chairman is a principal and co-Founder of VSUSA.\nOn June 1, 2022, the Company announced that Dr. Merle Griff, SarahCares Founder and CEO, will also be CEO of the Company.\nThe following Management Discussion and Analysis should be read in conjunction with the financial statements and accompanying notes included in this Form 10-K.\nCOMPARISON OF THE YEAR ENDED JUNE 30, 2022 TO THE YEAR ENDED JUNE 30, 2021\nResults of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with the financial statements and notes thereto for the years ended June 30, 2022 and 2021, and related management discussion herein.\nOur financial statements are stated in U.S. Dollars and are prepared in accordance with generally accepted accounting principles of the United States (GAAP).\nGoing Concern Qualification\nSeveral conditions and events cast substantial doubt about the Companys ability to continue as a going concern. The Company has incurred cumulative net losses of $32,903,328 since its inception and requires capital for its contemplated operational and marketing activities to take place. The Companys ability to raise additional capital through debt or future issuances of capital stock is unknown. The obtainment of additional financing, the successful development of the Companys contemplated plan of operations, and its transition, ultimately, to the attainment of profitable operations are necessary for the Company to continue operations. The ability to successfully resolve these factors raises substantial doubt about the Companys ability to continue as a going concern.\nOperating Results\nOur operating results for the years ended June 30, 2022 and 2021, and the changes between those periods for the respective items, are summarized as follows:\nYear Ended\nJune 30,\nChange\nAmount\nOperating loss\n$ (18,258,093 )\n$ (708,875 )\n$ (17,549,218 )\nOther income (expense)\n199,739\n(2,556,082 )\n2,755,821\nNet loss\n$ (18,058,354 )\n$ (3,264,957 )\n$ (14,793,397 )\nRevenues\nOur revenue increased to $1,297,613 for the year ended June 30, 2022, from revenue of $349,143 in the comparative year ended June 30, 2021, due primarily to the reduced number of closures of our SarahCare centers due to Covid-19 during the most recent fiscal year as compared to the prior fiscal year. The following table presents revenue expenses for the years ended June 30, 2022 and 2021:\nYear Ended\nJune 30,\nChange\nAmount\nPatient fees\n$ 794,027\n$ 196,332\n$ 597,695\nFranchise fees\n503,586\n152,811\n350,775\nTotal revenue\n$ 1,297,613\n$ 349,143\n$ 948,470\nOperating Loss\nOur loss from operations increased to $18,258,093 during the year ended June 30, 2022, from an operating loss of $708,875 in the comparative year ended June 30, 2021. The following table presents operating expenses for the years ended June 30, 2022 and 2021:\nYear Ended\nJune 30,\nChange\nAmount\nPercentage\nGeneral and administrative\n$ 933,268\n$ 295,475\n$ 637,793\n215.85 %\nSalaries and wages\n921,022\n197,883\n723,139\n365.44 %\nLicensing fees\n750,000\n-\n750,000\n100 %\nConsulting fees\n16,838,885\n305,000\n16,533,885\n5,420.95 %\nLegal and professional fees\n112,531\n259,660\n(147,129 )\n(56.66\n%)\nTotal operating expenses\n$ 19,555,706\n$ 1,058,018\n$ 18,497,688\n1,748.33 %\nThe Company recorded $933,269 in general and administrative fees during the year ended June 30, 2022, as compared to $295,475 for the prior fiscal year, with the increase primarily due to the Companys stock exchange with Vitality RX and increased administrative expenses associated with it. We realized a decrease of $147,129 in legal and professional fees during the year ended June 30, 2022, as compared to the same period in the prior fiscal year. We realized an increase of $723,139 in salaries and wages during the year ended June 30, 2022, as compared to the same period in the prior fiscal year, primarily due to increasing operations during the most recent fiscal year as compared to the prior fiscal year. Stock-based compensation increased from $0 during the year ended June 30, 2021, to $16,628,360 during the year ended June 30, 2022, primarily due to consulting arrangements with the former principals of Vitality RX during the most recent fiscal year.\nOther Income (Expense)\nThe following table presents other income and expenses for the year ended June 30, 2022 and 2021:\nYear Ended\nJune 30\nLoss on extinguishment of debt\n$ -\n$ (1,660,797 )\nLoss on impairment of goodwill\n-\n(806,690 )\nInterest expense, related parties\n(8,972 )\n-\nInterest expense\n(182,500 )\n(172,286 )\nImpairment of ROU asset\n(84,364 )\n-\nChange in fair value of derivatives\n28,115\n(223,264 )\nGain on disposal of fixed assets\n-\n2,695\nOther income\n180,820\n131,740\nGain on PPP loan forgiveness\n266,640\n172,520\nTotal other income (expense)\n$ 199,739\n$ (2,556,082 )\nDuring the year ended June 30, 2022, the Company did not recognize a loss on extinguishment of debt or impairment of goodwill, but it recognized a significant loss on extinguishment of debt and impairment of goodwill during the fiscal year ended June 30, 2021. During the year ended June 30, 2022, the Company did not recognize a gain on disposal of fixed assets (but it recognized a gain of $2,695 during the prior fiscal year), but it did recognize other income of $180,820 and a gain on the PPP loan forgiveness of $266,640, as compared to smaller other income and gain on PPP loan forgiveness amounts during the prior fiscal year. During the year ended June 30, 2022, interest expense decreased to $182,500 from $172,286 for the prior fiscal year ended June 30, 2021, and interest expense, related parties, increased to $8,972 from $0 for the prior fiscal year. During the year ended June 30, 2022, there was a decrease in the fair value of derivatives declined to $28,115 from ($233,264) for the prior fiscal year ended June 30, 2021.\nNet Loss\nThe Company incurred a $18,058,354 net loss during the year ended June 30, 2022, compared to net loss of $3,264,957 in the prior fiscal year. The increasing net loss is primarily due to the increase in the Companys operating expenses, specifically its stock compensation expense due to consulting arrangements with the former principals of Vitality RX during the most recent fiscal year ended June 30, 2022, partially offset by increasing other income.\nLiquidity and Capital Resources\nBased upon our current financial condition, we do not have sufficient cash to operate our business at the current level for the next twelve months. We intend to fund operations through debt and/or equity financing arrangements, which may be insufficient to fund expenditures or other cash requirements. We plan to seek additional financing in a private equity offering to secure funding for operations. There can be no assurance that we will be successful in raising additional funding. If we are not able to secure additional funding, the implementation of our business plan will be impaired. There can be no assurance that such additional financing will be available to us on acceptable terms or at all.\nWorking Capital\nThe following table presents our working capital position as of June 30, 2022 and 2021:\nYear Ended\nJune 30,\nChange\nAmount\nPercentage\nCash\n$ 301,337\n$ 433,435\n$ (132,098 )\n(30.48%)\nAccounts receivable\n186,285\n178,555\n7,730\n4.33 %\nDeposits and Prepaid expenses\n-\n1,745\n-\n0.00 %\nNotes receivable\n27,289\n48,987\n(21,698 )\n(79.51\n%)\nCurrent Assets\n514,911\n662,722\n(147,811 )\n(28,71\n%)\nCurrent Liabilities\n3,852,427\n2,792,271\n1,060,156\n37.97 %\nWorking Capital (Deficit)\n$ (3,337,516 )\n$ (2,129,549 )\n$ 1,207,967\n56.72 %\nThe change in working capital during the year ended June 30, 2022, was primarily due to a decrease in current assets of $147,811 in conjunction with an increase in current liabilities of $1,060,157. Current assets decreased primarily due to a decrease in cash in the amount of $132,908. Current liabilities increased primarily due to the stock exchange with Vitality RX.\nCash Flow\nThe following tables presents our cash flow for the year ended June 30, 2022 and 2021:\nYear ended\n30-June\nCash from operating activities\n$ (582,878 )\n$ 28,100\nCash flows in investing activities\n(10,199 )\n(1,561,837 )\nCash from financing activities\n460,979\n1,966,406\nNet change in cash for the period\n$ (132,098 )\n$ 432,669\nCash Flows from Operating Activities\nFor the year ended June 30, 2022, net cash flows used in operating activities decreased to ($582,878) from $28,100 for the year ended June 30, 2021, due primarily to the Companys due to an increase in operating expenses during the most recent fiscal year.\nCash Flows from Investing Activities\nFor the year ended June 30, 2022, net cash flows used in investing activities decreased to ($10,199) from ($1,561,837) for the year ended June 30, 2021, due a decrease in investing activity during the most recent fiscal year.\nCash Flows from Financing Activities\nFor the year ended June 30, 2022, net cash flows from financing activities decreased to $460,979 from $1,966,406 for the year ended June 30, 2021, due to a decrease in proceeds from the sale of stock during the most recent fiscal year.\nOff Balance Sheet Arrangements\nWe currently have no off-balance sheet arrangements that have or are reasonably likely to have a current or future material effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires us to make a number of estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements. Such estimates and assumptions affect the reported amounts of revenues and expenses during the reporting period. We base our estimates on historical experiences and on various other assumptions that we believe to be reasonable under the circumstances. Actual results may differ materially from these estimates under different assumptions and conditions. We continue to monitor significant estimates made during the preparation of our financial statements. On an ongoing basis, we evaluate estimates and assumptions based upon historical experience and various other factors and circumstances. We believe our estimates and assumptions are reasonable in the circumstances; however, actual results may differ from these estimates under different future conditions.\nBasis of Presentation\nThe accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States (GAAP) and pursuant to the rules and regulations of the Securities and Exchange Commission (the SEC) and reflect all adjustments, consisting of normal recurring adjustments, which management believes are necessary to fairly present the financial position, results of operations and cash flows of the Company as of and for the years ended June 30, 2022 and 2021.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its consolidated subsidiaries. The ownership interest of consolidated entities not wholly-owned by the Company are presented as noncontrolling interests in the accompanying consolidated financial statements. Intercompany balances and transactions have been eliminated in consolidation, and net income (loss) is reduced by the portion of net income (loss) attributable to noncontrolling interests. The Company reports investments in unconsolidated entities over whose operating and financial policies it has the ability to exercise significant influence under the equity method of accounting.\nThe Company evaluates its potential variable interest entity (VIE) relationships under certain criteria as provided for in Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 810, Consolidation (ASC 810). ASC 810 broadly defines a VIE as an entity with one or more of the following characteristics: (a) the total equity investment at risk is insufficient to finance the entitys activities without additional subordinated financial support; (b) as a group, the holders of the equity investment at risk lack (i) the ability to make decisions about the entitys activities through voting or similar rights, (ii) the obligation to absorb the expected losses of the entity, or (iii) the right to receive the expected residual returns of the entity; or (c) the equity investors have voting rights that are not proportional to their economic interests, and substantially all of the entitys activities either involve, or are conducted on behalf of, an investor that has disproportionately few voting rights. The Company performs this evaluation on an ongoing basis and consolidates any VIEs for which the Company is determined to be the primary beneficiary, as determined by the Company's power to direct the VIE's activities and the obligation to absorb its losses or the right to receive its benefits, which are potentially significant to the VIE.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported revenues and expenses during the reporting periods. Because of the use of estimates inherent in the financial reporting process, actual results may differ significantly from those estimates.\nCash and Cash Equivalents\nThe Company maintains cash balances in a non-interest bearing account that sometimes exceeds over $250,000 federally insured limits. For the purpose of the statements of cash flows, all highly liquid investments with a maturity of three months or less are considered to be cash equivalents. There were no cash equivalents As of June 30, 2022 and 2021.\nEarnings Per Share Calculation\nBasic earnings per common share (EPS) is computed by dividing income available to common stockholders by the weighted-average number of common shares outstanding for the period. Diluted earnings per shares is computed by dividing net income by the weighted average shares outstanding, assuming all dilutive potential common shares were issued.\nRevenue Recognition\nParticipant Fees\nResident fee revenue is reported at the amount that reflects the consideration the Company expects to receive in exchange for the services provided. These amounts are due from participants or third-party payors and include variable consideration for retroactive adjustments from estimated reimbursements, if any, under reimbursement programs. Performance obligations are determined based on the nature of the services provided. Resident fee revenue is recognized as performance obligations are satisfied.\nUnder the Companys day care agreements, which are generally for a contractual term of 30 days to one year, the Company provides services to participants for a stated daily or monthly fee. The Company has elected the lessor practical expedient within ASC 842, Leases (ASC 842) and recognizes, measures, presents, and discloses the revenue for services under the Companys senior living residency agreements based upon the predominant component, either the lease or nonlease component, of the contracts. The Company has determined that the services included under the Company's independent living, assisted living, and memory care residency agreements have the same timing and pattern of transfer and are performance obligations that are satisfied over time. The Company recognizes revenue under ASC 606, Revenue Recognition from Contracts with Customers (ASC 606) for its participants agreements for which it has estimated that the nonlease components of such agreements are the predominant component of the contract.\nThe Company enters into contracts to provide home assisted health, and certain outpatient services. Each service provided under the contract is capable of being distinct, and thus, the services are considered individual and separate performance obligations. The performance obligations are satisfied as services are provided and revenue is recognized as services are provided.\nThe Company receives payment for services under various third-party payor programs which include Medicaid, Veterans Affairs and other third-party payors. Estimates for settlements with third-party payors for retroactive adjustments from estimated reimbursements due to audits, reviews, or investigations are included in the determination of the estimated transaction price for providing services. The Company estimates the transaction price based on the terms of the contract with the payor, correspondence with the payor, and historical payment trends. Changes to these estimates for retroactive adjustments are recognized in the period the change or adjustment becomes known or when final settlements are determined.\nBillings for services under third-party payor programs are recorded net of estimated retroactive adjustments, if any. Retroactive adjustments are accrued on an estimated basis in the period the related services are rendered and adjusted in future periods or as final settlements are determined. Contractual or cost related adjustments from Medicaid or Veterans Affairs are accrued when assessed (without regard to when the assessment is paid or withheld). Subsequent adjustments to these accrued amounts are recorded in net revenues when known.\nFranchise Fees\nThe Company franchises a number of its locations under franchise contracts which provide periodic franchise fee payments to the Company and reimbursement for costs and expense related to such franchises. Our franchisees pay us a variety of royalties and fees, including an agreed upon percentage of gross revenues (as defined in the franchise agreement). The Company estimates the amount of franchise fee revenue expected to be earned, if any, during the annual contract period and revenue is recognized as services are provided. The Companys estimate of the transaction price for the franchise services also includes the amount of reimbursement due from the franchises for services provided and related costs incurred. Such revenue is included in revenues on the consolidated statements of operations. The related costs are included in operating expenses on the consolidated statements of operations.\nIncome Taxes\nThe provision for income taxes is the total of the current taxes payable and the net of the change in the deferred income taxes. Provision is made for the deferred income taxes where differences exist between the period in which transactions affect current taxable income and the period in which they enter into the determination of net income in the financial statements.\nLeases\nIn December 2018, the FASB issued ASC 842 and as ASU 2016-02, is the new lease accounting standard published by the Financial Accounting Standards Board (FASB). It replaced the previous US GAAP leasing standard, ASC 840. The purpose of the new standard is to close a major accounting loophole in ASC 840: off-balance sheet operating leases. Public companies began to implement the standard starting after December 15, 2018. Private companies will follow a year later on December 15, 2020. ASC 842 represents a significant overhaul of the accounting treatment for leases, with the most significant change being that most leases, including most operating leases, are now capitalized on the balance sheet. Under ASC 840, FASB permitted operating leases to be reported only in the footnotes of corporate financial statements. Under ASC 842, the only leases that are exempt from the capitalization requirement are short-term leases less than or equal to 12 months in length. This became effective December 1, 2019 and the Company chose to adopt it early on December 1, 2018. The adoption did not have any material impact on the Companys consolidated financial statements as the Company has no long term leases.\nFair value of financial instruments\nThe Companys financial instruments include cash and cash equivalents, accounts payable, accrued liabilities, and debt. Derivative liabilities were adjusted to fair market value at the end of each reporting period, using Level 3 inputs. Fair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability, in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value must maximize the use of observable inputs and minimize the use of unobservable inputs. The fair value hierarchy is based on three levels of inputs, of which the first two are considered observable and the last unobservable, as follows:\n·\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\n·\nLevel 2 - Inputs other than Level 1 that are observable, either directly or indirectly, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\n·\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the measurement of the fair value of the assets or liabilities.\nThe carrying amounts of the Companys financial assets and liabilities, such as cash, accounts payable and accrued expenses, accrued interest, certain notes payable and notes payable - due to related parties, approximate their fair values because of the short maturity of these instruments.\nThe Company accounts for its derivative liabilities, at fair value, on a recurring basis under Level 3 (See Note 6).\nEmbedded Conversion Features\nThe Company evaluates embedded conversion features within convertible debt under Accounting Standards Codification (ASC) 815 Derivatives and Hedging to determine whether the embedded conversion feature(s) should be bifurcated from the host instrument and accounted for as a derivative at fair value with changes recorded in earnings. If the conversion feature does not require derivative treatment under ASC 815, the instrument is evaluated under ASC 470-20 Debt with Conversion and Other Options for consideration of any beneficial feature.\nDerivative Financial Instruments\nWhen the Company issues debt that contains a conversion feature, it first evaluates whether the conversion feature meets the requirements to be treated as a derivative: a) one or more underlying, typically the price of the Companys stock; b) one or more notional amounts or payment provisions or both, generally the number of shares upon conversion; c) no initial net investment, which typically excludes the amount borrowed; and d) net settlement provisions, which in the case of convertible debt generally means the stock received upon conversion can be readily sold for cash. There are certain scope exceptions from derivative treatment, but these typically exclude conversion features that provide for a variable number of shares.\nIf the conversion feature within convertible debt meet the requirements to be treated as a derivative, the Company estimates the fair value of the derivative liability using the Monte Carlo Simulation Model upon the date of issuance. If the fair value of the derivative liability is higher than the face value of the convertible debt, the excess is immediately recognized as interest expense. Otherwise, the fair value of the derivative liability is recorded as a liability with an offsetting amount recorded as a debt discount, which offsets the carrying amount of the debt. The derivative liability is revalued at the end of each reporting period and any change in fair value is recorded as a change in fair value in the statements of operations. The debt discount is amortized through interest expense over the life of the debt. Derivative instrument liabilities and the host debt agreement are classified on the balance sheets as current or non-current based on whether settlement of the derivative instrument could be required within twelve months of the balance sheet date.\nThe accounting treatment of derivative financial instruments requires that the Company record the embedded conversion option at their fair values as of the inception date of the agreement and at fair value as of each subsequent balance sheet date. Any change in fair value is recorded as non-operating, non-cash income or expense for each reporting period at each balance sheet date. The Company reassesses the classification of its derivative instruments at each balance sheet date. If the classification changes as a result of events during the period, the contract is reclassified as of the date of the event that caused the reclassification. As a result of entering into warrant agreements, for which such instruments contained a variable conversion feature with no floor, the Company has adopted a sequencing policy in accordance with ASC 815-40-35-12 Derivatives and Hedging (provides comprehensive guidance on derivative and hedging transactions) whereby all future instruments may be classified as a derivative liability with the exception of instruments related to share-based compensation issued to employees or directors.\nDebt Issue Costs and Debt Discount\nThe Company may record debt issue costs and/or debt discounts in connection with raising funds through the issuance of debt. These costs may be paid in the form of cash, or equity (such as warrants). These costs are amortized to interest expense over the life of the debt. If a conversion of the underlying debt occurs, a proportionate share of the unamortized amounts is immediately expensed.\nRecently Issued Accounting Pronouncements\nAs of and for the year ended June 30, 2022, the Company does not expect any of the recently issued accounting pronouncements to have a material impact on its financial condition or results of operations.\nSeasonality\nWe do not expect our sales to be impacted by seasonal demands for our products and services. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nAs the Company is a smaller reporting company, this item is inapplicable. Item 8. Financial Statements and Supplementary Data\nInnovative MedTech, Inc.\nPage\nReport of Independent Registered Public Accounting Firm (ID NO. 3289)\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Changes in Stockholders Deficit\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nof Innovative MedTech, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Innovative MedTech, Inc. (the Company) as of June 30, 2022 and 2021, and the related consolidated statements of operations, changes in stockholders equity and cash flows for the two years then ended, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt about the Companys ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2, the Company has incurred net losses and has limited revenues. These factors, and the need for additional financing in order for the Company to meet its business plans raises substantial doubt about the Companys ability to continue as a going concern. Our opinion is not modified with respect to that matter.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\n3001 N. Rocky Point Dr. East, Suite 200 * Tampa, Florida 33607 * 813.367.3527\nDerivatives\nAs described in Note 3 to the Companys consolidated financial statements, when the Company issues debt that contains a conversion feature, it first evaluates whether the conversion feature meets the requirements to be treated as a derivative. If the conversion feature within convertible debt meets the requirements to be treated as a derivative, the Company estimates and records the fair value of the derivative liability using the Monte Carlo Simulation Model upon the date of issuance. The derivative liability is revalued at the end of each reporting period.\nWe identified the Companys application of the accounting for convertible notes as a critical audit matter. The principal considerations for our determination of this critical audit matter related to the high degree of subjectivity in the Companys judgments in determining the qualitative factors. Auditing these judgments and assumptions by the Company involves auditor judgment due to the nature and extent of audit evidence and effort required to address these matters.\nThe primary procedures we performed to address these critical audit matters included the following:\n·\nWe obtained debt and warrant related agreements and performed the following procedures:\n-\nReviewed agreements for all relevant terms.\n-\nTested managements identification and treatment of agreement terms.\n-\nRecalculated managements fair value of each conversion feature based on the terms in the agreements.\n-\nAssessed the terms and evaluated the appropriateness of managements application of their accounting policies, along with their use of estimates, in the determination of the amortization of the debt discount.\n-\nReviewed the work of the Companys specialist to calculate the fair value of the derivative liability using the Monte Carlo method to determine whether the derivative liability recorded by the Company was reasonable.\nPurchase Price Allocation\nAs described in Note 4 to the Companys consolidated financial statements, the Company acquired two companies during the year ended June 30, 2021, with the purchase price allocation being completed during the year ended June 30, 2022. The Company accounted for the acquisition in accordance with ASC 805, Business Combinations.\nWe identified the Companys purchase price allocation for the business acquisitions as a critical audit matter. The principal considerations for our determination of this critical audit matter related to the high degree of subjectivity in the Companys judgments in determining the qualitative factors. Auditing these judgments and assumptions by the Company involves auditor judgment due to the nature and extent of audit evidence and effort required to address these matters.\nThe primary procedures we performed to address these critical audit matters included the following:\n·\nWe obtained the acquisition agreements and performed the following procedures:\n-\nReviewed agreements for all relevant terms, consideration and other relevant information.\n-\nTested supporting documentation related to the acquired companies in determining the identifiable assets and liabilities.\n-\nReviewed the guidance related to ASC 805 to determine the acquisitions were appropriately accounted for by the Company.\n-\nReviewed the work of the Companys specialist to allocate the purchase price to determine whether the assumptions used in the allocation were reasonable based on the circumstances.\n/s/ Accell Audit & Compliance, P.A.\nWe have served as the Companys auditor since 2011.\nTampa, Florida\nOctober 13, 2022\nINNOVATIVE MEDTECH, INC.\n(FORMERLY FRESH HARVEST PRODUCTS, INC.)\nAND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nJune 30,\nJune 30,\nAssets\nCurrent assets\nCash\n$ 301,337\n$ 433,435\nAccounts receivable, net\n186,285\n178,555\nNotes receivable\n27,289\n48,987\nPrepaid expenses\n-\n1,745\nTotal current assets\n514,911\n662,722\nNotes receivable, non-current\n-\n14,466\nDeposits\n6,716\n10,331\nRight-of-use asset\n589,361\n757,313\nFinance lease asset, net\n20,655\n-\nProperty and equipment, net of accumulated depreciation\n332,891\n325,788\nIntangible assets, net\n3,157,733\n-\nGoodwill\n177,777\n3,361,777\nTotal Assets\n$ 4,800,044\n$ 5,132,397\nLiabilities & Stockholders Deficit\nCurrent liabilities\nAccounts payable and accrued expenses\n$ 1,594,503\n$ 775,969\nAccrued interest\n537,451\n527,224\nAccrued interest, related parties\n47,763\n9,459\nNotes payable, related parties, current\n732,562\n514,438\nNotes payable, current\n180,626\n238,686\nConvertible notes payable, current\n304,900\n304,900\nDerivative liability\n226,585\n254,700\nFinance lease liability\n42,855\n-\nOperating lease liability\n185,182\n166,895\nTotal current liabilities\n3,852,427\n2,792,271\nRoyalty liability, net of discount\n1,459,552\n1,388,513\nFinance lease liability, non-current\n143,269\n-\nOperating lease liability, non-current\n405,235\n590,418\nPaycheck protection loan\n-\n266,640\nSBA Loan\n350,000\n150,000\nTotal Liabilities\n6,210,483\n5,187,842\nCommitments and contingencies (Note 16)\nStockholders Deficit\nSeries A Preferred stock, $0.000001 par value; 500,000,000 authorized: 367,500 and 317,500 shares issued and outstanding at June 30, 2022 and 2021, respectively\n-\n-\nCommon stock, $0.000001 par value; 130,000,000 shares authorized; 21,157,327 and 15,557,327 shares issued and outstanding at June 30, 2022 and 2021, respectively\nAdditional paid in capital\n31,563,906\n14,860,551\nAccumulated deficit\n(32,974,366 )\n(14,916,012 )\nTotal Stockholders Deficit\n(1,410,439 )\n(55,445 )\nTotal Liabilities and Stockholders Deficit\n$ 4,800,044\n$ 5,132,397\nSee accompanying notes to consolidated financial statements\nINNOVATIVE MEDTECH, INC.\n(FORMERLY FRESH HARVEST PRODUCTS, INC.)\nAND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the years ended June 30\nRevenue:\nPatient fees\n$ 794,027\n$ 196,332\nFranchise fees\n503,586\n152,811\n1,297,613\n349,143\nOperating expenses:\nGeneral and administrative\n933,268\n295,475\nSalaries and wages\n921,022\n197,883\nLicensing fees\n750,000\n-\nConsulting fees\n16,838,885\n305,000\nLegal and professional fees\n112,531\n259,660\nTotal operating expenses\n19,555,706\n1,058,018\nLoss from operations\n(18,258,093 )\n(708,875 )\nOther income (expense):\nInterest expense, related parties\n(8,972 )\n-\nInterest expense\n(182,500 )\n(172,286 )\nLoss on extinguishment of debt\n-\n(1,660,797 )\nImpairment of ROU asset\n(84,364 )\n-\nImpairment of goodwill\n-\n(806,690 )\nChange in fair value of derivatives\n28,115\n(223,264 )\nGain on disposal of fixed assets\n-\n2,695\nGain on forgiveness of PPP loan\n266,640\n172,520\nOther income\n180,820\n131,740\nTotal other income (expense)\n199,739\n(2,556,082 )\nNet loss\n$ (18,058,354 )\n$ (3,264,957 )\nBasic and diluted earnings per share on net loss\n$ (1.09 )\n$ (1.54 )\nWeighted average shares outstanding - basic and diluted\n16,603,755\n2,117,130\nSee accompanying notes to consolidated financial statements\nINNOVATIVE MEDTECH, INC.\n(FORMERLY FRESH HARVEST PRODUCTS, INC.)\nAND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nFor the years ended June 30, 2022 and 2021\nAdditional\nSeries A Preferred Stock\nCommon Stock\nCommon Stock To Be Issued\nPaid-in\nAccumulated\nStockholders\nShares\nAmount\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nDeficit\nBalance, June 30, 2020\n47,400,000\n$ 47\n292,211\n$ -\n50,000\n$ -\n$ 7,562,393\n$ (11,651,055 )\n$ (4,038,615 )\nCommon stock issued which was committed in 2020\n-\n-\n50,000\n-\n(50,000 )\n-\n-\n-\n-\nSale of common stock\n-\n-\n7,885,755\n-\n-\n397,894\n-\n397,902\nSales of Series A Convertible Preferred Stock\n317,500\n-\n-\n-\n-\n-\n1,602,095\n-\n1,602,095\nConversion of notes and accrued interest into common stock\n-\n-\n5,950,361\n-\n-\n4,943,124\n-\n4,943,130\nConversion of accounts payable into common stock\n-\n-\n850,000\n-\n-\n249,999\n-\n250,000\nConversion of Series Convertible Preferred Stock into common stock\n(47,400,000 )\n(47 )\n474,000\n-\n-\n-\n-\nIssuance of common stock for services\n-\n-\n55,000\n-\n-\n-\n55,000\n-\n55,000\nNet loss\n-\n-\n-\n-\n-\n-\n-\n(3,264,957 )\n(3,264,957 )\nBalance, June 30, 2021\n317,500\n$ -\n15,557,327\n$ 16\n-\n$ -\n$ 14,860,551\n$ (14,916,012 )\n$ (55,445 )\nIssuance of common stock for services\n-\n-\n5,600,000\n-\n-\n8,853,355\n-\n8,853,360\nIssuance of Series A preferred stock for services\n50,000\n-\n-\n-\n-\n-\n7,850,000\n-\n7,850,000\nNet loss\n-\n-\n-\n-\n-\n-\n-\n(18,058,354 )\n(18,058,354 )\nBalance, June 30, 2022\n367,500\n$ -\n21,157,327\n$ 21\n-\n$ -\n$ 31,563,906\n$ (32,974,366 )\n$ (1,410,439 )\nSee accompanying notes to consolidated financial statements\nINNOVATIVE MEDTECH, INC.\n(FORMERLY FRESH HARVEST PRODUCTS, INC.)\nAND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the years ended\nJune 30,\nCash Flows from Operating Activities\nNet Loss\n$ (18,058,354 )\n$ (3,264,957 )\nAdjustments to reconcile net loss to net cash from operating activities:\nDepreciation and amortization\n68,969\n9,638\nStock compensation\n16,703,360\n-\nLoss on modification of debt\n-\n1,660,797\nLoss on impairment of goodwill\n-\n806,690\nImpairment of ROU asset\n61,112\nAmortization of royalty fee liability discount\n71,039\n-\nChange in fair value of derivatives\n(28,115 )\n223,264\nGain on forgiveness of PPP loan\n(266,640 )\n(172,520 )\nRight-of-use\n1,056\n-\nExpenses paid via notes payable\n-\n158,503\nChanges in operating assets & liabilities\nAccounts receivable\n(7,730 )\n(93,888 )\nPrepaid expenses\n1,745\n-\nDeposits\n3,615\n3,063\nAccounts payable and accrued liabilities\n818,534\n530,956\nAccrued interest, related party\n38,304\n-\nAccrued interest\n10,227\n166,554\nRelated party advances\n-\n-\nNet cash from operating activities\n(582,878 )\n28,100\nCash Flows from Investing Activities\nCash acquired in business combination\n-\n412,276\nCollections from notes receivable\n36,164\n25,997\nPurchase of subsidiary\n-\n(2,000,110 )\nPurchase of fixed assets\n(46,363 )\n-\nNet cash from investing activities\n(10,199 )\n(1,561,837 )\nCash Flows from Financing Activities\nProceeds from convertible notes payable\n-\n25,000\nProceeds from SBA loan\n200,000\n150,000\nProceeds from related party notes payable\n218,124\n-\nPayments on notes payable\n(58,060 )\n(208,591 )\nProceeds from finance lease\n108,929\n-\nPayments on finance lease\n(8,014 )\n-\nProceeds from sale of common stock\n-\n1,602,095\nProceeds from sale of series A convertible preferred stock\n-\n397,902\nNet cash used by financing activities\n460,979\n1,966,406\nIncrease in cash\n(132,098 )\n432,669\nCash at beginning of period\n433,435\nCash at end of period\n$ 301,337\n$ 433,435\nSupplemental Cash Flow Information\nCash paid for interest\n$ -\n$ -\nCash paid for income taxes\n$ -\n$ -\nNon-cash investing and financing activities:\nCommon stock issued for convertible notes payable\n$ -\n$ 2,702,425\nAccounts payable and accrued expenses converted to convertible notes payable\n$ -\n$ 250,000\nAccounts payable and accrued expenses converted to convertible notes payable, related party\n$ -\n$ -\nAccrued interest converted to convertible notes payable\n$ -\n$ 451,282\nFinance lease asset acquired\n$ 85,209\n$ -\nSee accompanying notes to consolidated financial statements\nINNOVATIVE MEDTECH, INC.\n(FORMERLY FRESH HARVEST PRODUCTS, INC.)\nAND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JUNE 30, 2022\nNOTE 1. GENERAL ORGANIZATION AND BUSINESS\nInnovative MedTech, Inc. (the Company), a Delaware corporation, is a provider of health and wellness services. On February 1, 2021, the Company filed all required Form 10-Qs and 10-Ks to be up to date with its filings which should have been filed before the Company filed its Form 15-12G on November 7, 2014. On February 11, 2021, the Company filed with FINRA to effectuate a reverse stock split, change its name from Fresh Harvest Products, Inc. to Innovative MedTech, Inc. and change its stock symbol from ‘FRHV to ‘IMTH. FINRA permitted these corporate actions on March 8, 2021. The 10,000:1 reverse split and the name change from Fresh Harvest Products, Inc., to Innovative MedTech, Inc. corporate actions took effect at the open of business on March 9, 2021.\nOn March 25, 2021, the Company acquired two companies, Sarah Adult Day Services, Inc., and Sarah Day Care Centers, Inc. (collectively SarahCare), an adult day care center franchisor and provider, for a total of $3,718,833; $2,000,110 was paid in cash and the Company assumed approximately $393,885 in debt due to sellers, and the remaining is payable through a royalty fee liability due in the amount of $1,500,000. With 26 centers (2 corporate and 24 franchise locations) located in 13 states, SarahCare offers seniors daytime care and activities ranging from meeting their physical and medical needs, on a daily basis, ranging from nursing care to salon services and providing meals, to offering engaging and enriching activities to allow them to continue to lead active and engaged lives.\nOn March 25, 2021 the Company received a $2 million investment in the form of a private investment in public equity (PIPE) from several investors. For the $2 million PIPE, the investors received a combination of common stock and Series A Preferred Stock which together constitute ownership of 84.11% of the Company, 83.00% on a fully diluted basis.\nOn April 21, 2021, the Company formed ten wholly-owned limited liability companies which will operate ten additional SarahCare facilities. As of June 30, 2022, the newly formed entities are non-operating. Operations expect to begin in November 2022.\nOn April 28, 2022, the Company entered into a share exchange agreement with RX Vitality, Inc. (RX Vitality), a media and finance advisory company.\nNOTE 2. LIQUIDITY, CAPITAL RESOURCES AND GOING CONCERN\nThe accompanying consolidated financial statements have been prepared on a going-concern basis, which contemplates the continuation of operations, realization of assets and liquidation of liabilities in the ordinary course of business.\nFor the years ended June 30, 2022 and 2021, the Company reported a net loss of $18,058,354 and $3,264,957, respectively.\nAs of June 30, 2022, the Company maintained total assets of $4,800,044, total liabilities including long-term debt of $6,210,483 along with an accumulated deficit of $32,974,366.\nThe Company continues to have limited capital resources and has experienced net losses and negative cash flows from operations and expects these conditions to continue for the foreseeable future. As of June 30, 2022, the Company had $301,337 cash available for operations and had an accumulated deficit of $32,974,366. Management believes that cash on hand as of June 30, 2022 is not sufficient to fund operations through June 30, 2023. The Company will be required to raise additional funds to meet its short and long-term planned goals. There can be no assurance that such funds, if available at all, can be obtained on terms reasonable to the Company.\nThe Company believes that additional capital will be required to fund operations through June 30, 2023 and beyond, as it attempts to generate increasing revenue, and develop new products. The Company intends to attempt to raise capital through additional equity offerings and debt obligations. There can be no assurance that the Company will be successful in obtaining financing at the level needed or on terms acceptable to the Company. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The accompanying consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nNOTE 3. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying consolidated financial statements have been prepared in accordance with generally accepted accounting principles (GAAP) and pursuant to the rules and regulations of the Securities and Exchange Commission (the SEC) and reflect all adjustments, consisting of normal recurring adjustments, which management believes are necessary to fairly present the financial position, results of operations and cash flows of the Company as of and for the years ended June 30, 2022 and 2021.\nPrinciples of Consolidation\nThe Company has two wholly-owned operating subsidiaries; Sarah Adult Day Services, Inc., and Sarah Day Care Centers, Inc., along with non-operating subsidiaries consisting of RX Vitality, Inc. and the 10 newly formed limited liability companies formed for the additional SarahCare location leases. The consolidated financial statements, which include the accounts of the Company and its two wholly-owned subsidiaries, are prepared in conformity with GAAP pursuant to the rules and regulations of the SEC. All significant intercompany balances and transactions have been eliminated. The consolidated financial statements have been prepared using the accrual basis of accounting in accordance with GAAP and presented in US dollars. The fiscal year end is June 30.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported revenues and expenses during the reporting periods. Because of the use of estimates inherent in the financial reporting process, actual results may differ significantly from those estimates.\nCash and Cash Equivalents\nThe Company maintains cash balances in a non-interest-bearing account that exceeds $250,000 at June 30, 2022. For the purpose of the consolidated financial statements, all highly liquid investments with a maturity of three months or less are considered to be cash equivalents. There were no cash equivalents as of June 30, 2022 and 2021.\nEarnings Per Share Calculation\nBasic earnings per common share (EPS) is computed by dividing income available to common stockholders by the weighted-average number of common shares outstanding for the period. Diluted earnings per share is computed by dividing net income by the weighted average shares outstanding, assuming all dilutive potential common shares were issued.\nIntangible Assets\nCertain intangible assets arose from the acquisition of Sarah Adult Day Services, Inc., and Sarah Day Care Centers, Inc. on March 25, 2021 and consist of the following, which have been or are being amortized on a straight-line basis over the following estimated useful lives unless they have an indefinite life:\nAsset\nEstimated Useful Life\nCustomer Relationships\nTrademarks\nIndefinite\nNon-Compete Agreement\nCARF Accreditation\nFranchise Agreements\nIndefinite\nAn intangible asset with an indefinite useful life is not amortized but assessed for impairment annually, or more frequently, when events or changes in circumstances occur indicating that it is more likely than not that the indefinite-lived asset is impaired. Impairment exists when the carrying amount exceeds its fair value. In testing for impairment, the Company has the option to first perform a qualitative assessment to determine whether it is more likely than not that an impairment exists. If it is determined that it is not more likely than not that an impairment exists, a quantitative impairment test is not necessary. If the Company concludes otherwise, it is required to perform a quantitative impairment test. To the extent an impairment loss is recognized, the loss establishes the new cost basis of the asset. Subsequent reversal of impairment losses is not permitted. For the years ended June 30, 2022 and 2021, there were no impairment losses.\nRevenue Recognition\nRevenue is recognized when a customer obtains services. The amount of revenue that is recorded reflects the consideration that the Company expects to receive in exchange for those goods. The Company applies the following five-step model in order to determine this amount: (i) identification of the promised goods in the contract; (ii) determination of whether the promised goods are performance obligations, including whether they are distinct in the context of the contract; (iii) measurement of the transaction price, including the constraint on variable consideration; (iv) allocation of the transaction price to the performance obligations; and (v) recognition of revenue when (or as) the Company satisfies each performance obligation.\nThe Company only applies the five-step model to contracts when it is probable that the entity will collect the consideration it is entitled to in exchange for the services it provides to the customer. Once a contract is determined to be within the scope of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 606 at contract inception, the Company reviews the contract to determine which performance obligations the Company must deliver and which of these performance obligations are distinct.\nPatient Fees\nParticipant fee revenue is reported at the amount that reflects the consideration the Company expects to receive in exchange for the services provided. These amounts are due from participants or third-party payors and include variable consideration for retroactive adjustments from estimated reimbursements, if any, under reimbursement programs. Performance obligations are determined based on the nature of the services provided. Resident fee revenue is recognized as performance obligations are satisfied.\nUnder the Companys day care agreements, which are generally for a contractual term of 30 days to one year, the Company provides services to participants for a stated daily or monthly fee. The Company has elected the lessor practical expedient within ASC 842, Leases (ASC 842) and recognizes, measures, presents, and discloses the revenue for services under the Companys senior living residency agreements based upon the predominant component, either the lease or nonlease component, of the contracts. The Company has determined that the services included under the Companys independent living, assisted living, and memory care residency agreements have the same timing and pattern of transfer and are performance obligations that are satisfied over time. The Company recognizes revenue under ASC 606, Revenue Recognition from Contracts with Customers (ASC 606) for its participants agreements for which it has estimated that the nonlease components of such agreements are the predominant component of the contract.\nThe Company enters into contracts to provide home assisted health, and certain outpatient services. Each service provided under the contract is capable of being distinct, and thus, the services are considered individual and separate performance obligations. The performance obligations are satisfied as services are provided and revenue is recognized as services are provided.\nThe Company receives payment for services under various third-party payor programs which include Medicaid, Veterans Affairs and other third-party payors. Estimates for settlements with third-party payors for retroactive adjustments from estimated reimbursements due to audits, reviews, or investigations are included in the determination of the estimated transaction price for providing services. The Company estimates the transaction price based on the terms of the contract with the payor, correspondence with the payor, and historical payment trends. Changes to these estimates for retroactive adjustments are recognized in the period the change or adjustment becomes known or when final settlements are determined.\nBillings for services under third-party payor programs are recorded net of estimated retroactive adjustments, if any. Retroactive adjustments are accrued on an estimated basis in the period the related services are rendered and adjusted in future periods or as final settlements are determined. Contractual or cost related adjustments from Medicaid or Veterans Affairs are accrued when assessed (without regard to when the assessment is paid or withheld). Subsequent adjustments to these accrued amounts are recorded in net revenues when known.\nFranchise Fees\nThe Company franchises a number of its locations under franchise contracts which provide periodic franchise fee payments to the Company and reimbursement for costs and expense related to such franchises. The Companys franchisees pay a variety of royalties and fees, including an agreed upon percentage of gross revenues (as defined in the franchise agreement). The Company estimates the amount of franchise fee revenue expected to be earned, if any, during the annual contract period and revenue is recognized as services are provided. The Companys estimate of the transaction price for the franchise services also includes the amount of reimbursement due from the franchises for services provided and related costs incurred.\nSarahCare, as the franchisor, supplies the franchisees with initial assistance and approval with the following: (1) Providing the site selection criteria for the SARAH Business and, upon a potential franchisees request, provide input regarding possible sites. The Company does not own and lease any site to franchisees. After the franchise selects and the Company approves a site, the Company will designate the geographic area within which they may establish the SARAH Business; (2) Approve the signage; (3) Identify the standards and specifications for products, services, and materials that comply with the System, and, if the Company requires, the approved suppliers of these items. The Company will furnish a potential Franchisee with the listing of the package of initial franchise items as detailed in the Operations Manual. Neither the Company or its affiliate provide, deliver, or install any of these items; (4) Provide an Initial Training Program; and (5) Provide an Operations Training Program.\nOnce the Franchisees SarahCare business is operational, the Company will: (1) Issue and modify System standards for SARAH Businesses; (2) Provide access to a copy of the Companys Operations Manual as they make available through our intranet. The Operations Manual contains mandatory and suggested specifications, standards and operating procedure; (3) Provide additional or special guidance and assistance and training as the Company deem appropriate and for which a potential Franchisee are financially responsible; (4) Inspect and observe the operation of the SARAH Business to help a potential Franchisee comply with the Franchise Agreement and all System standards; (5) Let the Franchisee use the confidential information; and, (6) Let the Franchisee use the Marks (trademarks, trade names, service marks, and logos).\nDigital Healthcare Wallet & Card\nRevenue will be recognized when fees are collected from cardholders at the time the fees are assessed and debited from their account balances. The Company anticipates the card revenues to consist of monthly maintenance fees, new card fees, ATM fees, and other card revenues. The fees will be earned by providing account services to each cardholder over the contract term. Agreements with cardholders are considered daily services contracts.\nThe Company intends to earn interchange revenue from fees remitted by the merchants bank, which are based on rates established by the payment networks, such as Visa, when account holders make purchase transactions using the card products and services. The Company intends to recognize revenues at the point in time the transactions occurs.\nIncome Taxes\nThe provision for income taxes is the total of the current taxes payable and the net of the change in the deferred income taxes. Provision is made for the deferred income taxes where differences exist between the period in which transactions affect current taxable income and the period in which they enter into the determination of net income in the financial statements.\nLeases\nThe Company accounts for leases in accordance with Accounting Standards Update (ASU) 2016-02, Leases (Topic 842). Based on this standard, the Company determines if an agreement is a lease at inception. Leases are included - right to use, current portion of lease liability, and operating lease liability, less current portion in the Companys consolidated balance sheets. Finance leases are included in property, plant and equipment, net current portion of long-term debt, net and long-term debt, less current portion and debt issuance costs in the Companys consolidated balance sheets.\nFair value of financial instruments\nThe Companys financial instruments include cash and cash equivalents, accounts payable, accrued expenses, and debt. The carrying value of these financial instruments is considered to be representative of their fair value due to the short maturity of these instruments. The carrying amount of the debt approximates fair value, because the interest rates on these instruments approximate the interest rate on debt with similar terms available to the Company. The Companys derivative liabilities were adjusted to fair market value at the end of each reporting period, using Level 3 inputs.\nFair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability, in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value must maximize the use of observable inputs and minimize the use of unobservable inputs. The fair value hierarchy is based on three levels of inputs, of which the first two are considered observable and the last unobservable, as follows:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Inputs other than Level 1 that are observable, either directly or indirectly, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the measurement of the fair value of the assets or liabilities.\nThe carrying amounts of the Companys financial assets and liabilities, such as cash, accounts payable, accrued expenses and interest, certain notes payable and notes payable - due to related parties, approximate their fair values because of the short maturity of these instruments. The Company accounts for its derivative liabilities, at fair value, on a recurring basis under Level 3 (See Note 12).\nEmbedded Conversion Features\nThe Company evaluates embedded conversion features within convertible debt under ASC 815 Derivatives and Hedging to determine whether the embedded conversion feature(s) should be bifurcated from the host instrument and accounted for as a derivative at fair value with changes recorded in earnings. If the conversion feature does not require derivative treatment under ASC 815, the instrument is evaluated under ASC 470-20 Debt with Conversion and Other Options for consideration of any beneficial feature.\nDerivative financial instruments\nWhen the Company issues debt that contains a conversion feature, it first evaluates whether the conversion feature meets the requirements to be treated as a derivative: a) one or more underlying, typically the price of the Companys stock; b) one or more notional amounts or payment provisions or both, generally the number of shares upon conversion; c) no initial net investment, which typically excludes the amount borrowed; and d) net settlement provisions, which in the case of convertible debt generally means the stock received upon conversion can be readily sold for cash. There are certain scope exceptions from derivative treatment, but these typically exclude conversion features that provide for a variable number of shares.\nIf the conversion features within convertible debt meet the requirements to be treated as a derivative, the Company estimates the fair value of the derivative liability using the Monte Carlo Simulation Model upon the date of issuance. If the fair value of the derivative liability is higher than the face value of the convertible debt, the excess is immediately recognized as interest expense. Otherwise, the fair value of the derivative liability is recorded as a liability with an offsetting amount recorded as a debt discount, which offsets the carrying amount of the debt. The derivative liability is revalued at the end of each reporting period and any change in fair value is recorded as a change in fair value in the consolidated statements of operations. The debt discount is amortized through interest expense over the life of the debt. Derivative instrument liabilities and the host debt agreement are classified on the consolidated balance sheets as current or non-current based on whether settlement of the derivative instrument could be required within twelve months of the balance sheet date.\nThe accounting treatment of derivative financial instruments requires that the Company record the embedded conversion option at their fair values as of the inception date of the agreement and at fair value as of each subsequent balance sheet date. Any change in fair value is recorded as non-operating, non-cash income or expense for each reporting period at each balance sheet date. The Company reassesses the classification of its derivative instruments at each balance sheet date. If the classification changes as a result of events during the period, the contract is reclassified as of the date of the event that caused the reclassification. As a result of entering into warrant agreements, for which such instruments contained a variable conversion feature with no floor, the Company has adopted a sequencing policy in accordance with ASC 815-40-35-12 Derivatives and Hedging (provides comprehensive guidance on derivative and hedging transactions) whereby all future instruments may be classified as a derivative liability with the exception of instruments related to share-based compensation issued to employees or directors.\nDebt Issue Costs and Debt Discount\nThe Company may record debt issue costs and/or debt discounts in connection with raising funds through the issuance of debt. These costs may be paid in the form of cash, or equity (such as warrants). These costs are amortized to interest expense over the life of the debt. If a conversion of the underlying debt occurs, a proportionate share of the unamortized amounts is immediately expensed.\nReclassification of Presentation\nCertain prior year amounts have been reclassified to conform with current year presentation. These reclassifications had no effect on the reported results of operations.\nRecently Issued Accounting Pronouncements\nThe Company does not expect any of the recently issued accounting pronouncements to have a material impact on its financial condition or results of operations for the year ended as of June 30, 2022 or on a going forward basis..\nSubsequent Events\nIn accordance with ASC 855, Subsequent Events, the Company evaluated subsequent events through the date of this report; the date the consolidated financial statements were available for issue.\nNOTE 4. BUSINESS ACQUISITION\nSarahCare\nOn March 25, 2021 the Company acquired SarahCare, an adult day care center franchisor and provider. The combined purchase price was $3,718,833. The purchase price was paid as follows: (i) $2,000,110 was paid in cash, (ii) the Company assumed $393,885 in debt due to sellers, and (iii) the remaining is payable through a royalty fee liability due in the amount of $1,500,000.\nThe Company completed its accounting for the acquisition on March 25, 2022. The purchase price allocation is as follows:\nConsideration\nCash\n$ 2,000,110\nLegal fees\n(175,162 )\nNotes payable due to sellers\n393,885\nRoyalty fee liability, net of discount\n1,388,513\nTotal consideration\n$ 3,607,346\nFair value of net identifiable assets (liabilities) acquired\nCash\n$ 412,276\nAccounts receivable\n84,674\nDeposits and prepaid expenses\n15,139\nNotes receivable\n110,510\nProperty and equipment\n335,426\nRight of use asset\n796,771\nTotal fair value of net identifiable assets\n$ 1,754,796\nAccounts payable and accrued expenses\n$ 625,462\nNotes payable, current, net of debt discount\n454,524\nPPP Loan\n439,160\nLease liability\n796,771\nTotal fair value of net identifiable liabilities\n$ 2,315,917\nFair value of net identifiable assets (liabilities) acquired\n$ (561,121 )\nExcess (consideration given minus fair value of identifiable net assets and liabilities)\n$ 4,168,467\nIntangible assets:\nCustomer relationships\n$\n40,000\nTrademarks\n410,000\nNon-Compete Agreement\n1,000\nCARF Accreditation\n23,000\nFranchise Agreements\n2,710,000\nTotal intangible assets\n$\n3,184,000\nGoodwill (excess minus values assigned to intangible assets)\n$\n984,467\nMinus (goodwill impaired in prior period)\n(806,690\n)\nRemaining Goodwill\n$\n177,777\nThe Royalty fee liability has a term 3 years and is to be repaid from any new subsidiary franchisee fees.\nThe Company analyzed the acquisition under applicable guidance and determined that the acquisition should be accounted for as a business combination.\nOn June 30, 2021, the Company performed a test to determine if goodwill should be impaired. The test determined that the fair value of the reporting units was less than its carrying value. As such the Company recorded a loss on impairment of goodwill in the amount of $806,690.\nOn June 30, 2022, the Company performed a test to determine if goodwill should be impaired. The Company determined that the fair vale of the reporting units was greater than its carrying value. As such, no impairment was recorded for the year ended June 30, 2022.\nPro Forma Disclosures\nThe following unaudited pro forma financial results reflects the historical operating results of the Company, including the unaudited pro forma results of SarahCare. for the year ended June 30, 2021, as if each of these business combinations had occurred only as of July 1, 2020. The pro forma financial information set forth below reflects adjustments to the historical data of the Company to give effect to each of these acquisitions and the related equity issuances as if each had occurred on July 1, 2020 The pro forma information presented below does not purport to represent what the actual results of operations would have been for the periods indicated, nor does it purport to represent the Companys future results of operations. The following table summarizes on an unaudited pro forma basis the Companys results of operations for the year ended June 30, 2021:\nNet revenue\n$ 677,997\nNet loss\n$ (3,513,187 )\nNet loss per share- basic and diluted\n$ (0.60 )\nWeighted average number of shares of common stock outstanding- basic and diluted\n2,117,130\nThe calculations of pro forma net revenue and pro forma net loss give effect to the business combinations for the period from July 1, 2020 until the respective closing dates for (i) the historical net revenue and net income (loss), as applicable, of the acquired businesses, (ii) incremental depreciation and amortization for each business combination based on the fair value of property, equipment and identifiable intangible assets acquired and the related estimated useful lives, and (iii) recognition of accretion of discounts on obligations with extended payment terms that were assumed in the business combinations.\nNOTE 5. NOTES RECEIVABLE\nThe Companys wholly-owned subsidiary Sarah Adult Day Services, Inc., has notes receivables from two franchises, which were previously converted from trade receivables. They are as follows:\nJune 30,\nJune 30,\nNotes receivable from a franchise, due in monthly installments of $5,000, no interest, maturing December 2021\n$ -\n$ 21,468\nNotes receivable from a franchise, due in monthly installments of $1,999, no interest, maturing March 2023\n17,995\n41,985\nNote receivable from related party (see Note 17), due in six months, with no installments, 5% interest maturing March 2022\n9,294\n-\nTotal notes receivable\n27,289\n63,453\nLess long-term\n-\n(14,466 )\nTotal short term notes receivable\n$ 27,289\n$ 48,987\nPrincipal to be collected during the next year is as follows:\nAs of\nJune 30, 2022\nYear ending June 30, 2023\n27,289\nTotal\n$ 27,289\nNOTE 6. PROPERTY AND EQUIPMENT\nProperty and equipment consisted of the following at June 30, 2022 and 2021:\nJune 30,\nJune 30,\nLeasehold improvements\n$ 294,864\n$ 294,864\nVehicles\n67,116\n22,554\nComputer equipment\n14,354\n12,553\nFurniture and fixtures\n5,455\n5,455\n381,789\n335,426\nLess: Accumulated depreciation\n(48,898 )\n(9,638 )\nProperty and equipment - net\n$ 332,891\n$ 325,788\nDepreciation expense was $39,260 and $9,638 for the years ended June 30, 2022 and 2021.\nNOTE 7. INTANGIBLE ASSETS\nJune 30,\nJune 30,\nCustomer relationships\n$ 40,000\n$ -\nTrademarks\n410,000\n-\nNon-Compete agreement\n1,000\n-\nCARF accreditation\n23,000\n-\nFranchise agreements\n2,710,000\nLess: accumulated amortization\n(26,267 )\n-\nIntangible assets - net\n$ 3,157,733\n$ -\nDuring the year ended June 30, 2022, the Company finalized the purchase accounting for the Sarah Care Acquisition as described further in Note 4. As a result, the intangible assets (i.e. customer relationships, trademarks, non-compete agreement, CARF Accreditation and Franchise Agreements) arose from the acquisition. The Company is amortizing these intangible over their respective remaining useful lives. The Company recorded amortization expense in the amount of $26,267 for the year ended June 30, 2022. Of the $26,267 in amortization expense, $5,670 relates to the period from acquisition to June 30, 2021 and is being treated as a change in accounting estimate. The remaining $20,597 is the expense related to the year ended June 30, 2022.\nNOTE 8. NOTES PAYABLE\nAs of June 30, 2022 and 2021, the Company had $180,626 and $238,686, respectively, in outstanding notes payable, as follows:\nRef No.\nDate of\nNote Issuance\nOriginal Principal Balance\nMaturity\nDate\nInterest\nRate %\nPrincipal Balance 06/30/22\nPrincipal Balance 6/30/2021\n12/25/20\n$\n146,021\n8/15/2025\n$\n104,695\n$\n137,755\n2*\n5/10/21\n20,000\n11/10/21\n-\n20,000\n3*\n6/29/21\n5,000\n12/29/21\n-\n5,000\n2/24/14\n8,547\n**\n8,547\n8,547\n2/24/14\n33,687\n**\n33,687\n33,687\n2/24/14\n33,697\n**\n33,697\n33,697\nTotal Current\n$\n180,626\n$\n238,686\n________\n*These notes were assumed in connection with the acquisition on March 25, 2021.\n** As of June 30, 2022, these notes are in default.\nNOTE 9. NOTES PAYABLE, RELATED PARTIES, CURRENT\nAs of June 30, 2022 and 2021, the Company had $732,562 and $514,438, respectively, in outstanding notes payable, related parties. As of June 30, 2022 and 2021, the Company had $47,763 and $9,459, respectively, in accrued interest related to these notes. All of these notes were assumed in connection with the acquisition on March 25, 2021.\nRef No.\nDate of\nNote Issuance\nOriginal Principal\nBalance\nMaturity Date\nInterest\nRate %\nPrincipal Balance 06/30/22\nPrincipal Balance\n6/30/21\n1*\n3/25/2021\n308,500\n6/3/2021\n%\n$\n308,500\n308,500\n2*\n3/25/2021\n47,436\n6/3/2021\n%\n47,435\n47,435\n3*\n3/25/2021\n158,503\n6/3/2021\n%\n158,503\n158,503\n3/24/22\n39,000\n9/24/22\n%\n39,000\n-\n5/5/22\n179,124\n11/5/22\n%\n179,124\n-\nTotal\n$\n732,562\n$\n514,438\n* As of June 30, 2022, these notes are in default.\nNOTE 10. CONVERTIBLE NOTES PAYABLE, CURRENT\nAs of June 30, 2022 and 2021, the convertible notes payable were as follows:\nDate of Note\nIssuance\nOriginal Principal Balance\nMaturity Date\nInterest Rate %\nConversion Rate\nPrincipal\nBalance 6/30/22\nPrincipal\nBalance 6/30/21\n8/26/14\n50,000\n2/26/14\n10 %\n$ 0.0001\n$ 50,000\n$ 50,000\n6/15/12\n8,000\n12/15/12\n10 %\n$ 0.000350\n8,000\n8,000\n10/18/11\n1,900\n10/18/11\n8 %\n25% discount to market\n6,900\n6,900\n10/3/10\n20,000\n10/3/12\n10 %\nlesser $0.01 or 20% discount to market\n20,000\n20,000\n10/31/09\n4,000\n10/31/10\n8 %\n25% discount of previous 5 days closing price\n4,000\n4,000\n2/26/07\n30,000\n2/26/09\n12 %\nlesser $0.50 or 35% discount to market\n30,000\n30,000\n4/17/07\n20,000\n4/17/09\n10 %\nlesser $0.45 or 35% discount to market\n20,000\n20,000\n6/14/07\n15,000\n6/15/09\n10 %\nlesser $0.50 or 25% discount to market\n15,000\n15,000\n1/29/07\n15,000\n1/29/09\n10 %\n$ 0.95\n15,000\n15,000\n4/17/07\n15,000\n4/17/09\n10 %\nlesser $0.45 or 35% discount to market\n15,000\n15,000\n12/23/06\n18,000\n12/23/08\n10 %\n$ 0.95\n18,000\n18,000\n11/30/06\n50,000\n11/30/08\n10 %\n$ 0.85\n50,000\n50,000\n9/16/06\n100,000\n9/9/08\n12 %\n35% discount to market\n38,000\n38,000\n10/1/05\n15,000\n4/1/07\n10 %\n$ 0.50\n15,000\n15,000\nTotal Current\n$ 304,900\n$ 304,900\nNOTE 11. NOTES PAYABLE, LONG TERM\nPPP Loans\nOn April 21, 2020 and February 10, 2021, the Company received loan proceeds in the amount of approximately $82,600 and $85,920 for a total of $168,520 through Sarah Adult Days Services, Inc. under the Paycheck Protection Program (PPP) prior to the March 25, 2021 acquisition. On April 14, 2020 and February 10, 2021, the Company received loan proceeds in the amount of $199,367 and $180,720 for a total of $380,087 through Sarah Day Care Centers, Inc. under the Paycheck Protection Program (PPP) prior to the March 25, 2021 acquisition. The PPP, established as part of the Coronavirus Aid, Relief and Economic Security Act (CARES Act), provides for loans to qualifying businesses for amounts up to 2.5 times of the average monthly payroll expenses of the qualifying business. The loans and accrued interest are forgivable after twenty-four weeks as long as the borrower uses the loan proceeds for eligible purposes, including payroll, benefits, rent and utilities, and maintains its payroll levels. The amount of loan forgiveness will be reduced if the borrower terminates employees or reduces salaries during the period.\nThe Company was granted forgiveness of $85,920 in PPP loans through Sarah Day Care Centers, Inc. and $82,600 through Sarah Adult Days Services, Inc. As a result, the Company recorded a gain on PPP forgiveness in the amount of $172,520, during the year ended June 30, 2021. On, January 20, 2022, the remaining balance of $266,640 on the PPP loan was forgiven. During the years ended June 30, 2022 and 2021, the Company recorded $0 and $855, respectively, in accrued interest related to the PPP loan.\nSBA Loan\nOn June 25, 2020 and January 6, 2022, the Companys wholly-owned subsidiary, Sarah Day Care Centers, Inc. received proceeds of $150,000 and $200,000, respectively, in the form of an SBA loan. Installment payments, including principal and interest of $1,746 are due monthly beginning on December 22, 2021. The balance of principal and interest is payable thirty years from the promissory note date. The interest accrues at a rate of 3.75% per annum. During the years ended June 30, 2022 and 2021, the Company recorded $1,402 and $5,779 in accrued interest related to the SBA loan.\nNOTE 12. DERIVATIVE FINANCIAL INSTRUMENTS\nThe following tables summarize the components of the Companys derivative liabilities and linked common shares As of June 30, 2022 and 2021 the amounts that were reflected in income related to derivatives for the year ended June 30, 2022 and 2021:\nJune 30, 2022\nIndexed\nFair\nThe financings giving rise to derivative financial instruments\nShares\nValues\nCompound embedded derivative\n129,380\n$ 226,585\nJune 30, 2021\nIndexed\nFair\nThe financings giving rise to derivative financial instruments\nShares\nValues\nCompound embedded derivative\n405,106\n$ 254,700\nThe following tables summarizes the effects on the Companys gain (loss) associated with changes in the fair values of the derivative financial instruments by type of financing for the years ended June 30, 2022 and 2021:\nThe financings giving rise to derivative financial instruments and the income effects:\nYears ended\nJune 30,\nJune 30,\nCompound embedded derivative\n$ 28,115\n$ (223,264 )\nDay one derivative loss\n-\n-\nTotal derivative gain (loss)\n$ 28,115\n$ (223,264 )\nThe Companys convertible notes gave rise to derivative financial instruments. The notes embodied certain terms and conditions that were not clearly and closely related to the host debt agreement in terms of economic risks and characteristics. These terms and features consist of the embedded conversion option.\nCurrent accounting principles that are provided in ASC 815 - Derivatives and Hedging require derivative financial instruments to be classified in liabilities and carried at fair value with changes recorded in income. In addition, the standards do not permit an issuer to account separately for individual derivative terms and features embedded in hybrid financial instruments that require bifurcation and liability classification as derivative financial instruments. Rather, such terms and features must be bundled together and fair valued as a single, compound embedded derivative. The Company has selected the Monte Carlo Simulations valuation technique to fair value the compound embedded derivative because it believes that this technique is reflective of all significant assumption types, and ranges of assumption inputs, that market participants would likely consider in transactions involving compound embedded derivatives. Such assumptions include, among other inputs, interest risk assumptions, credit risk assumptions and redemption behaviors in addition to traditional inputs for option models such as market trading volatility and risk-free rates. The Monte Carlo Simulations technique is a level three valuation technique because it requires the development of significant internal assumptions in addition to observable market indicators.\nSignificant inputs and results arising from the Monte Carlo Simulations process are as follows for the compound embedded derivative that has been bifurcated from the Convertible Notes and classified in liabilities:\nJune 30,\nJune 30,\nInception\nQuoted market price on valuation date\n$ 0.01\n$ 3.49\n$ 1.01\nContractual conversion rate\n$ 0.0054 - $0.0081\n$ 1.94 - $2.62\n$ 0.486 - $0.817\nRange of effective contractual conversion rates\n-\n-\n-\nContractual term to maturity\n1.00 Year\n0.25 Years\n0.25 Years\nMarket volatility:\nVolatility\n138.28% - 238.13\n%\n138.28% - 238.13\n%\n138.28% - 238.13\n%\nContractual interest rate\n5% - 12\n%\n5% - 12\n%\n5% - 12\n%\nThe following table reflects the issuances of compound embedded derivatives and changes in fair value inputs and assumptions related to the compound embedded derivatives during the years ended June 30, 2022 and 2021.\nJune 30,\nJune 30,\nBeginning balance\n$ 254,700\n$ 257,493\nIssuances:\nConvertible Note Financing\n-\n-\nRemovals\n-\n-\nChanges in fair value inputs and assumptions reflected\n(28,115 )\n223,264\nConversions\n-\n(226,057 )\nEnding balance\n$ 226,585\n$ 254,700\nThe fair value of the compound embedded derivative is significantly influenced by the Companys trading market price, the price volatility in trading and the interest components of the Monte Carlo Simulation technique.\nNOTE 13. STOCKHOLDERS EQUITY\nOn February 11, 2021, the Company filed with FINRA to effectuate a 10,000:1 reverse stock split. FINRA permitted this corporate actions on March 8, 2021. The 10,000:1 reverse split took effect at the open of business on March 9, 2021.\nOn or about April 26, 2022, the Company entered into an Agreement for Share Exchange (the Share Exchange Agreement) to obtain 10,500,000 shares of common stock of Vitality RX, Inc., a Delaware corporation (Vitality), representing 100% ownership of Vitality, from Vitalitys five shareholders identified in the Share Exchange Agreement (the Vitality Shareholders), in consideration of the issuance by the Company to the Vitality Shareholders of 5,500,000 shares of Innovative common stock, and 50,000 shares of Series A Convertible Preferred Stock (which preferred stock is convertible into 5,000,000 shares of common stock) (such shares of common stock and preferred stock collectively the Shares). On or about April 28, 2022, the transaction closed, Innovative received the stock of Vitality from the Vitality Shareholders, and issued the Shares to the Vitality Shareholders. The Company determined that Vitality did not meet the definition of a business under ASC 805, as such, the issuance of shares was treated as stock-based compensation expense.\nCommon Stock\nOn or about April 26, 2022, the Company issued the Vitality Shareholders 5,500,000 common shares, par value, $0.000001 per share, to Vitality Shareholders' for consulting services and their expertise in technology, financial services and media related to the Companys digital healthcare wallet.\nOn February 19, 2021, pre-reverse stock split, the Company decreased its authorized shares to 500,000,000 shares of common stock, par value, $0.000001 per share, and 2,000,000 shares of Series A Convertible Preferred Stock, par value, $0.000001 per share. Each share of Series A Convertible Preferred Stock is convertible into 100 shares of the Companys common stock. The Company no longer authorized any Series B Convertible Preferred Stock.\nOn September 15, 2021 the Company issued 100,000 common stock, par value, $0.000001 per share, to a consultant for services rendered to the Company.\nConversion of Notes Payable to Common Shares\nOn December 31, 2020 (prior to the Companys reverse split) the Company issued 1,050,000,000 common shares (which was the equivalent of 105,000 post-split common shares) for services rendered to the Company. On December 31, 2020 five (5) Noteholders, including the Companys Board of Director Members, converted a total of $1,965,460 of convertible promissory notes into 40,702,104,817 common shares of the Company, pre-reverse stock split.\nOn December 31, 2020, the Companys two Board of Director Members converted a total of $1,644,825 of convertible promissory notes into a total of 34,267,187,500 common shares. The Companys Board of Director Members control approximately 87.32% of the voting rights of the Company. The 3 (three) Noteholders converted a total of $325,666 of convertible promissory notes into a total of 6,439,917,317 common shares, pre-reverse stock split.\nOn February 2, 2021 eleven (11) Noteholders converted a total of $833,790 of convertible promissory notes into 14,586,720,714 common shares of the Company, pre-reverse stock split.\nOn March 19, 2021 the Companys Board of Directors converted all 47,400,000 of their Series A Preferred Stock into 474,000 shares of Common Stock. There was no Series A Preferred Stock outstanding after these conversions, until March 25, 2021, when the Company issued 317,500 shares of Series A Preferred Stock to 7 investors as part of their $1,602,097 cash investment for Series A Preferred Stock, pre-reverse stock split.\nSeries A Preferred Stock & Series B Preferred Stock\nOn April 26, 2022, the Company issued the Shareholders of Vitality 50,000 shares of Series A Convertible Preferred Stock, par value, $0.000001 per share, to Vitalitys five shareholders for consulting services and their expertise in technology, financial services and media related to the Companys digital healthcare wallet.\nAs of June 30, 2022, the Company had 500,000,000 authorized shares of Series A Convertible Preferred Stock, par value, $0.000001 per share. Each share of Series A Convertible Preferred Stock is convertible into 100 shares of the Companys common stock. The Company no longer authorized any Series B Convertible Preferred Stock.\nOn December 21, 2020, the Company increased its authorized shares to 1 Trillion shares of common stock, par value, $0.000001 per share, and 5 Billion shares of Series A Preferred Stock, par value, $0.000001 per share, and 5 Billion Shares of Series B Preferred Stock, par value, $0.000001 per share. Each share of Series A and Series B Preferred Stock is convertible into 100 shares of the Companys common stock, pre-reverse stock split.\nOn December 21, 2020, the Company increased its authorized Preferred Series A and Series B shares to 5 Billion shares of Series A Preferred Stock, par value, $0.000001 per share, and 5 Billion Shares of Series B Preferred Stock, par value, $0.000001 per share (together the Preferred Stock), pre-reverse stock split.\nSeries A Preferred Stock & Series B Preferred Stock - Certificate of Designations\nThe Preferred Shares each have Certificate of Designations, which designate as follows:\nNumber\n500,000,000 shares of the Parent Companys Preferred Stock are designated as shares of Series A Convertible Preferred Stock, par value $0.000001 per share.\nDividends\nAny dividends (other than dividends on common stock payable solely in common stock or dividends on the Series A Convertible Preferred Stock payable solely in Series A Convertible Preferred Stock or dividends on the Series B Preferred Convertible Stock payable solely in Series B Convertible Preferred Stock) declared or paid in any fiscal year will be declared or paid among the holders of the Series A Convertible Preferred Stock, Series B Convertible Preferred Stock and common stock then outstanding in proportion to the greatest whole number of shares of common stock which would be held by each such holder if all shares of Series A Preferred Stock and Series B Convertible Preferred Stock were converted into shares of common stock pursuant to the terms of the Certificate of Designations. The Parent Companys Board of Directors is under no obligation to declare dividends on the Series A Convertible Preferred Stock or Series B Convertible Preferred Stock.\nConversion\nEach share of Preferred Stock is convertible into 100 shares of the Parent Companys common stock (the Conversion Rate).\nLiquidation\nIn the event of any liquidation, dissolution or winding up of the Parent Company, the assets of the Parent Company legally available for distribution by the Parent Company would be distributed with equal priority and pro rata among the holders of the Preferred Stock and common stock in proportion to the number of shares of common stock held by them, with the shares of Preferred Stock being treated for this purpose as if they had been converted to shares of common stock at the then applicable Conversion Rate.\nVoting\nOn any matter presented to the stockholders of the Parent Company for their action or consideration at any meeting of stockholders of the Parent Company (or by written consent of stockholders in lieu of meeting), each holder of outstanding shares of Preferred Stock would be entitled to cast the number of votes equal to the number of whole shares of common stock into which the shares of Preferred Stock held by such holder are convertible as of the record date for determining stockholders entitled to vote on such matter. Except as provided by law or by the other provisions of the Parent Companys Certificate of Incorporation, holders of Preferred Stock vote together with the holders of common stock as a single class.\nNOTE 14. PROVISION FOR CORPORATE INCOME TAXES\nThe Company provides for income taxes by the use of an asset and liability approach in accounting for income taxes. Deferred tax assets and liabilities are recorded based on the differences between the financial statement and tax bases of assets and liabilities and the tax rates in effect when these differences are expected to reverse. This also requires the reduction of deferred tax assets by a valuation allowance if, based on the weight of available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized.\nThe valuation allowance at June 30, 2022 was $6,584,324 and as of June 30, 2021 was $2,792,070. The net change in allowance during the years ended June 30, 2022 and 2021 was $3,792,254 and $514,843, respectively.\nAs of June 30, 2022, the Company has federal net operating loss carry forwards of approximately $31,354,000 available to offset future taxable income through 2040. The Company may be able to utilize its NOLs to reduce future federal and state income tax liabilities. However, these NOLs are subject to various limitations under Internal Revenue Code (IRC) Section 382. IRC Section 382 limits the use of NOLs to the extent there has been an ownership change of more than 50 percentage points. In addition, the NOL carry-forwards are subject to examination by the taxing authority and could be adjusted or disallowed due to such exams. Although the Company has not undergone an IRC Section 382 analysis, it is possible that the utilization of the NOLs could be substantially limited. The Company has no tax provision for the years ended June 30, 2022 and 2021 due to losses and full valuation allowances against net deferred tax assets.\nAs of June 30, 2022 and June 30, 2021, the difference between the tax provision at the statutory federal income tax rate and the tax provision attributable to loss before income taxes is as follows (in percentages):\nStatutory federal income tax rate\n(21 )%\nState taxes - net of federal benefits\n(5 )%\nValuation allowance\n26 %\nIncome tax rate - net\n0 %\nFASB Interpretation No. 48 (Fin 48) - Accounting for Uncertain Tax Positions\nThe Company files income tax returns in the U.S. federal jurisdiction and various state, and local jurisdictions. The Company is no longer subject to U.S. federal income tax examination by tax authorities, with limited exception, for the years prior to June 30, 2014. With respect to state and local jurisdictions, with limited exception, the Company is no longer subject to income tax audits prior to June 30, 2014. In the normal course of business, the Company is subject to examination by various taxing authorities. Although the outcome of tax audits is always uncertain, the Company believes that adequate amounts of tax, interest and penalties have been provided for any adjustments that may result from these open tax years.\nBased on managements review of the Companys tax position, the Company had no significant unrecognized corporate tax liabilities as of June 30, 2022 and 2021 payable to the Internal Revenue Service due to the net operating loss carry-forward, however, the Company had yet to file its 2005 through 2009 and 2012 through 2021 Federal, New Jersey nor New York Corporate Income Tax Returns.\nNOTE 15. UNPAID PAYROLL TAXES\nAs of June 30, 2022 and 2021, the Company owed the Internal Revenue Service and New York State payroll related taxes in the amounts of $60,402 and $17,401, respectively, subject to further interest and penalties. The total amount due to both taxing authorities including penalties and interest as of June 30, 2022 and 2021 was approximately $77,803 subject to further penalties and interest. This is included in accounts payable and accrued expenses on the Companys consolidated balance sheets.\nIRS Tax Lien\nThe Internal Revenue Service has placed a federal tax lien on all of the assets of the Company.\nNOTE 16. COMMITMENTS AND CONTINGENCIES\nLicensing Agreement\nOn March 31, 2022, the Company entered into a management agreement with TruCash Group of Companies, Inc. (TruCash) where the Company is licensing from TruCash certain VISA ICAs and BINs to be used by the Company to offer certain pre-paid cards, mobile apps, loyalty programs, and other merchant related services to its potential clients. The Agreement has a term of five (5) years and monthly payments due to TruCash of $250,000 (the Licensing Fee).\nRent\nAs of June 30, 2022, the Company maintains its corporate address in at 2310 York Street, Suite 200, Blue Island, IL, 60406. This space is provided by the Companys Chairman, Charles Everhardt, a related party, on a rent free basis at the present time. The Company does not currently have a lease for this space but expects to enter into a month-to-month office lease for this space.\nSarahCare leases three properties for its corporate office and its two corporate owned centers. SarahCares corporate office is approximately 3,470 square feet and is located at 4580 Stephen Circle NW, Canton, Ohio, 44718. The lease began in 2017 and ends in 2023.\nSarahCares lease for its first corporate-owned SarahCare location is for approximately 5,300 square feet located at 6199 Frank Ave. NW, North Canton, Ohio, 44720. The lease began in 2018 and ends in 2026.\nSarahCares lease for its second corporate-owned SarahCare location is for approximately 6,000 square feet located at SarahCare of Stow, 4472 Darrow Road, Stow, Ohio, 44224. The lease began in 2018 and ends in 2026.\nOn April 21, 2021, the Company, through ten newly-formed, wholly-owned limited liability companies, entered into lease agreements with entities controlled by our Chairman, Charles Everhardt, for ten additional SarahCare locations to be operated by the Company. All of the leases are for a ten-year period beginning on July 1, 2021, and ending on June 30, 2031, with a 5-year renewal option. The rent for each location is $7,500 per month. On April 29, 2022, the Company amended the leases to delay commencement until November 1, 2022. On August 19, 2022, the Company and landlord mutually agreed to terminate one of the leases formed on April 21, 2021.\nNOTE 17. LEASES\nOperating Leases\nStow Professional Lease\nIn connection with the acquisition of Sarah Adult Day Centers, Inc. on March 25, 2021, the Company acquired a facilities lease with 6,000 square feet at 4472 Darrow Road, Stow, Ohio 44224. The lease expires on December 31, 2025 and the lease payments are as follows:\nMonthly Rent Payments\nBase Rent\nCovid-19\nRecoup*\nTotal Rent\nApril 1, 2021\n$ 6,369\n$ 983\n$ 7,352\nMay 1, 2021 to December 31, 2021\n$ 6,369\n$ 621\n$ 6,990\nJanuary 1, 2022 to December 31, 2022\n$ 6,433\n$ 621\n$ 7,054\nJanuary 1, 2023 to December 31, 2023\n$ 6,497\n$ 621\n$ 7,118\nJanuary 1, 2024 to December 31, 2024\n$ 6,562\n$ 621\n$ 7,183\nJanuary 1, 2025 to December 31, 2025\n$ 6,628\n$ 621\n$ 7,249\n________\n*The Company has to repay the lessor monthly payments as a result of COVID relief.\nHarbor Lease\nIn connection with the acquisition of Sarah Adult Day Centers, Inc. on March 25, 2021, the Company acquired a facilities lease with 3,469 square feet at 4580 Stephen Circle NW. Canton, OH 44718. The monthly lease payments are $4,500 and the lease expires on December 31, 2023.\nIn connection with the acquisition of Sarah Day Care Centers, Inc. on March 25, 2021, the Company acquired a facilities lease with 5,300 square feet in Jackson, Ohio. The monthly lease payments are $7,910, which includes monthly payments of $603 as repayments for COVID relief. The lease expires on July 1, 2026.\nS. Frank Professional Lease\nOperating lease right-of-use asset and liability are recognized at the present value of the future lease payments at the lease commencement date. The interest rate used to determine the present value is the incremental borrowing rate, estimated to be 10%, as the interest rate implicit in most of the Companys leases is not readily determinable. Operating lease expense is recognized on a straight-line basis over the lease term. Since the common area maintenance expenses are expenses that do not depend on an index or rate, they are excluded from the measurement of the lease liability and recognized in general and administrative expenses on the consolidated statements of operations.\nRight-of-use asset is summarized below:\nJune 30, 2022\nStow\nProfessional\nCenter Lease\nHarbor\nLease\nS. Frank Professional\nLease\nTotal\nOffice lease\n$ 282,371\n$ 130,441\n$ 412,770\n$ 825,582\nLess: accumulated amortization\n(76,539 )\n(66,710 )\n(92,972 )\n(236,221 )\nRight-of-use asset, net\n$ 205,832\n$ 63,731\n$ 319,798\n$ 589,361\nJune 30, 2021\nStow\nProfessional\nCenter Lease\nHarbor\nLease\nS. Frank Professional\nLease\nTotal\nOffice lease\n$ 282,371\n$ 120,003\n$ 394,398\n$ 796,772\nLess: accumulated amortization\n(14,571 )\n(10,701 )\n(14,187 )\n(39,459 )\nRight-of-use asset, net\n$ 267,800\n$ 109,302\n$ 380,211\n$ 757,313\nOperating lease liability is summarized below:\nJune 30, 2022\nStow\nProfessional\nCenter Lease\nHarbor\nLease\nS. Frank\nProfessional\nLease\nTotal\nOffice lease\n$ 206,887\n$ 63,732\n$ 319,798\n$ 590,417\nLess: current portion\n(68,101 )\n(50,343 )\n(66,738 )\n(185,182 )\nLong term portion\n$ 138,786\n$ 13,389\n$ 253,060\n$ 405,235\nJune 30, 2021\nStow\nProfessional\nCenter Lease\nHarbor\nLease\nS. Frank Professional\nLease\nTotal\nOffice lease\n$ 267,798\n$ 109,303\n$ 380,212\n$ 757,313\nLess: current portion\n(60,912 )\n(45,571 )\n(60,412 )\n(166,895 )\nLong term portion\n$ 206,886\n$ 63,732\n$ 319,800\n$ 590,418\nMaturity of the lease liability is as follows:\nJune 30, 2022\nStow\nProfessional\nCenter Lease\nHarbor\nLease\nS. Frank Professional\nLease\nTotal\nYear ending June 30, 2023\n$ 85,026\n$ 54,000\n$ 94,923\n$ 233,949\nYear ending June 30, 2024\n85,802\n13,500\n94,923\n194,225\nYear ending June 30, 2025\n64,840\n-\n94,923\n159,763\nYear ending June 30, 2026\n-\n-\n94,923\n94,923\nYear ending June 30, 2027\n-\n-\n7,910\n7,910\nPresent value discount\n(28,781 )\n(3,768 )\n(67,804 )\n(100,353 )\nLease liability\n$ 206,887\n$ 63,732\n$ 319,798\n$ 590,417\nJune 30, 2021\nStow\nProfessional\nCenter Lease\nHarbor\nLease\nS. Frank Professional\nLease\nTotal\nYear ending June 30, 2022\n$ 84,258\n$ 54,000\n$ 94,923\n$ 233,181\nYear ending June 30, 2023\n85,025\n54,000\n94,923\n233,948\nYear ending June 30, 2024\n85,802\n13,501\n94,923\n194,226\nYear ending June 30, 2025\n64,841\n-\n94,923\n159,764\nYear ending June 30, 2026\n-\n-\n94,923\n94,923\nYear ending June 30, 2027\n-\n-\n7,913\n7,913\nPresent value discount\n(52,128 )\n(12,198 )\n(102,316 )\n(166,642 )\nLease liability\n$ 267,798\n$ 109,303\n$ 380,212\n$ 757,313\nFinance leases\nCommencing during the year ended June 30, 2022, the Company leases office equipment under two finance leases with combined monthly payments of $5,897. The leases mature on March 1, 2024 and December 1, 2026.\nFinance right of use assets are summarized below:\nAs of\nAs of\nJune 30,\nJune 30,\nEquipment lease\n$ 24,097\n$ -\nLess accumulated amortization\n(3,442 )\n-\nFinance right of use asset\n$ 20,655\n$ -\nOn October 1, 2021, the Company discontinued use of one of its copiers. As a result, the Company recorded an impairment of assets in the amount of $84,364. Amortization expense was $3,442 and $0 for the years ended June 30, 2022 and 2021, respectively.\nFinance lease liabilities are summarized below:\nAs of\nAs of\nJune 30,\nJune 30,\nEquipment lease\n$ 186,124\n$ -\nLess: current portion\n(42,855 )\n-\nLong term portion\n$ 143,269\n$ -\nEquipment\nLease\nYear Ended June 30, 2023\n$ 70,761\nYear Ended June 30, 2024\n61,167\nYear Ended June 30, 2025\n32,388\nYear Ended June 30, 2026\n32,388\nYear Ended June 30, 2027\n16,194\nTotal future minimum lease payments\n212,898\nLess imputed interest\n(26,774 )\nPV of payments\n$ 186,124\nNOTE 18. RELATED PARTY TRANSACTIONS\nDuring the years ended June 30, 2022 and 2021, related party transactions were as follows:\nAs of June 30, 2022, the Company maintains its corporate address in at 2310 York Street, Suite 200, Blue Island, IL, 60406. This space is provided by the Companys Chairman, Charles Everhardt, a related party, on a rent free basis at the present time. The Company does not currently have a lease for this space but expects to enter into a month-to-month office lease for this space.\nAs of March 31, 2022, a company founded and partially owned by the Companys Chairman, Charles Everhardt, has paid the Licensing Fees of $750,000 on behalf of the Company, which is included in accounts payable and accrued liabilities.\nOn May 5, 2022, the Company signed a note receivable of $179,124 from a company founded and partially owned by the Companys Chairman, Charles Everhardt.\nOn March 25, 2022, the Company signed a note receivable of $39,000 from a company founded and partially owned by the Companys Chairman, Charles Everhardt.\nOn September 28, 2021, the Company signed a note receivable of $50,000 from a company founded and partially owned by the Companys Chairman, Charles Everhardt.\nOn September 8, 2021 the Company signed a note receivable of $29,294 from a company founded and partially owned by the Companys Chairman, Charles Everhardt.\nOn April 21, 2021, the Company, through ten newly-formed, wholly-owned limited liability companies, entered into lease agreements with entities controlled by our Chairman, Charles Everhardt, for ten additional SarahCare locations to be operated by the Company. All of the leases are for a ten-year period beginning on July 1, 2021, and ending on June 30, 2031, with a 5-year renewal option. The rent for each location is $7,500 per month. In July 2021, the Company has amended the leases to delay commencement until November 1, 2021. On October 29, 2021 the Company amended the leases to delay commencement until May 1, 2022. The newly formed entities have no other activity aside from the lease activity described above.\nOn March 25, 2021, the Company issued 2,476,212 shares of restricted common stock in exchange for $250,000 which were issued at $0.0503 per share and the Company issued 100,542 shares of Series A Preferred Stock in exchange for $508,834, which were issued at $5.06 per share, to an investor, the son of Charles Everhardt, the Companys Chairman. Additionally, Mr. Everhardt owns 50% of DE Holdings 20, LLC which converted $114,244 in convertible notes and accrued interest for 114,244 shares of restricted common shares, at a price of $1.00 per share. On that same day, Mr. Everhardt became Chairman of the Board of the Company.\nOn March 19, 2021, the Company issued 426,000 shares of restricted common stock to the Companys then CEO and Chairman, Michael J Friedman, for the conversion 42,600,000 shares of Series A Convertible Preferred Stock.\nOn March 19, 2021, the Company issued 48,000 shares of restricted common stock to Jay Odintz, a Member of the Companys Board of Directors, for the conversion 4,800,000 shares of Series A Convertible Preferred Stock.\nOn December 30, 2020, the Company issued 29,749,125,000 shares of restricted common stock for the conversion of notes payable in the amount of $1,427,958, to the Companys then CEO and Chairman, Michael J. Friedman. These shares were valued by the Company at $0.000048 per share, pre-reverse stock split.\nOn December 30, 2020, the Company issued 4,518,062,500 shares of restricted common stock for the conversion of notes payable in the amount of $216,867, to a Board of Director Member, Jay Odintz. These shares were valued by the Company at $0.000048 per share, pre-reverse stock split.\nNOTE 19. SUBSEQUENT EVENTS\nThe Company has evaluated subsequent events for recognition and disclosure through October 13, 2022, the date the financial statements were available to be issued, and determined that there were no such events requiring adjustment to, or disclosure in, the accompanying consolidated financial statements except as described below. Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure\nWe have had no disagreements with our accountants required to be disclosed pursuant to Item 304 of Regulation S-K. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nThe Companys Chief Executive Officer and Chief Financial Officer have evaluated the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) as of the year ended June 30, 2022, covered by this Form 10-K. Based upon such evaluation, the Chief Executive Officer and Chief Financial Officer have concluded that, as of the end of such period, the Companys disclosure controls and procedures were not effective as required under Rules 13a-15(e) and 15d-15(e) under the Exchange Act.\nManagements Annual Report on Internal Control over Financial Reporting\nThe management of the Company is responsible for the preparation of the financial statements and related financial information appearing in this Annual Report on Form 10-K. The financial statements and notes have been prepared in conformity with accounting principles generally accepted in the United States of America. The management of the Company is also responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. A companys internal control over financial reporting is defined as a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that:\nPertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the Company;\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the issuer are being made only in accordance with authorizations of management and the board of directors of the Company; and\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nManagement, including the Chief Executive Officer and Chief Financial officer, does not expect that the Companys disclosure controls and internal controls will prevent all error and all fraud. Because of its inherent limitations, a system of internal control over financial reporting can provide only reasonable, not absolute, assurance that the objectives of the control system are met and may not prevent or detect misstatements. Further, over time, control may become inadequate because of changes in conditions or the degree of compliance with the policies or procedures may deteriorate.\nWith the participation of the Chief Executive Officer and Chief Financial Officer, our management evaluated the effectiveness of the Companys internal control over financial reporting As of June 30, 2022, based upon the framework in Internal Control -Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in 2013. Based on that evaluation, our management has concluded that, as of June 30, 2022, the Company had material weaknesses in its internal control over financial reporting and the Companys internal control over financial reporting were not effective. Specifically, management identified the following material weaknesses at June 30, 2022:\n1.\nLack of oversight by independent directors in the establishment and monitoring of required internal controls and procedures;\n2.\nLack of functioning audit committee, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures;\n3.\nInsufficient personnel resources within the accounting function to segregate the duties over financial transaction processing and reporting and to allow for proper monitoring controls over accounting;\n4.\nInsufficient written policies and procedures over accounting transaction processing and period end financial disclosure and reporting processes.\nTo remediate our internal control weaknesses, management intends to implement the following measures:\n·\nThe Company will add sufficient number of independent directors to the board and appoint an audit committee.\n·\nThe Company will add sufficient knowledgeable accounting personnel to properly segregate duties and to effect a timely, accurate preparation of the financial statements.\n·\nUpon the hiring of additional accounting personnel, the Company will develop and maintain adequate written accounting policies and procedures.\nThe additional hiring is contingent upon the Companys efforts to obtain additional funding through equity or debt for its continued operational activities and corporate expenses. Management provides no assurances that it will be able to do so.\nWe understand that remediation of material weaknesses and deficiencies in internal controls are a continuing work in progress due to the issuance of new standards and promulgations. However, remediation of any known deficiency is among our highest priorities. Our management will periodically assess the progress and sufficiency of our ongoing initiatives and make adjustments as and when necessary.\nAs a smaller reporting company, we are not required to provide, and this annual report does not include, an attestation report of our registered public accounting firm regarding internal control over financial reporting.\nChanges in Internal Control over Financial Reporting\nExcept as set forth above, there were no changes in our internal control over financial reporting that occurred during the period covered by this report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nLimitations on the Effectiveness of Controls\nThe Companys management, including the CEO and CFO, does not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all error and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. Further, the design of the control system must reflect that there are resource constraints and that the benefits must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Controls can also be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of controls. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of controls effectiveness to future periods are subject to risks. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures. Item 9B. Other Information.\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe following table sets forth information with respect to persons who are serving as directors and officers of the Company. Each director holds office until the next annual meeting of shareholders or until his successor has been elected and qualified.\nName\nAge\nPositions\nCharles Everhardt\nChairman of the Board (1)\nMichael Friedman\nDirector (1)(3), President & Interim Chief Financial Officer (2)\nMerle Griff, Ph.D.\nChief Executive Officer (4)\n__________\n(1)\nAll directors hold office until the next annual meeting of stockholders and until their successors have been duly elected and qualified.\n(2)\nMichael Friedman has been the Interim CEO, Interim CFO and Interim President since March 25, 2021, and on May 24, 2022, resigned as Interim CEO and became President (and remaining as Interim CFO).\n(3)\nMichael Friedman was Chairman of the Board from December 16, 2005, until March 25, 2021, when he became a Director.\n(4)\nOn May 24, 2022, Merle Griff, Ph.D. became Chief Executive Officer.\nBiographies of Directors and Officers\nThe following is a brief account of the education and business experience during at least the past five years of each director, executive officer and key employee of our company, indicating the persons principal occupation during that period, and the name and principal business of the organization in which such occupation and employment were carried out.\nMr. Everhardt, appointed as Chairman of our Board of Directors on March 25, 2021, has been active in many aspects of real estate, brokerage, development, construction, lending, banking, and purchasing of distressed assets, for over two decades. Mr. Everhardt created and became a partner with Infinity Cards and founded Spindeltop Ventures, LLC, which had a world-wide relationship with MasterCard and Google Wallet, for its affinity prepaid debit cards. Mr. Everhardt has been a partner in Lockwood Development partners, Inc., since 2015. Mr. Everhardt is a partner in Lockwood Development Partners, a real estate investment and development company. The Company believes that Mr. Everhardts extensive real estate and development experience makes him a valuable member of the Companys Board of Directors.\nMichael Friedman, LLM, JD, served as the Companys President, Chief Executive Officer, Chief Financial Officer and Chairman of the Board of Directors from December 2005, until March 25, 2021, when he became our Interim CEO, Interim CFO and Interim President. On May 24, 2022, Mr. Friedman resigned as Interim CEO and became President of the Company, and remaining as the Companys Interim CFO. Mr. Friedman has continued as President and has remained a Director of the Company. Since 2014, Mr. Friedman has been an advisor, Board of Director Member, and chief financial officer for multiple companies in several industries, primarily focusing in media and technology. Mr. Friedman is co-Founder and CEO of Treat Holdings, LLC which developed the TreatER mobile application which is available on the Apple App Store and directs users to the nearest urgent care or emergency room. The Company previously had a relationship with Treat Holdings, which was terminated on March 25, 2021. On October 1, 2021, Mr. Friedman became President, CEO and a Director of Trident Brands Incorporated (OTC Pink: TDNT). Mr. Friedman received a Master of Laws in Taxation (LL.M.) and a Juris Doctor (JD) from New York Law School. The Company believes that Mr. Friedmans extensive business experience and legal expertise makes him a valuable member of the Companys Board of Directors.\nMerle Griff, Ph.D., has served as the Chief Executive Officer since May 24, 2022. Dr. Griff is the Founder and has been the CEO of SarahCare (a wholly owned subsidiary of the Company) since its inception approximately 35 years ago, and she is one of the leading authorities on the care of seniors in the United States. Dr. Griff has served on numerous national boards and task forces including being the past Chairperson of the Board of Directors for NADSA (National Adult Day Services Association), member of the International Advisory Board for CARF (Commission on the Accreditation for Rehabilitation Facilities) and a task force member for the study of adult day care in the US for the Assistant Secretary of Program and Evaluation in the Department of Aging. Dr. Griff began her professional career working with children and youth as a play therapist. She developed therapeutic techniques that have been published and used throughout the world, namely Family Play Therapy and Intergenerational Play Therapy. As Director of the McKinley Center Intergenerational Project, she developed many programs that brought together children from babies through college-age with seniors. Dr. Griff is the author of Linkages, a book based on research intergenerational programs, and numerous book chapters and journal articles on topics such as the role of grandparents in family systems. Dr. Griffs vast knowledge and deep experience in healthcare and adult day care made her a valuable member of the Companys executive team.\nThere are no family relationships among any of our directors and executive officers.\nOur directors are elected at the annual meeting of the shareholders, with vacancies filled by the Board of Directors, and serve until their successors are elected and qualified, or their earlier resignation or removal. Officers are appointed by the board of directors and serve at the discretion of the board of directors or until their earlier resignation or removal. Any action required can be taken at any annual or special meeting of stockholders of the corporation which may be taken without a meeting, without prior notice and without a vote, if consent of consents in writing setting forth the action so taken, shall be signed by the holders of the outstanding stock having not less than the minimum number of votes that would be necessary to authorize or take such action at a meeting at which all shares entitled to vote thereon were present and voted and shall be delivered to the corporation by delivery to its registered office, its principle place of business, or an officer or agent of the corporation having custody of the book in which the proceedings of meetings are recorded.\nIndemnification of Directors and Officers\nPursuant to Section 145 of the General Corporation Law of the State of Delaware, we have the power to indemnify any person made a party to any lawsuit by reason of being a director or officer of the Company, or serving at the request of the corporation as a director, officer, employee or agent of another corporation, partnership, joint venture, trust or other enterprise against expenses (including attorneys fees), judgments, fines and amounts paid in settlement actually and reasonably incurred by him in connection with such action, suit or proceeding if he acted in good faith and in a manner he reasonably believed to be in or not opposed to the best interests of the corporation, and, with respect to any criminal action or proceeding, had no reasonable cause to believe his conduct was unlawful. Our articles of incorporation provide that the Company shall indemnify its directors and officers to the fullest extent permitted by Delaware law.\nInsofar as indemnification by us for liabilities arising under the Securities Act may be permitted to our directors, officers or persons controlling the company pursuant to provisions of our articles of incorporation and bylaws, or otherwise, we have been advised that in the opinion of the SEC, such indemnification is against public policy as expressed in the Securities Act and is therefore unenforceable. In the event that a claim for indemnification by such director, officer or controlling person of us in the successful defense of any action, suit or proceeding is asserted by such director, officer or controlling person in connection with the securities being offered, we will, unless in the opinion of our counsel the matter has been settled by controlling precedent, submit to a court of appropriate jurisdiction the question whether such indemnification by us is against public policy as expressed in the Securities Act and will be governed by the final adjudication of such issue.\nInvolvement on Certain Material Legal Proceedings During the Last Five Years\nNone of our Officers and/or Directors have filed any bankruptcy petition, been convicted of or been the subject of any criminal proceedings or the subject of any order, judgment or decree involving the violation of any state or federal securities laws within the past ten (10) years.\nNo director, nominee for director, or executive officer has appeared as a party in any legal proceeding material to an evaluation of his ability or integrity during the past ten (10) years.\nDirectors and Officers Liability Insurance\nThe Company does not have directors and officers liability insurance insuring our directors and officers against liability for acts or omissions in their capacities as directors or officers.\nCode of Ethics\nWe have adopted a code of ethics that applies to our officers, directors and employees, including our principal executive officer and principal accounting officer.\nCorporate Governance and Board Independence\nOur Board of Directors consists of two directors and has not established a Nominating or Governance Committees as standing committees. The Board does not have an executive committee or any committees performing a similar function. We are not currently listed on a national securities exchange or in an inter-dealer quotation system that has requirements that a majority of the board of directors be independent.\nDue to our lack of operations and size, and since we are not currently listed on a national securities exchange, we are not subject to any listing requirements mandating the establishment of any particular committees; all functions of a nominating/governance committee were performed by our whole board of directors. Our board of directors intends to appoint such persons and form such committees as are required to meet the corporate governance requirements imposed by the national securities exchanges as necessary. Our board of directors does not believe that it is necessary to have such committees at the early stage of the companys development, and our board of directors believes that the functions of such committees can be adequately performed by the members of our board of directors.\nWe believe that our board of directors is capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. We believe that retaining an independent director who would qualify as an audit committee financial expert would be overly costly and burdensome and is not warranted in our circumstances given the early stages of our development and the fact that we have not generated any material revenues to date.\nBoard Leadership Structure and the Boards Role in Risk Oversight.\nThe Board of Directors is led by our Chairman. At this time, the Board believes that the most effective leadership structure at this time is to separate the roles of Chairman and Chief Executive Officer.\nThe Board of Directors does not have a specific role in risk oversight of the Company. The President and Chief Executive Officer and other executive officers and employees of the Company provide the Board of Directors with information regarding the Companys risks. Item 11. Executive Compensation\nThe following table sets forth, for the fiscal years ended June 30, 2022, 2021, and 2020, certain information regarding the compensation earned by the Companys named executive officers.\nSummary Compensation Table\nName and\nStock\nOption\nAll Other\nPrincipal\nFiscal\nSalary\nBonus\nAwards\nAwards\nCompensation\nTotal\nPosition\nYear\n(1)\n(2)\n(3)\n(4)\n(5)\n($)\nMichael Friedman President\n$ 150,000 (6)\n$ -\n$ -\n$ 156,000 (7)\n$ -\n$ 306,000\nPresident & CEO\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nPresident & CEO\n$ 144,000\n$ -\n$ -\n$ -\n$ -\n$ 144,000\nMerle Griff, Ph.D.\n$\n-\n$\n-\n$\n-\n$\n156,000\n(8)\n$\n-\n$\n156,000\nCEO\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\nCEO\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n________\n(1)\nThe dollar value of salary (cash and non-cash) earned and accrued as of the end of each fiscal year.\n(2)\nThe dollar value of bonus (cash and non-cash) earned and accrued as of the end of each fiscal year.\n(3)\nThe value of the shares of restricted stock issued as compensation for services computed in accordance with ASC 718 on the date of grant.\n(4)\nThe value of all stock options computed in accordance with ASC 718 on the date of grant.\n(5)\nAll other compensation received that could not be properly reported in any other column of the table.\n(6)\nThis includes earned and paid salary of $65,000 and accrued salary of $85,000 for 2022 and $144,000 of accrued salary for 2020.\n(7)\nOptions awards granted include 50,000 options at $1.56 exercise price, for a signing bonus and 50,000 options at $1.56 exercise price for achieving revenue growth of 12% or greater.\n(8)\nOptions awards granted include 50,000 options at $1.56 exercise price, for a signing bonus and 50,000 options at $1.56 exercise price for achieving revenue growth of 12% or greater.\nLong-Term Incentive Plans. The Company does not provide its officers or employees with pension, stock appreciation rights, long-term incentive or other plans, nor does it provide non-qualified deferred compensation to its officers or employees, and therefore, the Summary Compensation Table above does not include columns for nonequity incentive plan compensation and nonqualified deferred compensation earnings, since there were none.\nEmployee Pension, Profit Sharing or other Retirement Plans. The Company does not have a defined benefit, pension plan, profit sharing or other retirement plan, although it may adopt one or more of such plans in the future.\nExecutive Compensation.\nThe Company does not have a director agreement with Mr. Friedman. Through June 30, 2020, Mr. Friedman accrued $144,000 in salary per year pursuant to an employment contract which expired on October 31, 2010, and then an oral agreement with the Company, which was then terminated, and $24,000 in director fees per year pursuant to an oral agreement with the Company, which was then terminated.\nIn connection with Dr. Griffs appointment and Mr. Friedmans resignation, on May 24, 2022, the Company entered into an employment agreement with Dr. Griff (the Employment Agreement), as well as a consulting agreement with Mr. Friedmans entity, Red Halo, LLC (the Consulting Agreement), with both agreements considered effective as of May 2, 2022.\nUnder the Employment Agreement, Dr. Griff will serve as the Chief Executive Officer of the Company on an at-will basis and will be compensated as follows: (i) Dr. Griff will receive a signing bonus consisting of non-qualified, cashless-exercise stock options to purchase 50,000 shares of Company common stock at an exercise price of $1.56/share, with a term of 7 years; (ii) Dr. Griff will be paid an annual salary of $200,000 per year, and such annual salary shall increase by an additional $50,000 per year for each $10,000,000 increase in the Companys gross revenues over $1,000,000; (iii) within 30 days after the end of each fiscal year beginning June 30, 2022, Dr. Griff will receive an annual cash bonus of at least $60,000 (the precise amount to be determined by the Company); (iv) within 30 days after the end of each fiscal year beginning June 30, 2022, Dr. Griff will receive an equity bonus consisting of non-qualified, cashless-exercise stock options to purchase 50,000 shares of Company common stock at an exercise price of $1.56/share, with a term of 7 years; and (v) Dr. Griff shall be eligible to receive the following 7-year, non-qualified, cashless-exercise stock options for each fiscal year determined by reference to the Companys gross revenue for such fiscal year as set forth below:\nGross Revenue\nNumber of Options\nStrike Price\n$ 5,000,000\n100,000\n$ 1.56\n$ 10,000,000\n150,000\n$ 2.00\n$ 20,000,000\n200,000\n$ 3.00\n$ 40,000,000\n250,000\n$ 4.00\n$ 75,000,000\n300,000\n$ 5.00\n$ 100,000,000\n350,000\n$ 6.00\nUnder the Consulting Agreement, Mr. Friedman will provide management, financial and operational services to the Company and continue to act as the Companys President, and will be compensated as follows: (i) Mr. Friedmans entity, Red Halo, LLC (the Consultant) will receive a signing bonus consisting of non-qualified, cashless-exercise stock options to purchase 50,000 shares of Company common stock at an exercise price of $1.56/share, with a term of 7 years; (ii) the Consultant will be paid $150,000 in cash fees per year, upon completion of a $6,600,000 capital raise by the Company, such annual cash fee shall increase to $200,000 per year, and such annual cash fee shall increase by an additional $50,000 per year for each $10,000,000 increase in the Companys gross revenues over $1,000,000; (iii) within 90 days after the end of each fiscal year beginning June 30, 2022, the Consultant will receive an annual cash bonus of at least $60,000 (the precise amount to be determined by the Company) if the Companys net income (specifically excluding any extraordinary major shareholder-related expenses) is at or greater than $600,000 for such fiscal year; (iv) within 90 days after the end of each fiscal year beginning June 30, 2022, if the Companys total revenue has grown at least 12% from its prior fiscal year, the Consultant will receive an equity bonus consisting of non-qualified, cashless-exercise stock options to purchase a minimum of 50,000 shares of Company common stock at an exercise price of $1.56/share, with a term of 7 years; and (v) the Consultant shall be eligible to receive the following 7-year, non-qualified, cashless-exercise stock options for each fiscal year determined by reference to the Companys gross revenue for such fiscal year as set forth below:\nGross Revenue\nNumber of Options\nStrike Price\n$ 5,000,000\n100,000\n$ 1.56\n$ 10,000,000\n150,000\n$ 2.00\n$ 20,000,000\n200,000\n$ 3.00\n$ 40,000,000\n250,000\n$ 4.00\n$ 75,000,000\n300,000\n$ 5.00\n$ 100,000,000\n350,000\n$ 6.00\nBoth the Employment Agreement and the Consulting Agreement prohibit Dr. Griff and Mr. Friedman from engaging in competitive activity during the terms of their agreements with the Company, and each of the agreements can be terminated by either the Company or the counterparties, Dr. Griff and Mr. Friedman, provided that if the agreements are terminated by the Company without cause or by the counterparties for good reason, as such terms are defined in each respective agreement, the Company is obligated to make additional payments to Dr. Griff and Mr. Friedman as specified in the agreements.\nCompensation Committee Interlocks and Insider Participation. During the year ended June 30, 2020, none of the Companys officers was also a member of the compensation committee or a director of another entity, which other entity had one of its executive officers serving as one of the Companys directors.\nOutstanding Equity Awards. Our directors and officers do not have unexercised options, stock that has not vested, or equity incentive plan awards.\nDirector Independence\nDuring the fiscal year ended June 30, 2022 and 2021, we did not have an independent director.\nDirector Compensation Table\nFiscal\nFees Earned or\nName\nYear Ending\nJune 30\nPaid in\nCash (1)\nStock\nAwards\nOption\nAwards\nAll Other\nCompensation\nTotal\n($)\nCharles Evehardt (2)\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nMichael Friedman (3)\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nJay Odintz (4)\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\n________\n(1)\nAll cash fees were accrued to the directors.\n(2)\nAppointed as Chairman of the Board on March 25, 2021\n(3)\nChairman of the Board through March 25, 2021, and Member of the Board of Directors thereafter.\n(4)\nResigned from the Board of Directors on March 25, 2021. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table lists, as of September 28, 2022, the number of shares of voting capital stock of our Company that are beneficially owned by (i) each person or entity known to our Company to be the beneficial owner of more than 5% of the outstanding class of stock; (ii) each officer and director of our Company; and (iii) all officers and directors as a group. Information relating to beneficial ownership of common stock by our principal shareholders and management is based upon information furnished by each person using beneficial ownership concepts under the rules of the Securities and Exchange Commission. Under these rules, a person is deemed to be a beneficial owner of a security if that person has or shares voting power, which includes the power to vote or direct the voting of the security, or investment power, which includes the power to vote or direct the voting of the security. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Under the Securities and Exchange Commission rules, more than one person may be deemed to be a beneficial owner of the same securities, and a person may be deemed to be a beneficial owner of securities as to which he or she may not have any pecuniary beneficial interest. Except as noted below, each person has sole voting and investment power.\nThe percentages below are calculated based on 21,157,327 shares of our common stock issued and outstanding as of September 28, 2022, and 367,500 shares of Series B Convertible Preferred Stock issued and outstanding as of September 28, 2022. Each share of Series B Convertible Preferred Stock is convertible at the election of the holder into 100 shares of common stock, and each share entitles the holder to 100 stockholder votes. We do not have any other outstanding options, warrants exercisable for, or other securities convertible into shares of our common stock within the next 60 days. Unless otherwise indicated, the address of each person listed below is care of Innovative MedTech, Inc. 2310 York St., Suite 200, Blue Island, IL 60406.\nName of Beneficial Owner\nTitle of Class\nAmount and Nature of Beneficial Ownership\nPercent of\nClass\nCharles Everhardt (1)\nCommon Stock\n12,548,834 (2)\n59.31 %\nMichael Friedman (3)\nCommon Stock\n3,418,607\n16.16 %\nEdward Dovner\nCommon Stock\n12,548,834 (4)\n59.31 %\nMartin Herskowitz (5)\nCommon Stock\n1,987,500 (6)\n9.39 %\nKova Trading, LLC (7)\nCommon Stock\n3,180,000 (8)\n15.03 %\nBeverly and Leonard Mezei (9)\nCommon Stock\n9,407,432 (10)\n44.46 %\nRaymond Irni (11)\nCommon Stock\n1,101,686\n5.21 %\nMerle Griff, PhD\nCommon Stock\n-\n0.00 %\nLen Morales\nCommon Stock\n807,295\n3.82 %\nAll Officers and Directors as a Group\nCommon Stock\n15,967,441\n75.47 %\nCharles Everhardt (12)\nSeries B Convertible Preferred Stock\n100,542\n27.36 %\nEdward Dovner (13)\nSeries B Convertible Preferred Stock\n100,542\n27.36 %\nMartin Herskovitz (14)\nSeries B Convertible Preferred Stock\n15,875\n4.32 %\nKova Trading, LLC (15)\nSeries B Convertible Preferred Stock\n25,400\n6.91 %\nBeverly and Leonard Mezei (16)\nSeries B Convertible Preferred Stock\n75,141\n20.45 %\nVC Bin, LLC (17)\nSeries B Convertible Preferred Stock\n50,000\n13.61 %\nAll Officers and Directors as a Group\nSeries B Convertible Preferred Stock\n100,542\n27.36 %\n________\n(1)\nChairman of the Board of Directors.\n(2)\nIncludes (i) 2,460,012 shares of common stock held in the name of EF Trust, LLC, which is managed by Mr. Everhardts son, Maximillian Everhardt, with Mr. Everhardt having voting and dispositive power with respect to the shares held in the name of EF Trust, LLC; (ii) 10,054,200 shares of common stock issuable upon conversion of 100,542 shares of Series B Convertible Preferred Stock held in the name of EF Trust, LLC; and (iii) 114,244 shares of common stock held in the name of D&E Holdings 20, LLC, which is owned 50% by Mr. Everhardt, with Mr. Everhardt sharing voting and dispositive power for shares held in the name of entity.\n(3)\nPresident and Director. Held in the name of Red Halo, LLC. Mr. Friedman has voting and dispositive power with respect to the shares held in the name of Red Halo, LLC.\n(4)\nIncludes (i) 2,460,012 shares of common stock held in the name of Clear Financial Group, LLC, with Mr. Dovner having voting and dispositive power with respect to the shares held in the name of Clear Financial Group, LLC; (ii) 10,054,200 shares of common stock issuable upon conversion of 100,542 shares of Series B Convertible Preferred Stock held in the name of Clear Financial Group, LLC; and (iii) 114,244 shares of common stock held in the name of D&E Holdings 20, LLC, which is owned 50% by Mr. Dovner, with Mr. Dovner sharing voting and dispositive power for shares held in the name of entity.\n(5)\nHeld in the name of BH Madison, LLC. Mr. Herskowitz has voting and dispositive power with respect to the shares held in the name of BH Madison, LLC.\n(6)\nIncludes 400,000 shares of common stock and 1,587,500 shares of common stock issuable upon conversion of 15,875 shares of Series B Convertible Preferred Stock held in the name BH Madison, LLC.\n(7)\nUpon information and belief, Amy Friedman (no relationship with Michael Friedman, an officer and director of the Company), Miriam Abrahams and Andrew Mezei share voting and dispositive power with respect to the shares held in the name of Kova Trading, LLC.\n(8)\nIncludes 640,000 shares of common stock and 2,540,000 shares of common stock issuable upon conversion of 25,400 shares of Series B Convertible Preferred Stock held in the name of Kova Trading, LLC.\n(9)\nSpouses.\n(10)\nIncludes (i) 640,000 shares of common stock held in the name of Grosvenor Ventures, LLC, with Beverly Mezei having voting and dispositive power with respect to the shares held in the name of Grosvenor Ventures, LLC; (ii) 2,540,000 shares of common stock issuable upon conversion of 25,400 shares of Series B Convertible Preferred Stock held in the name of Grosvenor Ventures, LLC; (iii) 640,000 shares of common stock held in the name of Hutton Holdings, LLC, with Leonard Mezei having voting and dispositive power with respect to the shares held in the name of Hutton Holdings, LLC; (iv) 2,540,000 shares of common stock issuable upon conversion of 25,400 shares of Series B Convertible Preferred Stock held in the name of Hutton Holdings, LLC; (v) 613,332 shares of common stock held in the name of the 2010 Mezei GST Trust, with Beverly Mezei having voting and dispositive power with respect to the shares held in the name of the 2010 Mezei GST Trust; and (vi) 2,434,100 shares of common stock issuable upon conversion of 24,341 shares of Series B Convertible Preferred Stock held in the name of the 2010 Mezei GST Trust.\n(11)\nHeld in the name of Green Silver, LLC. Mr. Irni has voting and dispositive power with respect to the shares held in the name of Green Silver, LLC.\n(12)\nChairman of the Board of Directors. Held in the name of EF Trust, LLC, which is managed by Mr. Everhardts son, Maximillian Everhardt. Mr. Everhardt has voting and dispositive power with respect to the shares held in the name of EF Trust, LLC.\n(13)\nHeld in the name of Clear Financial Group, LLC. Mr. Dovner has voting and dispositive power with respect to the shares held in the name of Clear Financial Group, LLC.\n(14)\nHeld in the name of BH Madison, LLC. Mr. Herskowitz has voting and dispositive power with respect to the shares held in the name of BH Madison, LLC.\n(15)\nUpon information and belief, Amy Friedman (no relationship with Michael Friedman, an officer and director of the Company), Miriam Abrahams and Andrew Mezei have voting and dispositive power with respect to the shares held in the name of Kova Trading, LLC.\n(16)\nIncludes (i) 25,400 shares of Series B Convertible Preferred Stock held in the name of Grosvenor Ventures, LLC, with Beverly Mezei having voting and dispositive power with respect to the shares held in the name of Grosvenor Ventures, LLC; (ii) 25,400 shares of Series B Convertible Preferred Stock held in the name of Hutton Holdings, LLC, with Leonard Mezei having voting and dispositive power with respect to the shares held in the name of Hutton Holdings, LLC; and (iii) 24,341 shares of Series B Convertible Preferred Stock held in the name of the 2010 Mezei GST Trust, with Beverly Mezei having voting and dispositive power with respect to the shares held in the name of the 2010 Mezei GST Trust.\n(17)\nUpon information and belief, Diana Fletcher has voting and dispositive power with respect to the shares held in the name of VC Bin, LLC. Item 13. Certain Relationships and Related Transactions, and Director Independence\nDuring the fiscal years ended June 30, 2022 and 2021, there were no relationships or related party transactions requiring disclosure, except for the following:\nAs of June 30, 2022, the Company maintains its corporate address in at 2310 York Street, Suite 200, Blue Island, IL, 60406. This space is provided by the Companys Chairman, Charles Everhardt, a related party, on a rent free basis at the present time. The Company does not currently have a lease for this space at this time but expects to enter into a month-to-month office lease for this space.\nAs of March 31, 2022, a company founded and partially owned by the Companys Chairman, Charles Everhardt, has paid the Licensing Fees of $750,000 on behalf of the Company, which is include in accounts payable and accrued liabilities.\nOn May 5, 2022, the Company signed a note receivable of $179,124 from a company founded and partially owned by the Companys Chairman, Charles Everhardt.\nOn March 25, 2022, the Company signed a note receivable of $39,000 from a company founded and partially owned by the Companys Chairman, Charles Everhardt.\nOn September 28, 2021, the Company signed a note receivable of $50,000 from a company founded and partially owned by the Companys Chairman, Charles Everhardt.\nOn September 8, 2021 the Company signed a note receivable of $29,294 from a company founded and partially owned by the Companys Chairman, Charles Everhardt.\nOn April 21, 2021, the Company, through ten newly-formed, wholly-owned limited liability companies, entered into lease agreements with entities controlled by our Chairman, Charles Everhardt, for ten additional SarahCare locations to be operated by the Company. All of the leases are for a ten-year period beginning on July 1, 2021, and ending on June 30, 2031, with a 5-year renewal option. The rent for each location is $7,500 per month. As of the July, 2021, the Company has amended the leases to delay commencement until November 1, 2021. On August 19, 2022 the Company and landlord mutually agreed to terminate the Austin lease.\nOn March 25, 2021, the Company issued 2,476,212 shares of restricted common stock in exchange for $250,000 which were issued at $0.0503 per share and the Company issued 100,542 shares of Series A Preferred Stock in exchange for $508,834, which were issued at $5.06 per share, to an investor, the son of Charles Everhardt, the Companys Chairman. Additionally, Mr. Everhardt owns 50% of DE Holdings 20, LLC which converted $114,244 in convertible notes and accrued interest for 114,244 shares of restricted common shares, at a price of $1.00 per share. On that same day, Mr. Everhardt became Chairman of the Board of the Company.\nOn March 19, 2021, the Company issued 426,000 shares of restricted common stock to the Companys then CEO and Chairman, Michael J Friedman, for the conversion 42,600,000 shares of Series A Convertible Preferred Stock.\nOn March 19, 2021, the Company issued 48,000 shares of restricted common stock to Jay Odintz, a Member of the Companys Board of Directors, for the conversion 4,800,000 shares of Series A Convertible Preferred Stock.\nOn December 30, 2020, the Company issued 29,749,125,000 shares of restricted common stock for the conversion of notes payable in the amount of $1,427,958, to the Companys then CEO and Chairman, Michael J. Friedman. These shares were valued by the Company at $0.000048 per share\nOn December 30, 2020, the Company issued 4,518,062,500 shares of restricted common stock for the conversion of notes payable in the amount of $216,867, to a Board of Director Member, Jay Odintz. These shares were valued by the Company at $0.000048 per share.\nAs of June 30, 2020, the Company maintains a mailing address in New York, New York, but no longer maintains its offices in New York, New York. The rent was approximately $1,350 per month for the office during the year. The Company rents its office space from the father of the Companys former President and Chief Executive Officer, and current Interim President, CEO and CFO and current Director, Michael Friedman. The Company terminated this agreement on June 30, 2020.\nAs of June 30, 2020 and 2019, the total amount owed to related party, the father of the Companys former President and Chief Executive Officer, and current Interim President, CEO and CFO and current Director, Michael Friedman was $0 and $101,850, including $0 and $101,850, respectively, for accumulated rent.\nDirector Independence\nOur board of directors has undertaken a review of the independence of each director and considered whether any director has a material relationship with us that could compromise his ability to exercise independent judgment in carrying out his responsibilities. As a result of this review, our board of directors determined that our directors do not meet the independence requirements, according to the applicable rules and regulations of the SEC. Item 14. Principal Accounting Fees and Services.\nThe following table sets forth the fees billed by our principal independent accountants for the fiscal years ended June 30, 2022 and 2021, for the categories of services indicated.\nYears Ended June 30,\nCategory\nAudit Fees\n$ 30,000\n$ 20,000\nAudit Related Fees\n-\n-\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal\n$ 30,000\n$ 20,000\nOn August 12, 2021, the Company engaged Accell Audit & Compliance, PA as its independent registered public accounting firm for the year ended June 30, 2021.\nOn or about November 5, 2021, the Company engaged Accell Audit & Compliance, PA as its independent registered public accounting firm for the year ended June 30, 2022.\nAudit fees. Consists of fees billed for the audit of our annual financial statements and review of our interim financial information and services that are normally provided by the accountant in connection with year-end and quarter-end statutory and regulatory filings or engagements.\nAudit-related fees. Consists of fees billed for services relating to review of other regulatory filings including registration statements, periodic reports and audit related consulting.\nTax fees. Consists of professional services rendered by our principal accountant for tax compliance, tax advice and tax planning.\nOther fees. Other services provided by our accountants.\nPART IV. Item 15. Exhibits, Financial Statement Schedules\nSee the Exhibit Index following the signature page of this Registration Statement, which Exhibit Index is incorporated herein by reference.\nExhibit\nDescription\n3.1\nCertificate of Incorporation (New Jersey) (Incorporated by reference to the Companys Form 10SB filed with the SEC on June 29, 2005)\n3.2\nBylaws (Incorporated by reference to the Companys Form 10SB filed with the SEC on June 29, 2005)\n3.3\nCertificate of Amendment of Certificate of Incorporation (Incorporated by reference to the Companys Current Report on Form 8 K filed with the SEC on January 27, 2006)\n3.4\nCertificate of Incorporation (Delaware)\n3.5\nCertificate of Merger (redomiciling from New Jersey to Delaware)\n3.6\nCertificate of Amendment to Certificate of Incorporation\n3.7\nCertificate of Designation of Series A Convertible Preferred Stock\n10.1+\nStandard Office Lease by and between DeVille Developments, LLC, and Sarah Adult Day Services, Inc., dated June 2, 2017\n10.2+\nLease by and between Stow Professional Center, LLC, and Sarah Day Care Centers, Inc., dated September 4, 2014\n10.3+\nLease Agreement by and between S. Frank Prof. Bldg., LLC, and Sarah Day Care Centers, Inc., dated March 20, 2018\n10.4+\nStock Purchase Agreement by and among Innovative MedTech, Inc., Sarah Adult Day Services, Inc., Sarah Day Care Centers, Inc., The Sellers Named Herein, Dr. Merle Griff, as the Seller Representative, and Veteran Services LLC, dated as of March 25, 2021\n10.5\nShare Exchange Agreement, by and between Innovative MedTech, Inc., VC Bin, LLC, Webb Media, LLC, Melides Capital, LLC, Ronald Schreiber, and Dovner Holdings, LLC, dated April 26, 2022\n10.6\nExecutive Employment Agreement between Innovative MedTech, Inc. and Dr. Merle Griff, dated May 2, 2022\n10.7\nConsulting Agreement between Innovative MedTech, Inc. and Red Halo, LLC, dated May 2, 2022\n14.1\nCode of Ethics (Incorporated by reference to the Companys Form SB-2 filed with the SEC on May 12, 2006)\n31.1*\nCertification of the Chief Executive Officer pursuant to Rule 13a-14(a) or 15d-14(a) under the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of the Chief Financial Officer pursuant to Rule 13a-14(a) or 15d-14(a) under the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1*\nCertification of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2*\nCertification of the Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n________\n* Filed herewith\n+ Certain schedules and exhibits have been omitted pursuant to Item 601(b)(2) and/or Item 601(a)(5) of Regulation S-K. A copy of any omitted schedule or exhibit will be furnished supplementally to the Commission upon request; provided, however, that the Company may request confidential treatment pursuant to Rule 24b-2 of the Securities Exchange Act of 1934, as amended, for any schedule or exhibit so furnished.\nSIGNATURES\nPursuant to the requirements of the Securities Act of 1933, the registrant has duly caused this Registration Statement to be signed on its behalf by the undersigned, thereunto duly authorized.\nInnovative MedTech, Inc.\nBy:\n/s/ Michael Friedman\nMichael Friedman\nPresident & Interim CFO\nPursuant to the requirements of the Securities Act of 1933, this Registration Statement has been signed by the following persons in the capacities and on the dates indicated:\nName\nTitle\nDate\n/s/ Charles Everhardt\nChairman of the Board\nOctober __, 2022\nCharles Everhardt\n/s/ Michael Friedman\nDirector, President & Interim CFO\nOctober __, 2022\nMichael Friedman\n/s/ Dr. Merle Griff\nCEO\nOctober __, 2022\nDr. Merle Griff"
}