{
    "cik": "1337068",
    "company": "Magyar Bancorp, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-15",
    "period_of_report": "2023-09-30",
    "sic": "6035",
    "state_of_inc": null,
    "state_location": "NJ",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1337068/0001174947-23-001465-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1337068/000117494723001465/mgyr-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1337068/0001174947-23-001465.txt",
    "filename": "1337068_10K_2023_0001174947-23-001465.htm",
    "content": "ITEM 1. Business\nForward Looking Statements\nWe have included or incorporated by reference in this Annual Report on Form 10-K, and from time to time our management may make, statements that may constitute forward-looking statements within the meaning of the safe harbour provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements are not historical facts but instead represent only our beliefs regarding future events, many of which, by their nature, are inherently uncertain and outside our control. These statements include statements other than historical information or statements of current condition and may relate to our future plans and objectives and results, as well as statements about the objective and effectiveness of our risk management and liquidity policies, statements about trends in or growth opportunities for our business, statements about our future status, and activities or reporting under U.S. banking and financial regulation. Forward-looking statements generally are identified by the words believe, project, expect, anticipate, estimate, intend, strategy, future, opportunity, plan, may, should, will, would, will be, will continue, will likely result, and similar expressions. By identifying these statements for you in this manner, we are alerting you to the possibility that our actual results and financial condition may differ, possibly materially, from the anticipated results and financial condition indicated in these forward-looking statements. Important factors that could cause our actual results and financial condition to differ from those indicated in the forward-looking statements include, among others, those discussed below and under Risk Factors in Part 1, ITEM 1A. Risk Factors\nIn addition to factors discussed in the description of our business and elsewhere in this report, the following are factors that could adversely affect our future results of operations and financial condition.\nEconomic and Market Area\nAdverse developments affecting the financial services industry, such as actual events or concerns involving liquidity, defaults, or non-performance by financial institutions or transactional counterparties, could adversely affect our financial condition and results of operations.\nActual events involving limited liquidity, defaults, non-performance or other adverse developments that affect financial institutions, transactional counterparties or other companies in the financial services industry or the financial services industry generally, or concerns or rumors about any events of these kinds or other similar risks, have in the past and may in the future lead to market-wide liquidity problems. For example, on May 1, 2023, First Republic Bank went into receivership and its deposits and substantially all of its assets were acquired by JPMorgan Chase Bank, National Association. Similarly, on March 10, 2023, Silicon Valley Bank went into receivership, and on March 12, Signature Bank went into receivership.\nInflation can have an adverse impact on our business and on our customers.\nInflation and rapid increases in interest rates have led to a decline in the trading value of previously issued government securities with interest rates below current market interest rates. Although the Treasury, FDIC and Federal Reserve Board have announced a program to provide up to $25.0 billion of loans to financial institutions secured by certain of such government securities held by financial institutions to mitigate the risk of potential losses on the sale of such instruments, widespread demands for customer withdrawals or other liquidity needs of financial institutions for immediately liquidity may exceed the capacity of such program. There is no guarantee that the Treasury, FDIC and Federal Reserve Board will provide access to uninsured funds in the future in the event of the closure of other banks or financial institutions, or that they would do so in a timely fashion. In addition, inflation generally increases the cost of goods and services we use in our business operations, such as electricity and other utilities, which increases our noninterest expenses. Furthermore, our customers are also affected by inflation and the rising costs of goods and services used in their households and businesses, which could have a negative impact on their ability to repay their loans with us.\nThe Companys business, financial condition, results of operations and the trading price of its securities can be materially and adversely affected by many events and conditions including the following:\nrisks to the capital markets that may impact the performance of the investment securities portfolio of the Company, as well as limit our access to capital markets and other funding sources;\neffects on key employees, including operational management personnel and those charged with preparing, monitoring and evaluating the companies financial reporting and internal controls;\ndeclines in demand for loans and other banking services and products, as well as a decline in the credit quality of our loan portfolio in the markets served by the Company;\nif the economy is unable to substantially reopen or reopen in an efficient manner, and high levels of unemployment continue for an extended period of time, loan delinquencies, problem assets, and foreclosures may increase, resulting in increased charges and reduced income;\ncollateral for loans, especially real estate, may continue to decline in value, which could cause loan losses to increase;\nallowance for loan losses may increase if borrowers experience financial difficulties, which will adversely affect net income;\nthe net worth and liquidity of loan guarantors may decline, impairing their ability to honor commitments;\nas the result of the increase in the Federal Reserve Boards target federal funds rate, the cost on interest-bearing liabilities may greater than the yield on interest-earning assets, or reducing the net interest margin, spread and reducing net income;\ncyber security risks are increased as the result of an increase in the number of employees working remotely;\ndeclines in demand resulting from adverse impacts of the disease on businesses deemed to be non-essential by governments in the markets served by the Company; and\nincreasing or protracted volatility in the price of the Companys common stock.\nA Worsening of Economic Conditions Could Reduce Demand for Our Products and Services and/or Result in Increases in Our Level of Non-performing Loans, Which Could Have an Adverse Effect on Our Results of Operations.\nUnlike larger financial institutions that are more geographically diversified, our profitability depends primarily on the general economic conditions in New Jersey and the greater New York metropolitan area. Local economic conditions have a significant impact on our commercial real estate and construction and consumer loans, the ability of the borrowers to repay these loans and the value of the collateral securing these loans. Almost all of our loans are to borrowers located in or secured by collateral located in New Jersey and the New York metropolitan area.\nA deterioration in economic conditions could result in the following consequences, any of which could have a material adverse effect on our business, financial condition, liquidity and results of operations:\ndemand for our products and services may decline;\nloan delinquencies, problem assets and foreclosures may increase;\ncollateral for loans, especially real estate, may decline in value, in turn reducing customers future borrowing power, and reducing the value of assets and collateral associated with existing loans;\nthe value of our securities portfolio may decline; and\nthe net worth and liquidity of loan guarantors may decline, impairing their ability to honor commitments to us.\nMoreover, a significant decline in general economic conditions, caused by inflation, recession, acts of terrorism, an outbreak of hostilities or other international or domestic calamities, unemployment or other factors beyond our control could further impact these local economic conditions and could further negatively affect the financial results of our banking operations. In addition, deflationary pressures, while possibly lowering our operating costs, could have a significant negative effect on our borrowers, especially our business borrowers, and the values of underlying collateral securing loans, which could negatively affect our financial performance.\nStrong Competition Within Our Market Area May Limit Our Growth and Profitability.\nCompetition in the banking and financial services industry is intense. In our market area, we compete with commercial banks, savings institutions, mortgage brokerage firms, credit unions, finance companies, mutual funds, insurance companies, and brokerage and investment banking firms operating locally and elsewhere. Some of our competitors have substantially greater resources and lending limits than we, have greater name recognition and market presence that benefit them in attracting business, and offer certain services that we do not or cannot provide. In addition, larger competitors may be able to price loans and deposits more aggressively than we do. Our profitability depends upon our continued ability to\nsuccessfully compete in our market area. The greater resources and deposit and loan products offered by some of our competitors may limit our ability to increase our interest-earning assets. For additional information see Business of Magyar Bank-Competition.\nWe Are a Community Bank and Our Ability to Maintain Our Reputation is Critical to the Success of Our Business. The Failure to do so May Adversely Affect Our Performance.\nWe are a community bank and our reputation is one of the most valuable assets of our business. A key component of our business strategy is to rely on our reputation for customer service and knowledge of local markets to expand our presence by capturing new business opportunities from existing and prospective customers in our market area. As such, we strive to conduct our business in a manner that enhances our reputation. This is done, in part, by recruiting, hiring and retaining employees who share our core values of being an integral part of the communities we serve, delivering superior service to our customers and caring about our customers. If our reputation is negatively affected by the actions of our employees, by our inability to conduct our operations in a manner that is appealing to current or prospective customers or otherwise, our business and operating results may be materially adversely affected.\nOur small size may make it more difficult for us to compete.\nOur asset size may make it more difficult to compete with other financial institutions that are larger and can more easily afford to invest in the marketing and technologies needed to attract and retain customers. Accordingly, we are not always able to offer new products and services as quickly as our competitors. Lower earnings may also make it more difficult to offer competitive salaries and benefits. In addition, our smaller customer base may make it difficult to generate meaningful non-interest income from such activities as securities and insurance brokerage. Finally, as an institution smaller than many in our market area, we are disproportionately affected by the continually increasing costs of compliance with new banking and other regulations.\nInterest Rate and Asset Quality\nThe reversal of the historically low interest rate environment may adversely affect our net interest income and profitability.\nThe Federal Reserve Board increased benchmark interest rates significantly in response to control the inflation. In recent periods, market interest rates have risen in response to the Federal Reserve Boards recent rate increases. As discussed below, the increase in market interest rates could have an adverse effect on our net interest income and profitability.\nChanges in Interest Rates May Hurt Our Profits and Asset Values.\nOur earnings largely depend on our net interest income, which could be negatively affected by changes in interest rates. Net interest income is the difference between:\n● the interest income we earn on our interest-earning assets, such as loans and securities; and\n● the interest expense we pay on our interest-bearing liabilities, such as deposits and borrowings.\nThe rates we earn on our assets and the rates we pay on our liabilities are generally fixed for a contractual period of time. While we have taken steps to attempt to reduce our exposure to increases in interest rates, historically our liabilities generally have shorter contractual maturities than our assets. This imbalance can create significant earnings volatility, because market interest rates change over time. In a period of rising interest rates, the interest income earned on our assets may not increase as rapidly as the interest paid on our liabilities. Likewise, in a period of falling interest rates, the interest expense paid on our liabilities may not decrease as rapidly as the interest income received on our assets. See Managements Discussion and Analysis of Financial Condition and Results of Operations-Management of Market Risk.\nIn addition, changes in interest rates can affect the average life of loans and mortgage-backed securities. A reduction in interest rates causes increased prepayments of loans and mortgage-backed securities as borrowers tend to refinance their debt to reduce their borrowing costs. This creates reinvestment risk, which is the risk that we may not be able to reinvest the funds from faster prepayments at rates that are comparable to the rates we earned on the prepaid loans or securities. Additionally, increases in interest rates may decrease loan demand and/or make it more difficult for borrowers to repay adjustable-rate loans.\nChanges in interest rates also affect the current market value of our interest-earning securities portfolio. Generally, the value of securities moves inversely with changes in interest rates. At September 30, 2023, the fair value of our total securities portfolio was $83.9 million. The unrealized net loss on securities totaled $14.1 million on a pre-tax basis at September 30, 2023.\nWe evaluate interest rate sensitivity using models that estimate the change in Magyar Banks net interest income over a range of interest rate scenarios. At September 30, 2023, in the event of an immediate 200 basis point increase in interest rates, the model projects that we would experience a $391,000, or 1.3%, increase in net interest income in the first year following the change in interest rates, and a $1.8 million, or 5.3%, increase in net interest income in the second year following the change in interest rates. At September 30, 2023, in the event of an immediate 200 basis point decrease in interest rates, the model projects that we would experience a $661,000, or 2.1%, decrease in net interest income in the first year following the change in interest rates, and a $2.3 million, or 6.9%, decrease in net interest income in the second year following the change in interest rates.\nAt September 30, 2023, our available-for-sale securities portfolio at fair value totaled $10.1 million, which consisted entirely of mortgage-backed securities. To the extent interest rates increase and the value of our available-for-sale portfolio increases, our stockholders equity will be affected accordingly.\nBecause We Intend to Continue our Emphasis on the Origination of Commercial Business Loans and Commercial Real Estate Loans, Our Lending Risk Has Increased in Recent Years and May Increase in Future Years.\nAt September 30, 2023, our portfolio of commercial real estate and commercial business loans totaled $419.3 million, or 60.1% of our total loans, compared to $377.5 million, or 60.0% of our total loans at September 30, 2022 and $349.6 million, or 58.8% of our total loans at September 30, 2021. It is our intent to continue to emphasize the origination of commercial business and commercial real estate loans. Commercial business and commercial real estate loans generally have more risk than one-to four-family residential mortgage loans. At September 30, 2023, there was one non-performing commercial real estate loan totaling $2.2 million and no non-performing commercial business loans compared with no non-performing commercial real estate or commercial business loans at September 30, 2022.\nBecause the repayment of commercial business and commercial real estate loans depends on the successful management and operation of the borrowers properties or related businesses, repayment of these loans has been and may continue to be affected by adverse conditions in the real estate market or the local economy. Further, these loans typically have larger loan balances, and several of our borrowers have more than one commercial business and commercial real estate loan outstanding with us. Consequently, an adverse development with respect to one loan or one credit relationship can expose us to significantly greater risk of loss compared to an adverse development with respect to a one- to four-family residential mortgage loan. Finally, if we foreclose on a commercial business or commercial real estate loan, our holding period for the collateral, if any, typically is longer than for one-to four-family residential mortgage loans because there are fewer potential purchasers of the collateral. Because we plan to continue to emphasize the origination of these loans, it may be necessary to increase our allowance for loan losses because of the increased credit risk associated with these types of loans. Any increase to our allowance for loan losses would adversely affect our earnings.\nIf Our Allowance for Loan Losses is Not Sufficient to Cover Actual Loan Losses, Our Earnings Could Decrease.\nOur allowance for loan losses may not be sufficient to cover losses inherent in our loan portfolio, requiring additions to our allowance, which could materially decrease our net income. The allowance for loan losses decreased by $103,000 during the year ended September 30, 2023 to $8.3 million from $8.4 million for the year ended September 30, 2022. The allowance for loan losses as a percentage of non-performing loans decreased to 163.9% at September 30, 2023 compared with 297.5% at September 30, 2022. At September 30, 2023 our allowance for loan losses as a percentage of total loans was 1.19%, compared with 1.34% at September 30, 2022.\nFuture increases in the allowance for loan losses may be necessary based on possible future increases in total loans receivable, increases in non-performing loans and charge-offs, deterioration of collateral values securing impaired real estate loans, and deterioration of the current economic environment. We make various assumptions and judgments about the collectability of our loan portfolio, including the creditworthiness of our borrowers and the value of the real estate and other assets serving as collateral for the repayment of many of our loans. In determining the amount of the allowance for loan losses, we review our loans and our loss and delinquency experience, and we evaluate economic conditions. Based on this review, we believe our allowance for loan losses is adequate to absorb losses in our loan portfolio as of September 30, 2023.\nBank regulators periodically review our allowance for loan losses and may require us to increase our provision for loan losses or recognize further loan charge-offs. Any increase in our allowance for loan losses or loan charge-offs as required by these regulatory authorities will have a material adverse effect on our financial condition and results of operations.\nThe Financial Accounting Standards Board has adopted a new accounting standard that is referred to as Current Expected Credit Loss, or CECL. The implementation of CECL has been delayed for smaller reporting companies, such as the Company, until January 2023 (effective October 1, 2023 for the Company). CECL will require financial institutions to determine periodic estimates of lifetime expected credit losses on loans, and recognize the expected credit losses as allowances for loan losses. This will change the current method of providing allowances for loan losses that are probable, which may require us to increase our allowance for loan losses, and to greatly increase the types of data we will need to collect and review to determine the appropriate level of the allowance for loan losses. Any increase in our allowance for loan losses or expenses incurred to determine the appropriate level of the allowance for loan losses may have a material adverse effect on our financial condition and results of operations.\nWe are subject to environmental liability risk associated with lending activities or properties we own.\nA significant portion of our loan portfolio is secured by real estate, and we could become subject to environmental liabilities with respect to one or more of these properties, or with respect to properties that we own in operating our business. During the ordinary course of business, we may foreclose on and take title to properties securing defaulted loans. In doing so, there is a risk that hazardous or toxic substances could be found on these properties. If hazardous conditions or toxic substances are found on these properties, we may be liable for remediation costs, as well as for personal injury and property damage, civil fines and criminal penalties regardless of when the hazardous conditions or toxic substances first affected any particular property. Environmental laws may require us to incur substantial expenses to address unknown liabilities and may materially reduce the affected propertys value or limit our ability to use or sell the affected property. In addition, future laws or more stringent interpretations or enforcement policies with respect to existing laws may increase our exposure to environmental liability.\nRegulatory Matters\nWe Operate in a Highly Regulated Environment and May Be Adversely Affected by Changes in Laws and Regulations.\nMagyar Bank is subject to extensive regulation, supervision and examination by the NJDBI, its chartering authority, and by the Federal Deposit Insurance Corporation, which insures Magyar Banks deposits. As a bank holding company, Magyar Bancorp, Inc. is subject to regulation and supervision by the Federal Reserve Board. Such regulation and supervision govern the activities in which financial institutions and their holding companies may engage and are intended primarily for the protection of the federal deposit insurance fund and depositors. These regulatory authorities have extensive discretion in connection with their supervisory and enforcement activities, including the imposition of restrictions on the operations of financial institutions, the classification of assets by financial institutions and the adequacy of financial institutions allowance for loan losses. Any change in such regulation and oversight, whether in the form of regulatory policy, regulations, or legislation, could have a material impact on Magyar Bank and Magyar Bancorp, Inc.\nMagyar Banks operations are also subject to extensive regulation by other federal, state and local governmental authorities, and are subject to various laws and judicial and administrative decisions that impose requirements and restrictions on operations. These laws, rules and regulations are frequently changed by legislative and regulatory authorities. There can be no assurance that changes to existing laws, rules and regulations, or any other new laws, rules or regulations, will not be adopted in the future, which could make compliance more difficult or expensive or otherwise adversely affect our business, financial condition or prospects.\nNon-compliance with the USA PATRIOT Act, Bank Secrecy Act, or Other Laws and Regulations Could Result in Fines or Sanctions.\nThe USA PATRIOT and Bank Secrecy Acts require financial institutions to develop programs to prevent financial institutions from being used for money laundering and terrorist activities. If such activities are detected, financial institutions are obligated to file suspicious activity reports with the U.S. Treasurys Office of Financial Crimes Enforcement Network. These rules require financial institutions to establish procedures for identifying and verifying the identity of customers seeking to open new financial accounts. Failure to comply with these regulations could result in fines or sanctions, including restrictions on conducting acquisitions or establishing new branches. During the last year, several banking institutions have received large fines for non-compliance with these laws and regulations. While we have developed policies and procedures\ndesigned to assist in compliance with these laws and regulations, these policies and procedures may not be effective in preventing violations of these laws and regulations.\nThe Federal Reserve Board may require us to commit capital resources to support Magyar Bank.\nFederal law requires that a holding company act as a source of financial and managerial strength to its subsidiary bank and to commit resources to support such subsidiary bank. Under the source of strength doctrine, the Federal Reserve Board may require a holding company to make capital injections into a troubled subsidiary bank and may charge the holding company with engaging in unsafe and unsound practices for failure to commit resources to a subsidiary bank. A capital injection may be required at times when the holding company may not have the resources to provide it and therefore may be required to borrow the funds or raise capital. Any loans by a holding company to its subsidiary bank are subordinate in right of payment to deposits and to certain other indebtedness of such subsidiary bank. In the event of a holding companys bankruptcy, the bankruptcy trustee will assume any commitment by the holding company to a federal bank regulatory agency to maintain the capital of a subsidiary bank. Thus, any borrowing that must be done by Magyar Bancorp to make a required capital injection becomes more difficult and expensive and could have an adverse effect on our business, financial condition and results of operations.\nSecurity\nSystem Failure or Breaches of Our Network Security Could Subject Us to Increased Operating Costs as well as Litigation and Other Liabilities.\nThe computer systems and network infrastructure we and our third-party service providers use could be vulnerable to unforeseen problems. Our operations are dependent upon our ability to protect our computer equipment against damage from physical theft, fire, power loss, telecommunications failure or a similar catastrophic event, as well as from security breaches, denial of service attacks, viruses, worms and other disruptive problems caused by hackers. Any damage or failure that causes an interruption in our operations could have a material adverse effect on our financial condition and results of operations. Computer break-ins, phishing and other disruptions could also jeopardize the security of information stored in and transmitted through our computer systems and network infrastructure, which may result in significant liability to us and may cause existing and potential customers to refrain from doing business with us. Although we, with the help of third-party service providers, intend to continue to implement security technology and establish operational procedures designed to prevent such damage, our security measures may not be successful. In addition, advances in computer capabilities, new discoveries in the field of cryptography or other developments could result in a compromise or breach of the algorithms we and our third-party service providers use to encrypt and protect customer transaction data. A failure of such security measures could have a material adverse effect on our financial condition and results of operations.\nIt is possible that a significant amount of time and money may be spent to rectify the harm caused by a breach or hack. While we have general liability insurance, there are limitations on coverage as well as dollar amount. Furthermore, cyber incidents carry a greater risk of injury to our reputation. Finally, depending on the type of incident, banking regulators can impose restrictions on our business and consumer laws may require reimbursement of customer loss.\nRisks Associated with Cyber-Security Could Negatively Affect Our Earnings.\nThe financial services industry has experienced an increase in both the number and severity of reported cyber-attacks aimed at gaining unauthorized access to bank systems as a way to misappropriate assets and sensitive information, corrupt and destroy data, or cause operational disruptions. We have established policies and procedures to prevent or limit the impact of security breaches, but such events may still occur or may not be adequately addressed if they do occur. Although we rely on security safeguards to secure our data, these safeguards may not fully protect our systems from compromises or breaches.\nWe also rely on the integrity and security of a variety of third party processors, payment, clearing and settlement systems, as well as the various participants involved in these systems, many of which have no direct relationship with us. Failure by these participants or their systems to protect our customers' transaction data may put us at risk for possible losses due to fraud or operational disruption.\nOur customers are also the target of cyber-attacks and identity theft. Large scale identity theft could result in customers' accounts being compromised and fraudulent activities being performed in their name. We have implemented certain safeguards against these types of activities but they may not fully protect us from fraudulent financial losses.\nThe occurrence of a breach of security involving our customers' information, regardless of its origin, could damage our reputation and result in a loss of customers and business and subject us to additional regulatory scrutiny, and could expose us to litigation and possible financial liability. Any of these events could have a material adverse effect on our financial condition and results of operations.\nOther Risks Associated with Our Business\nOur Certificate of Incorporation Provides That, Subject to Limited Exception, a State or Federal Court in the State of Delaware is the Sole and Exclusive Forum for Certain Stockholder Litigation Matters, Which Could Limit Our Stockholders Ability to Obtain a Favorable Judicial Forum for Disputes With Us or Our Directors, Officers, and Other Employees .\nThe Companys certificate of incorporation provides that, unless the Company consents in writing to the selection of an alternative forum, the sole and exclusive forum for (i) any derivative action or proceeding brought on behalf of the Company, (ii) any action asserting a claim of breach of a fiduciary duty owed by any director, officer or other employee of the Company to the Company or the Companys stockholders, (iii) any action asserting a claim arising pursuant to any provision of the Delaware General Corporation Law, or (iv) any action asserting a claim governed by the internal affairs doctrine will be conducted in a state or federal court in the State of Delaware, in all cases subject to the courts having personal jurisdiction over the indispensable parties named as defendants. This exclusive forum provision does not apply to claims arising under the federal securities laws. This exclusive forum provision may limit a stockholders ability to bring a claim in a judicial forum it finds favorable for disputes with the Company and its directors, officers, and other employees or may cause a stockholder to incur additional expense by having to bring a claim in a judicial forum that is distant from where the stockholder resides, or both. In addition, if a court were to find this exclusive forum provision to be inapplicable or unenforceable in a particular action, we may incur additional costs associated with resolving the action in another jurisdiction, which could have a material adverse effect on our financial condition and results of operations.\nOur Funding Sources may Prove Insufficient to Replace Deposits at Maturity and Support Our Future Growth. A Lack of Liquidity Could Adversely Affect Our Financial Condition and Results of Operations and Result In Regulatory Limits Being Placed on Us.\nWe must maintain sufficient funds to respond to the needs of depositors and borrowers. As a part of our liquidity management, we use a number of funding sources in addition to core deposit growth and repayments and maturities of loans and investments. These sources may include Federal Home Loan Bank advances, federal funds purchased and brokered certificates of deposit. While we emphasize the generation of low-cost core deposits as a source of funding, there is strong competition for such deposits in our market area. Additionally, deposit balances can decrease if customers perceive alternative investments as providing a better risk/return tradeoff. Adverse operating results or changes in industry conditions could lead to difficulty or an inability to access these additional funding sources. Our financial flexibility will be severely constrained if we are unable to maintain our access to funding or if adequate financing is not available to accommodate future growth at acceptable interest rates.\nFurther, if we are required to rely more heavily on more expensive funding sources to support liquidity and future growth, our revenues may not increase proportionately to cover our increased costs. In this case, our operating margins and profitability would be adversely affected. Alternatively, we may need to sell a portion of our investment and/or loan portfolio to raise funds, which, depending upon market conditions, could result in us realizing a loss on the sale of such assets.\nA lack of liquidity could also attract increased regulatory scrutiny and potential restraints imposed on us by regulators. Depending on the capitalization status and regulatory treatment of depository institutions, including whether an institution is subject to a supervisory prompt corrective action directive, certain additional regulatory restrictions and prohibitions may apply, including restrictions on growth, restrictions on interest rates paid on deposits, restrictions or prohibitions on payment of dividends and restrictions on the acceptance of brokered deposits.\nWe rely on municipal deposits as a source of funds for our lending and investment activities. If we are unable to retain, or are forced to pay a higher rate on, these deposits, our net income and liquidity could be adversely affected. Municipal deposits are price sensitive and could result in an increase in interest expense or funding fluctuations. At September 30, 2023, $246.4 million, or 32.6% of our total deposits, consisted of municipal deposits from local government entities. Several of our municipal deposits have high average balances. Given our dependence on high-average balance municipal funds deposits as a source of funds, our inability to retain such funds could significantly and adversely affect our liquidity. If we are forced to pay higher rates on our municipal accounts to retain those funds, or if we are unable to retain such funds and we are forced to resort to other sources of funds for our lending and investment activities, the interest expense associated with these other\nfunding sources may be higher than the rates we are currently paying on our municipal deposits, which would adversely affect our net income. ITEM 1B. Unresolved Staff Comments\nNot required for smaller reporting companies. ITEM 2. Properties\nThe following table provides certain information with respect to our offices as of September 30, 2023:\nLeased or Original Year Year of\nLocation Owned Leased or Acquired Lease Expiration\nMain Office:\n400 Somerset Street Owned -\nNew Brunswick, New Jersey, 08901\nFull - Service Branches:\n3050 State Route 27 Owned -\nKendall Park, New Jersey, 08824\n596 Milltown Road Leased\nNorth Brunswick, New Jersey, 08902\n1000 Route 202 South Leased\nBranchburg, New Jersey, 08876\n475 North Bridge Street Leased\nBridgewater, New Jersey, 08807\n1167 Inman Avenue Leased\nEdison, New Jersey, 08820\n1199 Amboy Avenue Leased\nEdison, New Jersey, 08837\nThe net book value of our premises, land and equipment was approximately $13.3 million and $13.9 million at September 30, 2023 and 2022, respectively.\nFor information regarding Magyar Bancorp, Inc.s investment in mortgages and mortgage-related securities, see Item 1. Business herein. ITEM 3. Legal Proceedings\nIn the ordinary course of business, we are a party to various legal actions which are incidental to the operation of our business. Although the ultimate outcome and amount of liability, if any, with respect to these legal actions cannot presently be ascertained with certainty, in the opinion of management, based upon information currently available to us, any resulting liability as of September 30, 2023 is believed to be immaterial to our consolidated financial position, results of operations and cash flows. ITEM 4. Mine Safety Disclosures\nNot applicable.\nPART II ITEM 5. Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities\n(a) Our shares of common stock are traded on the NASDAQ Stock Market LLC under the symbol MGYR. The approximate number of holders of record of Magyar Bancorp, Inc.s common stock as of September 30, 2023 was 591. Certain shares of Magyar Bancorp, Inc. are held in nominee or street name and accordingly, the number of beneficial owners of such shares is not known or included in the foregoing number.\nThe Company declared five dividends totaling $0.20 per share paid to common shareholders during the year ended September 30, 2023. In the future, the Company intends to continue to pay a regular cash dividend. In determining whether and in what amount to pay a cash dividend, the Board will continue to take into account a number of factors, including capital requirements, our consolidated financial condition and results of operations, tax considerations, statutory and regulatory limitations and general economic conditions. No assurances can be given that cash dividends will continue to be paid or that, if paid, will not be reduced. For more information on regulatory restrictions regarding the payment of dividends, see Item 1 - Business- Supervision and Regulation- New Jersey Banking Regulation-Dividends.\nOther than its employee stock ownership plan, Magyar Bancorp, Inc. does not have any equity compensation plans that were not approved by stockholders. The following table sets forth information with respect to the Magyar Bancorps equity compensation plans.\nNumber of securities to\nNumber of\nbe issued upon exercise Weighted securities remaining\nof outstanding options average exercise available for\nSeptember 30, 2023 and rights price* issuance under plan\nStock options 293,200 $ 12.58 97,800\nShares of restricted stock 124,320 - -\nTotal 417,520 $ 12.58 97,800\n* Reflects exercise price of stock options only.\n(b) Not applicable.\n(c) Share repurchases.\nOn December 8, 2022, the Company announced the completion of its third stock repurchase program, under which 354,891 shares had been repurchased at an average price of $12.90. The Company announced its fourth authorization of an additional stock repurchase plan pursuant to which the Company intends to repurchase up to an additional 5% of its outstanding shares, or up to 337,146 shares, under which 100,830 shares had been repurchased at an average price of $11.80 at September 30, 2023. Under this stock repurchase program, 236,316 shares of the 337,146 shares authorized remained available for repurchase as of September 30, 2023. The Companys intended use of the repurchased shares is for general corporate purposes. The Company held treasury stock shares totaling 423,641 at September 30, 2023. The timing of the repurchases will depend on certain factors, including but not limited to, market conditions and prices, the Companys liquidity requirements and alternative uses of capital.\nThe following table reports information regarding repurchases of our common stock during the quarter ended September 30, 2023.\nWeighted Remaining Number\nTotal Number Average of Shares That\nof Shares Price Paid May be Purchased\nPeriods Purchased Per Share Under the Plan\nJuly 1, 2023 through July 31, 2023 7,160 $ 11.99 254,624\nAugust 1, 2023 through August 31, 2023 11,121 $ 12.15 243,503\nSeptember 1, 2023 through September 30, 2023 7,187 $ 11.48 236,316 ITEM 6. [Reserved] ITEM 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nMagyar Bancorp, Inc. (the Company) is a Delaware-chartered stock holding company whose most significant business activity is ownership of 100% of the common stock of Magyar Bank. Magyar Banks principal business is attracting retail deposits from the general public and investing those deposits, together with funds generated from operations, principal repayments on loans and securities and borrowed funds, into one-to four-family residential mortgage loans, multi-family and commercial real estate mortgage loans, home equity loans and lines of credit, commercial business loans and construction loans. Our results of operations depend primarily on our net interest income which is the difference between the interest we earn on our interest-earning assets and the interest we pay on our interest-bearing liabilities. Our net interest income is primarily affected by the market interest rate environment, the shape of the U.S. Treasury yield curve, the timing of the placement of interest-earning assets and interest-bearing liabilities, and the prepayment rate on our mortgage-related assets. Other factors that may affect our results of operations are general and local economic and competitive conditions, government policies and actions of regulatory authorities.\nDuring the year ended September 30, 2023, the Companys total assets grew $108.7 million, or 13.6%, to $907.3 million compared with $798.5 million at September 30, 2022. The increase was attributable to a $69.2 million increase in net loans receivable and a $41.3 million increase in interest-earning deposits with banks, offset by a $4.9 million decrease in investment securities.\nTotal deposits increased $87.7 million, or 13.1%, to $755.5 million and stockholders equity increased $6.3 million, or 6.4%, to $104.8 million during the year ended September 30, 2023\nThe Companys net income decreased $210,000, or 2.7%, to $7.7 million during the year ended September 30, 2023 compared with net income of $7.9 million for the year ended September 30, 2022.\nThroughout fiscal 2024, we expect to continue increasing our commercial real estate and commercial business loans while managing non-interest expenses in an effort to increase profitability of the Company.\nCritical Accounting Policies\nCritical accounting policies are defined as those that are reflective of significant judgments and uncertainties, and could potentially result in materially different results under different assumptions and conditions. Critical accounting policies may involve complex subjective decisions or assessments. We consider the following to be our critical accounting policies.\nAllowance for Loan Loss. The allowance for loan losses is the amount estimated by management as necessary to cover credit losses in the loan portfolio both probable and reasonably estimable at the balance sheet date. The allowance is established through the provision for loan losses which is charged against income. In determining the allowance for loan losses, management makes significant estimates and has identified this policy as one of our most critical. Due to the high degree of judgment involved, the subjectivity of the assumptions utilized and the potential for changes in the economic environment that could result in changes to the amount of the recorded allowance for loan losses, the methodology for determining the allowance for loan losses is considered a critical accounting policy by management.\nAs a substantial amount of our loan portfolio is collateralized by real estate, appraisals of the underlying value of property securing loans and discounted cash flow valuations of properties are critical in determining the amount of the\nallowance required for specific loans. Assumptions for appraisals and discounted cash flow valuations are instrumental in determining the value of properties. Overly optimistic assumptions or negative changes to assumptions could significantly affect the valuation of a property securing a loan and the related allowance determined. The assumptions supporting such appraisals and discounted cash flow valuations are carefully reviewed by management to determine that the resulting values reasonably reflect amounts realizable on the related loans.\nManagement performs a quarterly evaluation of the adequacy of the allowance for loan losses. We consider a variety of factors in establishing this estimate including, but not limited to, current economic conditions, delinquency statistics, geographic and industry concentrations, the adequacy of the underlying collateral, the financial strength of the borrower, results of internal loan reviews and other relevant factors. This evaluation is inherently subjective as it requires material estimates by management that may be susceptible to significant change based on changes in economic and real estate market conditions.\nThe evaluation has a specific and general component. The specific component relates to loans that are delinquent or otherwise identified as impaired through the application of our loan review process and our loan grading system. All such loans are evaluated individually, with principal consideration given to the value of the collateral securing the loan and discounted cash flows. Specific impairment allowances are established as required by this analysis. However, the Banks Federal and State regulators generally require that the specific reserve against impaired collateral-dependent loans be charged-off, reducing the carrying balance of the loan and allowance for loan loss. The general component is determined by segregating the remaining loans by type of loan, risk weighting (if applicable) and payment history. We analyze historical loss experience, delinquency trends, general economic conditions and geographic and industry concentrations in establishing the general portion of the reserve. This analysis establishes factors that are applied to the loan groups to determine the amount of the general component of the allowance for loan losses.\nActual loan losses may be significantly greater than the allowances we have established, which could have a material negative effect on our financial results.\nThe Company will adopt Accounting Standards Update (ASU) 2016-13, Financial Instruments - Credit Losses: Measurement of Credit Losses on Financial Instruments on October 1, 2023, using a modified retrospective approach. The Companys implementation process includes scoping, segmentation and the design of a methodology appropriate for each respective financial instrument. The process also includes the development of loss forecasting models as well as the incorporation of qualitative adjustments. Evaluation of technical accounting topics, updates to our allowance policy documentation, model validation, governance and reporting, processes and related internal controls, as well as overall operational readiness has been completed throughout September 30, 2023 in preparation for adoption.\nBased on analyses performed during the quarter ending September 30, 2023, as well as an implementation analysis utilizing exposures and forecasts of economic conditions as of September 30, 2023, the Company recorded a reduction to its allowance for credit losses on October 1, 2023 in the amount of $492,000. The reduction was comprised of a reduction in the allowance for on-balance sheet exposures, which includes held to maturity debt securities, totaling $1.0 million and an increase in the allowance for off-balance sheet exposures, which includes unfunded commitments, totaling $540,000. The impact will be reflected as a cumulative effect adjustment, net of taxes. The change in the allowance for credit losses upon adoption will not have a material effect on the Companys capital and regulatory capital amounts and ratios.\nDeferred Income Taxes. The Company records income taxes using the asset and liability method. Accordingly, deferred tax assets and liabilities: (i) are recognized for the expected future tax consequences of events that have been recognized in the financial statements or tax returns; (ii) are attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases; and (iii) are measured using enacted tax rates expected to apply in the years when those temporary differences are expected to be recovered or settled.\nDeferred tax assets are likely to be realized and therefore do not have a valuation allowance.\nComparison of Financial Condition at September 30, 2023 and September 30, 2022\nTotal Assets. Total assets increased $108.7 million, or 13.6%, to $907.3 million during the year ended September 30, 2023 compared with $798.5 million at September 30, 2022. The change was attributable to a $69.2 million, or 11.2%. increase in loans receivable, net of allowance for loan loss, to $689.1 million and a $41.3 million, or 147.1%, increase in\ninterest-earning deposits with banks to $69.4 million, partially offset by a $4.9 million, or 4.9%, decrease in investment securities to $96.0 million.\nLoans Receivable. Total loans receivable increased $69.3 million, or 11.0%, to $698.2 million at September 30, 2023 from $628.9 million at September 30, 2022. Growth occurred in commercial real estate loans, which increased $46.3 million, or 13.5%, to $389.1 million, in one-to four-family residential mortgage loans (including home equity lines of credit), which increased $21.6 million, or 9.3%, to $254.7 million, and in construction loans, which increased $6.6 million, or 43.5%, to $21.9 million. Offsetting these increases were decreases in commercial business loans, which decreased $4.5 million, or 12.9%, to $30.2 million and in other consumer loans, which decreased $771,000, or 24.6%, to $2.3 million.\nTotal loans receivable at September 30, 2023 were comprised of $389.1 million (55.8%) in commercial real estate loans, $237.7 million (34.1%) in one- to four- family residential mortgage loans, $30.2 million (4.3%) in commercial business loans, $21.9 million (3.1%) in construction loans, and $19.3 million (2.8%) in home equity lines of credit and other loans. For comparison, total loans receivable at September 30, 2022 were comprised of $342.8 million (54.5%) in commercial real estate loans, $214.4 million (34.1%) in one- to four- family residential mortgage loans, $34.7 million (5.5%) in commercial business loans, $15.2 million (2.4%) in construction loans, and $21.8 million (3.5%) in home equity lines of credit and other loans.\nTotal non-performing loans increased $2.2 million, or 79.3%, to $5.1 million at September 30, 2023 from $2.8 million at September 30, 2022. The ratio of non-performing loans to total loans was 0.7% at September 30, 2023 compared to 0.5% at September 30, 2022.\nThere were two non-performing one-to four-family residential loans totaling $386,000, at September 30, 2023 compared with none at September 30, 2022. The weighted average loan-to-value of these properties was 35% based on updated appraisals of the real estate securing the loans. During the year ended September 30, 2023, there were no charge-offs against the allowance for loan loss for one-to four-family residential real estate loans while $4,000 was recovered from prior year charge-offs.\nThere was one non-performing commercial real estate loan totaling $2.2 million at September 30, 2023, compared with none at September 30, 2022. The loan-to-value of this property was 82% based on an updated appraisal of the real estate securing the loan. Magyar Bank had begun foreclosure proceedings on the property securing this loan and pursuing judgments against the guarantors of the loan at September 30, 2023. During the year ended September 30, 2023 there were no charge-offs against the allowance for loan loss or recoveries for commercial real estate loans.\nThere were no non-performing commercial business loans at September 30, 2023 or 2022. During the year ended September 30, 2023 there were two charge-offs totaling $488,000 against the allowance for loan loss for commercial business loans and no recoveries from prior year charge-offs.\nThere were two non-performing construction loans totaling $2.5 million at September 30, 2023 compared with $2.8 million at September 30, 2022. The weighted average loan-to-value of these properties was 54% based on updated appraisals of the real estate securing the loans. Magyar Bank had begun foreclosure proceedings on the properties securing these loans and pursuing judgments against the guarantors of the loans at September 30, 2023. During the year ended September 30, 2023, there were no charge-offs against the allowance for loan loss or recoveries for construction loans.\nThe ratio of non-performing loans to total loans receivable increased to 0.73% at September 30, 2023 from 0.45% at September 30, 2022. The allowance for loan losses decreased $103,000 to $8.3 million, or 163.9% of non-performing loans at September 30, 2023 compared with $8.4 million, or 297.5% of non-performing loans at September 30, 2022. Provisions for loan loss during the year ended September 30, 2023 were $381,000 while net charge-offs were $484,000, compared with a provision of $304,000 and a net recovery of $54,000 for the prior year. The allowance for loan losses was 1.19% and 1.34% of gross loans outstanding at September 30, 2023 and 2022, respectively. The allowance for loan loss decreased in amount and as a percentage of gross loans during the year from higher balances of lower risk loans and lower balances of higher risk loans in addition to lower adjustments to the historical loss for all loan categories for improving economic conditions.\nInvestment Securities. Investment securities decreased $4.9 million, or 4.9%, to $96.0 million at September 30, 2023 from $100.9 million at September 30, 2022. Investment securities at September 30, 2023 consisted of $65.8 million in mortgage-backed securities issued by U.S. government agencies and U.S. government-sponsored enterprises, $23.5 million in U.S. government-sponsored enterprise debt securities, $3.0 million in corporate notes, $3.5 million in municipal bonds and\n$207,000 in private-label mortgage-backed securities. There were no other-than-temporary-impairment charges for the Companys investment securities for the year ended September 30, 2023.\nSecurities available-for-sale increased $896,000, or 9.7%, to $10.1 million at September 30, 2023 from $9.2 million at September 30, 2022. The increase was attributable to purchases totaling $2.0 million, partially offset by principal repayments totaling $970,000, premium amortization of $51,000 and unrealized losses of $47,000.\nSecurities held-to-maturity decreased $5.8 million, or 6.3%, to $85.8 million at September 30, 2023 from $91.6 million at September 30, 2022. The decrease was the attributable to principal repayments and maturities totaling $10.3 million and premium amortization of $85,000, partially offset by purchases totaling $4.6 million.\nBank-Owned Life Insurance. The cash surrender value of life insurance held for directors and officers of Magyar Bank increased $370,000, or 2.7%, to $18.0 million at September 30, 2023 from $17.7 million at September 30, 2022. The change was due to an increase in the cash surrender value of the policies. The Company did not purchase any new life insurance policies during the year ended September 30, 2023.\nOther Real Estate Owned. OREO increased $47,000, or 16.7%, to $328,000 at September 30, 2023 from $281,000 at September 30, 2022. The change was due to the capital improvements to the one OREO property held by the Bank, which was under contract for sale at September 30, 2023.\nDeposits. Deposits, which include noninterest-bearing demand deposits, interest-bearing demand deposits, money market deposits, savings deposits and time deposits, are the primary source of the Companys funds. The Company offers a variety of products designed to attract and retain customers, with primary focus on building and expanding relationships. The Company continues to focus on establishing relationships with businesses, seeking deposits as well as lending relationships.\nTotal deposits increased $87.7 million, or 13.1%, to $755.5 million at September 30, 2023 from $667.7 million at September 30, 2022. The increase in deposits during the year ended September 30, 2023 occurred in money market account balances, which increased $62.7 million, or 28.2%, to $284.9 million, in certificates of deposit (including individual retirement accounts) which increased $22.1 million, or 26.7%, to $104.7 million, in interest-bearing checking account balances, which increased $16.5 million, or 16.8% to $115.2 million, and in non-interest checking account balances, which increased $6.1 million, or 3.4%, to $188.5 million. Offsetting these increases was a decline in savings account balances, which decreased $19.7 million, or 24.1%, to $62.2 million. Included in the Companys total deposits were $13.8 million in brokered certificates of deposits.\nThe Company held $246.4 million in municipal depositor deposits at September 30, 2023, which represents 32.6% of total deposits. Under State of New Jersey legislation, municipal deposits exceeding 70% of the Banks capital must be collateralized. Magyar Bank was in compliance with the States requirements at September 30, 2023.\nThe FDIC provides $250,000 of deposit insurance per depositor for each account ownership category. Depositors may qualify for coverage over $250,000 if they have funds in different ownership categories and all FDIC requirements are met. Included in the Companys total deposits at September 30, 2023 was an estimated $109.3 million that was not collateralized and exceeded the FDICs insurance coverage limit.\nThe Companys deposit strategy in 2023 focused on growing its non-interest checking account balances and managing the overall cost of its interest-bearing liabilities during a period of rapidly rising market interest rates.\nBorrowed Funds. Borrowings increased $13.9 million, or 88.9%, to $29.5 million at September 30, 2023 compared with $15.6 million at September 30, 2022. The Company borrowed several long-term advances from the FHLBNY during the year ended September 30, 2023 to fund its loan originations.\nStockholders Equity. Stockholders equity increased $6.3 million, or 6.4%, to $104.8 million at September 30, 2023 from $98.5 million at September 30, 2022. The increase was attributable to the Companys net income from operations totaling $7.7 million, partially offset by $1.3 million in dividends paid to shareholders and $1.2 million in treasury share repurchases. The Companys book value per share increased to $15.70, based on total equity of $104.8 million and 6,674,184 shares outstanding at September 30, 2023 from $14.60, based on total equity of $98.5 million and 6,745,128 shares outstanding.at September 30, 2022.\nComparison of Operating Results for the Years Ended September 30, 2023 and 2022\nNet Income. The Companys net income decreased $210,000, or 2.7%, to $7.7 million during the year ended September 30, 2023 compared with $7.9 million for the year ended September 30, 2022 due to higher non-interest expenses, partially offset by higher net interest and dividend income.\nNet Interest and Dividend Income. The primary source of the Companys operating income is net interest and dividend income, which is the difference between interest and dividends earned on earning assets and fees earned on loans, and interest paid on interest-bearing liabilities. The Companys net interest and dividend income is affected by regulatory, economic and competitive factors that influence interest rates, loan demand, deposit flows and levels of nonperforming assets.\nDuring the year ended September 30, 2023, net interest and dividend income increased $715,000, or 2.6%, to $27.7 million compared to $27.0 million for the year ended September 30, 2022. Interest and dividend income increased $8.6 million, or 29.0%, to $38.1 million at September 30, 2023 from $29.5 million at September 30, 2022, while interest expense increased $7.6 million, or 316.0%, to $10.3 million at September 30, 2023 from $2.5 million at September 30, 2022. The Companys net interest margin decreased 11 basis points to 3.50% for the year ended September 30, 2023 from 3.61% for the year ended September 30, 2022.\nAverage Balance Sheet. The following table presents certain information regarding our financial condition and net interest income for the years ended September 30, 2023 and 2022. The table presents the average yield on interest-earning assets and the average cost of interest-bearing liabilities. We derived the yields and costs by dividing income or expense by the average balance of interest-earning assets and interest-bearing liabilities, respectively, for the periods shown. We derived average balances from daily balances over the periods indicated. Interest income includes fees that we consider adjustments to yields. Interest income on loans includes loan fees, but such amounts were not material for the years ended September 30, 2023 or 2022.\nYear Ended September 30,\nAverage\nBalance Interest\nIncome/\nExpense Yield/Cost\n(Annualized) Average\nBalance Interest\nIncome/\nExpense Yield/Cost\n(Annualized)\n(Dollars In Thousands)\nInterest-earning assets:\nInterest-earning deposits $ 22,616 $ 1,040 4.60% $ 53,714 $ 264 0.49%\nLoans receivable, net (1) 668,870 35,229 5.27% 600,630 27,841 4.64%\nSecurities\nTaxable 94,519 1,602 1.69% 89,001 1,279 1.44%\nTax-exempt (2) 3,370 2.17% 2,769 1.89%\nFHLBNY stock 2,020 6.89% 1,547 5.02%\nTotal interest-earning assets 791,395 38,083 4.81% 747,661 29,514 3.95%\nNoninterest-earning assets 48,514\n45,960\nTotal assets $ 839,909\n$ 793,621\nInterest-bearing liabilities:\nSavings accounts (3) $ 71,148 $ 342 0.48% $ 85,834 $ 156 0.18%\nNOW accounts (4) 340,126 7,332 2.16% 288,222 1,007 0.35%\nTime deposits (5) 90,385 1,814 2.01% 96,442 0.94%\nTotal interest-bearing deposits 501,659 9,488 1.89% 470,498 2,070 0.44%\nBorrowings 25,604 3.31% 18,399 2.25%\nTotal interest-bearing liabilities 527,263 10,334 1.96% 488,897 2,484 0.51%\nNoninterest-bearing liabilities 207,255\n200,702\nTotal liabilities 734,518\n689,599\nRetained earnings 105,391\n104,022\nTotal liabilities and retained earnings $ 839,909\n$ 793,621\nTax-equivalent basis adjustment\n(15 )\n(11 )\nNet interest and dividend income\n$ 27,734\n$ 27,019\nInterest rate spread\n2.85%\n3.44%\nNet interest-earning assets $ 264,132\n$ 258,764\nNet interest margin (6)\n3.50%\n3.61%\nAverage interest-earning assets to average interest-bearing liabilities 150.09%\n152.93%\n(1) The average balance of loans receivable, net includes non-accrual loans.\n(2) Calculated using the Company's 21% federal tax rate.\n(3) Includes passbook savings, money market passbook and club accounts.\n(4) Includes interest-bearing checking and money market accounts.\n(5) Includes certificates of deposits and individual retirement accounts.\n(6) Calculated as annualized net interest income divided by average total interest-earning assets.\nRate/Volume Analysis. The following table presents the effects of changing rates and volumes on our net interest income for the years indicated. The rate column shows the effects attributable to changes in rate (changes in rate multiplied by average volume). The volume column shows the effects attributable to changes in volume (changes in average volume multiplied by prior rate). The net column represents the sum of the prior columns. For purposes of this table, changes attributable to both rate and volume, which cannot be segregated, have been allocated proportionately, based on the changes due to rate and the changes due to volume. There were no out-of-period adjustments excluded from the table below\nSeptember 30,\n2023 vs. 2022\nIncrease (decrease) due to\nVolume Rate Net\n(In thousands)\nInterest-earning assets:\nInterest-earning deposits $ (235 ) $ 1,011 $ 776\nLoans 3,366 4,022 7,388\nSecurities\nTaxable\nTax-exempt (1)\nFHLBNY stock\nTotal interest-earning assets 3,256 5,313 8,569\nInterest-bearing liabilities:\nSavings accounts (2) (31 )\nNOW accounts (3) 6,112 6,325\nTime deposits (4) (60 )\nTotal interest-bearing deposits 7,296 7,418\nBorrowings\nTotal interest-bearing liabilities 7,532 7,850\nIncrease (decrease) in tax equivalent net interest income $ 2,938 $ (2,219 ) $ 719\nChange in tax-equivalent basis adjustment\n(4 )\nIncrease in net interest income\n$ 715\n(1) Calculated using the Company's 21% federal tax rate.\n(2) Includes passbook savings, money market passbook and club accounts.\n(3) Includes interest-bearing checking and money market accounts.\n(4) Includes certificates of deposits and individual retirement accounts.\nInterest and Dividend Income. Interest and dividend income increased $8.6 million, or 29.0%, to $38.1 million for the year ended September 30, 2023 from $29.5 million for the year ended September 30, 2022. The average balance of interest-earnings assets between the two periods increased $43.7 million, or 5.8%, to $791.4 million from $747.7 million, while the yield on such assets increased 86 basis point to 4.81% for the year ended September 30, 2023 from 3.95% for the year ended September 30, 2022.\nInterest income on loans increased $7.4 million, or 26.5%, to $35.2 million for the year ended September 30, 2023 from $27.8 million for the year ended September 30, 2022, while the average balance of loans increased $68.2 million, or 11.4%, to $668.9 million from $600.6 million. The average yield on such loans increased 63 basis points to 5.27% at September 30, 2023 from 4.64% for the year ended September 30, 2022 from higher market interest rates.\nInterest earned on investment securities, including interest earned on deposits but excluding FHLBNY stock, increased $1.1 million, or 70.5%, to $2.7 million for the year ended September 30, 2023 from $1.6 million for fiscal 2022. The increase was attributable to a 115 basis point increase in the average yield on investment securities and interest earned\non deposits to 2.25% from 1.10%, partially offset by a $25.0 million, or 17.2%, decrease in the average balance of investment securities and interest earning deposits to $120.5 million from $145.5 million during the year ended September 30, 2022.\nInterest Expense. Interest expense increased $7.9 million, or 316.0%, to $10.3 million for the year ended September 30, 2023 from $2.5 million for the year ended September 30, 2022. The average balance of interest-bearing liabilities increased $38.4 million, or 7.8%, to $527.3 million from $488.9 million between the two periods while the average cost on such interest-bearing liabilities increased 145 basis points to 1.96% for the year ended September 30, 2023 from 0.51% for the year ended September 30, 2022. Higher market interest rates were primarily responsible for the increase in the cost of the Companys interest-bearing liabilities for the year ended September 30, 2023.\nThe average balance of interest-bearing deposits increased $31.2 million, or 6.6%, to $501.7 million for the year ended September 30, 2023 from $470.5 million for the year ended September 30, 2022 while the average cost on such interest-bearing deposits increased 145 basis points to 1.89% from 0.44%. Average expense on interest-bearing deposits increased $7.4 million, or 358.4%, to 9.5 million at September 30, 2023 compared with $2.1 million at September 30, 2022.\nInterest expense on advances increased $432,000, or 104.3%, to $846,000 for the year ended September 30, 2023 from $414,000 for the year ended September 30, 2022. The average cost of borrowings increased 106 basis points to 3.31% for the year ended September 30, 2023 from 2.25% for the year ended September 30, 2022 while the average balance of those borrowings increased $7.2 million to $25.6 million for the year ended September 30, 2023 from $18.4 million the prior year.\nProvision for Loan Losses. We establish provisions for loan losses, which are charged to earnings, at a level necessary to absorb known and inherent losses that are both probable and reasonably estimable at the date of the financial statements. In evaluating the level of the allowance for loan losses, management considers historical loss experience, the types of loans and the amount of loans in the loan portfolio, adverse situations that may affect the borrowers ability to repay, the estimated value of any underlying collateral, peer group information and prevailing economic conditions. This evaluation is inherently subjective as it requires estimates that are susceptible to significant revision as more information becomes available or as future events occur.\nThe provision for loan losses increased $77,000, or 25.3%, to $381,000 for the year ended September 30, 2023 compared to $304,000 for the year ended September 30, 2022. There were $488,000 in loan charge-offs and $4,000 in loan recoveries for the year ended September 30, 2023 compared with no loan charge-offs and $54,000 in loan recoveries for the year ended September 30, 2022.\nOther Income. Other income decreased $33,000, or 1.2%, to $2.7 million during the year ended September 30, 2023 compared with the year ended September 30, 2022 from lower gains on the sale of SBA loans, partially offset by higher service charge income between periods.\nThe Bank sells the guaranteed portion of the SBA 7(a) program loans it originates in the secondary market. Gains from the sale of SBA loans were $565,000 during the year ended September 30, 2023 compared with $925,000 during the year ended September 30, 2022 due to a reduction in the volume of loans sold.\nService charge income increased $404,000, or 34.0%, to $1.6 million compared with $1.2 million for the prior year from higher commercial loan prepayment fees received during the current year. The Company received $423,000 in prepayment penalties during the year ended September 30, 2023, compared with $130,000 during the year ended September 30, 2022.\nOther Expenses. Other expenses increased $1.0 million, or 5.7%, to $19.3 million compared to $18.3 million for the year ended September 30, 2022 due primarily to higher compensation, benefit, FDIC insurance premium and occupancy expenses, partially offset by lower professional fees.\nCompensation and benefit expense increased $650,000, or 6.2%, to $11.1 million for the year ended September 30, 2023 from $10.5 million for the year ended September 30, 2022. Stock award and stock option expenses related to the Companys 2022 Equity Incentive Plan accounted for a $658,000 increase in compensation expense. In addition, the Company incurred higher director fees, which increased $149,000 during the year ended September 30, 2023 from the prior year due to the addition of three new directors.\nDeposit insurance premiums increased $125,000, or 58.1%, to $340,000 for the year ended September 30, 2023 from $215,000 for the year ended September 30, 2022 from higher insurance assessment rates implemented by the FDIC for all insured institutions effective January 1, 2023.\nOccupancy expenses increased $171,000, or 5.7%, to $3.2 million for the year ended September 30, 2023 from $3.0 million for the year ended September 30, 2022. The increase was attributable to additional maintenance and repairs to the Banks branch locations, the elimination of off-site records previously held in storage and inflationary increases in computer processing and communications.\nProfessional fees decreased $307,000, or 28.9%, to $755,000 for the year ended September 30, 2023 from $1.1 million for the year ended September 30, 2022 from lower legal and consulting fees related to the collection and foreclosure of non-performing assets.\nIncome Tax Expense. The Company recorded tax expense of $3.0 million on income of $10.7 million for the year ended September 30, 2023 compared with tax expense of $3.3 million on income of $11.2 million for the year ended September 30, 2022. The lower income tax expense resulted from a $428,000, or 3.8%, decrease in the Companys results from operations.\nThe Companys effective tax rate for the year ended September 30, 2023 was 28.2% compared with 29.1% for the year ended September 30, 2022.\nManagement of Market Risk\nGeneral. The majority of our assets and liabilities are monetary in nature. Consequently, our most significant form of market risk is interest rate risk. Our assets, consisting primarily of mortgage loans, have longer maturities than our liabilities, consisting primarily of deposits. As a result, a principal part of our business strategy is to manage interest rate risk and reduce the exposure of our net interest income to changes in market interest rates. Accordingly, our Board of Directors has established an Asset and Liability Management Committee which is responsible for evaluating the interest rate risk inherent in our assets and liabilities, for determining the level of risk that is appropriate, given our business strategy, operating environment, capital, liquidity and performance objectives, and for managing this risk consistent with the guidelines approved by the Board of Directors. Senior management monitors the level of interest rate risk on a regular basis and the Asset and Liability Committee meets at least on a quarterly basis to review our asset/liability policies and interest rate risk position.\nWe have sought to manage our interest rate risk in order to minimize the exposure of our earnings and capital to changes in interest rates. As part of our ongoing asset-liability management, we seek to manage our exposure to interest rate risk by originating and retaining adjustable-rate loans in the residential, construction and commercial real estate loan portfolios, by using alternative funding sources, such as advances from the FHLBNY, to match fund longer-term residential and commercial mortgage loans, and by originating and retaining variable-rate home equity and short-term and medium-term fixed-rate commercial business loans. We also offer a commercial loan swap product that allows the Bank to receive floating-rate interest loan payments while its borrowers pay a fixed rate of interest on their loans. We have also increased money market account deposits as a percentage of our total deposits. Money market accounts offer a variable rate based on market indications. By following these strategies, we believe that we are well-positioned to react to changes in market interest rates.\nNet Interest Income Analysis. The table below sets forth, as of September 30, 2023, the estimated changes in our Net Interest Income (NII) for each of the next two years that would result from the designated instantaneous changes in interest rates. These estimates require making certain assumptions including loan and mortgage-related investment prepayment speeds, reinvestment rates, and deposit maturities and decay rates. These assumptions are inherently uncertain and, as a result, we cannot precisely predict the impact of changes in interest rates on net interest income. Actual results may differ significantly due to timing, magnitude and frequency of interest rate changes and changes in market conditions. Further, certain shortcomings are inherent in the methodology used in the interest rate risk measurement. Modeling changes in net interest income require making certain assumptions that may or may not reflect the manner in which actual yields and costs respond to changes in market interest rates.\nChange in\nEstimated Increase\nEstimated Increase\nInterest rates Estimated (Decrease) in NII Year 1 Estimated (Decrease) in NII Year 2\n(Basis Points)(1) NII Year 1 Amount Percentage NII Year 2 Amount Percentage\n(Dollars in thousands)\n+200 $ 31,325 $ 391 1.26% $ 35,685 $ 1,789 5.28%\nUnchanged 30,934 - - 33,896 - -\n30,273 (661 ) -2.14% 31,547 (2,349 ) -6.93%\n(1) Assumes an instantaneous uniform change in interest rates at all maturities.\nLiquidity and Capital Resources\nLiquidity is the ability to meet current and future financial obligations of a short-term nature. Our primary sources of funds consist of deposit inflows, loan repayments, FHLBNY borrowings and maturities and sales of investment securities. While maturities and scheduled amortization of loans and securities are predictable sources of funds, deposit flows and mortgage prepayments are greatly influenced by general interest rates, economic conditions and competition. Our Asset/Liability Management Committee is responsible for establishing and monitoring our liquidity targets and strategies in order to ensure that sufficient liquidity exists for meeting the borrowing needs of our customers as well as unanticipated contingencies. We seek to maintain a liquidity ratio of 5.0% of assets or greater. The liquidity ratio is calculated by determining the sum of the difference between liquid assets (cash and unpledged investment securities) and short-term liabilities (estimated 30-day deposit outflows), plus our borrowing capacity from the FHLBNY and dividing the sum by total assets. At September 30, 2023, our liquidity ratio was 9.7% of assets.\nWe regularly adjust our investments in liquid assets based upon our assessment of expected loan demand, expected deposit flows, yields available on interest-earning deposits and securities, and the objectives of our asset/liability management program. Excess liquid assets are invested generally in interest-earning deposits and short-and intermediate-term securities.\nOur most liquid assets are cash and cash equivalents. The levels of these assets are dependent on our operating, financing, lending and investing activities during any given period. At September 30, 2023, cash and cash equivalents totaled $72.5 million compared with $30.9 million at September 30, 2022. Securities classified as available-for-sale, which provide additional sources of liquidity from sales, totaled $10.1 million at September 30, 2023 compared with $9.2 million at September 30, 2022. At September 30, 2023, we also had the ability to borrow $230.1 million from the FHLBNY compared with $138.9 million at September 30 2022. On that date, we had an aggregate of $29.5 million in advances outstanding and $80.0 million in municipal letters of credit outstanding with the FHLBNY. Our cash flows are derived from operating activities, investing activities and financing activities as reported in our consolidated Statements of Cash Flows included in our consolidated Financial Statements.\nAt September 30, 2023, we had $30.1 million in loan origination commitments outstanding. In addition to commitments to originate loans, we had $89.9 million in unused lines of credit to borrowers. Certificates of deposit due within one year of September 30, 2023 totaled $43.8 million, or 5.8% of total deposits. If these deposits do not remain with us, we will be required to seek other sources of funds, including other deposits and FHLBNY advances. Depending on market conditions, we may be required to pay higher rates on such deposits or other borrowings than we currently pay on the certificates of deposit (including individual retirement accounts and brokered certificate deposit accounts) due on or before September 30, 2024. We believe, however, that based on past experience a significant portion of our certificates of deposit (including individual retirement accounts and brokered certificate deposit accounts) will remain with us. We have the ability to attract and retain deposits by adjusting the interest rates offered.\nOur primary investing activities are the origination of loans and the purchase of investment securities. We originated $188.5 million in loans and purchased $6.6 million of investment securities during the year ended September 30, 2023. Comparatively, we originated $159.2 million in loans and purchased $41.1 million of investment securities during the year ended September 30, 2022.\nFinancing activities consist primarily of activity in deposit accounts and FHLBNY advances. We experienced a net increase in total deposits of $87.7 million, or 13.1%, to $755.5 million for the year ended September 30, 2023 compared with a net decrease in total deposits of $27.9 million, or 4.4%, to $667.7 million for the year ended September 30, 2022. Deposit flows are affected by the overall level of interest rates, the interest rates and products offered by us and our local competitors and other factors.\nLiquidity management is both a daily and long-term function of business management. If we require funds beyond our ability to generate them internally, borrowing agreements exist with the FHLBNY, which provide an additional source of funds. FHLBNY advances totaled $29.5 million and $15.6 million at September 30, 202 and 2022, respectively. FHLBNY advances have primarily been used to fund loan demand.\nIn addition to borrowings, the Bank has the ability to raise deposits on the brokered market or through deposit listing services. At September 30, 2023, the Bank held $13.8 million in brokered deposits and $14.0 million from deposit listing services.\nMagyar Bank is subject to various regulatory capital requirements, (see Supervision and Regulation-Federal Banking Regulation-Capital Requirements). As of September 30, 2023, Magyar Banks Tier 1 capital as a percentage of the Banks average assets was 11.11% and the total qualifying capital as a percentage of risk-weighted assets was 16.22%.\nBank-owned life insurance is a tax-advantaged financing transaction that is used to offset employee benefit plan costs. Policies are purchased insuring directors and officers of Magyar Bank using a single premium method of payment. Magyar Bank is the owner and beneficiary of the policies and records tax-free income through cash surrender value accumulation. We have minimized our credit exposure by choosing carriers that are highly rated and limiting the concentration of any one carrier. The investment in bank-owned life insurance has no significant impact on our capital and liquidity.\nOff-Balance Sheet Arrangements and Aggregate Contractual Obligations\nCommitments. As a financial services provider, we routinely are a party to various financial instruments with off-balance-sheet risks, such as commitments to extend credit, standby letters of credit and unused lines of credit. While these contractual obligations represent our future cash requirements, a significant portion of commitments to extend credit may expire without being drawn upon. Such commitments are subject to the same credit policies and approval process accorded to loans made by us. For additional information, see Note P, Commitments, and Note Q Financial Instruments with Off-Balance-Sheet Risk to our consolidated financial statements.\nContractual Obligations. In the ordinary course of our operations, we enter into certain contractual obligations. Such obligations include operating leases for premises and equipment. ITEM 7A. Quantitative and Qualitative Disclosures About Market Risk\nNot required for smaller reporting companies. ITEM 8. Financial Statements and Supplementary Data\nConsolidated Financial Statements:\nReport of Independent Registered Public Accounting Firms (PCAOB IDs 74 and 49) 46\nConsolidated Balance Sheets as of September 30, 2023 and 2022 50\nConsolidated Statements of Income for the Years Ended September 30, 2023 and 2022 51\nConsolidated Statements of Comprehensive Income for the Years Ended September 30, 2023 and 2022 52\nConsolidated Statements of Changes in Stockholders Equity for the Years Ended September 30, 2023 and 2022 53\nConsolidated Statements of Cash Flows for the Years Ended September 30, 2023 and 2022 54\nNotes to Consolidated Financial Statements 55\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Magyar Bancorp, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Magyar Bancorp, Inc. and subsidiary (the Company) as of September 30, 2023; the related consolidated statements of income, comprehensive income, changes in stockholders equity, and cash flows for the year then ended; and the related notes to the consolidated financial statements (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent, with respect to the Company, in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the Audit Committee and that: (1) relate to accounts or disclosures that are material to the financial statements; and (2) involve our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter, in any way, our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nAllowance for Loan Losses (ALL) - Qualitative Factors\nDescription of the Matter\nThe Companys loan portfolio totaled $697.4 million as of September 30, 2023, and the associated ALL was $8.3 million. As discussed in Notes B and E to the consolidated financial statements, determining the amount of the ALL requires significant judgment about the collectability of loans, which includes an assessment of quantitative factors such as historical loss experience within each risk category of loans and testing of certain commercial loans for impairment. Management applies additional qualitative adjustments to reflect the inherent losses that exist in the loan portfolio at the balance sheet date that are not reflected in the historical loss experience. Qualitative adjustments are made based upon changes in policy and staff, economic and business conditions, nature and volume of portfolio, trends in underperforming loans, trends in collateral value, concentrations of credit, legal and regulatory landscape, and other factors.\nWe identified these qualitative adjustments within the ALL as critical audit matters because they involve a high degree of subjectivity. In turn, auditing managements judgments regarding the qualitative factors applied in the ALL calculation involved a high degree of subjectivity.\nHow We Addressed the Matter in Our Audit\nWe gained an understanding of the Companys process for establishing the ALL, including the qualitative adjustments made to the ALL. We evaluated the design and tested the operating effectiveness of controls over the Companys ALL process, which included, among others, managements review and approval controls designed to assess the need and level of qualitative adjustments to the ALL, as well as the reliability of the data utilized to support managements assessment.\nRegarding the measurement of the qualitative adjustments, we evaluated the completeness, accuracy, and relevance of the data and inputs utilized in managements estimate. We evaluated the reasonableness of the conclusions reached by management for both directional consistency and magnitude related to the underlying data.\nWe also utilized internal credit review specialists with knowledge to evaluate the appropriateness of managements risk-rating processes, to ensure that the risk ratings applied to the commercial loan portfolio were reasonable.\nWe have served as the Companys auditor since 2023.\n/s/ S.R. Snodgrass, P.C.\nCranberry Township, Pennsylvania\nDecember 15, 2023\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Stockholders\nMagyar Bancorp, Inc. and Subsidiary\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Magyar Bancorp, Inc. and Subsidiary (the Company) as of September 30, 2022, the related consolidated statements of income, comprehensive income, changes in stockholders equity and cash flows, for the year then ended, and the related notes (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022, and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAllowance for Loan Losses - Qualitative Factors\nThe allowance for loan losses as of September 30, 2022 was $8.4 million. As described in Notes B and E to the consolidated financial statements, the allowance for loan losses is established through a provision for loan losses and represents an amount which, in managements judgement, will be adequate to absorb losses on existing loans. The allowance consists of specific and general components in the amounts of $0.1 million and $8.3 million, respectively. The specific component relates to loans that are delinquent or otherwise identified as impaired by management. All such loans are evaluated individually, with principal consideration given to the value of the collateral securing the loan and discounted cash flows. Specific impairment allowances are established as required by this analysis. The general loan loss allocation component is determined by segregating the remaining loans by type of loan, risk weighting, and payment history. This analysis establishes historical loss factors based on a five year look back period that are applied to the loan groups adjusted for the following qualitative factors: levels of and trends in delinquency rates and non-accrual loans, volume and loan term trends, changes in the lending policy, national and local economic trends and conditions, changes in concentrations of credit from a loan type, industry and/or geographic standpoint, the experience, ability and depth of lending management, and trends in collateral value. The evaluation of the qualitative factors requires a significant amount of judgement by management and involves a high degree of subjectivity.\nWe identified the qualitative factor component of the allowance for loan losses as a critical audit matter as auditing the underlying qualitative factors required significant auditor judgment as amounts determined by management rely on analysis that is often subjective in nature and the estimate is highly sensitive to changes in significant assumptions.\nOur audit procedures related to the qualitative factors of the allowance for loan losses included the following, among others:\n● We obtained an understanding of how management developed the estimates and related assumptions, including:\n− Testing completeness and accuracy of key data inputs used in forming assumptions or calculations and testing the reliability of the underlying data on which these factors are based by comparing information to source documents and external information sources.\n− Evaluating the reasonableness of the qualitative factors established by management as compared to the underlying internal or external information sources.\n/s/ RSM US LLP\nWe served as the Companys auditor from 2018 to 2023.\nBlue Bell, Pennsylvania\nDecember 22, 2022\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nConsolidated Balance Sheets\n(In Thousands, Except Share and Per Share Data)\nSeptember 30,\nAssets\nCash $ 3,179 $ 2,869\nInterest earning deposits with banks 69,353 28,067\nTotal cash and cash equivalents 72,532 30,936\nInvestment securities - available-for-sale, at fair value 10,125 9,229\nInvestment securities - held-to-maturity, at amortized cost (fair value of $73,728 and $79,914 at September 30, 2023 and 2022, respectively) 85,835 91,646\nFederal Home Loan Bank of New York stock, at cost 2,286 1,447\nLoans receivable, net of allowance for loan losses of $8,330 and $8,433 at September 30, 2023 and 2022, respectively 689,070 619,843\nBank owned life insurance 18,030 17,660\nAccrued interest receivable 4,337 3,478\nPremises and equipment, net 13,339 13,880\nOther real estate owned (\"OREO\")\nOther assets 11,410 10,143\nTotal assets $ 907,292 $ 798,543\nLiabilities and Stockholders' Equity\nLiabilities\nDeposits $ 755,453 $ 667,733\nEscrowed funds 3,494 3,407\nBorrowings 29,515 15,625\nAccrued interest payable\nAccounts payable and other liabilities 13,597 13,191\nTotal liabilities 802,502 700,041\nStockholders' equity\nPreferred stock: $.01 Par Value, 500,000 shares authorized; at September 30, 2023 and 2022, none issued -\n-\nCommon stock: $.01 Par Value, 14,000,000 shares authorized; 7,097,825 shares issued; 6,674,184 and 6,745,128 shares outstanding at September 30, 2023 and 2022, respectively, at cost\nAdditional paid-in capital 62,801 63,734\nTreasury stock: 423,641 and 465,693 shares at September 30, 2023 and 2022, respectively, at cost (5,362 ) (5,793 )\nUnearned Employee Stock Ownership Plan shares (3,097 ) (3,169 )\nRetained earnings 52,166 45,773\nAccumulated other comprehensive loss (1,789 ) (2,114 )\nTotal stockholders' equity 104,790 98,502\nTotal liabilities and stockholders' equity $ 907,292 $ 798,543\nThe accompanying notes are an integral part of these consolidated financial statements.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nConsolidated Statements of Income\n(In Thousands, Except Share and Per Share Data)\nYears Ended\nSeptember 30,\nInterest and dividend income\nLoans, including fees $ 35,229 $ 27,841\nInvestment securities\nTaxable 2,642 1,543\nTax-exempt\nFederal Home Loan Bank of New York stock\nTotal interest and dividend income 38,068 29,503\nInterest expense\nDeposits 9,488 2,070\nBorrowings\nTotal interest expense 10,334 2,484\nNet interest and dividend income 27,734 27,019\nProvision for loan losses\nNet interest and dividend income after provision for loan losses 27,353 26,715\nOther income\nService charges 1,592 1,188\nIncome on bank owned life insurance\nInterest rate swap fees\nOther operating income\nGains on sales of loans\nGains on sale of OREO -\nTotal other income 2,682 2,715\nOther expenses\nCompensation and employee benefits 11,134 10,484\nOccupancy expenses 3,187 3,016\nProfessional fees 1,062\nData processing expenses\nDirector fees and benefits\nMarketing and business development\nFDIC deposit insurance premiums\nOther expenses 2,149 1,935\nTotal other expenses 19,294 18,261\nIncome before income tax expense 10,741 11,169\nIncome tax expense 3,032 3,250\nNet income $ 7,709 $ 7,919\nEarnings per share - basic $ 1.20 $ 1.17\nEarnings per share - diluted $ 1.20 $ 1.17\nWeighted average shares outstanding - basic 6,424,796 6,781,659\nWeighted average shares outstanding - diluted 6,424,796 6,781,659\nThe accompanying notes are an integral part of these consolidated financial statements.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nConsolidated Statements of Comprehensive Income\n(In Thousands)\nYears Ended\nSeptember 30\nNet income $ 7,709 $ 7,919\nOther comprehensive income (loss)\nUnrealized loss on securities available for sale (47 ) (1,744 )\nDefined benefit pension plan gain\nOther comprehensive income (loss), before tax (1,533 )\nDeferred income tax effect (144 )\nTotal other comprehensive income (loss) $ 325 $ (1,167 )\nTotal comprehensive income $ 8,034 $ 6,752\nThe accompanying notes are an integral part of these consolidated financial statements.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nConsolidated Statements of Changes in Stockholders' Equity\nFor the Years Ended September 30, 2023 and 2022\n(In Thousands, Except for Share and Per-Share Amounts)\nAccumulated\nCommon Stock Additional\nUnearned\nOther\nShares Par Paid-In Treasury ESOP Retained Comprehensive\nOutstanding Value Capital Stock Shares Earnings Loss Total\nBalance, September 30, 2021 7,097,825 $ 71 $ 63,713 $ (1,242 ) $ (3,235 ) $ 39,281 $ (947 ) $ 97,641\nNet income - -\n-\n-\n-\n7,919 -\n7,919\nDividends paid on common stock ($0.21 per share) - -\n-\n-\n-\n(1,427 ) -\n(1,427 )\nOther comprehensive loss - -\n-\n-\n-\n-\n(1,167 ) (1,167 )\nCommon stock acquired by ESOP - -\n-\n-\n(98 ) -\n-\n(98 )\nESOP shares allocated - -\n-\n-\n-\nPurchase of treasury stock (352,697 ) -\n-\n(4,551 ) -\n-\n-\n(4,551 )\nStock-based compensation expense - -\n-\n-\n-\n-\nBalance, September 30, 2022 6,745,128 $ 71 $ 63,734 $ (5,793 ) $ (3,169 ) $ 45,773 $ (2,114 ) $ 98,502\nNet income - -\n-\n-\n-\n7,709 -\n7,709\nDividends paid on common stock ($0.20 per share) - -\n-\n-\n-\n(1,315 ) -\n(1,315 )\nOther comprehensive income - -\n-\n-\n-\n-\nTreasury stock used for restricted stock plan 32,080 -\n(405 ) -\n(1 ) -\n-\nESOP shares allocated - -\n-\n-\n-\nRetirement of 112,996 treasury shares - -\n(1,242 ) 1,242 -\n-\n-\n-\nPurchase of treasury stock (103,024 ) -\n-\n(1,217 ) -\n-\n-\n(1,217 )\nStock-based compensation expense - -\n-\n-\n-\n-\nBalance, September 30, 2023 6,674,184 $ 71 $ 62,801 $ (5,362 ) $ (3,097 ) $ 52,166 $ (1,789 ) $ 104,790\nThe accompanying notes are an integral part of these consolidated financial statements.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nConsolidated Statements of Cash Flows\n(In Thousands)\nFor the Years Ended\nSeptember 30,\nOperating activities\nNet income $ 7,709 $ 7,919\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation expense\nPremium amortization on investment securities, net\nProvision for loan losses\nOriginations of SBA loans held for sale (6,494 ) (9,533 )\nProceeds from the sales of SBA loans 7,059 10,457\nGains on sale of loans (565 ) (925 )\nGains on the sales of other real estate owned -\n(67 )\nGains on the sale of premises and equipment (9 ) -\nESOP compensation expense\nStock-based compensation expense\nDeferred income tax (benefit) expense (615 )\n(Increase) decrease in accrued interest receivable (859 )\nIncrease in surrender value of bank owned life insurance (370 ) (372 )\nIncrease in other assets (280 ) (1,555 )\nIncrease in accrued interest payable -\n(Decrease) increase in accounts payable and other liabilities 3,551\nNet cash provided by operating activities 8,484 11,201\nInvesting activities\nNet increase in loans receivable (56,258 ) (37,235 )\nPurchases of loans receivable (13,350 ) -\nProceeds from the sale of loans receivable -\n2,389\nPurchases of investment securities held-to-maturity (4,587 ) (41,138 )\nPurchases of investment securities available-for-sale (1,965 ) -\nPrincipal repayments on investment securities held-to-maturity 10,313 7,040\nPrincipal repayments on investment securities available-for-sale 1,875\nPurchases of bank owned life insurance -\n(3,000 )\nPurchases of premises and equipment (309 ) (387 )\nProceeds from the sale of premises and equipment -\nInvestment in other real estate owned (47 ) (12 )\nProceeds from other real estate owned -\nPurchase of Federal Home Loan Bank stock (5,820 ) (466 )\nRedemption of Federal Home Loan Bank stock 4,981\nNet cash used in investing activities (66,053 ) (69,743 )\nFinancing activities\nNet increase in deposits 87,720 27,919\nPurchase of common stock for ESOP -\n(98 )\nNet increase in escrowed funds\nProceeds from long-term advances 18,631 3,000\nRepayments of long-term advances (4,741 ) (10,731 )\nCash dividends paid on common stock (1,315 ) (1,427 )\nPurchase of treasury stock (1,217 ) (4,551 )\nNet cash provided by financing activities 99,165 14,277\nNet increase (decrease) in cash and cash equivalents 41,596 (44,265 )\nCash and cash equivalents, beginning of year 30,936 75,201\nCash and cash equivalents, end of year $ 72,532 $ 30,936\nSupplemental disclosures of cash flow information\nCash paid for\nInterest $ 9,977 $ 2,485\nIncome taxes $ 3,255 $ 3,140\nThe accompanying notes are an integral part of these consolidated financial statements.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nNOTE A - ORGANIZATION\nMagyar Bancorp, Inc. (the Company) is a Delaware-chartered bank holding company. The Company owns 100% of the outstanding common stock of Magyar Bank (the Bank), a New Jersey-chartered stock savings bank. The Bank offers consumer and commercial banking services to individuals, businesses, and nonprofit organizations throughout the central New Jersey area through its administrative office in New Brunswick, New Jersey and seven full-service branch offices in Middlesex and Somerset Counties in New Jersey. The Company is subject to regulation and supervision by the Board of Governors of the Federal Reserve System. The Bank is supervised and regulated by the Federal Deposit Insurance Corporation (the FDIC) and the New Jersey Department of Banking and Insurance.\nMagyar Investment Company, a New Jersey investment corporation subsidiary of the Bank, was formed on August 15, 2006 for the purpose of buying, selling and holding investment securities.\nMagyar Service Corporation, a New Jersey corporation, is a wholly owned, non-bank subsidiary of the Bank. Magyar Service Corporation, which also operates under the name Magyar Financial Services, receives commissions from annuity and life insurance sales referred to a licensed, non-bank financial planner.\nHungaria Urban Renewal, LLC is a Delaware limited-liability corporation established in 2002 as a qualified intermediary operating for the purpose of acquiring and developing the Banks new main office. The Bank owns a 100% interest in Hungaria Urban Renewal, LLC, which has no other business other than owning the Banks main office site.\nNOTE B - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n1. Basis of Financial Statement Presentation\nThe accounting and reporting policies of the Company conform to accounting principles generally accepted in the United States of America (US GAAP) and predominant practices within the banking industry. The consolidated financial statements include the accounts of the Company and its wholly owned subsidiary, the Bank, and its wholly-owned subsidiaries Magyar Investment Company, Magyar Service Corporation, and Hungaria Urban Renewal, LLC. All intercompany balances and transactions have been eliminated in the consolidated financial statements.\nThe Company has evaluated subsequent events and transactions occurring subsequent to the consolidated balance sheet date of September 30, 2023, for items that should potentially be recognized or disclosed in these consolidated financial statements. The evaluation was conducted through the date these consolidated financial statements were available to be issued.\nIn preparing financial statements in conformity with US GAAP, management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nThe principal estimates that are particularly susceptible to significant change in the near term relate to the allowance for loan losses and the deferred tax asset. The evaluation of the adequacy of the allowance for loan losses includes an analysis of the individual loans and overall risk characteristics and size of the different loan portfolios, and takes into consideration current economic and market conditions, the capability of specific borrowers to pay specific loan obligations, as well as current loan collateral values. However, actual losses on specific loans, which also are encompassed in the analysis, may vary from estimated losses.\nThe Company records income taxes using the asset and liability method. Accordingly, deferred tax assets and liabilities: (i) are recognized for the expected future tax consequences of events that have been recognized in the financial statements or tax returns; (ii) are attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases; and (iii) are measured using enacted tax rates expected to apply in the years when those temporary differences are expected to be recovered or settled.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nWhere applicable, deferred tax assets are reduced by a valuation allowance for any portions determined not likely to be realized. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income tax expense in the period of enactment. The valuation allowance is adjusted, by a charge or credit to income tax expense, as changes in facts and circumstances warrant.\n2. Cash and Cash Equivalents\nFor purposes of reporting cash flows, cash and cash equivalents include cash on hand, amounts due from banks, time deposits with original maturities less than three months and overnight deposits.\n3. Investment Securities\nThe Company classifies its investment securities into one of two portfolios: held to maturity or available for sale. Investments in debt securities that the Company has the positive intent and ability to hold to maturity are classified as held to maturity securities and reported at amortized cost. Debt securities not classified as held to maturity securities are classified as available for sale securities and reported at fair value, with unrealized holding gains or losses, net of deferred income taxes, reported in the accumulated other comprehensive income (AOCI) component of stockholders equity. Equity securities, with certain exceptions, are measured at fair value with changes in fair value recognized in net income.\nIf the fair value of a security is less than its amortized cost, the security is deemed to be impaired. Management evaluates all securities with unrealized losses quarterly to determine if such impairments are temporary or other-than-temporary in accordance with applicable accounting guidance. The Company accounts for temporary impairments based upon security classification as either available for sale or held to maturity. Temporary impairments on available for sale securities are recognized, on a tax-effected basis, through AOCI with offsetting entries adjusting the carrying value of the security and the balance of deferred taxes. Conversely, the Company does not adjust the carrying value of held to maturity securities for temporary impairments, although information concerning the amount and duration of impairments on held to maturity securities is generally disclosed in periodic consolidated financial statements.\nThe Company accounts for other-than-temporary impairments based upon several considerations. First, other-than-temporary impairments on securities that the Company has decided to sell as of the close of a fiscal period, or will, more likely than not, be required to sell prior to the full recovery of their fair value to a level equal to their amortized cost, are recognized in operations. If neither of these criteria apply, then the other-than-temporary impairment is separated into credit-related and noncredit-related components. The credit-related impairment generally represents the amount by which the present value of the cash flows that are expected to be collected on an other-than-temporarily impaired security fall below its amortized cost while the noncredit-related component represents the remaining portion of the impairment not otherwise designated as credit-related. The Company recognizes credit-related, other-than-temporary impairments in earnings, while noncredit-related, other-than-temporary impairments on debt securities are recognized, net of deferred taxes, in AOCI.\nPremiums and discounts on all securities are amortized or accreted to maturity by use of the level-yield method considering the impact of principal amortization and prepayments on mortgage-backed securities. Gain or loss on sales of securities is recognized on the specific identification method.\n4. Regulatory Stock, at Cost\nFederal law requires a member institution of the Federal Home Loan Bank (FHLB) system to purchase and hold restricted stock of its district FHLB according to a predetermined formula. The Company invests in Federal Home Loan Bank of New York stock as required to support borrowing activities, as detailed in Note J to these consolidated financial statements. Although FHLB stock is an equity interest in a FHLB, it does not have a readily determinable fair value because its ownership is restricted and it lacks a market. FHLB stock can be sold back only at its par value of $100 per share and only to the FHLBs or to another member institution. Accordingly, the FHLB restricted stock is carried at cost, less any applicable impairment charges.\n5. Loans and Allowance for Loan Losses\nLoans that management has the intent and ability to hold for the foreseeable future or until maturity or payoff are stated at the amount of unpaid principal, adjusted for net deferred loan fees and costs, and reduced by an allowance for loan losses. Interest on loans is accrued and credited to operations based upon the principal amounts outstanding. The allowance for loan losses is established through a provision for possible loan losses charged to operations. Loans are charged against the allowance for loan losses when management believes that the collectability of the principal is unlikely.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nIncome recognition of interest is discontinued when, in the opinion of management, the collectability of such interest becomes doubtful. A loan is generally classified as non-accrual when the scheduled payment(s) due on the loan is delinquent for more than 90 days. When a loan is placed on non-accrual, all previously accrued and unpaid interest is reversed. Loan origination fees and certain direct origination costs are deferred and amortized over the life of the related loans as an adjustment to the yield on loans receivable using the effective interest method.\nThe allowance for loan losses is maintained at an amount management deems adequate to cover estimated losses. In determining the level to be maintained, management evaluates many factors, including current economic trends, industry experience, historical loss experience, industry loan concentrations, the borrowers ability to repay and repayment performance, and estimated collateral values. In the opinion of management, the present allowance is adequate to absorb reasonable, foreseeable loan losses. While management uses the best information available to make such evaluations, future adjustments to the allowance may be necessary based on changes in economic conditions or any of the other factors used in managements determination. In addition, various regulatory agencies, as an integral part of their examination process, periodically review the Companys allowance for losses on loans. Such agencies may require the Company to recognize additions to the allowance based on their judgments about information available to them at the time of their examination. Charge-offs to the allowance are made when the loan is transferred to other real estate owned or other determination of a confirmed loss. Recoveries on loans previously charged off are also recorded through the allowance.\nA loan is considered impaired when, based upon current information and events, it is probable that a creditor will be unable to collect all amounts due including principal and interest, according to the contractual terms of the loan agreement. The Company measures impaired loans based on the present value of expected future cash flows discounted at the loans effective interest rate or as a practical expedient, at the loans current observable market price, or the fair value of the collateral if the loan is collateral dependent. The amount by which the recorded investment of an impaired loan exceeds the measurement value is recognized by creating a valuation allowance through a charge to the provision for loan losses. Impairment criteria generally do not apply to those smaller-balance homogeneous loans that are collectively evaluated for impairment which, for the Company, includes one- to four-family first mortgage loans and consumer loans, other than those modified in a troubled debt restructuring.\nThe Company records cash receipts on impaired loans that are non-performing as a reduction to principal before applying amounts to interest or late charges unless specifically directed by the Bankruptcy Court to apply payments otherwise. The Company may continue to recognize interest income on impaired loans where there is no confirmed loss.\n6. Premises and Equipment\nPremises and equipment are carried at cost less accumulated depreciation, and include capitalized expenditures for new facilities, major betterments and renewals. Expenditures for maintenance and repairs are charged to expense as incurred. Depreciation is computed using the straight-line method based upon the estimated useful lives of the related assets for financial reporting purposes and using the mandated methods by asset type for income tax purposes. Leasehold improvements are depreciated using the straight-line method based upon the initial term of the lease.\nThe Company accounts for the impairment of long-lived assets in accordance with US GAAP, which requires recognition and measurement for the impairment of long-lived assets to be held and used or to be disposed of by sale. The Company had no impaired long-lived assets at September 30, 2023 and 2022.\n7. Revenue Recognition\nThe Company recognizes revenue in the consolidated statements of income as it is earned and when collectability is reasonably assured. The primary source of revenue is interest income from interest earning assets, which is recognized on the accrual basis of accounting using the effective interest method. The recognition of revenues from interest earning assets is based upon formulas from underlying loan agreements, securities contracts, or other similar contracts. Non-interest income is recognized on the accrual basis of accounting as services are provided or as transactions occur. Non-interest income includes earnings on bank-owned life insurance, deposit accounts, merchant services, ATM and debit card fees, mortgage banking activities, commercial loan prepayment penalties and other miscellaneous services and transactions.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nThe Companys contracts with customers in the scope of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers are contracts for deposit accounts and contracts for non-deposit investment accounts through a third party service provider. Both types of contracts result in non-interest income being recognized. The revenue resulting from deposit accounts, which includes fees such as insufficient funds fees, wire transfer fees and out-of-network ATM transaction fees, is included as a component of service charges on the Consolidated Statements of Income. The revenue resulting from non-deposit investment accounts is included as a component of other operating income on the Consolidated Statements of Income.\nRevenue from contracts with customers included in service charges was $1.6 million and $1.2 million for the years ended September 30, 2023 and 2022, respectively. Revenue from contracts with customers included in other operating income was $98,000 and $87,000 for the years ended September 30, 2023 and 2022, respectively.\nFor our contracts with customers, we satisfy our performance obligations each day as services are rendered. For our deposit account revenue, we receive payment on a daily basis as services are rendered and for our non-deposit investment account revenue, we receive payment on a monthly basis from our third party service provider as services are rendered.\n8. Other Real Estate Owned\nReal estate acquired through foreclosure, or a deed-in-lieu of foreclosure, is recorded at fair value less estimated selling costs at the date of acquisition or transfer, and subsequently at the lower of its net cost or fair value less estimated selling costs. Adjustments to the carrying value at the date of acquisition or transfer are charged to the allowance for loan losses. The carrying value of the individual properties is subsequently adjusted to the extent it exceeds estimated fair value less estimated selling costs, at which time a provision for losses on such real estate is charged to operations.\nThe Company accounts for gains on sales of other real estate owned under ASC Topic 606 Revenue from Contracts with Customers, which uses a principles based methodology. As it pertains to the criteria for determining how a contract should be accounted for under the new guidance, judgment is required in evaluating if: (a) a commitment on the buyers part exists, (b) collection is probable in circumstances where the initial investment is minimal and (c) the buyer has obtained control of the asset, including the significant risks and rewards of the ownership. If there is no commitment on the buyers part, collection is not probable or the buyer has not obtained control of the asset, then a gain cannot be recognized under the new guidance.\nOperating expenses of holding real estate, net of related income, are charged against income as incurred. Losses on the disposition of real estate, including expenses incurred in connection with the disposition, are charged to operations.\n9. Pension and Postretirement Plans\nThe Company sponsors qualified defined benefit pension plan and supplemental executive retirement plan (SERP). The qualified defined benefit pension plan is funded with trust assets invested in a diversified portfolio of debt and equity securities. Accounting for pensions and other postretirement benefits involves estimating the cost of benefits to be provided well into the future and attributing that cost over the time period each employee works. This involves extensive use of assumptions about inflation, investment returns, mortality, turnover, and discount rates. Among other factors, changes in interest rates, investment returns and the market value of plan assets can (i) affect the level of plan funding; (ii) cause volatility in the net periodic pension cost; and (iii) increase our future contribution requirements. A significant decrease in investment returns or the market value of plan assets or a significant decrease in interest rates could increase our net periodic pension costs and adversely affect our results of operations. A significant increase in our contribution requirements with respect to our qualified defined benefit pension plan could have an adverse impact on our cash flow. Changes in the key actuarial assumptions would impact net periodic benefit expense and the projected benefit obligation for our defined benefit and other postretirement benefit plan. See Note L, Pension Plan, and Note M, Non-Qualified Compensation Plan for information on these plans and the assumptions used.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\n10. Income Taxes\nThe Company and its subsidiaries file consolidated federal and state income tax returns. Income taxes are allocated based on the contribution of their respective income or loss to the consolidated income tax returns.\nThe Company records income taxes on the basis of reported income using the asset and liability method. Accordingly, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. To the extent that current available evidence about the future raises doubt about the realization of a deferred tax asset, a valuation allowance is established. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nThe Company follows the provisions of FASB ASC Topic 740, which provides clarification on accounting for uncertainty in income taxes recognized in an enterprises financial statements. The guidance prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return, and also provides guidance on derecognition, classification, interest and penalties, accounting in interim periods, disclosure and transition.\nAt September 30, 2023 and 2022, no significant income tax uncertainties have been included in the Companys Consolidated Balance Sheets. The Companys policy is to recognize interest and penalties on unrecognized tax benefits in income tax expense in the Consolidated Statements of Income. No interest and penalties were recorded during the year ended September 30, 2023 and 2022. The tax years subject to examination by the taxing authorities are the years ended September 30, 2018 and forward.\n11. Advertising Costs\nThe Company expenses advertising costs as incurred.\n12. Earnings Per Share\nBasic income per share is calculated by dividing income available to common stockholders by the weighted average number of shares of common stock outstanding for the period. The weighted average common shares outstanding include shares allocated to the Employee Stock Ownership Plan.\nDiluted income per share is calculated by adjusting the weighted average common shares outstanding to reflect the potential dilution that could occur using the treasury stock method if securities or other contracts to issue common stock, such as stock options and unvested restricted stock, were exercised and converted into common stock. The resulting shares issued would share in the earnings of the Company. Shares issued and shares reacquired during the period are weighted for the portion of the period that they were outstanding. In periods of loss, dilution is not calculated and diluted loss per share is equal to basic loss per share.\nThe following tables illustrate the reconciliation of the numerators and denominators of the basic and diluted earnings per share (EPS) calculations.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nYears Ended\nSeptember 30,\n(Dollars in thousands, except\nshare and per share data)\nIncome applicable to common shares $ 7,709 $ 7,919\nWeighted average shares outstanding - basic 6,424,796 6,781,659\nPotential diliutive common stock equivalents -\n-\nWeighted average shares outstanding - diluted 6,424,796 6,781,659\nEarnings per share - basic $ 1.20 $ 1.17\nEarnings per share - diluted $ 1.20 $ 1.17\nAll options were anti-dilutive at September 30, 2023 and 2022.\n13. Comprehensive Income (Loss) and Accumulated Other Comprehensive Income (Loss)\nComprehensive income (loss) includes net income as well as certain other items which result in a change to equity during the period. The other items allocated to comprehensive income (loss), as well as the related income tax effects, for the years ended September 30, 2023 and 2022 were as follows:\nSeptember 30,\nTax Net of\nTax Net of\nBefore Tax (Benefit) Tax Before Tax (Benefit) Tax\nAmount Expense Amount Amount Expense Amount\n(In thousands)\nUnrealized holding gain (loss) arising during period on:\nAvailable-for-sale investments $ (47 ) $ 12 $ (35 ) $ (1,744 ) $ 429 $ (1,315 )\nDefined benefit pension plan (122 ) (22 )\nTotal unrealized holding gain (loss) arising during period (110 ) (1,679 ) (1,272 )\nReclassification of pension costs (34 ) (41 )\nOther comprehensive income (loss), net $ 469 $ (144 ) $ 325 $ (1,533 ) $ 366 $ (1,167 )\n(a) All amounts are net of tax. Related income tax expense or benefit calculated using an income tax rate approximating 25% for available-for-sale investments and 28% for pension plan.\nDetails about the reclassification of accumulated other comprehensive income (loss) components and the affected line item in the Consolidated Statement of Income for the years ended September 30, 2023 and 2022 were as follows:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nAmount Reclassified From\nAccumulated Other Comprehensive\nLoss For the Year Ended September 30, Affected Line Item in the\nConsolidated Statement of Income\n(In thousands)\nDefined benefit pension plan (1)\nAmortization of net gain (loss) and prior service costs $ 122 $ 146 Compensation and employee benefits\nRelated income tax expense (34 ) (41 ) Income taxes\nNet effect on accumulated other comprehensive loss\nTotal reclassification $ 88 $ 105\n(1) For additional details related to the defined benefit pension plan see Note L - Pension Plan\nThe components of accumulated other comprehensive loss at September 30, 2023 and 2022 were as follows:\nSeptember 30,\n(In thousands)\nAvailable-for-sale investments, net of tax $ (1,481 ) $ (1,446 )\nDefined benefit pension plan, net of tax (308 ) (668 )\nTotal accumulated other comprehensive loss $ (1,789 ) $ (2,114 )\n(a) Related income tax benefit calculated using an income tax rate approximating 25% for available-for-sale investments and 28% for pension plan.\n14. Bank-Owned Life Insurance\nThe Company has purchased Bank-Owned Life Insurance policies (BOLI). BOLI involves the purchasing of life insurance by the Company on directors and officers of the Bank. The proceeds are used to help defray the costs of non-qualified compensation plans. The Company is the owner and beneficiary of the policies. BOLI is recorded on the Consolidated Balance Sheets at its cash surrender value and changes in the cash surrender value are recorded in other income in the Consolidated Statements of Income.\n15. Off-Balance Sheet Credit Related Financial Instruments\nIn the ordinary course of business, the Company has entered into commitments to extend credit, including commitments under commercial lines of credit. Such financial instruments are recorded when they are funded. The Company does not engage in the use of derivative financial instruments. See Note Q, Financial Instruments With Off-Balance Risk.\n16. Segment Reporting\nThe Company acts as an independent, community, financial services provider, and offers traditional banking and related financial services to individual, business and government customers. The Company offers a full array of commercial and retail financial services, including the taking of time, savings and demand deposits; the making of commercial, consumer and home equity loans; and the provision of other financial services.\nManagement does not separately allocate expenses, including the cost of funding loan demand, between the commercial and retail operations of the Company. As such, discrete financial information is not available and segment reporting would not be meaningful.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\n17. New Accounting Pronouncements\nIn connection with the preparation of quarterly and annual reports in accordance with the Securities and Exchange Commissions (SEC) Securities Exchange Act of 1934, SEC Staff Accounting Bulletin Topic 11.M requires the disclosure of the impact that recently issued accounting standards will have on financial statements when they are adopted in the future.\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments - Credit Losses: Measurement of Credit Losses on Financial Instruments. ASU 2016-13 requires entities to report expected credit losses on financial instruments and other commitments to extend credit rather than the current incurred loss model. These expected credit losses for financial assets held at the reporting date are to be based on historical experience, current conditions, and reasonable and supportable forecasts. This ASU will also require enhanced disclosures to help investors and other financial statement users better understand significant estimates and judgments used in estimating credit losses, as well as the credit quality and underwriting standards of an entitys portfolio. These disclosures include qualitative and quantitative requirements that provide additional information about the amounts recorded in the financial statements.\nWith certain exceptions, transition to the new requirements will be through a cumulative-effect adjustment to opening retained earnings as of the beginning of the first reporting period in which the guidance is adopted. This update is effective for SEC filers that are eligible to be smaller reporting companies, non-SEC filers, and all other companies, to fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. Accordingly, the Company will adopt this guidance effective October 1, 2023 using the modified retrospective approach for all financial assets measured at amortized cost, including loans, available-for-sale debt securities and unfunded commitments. The Company expects to record a cumulative effect increase to retained earnings related to on-balance sheet exposures (loans receivable) and a decrease to retained earnings related to off-balance sheet exposures (unfunded loan commitments). The Company determined that there was no impact to retained earnings related to available-for-sale or held-to-maturity debt securities as a result of adopting this guidance.\nIn January 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting, March 2020, to provide temporary optional expedients and exceptions to the U.S. GAAP guidance on contract modifications and hedge accounting to ease the financial reporting burdens of the expected market transition from LIBOR and other interbank offered rates to alternative reference rates, such as the Secured Overnight Financing Rate. Entities can elect not to apply certain modification accounting requirements to contracts affected by what the guidance calls reference rate reform if certain criteria are met. An entity that makes this election would not have to re-measure the contracts at the modification date or reassess a previous accounting determination. Also, entities can elect various optional expedients that would allow them to continue applying hedge accounting for hedging relationships affected by reference rate reform if certain criteria are met, and can make a one-time election to sell and/or reclassify held-to-maturity debt securities that reference an interest rate affected by reference rate reform. The sunset provision included in Topic 848 was based on the expectations of when LIBOR would cease being published. In March 2021, the UK Financial Conduct Authority announced that the intended cessation date of LIBOR would be June 30, 2023, which is beyond the established sunset date of Topic 848. In December 2022, the FASB issued ASU 2022-06, Reference Rate Reform (Topic 848): Deferral of the Sunset Date of Topic 848. The amendments in this ASU provide temporary relief by deferring the sunset date provision included in Topic 848. The amendments in ASU 2022-06 defer the effective date for all entities upon issuance through December 31, 2024. These updates are not expected to have a significant impact on the Companys financial statements.\nIn March 2022, the FASB issued ASU 2022-02, Financial Instruments-Credit Losses (Topic 326): Troubled Debt Restructurings and Vintage Disclosures. The amendments in this ASU eliminate the accounting guidance for troubled debt restructurings (TDRs) by creditors in Subtopic 310-40, Receivables-Troubled Debt Restructurings by Creditors, while enhancing disclosure requirements for certain loan refinances and restructurings by creditors when a borrower is experiencing financial difficulty. In addition, for public business entities, the amendments in this ASU require that an entity disclose current-period gross write-offs by year of origination for financing receivables and net investments in leases within the scope of Subtopic 326-20, Financial Instruments-Credit Losses-Measured at Amortized Cost. For entities that have not yet adopted the amendments in Update 2016-13, which is discussed in greater detail above, the effective dates for the amendments in this update are the same as the effective dates in Update 2016-13. These updates are not expected to have a significant impact on the Companys financial statements, other than enhanced disclosure.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\n18. Subsequent Events\nOn October 30, 2023, the Company announced that its Board of Directors has approved a quarterly cash dividend of $0.04 per common share to shareholders of record at the close of business on November 9, 2023, payable on November 24, 2023.\nOn November 15, 2023, the Company declared a special dividend of $0.07 per common share, payable on December 12, 2023, to shareholders of record at the close of business on November 28, 2023.\nNOTE C - STOCK-BASED COMPENSATION AND STOCK REPURCHASE PROGRAM\nThe Company follows FASB ASC Section 718, Compensation-Stock Compensation, which covers a wide range of share-based compensation arrangements including share options, restricted share plans, performance-based awards, share appreciation rights, and employee share purchase plans. ASC 718 requires that compensation cost relating to share-based payment transactions be recognized in financial statements. The cost is measured based on the fair value of the equity or liability instruments issued.\nASC 718 also requires the Company to realize as a financing cash flow rather than an operating cash flow, as previously required, the benefits of realized tax deductions in excess of previously recognized tax benefits on compensation expense. In accordance with SEC Staff Accounting Bulletin (SAB) No. 107, the Company classified share-based compensation for employees and outside directors within compensation and employee benefits in the Consolidated Statements of Income to correspond with the same line item as the cash compensation paid.\nStock options generally vest over a five-year service period and expire ten years from issuance. Management recognizes compensation expense for all option grants over the awards respective requisite service periods. The fair values of all option grants were estimated using the Black-Scholes option-pricing model. Since there was limited historical information on the volatility of the Companys stock, management also considered the average volatilities of similar entities for an appropriate period in determining the assumed volatility rate used in the estimation of fair value. Management estimated the expected life of the options using the simplified method allowed under SAB No. 107. The seven-year Treasury yield in effect at the time of the grant provided the risk-free rate for periods within the contractual life of the option. Management recognizes compensation expense for the fair values of these awards, which have graded vesting, on a straight-line basis over the requisite service period of the awards. Management estimated a 95% retention rate for stock option recipients. Once vested, these awards are irrevocable. Shares will be obtained from either the open market or treasury stock upon share option exercise.\nRestricted shares generally vest over a five-year service period on the anniversary of the grant date. Once vested, these awards are irrevocable. The product of the number of shares granted and the grant date market price of the Companys common stock determine the fair value of restricted shares under the Companys restricted stock plans. Management recognizes compensation expense for the fair value of restricted shares on a straight-line basis over the requisite service period.\nOn August 25, 2022, the Company adopted the 2022 Equity Compensation Plan which provided for grants of up to 547,400 shares to be allocated between incentive and non-qualified stock options and restricted stock awards to officers, employees and directors of the Company and Magyar Bank. At September 30, 2023, 293,200 options and 156,400 shares of restricted stock had been awarded from the plan.\nThe following is a summary of the status of the Companys stock option activity and related information for its option plan for the year ended September 30, 2023:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nShares Weighted\nAverage\nExercise Price Weighted\nAverage\nRemaining\nContractual Life\nin Years Aggregate\nIntrinsic\nValue\nBalance at September 30, 2022 293,200 $ 12.58 9.98 $ -\nGranted -\n-\n-\n-\nExercised -\n-\n-\n-\nForfeited -\n-\n-\n-\nExpired -\n-\n-\n-\nBalance at September 30, 2023 293,200 $ 12.58 8.98 $ -\nExercisable at September 30, 2023 58,640 $ 12.58 8.98 $ -\nThe following is a summary of the status of the Companys non-vested restricted shares as of September 30, 2023 and 2022, and changes during those years:\nShares Weighted\nAverage Grant\nDate Fair Value\nBalance at September 30, 2022 156,400 $ 12.63\nGranted -\n-\nVested (32,080 ) 12.63\nForfeited -\n-\nBalance at September 30, 2023 124,320 $ 12.63\nStock option and stock award expenses included with compensation expense were $259,000 and $405,000, respectively, for the year ended September 30, 2023. Stock option and stock award expenses included with compensation expense were $0 and $6,000, respectively, for the year ended September 30, 2022. The Company had no other stock-based compensation plans as of September 30, 2023 except as disclosed below.\nThe Company has an Employee Stock Ownership Plan (\"ESOP\") for the benefit of employees who meet certain eligibility requirements. The ESOP trust purchases shares of common stock in the open market using proceeds of a loan from the Company. The loan is secured by shares of the Companys stock. The Bank makes cash contributions to the ESOP on an annual basis sufficient to enable the ESOP to make the required loan payments to the Company. As the debt is repaid, shares are released as collateral and allocated to qualified employees. Accordingly, the shares pledged as collateral are reported as unearned ESOP shares in the Consolidated Balance Sheets. The Company accounts for its ESOP in accordance with FASB ASC Topic 718, Employers Accounting for Employee Stock Ownership Plans. As shares are released from collateral, the Company reports compensation expense equal to the current market price of the shares, and the shares become outstanding for earnings per share computations.\nIn connection with the Companys second-step stock offering, the ESOP trustees purchased, 8% of the shares of the Company common stock sold in the offering, or 312,800 shares, in the open market for $3.4 million, reflecting an average cost per share of $10.77. The ESOP loan bears a variable interest rate that adjusts annually to Prime Rate (7.50% at January 1, 2023) with principal and interest payable annually in equal installments over 30 years.\nThe following table presents the components of the ESOP shares for the years ended September 30, 2023 and 2022:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nUnreleased shares at September 30, 2021 304,377\nShares released for allocation during the year ended September 30, 2022 (10,427 )\nShares purchased by ESOP trustee during the year ended September 30, 2022 8,423\nUnreleased shares at September 30, 2022 302,373\nShares released for allocation during the year ended September 30, 2023 (12,060 )\nShares purchased by ESOP trustee during the year ended September 30, 2023 -\nUnreleased shares at September 30, 2023 290,313\nTotal released shares 182,485\nTotal ESOP shares 472,798\nThe Company's contribution expense for the ESOP was $122,000 and $179,000 for years ended September 30, 2023 and 2022, respectively. The aggregate fair value of the unreleased ESOP shares at September 30, 2023 was approximately $3.0 million.\nOn December 8, 2022, the Company announced the completion of its third stock repurchase program, under which 354,891 shares had been repurchased at an average price of $12.90. The Company announced its fourth authorization of an additional stock repurchase plan pursuant to which the Company intends to repurchase up to an additional 5% of its outstanding shares, or up to 337,146 shares, under which 100,830 shares had been repurchased at an average price of $11.80. Under this stock repurchase program, 236,316 shares of the 337,146 shares authorized remained available for repurchase as of September 30, 2023. The Companys intended use of the repurchased shares is for general corporate purposes. The Company held treasury stock shares totaling 423,641 at September 30, 2023. The timing of the repurchases will depend on certain factors, including but not limited to, market conditions and prices, the Companys liquidity requirements and alternative uses of capital.\nNOTE D - INVESTMENT SECURITIES\nThe following table summarizes the amortized cost and fair values of securities classified as available-for-sale and held-to-maturity at September 30, 2023:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSeptember 30, 2023\nGross Gross\nAmortized Unrealized Unrealized Fair\nCost Gains Losses Value\n(In thousands)\nSecurities available-for-sale:\nObligations of U.S. government agencies:\nMortgage backed securities - residential $ 106 $ -\n$ (14 ) $ 92\nObligations of U.S. government-sponsored enterprises:\nMortgage-backed securities-residential 11,984 -\n(1,951 ) 10,033\nTotal securities available-for-sale $ 12,090 $ -\n$ (1,965 ) $ 10,125\nSecurities held-to-maturity:\nObligations of U.S. government agencies:\nMortgage-backed securities - residential $ 5,070 $ -\n$ (850 ) $ 4,220\nMortgage-backed securities - commercial 2,509 -\n(16 ) 2,493\nObligations of U.S. government-sponsored enterprises:\nMortgage backed securities - residential 48,086 -\n(8,480 ) 39,606\nDebt securities 23,497 -\n(1,947 ) 21,550\nPrivate label mortgage-backed securities - residential -\n(12 )\nObligations of state and political subdivisions 3,466 -\n(605 ) 2,861\nCorporate securities 3,000 -\n(197 ) 2,803\nTotal securities held-to-maturity $ 85,835 $ -\n$ (12,107 ) $ 73,728\nTotal investment securities $ 97,925 $ -\n$ (14,072 ) $ 83,853\nThe following table summarizes the amortized cost and fair values of securities classified as available-for-sale and held-to-maturity at September 30, 2022:\nSeptember 30, 2022\nGross Gross\nAmortized Unrealized Unrealized Fair\nCost Gains Losses Value\n(In thousands)\nSecurities available-for-sale:\nObligations of U.S. government agencies:\nMortgage backed securities - residential $ 118 $ -\n$ (11 ) $ 107\nObligations of U.S. government-sponsored enterprises:\nMortgage-backed securities-residential 11,029 -\n(1,907 ) 9,122\nTotal securities available-for-sale $ 11,147 $ -\n$ (1,918 ) $ 9,229\nSecurities held-to-maturity:\nObligations of U.S. government agencies:\nMortgage-backed securities - residential $ 5,525 $ -\n$ (717 ) $ 4,808\nMortgage-backed securities - commercial -\n-\nObligations of U.S. government-sponsored enterprises:\nMortgage backed securities - residential 48,961 (7,548 ) 41,425\nDebt securities 24,821 -\n(2,395 ) 22,426\nPrivate label mortgage-backed securities - residential -\n(10 )\nObligations of state and political subdivisions 3,484 -\n(638 ) 2,846\nCorporate securities 8,000 -\n(436 ) 7,564\nTotal securities held-to-maturity $ 91,646 $ 12 $ (11,744 ) $ 79,914\nTotal investment securities $ 102,793 $ 12 $ (13,662 ) $ 89,143\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nThe contractual maturities of mortgage-backed securities generally exceed 10 years, however, the effective lives are expected to be shorter due to anticipated prepayments. At September 30, 2023, the available-for-sale mortgage-backed securities-residential included obligations of U.S. government agencies issued by the Government National Mortgage Association with an amortized cost of $106,000 and a fair value of $92,000 and obligations of U.S. government-sponsored enterprises issued by Federal National Mortgage Association and Federal Home Loan Mortgage Corporation with an amortized cost of $12.0 million and a fair value of $10.0 million. At September 30, 2023, the held-to-maturity mortgage-backed securities-residential included obligations of U.S. government agencies issued by the Government National Mortgage Association with an amortized cost of $5.1 million and a fair value of $4.2 million and obligations of U.S. government-sponsored enterprises issued by Federal National Mortgage Association and Federal Home Loan Mortgage Corporation with an amortized cost of $48.1 million and a fair value of $39.6 million.\nThe maturities of debt securities, municipal bonds and certain information regarding mortgage-backed securities held-to-maturity at September 30, 2023 are summarized in the following table:\nSeptember 30, 2023\nAmortized Fair\nCost Value\n(In thousands)\nDue within 1 year $ 6,498 $ 6,393\nDue after 1 but within 5 years 18,526 16,900\nDue after 5 but within 10 years 4,939 3,921\nDue after 10 years -\n-\nTotal debt securities 29,963 27,214\nMortgage backed securities:\nResidential 53,363 44,021\nCommercial 2,509 2,493\nTotal $ 85,835 $ 73,728\nThere were no sales of securities during the years ended September 30, 2023 and 2022.\nAs of September 30, 2023 and 2022, investment securities having an estimated fair value of approximately $12.0 million and $37.7 million, respectively, were pledged to secure public deposits.\nDetails of securities with unrealized losses at September 30, 2023 and 2022 are as follows:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nLess Than 12 Months 12 Months Or Greater Total\nNumber of Fair Unrealized Fair Unrealized Fair Unrealized\nSecurities Value Losses Value Losses Value Losses\n(Dollars in thousands)\nSeptember 30, 2023\nObligations of U.S. government agencies:\nMortgage-backed securities - residential $ -\n$ -\n$ 4,312 $ (864 ) $ 4,312 $ (864 )\nMortgage-backed securities - commercial 1,926 (14 ) (2 ) 2,493 (16 )\nObligations of U.S. government-sponsored enterprises\nMortgage-backed securities - residential 4,938 (49 ) 44,485 (10,382 ) 49,423 (10,431 )\nDebt securities -\n-\n21,550 (1,947 ) 21,550 (1,947 )\nPrivate label mortgage-backed securities residential -\n-\n(12 ) (12 )\nObligations of state and political subdivisions (43 ) 2,072 (562 ) 2,861 (605 )\nCorporate securities -\n-\n2,803 (197 ) 2,803 (197 )\nTotal $ 7,653 $ (106 ) $ 75,984 $ (13,966 ) $ 83,637 $ (14,072 )\nSeptember 30, 2022\nObligations of U.S. government agencies:\nMortgage-backed securities- residential $ 2,364 $ (140 ) $ 2,551 $ (588 ) $ 4,915 $ (728 )\nMortgage-backed securities - commercial -\n-\n-\n-\nObligations of U.S. government-sponsored enterprises\nMortgage backed securities- residential 21,180 (2,795 ) 29,088 (6,660 ) 50,268 (9,455 )\nDebt securities 11,664 (660 ) 10,763 (1,735 ) 22,427 (2,395 )\nPrivate label mortgage-backed securities- residential (10 ) -\n-\n(10 )\nObligations of state and political subdivisions 1,268 (181 ) 1,577 (457 ) 2,845 (638 )\nCorporate securities 2,646 (353 ) 4,917 (83 ) 7,563 (436 )\nTotal $ 39,968 $ (4,139 ) $ 48,896 $ (9,523 ) $ 88,864 $ (13,662 )\nThe investment securities listed above currently have fair values less than amortized cost and therefore contain unrealized losses. The Company evaluated these securities and determined that the decline in value was primarily related to fluctuations in the interest rate environment and were not related to any company or industry specific event.\nThe Company anticipates full recovery of amortized costs with respect to these securities. The Company does not intend to sell these securities and has determined that it is not more likely than not that the Company would be required to sell these securities prior to maturity or market price recovery. Management has considered factors regarding other than temporarily impaired securities and determined that there are no securities with impairment that is other than temporary as of September 30, 2023 and 2022.\nNOTE E - LOANS RECEIVABLE, NET\nLoans receivable are comprised of the following:\nSeptember 30,\n(In thousands)\nOne-to four-family residential $ 237,683 $ 214,377\nCommercial real estate 389,134 342,791\nConstruction 21,853 15,230\nHome equity lines of credit 16,983 18,704\nCommercial business 30,194 34,672\nOther 2,359 3,130\nTotal loans receivable 698,206 628,904\nNet deferred loan costs (806 ) (628 )\nAllowance for loan losses (8,330 ) (8,433 )\nTotal loans receivable, net $ 689,070 $ 619,843\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nCertain directors and executive officers of the Company have loans with the Bank. Such loans were made in the ordinary course of business at the Banks normal credit terms, including interest rate and collateralization, and do not represent more than a normal risk of collection. Total loans receivable from directors and executive officers, and affiliates thereof, were approximately $5.1 million at September 30, 2023 and $2.3 million at September 30, 2022. There were $2.9 million and $738,000 in new loans or advances on existing lines of credit during the year ended September 30, 2023 and 2022, respectively. Total principal repayments were approximately $142,000 and $731,000 for the year ended September 30, 2023 and 2022, respectively.\nAt September 30, 2023 and 2022, the Company was servicing loans for others amounting to approximately $48.1 million and $43.6 million, respectively. The Company held mortgage servicing rights in the amount of $28,000 and $0 at September 30, 2023 and 2022, respectively. Servicing loans for others generally consists of collecting mortgage payments, maintaining escrow accounts, disbursing payments to investors, and foreclosure processing. Loan servicing income is recorded on the cash basis and includes servicing fees from investors and certain charges collected from borrowers, such as late payment fees. In connection with loans serviced for others, the Company held borrowers escrow balances of approximately $27,000 at September 30, 2023 and 2022.\nThe segments of the Banks loan portfolio are disaggregated to a level that allows management to monitor risk and performance. The residential mortgage loan segment is further disaggregated into two classes: first lien, amortizing term loans, and the combination of second lien amortizing term loans and home equity lines of credit. The commercial loan segment is further disaggregated into three classes: loans secured by multifamily structures, loans secured by owner-occupied commercial structures, and loans secured by non-owner occupied nonresidential properties. The construction loan segment consists primarily of developers or investors for the purpose of acquiring, developing and constructing residential or commercial structures and to a lesser extent one-to-four family residential construction loans made to individuals for the acquisition of and/or construction on a lot or lots on which a residential dwelling is to be built. Construction loans to developers and investors have a higher risk profile because the ultimate buyer, once development is completed, is generally not known at the time of the loan. The commercial business loan segment consists of loans made for the purpose of financing the activities of commercial customers and consists primarily of revolving lines of credit. The consumer loan segment consists primarily of stock-secured installment loans, but also includes unsecured personal loans and overdraft lines of credit connected with customer deposit accounts.\nManagement evaluates individual loans in all segments for possible impairment if the loan either is in nonaccrual status, or is risk rated Substandard and is 90 days or more past due. Loans are considered to be impaired when, based on current information and events, it is probable that the Company will be unable to collect the scheduled payments of principal or interest when due according to the contractual terms of the loan agreement. Factors considered by management in evaluating impairment include payment status, collateral value, and the probability of collecting scheduled principal and interest payments when due. Management determines the significance of payment delays and payment shortfalls on a case-by-case basis, taking into consideration all of the circumstances surrounding the loan and the borrower, including the length of the delay, the reasons for the delay, the borrowers prior payment record, and the amount of the shortfall in relation to the principal and interest owed.\nOnce the determination has been made that a loan is impaired, the recorded investment in the loan is compared to the fair value of the loan using one of three methods: (a) the present value of expected future cash flows discounted at the loans effective interest rate; (b) the loans current observable market price; or (c) the fair value of the collateral securing the loan, less anticipated selling and disposition costs. The method is selected on a loan-by loan basis, with management primarily utilizing the fair value of collateral method. If there is a shortfall between the fair value of the loan and the recorded investment in the loan, the Company charges the difference to the allowance for loan loss as a charge-off and carries the impaired loan on its books at fair value. It is the Companys policy to evaluate impaired loans on an annual basis to ensure the recorded investment in a loan does not exceed its fair value.\nThe following table presents impaired loans by class, segregated by those for which a specific allowance was required and those for which a specific allowance was not necessary for the periods presented:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nImpaired Loans\nImpaired Loans with with No Specific\nSpecific Allowance Allowance Total Impaired Loans\nUnpaid\nAt and for the year ended Recorded Related Recorded Recorded Principal\nSeptember 30, 2023 Investment Allowance Investment Investment Balance\n(In thousands)\nOne-to four-family residential $ -\n$ -\n$ 2,031 $ 2,031 $ 2,031\nCommercial real estate -\n-\n2,969 2,969 2,969\nConstruction -\n-\n2,474 2,474 2,539\nCommercial business -\n-\nTotal impaired loans $ -\n$ -\n$ 7,621 $ 7,621 $ 7,686\nAt and for the year ended\nSeptember 30, 2022\nOne-to four-family residential $ -\n$ -\n$ 1,512 $ 1,512 $ 1,512\nCommercial real estate -\n-\n1,159 1,159 1,159\nConstruction 2,835 -\n2,835 2,900\nCommercial business -\n-\nTotal impaired loans $ 2,835 $ 114 $ 2,824 $ 5,659 $ 5,724\nThe average recorded investment in impaired loans was $5.9 million and $8.1 million for the years ended September 30, 2023 and 2022, respectively. During the years ended September 30, 2023 and 2022, interest income of $96,000 and $135,000, respectively, was recognized for performing TDR loans while no interest income was recognized for delinquent non-accrual loans.\nManagement uses a ten point internal risk rating system to monitor the credit quality of the overall loan portfolio. The first six categories are considered not criticized, and are aggregated as Pass rated. The criticized rating categories utilized by management generally follow bank regulatory definitions. The Special Mention category includes assets that are currently protected but are potentially weak, resulting in an undue and unwarranted credit risk, but not to the point of justifying a Substandard classification. Loans in the Substandard category have well-defined weaknesses that jeopardize the liquidation of the debt, and have a distinct possibility that some loss will be sustained if the weaknesses are not corrected. All loans greater than three months past due are considered Substandard. Any portion of a loan that has been charged off is placed in the Loss category.\nTo help ensure that risk ratings are accurate and reflect the present and future capacity of borrowers to repay a loan as agreed, the Bank has a structured loan rating process with several layers of internal and external oversight. Generally, consumer and residential mortgage loans are included in the Pass categories unless a specific action, such as severe delinquency, bankruptcy, repossession, or death occurs to raise awareness of a possible credit event. The Banks Commercial Loan Officers are responsible for the timely and accurate risk rating of the loans in their portfolios at origination and on an ongoing basis. The Asset Review Committee performs monthly reviews of all commercial relationships internally rated 6 (Watch) or worse. Confirmation of the appropriate risk grade is performed by an external loan review company that semi-annually reviews and assesses loans within the portfolio. Generally, the external consultant reviews commercial relationships greater than $500,000 and/or criticized relationships greater than $250,000. Detailed reviews, including plans for resolution, are performed on loans classified as Substandard on a monthly basis.\nThe following tables present the classes of the loan portfolio summarized by the aggregate Pass and the criticized categories of Special Mention, Substandard and Doubtful within the Banks internal risk rating system for the periods presented:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSpecial\nPass Mention Substandard Doubtful Total\n(In thousands)\nSeptember 30, 2023\nOne-to four-family residential $ 236,876 $ -\n$ 807 $ -\n$ 237,683\nCommercial real estate 386,794 2,224 -\n389,134\nConstruction 19,379 -\n2,474 -\n21,853\nHome equity lines of credit 16,983 -\n-\n-\n16,983\nCommercial business 30,194 -\n-\n-\n30,194\nOther 2,359 -\n-\n-\n2,359\nTotal $ 692,585 $ 116 $ 5,505 $ -\n$ 698,206\nSeptember 30, 2022\nOne-to four-family residential $ 213,173 $ 980 $ 224 $ -\n$ 214,377\nCommercial real estate 342,593 -\n-\n342,791\nConstruction 10,652 -\n4,578 -\n15,230\nHome equity lines of credit 18,704 -\n-\n-\n18,704\nCommercial business 34,672 -\n-\n-\n34,672\nOther 3,130 -\n-\n-\n3,130\nTotal $ 622,924 $ 1,178 $ 4,802 $ -\n$ 628,904\nManagement further monitors the performance and credit quality of the loan portfolio by analyzing the age of the portfolio as determined by the length of time a recorded payment is past due. The following tables present the classes of the loan portfolio summarized by the aging categories of performing loans and nonaccrual loans for the periods presented:\n30-59 60-89\nDays Days 90 Days + Total Non- Total\nCurrent Past Due Past Due Past Due Past Due Accrual Loans\n(In thousands)\nSeptember 30, 2023\nOne-to four-family residential $ 236,729 $ -\n$ 568 $ 386 $ 954 $ 386 $ 237,683\nCommercial real estate 386,794 -\n2,224 2,340 2,224 389,134\nConstruction 19,379 -\n-\n2,474 2,474 2,474 21,853\nHome equity lines of credit 16,983 -\n-\n-\n-\n-\n16,983\nCommercial business 30,047 -\n-\n-\n30,194\nOther 2,359 -\n-\n-\n-\n-\n2,359\nTotal $ 692,291 $ 147 $ 684 $ 5,084 $ 5,915 $ 5,084 $ 698,206\n30-59 60-89\nDays Days 90 Days + Total Non- Total\nCurrent Past Due Past Due Past Due Past Due Accrual Loans\n(In thousands)\nSeptember 30, 2022\nOne-to four-family residential $ 213,903 $ 300 $ 174 $ -\n$ 474 $ -\n$ 214,377\nCommercial real estate 342,404 -\n-\n-\n342,791\nConstruction 12,395 -\n-\n2,835 2,835 2,835 15,230\nHome equity lines of credit 18,704 -\n-\n-\n-\n-\n18,704\nCommercial business 34,672 -\n-\n-\n-\n-\n34,672\nOther 3,130 -\n-\n-\n-\n-\n3,130\nTotal $ 625,208 $ 300 $ 561 $ 2,835 $ 3,696 $ 2,835 $ 628,904\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nThe amount of interest income not recognized on non-accrual loans was approximately $309,000 and $220,000 for the years ended September 30, 2023 and 2022, respectively. At September 30, 2023 and September 30, 2022, there were no commitments to lend additional funds to borrowers whose loans are classified as non-accrual.\nAn allowance for loan losses (ALL) is maintained to absorb losses from the loan portfolio. The ALL is based on managements continuing evaluation of the risk characteristics and credit quality of the loan portfolio, assessment of current economic conditions, diversification and size of the portfolio, adequacy of collateral, past and anticipated loss experience, and the amount of non-performing loans.\nThe Banks methodology for determining the ALL is based on the requirements of ASC Section 310-10-35 for loans individually evaluated for impairment (discussed above) and ASC Subtopic 450-20 for loans collectively evaluated for impairment, as well as the Interagency Policy Statements on the Allowance for Loan and Lease Losses and other bank regulatory guidance.\nLoans that are collectively evaluated for impairment are analyzed with general allowances being made as appropriate. For general allowances, historical loss trends are used in the estimation of losses in the current portfolio. These historical loss amounts are modified by other qualitative and economic factors.\nThe loans are segmented into classes based on their inherent varying degrees of risk, as described above. Management tracks the historical net charge-off activity by segment and utilizes this figure, as a percentage of the segment, as the general reserve percentage for pooled, homogenous loans that have not been deemed impaired. Typically, an average of losses incurred over five historical years is used.\nNon-impaired credits are segregated for the application of qualitative factors. Management has identified a number of additional qualitative factors which it uses to supplement the historical charge-off factor because these factors are likely to cause estimated credit losses associated with the existing loan pools to differ from historical loss experience. The additional factors that are evaluated quarterly and updated using information obtained from internal, regulatory, and governmental sources are: national and local economic trends and conditions; levels of and trends in delinquency rates and non-accrual loans; trends in volumes and terms of loans; effects of changes in lending policies; experience, ability, and depth of lending staff; value of underlying collateral; and concentrations of credit from a loan type, industry and/or geographic standpoint. Management maintained or increased several of these factors during the year ended September 30, 2023 due to the higher risk of credit loss resulting from the a higher likelihood of economic recession and its ongoing impact on borrowers.\nManagement reviews the loan portfolio on a quarterly basis using a defined, consistently applied process in order to make appropriate and timely adjustments to the ALL. When information confirms all or part of specific loans to be uncollectible, these amounts are promptly charged off against the ALL. Since loans individually evaluated for impairment are promptly written down to their fair value, typically there is no portion of the ALL for loans individually evaluated for impairment.\nThe following tables summarize the activity in the allowance for loan losses by loan category for the years ended September 30, 2023 and 2022:\nOne-to Four-\nHome Equity\nFamily Commercial\nLines of Commercial\nResidential Real Estate Construction Credit Business Other Unallocated Total\n(In thousands)\nBalance-September 30, 2022 $ 1,223 $ 4,612 $ 461 $ 263 $ 1,484 $ 1 $ 389 $ 8,433\nCharge-offs -\n-\n-\n-\n(488 ) -\n-\n(488 )\nRecoveries -\n-\n-\n-\n-\n-\nProvision (credit) (56 ) (57 ) (215 )\nBalance-September 30, 2023 $ 1,259 $ 5,277 $ 472 $ 207 $ 939 $ 2 $ 174 $ 8,330\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nOne-to Four-\nHome Equity\nFamily Commercial\nLines of Commercial\nResidential Real Estate Construction Credit Business Other Unallocated Total\n(In thousands)\nBalance-September 30, 2021 $ 1,136 $ 3,744 $ 594 $ 232 $ 2,046 $ 15 $ 308 $ 8,075\nCharge-offs -\n-\n-\n-\n-\n-\n-\n-\nRecoveries -\n-\n-\n-\n-\nProvision (credit) (133 ) (562 ) (14 )\nBalance-September 30, 2022 $ 1,223 $ 4,612 $ 461 $ 263 $ 1,484 $ 1 $ 389 $ 8,433\nThe following tables summarize the allowance for loan loss by loan category, segregated into the amount required for loans individually evaluated for impairment and the amount required for loans collectively evaluated for impairment as of September 30, 2023 and September 30, 2022:\nOne-to-Four\nHome Equity\nFamily Commercial\nLines of Commercial\nResidential Real Estate Construction Credit Business Other Unallocated Total\n(In thousands)\nBalance - September 30, 2023 $ 1,259 $ 5,277 $ 472 $ 207 $ 939 $ 2 $ 174 $ 8,330\nIndividually evaluated\nfor impairment -\n-\n-\n-\n-\n-\n-\n-\nCollectively evaluated\nfor impairment 1,259 5,277 2 8,330\nLoans receivable:\nBalance - September 30, 2023 $ 237,683 $ 389,134 $ 21,853 $ 16,983 $ 30,194 $ 2,359 $ -\n$ 698,206\nIndividually evaluated\nfor impairment 2,031 2,969 2,474 -\n-\n-\n7,621\nCollectively evaluated\nfor impairment 235,652 386,165 19,379 16,983 30,047 2,359 -\n690,585\nOne-to- Four\nHome Equity\nFamily Commercial\nLines of Commercial\nResidential Real Estate Construction Credit Business Other Unallocated Total\n(In thousands)\nBalance - September 30, 2022 $ 1,223 $ 4,612 $ 461 $ 263 $ 1,484 $ 1 $ 389 $ 8,433\nIndividually evaluated\nfor impairment -\n-\n-\n-\n-\n-\nCollectively evaluated\nfor impairment 1,223 4,612 1,484 8,319\nLoans receivable:\nBalance - September 30, 2022 $ 214,377 $ 342,791 $ 15,230 $ 18,704 $ 34,672 $ 3,130 $ -\n$ 628,904\nIndividually evaluated\nfor impairment 1,512 1,159 2,835 -\n-\n-\n5,659\nCollectively evaluated\nfor impairment 212,865 341,632 12,395 18,704 34,519 3,130 -\n623,245\nThe allowance for loan losses is based on estimates, and actual losses will vary from current estimates. Management believes that the segmentation of the loan portfolio into homogeneous pools and the related historical loss ratios and other qualitative factors, as well as the consistency in the application of assumptions, result in an ALL that is representative of the risk found in the components of the portfolio at any given date.\nA TDR is a loan that has been modified whereby the Bank has agreed to make certain concessions to a borrower to meet the needs of both the borrower and the Bank to maximize the ultimate recovery of a loan. TDR occurs when a borrower is experiencing, or is expected to experience, financial difficulties and the loan is modified using a modification that would otherwise not be granted to the borrower. The types of concessions granted generally included, but are not limited to interest rate reductions, limitations on the accrued interest charged, term extensions, and deferment of principal.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nA default on a troubled debt restructured loan for purposes of this disclosure occurs when a borrower is 90 days past due or a foreclosure or repossession of the applicable collateral has occurred. There was one TDR totaling $106,000 during the year ended September 30, 2023, compared with no TDR loans during the year ended September 30, 2022. All TDR loans were performing in accordance with their restructured terms as September 30, 2023. The following tables summarizes the TDRs during the years ended September 30, 2023 and 2022:\nNumber of Investment Before Investment After\nLoans TDR Modification TDR Modification\n(Dollars in thousands)\nSeptember 30, 2023\nOne-to four-family residential $ 97 $ 106\nTotal $ 97 $ 106\nSeptember 30, 2022\nTotal -\n$ -\n$ -\nTotal loans pledged as collateral against Federal Home Loan Bank of New York (FHLBNY) borrowings were $341.6 million and $181.2 million as of September 30, 2023 and 2022, respectively.\nNOTE F - PREMISES AND EQUIPMENT\nPremises and equipment consist of the following:\nEstimated September 30,\nUseful Lives\n(In thousands)\nLand Indefinite $ 3,811 $ 3,811\nBuildings and improvements 10-40 years 21,923 21,866\nFurniture, fixtures and equipment 5-10 years 3,860 3,762\n29,594 29,439\nLess accumulated depreciation\n(16,255 ) (15,559 )\nPremises and equipment, net\n$ 13,339 $ 13,880\nFor the years ended September 30, 2023 and 2022, depreciation expense included in occupancy expense amounted to approximately $840,000 and $839,000, respectively.\nNOTE G - OTHER REAL ESTATE OWNED\nThe Company held $328,000 of real estate owned properties at September 30, 2023 and $281,000 at September 30, 2022. The Company did not have any write-downs on these properties for the year ended September 30, 2023 and 2022. Further declines in real estate values may result in increased foreclosed real estate expense in the future. Routine holding costs are charged to expense as incurred and improvements to real estate owned that enhance the value of the real estate are capitalized.\nNOTE H - DEPOSITS\nA summary of deposits by type of account follows:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSeptember 30,\n(In thousands)\nDemand accounts $ 188,550 $ 182,417\nSavings accounts 62,168 81,850\nNOW accounts 115,182 98,643\nMoney market accounts 284,885 222,214\nCertificate of deposit 92,725 69,929\nRetirement accounts 11,943 12,680\nTotal deposits $ 755,453 $ 667,733\nThe current FDIC insurance limit on bank deposit accounts is $250,000. The aggregate amount of deposit accounts with a denomination of $250,000 or more was approximately $429.9 million at September 30, 2023 compared with $292.4 million at September 30, 2022. The aggregate amount of certificate deposits, including individual retirement accounts with balances of $250,000 or more was $5.3 million at September 30, 2023 compared with $3.6 million at September 30, 2022.\nAt September 30, 2023, certificates of deposit (including retirement accounts and brokered certificate deposit accounts) have contractual maturities as follows (in thousands):\nYear Ending September 30,\n$ 43,776\n34,328\n6,290\n1,687\n14,923\n2029 and after 3,664\nTotal $ 104,668\nIncluded with the certificates of deposit were $13.8 million and $6.0 million in brokered certificates of deposit at September 30, 2023 and 2022, respectively.\nNOTE I - BORROWINGS\n1. Federal Home Loan Bank of New York Advances\nLong term FHLBNY advances at September 30, 2023 and September 30, 2022 totaled approximately $29.5 million and $15.6 million, respectively. The weighted average interest rates on advances outstanding at September 30, 2023 and 2022 were 3.27% and 2.48%, respectively. The advances were collateralized by unencumbered qualified assets consisting of one-to-four family residential and commercial real estate mortgage loans. Advances are made pursuant to several different credit programs offered from time to time by the FHLBNY.\nLong term FHLBNY advances as of September 30, 2023 mature as follows (in thousands):\nYear Ending September 30,\n$ 4,384\n3,500\n1,631\n6,000\n14,000\nThereafter -\nTotal $ 29,515\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nAdditionally, the Company has established an Overnight Line of Credit arrangement with the FHLBNY. The total amount available under the line of credit is based on the amount of eligible collateral pledged to the FHLBNY. At September 30, 2023 and 2022, the Company had available credit from the FHLBNY totaling $122.2 million and $83.2 million, respectively. Information concerning short-term arrangement with the FHLBNY is summarized as follows:\nSeptember 30,\n(Dollars in thousands)\nBalance at end of year $ -\n$ -\nWeighted average balance during the year $ 1,283 $ 33\nMaximum month-end balance during the year $ 16,450 $ 2,450\nAverage interest rate during the year 4.65% 2.67%\n2. Securities Sold Under Reverse Repurchase Agreements\nQualifying repurchase agreements are treated as financings and are reflected as a liability in the Consolidated Balance Sheets. The Company did not have repurchase agreements outstanding at September 30, 2023 and September 30, 2022.\nNOTE J - SERVICING POLICY\nThe Company originates and sells loans receivable secured by one-to four-family residential properties and commercial business loans guaranteed by the Small Business Administration (the SBA). The Company has sold loans on a servicing retained basis and on a servicing released basis. Loans sold with servicing retained and servicing released during the year ended September 30, 2023 were $6.5 million and $0, respectively. Loans sold with servicing retained and servicing released during the year ended September 30, 2022 were $10.5 million and $0, respectively. The Company accounts for sales in accordance with ASC 860, Transfers and Servicing. Upon sale, the receivables are removed from the balance sheet, mortgage servicing rights are recorded as an asset for servicing rights retained, and a gain on sale, if applicable, is recognized for the difference between the carrying value of the receivables and the sales proceeds, net of origination costs.\nGains on sales of loans, representing the difference between the total sales price received for the loans and the allocated cost of the loans, are recognized when loans are sold and delivered to the purchasers. Loans are accounted for as sold when control of the loan is surrendered. Control over the loans is deemed surrendered when (1) the loans have been isolated from the Company, (2) the buyer has the right (free of conditions that constrain it from taking advantage of that right) to pledge or exchange the loans and (3) the Company does not maintain effective control over the loans through either (a) an agreement that entitles and obligates the Company to repurchase or redeem the loans before maturity, or (b) the ability to unilaterally cause the buyer to return specific loans.\nThe Company services one-to-four family residential mortgage loans and SBA 7(a) loans for investors in the secondary market, which are not included in the Consolidated Balance Sheets. The Companys fee is a percentage of the principal balance and is recognized as income when received. At September 30, 2023 and 2022, the Company was servicing mortgage loans sold in the amount of $1.9 million and $2.1 million, respectively, and SBA loans sold in the amount of $35.5 million and $32.0 million, respectively. Loan servicing includes collecting and remitting loan payments, accounting for principal and interest, contacting delinquent mortgagors, supervising foreclosures and property dispositions in the event of unremedied defaults, making certain insurance and tax payments on behalf of the borrowers and generally administering the loans. Mortgage servicing rights are amortized in proportion to, and over the period of, estimated net servicing revenues and are included in other assets on the Consolidated Balance Sheets. Activity in loan servicing rights during the years ended September 30, 2023 and 2022 are summarized as follows:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSeptember 30,\n(In thousands)\nBeginning balance $ -\n$ 4\nOrigination of mortgage servicing rights -\nAmortization -\n(4 )\nEnding balance $ 28 $ -\nLoan servicing rights are carried at the lower of amortized cost or fair value. Fair values are estimated using discounted cash flows based on a current market interest rate.\nNOTE K - INCOME TAXES\nThe Companys income tax expense is comprised of the following components for the years ended September 30, 2023 and 2022:\nSeptember 30,\n(In thousands)\nCurrent $ 3,647 $ 3,163\nDeferred (615 )\nTotal income tax expense $ 3,032 $ 3,250\nA reconciliation of income tax at the statutory tax rate to the effective income tax expense for the years ended September 30, 2023 and 2022 is as follows:\nSeptember 30,\n(In thousands)\nIncome tax expense at statutory rate $ 2,256 $ 2,339\nIncrease (decrease) resulting from:\nState income taxes, net of federal income tax benefit\nTax-exempt income, net (90 ) (87 )\nNondeductible expenses\nShare based compensation -\nEmployee stock ownership plan\nOther, net (188 )\nTotal income tax expense $ 3,032 $ 3,250\nThe major sources of temporary differences and their deferred tax effect at September 30, 2023 and 2022 are as follows:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSeptember 30,\n(In thousands)\nAllowance for loan losses $ 2,342 $ 2,369\nNet unrealized loss, investment securities available-for-sale\nDeferred loan fees\nUnrealized loss, minimum pension liability\nEmployee benefits -\nAllowance for transaction expense -\nStraight line rent\nGross deferred tax asset 3,592 3,461\nDepreciation (588 ) (816 )\nEmployee benefits -\n(122 )\nMortgage servicing rights (8 ) -\nGross deferred tax liability (596 ) (938 )\nNet deferred tax asset, included in other assets $ 2,996 $ 2,523\nIn assessing the realizability of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which temporary differences are deductible and carry forwards are available.\nThere were no valuation allowances for the year ended September 30, 2023 and 2022. The Company has considered future market growth, forecasted earnings, future taxable income, feasible and permissible tax planning strategies in determining the realizability of deferred tax assets. If the Company was to determine that it would not be able to realize a portion of its net deferred tax asset in the future for which there is currently no valuation allowance, an adjustment to the net deferred tax asset would be charged to earnings in the period such determination was made.\nThe Banks statutory income tax rate in the State of New Jersey was 9.0% for the years ending September 30, 2023 and 2022. The State of New Jersey has imposed a temporary surtax on corporations earning New Jersey allocated income in excess of $1 million. The surtax is set at a rate of 2.5% and it currently effective through December 31, 2023. Accordingly, the Company used an 11.5% State tax rate for the calculation of its State income tax expense the years ended September 30, 2023 and 2022.\nNOTE L - PENSION PLAN\nThe Company had a noncontributory defined benefit pension plan (the Plan) covering all eligible employees. On January 26, 2006, the Plan was frozen and amended to eliminate future benefit accruals after February 15, 2006.\nPlan assets are invested in seven diversified investment funds of the Pentegra Retirement Trust, a no load series open-ended mutual fund. The long-term investment objective is to be invested 65% in equity securities (equity mutual funds) and 35% in debt securities (bond mutual funds). Asset rebalancing is performed at least annually, with interim adjustments made when the investment mix varies more than 5% from the target (i.e., a 10% target range). Risk/volatility is further managed by the distinct investment objectives of each of the funds and the diversification within each fund.\nThe following table sets forth the Plans funded status and amounts recognized in the Companys Consolidated Balance Sheets at September 30, 2023 and September 30, 2022.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSeptember 30,\n(In thousands)\nActuarial present value of benefit obligations $ 3,495 $ 3,735\nChange in benefit obligations\nProjected benefit obligation, beginning $ 3,735 $ 4,926\nInterest cost\nActuarial (gain) loss (181 ) (1,071 )\nAnnuity payments and lump sum distributions (249 ) (264 )\nProjected benefit obligation, end $ 3,495 $ 3,735\nChange in plan assets\nFair value of assets, beginning $ 3,886 $ 4,871\nActual return on plan assets (721 )\nAnnuity payments and lump sum distributions (249 ) (264 )\nFair value of assets, end $ 4,075 $ 3,886\nFunded status included with other assets $ 580 $ 151\nNet pension cost for the years ended September 30, 2023 and 2022 included the following components:\nSeptember 30,\n(In thousands)\nService cost benefits earned during the year $ -\n$ -\nInterest cost on projected benefit obligation\nExpected return on plan assets (226 ) (285 )\nAmortization of unrecognized net loss\nNet pension cost $ 86 $ 5\nFor the year ended September 30, 2023 and 2022, the weighted average discount rate used in determining the actuarial net periodic pension cost was 5.25% and 3.00%, respectively. For the year ended September 30, 2023 and 2022, the weighted average discount rate used in determining the actuarial present value of the projected benefit obligation was 5.75% and 5.25%, respectively.\nThe long-term rate-of-return-on-assets assumption was set based on historical returns earned by equities and fixed income securities, adjusted to reflect expectations of future returns as applied to the plans target allocation of asset classes. Equities and fixed income securities were assumed to earn rates of return in the ranges of 6-8% and 3-5%, respectively, with an assumed long-term inflation rate of 2.5% reflected within these ranges for the year ended September 30, 2023. When these overall return expectations are applied to the plans target allocation, the result is an expected rate of return of 5.0% to 7.0%. Accordingly, the expected long-term rates of return on assets were 6.00% for 2024 and 6.00% for 2023.\nCurrent Asset Allocation\nThe Plans weighted-average asset allocations at September 30, 2023 and 2022, by asset category are as follows:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSeptember 30,\nEquity securities 63% 68%\nDebt securities (bond mutual funds) 36% 31%\nOther (money market fund) 2% 1%\nTotal 100% 100%\nThe target asset allocation set for the assets of the Plan are in equity securities ranging from 50% to 75% and in debt securities ranging from 25% to 50%. In general, the Plan assets are investment securities that are well-diversified in terms of industry, capitalization and asset class. The Plan assets are mostly a mix of mutual funds indexed to the performance of Fortune 500 U.S. companies, debt securities held in bond funds, domestic and foreign common equity funds, and a money market fund. The Plans exposure to a concentration of credit risk is limited by the diversification of the investments into various investment options with multiple asset managers.\nExpected Contributions\nFor the fiscal year ending September 30, 2024, the Company does not expect to make a contribution to the Plan.\nEstimated Future Benefit Payments\nThe following benefit payments are expected to be paid as follows (in thousands):\nOctober 1, 2023 through September 30, 2024 $ 275\nOctober 1, 2024 through September 30, 2025\nOctober 1, 2025 through September 30, 2030\nOctober 1, 2026 through September 30, 2031\nOctober 1, 2027 through September 30, 2032\nOctober 1, 2028 through September 30, 2033 1,258\nTotal $ 2,616\nIncluded in the funded status of the Plan at September 30, 2023 and 2022, are actuarial losses of $440,000 and $956,000, respectively. These amounts are included, net of related income tax effects of $132,000 and $288,000, respectively, in the accumulated other comprehensive loss component of stockholders equity.\nThe following table presents the Plan assets that are measured at fair value on a recurring basis by level within the fair value hierarchy under ASC Topic 820. Financial assets are classified in their entirety based on the lowest level of input that is significant to the fair value measurement. See Note Q for further detail regarding fair value hierarchy.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nFair Value Measurements at Reporting Date Using:\nQuoted Prices Significant\nin Active Markets Other Significant\nfor Identical Observable Unobservable\nTotal Assets (Level 1) Inputs (Level 2) Inputs (Level 3)\n(In thousands)\nAt September 30, 2023\nInvestment Type\nMutual Funds - Equity\nLarge - Cap Value $ 682 $ 682 $ -\n$ -\nLarge - Cap Core -\n-\nMid - Cap Core -\n-\nSmall - Cap Core -\n-\nNon - U.S. Core -\n-\nMutual Funds - Fixed Income\nIntermediate Duration -\n-\nShort - Duration Corporate\nCash Equivalents\nMoney Market -\n-\nTotal Investment $ 4,075 $ 4,075 $ -\n$ -\nAt September 30, 2022\nInvestment Type\nMutual Funds - Equity\nLarge - Cap Value $ 638 $ 638 $ -\n$ -\nLarge - Cap Core -\n-\nMid - Cap Core -\n-\nSmall - Cap Core -\n-\nNon - U.S. Core -\n-\nMutual Funds - Fixed Income\nIntermediate Duration -\n-\nShort - Duration Corporate\nCash Equivalents\nMoney Market -\n-\nTotal Investment $ 3,886 $ 3,886 $ -\n$ -\nEquity and debt securities are reported at fair value in the table above utilizing exchange quoted prices in active markets for identical instruments (Level 1 inputs).\nNOTE M - NONQUALIFIED COMPENSATION PLAN\nThe Company maintains a Supplemental Executive Retirement Plan (SERP) for the benefit of its senior officers. In addition, the Company also adopted voluntary Deferred Income and Retirement Plans on behalf of its directors. The SERP provides the Company with the opportunity to supplement the retirement income of selected officers to achieve equitable wage replacement at retirement while the Deferred Income Plan provides participating directors with an opportunity to defer all or a portion of their fees into a tax deferred accumulation account for future retirement. The Director Retirement Plan enables the Company to reward its directors for longevity of service in consideration of their availability and consultation. The SERP is based upon achieving a total retirement benefit equal to a percentage of the participants final annual salary.\nUnder the Director Supplemental Retirement Income Plan (the Plan), directors that began service before 2002 are entitled to a benefit upon attainment of his/her benefit age. The directors will receive an annual amount in monthly installments based on his/her total Board and Committee fees in the twelve months prior to attainment of his/her benefit age. The amount will be 10% plus 2 1/2% for each year of service as a Director, with a minimum of 50%, provided the Director has served for at least five years, and a maximum of 60%. The maximum benefit increases for any Director serving as Chairman of the Board for at least five years to 75%.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nThe Company funds the plans through modified endowment contracts. Income recorded for the plans represents life insurance income as recorded based on the projected increases in cash surrender values of life insurance policies. As of September 30, 2023 and 2022, the Companys life insurance contracts had cash surrender values of approximately $18 million and $17.7 million, respectively.\nThe Company is recording benefit costs so that the cost of each participants retirement benefits is being expensed and accrued over the participants active employment so as to result in a liability at retirement date equal to the present value of the benefits expected to be provided. The total expense for nonqualified retirement benefits recorded during the year ended September 30, 2023 and 2022 was $375,000 and $424,000, respectively. Included in accounts payable and other liabilities at September 30, 2023 and 2022 were accrued retirement benefits totaling $828,000 and $630,000, respectively, for these plans.\nNOTE N - 401(K) EMPLOYEE CONTRIBUTION PLAN\nThe Company has a defined contribution 401(k) plan covering all employees, as defined under the plan document. Employees may contribute to the plan, as defined under the plan document, and the Company can make discretionary contributions. The Company contributed $257,000 and $271,000 to the plan for the years ended September 30, 2023 and 2022, and is included in compensation and employee benefits in the accompanying Consolidated Statements of Income.\nNOTE O - COMMITMENTS\n1. Lease Commitments\nAccounting Standard Update ASC 842, Leases requires lessees to recognize a lease liability and a right-of-use (ROU) asset, measured at the present value of the future minimum lease payments, at the lease commencement date.\nThe Company has operating leases for five branch locations. Our leases have remaining lease terms of up to 10 years, some of which include options to extend the leases for up to 10 additional years. Operating leases are recorded as ROU assets and lease liabilities and are included within Other assets and Accounts payable and other liabilities, respectively, on our Consolidated Balance Sheets.\nOperating lease ROU assets represent our right to use an underlying asset during the lease term and operating lease liabilities represent our obligation to make lease payments arising from the lease. ROU assets and lease liabilities are recognized at lease commencement base on the present value of the remaining lease payments using a discount rate that represents our incremental borrowing rate. The incremental borrowing rate used by the Company to value its operating leases is based on the interpolated term advance rate available from the FHLBNY, based on the remaining lease term.\nThe following table presents the balance sheet information related to our leases:\nSeptember 30, September 30,\n(Dollars in thousands)\nOperating lease right-of-use asset $ 2,687 $ 3,292\nOperating lease liabilities $ 2,944 $ 3,605\nWeighted average remaining lease term in years 6.4 7.0\nWeighted average discount rate 2.2% 2.2%\nThe following table summarizes the maturity of our remaining lease liabilities by year:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSeptember 30,\n(In thousands)\nFor the Year Ending:\n$ 747\n2029 and thereafter\nTotal lease payments 3,258\nLess imputed interest (314 )\nPresent value of lease liabilities $ 2,944\nTotal rental expense, included in occupancy expense, was approximately $809,000 and $807,000 for the years ended September 30, 2023 and 2022, respectively.\n2. Contingencies\nThe Company and its subsidiaries, from time to time, are a party to routine litigation that arises in the normal course of business. In the opinion of management, the resolution of this litigation, if any, would not have a material adverse effect on the Companys consolidated financial position or results of operations.\nNOTE P - FINANCIAL INSTRUMENTS WITH OFF-BALANCE-SHEET RISK\nThe Company may use derivative financial instruments, such as interest rate floors and collars, as part of its interest rate risk management. Interest rate caps and floors are agreements whereby one party agrees to pay or receive a floating rate of interest on a notional principal amount for a predetermined period of time if certain market interest rate thresholds are met. The Company considers the credit risk inherent in these contracts to be negligible. As of September 30, 2023 and 2022, the Company did not hold any interest rate floors or collars.\nThe Company is a party to interest rate derivatives that are not designated as hedging instruments. Under a program, the Company executes interest rate swaps with commercial lending customers to facilitate their respective risk management strategies. These interest rate swaps with customers are simultaneously offset by interest rate swaps that the Bank executes with a third-party financial institution, such that the Bank minimizes its net risk exposure resulting from such transactions. Because the interest rate swaps associated with this program do not meet the strict hedge accounting requirements, changes in the fair value of both the customer swaps and the offsetting swaps are recognized directly in earnings. The changes in the fair value of the swaps offset each other, except for the credit risk of the counterparties, which is determined by taking into consideration the risk rating, probability of default and loss given default for all counterparties. The Company had $0 in cash pledged for collateral on its interest rate swaps with financial institutions at September 30, 2023 and 2022.\nThe following table presents summary information regarding these derivatives for September 30, 2023 and 2022.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nNotional\nAmount Average\nMaturiy\n(Years) Weighted\nAverage\nFixed\nRate Weighted Average\nVariable Rate Fair Value\n(Dollars in thousands)\nSeptember 30, 2023\nClassified in Other Assets:\nCustomer interest rate swaps $ 36,020 4.2 4.96% 1 Mo. BSBY + 2.44 $ 2,579\nTotal $ 36,020 4.2 4.96%\n$ 2,579\nClassified in Other Liabilities:\n3rd Party interest rate swaps $ 36,020 4.2 4.96% 1 Mo. BSBY + 2.44 $ 2,579\nTotal $ 36,020 4.2 4.96%\n$ 2,579\nSeptember 30, 2022\nClassified in Other Assets:\nCustomer interest rate swaps (1) $ 19,512 5.9 3.63% 1 Mo. LIBOR + 2.50 $ 2,275\n6,940 4.6 6.13% 1 Mo. BSBY + 3.00\nTotal $ 26,452 5.2 4.88%\n$ 2,487\nClassified in Other Liabilities:\n3rd Party interest rate swaps $ 19,512 5.9 3.63% 1 Mo. LIBOR + 2.50 $ 2,275\n6,940 4.6 6.13% 1 Mo. BSBY + 3.00\nTotal $ 26,452 5.2 4.88%\n$ 2,487\n(1) Derivative assets were incorrectly shown as a negative balance within the Company's Annual Report on Form 10-K for the year-ended September 30, 2022. The derivative asset balances have been corrected within the table above. The correction did not have an impact on the Company's consolidated balance sheet.\nAt September 30, 2023 and 2022, the Company had outstanding commitments (substantially all of which expire within one year) to originate one-to four-family residential loans, construction loans, commercial real estate loans, commercial business loans and consumer loans. These commitments were comprised of fixed and variable rate loans.\nSeptember 30,\n(In thousands)\nFinancial instruments whose contract amounts represent credit risk\nLetters of credit $ 1,073 $ 740\nUnused lines of credit 89,933 73,825\nFixed rate loan commitments 3,578 2,550\nVariable rate loan commitments 26,472 49,913\nTotal $ 121,056 $ 127,028\nNOTE Q - FAIR VALUE DISCLOSURES\nThe Company uses fair value measurements to record fair value adjustments to certain assets and liabilities and to determine fair value disclosures. The Companys securities available-for-sale are recorded at fair value on a recurring basis. Additionally, from time to time, the Company may be required to record at fair value other assets or liabilities on a non-recurring basis, such as held-to-maturity securities, mortgage servicing rights, loans receivable and other real estate owned, or OREO. These non-recurring fair value adjustments involve the application of lower-of-cost-or-market accounting or write-downs of individual assets.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nIn accordance with ASC 820, Fair Value Measurements and Disclosures (ASC 820), the Company groups its assets and liabilities at fair value in three levels, based on the markets in which the assets are traded and the reliability of the assumptions used to determine fair value. These levels are:\nLevel 1- Valuation is based upon quoted prices for identical instruments traded in active markets.\nLevel 2- Valuation is based upon quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active and model-based valuation techniques for which all significant assumptions are observable in the market.\nLevel 3- Valuation is generated from model-based techniques that use significant assumptions not observable in the market. These unobservable assumptions reflect our own estimates of assumptions that market participants would use in pricing the asset or liability. Valuation techniques include the use of option pricing models, discounted cash flow models and similar techniques. The results cannot be determined with precision and may not be realized in an actual sale or immediate settlement of the asset or liability.\nThe Company bases its fair values on the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. ASC 820 requires the Company to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value.\nThe following is a description of valuation methodologies used for assets measured at fair value on a recurring basis.\nSecurities available-for-sale\nThe Companys available-for-sale portfolio is carried at estimated fair value on a recurring basis, with any unrealized gains and losses, net of taxes, reported as accumulated other comprehensive income (loss) in stockholders equity. The securities available-for-sale portfolio consists of U.S. government and government-sponsored enterprise obligations and mortgage-backed securities. The fair values of these securities are obtained from an independent nationally recognized pricing service. An independent pricing service provides prices which are categorized as Level 2, as quoted prices in active markets for identical assets are generally not available for the securities.\nThe following tables provide the level of valuation assumptions used to determine the carrying value of the Companys assets measured at fair value on a recurring basis at September 30, 2023 and 2022:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSeptember 30, 2023 Total Level 1 Level 2 Level 3\nAssets: (In thousands)\nSecurities available-for-sale:\nObligations of U.S. government agencies:\nMortgage-backed securities - residential $ 92 $ -\n$ 92 $ -\nObligations of U.S. government-sponsored enterprises:\nMortgage-backed securities-residential 10,033 -\n10,033 -\nTotal securities available for sale $ 10,125 $ -\n$ 10,125 $ -\nDerivative assets 2,579 -\n2,579 -\nTotal assets $ 12,704 $ -\n$ 12,704 $ -\nLiabilities:\nDerivative liabilities $ 2,579 $ -\n$ 2,579 $ -\nTotal Liabilities $ 2,579 $ -\n$ 2,579 $ -\nSeptember 30, 2022\nAssets:\nSecurities available-for-sale:\nObligations of U.S. government agencies:\nMortgage-backed securities - residential $ 107 $ -\n$ 107 $ -\nObligations of U.S. government-sponsored enterprises:\nMortgage-backed securities-residential 9,122 -\n9,122 -\nTotal securities available for sale $ 9,229 $ -\n$ 9,229 $ -\nDerivative assets (1) 2,487 -\n2,487 -\nTotal assets $ 11,716 $ -\n$ 11,716 $ -\nLiabilities:\nDerivative liabilities $ 2,487 $ -\n$ 2,487 $ -\nTotal Liabilities $ 2,487 $ -\n$ 2,487 $ -\n(1) Derivative assets were incorrectly shown as a negative balance within the Company's Annual Report on Form 10-K for the year-ended September 30, 2022. The derivative asset balances and corresponding totals have been corrected within the table above. The correction did not have an impact on the Company's consolidated balance sheet.\nThe following is a description of valuation methodologies used for assets measured at fair value on a non-recurring basis.\nImpaired Loans\nLoans which meet certain criteria are evaluated individually for impairment. A loan is impaired when, based on current information and events, it is probable that the Company will be unable to collect all amounts due according to the contractual terms of the loan agreement. All amounts due according to the contractual terms means that both the contractual interest and principal payments of a loan will be collected as scheduled in the loan agreement. Three impairment measurement methods are used, depending upon the collateral securing the asset: 1) the present value of expected future cash flows discounted at the loans effective interest rate; 2) the assets observable market price; or 3) the fair value of the collateral if the asset is collateral dependent. The regulatory agencies require this method for loans from which repayment is expected to be provided solely by the underlying collateral. The Companys impaired loans are generally collateral dependent and, as such, are carried at the estimated fair value of the collateral less estimated selling and disposition costs. Fair value is estimated through current appraisals, and adjusted as necessary, by management, to reflect current market conditions and, as such, are generally classified as Level 3.\nAppraisals of collateral securing impaired loans are conducted by approved, qualified, and independent third-party appraisers. Such appraisals are ordered via the Banks credit administration department, independent from the lender who originated the loan, once the loan is deemed impaired, as described in the previous paragraph. Impaired loans are generally re-evaluated with an updated appraisal within one year of the last appraisal. However, the Company also obtains updated appraisals on performing construction loans that are approaching their maturity date to determine whether or not the fair value of the collateral securing the loan remains sufficient to cover the loan amount prior to considering an extension. The Company discounts the appraised as is value of the collateral for estimated selling and disposition costs and compares the resulting fair value of collateral to the outstanding loan amount. If the outstanding loan amount is greater than the discounted fair value, the Company requires a reduction in the outstanding loan balance or additional collateral before considering an extension to the loan. If the borrower is unwilling or unable to reduce the loan balance or increase the collateral securing the loan, it is deemed impaired and the difference between the loan amount and the fair value of collateral, net of estimated selling and disposition costs, is charged off through a reduction of the allowance for loan loss.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nOther Real Estate Owned\nOther real estate owned is carried at lower of cost or estimated fair value less disposal costs. The estimated fair value of the real estate is determined through current appraisals, and adjusted as necessary, by management, to reflect current market conditions. As such, other real estate owned is generally classified as Level 3. There were no valuation write-downs for the years ended September 30, 2023 and 2022.\nThe following tables provide the level of valuation assumptions used to determine the carrying value of our assets measured at fair value on a non-recurring basis at September 30, 2023 and 2022:\nTotal Level 1 Level 2 Level 3\nSeptember 30, 2023 (In thousands)\nImpaired loans $ 777 $ -\n$ -\n$ 777\nTotal $ 777 $ -\n$ -\n$ 777\nSeptember 30, 2022\nImpaired loans $ 5,659 $ -\n$ -\n$ 5,659\nTotal $ 5,659 $ -\n$ -\n$ 5,659\nThe following tables present additional quantitative information about assets measured at fair value on a nonrecurring basis and for which Company has utilized Level 3 inputs to determine fair value:\nQuantitative Information about Level 3 Fair Value Measurements\n(Dollars in thousands)\nFair Value Valuation\nSeptember 30, 2023 Estimate Techniques Unobservable Input Range (Weighted Average)\nImpaired loans $ 777 Appraisal of collateral (1) Appraisal adjustments (2) -50% to -8.0% (-19.4%)\nFair Value Valuation\nSeptember 30, 2022 Estimate Techniques Unobservable Input Range (Weighted Average)\nImpaired loans $ 5,659 Appraisal of collateral (1) Appraisal adjustments (2) 0% to -31.7% (-9.9%)\n(1) Fair value is generally determined through independent appraisals for the underlying collateral, which generally include various level 3 inputs which are not identifiable.\n(2) Appraisals may be adjusted by management for qualitative factors such as economic conditions and estimated liquidation expenses. The range and weighted average of liquidation expenses and other appraisal adjustments are presented as a percent of the appraisal.\nThe following presents the carrying amount, fair value, and placement in the fair value hierarchy of the Companys financial instruments carried at cost or amortized cost as of September 30, 2023 and September 30, 2022. This table excludes financial instruments for which the carrying amount approximates fair value, which includes cash and cash equivalents, FHLBNY stock, bank owned life insurance, accrued interest receivable, interest and non-interest bearing demand, savings deposits, and accrued interest payable. For short-term financial assets such as cash and cash equivalents, the carrying amount is a reasonable estimate of fair value due to the relatively short time between the origination of the instrument and its expected realization. For financial liabilities such as interest-bearing demand, NOW, and money market savings deposits, the carrying amount is a reasonable estimate of fair value due to these products having no stated maturity.\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nCarrying Fair Fair Value Measurement Placement\nAmount Value (Level 1) (Level 2) (Level 3)\n(In thousands)\nSeptember 30, 2023\nFinancial instruments - assets\nInvestment securities held-to-maturity $ 85,835 $ 73,728 $ -\n$ 73,728 $ -\nLoans 689,070 664,331 -\n-\n664,331\nFinancial instruments - liabilities\nCertificates of deposit 104,668 101,216 -\n101,216 -\nBorrowings 29,515 28,177 -\n28,177 -\nSeptember 30, 2022\nFinancial instruments - assets\nInvestment securities held-to-maturity $ 91,646 $ 79,914 $ -\n$ 79,914 $ -\nLoans 619,843 592,804 -\n-\n592,804\nFinancial instruments - liabilities\nCertificates of deposit 82,609 81,289 -\n81,289 -\nBorrowings 15,625 14,762 -\n14,762 -\nNOTE R - REGULATORY CAPITAL\nThe Company and Bank are required to maintain minimum amounts of capital to total risk-weighted assets, as defined by the banking regulators. Failure to meet minimum capital requirements can initiate certain mandatory and possibly discretionary actions by regulators that, if undertaken, could have a direct material effect on the Companys financial statements. Under capital adequacy guidelines and the regulatory framework for prompt corrective action, the Company and Bank must meet specific capital guidelines that involve quantitative measures of the Companys and Banks assets, liabilities, and certain off balance sheet items as calculated under regulatory accounting practices. The capital amounts and classification are also subject to qualitative judgments by the regulators about components, risk weightings and other factors.\nThe Basel III regulatory capital reforms and changes required by the Dodd-Frank Act include a minimum common equity Tier 1 capital (CET1) to risk-weighted assets ratio of 4.5% of risk-weighted assets, a minimum Tier 1 capital to risk-weighted assets of 6.0% and a minimum leverage ratio of 4.0%. The required minimum ratio of total capital to risk-weighted assets is 8.0%. The regulatory banking rules also require a capital conservation buffer of 2.5% above the new regulatory minimum capital ratios, and resulted in the following minimum ratios: (i) a common equity Tier 1 capital ratio of 7.0%; (ii) a Tier 1 capital ratio of 8.5%; and (iii) a total capital ratio of 10.5%. An institution will be subject to limitations on paying dividends, engaging in share repurchases, and paying discretionary bonuses if its capital level falls below the buffer amount. These limitations established a maximum percentage of eligible retained income that could be utilized for such actions.\nAs of September 30, 2023, the most recent notification from the Federal Deposit Insurance Corporation categorized the Bank as well capitalized under the regulatory framework for prompt corrective action. There are no conditions or events since that notification that management believes have changed the Banks category.\nThe following tables set forth the Companys and the Banks actual and required capital levels under those measures:\nMAGYAR BANCORP, INC. AND SUBSIDIARY\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nTo be well-\ncapitalized under\nRequired for capital prompt corrective\nAt September 30, 2023 Company Bank adequacy purposes action provisions\nTier 1 leverage ratio 12.12% 11.11% ≥ 4.00% ≥ 5.00%\nCET1 16.33% 14.97% ≥ 7.00% (1) ≥ 6.50%\nTier 1 risk-based capital ratio 16.33% 14.97% ≥ 8.50% (1) ≥ 8.00%\nTotal risk-based capital ratio 17.58% 16.22% ≥ 10.50% (1) ≥ 10.00%\nAt September 30, 2022\nTier 1 leverage ratio 12.57% 11.13% ≥ 4.00% ≥ 5.00%\nCET1 17.16% 15.22% ≥ 7.00% (1) ≥ 6.50%\nTier 1 risk-based capital ratio 17.16% 15.22% ≥ 8.50% (1) ≥ 8.00%\nTotal risk-based capital ratio 18.41% 16.47% ≥ 10.50% (1) ≥ 10.00%\n(1) Includes 2.50% capital conservation buffer ITEM 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. ITEM 9A. Controls and Procedures\nDisclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our Principal Executive Officer and Principal Financial Officer, we evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Securities Exchange Act of 1934) as of the end of the period covered by this report. Based upon that evaluation, the Principal Executive Officer and Principal Financial Officer concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were effective.\nChanges in Internal Control over Financial Reporting\nThere has been no change in Magyar Bancorp, Inc.'s internal control over financial reporting during Magyar Bancorp, Inc.'s fourth quarter of fiscal year 2023 that has materially affected, or is reasonably likely to materially affect, Magyar Bancorp, Inc.'s internal control over financial reporting.\nReport by Management on Internal Control over Financial Reporting\nThe management of Magyar Bancorp, Inc. is responsible for establishing and maintaining adequate internal control over financial reporting. Magyar Bancorp Inc.'s internal control system was designed to provide reasonable assurance to the Magyar Bancorp, Inc.'s management and board of directors regarding the preparation and fair presentation of published financial statements.\nAll internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nMagyar Bancorp, Inc.'s management assessed the effectiveness of the Company's internal control over financial reporting as of September 30, 2023. In making this assessment, it used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) 2013 in Internal Control-Integrated Framework. Based on our assessment, we believe that, as of September 30, 2023, the Company's internal control over financial reporting was effective based on those criteria.\nThe Annual Report on Form 10-K does not include an attestation report of the Company's registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by the Company's registered public accounting firm pursuant to exemption rules of the Securities and Exchange Commission that permit the Company to provide only management's report in this annual report. ITEM 9B. Other Information\nNone.\nITEM 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone.\nPART III ITEM 10. Directors, Executive Officers, and Corporate Governance\nMagyar Bancorp, Inc. has adopted a Code of Ethics that applies to Magyar Bancorp, Inc.s principal executive officer, principal financial officer, principal accounting officer or controller or persons performing similar functions. The Code of Ethics, and any amendments to and waivers from the Code of Ethics, will be posted on the Companys website located at www.magbank.com. A copy of the Code will be furnished without charge upon written request to the Secretary, Magyar Bancorp, Inc., 400 Somerset Street, New Brunswick, New Jersey.\nInformation concerning directors and executive officers of Magyar Bancorp, Inc. is incorporated herein by reference from our definitive Proxy Statement related to our 2023 Annual Meeting of Stockholders (the Proxy Statement), specifically the section captioned Proposal I - Election of Directors. ITEM 11. Executive Compensation\nInformation concerning executive compensation is incorporated herein by reference from our Proxy Statement, specifically the section captioned Proposal I - Election of Directors. ITEM 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation concerning security ownership of certain owners and management is incorporated herein by reference from our Proxy Statement, specifically the sections captioned Security Ownership of Certain Beneficial Owners and Management and Proposal I - Election of Directors. ITEM 13. Certain Relationships and Related Transactions, and Director Independence\nInformation concerning relationships and transactions is incorporated herein by reference from our Proxy Statement, specifically the section captioned Proposal I - Election of Directors - Transactions with Certain Related Persons. ITEM 14. Principal Accountant Fees and Services\nInformation concerning principal accountant fees and services is incorporated herein by reference from our Proxy Statement, specifically the section captioned Proposal II - Ratification of the Appointment of Independent Registered Public Accountants.\nPART IV ITEM 15. Exhibits and Financial Statement Schedules\n3.1 Certificate of Incorporation of Magyar Bancorp, Inc. (1)\n3.2 Bylaws of Magyar Bancorp, Inc. (2)\n3.3 Amendment to Certificate of Incorporation of Magyar Bancorp, Inc. (8)\n4.1 Form of Common Stock Certificate of Magyar Bancorp, Inc. (2)\n4.2 Description of the Capital Stock of Magyar Bancorp, Inc. (3)\n10.1 Form of Employee Stock Ownership Plan (2)\n10.2 Restated Director Supplemental Retirement Income and Deferred Compensation Agreement for Joseph A. Yelencsics (4)\n10.3 Restated Director Supplemental Retirement Income and Deferred Compensation Agreement for Edward C. Stokes, III (4)\n10.4 Restated Director Supplemental Retirement Income and Deferred Compensation Agreement for Thomas Lankey (4)\n10.5 Restated Director Supplemental Retirement Income and Deferred Compensation Agreement for Andrew G. Hodulik (4)\n10.6 Form of Change in Control Agreement for Executive Officers (2)\n10.7 Executive Supplemental Retirement Income Agreement for John Fitzgerald (4)\n10.8 Executive Supplemental Retirement Income Agreement for Jon Ansari (4)\n10.9 Employment Agreement for John Fitzgerald (5)\n10.10 Employment Agreement for Jon Ansari (9)\n10.11 Change in Control Agreement for Peter Brown (5)\n10.12 Supplemental Executive Retirement Plan for John Fitzgerald (6)\n10.13 Supplemental Executive Retirement Plan for Jon Ansari (6)\n10.14 Magyar Bancorp, Inc. 2022 Equity Incentive Plan (7)\nSubsidiaries of Registrant (2)\nConsent of S.R. Snodgrass, P.C.\n23.2 Consent of RSM US LLP\n31.1 Certification of Chief Executive Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2 Certification of Chief Financial Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nThe following materials from the Companys Annual Report on Form 10-K for the year ended September 30, 2023, formatted in XBRL (Extensible Business Reporting Language): (i) the Consolidated Balance Sheets, (ii) the Consolidated Statements of Income, (iii) the Consolidated Statement of Comprehensive Income, (iv) the Consolidated Statements of Changes in Stockholders Equity, (v) the Consolidated Statements of Cash Flows and (vi) the Notes to Consolidated Financial Statements.\nInline XBRL Cover Page Interactive Data File\n(1) Incorporated by reference to Exhibit 3.1 to the Registration Statement on Form SB-2 of Magyar Bancorp, Inc. (file no. 333-128392), originally filed with the Securities and Exchange Commission on September 16, 2005, as amended.\n(2) Incorporated by reference to the Registration Statement on Form SB-2 of Magyar Bancorp, Inc. (file no. 333-128392), originally filed with the Securities and Exchange Commission on September 16, 2005, as amended.\n(3) Incorporated by reference to the Annual Report on Form 10-K of Magyar Bancorp, Inc. (file no. 000-51726), filed with the Securities and Exchange Commission on December 20, 2021.\n(4) Incorporated by reference to the Annual Report on Form 10-KSB of Magyar Bancorp, Inc. (file no. 000-51726), originally filed with the Securities and Exchange Commission on December 29, 2006.\n(5) Incorporated by reference to the Companys Registration Statement on Form S-1 (File No. 333-254282), filed with the Securities and Exchange Commission on March 15, 2021.\n(6) Incorporated by reference to the Current Report on Form 8-K of Magyar Bancorp, Inc. (file no 000-51726), originally filed with the Securities and Exchange Commission on May 29, 2019.\n(7) Incorporated by reference to Appendix A to the Companys definitive Proxy Statement (file no. 000-51726) filed with the SEC on July 18, 2022.\n(8) Incorporated by reference to Exhibit 3.1 to the Companys Form 8-K filed on July 12, 2021.\n(9) Incorporated by reference to the Annual Report on Form 10-K of Magyar Bancorp, Inc. (file no. 000-51726), filed with the Securities and Exchange Commission on December 22, 2022.\nITEM 16. Form 10-K Summary\nNone\nSIGNATURES\nPursuant to the requirements of Section 13 or 15 (d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMAGYAR BANCORP, INC.\nDecember 15, 2023 By: /s/ John S. Fitzgerald\nDate\nJohn S. Fitzgerald\nPresident and Chief Executive Officer\n(Duly Authorized Representative)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignatures\nTitle\nDate\n/s/ John S. Fitzgerald\nPresident and Chief Executive Officer\nDecember 15, 2023\nJohn S. Fitzgerald\n(Principal Executive Officer)\n/s/ Jon R. Ansari\nExecutive Vice President and Chief Financial Officer\nDecember 15, 2023\nJon R. Ansari\n(Principal Financial and Accounting Officer)\n/s/ Thomas Lankey\nChairman of the Board\nDecember 15, 2023\nThomas Lankey\n/s/ Andrew Hodulik\nVice Chairman of the Board\nDecember 15, 2023\nAndrew Hodulik\n/s/ Joseph A. Yelencsics\nDirector\nDecember 15, 2023\nJoseph A. Yelencsics\n/s/ Edward C. Stokes\nDirector\nDecember 15, 2023\nEdward C. Stokes, III\n/s/ Susan Eisenhauer\nDirector\nDecember 15, 2023\nSusan Eisenhauer\n/s/ Michael Lombardi\nDirector\nDecember 15, 2023\nMichael Lombardi\n/s/ Maureen Ruane\nDirector\nDecember 15, 2023\nMaureen Ruane\nfalse FY\n2022-10-01 2023-09-30\n2023-03-31\n2023-12-15\n2023-09-30\n2022-09-30\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2021-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-09-30\nmgyr:TreasuryStock1Member\n2021-09-30\nmgyr:UnearnedEsopSharesMember\n2021-09-30\nus-gaap:RetainedEarningsMember\n2021-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-09-30\n2021-09-30\nus-gaap:CommonStockMember\n2021-10-01 2022-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-10-01 2022-09-30\nmgyr:TreasuryStock1Member\n2021-10-01 2022-09-30\nmgyr:UnearnedEsopSharesMember\n2021-10-01 2022-09-30\nus-gaap:RetainedEarningsMember\n2021-10-01 2022-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2022-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-09-30\nmgyr:TreasuryStock1Member\n2022-09-30\nmgyr:UnearnedEsopSharesMember\n2022-09-30\nus-gaap:RetainedEarningsMember\n2022-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-09-30\nus-gaap:CommonStockMember\n2022-10-01 2023-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-10-01 2023-09-30\nmgyr:TreasuryStock1Member\n2022-10-01 2023-09-30\nmgyr:UnearnedEsopSharesMember\n2022-10-01 2023-09-30\nus-gaap:RetainedEarningsMember\n2022-10-01 2023-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-10-01 2023-09-30\nus-gaap:CommonStockMember\n2023-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-09-30\nmgyr:TreasuryStock1Member\n2023-09-30\nmgyr:UnearnedEsopSharesMember\n2023-09-30\nus-gaap:RetainedEarningsMember\n2023-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2023-09-30\nmgyr:MagyarBankMember\n2023-09-30\nmgyr:HungariaUrbanRenewalLLCMember\n2023-09-30\n2023-10-30\n2023-11-15 2023-11-15\nmgyr:BeforeTaxAmountMember\n2022-10-01 2023-09-30\nmgyr:TaxBenefitExpenseMember\n2022-10-01 2023-09-30\nmgyr:NetOfTaxAmountMember\n2022-10-01 2023-09-30\nmgyr:BeforeTaxAmountMember\n2021-10-01 2022-09-30\nmgyr:TaxBenefitExpenseMember\n2021-10-01 2022-09-30\nmgyr:NetOfTaxAmountMember\n2021-10-01 2022-09-30\n2022-08-25 2022-08-25\nus-gaap:RestrictedStockMember\n2022-10-01 2023-09-30\n2022-12-08 2022-12-08\n2022-12-08\nus-gaap:GovernmentNationalMortgageAssociationGnmaInsuredLoansMember\n2023-09-30\nus-gaap:FederalNationalMortgageAssociationFnmaInsuredLoansMember\n2023-09-30\nus-gaap:GovernmentNationalMortgageAssociationGnmaInsuredLoansMember\n2022-10-01 2023-09-30\nus-gaap:FederalHomeLoanMortgageCorporationFhlmcInsuredLoansMember\n2023-09-30\nus-gaap:AvailableforsaleSecuritiesMember us-gaap:ResidentialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentAgenciesMember\n2023-09-30\nus-gaap:AvailableforsaleSecuritiesMember us-gaap:ResidentialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentsponsoredEnterprisesMember\n2023-09-30\nus-gaap:AvailableforsaleSecuritiesMember us-gaap:CommercialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentAgenciesMember\n2023-09-30\nus-gaap:AvailableforsaleSecuritiesMember mgyr:ObligationsOfUSGovernmentsponsoredEnterprisesMember us-gaap:DebtSecuritiesMember\n2023-09-30\nus-gaap:MortgageBackedSecuritiesIssuedByPrivateEnterprisesMember\n2023-09-30\nmgyr:ObligationsOfStateAndPoliticalSubdivisionsMember\n2023-09-30\nus-gaap:CorporateNoteSecuritiesMember\n2023-09-30\nus-gaap:AvailableforsaleSecuritiesMember\n2023-09-30\nus-gaap:AvailableforsaleSecuritiesMember us-gaap:ResidentialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentAgenciesMember\n2022-09-30\nus-gaap:AvailableforsaleSecuritiesMember us-gaap:ResidentialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentsponsoredEnterprisesMember\n2022-09-30\nus-gaap:AvailableforsaleSecuritiesMember us-gaap:CommercialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentAgenciesMember\n2022-09-30\nus-gaap:AvailableforsaleSecuritiesMember mgyr:ObligationsOfUSGovernmentsponsoredEnterprisesMember us-gaap:DebtSecuritiesMember\n2022-09-30\nus-gaap:MortgageBackedSecuritiesIssuedByPrivateEnterprisesMember\n2022-09-30\nmgyr:ObligationsOfStateAndPoliticalSubdivisionsMember\n2022-09-30\nus-gaap:CorporateNoteSecuritiesMember\n2022-09-30\nus-gaap:AvailableforsaleSecuritiesMember\n2022-09-30\nmgyr:MortgagebackedSecuritiesHeldtomaturityMember mgyr:AmortizedCostMember\n2023-09-30\nmgyr:MortgagebackedSecuritiesHeldtomaturityMember mgyr:FairValueMember\n2023-09-30\nus-gaap:ResidentialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentAgenciesMember\n2023-09-30\nus-gaap:CommercialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentAgenciesMember\n2023-09-30\nus-gaap:ResidentialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentsponsoredEnterprisesMember\n2023-09-30\nus-gaap:DebtSecuritiesMember\n2023-09-30\nmgyr:PrivateLabelMortgagebackedSecuritiesResidentialMember\n2023-09-30\nus-gaap:CorporateDebtSecuritiesMember\n2023-09-30\nus-gaap:ResidentialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentAgenciesMember\n2022-09-30\nus-gaap:CommercialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentAgenciesMember\n2022-09-30\nus-gaap:ResidentialMortgageBackedSecuritiesMember mgyr:ObligationsOfUSGovernmentsponsoredEnterprisesMember\n2022-09-30\nus-gaap:DebtSecuritiesMember\n2022-09-30\nmgyr:PrivateLabelMortgagebackedSecuritiesResidentialMember\n2022-09-30\nus-gaap:CorporateDebtSecuritiesMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember\n2022-09-30\nus-gaap:CommercialRealEstateMember\n2023-09-30\nus-gaap:CommercialRealEstateMember\n2022-09-30\nus-gaap:ConstructionLoansMember\n2023-09-30\nus-gaap:ConstructionLoansMember\n2022-09-30\nus-gaap:HomeEquityMember\n2023-09-30\nus-gaap:HomeEquityMember\n2022-09-30\nus-gaap:CommercialLoanMember\n2023-09-30\nus-gaap:CommercialLoanMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:PassMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:SpecialMentionMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:SubstandardMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:DoubtfulMember\n2023-09-30\nus-gaap:CommercialRealEstateMember us-gaap:PassMember\n2023-09-30\nus-gaap:CommercialRealEstateMember us-gaap:SpecialMentionMember\n2023-09-30\nus-gaap:CommercialRealEstateMember us-gaap:SubstandardMember\n2023-09-30\nus-gaap:CommercialRealEstateMember us-gaap:DoubtfulMember\n2023-09-30\nus-gaap:ConstructionLoansMember us-gaap:PassMember\n2023-09-30\nus-gaap:ConstructionLoansMember us-gaap:SpecialMentionMember\n2023-09-30\nus-gaap:ConstructionLoansMember us-gaap:SubstandardMember\n2023-09-30\nus-gaap:ConstructionLoansMember us-gaap:DoubtfulMember\n2023-09-30\nus-gaap:HomeEquityMember us-gaap:PassMember\n2023-09-30\nus-gaap:HomeEquityMember us-gaap:SpecialMentionMember\n2023-09-30\nus-gaap:HomeEquityMember us-gaap:SubstandardMember\n2023-09-30\nus-gaap:HomeEquityMember us-gaap:DoubtfulMember\n2023-09-30\nus-gaap:CommercialLoanMember us-gaap:PassMember\n2023-09-30\nus-gaap:CommercialLoanMember us-gaap:SpecialMentionMember\n2023-09-30\nus-gaap:CommercialLoanMember us-gaap:SubstandardMember\n2023-09-30\nus-gaap:CommercialLoanMember us-gaap:DoubtfulMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:PassMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:SpecialMentionMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:SubstandardMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:DoubtfulMember\n2023-09-30\nus-gaap:PassMember\n2023-09-30\nus-gaap:SpecialMentionMember\n2023-09-30\nus-gaap:SubstandardMember\n2023-09-30\nus-gaap:DoubtfulMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:PassMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:SpecialMentionMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:SubstandardMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:DoubtfulMember\n2022-09-30\nus-gaap:CommercialRealEstateMember us-gaap:PassMember\n2022-09-30\nus-gaap:CommercialRealEstateMember us-gaap:SpecialMentionMember\n2022-09-30\nus-gaap:CommercialRealEstateMember us-gaap:SubstandardMember\n2022-09-30\nus-gaap:CommercialRealEstateMember us-gaap:DoubtfulMember\n2022-09-30\nus-gaap:ConstructionLoansMember us-gaap:PassMember\n2022-09-30\nus-gaap:ConstructionLoansMember us-gaap:SpecialMentionMember\n2022-09-30\nus-gaap:ConstructionLoansMember us-gaap:SubstandardMember\n2022-09-30\nus-gaap:ConstructionLoansMember us-gaap:DoubtfulMember\n2022-09-30\nus-gaap:HomeEquityMember us-gaap:PassMember\n2022-09-30\nus-gaap:HomeEquityMember us-gaap:SpecialMentionMember\n2022-09-30\nus-gaap:HomeEquityMember us-gaap:SubstandardMember\n2022-09-30\nus-gaap:HomeEquityMember us-gaap:DoubtfulMember\n2022-09-30\nus-gaap:CommercialLoanMember us-gaap:PassMember\n2022-09-30\nus-gaap:CommercialLoanMember us-gaap:SpecialMentionMember\n2022-09-30\nus-gaap:CommercialLoanMember us-gaap:SubstandardMember\n2022-09-30\nus-gaap:CommercialLoanMember us-gaap:DoubtfulMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:PassMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:SpecialMentionMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:SubstandardMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:DoubtfulMember\n2022-09-30\nus-gaap:PassMember\n2022-09-30\nus-gaap:SpecialMentionMember\n2022-09-30\nus-gaap:SubstandardMember\n2022-09-30\nus-gaap:DoubtfulMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2023-09-30\nus-gaap:CommercialRealEstateMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2023-09-30\nus-gaap:CommercialRealEstateMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2023-09-30\nus-gaap:CommercialRealEstateMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2023-09-30\nus-gaap:ConstructionLoansMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2023-09-30\nus-gaap:ConstructionLoansMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2023-09-30\nus-gaap:ConstructionLoansMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2023-09-30\nus-gaap:HomeEquityMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2023-09-30\nus-gaap:HomeEquityMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2023-09-30\nus-gaap:HomeEquityMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2023-09-30\nus-gaap:CommercialLoanMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2023-09-30\nus-gaap:CommercialLoanMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2023-09-30\nus-gaap:CommercialLoanMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2023-09-30\nus-gaap:FinancingReceivables30To59DaysPastDueMember\n2023-09-30\nus-gaap:FinancingReceivables60To89DaysPastDueMember\n2023-09-30\nus-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2022-09-30\nus-gaap:CommercialRealEstateMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2022-09-30\nus-gaap:CommercialRealEstateMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2022-09-30\nus-gaap:CommercialRealEstateMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2022-09-30\nus-gaap:ConstructionLoansMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2022-09-30\nus-gaap:ConstructionLoansMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2022-09-30\nus-gaap:ConstructionLoansMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2022-09-30\nus-gaap:HomeEquityMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2022-09-30\nus-gaap:HomeEquityMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2022-09-30\nus-gaap:HomeEquityMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2022-09-30\nus-gaap:CommercialLoanMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2022-09-30\nus-gaap:CommercialLoanMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2022-09-30\nus-gaap:CommercialLoanMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:FinancingReceivables30To59DaysPastDueMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:FinancingReceivables60To89DaysPastDueMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember us-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2022-09-30\nus-gaap:FinancingReceivables30To59DaysPastDueMember\n2022-09-30\nus-gaap:FinancingReceivables60To89DaysPastDueMember\n2022-09-30\nus-gaap:FinancingReceivablesEqualToGreaterThan90DaysPastDueMember\n2022-09-30\nus-gaap:UnallocatedFinancingReceivablesMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember\n2022-10-01 2023-09-30\nus-gaap:CommercialRealEstateMember\n2022-10-01 2023-09-30\nus-gaap:ConstructionLoansMember\n2022-10-01 2023-09-30\nus-gaap:HomeEquityMember\n2022-10-01 2023-09-30\nus-gaap:CommercialLoanMember\n2022-10-01 2023-09-30\nmgyr:FinancingReceivableOtherMember\n2022-10-01 2023-09-30\nus-gaap:UnallocatedFinancingReceivablesMember\n2022-10-01 2023-09-30\nus-gaap:UnallocatedFinancingReceivablesMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember\n2021-09-30\nus-gaap:CommercialRealEstateMember\n2021-09-30\nus-gaap:ConstructionLoansMember\n2021-09-30\nus-gaap:HomeEquityMember\n2021-09-30\nus-gaap:CommercialLoanMember\n2021-09-30\nmgyr:FinancingReceivableOtherMember\n2021-09-30\nus-gaap:UnallocatedFinancingReceivablesMember\n2021-09-30\nmgyr:Residential1To4FamilyRealEstateMember\n2021-10-01 2022-09-30\nus-gaap:CommercialRealEstateMember\n2021-10-01 2022-09-30\nus-gaap:ConstructionLoansMember\n2021-10-01 2022-09-30\nus-gaap:HomeEquityMember\n2021-10-01 2022-09-30\nus-gaap:CommercialLoanMember\n2021-10-01 2022-09-30\nmgyr:FinancingReceivableOtherMember\n2021-10-01 2022-09-30\nus-gaap:UnallocatedFinancingReceivablesMember\n2021-10-01 2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:AllowanceForLoanLossesBeginningMember\n2023-09-30\nus-gaap:CommercialRealEstateMember mgyr:AllowanceForLoanLossesBeginningMember\n2023-09-30\nus-gaap:ConstructionLoansMember mgyr:AllowanceForLoanLossesBeginningMember\n2023-09-30\nus-gaap:HomeEquityMember mgyr:AllowanceForLoanLossesBeginningMember\n2023-09-30\nus-gaap:CommercialLoanMember mgyr:AllowanceForLoanLossesBeginningMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember mgyr:AllowanceForLoanLossesBeginningMember\n2023-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:AllowanceForLoanLossesBeginningMember\n2023-09-30\nmgyr:AllowanceForLoanLossesBeginningMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:CommercialRealEstateMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:ConstructionLoansMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:HomeEquityMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:CommercialLoanMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2023-09-30\nmgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:CommercialRealEstateMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:ConstructionLoansMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:HomeEquityMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:CommercialLoanMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2023-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2023-09-30\nmgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:LoansReceivableBeginningMember\n2023-09-30\nus-gaap:CommercialRealEstateMember mgyr:LoansReceivableBeginningMember\n2023-09-30\nus-gaap:ConstructionLoansMember mgyr:LoansReceivableBeginningMember\n2023-09-30\nus-gaap:HomeEquityMember mgyr:LoansReceivableBeginningMember\n2023-09-30\nus-gaap:CommercialLoanMember mgyr:LoansReceivableBeginningMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember mgyr:LoansReceivableBeginningMember\n2023-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:LoansReceivableBeginningMember\n2023-09-30\nmgyr:LoansReceivableBeginningMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:CommercialRealEstateMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:ConstructionLoansMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:HomeEquityMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:CommercialLoanMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2023-09-30\nmgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:CommercialRealEstateMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:ConstructionLoansMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:HomeEquityMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:CommercialLoanMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2023-09-30\nmgyr:FinancingReceivableOtherMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2023-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2023-09-30\nmgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2023-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:AllowanceForLoanLossesBeginningMember\n2022-09-30\nus-gaap:CommercialRealEstateMember mgyr:AllowanceForLoanLossesBeginningMember\n2022-09-30\nus-gaap:ConstructionLoansMember mgyr:AllowanceForLoanLossesBeginningMember\n2022-09-30\nus-gaap:HomeEquityMember mgyr:AllowanceForLoanLossesBeginningMember\n2022-09-30\nus-gaap:CommercialLoanMember mgyr:AllowanceForLoanLossesBeginningMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember mgyr:AllowanceForLoanLossesBeginningMember\n2022-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:AllowanceForLoanLossesBeginningMember\n2022-09-30\nmgyr:AllowanceForLoanLossesBeginningMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:CommercialRealEstateMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:ConstructionLoansMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:HomeEquityMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:CommercialLoanMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2022-09-30\nmgyr:AllowanceForLoanLossesIndividuallyEvaluatedForImpairmentOneMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:CommercialRealEstateMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:ConstructionLoansMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:HomeEquityMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:CommercialLoanMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2022-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2022-09-30\nmgyr:AllowanceForLoanLossesCollectivelyEvaluatedForImpairmentOneMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:LoansReceivableBeginningMember\n2022-09-30\nus-gaap:CommercialRealEstateMember mgyr:LoansReceivableBeginningMember\n2022-09-30\nus-gaap:ConstructionLoansMember mgyr:LoansReceivableBeginningMember\n2022-09-30\nus-gaap:HomeEquityMember mgyr:LoansReceivableBeginningMember\n2022-09-30\nus-gaap:CommercialLoanMember mgyr:LoansReceivableBeginningMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember mgyr:LoansReceivableBeginningMember\n2022-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:LoansReceivableBeginningMember\n2022-09-30\nmgyr:LoansReceivableBeginningMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:CommercialRealEstateMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:ConstructionLoansMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:HomeEquityMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:CommercialLoanMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2022-09-30\nmgyr:LoansReceivableIndividuallyEvaluatedForImpairmentMember\n2022-09-30\nmgyr:Residential1To4FamilyRealEstateMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:CommercialRealEstateMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:ConstructionLoansMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:HomeEquityMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:CommercialLoanMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2022-09-30\nmgyr:FinancingReceivableOtherMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:UnallocatedFinancingReceivablesMember mgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2022-09-30\nmgyr:LoansReceivableCollectivelyEvaluatedForImpairmentMember\n2022-09-30\nus-gaap:LandMember\n2023-09-30\nus-gaap:LandMember\n2022-09-30\nsrt:MinimumMember us-gaap:LandBuildingsAndImprovementsMember\n2022-09-30\nsrt:MaximumMember us-gaap:LandBuildingsAndImprovementsMember\n2022-09-30\nus-gaap:LandBuildingsAndImprovementsMember\n2023-09-30\nus-gaap:LandBuildingsAndImprovementsMember\n2022-09-30\nsrt:MinimumMember us-gaap:FurnitureAndFixturesMember\n2022-09-30\nsrt:MaximumMember us-gaap:FurnitureAndFixturesMember\n2022-09-30\nus-gaap:FurnitureAndFixturesMember\n2023-09-30\nus-gaap:FurnitureAndFixturesMember\n2022-09-30\nsrt:FederalHomeLoanBankOfNewYorkMember\n2023-09-30\nsrt:FederalHomeLoanBankOfNewYorkMember\n2022-09-30\nmgyr:LoanServicingRightsMember\n2022-09-30\nmgyr:LoanServicingRightsMember\n2021-09-30\nmgyr:LoanServicingRightsMember\n2022-10-01 2023-09-30\nmgyr:LoanServicingRightsMember\n2021-10-01 2022-09-30\nmgyr:LoanServicingRightsMember\n2023-09-30\nstpr:NJ\n2022-10-01 2023-09-30\nstpr:NJ\n2021-10-01 2022-09-30\nstpr:NJ srt:ScenarioForecastMember\n2023-12-01 2023-12-31\nsrt:MinimumMember us-gaap:EquitySecuritiesMember\n2022-10-01 2023-09-30\nsrt:MaximumMember us-gaap:EquitySecuritiesMember\n2022-10-01 2023-09-30\nsrt:MinimumMember us-gaap:FixedIncomeSecuritiesMember\n2022-10-01 2023-09-30\nsrt:MaximumMember us-gaap:FixedIncomeSecuritiesMember\n2022-10-01 2023-09-30\nsrt:MinimumMember\n2022-10-01 2023-09-30\nsrt:MaximumMember\n2022-10-01 2023-09-30\nsrt:ScenarioForecastMember\n2024-01-01 2024-12-31\nsrt:MinimumMember us-gaap:EquitySecuritiesMember\n2023-09-30\nsrt:MaximumMember us-gaap:EquitySecuritiesMember\n2023-09-30\nsrt:MinimumMember us-gaap:DebtSecuritiesMember\n2023-09-30\nsrt:MaximumMember us-gaap:DebtSecuritiesMember\n2023-09-30\nus-gaap:PensionPlansDefinedBenefitMember\n2022-10-01 2023-09-30\nus-gaap:PensionPlansDefinedBenefitMember\n2021-10-01 2022-09-30\nus-gaap:EquitySecuritiesMember\n2023-09-30\nus-gaap:EquitySecuritiesMember\n2022-09-30\nus-gaap:DebtSecuritiesMember\n2023-09-30\nus-gaap:DebtSecuritiesMember\n2022-09-30\nus-gaap:MoneyMarketFundsMember\n2023-09-30\nus-gaap:MoneyMarketFundsMember\n2022-09-30\nmgyr:LargeCapValueMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:LargeCapValueMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:LargeCapValueMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:LargeCapValueMember mgyr:MutualFundsEquityMember\n2023-09-30\nmgyr:LargeCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:LargeCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:LargeCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:LargeCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nmgyr:MidCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:MidCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:MidCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:MidCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nmgyr:SmallCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:SmallCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:SmallCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:SmallCapCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nmgyr:NonUSCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:NonUSCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:NonUSCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:NonUSCoreMember mgyr:MutualFundsEquityMember\n2023-09-30\nmgyr:IntermediateDurationMember mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:IntermediateDurationMember mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:IntermediateDurationMember mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:IntermediateDurationMember mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nmgyr:ShortDurationCorporateMember mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:ShortDurationCorporateMember mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nus-gaap:CashEquivalentsMember mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nus-gaap:CashEquivalentsMember us-gaap:FairValueInputsLevel1Member mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nus-gaap:CashEquivalentsMember us-gaap:FairValueInputsLevel2Member mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nus-gaap:CashEquivalentsMember us-gaap:FairValueInputsLevel3Member mgyr:MutualFundsFixedIncomeMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member\n2023-09-30\nus-gaap:FairValueInputsLevel2Member\n2023-09-30\nus-gaap:FairValueInputsLevel3Member\n2023-09-30\nmgyr:LargeCapValueMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:LargeCapValueMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:LargeCapValueMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:LargeCapValueMember mgyr:MutualFundsEquityMember\n2022-09-30\nmgyr:LargeCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:LargeCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:LargeCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:LargeCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nmgyr:MidCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:MidCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:MidCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:MidCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nmgyr:SmallCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:SmallCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:SmallCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:SmallCapCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nmgyr:NonUSCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:NonUSCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:NonUSCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:NonUSCoreMember mgyr:MutualFundsEquityMember\n2022-09-30\nmgyr:IntermediateDurationMember mgyr:MutualFundsFixedIncomeMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:IntermediateDurationMember mgyr:MutualFundsFixedIncomeMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member mgyr:IntermediateDurationMember mgyr:MutualFundsFixedIncomeMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member mgyr:IntermediateDurationMember mgyr:MutualFundsFixedIncomeMember\n2022-09-30\nmgyr:ShortDurationCorporateMember mgyr:MutualFundsFixedIncomeMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member mgyr:ShortDurationCorporateMember mgyr:MutualFundsFixedIncomeMember\n2022-09-30\nus-gaap:CashEquivalentsMember mgyr:MoneyMarketMember\n2022-09-30\nus-gaap:CashEquivalentsMember us-gaap:FairValueInputsLevel1Member mgyr:MoneyMarketMember\n2022-09-30\nus-gaap:CashEquivalentsMember us-gaap:FairValueInputsLevel2Member mgyr:MoneyMarketMember\n2022-09-30\nus-gaap:CashEquivalentsMember us-gaap:FairValueInputsLevel3Member mgyr:MoneyMarketMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member\n2022-09-30\nus-gaap:FairValueInputsLevel2Member\n2022-09-30\nus-gaap:FairValueInputsLevel3Member\n2022-09-30\nus-gaap:InterestRateSwapMember\n2023-09-30\nus-gaap:InterestRateSwapMember\n2022-10-01 2023-09-30\nmgyr:ClassifiedInOtherAssetsMember\n2023-09-30\nmgyr:ClassifiedInOtherAssetsMember\n2022-10-01 2023-09-30\nmgyr:ThirdPartyInterestRateSwapMember\n2023-09-30\nmgyr:ThirdPartyInterestRateSwapMember\n2022-10-01 2023-09-30\nmgyr:ClassifiedInOtherLiabilitiesMember\n2023-09-30\nmgyr:ClassifiedInOtherLiabilitiesMember\n2022-10-01 2023-09-30\nus-gaap:InterestRateSwapMember\n2022-09-30\nus-gaap:InterestRateSwapMember\n2021-10-01 2022-09-30\nmgyr:OtherInterestRateSwapMember\n2022-09-30\nmgyr:OtherInterestRateSwapMember\n2021-10-01 2022-09-30\nmgyr:ClassifiedInOtherAssetsMember\n2022-09-30\nmgyr:ClassifiedInOtherAssetsMember\n2021-10-01 2022-09-30\nmgyr:ThirdPartyInterestRateSwapMember\n2022-09-30\nmgyr:ThirdPartyInterestRateSwapMember\n2021-10-01 2022-09-30\nmgyr:ClassifiedInOtherLiabilitiesMember\n2022-09-30\nmgyr:ClassifiedInOtherLiabilitiesMember\n2021-10-01 2022-09-30\nus-gaap:StandbyLettersOfCreditMember\n2023-09-30\nus-gaap:StandbyLettersOfCreditMember\n2022-09-30\nus-gaap:UnusedLinesOfCreditMember\n2023-09-30\nus-gaap:UnusedLinesOfCreditMember\n2022-09-30\nmgyr:FixedRateLoanCommitmentsMember\n2023-09-30\nmgyr:FixedRateLoanCommitmentsMember\n2022-09-30\nmgyr:LoanOriginationCommitments1Member\n2023-09-30\nmgyr:LoanOriginationCommitments1Member\n2022-09-30\nmgyr:USGovernmentEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2023-09-30\nmgyr:USGovernmentSponsoredEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentSponsoredEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentSponsoredEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentSponsoredEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsRecurringMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsRecurringMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsRecurringMember\n2023-09-30\nmgyr:USGovernmentEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2022-09-30\nmgyr:USGovernmentSponsoredEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentSponsoredEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentSponsoredEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsRecurringMember mgyr:USGovernmentSponsoredEnterprisesDebtSecuritiesResidentialMortgageBackedSecuritiesMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsRecurringMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsRecurringMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsRecurringMember\n2022-09-30\nus-gaap:FairValueMeasurementsNonrecurringMember\n2022-10-01 2023-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsNonrecurringMember\n2022-10-01 2023-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsNonrecurringMember\n2022-10-01 2023-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsNonrecurringMember\n2022-10-01 2023-09-30\nus-gaap:FairValueMeasurementsNonrecurringMember\n2023-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsNonrecurringMember\n2023-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsNonrecurringMember\n2023-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsNonrecurringMember\n2023-09-30\nus-gaap:FairValueMeasurementsNonrecurringMember\n2021-10-01 2022-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsNonrecurringMember\n2021-10-01 2022-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsNonrecurringMember\n2021-10-01 2022-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsNonrecurringMember\n2021-10-01 2022-09-30\nus-gaap:FairValueMeasurementsNonrecurringMember\n2022-09-30\nus-gaap:FairValueInputsLevel1Member us-gaap:FairValueMeasurementsNonrecurringMember\n2022-09-30\nus-gaap:FairValueInputsLevel2Member us-gaap:FairValueMeasurementsNonrecurringMember\n2022-09-30\nus-gaap:FairValueInputsLevel3Member us-gaap:FairValueMeasurementsNonrecurringMember\n2022-09-30\nmgyr:ImpairedLoansMember\n2023-09-30\nmgyr:ImpairedLoansMember\n2022-10-01 2023-09-30\nmgyr:ImpairedLoansMember\n2022-09-30\nmgyr:ImpairedLoansMember\n2021-10-01 2022-09-30\nus-gaap:CarryingReportedAmountFairValueDisclosureMember\n2023-09-30\nus-gaap:EstimateOfFairValueFairValueDisclosureMember\n2023-09-30\nus-gaap:CarryingReportedAmountFairValueDisclosureMember\n2022-09-30\nus-gaap:EstimateOfFairValueFairValueDisclosureMember\n2022-09-30\nmgyr:Tier1LeverageRatioMember us-gaap:ParentMember\n2023-09-30\nmgyr:Tier1LeverageRatioMember mgyr:SubsidiariesTwoMember\n2023-09-30\nmgyr:CET1Member us-gaap:ParentMember\n2023-09-30\nmgyr:CET1Member mgyr:SubsidiariesTwoMember\n2023-09-30\nmgyr:Tier1RiskbasedCapitalRatioMember us-gaap:ParentMember\n2023-09-30\nmgyr:Tier1RiskbasedCapitalRatioMember mgyr:SubsidiariesTwoMember\n2023-09-30\nmgyr:TotalRiskbasedCapitalRatioMember us-gaap:ParentMember\n2023-09-30\nmgyr:TotalRiskbasedCapitalRatioMember mgyr:SubsidiariesTwoMember\n2023-09-30\nmgyr:Tier1LeverageRatioMember us-gaap:ParentMember\n2022-09-30\nmgyr:Tier1LeverageRatioMember mgyr:SubsidiariesTwoMember\n2022-09-30\nmgyr:CET1Member us-gaap:ParentMember\n2022-09-30\nmgyr:CET1Member mgyr:SubsidiariesTwoMember\n2022-09-30\nmgyr:Tier1RiskbasedCapitalRatioMember us-gaap:ParentMember\n2022-09-30\nmgyr:Tier1RiskbasedCapitalRatioMember mgyr:SubsidiariesTwoMember\n2022-09-30\nmgyr:TotalRiskbasedCapitalRatioMember us-gaap:ParentMember\n2022-09-30\nmgyr:TotalRiskbasedCapitalRatioMember mgyr:SubsidiariesTwoMember\n2022-09-30\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}