{
    "cik": "1342423",
    "company": "Limoneira CO",
    "filing_type": "10-K",
    "filing_date": "2022-12-22",
    "period_of_report": "2022-10-31",
    "sic": "0100",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1031",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1342423/0001342423-22-000038-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1342423/000134242322000038/lmnr-20221031.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1342423/0001342423-22-000038.txt",
    "filename": "1342423_10K_2022_0001342423-22-000038.htm",
    "content": "Item 1. Business\nLimoneira Company, a Delaware corporation, is the successor to several businesses with operations in California since 1893. Our business and operations are described below. For detailed financial information with respect to our business and our operations, see our consolidated financial statements and the related notes to consolidated financial statements, which are included in Item 8 in this Annual Report. In addition, general information concerning our Company can be found on our website at www.limoneira.com. All of our filings with the SEC, including but not limited to, annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments thereto, are available free of charge on our website as soon as reasonably practicable after such material is electronically filed with or furnished to the SEC. The contents of our website referred to above are not incorporated into this Annual Report. Further, any references to our website are intended to be interactive textual references only.\nOverview\nWe are primarily an agribusiness company founded and based in Santa Paula, California, committed to responsibly using and managing our approximately 15,400 acres of land, water resources and other assets to maximize long-term stockholder value. Our current operations consist of fruit production, sales and marketing, rental operations, real estate and capital investment activities.\nAgribusiness activities are performed through these four reporting segments:\nWe are one of Californias oldest citrus growers. According to Sunkist Growers, Inc. (Sunkist), we are one of the largest growers of lemons in the United States and, according to the California Avocado Commission, one of the largest growers of avocados in the United States. In addition to growing lemons and avocados, we grow oranges and a variety of specialty citrus and other crops. We have agricultural plantings throughout Ventura, Tulare, San Luis Obispo and San Bernardino Counties in California, Yuma County in Arizona, La Serena, Chile and Jujuy, Argentina, which collectively consist of approximately 5,600 acres of lemons, 900 acres of avocados, 1,000 acres of oranges and 1,000 acres of specialty citrus and other crops. We also operate our own packinghouses in Santa Paula, California and Yuma, Arizona, where we process, pack and sell lemons that we grow, as well as lemons grown by others. We have a 47% interest in Rosales S.A. (Rosales), a citrus packing, marketing and sales business, a 90% interest in Fruticola Pan de Azucar S.A. (PDA), a lemon and orange orchard and a 100% interest in Agricola San Pablo SpA. (\"San Pablo\"), a lemon and orange orchard, all of which are located near La Serena, Chile. We have a 51% interest in a joint venture, Trapani Fresh Consorcio de Cooperacion (\"Trapani Fresh\"), a lemon orchard in Argentina.\nOur water resources include water rights, usage rights and pumping rights to the water in aquifers under, and canals that run through, the land we own. Water for our farming operations is sourced from the existing water resources associated with our land, which includes rights to water in the adjudicated Santa Paula Basin (aquifer) and the un-adjudicated Fillmore and Paso Robles Basins (aquifers). We use ground water from the San Joaquin Valley Basin and water from local water and irrigation districts in Tulare County, which is in Californias San Joaquin Valley. We also use ground water from the Cadiz Valley Basin in Californias San Bernardino County and surface water in Arizona from the Colorado River through the Yuma Mesa Irrigation and Drainage District (YMIDD). We use ground water provided by wells and surface water for our PDA and San Pablo farming operations in Chile and our Trapani Fresh farming operations in Argentina.\nFor more than 100 years, we have been making strategic investments in California agriculture and real estate. We currently have an interest in two real estate development projects in California. These projects include multi-family housing, single-family homes and apartments of approximately 900 units in various stages of planning and development.\nFiscal Year 2022 Highlights and Recent Developments\nWe are equal partners in a joint venture with The Lewis Group of Companies (Lewis) for the residential development of our East Area I real estate development project and formed Limoneira Lewis Community Builders, LLC (\"LLCB\") as the development entity. LLCB has closed on lot sales representing 586 units from inception through October 31, 2022. In October 2022, we entered\ninto a joint venture with Lewis for the development of our 17-acre East Area I Retained Property (Retained Property). We formed LLCB II, LLC (\"LLCB II\") as the development entity, contributed our Retained Property to the joint venture and sold a 50% interest to Lewis for $8.0 million. We recorded a gain on the transaction of approximately $4.7 million, of which $0.5 million was deferred. The joint venture partners will share in the capital contributions to fund project costs until loan proceeds and/or revenues are sufficient to fund the project. In connection with the closing, we amended LLCBs Limited Liability Company Agreement to provide that LLCB is to include the processing of final approval for additional residential units to be developed and constructed on the Retained Property. For further information see Note 5 - Real Estate Development.\nIn September 2021, we signed a Memorandum of Understanding with Wileman Bros. & Elliott, Inc. (\"Wileman\"), to form an alliance to sell their combined citrus volumes under Limoneira's One World of Citrus trademark. Wileman is a 95-year-old citrus business located in Californias Central Valley with a focus on oranges, mandarins and specialty citrus. Effective November 1, 2021, the majority of our oranges and certain specialty citrus are packed by Wileman.\nIn January 2022, we were notified of Alex M. Teagues decision to retire as Senior Vice President and Chief Operating Officer of our Company, effective February 1, 2022. In connection with his retirement, we entered into a separation agreement with Mr. Teague whereas, (i) Mr. Teague was paid one year of his annual base salary, which was paid in one lump sum within 90 business days of January 12, 2022; (ii) 23,999 shares of our common stock granted to Mr. Teague pursuant to the Limoneira Company Omnibus Incentive Plan fully vested; and (iii) Mr. Teague received certain other benefits as set forth in the agreement. In fiscal year 2022, Mr. Teague received $0.4 million cash severance and $0.3 million accelerated vesting of stock-based compensation.\nIn February 2022, we terminated our Avocado Marketing Agreement and the associated Letter Agreement Regarding Fruit Commitment with Calavo to pursue opportunities with other packing and marketing companies.\nIn March 2022, we signed an agreement to lease Finca Santa Clara, our 1,200-acre lemon ranch in Argentina, to FGF Trapani (\"FGF\"), our 49% partner in Trapani Fresh. The lease is retroactive beginning November 1, 2021, with a term of 14 months at a fixed sum of $0.4 million, payable in five equal, monthly installments from August 2022 through December 2022. We expect to extend the lease agreement for an additional year.\nIn April 2022, the promissory note previously received for the sale of our Centennial property, with a net carrying value of $2.4 million, was paid in full and the deferred gain of $0.2 million was recognized.\nIn June 2022, we engaged with YMIDD in a two-year fallowing and forbearance program at our Associated Citrus Packers, Inc. (\"Associated\") ranch in Yuma, Arizona. We expect to receive payments totaling approximately $1.3 million during the program. With the fallowing program in place, this ranch will have approximately 700 acres of productive lemons, 400 fallowed acres and 200 acres of other crops.\nIn October 2022, we sold our Oxnard Lemon property and packing facility located in Ventura County, California. We received net proceeds of $19.1 million and recognized a gain of approximately $0.8 million. Concurrent with the closing of the sale, we entered into a lease agreement to continue our use of the property as a lessee for a period of 36 months from the closing date, with extension options for an additional 24 months.\nOn December 20, 2022, we declared a cash dividend of $0.075 per common share payable on January 13, 2023, in the aggregate amount of $1.3 million to stockholders of record as of January 3, 2023.\nIn fiscal year 2020, we entered into an agreement to sell our Sevilla property for $2.7 million, which closed on November 30, 2022. We received net proceeds of $2.6 million and recorded an immaterial loss in the first quarter of fiscal year 2023.\nCOVID-19 Pandemic\nThe COVID-19 pandemic has had an adverse impact on the industries and markets in which we conduct business. In particular, the United States lemon market saw a significant decline in volume, with lemon demand falling since widespread shelter in place orders were issued in March 2020, resulting in a significant market oversupply. The export market for fresh produce also significantly declined due to the COVID-19 pandemic impacts. As of October 31, 2022, the demand within both markets is recovering but has not yet returned to pre-pandemic levels.\nThe decline in demand for our products beginning the second quarter of fiscal year 2020, which we believe was due to the COVID-19 pandemic, negatively impacted our sales and profitability for the last three quarters of fiscal year 2020 and all of fiscal years 2021 and 2022. The COVID-19 pandemic may impact our sales and profitability in future periods. The duration of these trends and the magnitude of such impacts cannot be estimated at this time, as they are influenced by a number of factors, many of which are outside managements control, including, but not limited, to those presented in Item 1A. Risk Factors\nRisks Related to Our Agribusiness Operations\nAdverse weather conditions, natural disasters, including earthquakes and wildfires, and other natural conditions, including the effects of climate change, could impose significant costs and losses on our business.\nFresh produce is vulnerable to adverse weather conditions, including windstorms, floods, drought and temperature extremes, which are quite common and may occur with higher frequency or be less predictable in the future due to the effects of climate change. Unfavorable growing conditions can reduce both crop size and crop quality. In extreme cases, entire harvests may be lost in some geographic areas. We purchase crop insurance for certain crops which partially mitigates our exposure.\nAll of our crops are subject to damage from frosts and freezes, and this has happened periodically in the past. In some cases, the fruit is damaged or ruined; in the case of extended periods of cold, the trees can also be damaged or killed.\nAdditionally, a significant portion of our agricultural plantings and our corporate headquarters are located in a region of California that is prone to natural disasters such as earthquakes and wildfires. For example, in December 2017, high winds and the related Southern California wildfires caused a brief power outage at our Santa Paula, California packinghouse and destroyed 14 of our farm worker housing units. While our orchards did not suffer significant damage in the wildfire, the potential for significant damage to a substantial amount of our plantings from a natural disaster in the future continues to exist. Furthermore, if a natural disaster or other event occurs that prevents us from using all or a significant portion of our corporate headquarters, as a result of a power outage or otherwise, or that damages critical infrastructure, it may be difficult or, in certain cases, impossible for us to continue our business for a substantial amount of time.\nFor the foregoing reasons, adverse weather conditions, natural disasters, including earthquakes and wildfires, or other natural conditions, including the effects of climate change, could severely disrupt our operations, and have a material adverse effect on our business, results of operations, financial condition and prospects.\nOur agricultural plantings are potentially subject to damage from disease and pests, which could impose losses on our business and the prevention of which could impose significant additional costs on us.\nFresh produce is vulnerable to crop disease and to pests (e.g., Mediterranean Fruit Fly and the Asian Citrus Psyllid (ACP)), which may vary in severity and effect, depending on the stage of production at the time of infection or infestation, the type of treatment applied and climatic conditions.\nACP is an aphid-like insect that is a serious pest to all citrus plants because it can transmit the disease Huanglongbing (\"HLB\") when it feeds on the plants' leaves and trees. ACP is a federal action quarantine pest subject to interstate and international quarantine restrictions by the United States Department of Agriculture (USDA), including a prohibition on the movement of nursery stock out of quarantine areas and a requirement that all citrus fruit be cleaned of leaves and stems prior to movement out of the quarantine area. Due to the discovery of ACP in our orchards, we have experienced costs related to the quarantine and treatment of ACP. To date, HLB has been detected in California, however there has been no HLB detected in our orchards. There can be no assurance that HLB will not be further detected in the future.\nThe costs to control these diseases and other infestations vary depending on the severity of the damage and the extent of the plantings affected. Moreover, there can be no assurance that available technologies to control such infestations will continue to be effective. These infestations can increase costs, decrease revenues and lead to additional charges to earnings, which may have a material adverse effect on our business, results of operations and financial condition.\nOur strategy of marketing and selling our lemons directly to our food service, wholesale and retail customers may not continue to be successful.\nDirectly obtaining and retaining customers, particularly chain stores and other large customers, is highly competitive, and the prices or other terms of our sales arrangements may not be sufficient to retain existing business, maintain current levels of profitability or obtain new business. Industry consolidation (horizontally and vertically) and other factors have increased the buying leverage of the major grocery retailers in our markets, which may put further downward pressure on our pricing and volume and could adversely affect our results of operations.\nOur earnings are sensitive to fluctuations in market supply and prices and demand for our products.\nExcess supply often causes severe price competition in our industry. Growing conditions in various parts of the world, particularly weather conditions such as windstorms, floods, droughts and freezes, as well as diseases and pests, are primary factors affecting market prices because of their influence on the supply and quality of product. The ongoing COVID-19 pandemic has also reduced the demand for our products resulting in excess supply.\nFresh produce is highly perishable and generally must be brought to market and sold soon after harvest. Some items, such as avocados, oranges and specialty citrus, must be sold more quickly, while other items, such as lemons, can be held in cold storage for longer periods of time. The selling price received for each type of produce depends on all of these factors, including the availability and quality of the produce item in the market and the availability and quality of competing types of produce.\nIn addition, general public perceptions regarding the quality, safety or health risks associated with particular food products could reduce demand and prices for some of our products. To the extent that consumer preferences evolve away from products that we produce for health or other reasons, and we are unable to modify our products or to develop products that satisfy new consumer preferences, there will be a decreased demand for our products. However, even if market prices are unfavorable, produce items which are ready to be, or have been, harvested must be brought to market promptly. A decrease in the selling price received for our products due to the factors described above could have a material adverse effect on our business, results of operations and financial condition.\nOur earnings may be subject to seasonal variability.\nOur earnings may be affected by seasonal factors, including:\nthe seasonality of our supplies and consumer demand;\nthe ability to process products during critical harvest periods; and\nthe timing and effects of ripening and perishability.\nIncreases in commodity or raw product costs, such as fuel and paper, could adversely affect our operating results.\nMany factors may affect the cost and supply of fresh produce, including external conditions, commodity market fluctuations, currency fluctuations, changes in governmental laws and regulations, agricultural programs, severe and prolonged weather conditions and natural disasters. Increased costs for purchased fruit have negatively impacted our operating results in the past, and there can be no assurance that they will not adversely affect our operating results in the future.\nThe price of various commodities can significantly affect our costs. The cost of petroleum-based products is volatile and there can be no assurance that there will not be further increases in such costs in the future. If the price of oil rises, the costs of our herbicides and pesticides can be significantly impacted.\nThe cost of paper is also significant to us because some of our products are packed in cardboard boxes for shipment. If the price of paper increases and we are not able to effectively pass these price increases along to our customers, then our operating income will decrease. Increased costs for paper have negatively impacted our operating income in the past, and there can be no assurance that these increased costs will not adversely affect our operating results in the future.\nIncreases in labor, personnel and benefits costs could adversely affect our operating results.\nWe primarily utilize labor contractors to grow, harvest and deliver our fruit to our lemon packinghouse or outside packing facilities. We utilize a combination of employees and labor contractors to process our lemons in our lemon packing facility. Our employees and contractors are in demand by other agribusinesses and other industries. Shortages of labor could delay our harvesting or lemon processing activities or could result in increases in labor costs.\nOur labor contractors and we are subject to government mandated wage and benefit laws and regulations. For example, the State of California, where a substantial number of our labor contractors are located, passed regulations that increased minimum wage rates from $14.00 per hour to $15.00 per hour, effective January 1, 2022, and will increase to $15.50 per hour in 2023. The State of Arizona wage rates rise each year based on the annual cost of living and increased from $12.15 per hour to $12.80 per hour, effective January 1, 2022, and will increase to $13.85 per hour in 2023. In addition, current or future federal or state healthcare legislation and regulation, including the Affordable Care Act, may increase our medical costs or the medical costs of our labor contractors that could be passed on to us.\nChanges in immigration laws could impact the ability of Limoneira to harvest its crops.\nWe engage third parties to provide personnel for our harvesting operations. The availability and number of such workers is subject to decrease if there are changes in U.S. immigration laws. The states in which we operate are considering or have already adopted new immigration laws or enforcement programs, and the U.S. Congress and the Department of Homeland Security from time to time consider and may implement changes to federal immigration laws, regulations or enforcement programs. Immigration laws have recently been an area of considerable focus by the Department of Homeland Security, with enforcement operations taking place across the country, resulting in arrests and detentions of unauthorized workers. Termination of a significant number of personnel who are found to be unauthorized workers or the scarcity of available personnel to harvest our agricultural products could cause harvesting costs to increase or could lead to the loss of product that is not timely harvested, which could have a material adverse effect to our citrus grove operations, financial position, results of operations and cash flows.\nThe lack of sufficient water would severely impact our ability to produce crops or develop real estate.\nThe average rainfall in Ventura, Tulare, San Luis Obispo and San Bernardino Counties in California is substantially below amounts required to grow crops and therefore we are dependent on our surface water rights and rights to pump water from underground aquifers. Extended periods of drought in California may put additional pressure on the use and availability of water for agricultural uses, and in some cases, governmental authorities have diverted water to other uses. As California has grown in population, there are increasing and multiple pressures on the use and distribution of water, which many view as a finite resource. Lack of available potable water can also limit real estate development.\nOur water resources include water rights, usage rights and pumping rights to the water in aquifers under, and canals that run through, the land we own. Water for our farming operations is sourced from the existing water resources associated with our land, which includes rights to water in the adjudicated Santa Paula Basin (aquifer) and the un-adjudicated Fillmore and Paso Robles Basins (aquifers). We use ground water and water from local water districts in Tulare County and ground water in San Bernardino County. We use federal project water in Arizona from the Colorado River through the YMIDD. We also have acquired water rights in Chile.\nCalifornia has experienced below average precipitation since the 2019 - 2020 rainfall season. According to the U.S. Drought Monitor, San Bernardino County was experiencing severe drought conditions, Ventura County was experiencing extreme drought conditions and Tulare County was experiencing exceptional drought conditions as of October 31, 2022. In October 2021, the California Governor declared a drought state of emergency statewide. Federal officials who oversee the Central Valley Project, Californias largest water delivery system, allocated 0% of the contracted amount of water to San Joaquin Valley farmers in 2022, compared to 5% in 2021 and 100% in 2017 through 2020. We are assessing the impact these reductions may have on our California orchards.\nIn August 2021, the U.S. Bureau of Reclamation declared a Level 1 Shortage Condition at Lake Mead in the Lower Colorado River Basin for the first time ever, requiring shortage reductions and water savings contributions for states in the southwest. In January 2022, Arizona experienced water releases from Lake Mead reduced by approximately 18% of the states annual apportionment. In August 2022, the U.S. Bureau of Reclamation announced Lake Mead to operate in a Tier 2 shortage, which increases water restrictions for states in the southwest. In January 2023, Arizona will forfeit approximately 21% of the state's yearly allotment of water from Lake Mead. In response, we entered into a fallowing agreement and we are assessing the impact these additional reductions may have on our Arizona orchards.\nFor fiscal year 2022, irrigation costs for our agricultural operations were $1.9 million higher than fiscal year 2021. Costs may increase as we pump more water than our historical averages and federal, state and local water delivery infrastructure costs may increase to access these limited water supplies. We have an ongoing plan for irrigation improvements continuing in fiscal year 2023 that includes drilling new wells and upgrading existing wells and irrigation systems.\nWe believe we have access to adequate supplies of water for our agricultural operations as well as our real estate development and rental operations and currently do not anticipate that future drought conditions will have a material impact on our operating results. However, if future drought conditions are worse than prior drought conditions or if regulatory responses to such conditions limit our access to water, our business could be negatively impacted by these conditions and responses in terms of access to water and/or cost of water.\nThe use of herbicides, pesticides and other potentially hazardous substances in our operations may lead to environmental damage and result in increased costs to us.\nWe use herbicides, pesticides and other potentially hazardous substances in the operation of our business. We may have to pay for the costs or damages associated with the improper application, accidental release or use or misuse of such substances. Our insurance may not be adequate to cover such costs or damages or may not continue to be available at a price or under terms that are satisfactory to us. In such cases, payment of such costs or damages could have a material adverse effect on our business, results of operations and financial condition.\nEnvironmental and other regulation of our business, including potential climate change regulation, could adversely impact us by increasing our production cost or restricting our ability to import certain products into the United States.\nOur business depends on the use of fertilizers, pesticides and other agricultural products. The use and disposal of these products in some jurisdictions are subject to regulation by various agencies. A decision by a regulatory agency to significantly restrict the use of such products that have traditionally been used in the cultivation of one of our principal products could have an adverse impact on us. Under the Federal Insecticide, Fungicide and Rodenticide Act, the Federal Food, Drug and Cosmetic Act and the Food Quality Protection Act of 1996, the EPA is undertaking a series of regulatory actions relating to the evaluation and use of pesticides in the food industry. Similarly, in the EU, regulation (EC) No. 1107/2009 fundamentally changed the pesticide approval process to hazard criteria based on the intrinsic properties of the substance. These actions and future actions regarding the availability and use of pesticides could have an adverse effect on us. In addition, if a regulatory agency were to determine that we are not in compliance with a regulation in that agencys jurisdiction, this could result in substantial penalties and a ban on the sale of part or all of our products in that jurisdiction.\nA global economic downturn may have an adverse impact on participants in our industry, which cannot be fully predicted.\nThe full impact of a global economic downturn on customers, vendors and other business partners, such as that seen with the COVID-19 pandemic, cannot be anticipated. For example, major customers or vendors may have financial challenges unrelated to us that could result in a decrease in their business with us or, in extreme cases, cause them to file for bankruptcy protection. Similarly, parties to contracts may be forced to breach their obligations under those contracts. Although we exercise prudent oversight of the credit ratings and financial strength of our major business partners and seek to diversify our risk to any single business partner, there can be no assurance that there will not be a bank, insurance company, supplier, customer or other financial\npartner that is unable to meet its contractual commitments to us. Similarly, stresses and pressures in the industry may result in impacts on our business partners and competitors, which could have wide-ranging impacts on the future of the industry.\nWe are subject to the risk of product contamination and product liability claims.\nThe sale of food products for human consumption involves the risk of injury to consumers. Such injuries may result from tampering by unauthorized third parties, product contamination or spoilage, including the presence of foreign objects, substances, chemicals, other agents, or residues introduced during the growing, storage, handling or transportation phases. While we are subject to governmental inspection and regulations and believe our facilities comply in all material respects with all applicable laws and regulations, we cannot be sure that consumption of our products will not cause a health-related illness in the future or that we will not be subject to claims or lawsuits relating to such matters. Even if a product liability claim is unsuccessful or is not fully pursued, the negative publicity surrounding any assertion that our products caused illness or injury could adversely affect our reputation with existing and potential customers and our corporate and brand image. Moreover, claims or liabilities of this sort might not be covered by our insurance or by any rights of indemnity or contribution that we may have against others. We maintain product liability insurance, however we cannot be sure that we will not incur claims or liabilities for which we are not insured or that exceed the amount of our insurance coverage.\nWe are subject to transportation risks.\nAn extended interruption in our ability to ship our products could have a material adverse effect on our business, financial condition and results of operations. Similarly, any extended disruption in the distribution of our products or supply chain issues could have a material adverse effect on our business, financial condition and results of operations. While we believe we are adequately insured and would attempt to transport our products by alternative means if we were to experience an interruption due to strike, natural disasters or otherwise, we cannot be sure that we would be able to do so or be successful in doing so in a timely and cost-effective manner.\nEvents or rumors relating to LIMONEIRA or our other trademarks and related brands could significantly impact our business.\nConsumer and institutional recognition of the LIMONEIRA, One World of Citrus®, Santa®, Paula®, Bridal Veil®, Fountain®, Golden Bowl®, Level®, Kiva®, Kachina®, Oxnard Lemon and Trapani Fresh trademarks and related brands and the association of these brands with high quality and safe food products are an integral part of our business. The occurrence of any events or rumors that cause consumers and/or institutions to no longer associate these brands with high quality and safe food products may materially adversely affect the value of our brand names and demand for our products.\nGovernment regulation could increase our costs of production and increase legal and regulatory expenses.\nGrowing, packaging, storing and distributing food products are activities subject to extensive federal, state and local regulation, as well as foreign regulation. The U.S. Food and Drug Administration (the FDA), the USDA and various state and local public health and agricultural agencies regulate these aspects of our operations. Our business is subject to the FDA Food Safety Modernization Act to ensure food safety. This Act provides direct recall authority to the FDA and includes a number of other provisions designed to enhance food safety, including increased inspections by the FDA of food facilities. The Federal Perishable Agricultural Commodities Act, which specifies standards for the sale, shipment, inspection and rejection of agricultural products, governs our relationships with our fresh food suppliers with respect to the grading and commercial acceptance of product shipments. Import and export controls and similar laws and regulations, in both the United States and elsewhere affect our business. Issues such as health and safety, which may slow or otherwise restrict imports and exports, could adversely affect our business. In addition, the modification of existing laws or regulations or the introduction of new laws or regulations could require us to make material expenditures or otherwise adversely affect the way that we have historically operated our business.\nOur strategy to expand international production and marketing may not be successful and may subject us to risks associated with doing business in corrupt environments.\nWhile we intend to expand our lemon supply sources to international markets and explore opportunities to expand our international production and marketing of lemons, we may not be successful in implementing this strategy. Additionally, in many countries outside of the United States, particularly in those with developing economies, it may be common for others to engage in business practices prohibited by laws and regulations applicable to us, such as the Foreign Corrupt Practices Act or similar local anti-bribery laws. These laws generally prohibit companies and their employees, contractors or agents from making improper payments to government officials for the purpose of obtaining or retaining business. Failure to comply with these laws could subject us to civil and criminal penalties that could materially and adversely affect our financial condition and results of operations.\nWe depend on our infrastructure to have sufficient capacity to handle our annual lemon production needs.\nWe have an infrastructure that has sufficient capacity for our lemon production needs, but if we lose machinery or facilities due to natural disasters or mechanical failure, we may not be able to operate at a sufficient capacity to meet our lemon production needs. This could have a material adverse effect on our business, which could impact our results of operations and our financial condition.\nRisks Related to Our Indebtedness\nWe may be unable to generate sufficient cash flow to service our debt obligations.\nTo service our debt, we require a significant amount of cash. Our ability to generate cash, make scheduled payments or refinance our obligations depends on our successful financial and operating performance. Our financial and operating performance, cash flow and capital resources depend upon prevailing economic conditions and various financial, business and other factors, many of which are beyond our control. These factors include among others:\neconomic and competitive conditions;\nchanges in laws and regulations;\noperating difficulties, increased operating costs or pricing pressures we may experience; and\ndelays in implementing any strategic projects.\nIf our cash flow and capital resources are insufficient to fund our debt service obligations, we may be forced to reduce or delay capital expenditures, sell material assets or operations, obtain additional capital or restructure our debt. If we are required to take any actions referred to above, it could have a material adverse effect on our business, financial condition and results of operations. In addition, we cannot assure you that we would be able to take any of these actions on terms acceptable to us, or at all, or that these actions would enable us to continue to satisfy our capital requirements or that these actions would be permitted under the terms of our various debt agreements.\nRestrictive covenants in our debt instruments restrict or prohibit our ability to engage in or enter into a variety of transactions, which could adversely restrict our financial and operating flexibility and subject us to other risks.\nOur revolving and non-revolving credit and term loan facilities contain various restrictive covenants that limit our ability to take certain actions. In particular, these agreements limit our ability to, among other things:\nincur additional indebtedness;\nmake certain investments or acquisitions;\ncreate certain liens on our assets;\nengage in certain types of transactions with affiliates;\nmerge, consolidate or transfer substantially all our assets; and\ntransfer and sell assets.\nOur revolving and non-revolving credit facility with the Farm Credit West Credit Facility contain a financial covenant that requires us to maintain compliance with a specified debt service coverage ratio greater than or equal to 1:25:1.0 on an annual basis. At October 31, 2022, we were in compliance with such debt service coverage ratio. Our failure to comply with this covenant in the future may result in the declaration of an event of default under our Farm Credit West Credit Facility.\nAny or all of these covenants could have a material adverse effect on our business by limiting our ability to take advantage of financing, merger and acquisition or other corporate opportunities and to fund our operations. Any future debt could also contain financial and other covenants more restrictive than those imposed under our line of credit and term loan facilities. A breach of a covenant or other provision in any credit facility governing our current and future indebtedness could result in a default under that facility and, due to cross-default and cross-acceleration provisions, could result in a default under our other credit facilities. Upon the occurrence of an event of default under any of our credit facilities, the applicable lender(s) could elect to declare all amounts outstanding to be immediately due and payable and, with respect to our revolving credit facility, terminate all commitments to extend further credit. If we were unable to repay those amounts, our lenders could proceed against the collateral granted to them to secure the indebtedness. If the lenders under our current or future indebtedness were to accelerate the payment of the indebtedness, we cannot assure you that our assets or cash flow would be sufficient to repay in full our outstanding indebtedness.\nDespite our relatively high current indebtedness levels and the restrictive covenants set forth in agreements governing our indebtedness, we may still incur significant additional indebtedness, including secured and guaranteed indebtedness. Incurring more indebtedness could increase the risks associated with our substantial indebtedness.\nSubject to the restrictions in our credit facilities, we may incur significant additional indebtedness. If new debt is added to our current debt levels, the related risks that we now face could increase.\nIn January 2018, LLCB entered into a $45.0 million unsecured Line of Credit Loan Agreement and Promissory Note (the Loan) with Bank of America, N.A. to fund early development activities. The Loan, as modified and extended, matures February 22, 2023 and has a one-year extension option through February 22, 2024 subject to terms and conditions as defined in the agreement, with the maximum borrowing amount reduced to $35.0 million during the extension period. In December 2022, LLCB exercised the extension option. The Loan contains certain customary default provisions and LLCB may prepay any amounts outstanding under the Loan without penalty. The obligations under the Loan are guaranteed by certain principals from Lewis and us. Defaults by LLCB could increase our indebtedness.\nSome of our debt is based on variable rates of interest, which could result in higher interest expenses in the event of an increase in the interest rates.\nOur Farm Credit West Credit Facility currently bears interest at a variable rate, which will generally change as interest rates change. We bear the risk that the rates we are charged by our lender will increase faster than the earnings and cash flow of our business, which could reduce profitability, adversely affect our ability to service our debt, cause us to breach covenants contained in our Farm Credit West Credit Facility, which could materially adversely affect our business, financial condition and results of operations. Several of our Companys debt agreements use LIBOR as a reference rate, which will be converted to the Secure Overnight Financing Rate (\"SOFR\") on January 1, 2023.\nGlobal capital and credit market issues affect our liquidity, increase our borrowing costs and may affect the operations of our suppliers and customers.\nThe global capital and credit markets have experienced increased volatility and disruption over the past several years, making it more difficult for companies to access those markets. We depend in part on stable, liquid and well-functioning capital and credit markets to fund our operations. Although we believe that our operating cash flows and existing credit facilities will permit us to meet our financing needs for the foreseeable future, there can be no assurance that continued or increased volatility and disruption in the capital and credit markets will not impair our liquidity or increase our costs of borrowing. Our business could also be negatively impacted if our suppliers or customers experience disruptions resulting from tighter capital and credit markets or a slowdown in the general economy.\nRisks Related to Our Real Estate Development Operations\nWe are involved in a cyclical industry and are affected by changes in general and local economic conditions.\nThe real estate development industry is cyclical and is affected by changes in general and local economic conditions, including:\nemployment levels;\navailability of financing;\ninterest rates;\nconsumer confidence;\ndemand for the developed product, whether residential or industrial;\nsupply of similar product, whether residential or industrial; and\nlocal, state and federal government regulation, including eminent domain laws, which may result in taking for less compensation than the owner believes the property is worth.\nThe process of project development and the commitment of financial and other resources occur long before a real estate project comes to market. A real estate project could come to market at a time when the real estate market is depressed. It is also possible in a rural area like ours that no market for the project will develop as projected.\nA recession in the global economy, or a downturn in national or regional economic conditions, could adversely impact our real estate development business.\nFuture economic instability or tightening in the credit markets could lead to another housing market collapse, which could adversely affect our real estate development operations and those of our equity method investments. Future real estate sales, revenues, financial condition, results of operations and equity in earnings of investments could suffer as a result. Our business is sensitive to economic conditions in California, where our real estate development properties are located.\nHigher interest rates and lack of available financing can have significant impacts on the real estate industry.\nHigher interest rates generally impact the real estate industry by making it harder for buyers to qualify for financing, which can lead to a decrease in the demand for residential, commercial or industrial sites. Any decrease in demand will negatively impact our proposed developments. In 2022, the Board of Governors of the Federal Reserve System took actions in tightening the monetary policy that resulted in higher interest rates prevailing in the marketplace. Market interest rates may continue to increase in the future and the increase may materially and negatively affect us. Lack of available credit to finance real estate purchases can also negatively impact demand. Any downturn in the economy or consumer confidence can also be expected to result in reduced housing demand and slower industrial development, which would negatively impact the demand for land we are developing.\nWe are subject to various land use regulations and require governmental approvals for our developments that could be denied.\nIn planning and developing our land, we are subject to various local, state, and federal statutes, ordinances, rules and regulations concerning zoning, infrastructure design, subdivision of land, and construction. All of our new developments require amending existing general plan and zoning designations, so it is possible that our entitlement applications could be denied. In addition, the zoning that ultimately is approved could include density provisions that would limit the number of homes and other structures that could be built within the boundaries of a particular area, which could adversely impact the financial returns from a given project. In addition, in the past, many states, cities and counties (including Ventura County) have approved various slow growth or urban limit line measures.\nIf unforeseen regulatory challenges with East Areas I and II occur, we may not be able to develop these projects as planned.\nThird-party litigation could increase the time and cost of our real estate development efforts.\nThe land use approval processes we must follow to ultimately develop our projects have become increasingly complex. Moreover, the statutes, regulations and ordinances governing the approval processes provide third parties the opportunity to challenge the proposed plans and approvals. As a result, the prospect of third-party challenges to planned real estate developments provides additional uncertainties in real estate development planning and entitlements. Third-party challenges in the form of litigation would, by their nature, adversely affect the length of time and the cost required to obtain the necessary approvals. In addition, adverse decisions arising from any litigation would increase the costs and length of time to obtain ultimate approval of a project and could adversely affect the design, scope, plans and profitability of a project.\nWe are subject to environmental regulations and opposition from environmental groups that could cause delays and increase the costs of our real estate development efforts or preclude such development entirely.\nEnvironmental laws that apply to a given site can vary greatly according to the sites location and condition, the present and former uses of the site, and the presence or absence of sensitive elements like wetlands and endangered species. Environmental laws and conditions may (i) result in delays, (ii) cause us to incur additional costs for compliance, where a significant amount of our developable land is located, mitigation and processing land use applications, or (iii) preclude development in specific areas. In addition, in California, third parties have the ability to file litigation challenging the approval of a project, which they usually do by alleging inadequate disclosure and mitigation of the environmental impacts of the project. While we have worked with representatives of various environmental interests and wildlife agencies to minimize and mitigate the impacts of our planned projects, certain groups opposed to development may oppose our projects vigorously, so litigation challenging their approval could occur. Recent concerns over the impact of development on water availability and global warming increases the breadth of potential obstacles that our developments face.\nOur real estate development projects are concentrated entirely in California.\nAll of our real estate development projects are located in California, and our business is especially sensitive to the economic conditions within California. Any adverse change in the economic climate of California, and any adverse change in the political or\nregulatory climate of California or Ventura County, could adversely affect our real estate development activities. Ultimately, our ability to sell or lease lots may decline as a result of weak economic conditions or restrictive regulations.\nIf the real estate industry weakens or instability of the mortgage industry and commercial real estate financing exists, it could have an adverse effect on our real estate activities.\nIf the residential real estate market weakens or instability of the mortgage industry and commercial real estate financing exists, our residential real estate business could be adversely affected. An excess supply of homes available due to foreclosures or the expectation of deflation in house prices could also have a negative impact on our ability to sell our inventory when it becomes available.\nWe rely on contractual arrangements with third-party advisors to assist us in carrying out our real estate development projects and are subject to risks associated with such arrangements.\nWe utilize third-party contractor and consultant arrangements to assist us in operating our real estate development segment. These contractual arrangements may not be as effective in providing direct control over this business segment. For example, our third-party advisors could fail to take actions required for our real estate development businesses despite their contractual obligation to do so. If the third-party advisors fail to perform under their agreements with us, we may have to rely on legal remedies under the law, which may not be effective. In addition, we cannot assure you that our third-party advisors would always act in our best interests.\nIf we are unable to complete land development projects within forecasted time and budget expectations, if at all, our financial results may be negatively affected.\nWe intend to develop land and real estate properties as suitable opportunities arise, taking into consideration the general economic climate. New real estate development projects have a number of risks, including the following:\nconstruction delays or cost overruns that may increase project costs;\nreceipt of zoning, occupancy and other required governmental permits and authorizations;\ndevelopment costs incurred for projects that are not pursued to completion;\nearthquakes, hurricanes, floods, fires or other natural disasters that could adversely affect a project;\ndefects in design or construction that may result in additional costs to remedy or require all or a portion of a property to be closed during the period required to rectify the situation;\nour ability to raise capital;\nthe impact of governmental assessments such as park fees or affordable housing requirements;\ngovernmental restrictions on the nature and size of a project or timing of completion; and\nthe potential lack of adequate building/construction capacity for large development projects.\nIf any development project is not completed on time or within budget, our financial results may be negatively affected.\nIf we are unable to obtain required land use entitlements at reasonable costs, or at all, our operating results would be adversely affected.\nThe financial performance of our real estate development activities is closely related to our success in obtaining land use entitlements for proposed development projects. Obtaining all of the necessary entitlements to develop a parcel of land is often difficult, costly and may take several years, or more, to complete. In some situations, we may be unable to obtain the necessary entitlements to proceed with a real estate development or may be required to alter our plans for the development. Delays or failures to obtain these entitlements may have a material adverse effect on our financial results.\nWe could experience a reduction in revenues or reduced cash flows if we are unable to obtain reasonably priced financing to support our real estate development projects and land development activities.\nThe real estate development industry is capital intensive, and development requires significant up-front expenditures to develop land and begin real estate construction. Accordingly, we have and may continue to incur substantial indebtedness to finance our real estate development and land development activities. Although we believe that internally generated funds and current and available borrowing capacity will be sufficient to fund our capital and other expenditures, including additional land acquisition, development and construction activities, and the amounts available from such sources may not be adequate to meet our needs. If such sources\nwere insufficient, we would seek additional capital in the form of debt from a variety of potential sources, including bank financing. The availability of borrowed funds to be used for additional land acquisition, development and construction may be greatly reduced, and the lending community may require increased amounts of equity to be invested in a project by borrowers in connection with new loans. The failure to obtain sufficient capital to fund our planned expenditures could have a material adverse effect on our business and operations and our results of operations in future periods.\nWe may encounter risks associated with the real estate joint ventures we entered into in November 2015 and October 2022 with the Lewis Group of Companies including:\nthe joint ventures may not perform financially or operationally as expected;\nland values, project costs, sales absorption or other assumptions included in the development plans may cause the joint ventures operating results to be less than expected;\nthe joint ventures may not be able to obtain project loans on acceptable terms;\nthe joint venture partners may not be able to provide capital to the joint ventures in the event external financing or project cash flows are not sufficient to finance the joint ventures operations;\nthe joint venture partners may not manage the project properly; and\ndisagreements could occur between the joint venture partners that could affect the operating results of the joint ventures or could result in a sale of a partners interest or the joint ventures at undesirable values.\nWe may encounter other risks that could impact our ability to develop our land.\nWe may also encounter other difficulties in developing our land, including:\nnatural risks, such as geological and soil problems, earthquakes, fire, heavy rains and flooding and heavy winds;\nshortages of qualified trades people;\nreliance on local contractors, who may be inadequately capitalized;\nshortages of materials;\nincreases in the cost of certain materials; and\nenvironmental remediation costs.\nGeneral Risks and Risks Related to Our Common Stock\nOur business is highly competitive and we cannot assure you that we will maintain our current market share.\nMany companies compete in our different businesses. However, only a few well-established companies operate on an international, national and regional basis with one or several product lines. We face strong competition from these and other companies in all our product lines.\nImportant factors with respect to our competitors include the following:\nSome of our competitors may have greater operating flexibility and, in certain cases, this may permit them to respond better or more quickly to changes in the industry or to introduce new products and packaging more quickly and with greater marketing support.\nWe cannot predict the pricing or promotional actions of our competitors or whether those actions will have a negative effect on us.\nThere can be no assurance that we will continue to compete effectively with our present and future competitors, and our ability to compete could be materially adversely affected by our debt levels and debt service requirements.\nCurrency exchange fluctuation may impact the results of our operations.\nWe distribute our products both nationally and internationally. Our international sales are primarily transacted in U.S. dollars. Our results of operations are affected by fluctuations in currency exchange rates in both sourcing and selling locations. In the past, periods of a strong U.S. dollar relative to other currencies have led international customers, particularly in Asia, to find alternative sources of fruit.\nWe are dependent on key personnel and the loss of one or more of those key personnel may materially and adversely affect our prospects.\nWe currently depend heavily on the services of our key management personnel. The loss of any key personnel could materially and adversely affect our results of operations or financial condition. Our success will also depend in part on our ability to attract and retain additional qualified management personnel.\nInflation can have a significant adverse effect on our operations.\nInflation can have a major impact on our agribusiness operations. The farming operations are most affected by escalating costs and unpredictable revenues (due to an oversupply of certain crops) and very high irrigation water costs. High fixed water costs related to our farm lands will continue to adversely affect earnings. Prices received for many of our products are dependent upon prevailing market conditions and commodity prices. Therefore, it is difficult for us to accurately predict revenue and we cannot pass on cost increases caused by general inflation, except to the extent reflected in market conditions and commodity prices.\nSystem security risks, data protection breaches, cyber-attacks and systems integration issues could disrupt our internal operations or services provided to customers, and any such disruption could reduce our expected revenue, increase our expenses, damage our reputation and adversely affect our stock price.\nComputer programmers and hackers may be able to penetrate our network security and misappropriate or compromise our confidential information or that of third parties, create system disruptions or cause shutdowns. Computer programmers and hackers also may be able to develop and deploy viruses, worms, and other malicious software programs that attack our products or otherwise exploit any security vulnerabilities of our products. In addition, sophisticated hardware and operating system software and applications that we produce or procure from third parties may contain defects in design or manufacture, including bugs and other problems that could unexpectedly interfere with the operation of the system. The costs to us to eliminate or alleviate cyber or other security problems, bugs, viruses, worms, malicious software programs and security vulnerabilities could be significant, and our efforts to address these problems may not be successful and could result in interruptions, delays, cessation of service and loss of existing or potential customers that may impede our sales, packing, distribution or other critical functions.\nPortions of our IT infrastructure also may experience interruptions, delays or cessations of service or produce errors in connection with systems integration or migration work that takes place from time to time. We may not be successful in implementing new systems and transitioning data, which could cause business disruptions and be more expensive, time consuming, disruptive and resource-intensive. Such disruptions could adversely impact our ability to fulfill orders and interrupt other processes. Delayed sales, lower margins or lost customers resulting from these disruptions could adversely affect our financial results, stock price and reputation.\nThe acquisition of other businesses could pose risks to our operating income.\nWe intend to continue to consider acquisition prospects that complement our business. While we are not currently a party to any agreement with respect to any acquisitions, we may acquire other businesses in the future. Future acquisitions by us could result in accounting charges, potentially dilutive issuances of equity securities, and increased debt and contingent liabilities, any of which could have a material adverse effect on our business and the market price of our common stock. Acquisitions entail numerous risks, including the integration of the acquired operations, diversion of managements attention to other business concerns, risks of entering markets in which we have limited prior experience, and potential loss of key employees of acquired organizations. We may be unable to successfully integrate businesses or the personnel of any business that might be acquired in the future, and our failure to do so could have a material adverse effect on our business and on the market price of our common stock.\nThe value of our common stock could be volatile.\nInvesting in our common stock involves a high degree of risk. There are numerous and varied risks, known and unknown, that may prevent us from achieving our goals. The risks described here are not the only ones we will face. If any of these risks or other risks actually occurs, our business, financial condition, results of operations or future prospects could be materially and adversely affected. In such event, the trading price of our common stock could decline and investors in our common stock could lose all or part of their investment.\nThe overall market and the price of our common stock may fluctuate greatly and we cannot assure you that you will be able to resell shares at or above market price. The trading price of our common stock may be significantly affected by various factors, including:\nquarterly fluctuations in our operating results;\nchanges in investors and analysts perception of the business risks and conditions of our business;\nour ability to meet the earnings estimates and other performance expectations of financial analysts or investors;\nunfavorable commentary or downgrades of our stock by equity research analysts;\nfluctuations in the stock prices of our peer companies or in stock markets in general; and\ngeneral economic or political conditions.\nConcentrated ownership of our common stock creates a risk of sudden change in our share price.\nAs of October 31, 2022, directors and members of our executive management team beneficially owned or controlled approximately 3.2% of our common stock. Investors who purchase our common stock may be subject to certain risks due to the concentrated ownership of our common stock. The sale by any of our large stockholders of a significant portion of that stockholders holdings could have a material adverse effect on the market price of our common stock. In addition, the registration of any significant amount of additional shares of our common stock will have the immediate effect of increasing the public float of our common stock and any such increase may cause the market price of our common stock to decline or fluctuate significantly.\nOur charter documents contain provisions that may delay, defer or prevent a change of control.\nProvisions of our certificate of incorporation and bylaws could make it more difficult for a third-party to acquire control of us, even if the change in control would be beneficial to stockholders. These provisions include the following:\ndivision of our board of directors into three classes, with each class serving a staggered three-year term;\nremoval of directors by stockholders by a supermajority of two-thirds of the outstanding shares;\nability of the board of directors to authorize the issuance of preferred stock in series without stockholder approval; and\nprohibitions on our stockholders that prevent them from acting by written consent and limitations on calling special meetings.\nWe incur increased costs as a result of being a publicly traded company.\nAs a Company with publicly traded securities, we have incurred, and will continue to incur, significant legal, accounting and other expenses. In addition, the Sarbanes-Oxley Act of 2002, as well as rules promulgated by the SEC and NASDAQ, require us to adopt corporate governance practices applicable to U.S. public companies. These rules and regulations may increase our legal and financial compliance costs, which could adversely affect the trading price of our common stock. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nReal Estate\nWe own our corporate headquarters in Santa Paula, California. We own approximately 8,300 acres of farm land in California, 1,200 acres located in Yuma, Arizona, 3,500 acres in La Serena, Chile and 1,200 acres in Jujuy, Argentina. We also lease approximately 1,000 acres of land and have an interest in a partnership that owns approximately 200 acres of land. The land used for agricultural plantings consists of approximately 5,600 acres of lemons, approximately 900 acres of avocados, approximately 1,000 acres of oranges and approximately 1,000 acres of specialty citrus and other crops. Our agribusiness land holdings are summarized below as of October 31, 2022 (in thousands, except per acre amounts):\nRanch Name Acres Book Value Acquisition Date Book Value\nper Acre\nLimoneira/Olivelands Ranch 1,700 $ 767 1907, 1913, 1920 $ 451\nLa Campana Ranch 300 758 1964 $ 2,527\nOrchard Farm Ranch 1,100 3,240 1990 $ 2,945\nRancho La Cuesta Ranch 200 2,899 1994 $ 14,495\nPorterville Ranch 700 6,427 1997 $ 9,181\nDucor Ranch 900 6,223 1997 $ 6,914\nJencks Ranch 100 846 2007 $ 8,460\nWindfall Farms 700 16,162 2009 $ 23,089\nStage Coach Ranch 100 603 2012 $ 6,030\nMartinez Ranch 200 1,363 2012 $ 6,815\nAssociated Citrus Packers 1,300 15,035 2013 $ 11,565\nLemons 400 800 5,182 2013 $ 6,478\nSheldon Ranches 600 9,618 2016 $ 16,030\nPan de Azucar 200 2,292 2017 $ 11,461\nSan Pablo 3,300 5,586 2018 $ 1,693\nSanta Clara 1,200 8,600 2019 $ 7,167\nOther agribusiness land 400 1,539 various $ 3,848\n13,800 $ 87,140\nThe book value of our agribusiness land holdings of approximately $87.1 million differs from the land balance of $87.6 million included in property, plant and equipment in the notes to the consolidated financial statements in Item 8 of this Annual Report. The table above presents our current land holdings in farming agribusiness operations.\nWe own our packing facilities located in Santa Paula, California and Yuma, Arizona, where we process and pack our lemons as well as lemons for other growers. We have a 5.5 acre, one-megawatt ground-based photovoltaic solar generator and one-megawatt roof array, which provides the majority of the power to operate our packing facility. We also have a one-megawatt solar array that provides us with a majority of the electricity required to operate four deep water well pumps at one of our ranches in the San Joaquin Valley.\nWe own and maintain 257 residential units mainly in Ventura and Tulare Counties that we lease to our employees, former employees and outside tenants and we own several commercial office buildings and properties that are leased to various tenants.\nWe own and have equity investments in real estate development property in the California County of Ventura. These properties are in various stages of development for up to approximately 900 residential units and approximately 811,000 square feet of commercial space.\nWater and Mineral Rights\nOur water resources include water rights, usage rights and pumping rights to the water in aquifers under, and canals that run through, the land we own. We believe we have adequate supplies of water for our agribusiness segments as well as our rental and real estate development activities. Water for our farming operations located in Ventura County, California is sourced from the existing water resources associated with our land, which includes approximately 8,600 acre-feet of adjudicated water rights in the Santa Paula Basin (aquifer) and the un-adjudicated Fillmore Basin. We use a combination of ground water provided by wells that derive water from the San Joaquin Valley Basin and water from various water districts and irrigation districts in Tulare County, California, which is in the agriculturally productive San Joaquin Valley. We use ground water provided by wells that derive water from the Cadiz Valley Basin at the Cadiz Ranch in San Bernardino County, California. Our Windfall Farms property located in San Luis Obispo County, California obtains water from wells that derive water from the Paso Robles Basin. Our Associated farming operations in Yuma, Arizona source water from the Colorado River through the YMIDD, where we have access to approximately 11,700 acre feet of Class 3 Colorado River water rights. We use ground water provided by wells and surface water for our PDA and San Pablo farming operations in La Serena, Chile and our Trapani Fresh farming operations in Argentina.\nOur rights to extract groundwater from the Santa Paula Basin are governed by the Santa Paula Basin Judgment (the Judgment). The Judgment was entered into in 1996 by stipulation among the United Water Conservation District, the City of Ventura and various members of the Santa Paula Basin Pumpers Association (the Association). The Association is a not-for-profit, mutual benefit corporation, which represents the interests of all overlying landowners with rights to extract groundwater from the Santa Paula Basin and the City of Santa Paula. We are a member of the Association. Membership in the Association is governed by the Association's Bylaws.\nOur California water resources include approximately 17,000 acre-feet of water affiliated with our owned properties, of which approximately 8,600 acre-feet are adjudicated. Our Yuma, Arizona water resources include approximately 11,700 acre-feet of water sourced from the Colorado River. We own shares in five not-for-profit mutual benefit water companies. Our investments in these water companies provide us with the right to receive a proportionate share of water from each of the water companies.\nWe believe water is a natural resource that is critical to economic growth in the western United States and firm, reliable water rights are essential to our sustainable business practices. Consequently, we have long been a private steward and advocate of prudent and efficient water management. We have made substantial investments in securing water and water rights in quantities that are sufficient to support and, we believe will exceed, our long-term business objectives. We strive to follow best management practices for the diversion, conveyance, distribution and use of water. In the future, we intend to continue to provide leadership in the area of, and seek innovation opportunities that promote, increased water use efficiency and the development of new sources of supply for our neighboring communities. Item 3. Legal Proceedings\nFrom time to time, we are a party to various lawsuits, arbitrations or mediations that arise in the ordinary course of business. The disclosure called for by Part II, Item 3 regarding our legal proceedings is incorporated by reference herein from Note 17 - Commitments and Contingencies of the Notes to Consolidated Financial Statements in this Annual Report. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock is traded on The NASDAQ Stock Market LLC (NASDAQ) under the symbol LMNR. There is no assurance that our common stock will continue to be traded on NASDAQ or that any liquidity will exist for our stockholders.\nHolders\nOn November 30, 2022, there were approximately 226 registered holders of our common stock. The number of registered holders includes banks and brokers who act as nominees, each of whom may represent more than one stockholder.\nDividends\nThe following table presents cash dividends per common share declared and paid in the periods shown.\nDividend\nFourth Quarter Ended October 31, 2022 $ 0.075\nThird Quarter Ended July 31, 2022 $ 0.075\nSecond Quarter Ended April 30, 2022 $ 0.075\nFirst Quarter Ended January 31, 2022 $ 0.075\nFourth Quarter Ended October 31, 2021 $ 0.075\nThird Quarter Ended July 31, 2021 $ 0.075\nSecond Quarter Ended April 30, 2021 $ 0.075\nFirst Quarter Ended January 31, 2021 $ 0.075\nIn December 2022, we declared our quarterly dividend of $0.075 per common share and we expect to continue to pay quarterly dividends at a similar rate to the extent permitted by the financial results of our business and other factors beyond managements control.\nPerformance Graph\nThe line graph above compares the percentage change in cumulative total stockholder return of our common stock registered under Section 12 of the Securities Exchange Act of 1934, as amended (the Exchange Act) with (i) the cumulative total return of the Russell 2000 Index, assuming reinvestment of dividends, and (ii) the cumulative total return of Dow Jones U.S. Food Producers Index, assuming reinvestment of dividends.\nRecent Sales of Unregistered Securities\nNone.\nPurchases of Equity Securities by Issuer and Affiliated Purchasers\nPeriod Total Number of Shares Purchased(1) Weighted Average Price Paid per Share Total Number of Shares Purchased as Part of Publicly Announced Plans or Programs(2) Maximum Number (or Approximate Dollar Value) of Shares that May Yet Be Purchased Under the Plans or Programs(2)\nAugust 1, 2022 through August 31, 2022 - $ - - -\nSeptember 1, 2022 through September 30, 2022 - $ - - -\nOctober 1, 2022 through October 31, 2022 37,236 $ 11.93 - -\nTotal 37,236 - -\n(1) Shares were acquired from our employees in accordance with our stock-based compensation plan as a result of share withholdings to pay income tax related to the vesting and distribution of restricted stock awards.\n(2) In fiscal year 2021, our Company's Board of Directors approved a share repurchase program authorizing us to repurchase up to $10.0 million of our outstanding shares of common stock through September 2022. No shares have been repurchased under this program. As of October 31, 2022, the program has expired and there is no remaining authorization under this program. Item 6. Reserved Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management's Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to promote understanding of the results of operations and financial condition. MD&A is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and the accompanying Notes to Consolidated Financial Statements (Part II, Item 8 of this Form 10-K). This discussion and analysis contains forward-looking statements that involve risks, uncertainties, and assumptions. Actual results may differ materially from those anticipated in these forward-looking statements as a result of various factors, including, but not limited to, those presented under Risk Factors included in Item 1A and elsewhere in this Annual Report on Form 10-K. This section generally discusses the results of operations for fiscal year 2022 compared to fiscal year 2021. For discussion related to the results of operations and changes in financial condition for fiscal year 2021 compared to fiscal year 2020 refer to Part II, Item 7, Management's Discussion and Analysis of Financial Condition and Results of Operations in our fiscal year 2021 Form 10-K, which was filed with the United States Securities and Exchange Commission (SEC) on January 10, 2022.\nOverview\nLimoneira Company, a Delaware corporation, is the successor to several businesses with operations in California since 1893. We are primarily an agribusiness company founded and based in Santa Paula, California, committed to responsibly using and managing our approximately 15,400 acres of land, water resources and other assets to maximize long-term stockholder value. Our current operations consist of fruit production, sales and marketing, rental operations, real estate and capital investment activities.\nWe have three business divisions: agribusiness, rental operations and real estate development. The agribusiness division is comprised of four reportable operating segments: fresh lemons, lemon packing, avocados and other agribusiness, which includes oranges, specialty citrus and other crops. The agribusiness division includes our core operations of farming, harvesting, lemon packing and citrus sales operations. The rental operations division includes our residential and commercial rentals comprised of 257 completed rental units, leased land operations and organic recycling. The real estate development division includes our investments in real estate development projects. Generally, we see our Company as a land and farming company that generates annual cash flows to support our progress into diversified real estate development activities. As real estate developments are monetized, our agriculture business will then be able to expand more rapidly into new regions and markets.\nRecent Developments - Refer to Part I, Item 1 Fiscal Year 2022 Highlights and Recent Developments\nResults of Operations\nThe following table shows the results of operations for ($ in thousands):\nYears Ended October 31,\n2022 2021 2020\nRevenues:\nAgribusiness $ 179,281 97% $ 161,381 97% $ 159,937 97%\nOther operations 5,324 3% 4,646 3% 4,622 3%\nTotal net revenues 184,605 100% 166,027 100% 164,559 100%\nCosts and expenses:\nAgribusiness 160,651 88% 148,492 86% 157,281 86%\nOther operations 4,438 2% 4,332 3% 4,504 2%\n(Gain) loss on disposal of assets (4,500) (2)% 109 - 502 -%\nSelling, general and administrative 21,815 12% 19,427 11% 21,280 12%\nTotal costs and expenses 182,404 100% 172,360 100% 183,567 100%\nOperating income (loss):\nAgribusiness 18,630 12,889 2,656\nOther operations 886 314 118\nGain (loss) on disposal of assets 4,500 (109) (502)\nSelling, general and administrative (21,815) (19,427) (21,280)\nOperating income (loss) 2,201 (6,333) (19,008)\nOther (expense) income:\nInterest income 53 379 362\nInterest expense, net of patronage dividends (2,291) (1,501) (2,048)\nEquity in earnings of investments, net 1,341 3,203 339\nLoss on stock in Calavo Growers, Inc. - - (6,299)\nOther (expense) income, net (955) 89 219\nTotal other (expense) income (1,852) 2,170 (7,427)\nIncome (loss) before income tax (provision) benefit 349 (4,163) (26,435)\nIncome tax (provision) benefit (823) 266 8,494\nNet loss (474) (3,897) (17,941)\nLoss attributable to noncontrolling interest 238 456 1,506\nNet loss attributable to Limoneira Company $ (236) $ (3,441) $ (16,435)\nNon-GAAP Financial Measures\nDue to significant depreciable assets associated with the nature of our operations and interest costs associated with our capital structure, management believes that earnings before interest, income taxes, depreciation and amortization (EBITDA) and adjusted EBITDA, which excludes stock-based compensation, loss on stock in Calavo Growers, Inc. (\"Calavo\"), named executive officer cash severance, pension settlement cost and (gain) loss on disposal of assets, is an important measure to evaluate our results of operations between periods on a more comparable basis. Adjusted EBITDA in previous periods did not exclude stock-based compensation which has now been excluded as management believes this is a better representation of cash generated by operations and is consistent with peer company reporting. Adjusted EBITDA for prior periods has been restated to conform to the current presentation. Such measurements are not prepared in accordance with U.S. generally accepted accounting principles (GAAP) and should not be construed as an alternative to reported results determined in accordance with GAAP. The non-GAAP information provided is unique to us and may not be consistent with methodologies used by other companies.\nEBITDA and adjusted EBITDA are summarized and reconciled to net loss attributable to Limoneira Company, which management considers to be the most directly comparable financial measure calculated and presented in accordance with GAAP as follows (in thousands):\nYears Ended October 31,\n2022 2021 2020\nNet loss attributable to Limoneira Company $ (236) $ (3,441) $ (16,435)\nInterest income (53) (379) (362)\nInterest expense, net of patronage dividends 2,291 1,501 2,048\nIncome tax provision (benefit) 823 (266) (8,494)\nDepreciation and amortization 9,798 9,812 10,097\nEBITDA 12,623 7,227 (13,146)\nStock-based compensation 2,732 2,582 2,044\nLoss on stock in Calavo Growers, Inc. - - 6,299\nNamed executive officer cash severance 432 - -\nPension settlement cost 607 - -\n(Gain) loss on disposal of assets (4,500) 109 502\nAdjusted EBITDA $ 11,894 $ 9,918 $ (4,301)\nFiscal Year 2022 Compared to Fiscal Year 2021\nRevenues\nTotal revenues for fiscal year 2022 were $184.6 million compared to $166.0 million for fiscal year 2021. The 11% increase of $18.6 million was primarily the result of increased avocados, oranges and specialty citrus and other crops agribusiness revenues, as detailed below ($ in thousands):\nAgribusiness Revenues for the Years Ended October 31,\n2022 2021 Change\nLemons $ 143,061 $ 142,962 $ 99 -%\nAvocados 17,331 6,784 10,547 155%\nOranges 9,911 4,382 5,529 126%\nSpecialty citrus and other crops 8,978 7,253 1,725 24%\nAgribusiness revenues $ 179,281 $ 161,381 $ 17,900 11%\nLemons: Lemon revenues in fiscal year 2022 were similar to fiscal year 2021. During fiscal years 2022 and 2021, fresh lemon sales were $92.9 million and $85.9 million on 4.9 million and 4.4 million cartons of fresh lemons packed and sold at average per carton prices of $18.77 and $19.60, respectively. Lemon revenues in fiscal years 2022 and 2021 included brokered fruit and other lemon sales of $24.5 million and $36.0 million, respectively, shipping and handling of $22.2 million and $17.5 million, respectively, and lemon by-products of $3.5 million in both fiscal years.\nAvocados: The increase in fiscal year 2022 was primarily the result of increased volume and higher prices of avocados sold compared to fiscal year 2021. The California avocado crop typically experiences alternating years of high and low production due to plant physiology. During fiscal years 2022 and 2021, 8.2 million and 5.7 million pounds of avocados were sold at average per pound prices of $2.08 and $1.20, respectively. Higher prices in fiscal year 2022 were primarily related to lower supply of fruit in the marketplace.\nOranges: The increase in fiscal year 2022 was primarily due to increased brokered fruit sales and higher prices compared to fiscal year 2021. Orange revenues in fiscal year 2022 included brokered fruit sales of $5.0 million, compared to immaterial brokered fruit sales in fiscal year 2021, sold at average per carton prices of $14.66 and $8.04, respectively.\nSpecialty citrus and other crops: The increase in fiscal year 2022 was primarily due to increased brokered fruit sales and higher prices of specialty citrus sold compared to fiscal year 2021. Specialty citrus revenues in fiscal year 2022 included brokered fruit sales of $2.9 million, compared to immaterial brokered fruit sales in 2021, sold at an average per carton price of $13.22 and $11.20, respectively.\nOther operations revenue in fiscal year 2022 and 2021 was $5.3 million and $4.6 million, respectively.\nCosts and Expenses\nTotal costs and expenses for fiscal year 2022 were $182.4 million compared to $172.4 million for fiscal year 2021. This 6% increase of $10.0 million was primarily attributable to increases in our agribusiness costs and selling, general and administrative expenses, partially offset by an increase in gain on disposal of assets. Costs associated with our agribusiness division include packing costs, harvest costs, growing costs, costs related to the lemons we procure from third-party growers and suppliers and depreciation and amortization expense. These costs are discussed further below ($ in thousands):\nAgribusiness Costs and Expenses for the Years Ended October 31,\n2022 2021 Change\nPacking costs $ 45,448 $ 38,754 $ 6,694 17%\nHarvest costs 20,767 17,227 3,540 21%\nGrowing costs 26,277 27,195 (918) (3)%\nThird-party grower and supplier costs 59,555 56,690 2,865 5%\nDepreciation and amortization 8,604 8,626 (22) -%\nAgribusiness costs and expenses $ 160,651 $ 148,492 $ 12,159 8%\nPacking costs: Packing costs consist of the costs to pack lemons for sale such as labor and benefits, cardboard cartons, fruit treatments, packing and shipping supplies and facility operating costs. Lemon packing costs were $43.0 million and $36.0 million in fiscal years 2022 and 2021, respectively. The increase in fiscal year 2022 was primarily attributable to increased volume of fresh lemons packed and sold and higher average per carton costs compared to fiscal year 2021. In fiscal years 2022 and 2021, we packed and sold 4.9 million and 4.4 million cartons of lemons at average per carton costs of $8.69 and $8.22, respectively. The increase in average per carton costs in fiscal year 2022, compared to fiscal year 2021, was primarily due to higher costs in labor and benefits, fruit treatments, cardboard cartons and packing and shipping supplies. Additionally, in fiscal years 2022 and 2021, packing costs included $2.4 million and $2.7 million of shipping costs, respectively.\nHarvest costs: The increase in fiscal year 2022 was primarily attributable to increased volume of lemons and avocados harvested compared to fiscal year 2021.\nGrowing costs: Growing costs, also referred to as cultural costs, consist of orchard maintenance costs such as cultivation, fertilization and soil amendments, pest control, pruning and irrigation. The decrease in fiscal year 2022, compared to fiscal year 2021, reflects farm management decisions based on weather, harvest timing and crop conditions.\nThird-party grower and supplier costs: We sell fruit that we grow and fruit that we procure from other growers and suppliers. The cost of procuring fruit from others is referred to as third-party grower and supplier costs. The increase in fiscal year 2022 was primarily due to increased volume of fruit procured from third-party growers and suppliers compared to fiscal year 2021. In fiscal years 2022 and 2021, costs for purchased, packed fruit for resale increased by $0.9 million; we incurred costs of $26.2 million and $25.2 million, respectively. During fiscal years 2022 and 2021, of the 4.9 million and 4.4 million lemon cartons sold, 2.6 million (52%) and 2.3 million (52%) were procured from third-party growers and suppliers at average per carton prices of $13.03 and $13.83, respectively: an increase of $1.9 million.\nDepreciation and amortization: Depreciation and amortization expense in fiscal year 2022 was similar compared to fiscal year 2021.\nOther operations expenses for fiscal years 2022 and 2021 were $4.4 million and $4.3 million, respectively.\n(Gain) loss on disposal of assets for fiscal years 2022 and 2021 were $(4.5) million and $0.1 million, respectively. The change is primarily due to sales of East Area I Retained Property and Oxnard Lemon packing facility in fiscal year 2022.\nSelling, general and administrative expenses for fiscal year 2022 were $21.8 million compared to $19.4 million for fiscal year 2021. The $2.4 million increase was primarily the result of:\n$1.0 million increase in salaries, benefits and incentive compensation;\n$0.8 million increase in named executive officer severance;\n$0.4 million increase in selling expenses; and\n$0.2 million increase in other selling, general and administrative expenses, including certain corporate overhead expenses.\nOther (Expense) Income\nOther (expense) income, for fiscal year 2022 was $(1.9) million compared to $2.2 million for fiscal year 2021. The $4.0 million increase in other expenses was primarily the result of:\n$0.8 million increase in interest expense, net as a result of increased interest rates;\n$1.9 million decrease in equity in earnings of investments primarily from LLCB; and\n$1.0 million increase in other expenses primarily from pension expense and pension settlement cost.\nIncome Taxes\nWe recorded for fiscal years 2022 and 2021 income tax (provision) benefit of $(0.8) million and $0.3 million on pre-tax income (loss) of $0.3 million and $(4.2) million, respectively. The tax provision recorded for fiscal year 2022 differs from the U.S. federal statutory tax rate of 21% due primarily to foreign jurisdictions which are taxed at different rates, state taxes, tax impact of stock-based compensation, nondeductible tax items and valuation allowances on certain deferred tax assets of foreign subsidiaries. Our effective tax rate for fiscal years 2022 and 2021 was 234.8% and 6.4%, respectively.\nLoss Attributable to Noncontrolling Interest\nLoss attributable to noncontrolling interest primarily represents 10% and 49% of the net losses of PDA and Trapani Fresh, respectively.\nSegment Results of Operations\nWe operate in four reportable operating segments: fresh lemons, lemon packing, avocados and other agribusiness. Our reportable operating segments are strategic business units with different products and services, distribution processes and customer bases. We evaluate the performance of our operating segments separately to monitor the different factors affecting financial results. Each segment is subject to review and evaluations related to current market conditions, market opportunities and available resources. See Note 20 - Segment Information for additional information regarding our operating segments.\nSegment information for fiscal year 2022 (in thousands):\nFresh\nLemons Lemon\nPacking Eliminations Avocados Other\nAgribusiness Total\nAgribusiness Corporate\nand Other Total\nRevenues from external customers $ 120,885 $ 22,176 $ - $ 17,331 $ 18,889 $ 179,281 $ 5,324 $ 184,605\nIntersegment revenues - 29,817 (29,817) - - - - -\nTotal net revenues 120,885 51,993 (29,817) 17,331 18,889 179,281 5,324 184,605\nCosts and expenses 115,119 43,017 (29,817) 5,524 18,204 152,047 20,559 172,606\nDepreciation and amortization - - - - - 8,604 1,194 9,798\nOperating income (loss) $ 5,766 $ 8,976 $ - $ 11,807 $ 685 $ 18,630 $ (16,429) $ 2,201\nSegment information for fiscal year 2021 (in thousands):\nFresh\nLemons Lemon\nPacking Eliminations Avocados Other\nAgribusiness Total\nAgribusiness Corporate\nand Other Total\nRevenues from external customers $ 125,448 $ 17,514 $ - $ 6,784 $ 11,635 $ 161,381 $ 4,646 $ 166,027\nIntersegment revenues - 25,637 (25,637) - - - - -\nTotal net revenues 125,448 43,151 (25,637) 6,784 11,635 161,381 4,646 166,027\nCosts and expenses 116,117 36,018 (25,637) 4,211 9,157 139,866 22,682 162,548\nDepreciation and amortization - - - - - 8,626 1,186 9,812\nOperating (loss) income $ 9,331 $ 7,133 $ - $ 2,573 $ 2,478 $ 12,889 $ (19,222) $ (6,333)\nFiscal Year 2022 Segment Information Compared to Fiscal Year 2021 Segment Information\nThe following analysis should be read in conjunction with the previous section Results of Operations.\nFresh Lemons\nFresh lemons segment revenue is comprised of sales of fresh lemons, lemon by-products, brokered fruit and other lemon revenue. For fiscal year 2022, our fresh lemons segment revenue was $120.9 million compared to $125.4 million for fiscal year 2021. The 4% decrease of $4.5 million was primarily the result of decreased brokered lemon sales, partially offset by increased fresh lemon sales, as discussed earlier.\nCosts and expenses associated with our fresh lemons segment include harvest costs, growing costs, cost of fruit we procure from third-party growers and suppliers, transportation costs and packing service charges incurred from the lemon packing segment to pack lemons for sale. For fiscal year 2022, our fresh lemon costs and expenses were $115.1 million compared to $116.1 million for fiscal year 2021. The 1% decrease of $1.0 million primarily consisted of the following:\nHarvest costs for fiscal year 2022 were $2.9 million higher than fiscal year 2021;\nGrowing costs for fiscal year 2022 were $2.2 million lower than fiscal year 2021;\nThird-party grower and supplier costs for fiscal year 2022 were $5.6 million lower than fiscal year 2021;\nTransportation costs for fiscal year 2022 were $0.3 million lower than fiscal year 2021; and\nIntersegment costs and expenses for fiscal year 2022 were $4.2 million higher than fiscal year 2021.\nLemon Packing\nLemon packing segment revenue is comprised of intersegment packing revenue and shipping and handling revenue. For fiscal year 2022, our lemon packing segment revenue was $52.0 million compared to $43.2 million for fiscal year 2021. The 20% increase of $8.8 million was primarily due to increased volume of lemons packed.\nCosts and expenses associated with our lemon packing segment consist of the cost to pack lemons for sale such as labor and benefits, cardboard cartons, fruit treatments, packing and shipping supplies and facility operating costs. For fiscal year 2022, our lemon packing costs and expenses were $43.0 million compared to $36.0 million for fiscal year 2021. The 19% increase of $7.0 million was primarily due to increased volume of lemons packed and higher costs in labor and benefits, cardboard cartons, fruit treatments and packing and shipping supplies.\nLemon packing segment operating income per carton sold was $1.81 and $1.63 for fiscal years 2022 and 2021, respectively.\nThe lemon packing segment included $29.8 million and $25.6 million of intersegment revenues for fiscal years 2022 and 2021, respectively, which were charged to the fresh lemons segment to pack lemons for sale. Such intersegment revenues and expenses are eliminated in our consolidated financial statements.\nAvocados\nFor fiscal year 2022, our avocados segment revenue was $17.3 million compared to $6.8 million for fiscal year 2021, a 155% increase of $10.5 million.\nCost and expenses associated with our avocados segment include harvest costs and growing costs. For fiscal year 2022, our avocado costs and expenses were $5.5 million compared to $4.2 million for fiscal year 2021. The 31% increase of $1.3 million primarily consisted of the following:\nHarvest costs for fiscal year 2022 were $1.0 million higher than fiscal year 2021; and\nGrowing costs for fiscal year 2022 were $0.3 million higher than fiscal year 2021.\nOther Agribusiness\nFor fiscal year 2022, our other agribusiness segment revenue was $18.9 million compared to $11.6 million for fiscal year 2021. The 62% increase of $7.3 million primarily consisted of the following:\nOrange revenue for fiscal year 2022 was $5.5 million higher than fiscal year 2021; and\nSpecialty citrus and other crop revenue for fiscal year 2022 was $1.7 million higher than fiscal year 2021.\nCosts and expenses associated with our other agribusiness segment include harvest, growing and brokered fruit costs. Our other agribusiness costs and expenses for fiscal year 2022 were $18.2 million compared to $9.2 million for fiscal year 2021. The 99% increase of $9.0 million primarily consisted of the following:\nHarvest costs for fiscal year 2022 were $0.4 million lower than fiscal year 2021;\nGrowing costs for fiscal year 2022 were $0.9 million higher than fiscal year 2021; and\nBrokered fruit costs for fiscal year 2022 were $8.5 million higher than fiscal year 2021.\nTotal agribusiness depreciation and amortization for fiscal years 2022 and 2021 was $8.6 million.\nCorporate and Other\nOur corporate and other operations had rental revenues of approximately $5.3 million and $4.6 million in fiscal years 2022 and 2021, respectively.\nCosts and expenses in our corporate and other operations were approximately $20.6 million and $22.7 million in fiscal years 2022 and 2021, respectively, and include rental operations costs, selling, general and administrative expenses not allocated to the operating segments, and (gain) loss on disposal of assets. Depreciation and amortization expenses were approximately $1.2 million in fiscal years 2022 and 2021.\nLiquidity and Capital Resources\nOverview\nOur primary sources of liquidity are cash and cash flows generated from our operations and use of our revolving credit facility. Our liquidity and capital position fluctuates during the year depending on seasonal production cycles, weather events and demand for our products. Typically, our first and last fiscal quarters coincide with the fall and winter months during which we are growing crops that are harvested and sold in the spring and summer, which are our second and third quarters. To meet working capital demand and investment requirements of our agribusiness and real estate development projects and to supplement operating cash flows, we utilize our revolving credit facility to fund agricultural inputs and farm management practices until sufficient returns from crops allow us to repay amounts borrowed. Raw materials needed to propagate the various crops grown by us consist primarily of fertilizer, herbicides, insecticides, fuel and water, all of which are readily available from local sources.\nMaterial contractual obligations arising in the normal course of business primarily consist of purchase obligations, long-term fixed rate and variable rate debt and related interest payments, operating and finance leases, financing transactions and our noncontributory, defined benefit pension plan (the Plan). In fiscal year 2021, we decided to terminate the Plan effective December 31, 2021. The liabilities disclosed as of October 31, 2022 and 2021, reflect an estimate of the additional cost to pay lump sums to a portion of the active and vested terminated participants and purchase annuities for all remaining participants from an insurance company. See Note 10 - Long-Term Debt, Note 12 - Leases and Note 16 - Retirement Plans for amounts outstanding on October 31, 2022, related to debt, leases and the Plan. Purchase obligations consist of contracts primarily related to packing supplies and pollination services, the majority of which are due in the next three years.\nWe believe that the cash flows from operations and available borrowing capacity from our existing credit facilities will be sufficient to satisfy our capital expenditures, debt service, working capital needs and other contractual obligations for the next twelve months. In addition, we have the ability to control a portion of our investing cash flows to the extent necessary based on our liquidity demands.\nCash Flows from Operating Activities\nFor the fiscal years ended October 31, 2022 and 2021, net cash provided by operating activities was $14.8 million and $9.6 million, respectively. Our cash flow provided by operating activities is primarily from agricultural sales and rental operations. Cash flow used in operations generally consists of agribusiness costs, rental operation costs, selling, general and administrative expenses. The significant components of our cash flows provided by operating activities are as follows.\nNet loss was $0.5 million and $3.9 million for fiscal years 2022 and 2021, respectively. The components of net loss in fiscal year 2022, compared to fiscal year 2021, consists of an increase in operating income of $8.5 million, an increase in total other expense of $4.0 million and an increase in income tax provision of $1.1 million.\nAdjustments to reconcile net loss to net cash provided by operating activities:\n◦Adjustments provided $10.0 million of operating cash in fiscal year 2022, compared to providing $10.2 million of operating cash in fiscal year 2021, primarily due to significant changes in (gain) loss on disposal of assets, equity in earnings of investments, net, and other, net, which primarily related to pension expense and pension settlement cost.\n◦Changes in operating assets and liabilities provided $5.3 million of operating cash in fiscal year 2022, compared to providing $3.3 million of operating cash in fiscal year 2021, primarily due to significant changes in accounts receivable and receivables/other from related parties, income taxes receivable, accounts payable and growers and suppliers payable and accrued liabilities and payables to related parties.\nCash Flows from Investing Activities\nFor the years ended October 31, 2022 and 2021, net cash provided by (used in) investing activities was $19.4 million and $(10.2) million, respectively, and is primarily comprised of capital expenditures, sales of assets, collection of notes receivable and investments.\nCapital expenditures for fiscal year 2022 were $10.1 million for property, plant and equipment, primarily related to orchards, and real estate development projects. Additionally, in fiscal year 2022 we received $19.3 million in net proceeds from sales of assets, $7.9 million in net proceeds from sales of real estate development assets and $2.8 million in collection of loan and notes receivable.\nCapital expenditures for fiscal year 2021 were comprised of $9.8 million for property, plant and equipment, primarily related to orchards, and real estate development projects. Additionally, in fiscal year 2021 we invested $0.7 million in mutual water companies and water rights.\nCash Flows from Financing Activities\nFor the years ended October 31, 2022 and 2021, net cash (used in) provided by financing activities was $(33.5) million and $0.5 million, respectively.\nThe $(33.5) million of cash used in financing activities for fiscal year 2022 was primarily comprised of net repayments of long-term debt in the amount of $26.8 million. Additionally, in fiscal year 2022 we paid common and preferred dividends, in aggregate, of $5.8 million, paid $1.5 million for the exchange of common stock related to our employees restricted stock awards and received $1.0 million of proceeds from equipment financings.\nThe $0.5 million of cash provided by financing activities for fiscal year 2021 was primarily comprised of net borrowings of long-term debt in the amount of $7.1 million. Additionally, in fiscal year 2021 we paid common and preferred dividends, in aggregate, of $5.8 million and paid $0.7 million for the exchange of common stock related to our employees restricted stock awards.\nTransactions Affecting Liquidity and Capital Resources\nCredit Facilities and Long-Term Debt\nWe finance our working capital and other liquidity requirements primarily through cash from operations and our Farm Credit West Credit Facility, which includes the Master Loan Agreement (the \"MLA\"), Supplements and Revolving Equity Line of Credit (the \"RELOC\"). In addition, we have the Farm Credit West term loans, Banco de Chile term loans and COVID-19 loans. Additional information regarding these loans can be found in Note 10 - Long-Term Debt.\nIn June 2021, we entered into the MLA with Farm Credit West, PCA (the \"Lender\") dated June 1, 2021, together with the Supplements and a Fixed Interest Rate Agreement, which extends the principal repayment to July 1, 2026. The MLA governs the terms of the Supplements.\nThe Supplements and RELOC provide aggregate borrowing capacity of $130.0 million comprised of $75.0 million under the Revolving Credit Supplement, $40.0 million under the Non-Revolving Credit Supplement and $15.0 million under the RELOC. As of October 31, 2022, our outstanding borrowings under the Farm Credit West Credit Facility were $88.5 million and we had $41.5 million of availability.\nThe MLA subjects us to affirmative and restrictive covenants including, among other customary covenants, financial reporting requirements, requirements to maintain and repair any collateral, restrictions on the sale of assets, restrictions on the use of proceeds, prohibitions on the incurrence of additional debt and restrictions on the purchase or sale of major assets of our business. We are also subject to a financial covenant that requires us to maintain compliance with a specified debt service coverage ratio greater than or equal to 1:25:1.0 on an annual basis. We were in compliance as of October 31, 2022.\nIn August 2021, we entered into the FCW term loan with the Lender and used the proceeds to pay off the Wells Fargo term loan. The FCW term loan has a fixed interest rate of 3.19% and is payable in monthly installments through September 2026.\nIn fiscal years 2022 and 2021 we received annual patronage dividends of $1.6 million and $1.2 million, respectively, from the Lender.\nTreasury Stock\nIn fiscal year 2021, our Company's Board of Directors approved a share repurchase program authorizing us to repurchase up to $10.0 million of our outstanding shares of common stock through September 2022; no shares were repurchased under this program. In fiscal year 2020, we repurchased 250,977 shares for $3.5 million under a program which expired in March 2021.\nDividends\nThe holders of the Series B Convertible Preferred Stock (the Series B Stock) and the Series B-2 Preferred Stock (the Series B-2 Preferred Stock) are entitled to receive cumulative cash dividends. Such preferred dividends paid totaled $0.5 million in each of the fiscal years 2022 and 2021.\nCash dividends declared in each of the fiscal years 2022 and 2021 totaled $0.30 per common share and such dividends paid totaled $5.3 million.\nReal Estate Development Activities and Related Capital Resources\nAs noted under Transactions Affecting Liquidity and Capital Resources, we have the ability to control a portion of our investing cash flows to the extent necessary based upon our liquidity demands. In order for our real estate development operations to reach their maximum potential benefit to us, however, we will need to be successful over time in identifying other third-party sources of capital to collaborate with us to move those development projects forward. While we are frequently in discussions with potential external sources of capital in respect to all of our development projects, current market conditions for California real estate projects make it difficult to predict the timing and amounts of future capital that will be required to complete the development of our projects.\nIn November 2015, we entered into a joint venture with Lewis for the residential development of our East Area I real estate development project. To consummate the transaction, we formed LLCB as the development entity, contributed our East Area I property to the joint venture and sold a 50% interest in the joint venture to Lewis for $20.0 million. The first phase of the project broke ground to commence mass grading in November 2017. Project plans currently include approximately 1,500 residential units and site improvements. A total of 586 residential units have closed from the project's inception to October 31, 2022.\nIn October 2022, we entered into a joint venture with Lewis for the development of our 17-acre East Area I Retained Property. We formed LLCB II as the development entity, contributed our Retained Property to the joint venture and sold a 50% interest to Lewis for approximately $8.0 million. We recorded a gain on the transaction of approximately $4.7 million, of which $0.5 million was deferred.\nThe joint venture partners will share in the capital contributions to fund project costs until loan proceeds and/or revenues are sufficient to fund the projects. Since inception each partner has made funding contributions of $21.4 million to LLCB. We expect to receive approximately $115.0 million from LLCB and LLCB II over the seven remaining years of the projects, including the $8.0 million received in fiscal year 2022.\nTrend Information\nThe commodity pricing for our fresh produce, and therefore our revenues and margins, is significantly impacted by consumer demand. The worldwide fresh produce industry has historically enjoyed consistent underlying demand and favorable growth dynamics. In recent years, the market for fresh produce has increased faster than the rate of population growth, supported by ongoing trends including greater consumer demand for healthy, fresh and convenient foods, increased retailer square footage devoted to fresh produce, and greater emphasis on fresh produce as a differentiating factor in attracting customers. Health-conscious consumers are driving much of the growth in demand for fresh produce. Over the past several decades, the benefits of natural, preservative-free and organic foods have become an increasingly significant element of the public dialogue on health and nutrition. As a result, consumption of fresh fruit and vegetables has markedly increased. Conversely, a decrease in demand, as was seen during the COVID-19 pandemic as a result of restaurant closures, has the impact of reducing our pricing and therefore our revenues and margins.\nCritical Accounting Estimates\nThe preparation of our consolidated financial statements in accordance with GAAP requires us to develop critical accounting policies and make certain estimates, assumptions and judgments that may affect the reported amounts of assets, liabilities, revenues and expenses. We base our estimates and judgments on historical experience, available relevant data and other information that we believe to be reasonable under the circumstances, and we continue to review and evaluate these estimates. Actual results may materially differ from these estimates under different assumptions or conditions as new or additional information become available in future periods. For further information on significant accounting policies, see discussion in Note 2 - Summary of Significant Accounting Policies.\nImpairment of Real Estate Development Projects - We evaluate our real estate development projects, held either by us or as included specifically within our investments in LLCB and LLCB II, for impairment on an ongoing basis. Our evaluation for impairment involves an initial assessment of each real estate development project to determine whether events or changes in circumstances exist that may indicate that the carrying amounts of, or investment in, real estate development are no longer recoverable. Possible indications of impairment may include events or changes in circumstances affecting the entitlement process, zoning, government regulation, geographical demand for new housing or commercial property, and market conditions related to residential or commercial land lots. When events or changes in circumstances exist, we further evaluate the real estate development for impairment by a) comparing undiscounted future cash flows expected to be generated over the life of the real estate development to the respective carrying amount for our real estate development or b) determining if our equity in investment has incurred an other-than-temporary decline.\nWe make significant judgments in evaluating each real estate development project, as held by us or within our investments in LLCB and LLCB II, for possible indications of impairment. These judgments may relate to the identification of appropriate and comparable market prices, the consideration of changes to legal factors or the business climate, the likelihood of successfully completing the entitlement process, changes in zoning or government regulation, and demand for new housing. Changes in these judgments could have a significant impact on real estate development or equity in investments. For fiscal years 2022, 2021 and 2020, no impairment loss has been recognized on any real estate development and no other-than-temporary-impairment has been recognized on our equity in LLCB or LLCB II.\nThe impairment calculation for real estate developments held by us compares the carrying value of the asset to the assets estimated future cash flows (undiscounted). If the estimated future cash flows are less than the carrying value of the asset, we calculate an impairment loss. The impairment loss calculation compares the carrying value of the asset to the assets estimated fair value, which may be based on estimated future cash flows (discounted). We recognize an impairment loss equal to the amount by which the assets carrying value exceeds the assets estimated fair value. If we recognize an impairment loss, the adjusted carrying amount of the asset will be its new cost basis. Restoration of a previously recognized impairment loss is prohibited. If actual results are not consistent with our assumptions and judgments used in estimating future cash flows and asset fair values, we may be exposed to impairment losses that could be material to our results of operations.\nWhenever events or changes in circumstances indicate that the carrying amount of our equity investments in LLCB and LLCB II might not be recoverable, then we determine whether an impairment is other-than-temporary. If we conclude the impairment is other-than-temporary, we determine the estimated fair value of the investment by performing a discounted cash flow or market approach analysis and recognize an other-than-temporary impairment to reduce the investment to its estimated fair value.\nWe believe that the accounting estimate related to impairment of real estate development projects held by us, or other-than-temporary impairment of our equity investments in LLCB and LLCB II, is a critical accounting estimate because it is very susceptible to change from period to period; it requires management to make assumptions about future prices, production, and costs,\nand the potential impact of a loss from impairment could be material to our earnings. Managements assumptions regarding future cash flows from real estate development projects or return on equity of our investments in LLCB and LLCB II have fluctuated in the past due to changes in prices, production and costs and are expected to continue to do so in the future as market conditions change.\nRecent Accounting Pronouncements\nSee Note 2 - Summary of Significant Accounting Policies for information concerning recent accounting pronouncements. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nInterest Rate Risk\nBorrowings under the Farm Credit West Credit Facility and Farm Credit West Term Loans are or will be subject to variable interest rates. These variable interest rates subject us to the risk of increased interest costs associated with any upward movements in interest rates. For the Farm Credit West Credit Facility and Farm Credit West Term Loans, our borrowing interest rate is an internally calculated rate based on Farm Credit Wests internal monthly operations and their cost of funds and generally follows the changes in the 90-day treasury rates in increments divisible by 0.25%. At October 31, 2022, our total debt outstanding under the Farm Credit West Credit Facility and the Farm Credit West Term Loans was $88.5 million and $16.0 million, respectively.\nBased on our level of borrowings at October 31, 2022, a 100 basis points increase in interest rates would increase our interest expense $0.5 million for fiscal year 2023 and an annual average of $0.7 million for the three subsequent fiscal years. Additionally, a 100 basis points increase in the interest rate would decrease our net income by $0.4 million for fiscal year 2023 and an annual average of $0.5 million for the three subsequent fiscal years. Refer to Managements Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources for additional information. Item 8. Financial Statements and Supplementary Data\nLimoneira Company\nIndex to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm 46\nConsolidated Financial Statements of Limoneira Company\nConsolidated Balance Sheets at October 31, 2022 and 2021 48\nConsolidated Statements of Operations for the years ended October 31, 2022, 2021 and 2020 49\nConsolidated Statements of Comprehensive Loss for the years ended October 31, 2022, 2021 and 2020 50\nConsolidated Statements of Stockholders Equity and Temporary Equity for the years ended October 31, 2022, 2021 and 2020 51\nConsolidated Statements of Cash Flows for the years ended October 31, 2022, 2021 and 2020 52\nNotes to Consolidated Financial Statements 54\nAll schedules are omitted for the reason that they are not applicable or the required information is included in the Consolidated Financial Statements or the notes thereto.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Limoneira Company\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Limoneira Company and subsidiaries (the \"Company\") as of October 31, 2022 and 2021, the related consolidated statements of operations, comprehensive loss, stockholders' equity and temporary equity, and cash flows, for each of the three years in the period ended October 31, 2022, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, based on our audits and the report of the other auditors, the financial statements present fairly, in all material respects, the financial position of the Company as of October 31, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended October 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe did not audit the financial statements of Limoneira Lewis Community Builders, LLC (LLCB), the Company's investment in which is accounted for by use of the equity method. The accompanying consolidated financial statements of the Company include, before the basis difference and related amortization discussed in Note 6, its equity investment in LLCB of $52,431,000 and $51,416,000 as of October 31, 2022 and 2021, respectively, and its equity earnings in LLCB of $1,015,000, $4,508,000 and $1,386,000 for the years ended October 31, 2022, 2021 and 2020, respectively. The financial statements of LLCB were audited by other auditors whose report has been furnished to us, and our opinion, insofar as it relates to the amounts included for the Companys equity investment and equity earnings in LLCB, is based on the report of the other auditors.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of October 31, 2022, based on the criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated December 22, 2022, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits and the report of the other auditors provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nReal Estate Development - Impairment Indicators - Refer to Notes 2, 5 and 6 to the financial statements\nCritical Audit Matter Description\nThe Companys evaluation of real estate development, as held by the Company or as included specifically within its investment in LLCB, for impairment involves an initial assessment of each real estate development to determine whether events or changes\nin circumstances exist that may indicate that the carrying amount of, or investment in, real estate development are no longer recoverable. Possible indications of impairment may include events or changes in circumstances affecting the entitlement process, zoning, government regulation, geographical demand for new housing or commercial property, and market conditions related to pricing of residential or commercial land lots. When events or changes in circumstances exist, the Company further evaluates the real estate development for impairment by a) comparing undiscounted future cash flows expected to be generated over the life of the real estate development to the respective carrying amount for its own real estate development or b) determining if its equity investment in LLCB has incurred an other-than-temporary decline.\nThe Company makes significant judgments in evaluating real estate development for possible indications of impairment. These judgments may relate to the identification of appropriate and comparable market prices, the consideration of changes to legal factors or the business climate, the likelihood of successfully completing the entitlement process, changes in zoning or government regulation, and demand for new housing. Changes in these judgments could have a significant impact on real estate development or equity investment in LLCB. Real estate development assets were $9,706,000, and equity investment in LLCB was $61,154,000 as of October 31, 2022. For the year ended October 31, 2022, no impairment loss has been recognized on the real estate development and no other-than-temporary-impairment has been recognized on the Companys equity investment in LLCB.\nWe identified management judgments used in the determination of impairment indicators for real estate development as a critical audit matter because of the subjectivity used by management when determining whether events or changes in circumstances have occurred indicating that the carrying amount of, or investment in, real estate development may not be recoverable. This required a high degree of auditor judgment when performing audit procedures to evaluate whether management appropriately identified impairment indicators.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the evaluation of real estate development and equity investment in LLCB for possible indications of impairment included the following, among others:\nWe tested the effectiveness of the controls over managements identification of possible circumstances that may indicate that real estate development or equity investment in LLCB is no longer recoverable, including controls over managements evaluation of the entitlement process, litigation, changes in zoning, government regulation, geographical demand and market conditions.\n▪We evaluated managements impairment analysis by:\n◦Searching for adverse asset-specific and/or market conditions by reviewing publicly available information on land values in the surrounding regions of the development, periodicals and news information relating to the Southern California real estate market\n◦Obtaining information from legal counsel and performing inquiries with management in order to evaluate any changes in the status of litigation matters affecting the development property and the potential impact on the ability to recover the accumulated costs, including any relevant government regulations and/or other matters impacting the entitlement process\n◦Obtaining comparable land sales in the area and comparing such data to information used by management with the assistance of our fair value specialists\n◦Developing an independent expectation of impairment indicators and comparing such expectation to managements analysis\n/s/ Deloitte & Touche LLP\nLos Angeles, California\nDecember 22, 2022\nWe have served as the Companys auditor since 2019.\nLIMONEIRA COMPANY\nCONSOLIDATED BALANCE SHEETS\n($ in thousands, except share amounts)\nOctober 31,\n2022 2021\nAssets\nCurrent assets:\nCash $ 857 $ 439\nAccounts receivable, net 15,651 17,483\nCultural costs 8,643 7,500\nPrepaid expenses and other current assets 8,496 10,709\nReceivables/other from related parties 3,888 5,958\nTotal current assets 37,535 42,089\nProperty, plant and equipment, net 222,628 242,420\nReal estate development 9,706 22,828\nEquity in investments 72,855 64,072\nGoodwill 1,506 1,527\nIntangible assets, net 7,317 8,329\nOther assets 16,971 11,011\nTotal assets $ 368,518 $ 392,276\nLiabilities and Stockholders' Equity\nCurrent liabilities:\nAccounts payable $ 10,663 $ 8,963\nGrowers and suppliers payable 10,740 10,371\nAccrued liabilities 11,279 6,542\nPayables to related parties 4,860 6,976\nCurrent portion of long-term debt 1,732 2,472\nTotal current liabilities 39,274 35,324\nLong-term liabilities:\nLong-term debt, less current portion 104,076 130,353\nDeferred income taxes 23,497 22,853\nOther long-term liabilities 9,807 4,501\nTotal liabilities 176,654 193,031\nCommitments and contingencies - -\nSeries B Convertible Preferred Stock - $100.00 par value (50,000 shares authorized: 14,790 shares issued and outstanding at October 31, 2022 and 2021) (8.75% coupon rate)\n1,479 1,479\nSeries B-2 Convertible Preferred Stock - $100.00 par value (10,000 shares authorized: 9,300 shares issued and outstanding at October 31, 2022 and 2021) (4% dividend rate on liquidation value of $1,000 per share)\n9,331 9,331\nStockholders' equity:\nSeries A Junior Participating Preferred Stock - $0.01 par value (20,000 shares authorized: zero shares issued or outstanding at October 31, 2022 and 2021)\n- -\nCommon Stock - $0.01 par value (39,000,000 shares authorized: 17,935,292 and 17,936,377 shares issued and 17,684,315 and 17,685,400 shares outstanding at October 31, 2022 and 2021, respectively)\n177 179\nAdditional paid-in capital 165,169 163,965\nRetained earnings 15,500 21,552\nAccumulated other comprehensive loss (7,908) (5,733)\nTreasury stock, at cost, 250,977 shares at October 31, 2022 and 2021\n(3,493) (3,493)\nNoncontrolling interest 11,609 11,965\nTotal stockholders' equity 181,054 188,435\nTotal liabilities and stockholders' equity $ 368,518 $ 392,276\nSee Notes to Consolidated Financial Statements.\nLIMONEIRA COMPANY\nCONSOLIDATED STATEMENTS OF OPERATIONS\n($ in thousands, except share amounts)\nYears Ended October 31,\n2022 2021 2020\nNet revenues:\nAgribusiness $ 179,281 $ 161,381 $ 159,937\nOther operations 5,324 4,646 4,622\nTotal net revenues 184,605 166,027 164,559\nCosts and expenses:\nAgribusiness 160,651 148,492 157,281\nOther operations 4,438 4,332 4,504\n(Gain) loss on disposal of assets (4,500) 109 502\nSelling, general and administrative 21,815 19,427 21,280\nTotal costs and expenses 182,404 172,360 183,567\nOperating income (loss) 2,201 (6,333) (19,008)\nOther (expense) income:\nInterest income 53 379 362\nInterest expense, net of patronage dividends (2,291) (1,501) (2,048)\nEquity in earnings of investments, net 1,341 3,203 339\nLoss on stock in Calavo Growers, Inc. - - (6,299)\nOther (expense) income, net (955) 89 219\nTotal other (expense) income (1,852) 2,170 (7,427)\nIncome (loss) before income tax (provision) benefit 349 (4,163) (26,435)\nIncome tax (provision) benefit (823) 266 8,494\nNet loss (474) (3,897) (17,941)\nLoss attributable to noncontrolling interest 238 456 1,506\nNet loss attributable to Limoneira Company (236) (3,441) (16,435)\nPreferred dividends (501) (501) (501)\nNet loss applicable to common stock $ (737) $ (3,942) $ (16,936)\nBasic net loss per common share $ (0.04) $ (0.23) $ (0.96)\nDiluted net loss per common share $ (0.04) $ (0.23) $ (0.96)\nWeighted-average common shares outstanding-basic 17,513,000 17,555,000 17,666,000\nWeighted-average common shares outstanding-diluted 17,513,000 17,555,000 17,666,000\nSee Notes to Consolidated Financial Statements.\nLIMONEIRA COMPANY\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE LOSS\n(In thousands)\nYears Ended October 31,\n2022 2021 2020\nNet loss $ (474) $ (3,897) $ (17,941)\nOther comprehensive (loss) income, net of tax:\nForeign currency translation adjustments (2,430) (685) (707)\nMinimum pension liability adjustments, net of tax of $(71), $940 and $(69)\n(183) 2,500 274\nPension settlement cost, net of tax of $169, $0 and $0\n438 - -\nResidual state tax effects on sale of equity securities - - 140\nTotal other comprehensive (loss) income, net of tax (2,175) 1,815 (293)\nComprehensive loss (2,649) (2,082) (18,234)\nComprehensive loss attributable to noncontrolling interest 356 445 1,536\nComprehensive loss attributable to Limoneira Company $ (2,293) $ (1,637) $ (16,698)\nSee Notes to Consolidated Financial Statements.\nLIMONEIRA COMPANY\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY AND TEMPORARY EQUITY\n($ in thousands)\nStockholders Equity Temporary Equity\nCommon Stock Additional\nPaid-In Retained Accumulated\nOther\nComprehensive Treasury Non-controlling Series B\nPreferred Series B-2\nPreferred\nShares Amount Capital Earnings (Loss) Income Stock Interest Total Stock Stock\nBalance at October 31, 2019\n17,756,180 $ 178 $ 160,254 $ 53,089 $ (7,255) $ - $ 15,422 $ 221,688 $ 1,479 $ 9,331\nDividends - common ($0.30 per share)\n- - - (5,356) - - - (5,356) - -\nDividends - Series B ($8.75 per share)\n- - - (129) - - - (129) - -\nDividends - Series B-2 ($40 per share)\n- - - (372) - - (372) - -\nStock compensation 112,841 1 2,043 - - - - 2,044 - -\nExchange of common stock (11,314) - (213) - - - - (213) - -\nNoncontrolling interest adjustment - - - - - - (145) (145) - -\nTreasury shares (250,977) - - - - (3,493) - (3,493) - -\nNet loss - - - (16,435) - - (1,506) (17,941) - -\nOther comprehensive loss, net of tax - - - - (293) - (30) (323) - -\nBalance at October 31, 2020\n17,606,730 179 162,084 30,797 (7,548) (3,493) 13,741 195,760 1,479 9,331\nDividends - common ($0.30 per share)\n- - - (5,303) - - - (5,303) - -\nDividends - Series B ($8.75 per share)\n- - - (129) - - - (129) - -\nDividends - Series B-2 ($40 per share)\n- - - (372) - - - (372) - -\nStock compensation 125,663 1 2,581 - - - - 2,582 - -\nExchange of common stock (46,993) (1) (700) - - - - (701) - -\nNoncontrolling interest adjustment - - - - - - (1,331) (1,331) - -\nNet loss - - - (3,441) - - (456) (3,897) - -\nOther comprehensive income, net of tax - - - - 1,815 - 11 1,826 - -\nBalance at October 31, 2021\n17,685,400 179 163,965 21,552 (5,733) (3,493) 11,965 188,435 1,479 9,331\nDividends - common ($0.30 per share)\n- - - (5,315) - - - (5,315) - -\nDividends - Series B ($8.75 per share)\n- - - (129) - - - (129) - -\nDividends - Series B-2 ($40 per share)\n- - - (372) - - - (372) - -\nStock compensation 104,231 1 2,731 - - - - 2,732 - -\nExchange of common stock (105,316) (3) (1,527) - - - - (1,530) - -\nNet loss - - - (236) - - (238) (474) - -\nOther comprehensive loss, net of tax - - - - (2,175) - (118) (2,293) - -\nBalance at October 31, 2022\n17,684,315 $ 177 $ 165,169 $ 15,500 $ (7,908) $ (3,493) $ 11,609 $ 181,054 $ 1,479 $ 9,331\nSee Notes to Consolidated Financial Statements\nLIMONEIRA COMPANY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nYears Ended October 31,\n2022 2021 2020\nOperating activities\nNet loss $ (474) $ (3,897) $ (17,941)\nAdjustments to reconcile net loss to net cash provided by (used in) operating activities:\nDepreciation and amortization 9,798 9,812 10,097\n(Gain) loss on disposal of assets (4,500) 109 502\nStock compensation expense 2,732 2,582 2,044\nNon-cash lease expense 442 520 470\nEquity in earnings of investments, net (1,341) (3,203) (339)\nCash distributions from equity investments 483 219 -\nDeferred income taxes 548 (189) (2,133)\nLoss on stock in Calavo Growers, Inc. - - 6,299\nOther, net 1,831 335 671\nChanges in operating assets and liabilities:\nAccount receivable and receivables/other from related parties 1,845 (5,076) (309)\nCultural costs (1,148) (639) 359\nPrepaid expenses and other current assets (325) (1,021) (44)\nIncome taxes receivable - 5,911 (4,932)\nOther assets (134) (5) 411\nAccounts payable and growers and suppliers payable 1,853 5,389 (5,545)\nAccrued liabilities and payables to related parties 3,269 (730) (685)\nOther long-term liabilities (49) (512) (242)\nNet cash provided by (used in) operating activities 14,830 9,605 (11,317)\nInvesting activities\nCapital expenditures (10,066) (9,834) (10,599)\nNet proceeds from sales of assets\n19,259 119 6,261\nNet proceeds from sales of real estate development assets 7,917 - -\nCash distribution from Trapani Fresh 122 - -\nNet proceeds from sale of stock in Calavo Growers, Inc. - - 11,048\nLoan to Limoneira Lewis Community Builders, LLC - - (1,800)\nCollection on loan and notes receivable 2,755 25 1,800\nEquity investment contributions (48) - (2,800)\nCash distribution from equity investment - 106 -\nInvestments in mutual water companies and water rights (506) (653) (64)\nNet cash provided by (used in) investing activities $ 19,433 $ (10,237) $ 3,846\nLIMONEIRA COMPANY\nCONSOLIDATED STATEMENTS OF CASH FLOWS (CONTINUED)\n(In thousands)\nYears Ended October 31,\n2022 2021 2020\nFinancing activities\nBorrowings of long-term debt $ 146,941 $ 102,196 $ 121,056\nRepayments of long-term debt (173,755) (95,140) (104,066)\nProceeds from equipment financings 1,020 - -\nPrincipal paid on finance lease and equipment financings (377) (18) -\nDividends paid - common (5,315) (5,303) (5,356)\nDividends paid - preferred (501) (501) (501)\nExchange of common stock (1,530) (700) (213)\nPurchase of treasury stock - - (3,493)\nPayments of deferred financing costs - - (66)\nNet cash (used in) provided by financing activities (33,517) 534 7,361\nEffect of exchange rate changes on cash (328) 36 (5)\nNet increase (decrease) in cash 418 (62) (115)\nCash at beginning of year 439 501 616\nCash at end of year $ 857 $ 439 $ 501\nSupplemental disclosures of cash flow information\nCash paid during the year for interest, net of amounts capitalized $ 2,064 $ 1,503 $ 1,865\nCash paid (received) during the year for income taxes, net $ 83 $ (5,911) $ (1,235)\nNon-cash investing and financing activities:\nContribution of real estate development to equity investment $ 7,975 $ - $ -\nReduction of net payables to related parties $ 2,392 $ - $ -\nReduction of note receivable $ 388 $ - $ -\nCapital expenditures accrued but not paid at year-end $ 430 $ 657 $ 4,269\nSee Notes to Consolidated Financial Statements.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. Business\nLimoneira Company (together with its consolidated subsidiaries, the Company) engages primarily in growing citrus and avocados, picking and hauling citrus, and packing, marketing and selling citrus. The Company is also engaged in residential rentals and other rental operations and real estate development activities.\nThe Company markets and sells citrus directly to food service, wholesale and retail customers throughout the United States, Canada, Asia, Europe and other international markets. The Company is a member of Sunkist Growers, Inc. (Sunkist), an agricultural marketing cooperative, and sells a portion of its oranges, specialty citrus and other crops to Sunkist-licensed and other third-party packinghouses.\nThrough fiscal year 2021, the Company sold the majority of its avocado production to Calavo Growers, Inc. (Calavo), a packing and marketing company listed on the NASDAQ Global Select Market under the symbol CVGW. In February 2022, the Company terminated its Avocado Marketing Agreement and the associated Letter Agreement Regarding Fruit Commitment with Calavo to pursue opportunities with other packing and marketing companies.\n2. Summary of Significant Accounting Policies\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and the accounts of all the subsidiaries and investments in which the Company holds a controlling interest. The consolidated financial statements represent the consolidated balance sheets, statements of operations, statements of comprehensive loss, statements of stockholders equity and temporary equity and statements of cash flows of Limoneira Company and consolidated subsidiaries. Intercompany balances and transactions have been eliminated in consolidation. The Company considers the criteria established under the Financial Accounting Standards Board (FASB) - Accounting Standards Code (ASC) 810, Consolidations, and the effect of variable interest entities, in its consolidation process.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nAccounts Receivable\nThe Company grants credit in the course of its operations to cooperatives, companies and lessees of the Companys facilities. The Company performs periodic credit evaluations of its customers financial condition and generally does not require collateral. The Company provides allowances on its receivables as required based on accounts receivable aging and other factors. At October 31, 2022 and 2021 the allowances totaled $469,000 and $444,000, respectively. For fiscal years 2022, 2021 and 2020, credit losses were insignificant.\nConcentrations and Geographic Information\nThe Company sells the majority of its avocados, oranges and specialty citrus and other crops to third-party packinghouses and processors. Prior to fiscal year 2022, the Company sold a majority of its avocado production to Calavo. Sales of avocados to Calavo were $6,594,000 and $8,806,000 in fiscal years 2021 and 2020, respectively.\nConcentrations of credit risk with respect to revenues and accounts receivable are limited due to a large, diverse customer base. One customer represented 11% of revenue for the year ended October 31, 2022 and two customers each represented 10% of revenue for the year ended October 31, 2021. No individual customer represented more than 10% of accounts receivable, net as of October 31, 2022 and 2021.\nLemons procured from third-party growers were approximately 52%, 52% and 60% of the Company's lemon supply in fiscal years 2022, 2021 and 2020, respectively. One third-party grower was 21% and 46% of growers and suppliers payable at October 31, 2022 and 2021, respectively.\nThe Company maintains its cash in federally insured financial institutions. The account balances at these institutions periodically exceed Federal Deposit Insurance Corporation (FDIC) insurance coverage and, as a result, there is a concentration of risk related to amounts on deposit in excess of FDIC insurance coverage.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n2. Summary of Significant Accounting Policies (continued)\nConcentrations and Geographic Information (continued)\nDuring fiscal years 2022, 2021 and 2020, the Company had approximately $3,614,000, $2,976,000 and $3,521,000, respectively, of total sales in Chile by Fruticola Pan de Azucar S.A. (PDA) and Agricola San Pablo SpA. (\"San Pablo\").\nDuring fiscal years 2022, 2021 and 2020, the Company had approximately $673,000, $3,633,000 and $14,150,000, respectively, of total sales in Argentina.\nThe majority of the Company's avocados, oranges and specialty citrus and other crops are sold to packinghouses and processors located in the United States. Most of its long-lived assets are located within the United States. Long-lived assets, net of accumulated depreciation, located in Chile were $12,663,000 and $14,322,000 as of October 31, 2022 and 2021, respectively, and located in Argentina were $19,440,000 and $19,700,000 as of October 31, 2022 and 2021, respectively.\nCultural Costs\nGrowing costs, also referred to as cultural costs, consist of orchard maintenance costs such as cultivation, fertilization and soil amendments, pest control, pruning and irrigation. Harvest costs are comprised of labor and equipment expenses incurred to harvest and deliver crops to the packinghouses.\nCertain of the Company's crops have distinct growing periods and distinct harvest and selling periods, each of which lasts approximately four to eight months. During the growing period, cultural costs are capitalized as they are associated with benefiting and preparing the crops for the harvest and selling period. During the harvest and selling period, harvest costs and cultural costs are expensed when incurred and capitalized cultural costs are amortized as components of agribusiness costs and expenses.\nDue to climate, growing conditions and the types of crops grown, certain of the Company's other crops may be harvested and sold on a year-round basis. Accordingly, the Company does not capitalize cultural costs associated with these crops and therefore such costs, as well as harvest costs associated with these crops, are expensed to operations when incurred as components of agribusiness costs and expenses.\nMost cultural costs, including amortization of capitalized cultural costs, and harvest costs are associated with and charged to specific crops. Certain other costs, such as property taxes, indirect labor, including farm supervision and management, and irrigation that benefit multiple crops are allocated to crops on a per acre basis.\nIncome Taxes\nDeferred income tax assets and liabilities are computed annually for differences between the financial statement and income tax bases of assets and liabilities that will result in taxable or deductible amounts in the future. Such deferred income tax asset and liability computations are based on enacted tax laws and rates applicable to periods in which the differences are expected to affect taxable income. A valuation allowance is established, when necessary, to reduce deferred income tax assets to the amount expected to be realized.\nTax benefits from an uncertain tax position are only recognized if it is more likely than not that the tax position will be sustained upon examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement.\nProperty, Plant and Equipment\nProperty, plant and equipment is stated at original cost, net of accumulated depreciation. Depreciation is computed using the straight-line method at rates based upon the estimated useful lives of the related assets as follows (in years):\nLand improvements 10 - 30\nBuildings and building improvements 10 - 50\nEquipment 5 - 20\nOrchards and vineyards 20 - 40\nCosts of planting and developing orchards are capitalized until the orchards become commercially productive. Planting costs consist primarily of the costs to purchase and plant nursery stock. Orchard development costs consist primarily of maintenance costs of orchards such as cultivation, pruning, irrigation, labor, pest control and fertilization, and interest costs during the\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n2. Summary of Significant Accounting Policies (continued)\nProperty, Plant and Equipment (continued)\ndevelopment period. The Company ceases the capitalization of costs and commences depreciation when the orchards become commercially productive and orchard maintenance costs are accounted for as cultural costs as described above.\nCapitalized Interest\nInterest is capitalized on real estate development projects and significant construction in progress using the weighted average interest rate during the fiscal year. Capitalized interest is included in property, plant, and equipment and real estate development assets in the Companys consolidated balance sheets.\nReal Estate Development Costs\nThe Company capitalizes the planning, entitlement, construction, development costs and interest associated with its various real estate projects. Costs that are not capitalized, which include property maintenance and repairs, general and administrative and marketing expenses, are expensed as incurred. A real estate development project is considered substantially complete upon the cessation of construction and development activities. Once a project is substantially completed, future costs are expensed as incurred. The Company capitalized costs related to its real estate projects of $637,000 and $1,192,000 in fiscal years 2022 and 2021, respectively.\nEquity in Investments\nInvestments in unconsolidated joint ventures in which the Company has significant influence but less than a controlling interest, or is not the primary beneficiary if the joint venture is determined to be a Variable Interest Entity (VIE), are accounted for under the equity method of accounting and, accordingly, are adjusted for capital contributions, distributions and the Companys equity in net earnings or loss of the respective joint venture.\nEquity Securities\nThe Company had no equity securities as of October 31, 2022 and 2021. In fiscal year 2020, the Company sold all 200,000 shares of Calavo common stock for a total of $11,048,000, recognizing a loss of $6,299,000\nLong-Lived and Intangible Assets\nIntangible assets consist primarily of customer relationships, trade names and trademarks and a non-competition agreement. The Companys definite-life intangible assets are being amortized on a straight-line basis over their estimated lives ranging from eight to ten years. Acquired water and mineral rights are indefinite-life assets not subject to amortization. Assets held for sale are carried at the lower of cost or fair value less estimated cost to sell.\nThe Company evaluates long-lived assets, including its property and equipment, real estate development projects and definite-life intangible assets, for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. If the estimated fair value or undiscounted future cash flows from the use of an asset are less than the carrying value of that asset, a write-down is recorded to reduce the carrying value of the asset to its estimated fair value. The Company evaluates its indefinite-life intangible assets annually or whenever events or changes in circumstances indicate an impairment of the assets value may exist.\nCOVID-19 Pandemic\nThere is uncertainty around the breadth and duration of the Company's business disruptions related to the COVID-19 pandemic. The decline in demand for the Company's products beginning the second quarter of fiscal year 2020, which it believes was due to the COVID-19 pandemic, negatively impacted its sales and profitability for the last three quarters of fiscal year 2020 and all of fiscal years 2021 and 2022. The COVID-19 pandemic may impact its sales and profitability in future periods. The duration of these trends and the magnitude of such impacts are uncertain and therefore cannot be estimated at this time, as they are influenced by a number of factors, many of which are outside managements control. The full impact of the COVID-19 pandemic on the Company's results of operations, financial condition, and liquidity, including its ability to comply with debt covenants, for fiscal year 2023 and beyond, is driven by estimates that contain uncertainties.\nGoodwill\nGoodwill is tested for impairment on an annual basis or when an event or changes in circumstances indicate that its carrying value may not be recoverable. Goodwill impairment is tested at the reporting unit level, which is defined as an operating segment or one level below the operating segment. The annual, or interim, goodwill impairment test is performed by comparing\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n2. Summary of Significant Accounting Policies (continued)\nGoodwill (continued)\nthe fair value of a reporting unit with its carrying amount. An impairment charge is recognized for the amount by which the carrying amount exceeds the reporting units fair value; however, the loss recognized should not exceed the total amount of goodwill allocated to that reporting unit. An entity still has the option to perform the qualitative assessment for a reporting unit to determine if the quantitative impairment test is necessary. Goodwill impairment testing involves significant judgment and estimates.\nFair Values of Financial Instruments\nAccounts receivable, accounts payable, growers and suppliers payable and accrued liabilities reported on the Companys consolidated balance sheets approximate their fair values due to the short-term nature of the instruments.\nBased on the borrowing rates currently available to the Company for bank loans with similar terms and maturities, the fair value of long-term debt is approximately equal to its carrying amount as of October 31, 2022 and 2021.\nComprehensive (Loss) Income\nComprehensive income or loss represents all changes in a companys net assets, except changes resulting from transactions with stockholders. Other comprehensive income or loss primarily includes foreign currency translation items, defined benefit pension items and unrealized gains or losses on available-for-sale securities. Accumulated other comprehensive loss is reported as a component of the Company's stockholders' equity.\nThe following table summarizes the changes in other comprehensive (loss) income by component (in thousands):\n2022 2021 2020\nPre-tax Amount Tax (Expense) Benefit Net Amount Pre-tax Amount Tax (Expense) Benefit Net Amount Pre-tax Amount Tax (Expense) Benefit Net Amount\nForeign currency translation adjustments $ (2,430) $ - $ (2,430) $ (685) $ - $ (685) $ (707) $ - $ (707)\nMinimum pension liability adjustments:\nOther comprehensive (loss) income before reclassifications (254) 71 (183) 3,440 (940) 2,500 205 69 274\nAmounts reclassified to earnings included in \"Other (expense) income, net\" 607 (169) 438 - - - - - -\nAvailable-for-sale securities:\nAmounts reclassified to earnings included in \"Selling, general and administrative\" - - - - - - - 140 140\nOther comprehensive (loss) income $ (2,077) $ (98) $ (2,175) $ 2,755 $ (940) $ 1,815 $ (502) $ 209 $ (293)\nThe following table summarizes the changes in accumulated other comprehensive (loss) income by component (in thousands):\nForeign Currency Translation Loss Defined Benefit Pension Plan Available-for-Sale Securities Accumulated Other Comprehensive (Loss) Income\nBalance as of October 31, 2019\n(2,362) (4,753) (140) (7,255)\nOther comprehensive (loss) income (707) 274 140 (293)\nBalance as of October 31, 2020\n(3,069) (4,479) - (7,548)\nOther comprehensive (loss) income (685) 2,500 - 1,815\nBalance as of October 31, 2021\n(3,754) (1,979) - (5,733)\nOther comprehensive (loss) income (2,430) 255 - (2,175)\nBalance as of October 31, 2022\n$ (6,184) $ (1,724) $ - $ (7,908)\nForeign Currency\nSan Pablo and PDAs functional currency is the Chilean Peso. Their balance sheets are translated to U.S. dollars at exchange rates in effect at the balance sheet date and their income statements are translated at average exchange rates during the reporting\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n2. Summary of Significant Accounting Policies (continued)\nForeign Currency (continued)\nperiod. The resulting foreign currency translation adjustments are recorded as a separate component of accumulated other comprehensive (loss) income.\nAggregate foreign exchange transaction losses realized for the Company's foreign subsidiaries were approximately $204,000 and $646,000 for fiscal years 2022 and 2021, respectively, and are included in selling, general and administrative expenses in the consolidated statements of operations.\nRevenue Recognition\nThe Company recognizes revenue in accordance with ASC 606, Revenue from contracts with customers, and recognizes revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the Company expects to be entitled in exchange for those goods or services. To achieve that core principle, the Company applies the following steps:\nIdentify the contract(s) with a customer;\nIdentify the performance obligations in the contract;\nDetermine the transaction price;\nAllocate the transaction price to the performance obligations in the contract;\nRecognize revenue when (or as) the entity satisfies a performance obligation.\nThe Company determines the appropriate method by which it recognizes revenue by analyzing the nature of the products or services being provided as well as the terms and conditions of contracts or arrangements entered into with its customers. The Company accounts for a contract when it has approval and commitment from both parties, the rights of the parties are identified, payment terms are identified, the contract has commercial substance and collectability of consideration is probable. A contract's transaction price is allocated to each distinct good or service (i.e., performance obligation) identified in the contract and each performance obligation is valued based on its estimated relative standalone selling price.\nThe Company recognizes the majority of its revenue at a point in time when it satisfies a performance obligation and transfers control of the product to the respective customer. The amount of revenue that is recognized is based on the transaction price, which represents the invoiced amount and includes estimates of variable consideration such as allowances for estimated customer discounts or concessions, where applicable. The amount of variable consideration included in the transaction price may be constrained and is included only to the extent that it is probable that a significant reversal in the amount of the cumulative revenue recognized under the contract will not occur in a future period.\nAgribusiness revenue - Revenue from lemon sales is generally recognized at a point in time when the customer takes control of the fruit from the Companys packinghouse, which aligns with the transfer of title to the customer. The Company has elected to treat any shipping and handling costs incurred after control of the goods has been transferred to the customer as agribusiness costs.\nThe Companys avocados, oranges, specialty citrus and other specialty crops are packed and sold by third-party packinghouses. The Companys arrangements with its third-party packinghouses are such that the Company is the producer and supplier of the product and the third-party packinghouses are the Companys customers. The Company controls the product until it is delivered to the third-party packinghouses at which time control of the product is transferred to the third-party packinghouses and revenue is recognized.\nRevenue from crop insurance proceeds is recorded when the amount can be reasonably determined and upon establishment of the present right to payment. We recorded agribusiness revenues from crop insurance proceeds of $449,000 in fiscal year 2022. There were no proceeds received in fiscal years 2021and 2020.\nAdvertising Expense\nAdvertising costs are expensed as incurred. Advertising costs were $165,000, $178,000 and $239,000 in fiscal years 2022, 2021 and 2020, respectively.\nLeases\nAccounting for Leases as a Lessee - In its ordinary course of business, the Company enters into leases as a lessee generally for agricultural land and packinghouse facilities and equipment. The Company determines if an arrangement is a lease or contains a lease at inception. Operating and finance leases are included in other assets, accrued liabilities and other long-term liabilities on\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n2. Summary of Significant Accounting Policies (continued)\nLeases (continued)\nits consolidated balance sheets. Lease right-of-use (ROU) assets represent the right to use an underlying asset for the lease term and lease liabilities represent the obligation to make lease payments arising from the lease, measured on a discounted basis. Lease ROU assets and lease liabilities are recognized based on the present value of the future minimum lease payments over the lease term at commencement date. The Company uses either its incremental borrowing rate based on the information available at commencement date, or the rate implicit in the lease, if known, in determining the present value of future payments.\nOperating lease expense for minimum lease payments is recognized on a straight-line basis over the lease term. Leases with an initial term of 12 months or less are not recorded on the balance sheet as the Company has elected to recognize lease expense for these leases on a straight-line basis over the lease term. The Company has material leases with related parties which are further described in Note 14 - Related-Party Transactions.\nCertain of the Companys agricultural land agreements contain variable costs based on a percentage of the operating results of the leased property. Such variable lease costs are expensed as incurred. These land agreements also contain costs for non-lease components, such as water usage, which the Company accounts for separately from the lease components. For all other agreements, the Company generally combines lease and non-lease components in calculating the ROU assets and lease liabilities. See Note 12 - Leases for additional information.\nAccounting for Leases as a Lessor - Leases in which the Company acts as the lessor include land, residential and commercial units and are all classified as operating leases. Certain of the Companys contracts contain variable income based on a percentage of the operating results of the leased asset. Certain of the Companys contracts contain non-lease components such as water, utilities and common area services. The Company has elected to not separate lease and non-lease components for its lessor arrangements and the combined component is accounted for entirely under ASC 842, Leases. The underlying asset in an operating lease arrangement is carried at depreciated cost within property, plant, and equipment, net on the consolidated balance sheets. Depreciation is calculated using the straight-line method over the useful life of the underlying asset. The Company recognizes operating lease revenue on a straight-line basis over the lease term.\nBasic and Diluted Net Loss per Share\nBasic net loss per common share is calculated using the weighted-average number of common shares outstanding during the period without consideration of the dilutive effect of conversion of preferred stock. Diluted net loss per common share is calculated using the weighted-average number of common shares outstanding during the period plus the dilutive effect of conversion of unvested, restricted stock and preferred stock.\nDiluted net loss per common share is calculated using the more dilutive method of either the two-class method or the treasury stock method. Unvested stock-based compensation awards that contain non-forfeitable rights to dividends as participating shares are included in computing earnings per share. The Companys unvested, restricted stock awards qualify as participating shares.\nDefined Benefit Retirement Plan\nThe Company sponsors a defined benefit retirement plan (the \"Plan\") that was frozen in June 2004, and no future benefits have been accrued to participants subsequent to that time. Ongoing accounting for this plan under FASB ASC 715, Compensation - Retirement Benefits, provides guidance as to, among other things, future estimated pension expense, pension liability and minimum funding requirements. This information is provided to the Company by third-party actuarial consultants. In developing this data, certain estimates and assumptions are used, including among other things, discount rate, long-term rate of return and mortality tables.\nIn fiscal year 2021, the Company decided to terminate the Plan effective December 31, 2021. The liabilities disclosed as of October 31, 2022 and 2021, reflect an estimate of the additional cost to pay lump sums to a portion of the active and vested terminated participants and purchase annuities for all remaining participants from an insurance company.\nThe Company used the latest mortality tables released by the Society of Actuaries through October 2022 to measure its pension obligation as of October 31, 2022 and combined with the assumed discount rate and other demographic assumptions, its pension liability increased by approximately $1,425,000 as of October 31, 2022.\nOn November 4, 2022, the Company entered into an agreement with Principal Life Insurance Company for the purchase of an annuity contract in connection with the Plan termination. On November 10, 2022, the annuity contract was purchased for $12,617,000, payable with Plan assets and a $2,500,000 cash payment from the Company.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n2. Summary of Significant Accounting Policies (continued)\nRecent Accounting Pronouncements\nFinancial Accounting Standards Board (\"FASB\") Accounting Standards Update (\"ASU\") 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40): Accounting for Convertible Instruments and Contracts in an Entitys Own Equity\nThis amendment simplifies accounting for convertible instruments by removing major separation models currently required under GAAP. Consequently, more convertible debt instruments will be reported as a single liability instrument and more convertible preferred stock as a single equity instrument with no separate accounting for embedded conversion features. The ASU removes certain settlement conditions that are required for equity contracts to qualify for the derivative scope exception, which will permit more equity contracts to qualify for it. The ASU also simplifies the diluted earnings per share (EPS) calculation in certain areas.\nASU 2020-06 is effective for public business entities that meet the definition of a SEC filer for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. Early adoption is permitted for fiscal years beginning after December 15, 2020. The Company adopted this ASU effective November 1, 2021 and the adoption did not have a material impact on its consolidated financial statements.\n3. Prepaid Expenses and Other Current Assets\nPrepaid expenses and other current assets consist of the following at October 31 (in thousands):\n2022 2021\nPrepaid supplies and insurance $ 2,958 $ 2,521\nNote receivable and related interest - 2,438\nReal estate development held for sale 2,670 2,543\nSales tax receivable 475 909\nLemon supplier advances 1,188 -\nOther 1,205 2,298\n$ 8,496 $ 10,709\n4. Property, Plant and Equipment\nProperty, plant and equipment consists of the following at October 31 (in thousands):\n2022 2021\nLand $ 87,617 $ 95,868\nLand improvements 37,221 35,440\nBuildings and building improvements 37,929 48,565\nEquipment 61,615 62,598\nOrchards and vineyards 60,657 63,454\nConstruction in progress 28,489 22,477\n313,528 328,402\nLess accumulated depreciation (90,900) (85,982)\n$ 222,628 $ 242,420\nDepreciation expense was $9,075,000, $8,883,000 and $9,098,000 for fiscal years 2022, 2021 and 2020, respectively.\nIn August 2020, the Company sold property located in Lindsay, California. The Company received net proceeds of $6,011,000 after transaction and other costs, and recorded a loss of approximately $424,000, which is included in (gain) loss on disposal of assets in the consolidated statements of operations.\nIn October 2022, the Company sold the Oxnard Lemon property and packing facility located in Ventura County, California. The Company received net proceeds of $19,144,000 and recognized a gain of approximately $846,000, which is included in (gain) loss on disposal of assets in the consolidated statements of operations. Concurrent with the closing of the sale, the\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n4. Property, Plant and Equipment (continued)\nCompany entered into a lease agreement to continue use of the property as a lessee for a period of 36 months from the closing date, with extension options for an additional 24 months.\n5. Real Estate Development\nReal estate development assets are comprised primarily of land and land development costs and consist of the following at October 31 (in thousands):\n2022 2021\nEast Area I - Retained Property $ - $ 13,335\nEast Area II 9,706 9,493\n$ 9,706 $ 22,828\nEast Area I, Retained Property and East Area II\nIn fiscal year 2005, the Company began capitalizing the costs of two real estate development projects east of Santa Paula, California, for the development of 550 acres of land into residential units, commercial buildings and civic facilities. In November 2015 (the \"Transaction Date\"), the Company entered into a joint venture with The Lewis Group of Companies (Lewis) for the residential development of its East Area I real estate development project. To consummate the transaction, the Company formed Limoneira Lewis Community Builders, LLC (LLCB) as the development entity, contributed its East Area I property to LLCB and sold a 50% interest to Lewis for $20,000,000.\nThe Company and LLCB also entered into a Retained Property Development Agreement on the Transaction Date (the \"Retained Property Agreement\"). Under the terms of the Retained Property Agreement, LLCB transferred certain contributed East Area I property, which is entitled for commercial development, back to the Company (the \"Retained Property\") and arranged for the design and construction of certain improvements to the Retained Property, subject to certain reimbursements by the Company. The balance in Retained Property and East Area II includes estimated costs incurred by and reimbursable to LLCB of $3,444,000 and $5,771,000 at October 31, 2022 and 2021, respectively, which is included in payables to related parties.\nIn January 2018, LLCB entered into a $45,000,000 unsecured Line of Credit Loan Agreement and Promissory Note (the Loan) with Bank of America, N.A. to fund early development activities. The Loan, as modified and extended, matures February 22, 2023. The interest rate on the Loan is LIBOR plus 2.85% and is payable monthly. The Loan contains certain customary default provisions and LLCB may prepay any amounts outstanding under the Loan without penalty. The Loan had an outstanding balance of $4,500,000 as of October 31, 2022. The Loan has a one year extension option through February 22, 2024 subject to terms and conditions as defined in the agreement, with the maximum borrowing amount reduced to $35,000,000 during the extension period. In December 2022, LLCB exercised the extension option.\nIn February 2018, certain principals from Lewis and by the Company guaranteed the obligations under the Loan. The guarantors are jointly and severally liable for all Loan obligations in the event of default by LLCB. The guarantee continues in effect until all of the Loan obligations are fully paid. The $1,080,000 estimated value of the guarantee was recorded in the Companys consolidated balance sheets and is included in other long-term liabilities with a corresponding value in equity in investments. Additionally, a Reimbursement Agreement was executed between the Lewis guarantors and the Company, which provides for unpaid liabilities of LLCB to be shared pro-rata by the Lewis guarantors and the Company in proportion to their percentage interest in LLCB.\nIn October 2022, the Company entered into a joint venture with Lewis for the development of the Retained Property. The Company formed LLCB II, LLC (\"LLCB II\") as the development entity, contributed the Retained Property to the joint venture and sold a 50% interest to Lewis for $7,975,000. After transaction costs, the Company received net proceeds of $7,917,000 and recorded a gain on the transaction of $4,652,000, of which $465,000 was deferred and $4,187,000 is included in (gain) loss on disposal of assets in the consolidated statements of operations. The joint venture partners will share in the capital contributions to fund project costs until loan proceeds and/or revenues are sufficient to fund the project. In connection with the closing, the Company and Lewis amended LLCBs Limited Liability Company Agreement to provide that LLCB is to include the processing of final approval for additional residential units to be developed and constructed on the Retained Property.\nThrough October 31, 2022, LLCB has closed sales of the initial residential lots representing 586 residential units.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n5. Real Estate Development (continued)\nOther Real Estate Development Projects\nIn fiscal year 2020, the Company entered into an agreement to sell its Sevilla property for $2,700,000, which closed in the first quarter of fiscal year 2023. After transaction and other costs, the Company received cash proceeds of approximately $2,577,000. During fiscal year 2022, the Company incurred additional costs to prepare the asset for sale, of which $127,000 were capitalized and $153,000 were recorded in (gain) loss on disposal of assets. The carrying value of the property at October 31, 2022 and 2021, was $2,670,000 and $2,543,000, respectively, and was classified as held for sale and included in prepaid expenses and other current assets.\nIn December 2017, the Company sold its Centennial property with a net book value of $2,983,000 for $3,250,000. The Company received cash and a $3,000,000 promissory note secured by the property for the balance of the purchase. The promissory note was originally scheduled to mature in December 2019, but was periodically extended with principal payments totaling $400,000 received through October 31, 2021. In fiscal year 2022, the promissory note was paid in full and the deferred gain of $161,000 was recorded in (gain) loss on disposal of assets.\n6. Equity in Investments\nLimco Del Mar, Ltd.\nThe Company has a 1.3% interest in Limco Del Mar, Ltd. (Del Mar) as a general partner and a 26.8% interest as a limited partner. Based on the terms of the partnership agreement, the Company may be removed as general partner without cause from the partnership upon the vote of the limited partners owning an aggregate of 50% or more interest in the partnership. Since the Company has significant influence, but less than a controlling interest, the Companys investment in Del Mar is accounted for using the equity method of accounting.\nThe Company provides Del Mar with farm management, orchard land development and accounting services and received expense reimbursements of $202,000, $200,000 and $210,000 in fiscal years 2022, 2021 and 2020, respectively. Del Mar markets lemons through the Company pursuant to its customary marketing agreements and the amount of lemons procured from Del Mar was $1,568,000, $1,681,000 and $1,037,000 in fiscal years 2022, 2021 and 2020, respectively. Fruit proceeds due to Del Mar were $703,000 and $694,000 at October 31, 2022 and 2021, respectively, and are included in growers and suppliers payable in the accompanying consolidated balance sheets.\nRomney Property Partnership\nIn May 2007, the Company and an individual formed the Romney Property Partnership (Romney) for the purpose of owning and leasing an office building and adjacent lot in Santa Paula, California. The Company paid $489,000 in 2007 for 75% interest in Romney. The terms of the partnership agreement affirm the status of the Company as a noncontrolling investor in the partnership since the Company cannot exercise unilateral control over the partnership. Since the Company has significant influence, but less than a controlling interest, the Companys investment in Romney is accounted for using the equity method of accounting. Net profits, losses and cash flows of Romney are shared by the Company, which receives 75% and the individual, who receives 25%.\nRosales S.A.\nThe Company currently has a 47% equity interest in Rosales S.A, (Rosales) of which 35% was acquired in fiscal year 2014 and an additional 12% interest was acquired with the purchase of PDA in fiscal year 2017. Rosales is a citrus packing, marketing and sales business located in La Serena, Chile. In addition, the Company has the right to acquire the interest of the majority shareholder of Rosales upon death or disability of Rosales general manager for the fair value of the interest on the date of the event as defined in the shareholders agreement. Since the Company has significant influence, but less than a controlling interest, the Companys investment in Rosales is accounted for using the equity method of accounting.\nRosales functional currency is the Chilean Peso. The following financial information has been translated to U.S. dollars. In addition, as a result of the Companys acquisition of its equity interest, basis differences were identified between the historical cost of the net assets of Rosales and the proportionate fair value of the net assets acquired. Such basis differences aggregated to $1,683,000 on the acquisition date and are primarily comprised of intangible assets, including $343,000 of equity method goodwill. An additional $925,000 of basis differences were identified with the February 2017 PDA acquisition, including $143,000 of equity method goodwill. The $2,122,000 in basis differences exclusive of goodwill is being amortized over the estimated life of the underlying intangible assets as a reduction in the equity investment and an expense included in equity in earnings of investments. Amortization amounted to $118,000, $180,000 and $180,000 for fiscal years 2022, 2021 and 2020, respectively, and is estimated to be approximately $87,000 and $76,000 per year for years ending October 31, 2023 and 2024, respectively, and immaterial thereafter.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n6. Equity in Investments (continued)\nRosales (continued)\nThe Company recognized $3,615,000, $3,405,000 and $3,975,000 of lemon sales to Rosales in fiscal years 2022, 2021 and 2020, respectively. In fiscal years 2022, 2021 and 2020, the aggregate amount of lemons and oranges procured from Rosales was $3,821,000, $5,304,000 and $3,190,000, respectively. Amounts due from Rosales were $270,000 and $1,570,000 at October 31, 2022 and 2021, respectively, and are included in receivables/other from related parties.\nLimoneira Lewis Community Builders, LLC (LLCB)\nAs described in Note 5 - Real Estate Development, the Company has a joint venture with Lewis for the residential development of its East Area I real estate development project. In addition to the assessment performed by the Company of its investment in LLCB under the requirements of Regulation S-X Rule 4-08(g), the Company also assessed its investment in LLCB under the requirements of Regulation S-X Rule 3-09(b). LLCB was not deemed significant for the years ended October 31, 2022 and 2020 but was significant for the year ended October 31, 2021. Therefore, the audited financial statements of LLCB for the years ended October 31, 2022, 2021 and 2020 are provided as exhibits to this document to comply with this rule. Additionally, there is a basis difference between the Companys historical investment in the project and the amount recorded in members capital by LLCB of $52,431,000 as of October 31, 2022. The basis difference of $8,723,000 at October 31, 2022 is primarily comprised of capitalized interest, amounts related to the loan guarantee and certain other costs incurred by Limoneira Company during the development period. This basis difference is being amortized as lots are sold utilizing the relative sales value method and the amount amortized in fiscal years 2022, 2021 and 2020 totaled $77,000, $1,434,000 and $1,060,000, respectively. The Company's share of LLCB's net income for fiscal years 2022, 2021 and 2020 prior to basis amortization was $1,015,000, $4,508,000 and 1,386,000, respectively.\nLLCB II, LLC (LLCB II)\nAs described in Note 5 - Real Estate Development, in October 2022, the Company formed a joint venture with Lewis for the residential development of its Retained Property. Control is shared with Lewis, therefore the Company's investment in LLCB II is accounted for using the equity method of accounting.\nThe following is financial information of the equity method investees for fiscal years 2022, 2021 and 2020 (in thousands):\n2022 Del Mar Romney Rosales LLCB LLCB II\nCurrent assets $ 654 $ - $ 3,478 $ 116,596 $ 16,051\nNon-current assets $ 807 $ 612 $ 2,606 $ - $ -\nCurrent liabilities $ - $ - $ 3,076 $ 10,531 $ 5\nNon-current liabilities $ - $ - $ 1,686 $ - $ -\nRevenues $ 2,882 $ 6 $ 7,177 $ 2,500 $ -\nOperating income (loss) $ 1,823 $ (1) $ 272 $ 1,809 $ -\nNet income (loss) $ 1,823 $ (1) $ 26 $ 1,809 $ -\nCurrent assets $ 492 $ - $ 3,544 $ 108,964 $ -\nNon-current assets $ 865 $ 617 $ 2,406 $ - $ -\nCurrent liabilities $ - $ - $ 2,362 $ 4,708 $ -\nNon-current liabilities $ - $ - $ 2,083 $ - $ -\nRevenues $ 2,059 $ 17 $ 9,862 $ 42,853 $ -\nOperating income (loss) $ 1,052 $ (4) $ 438 $ 9,087 $ -\nNet income (loss) $ 1,052 $ (4) $ 35 $ 9,087 $ -\nRevenues $ 930 $ 20 $ 10,097 $ 25,906 $ -\nOperating income (loss) $ (109) $ (2) $ 1,216 $ 2,615 $ -\nNet income (loss) $ (109) $ (2) $ 476 $ 2,615 $ -\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n6. Equity in Investments (continued)\nThe Companys investment and equity in earnings (losses) of the equity method investees are as follows (in thousands):\nDel Mar Romney Rosales LLCB LLCB II Total\nInvestment balance October 31, 2019 $ 1,950 $ 512 $ 1,745 $ 54,016 $ - $ 58,223\nEquity earnings (losses) (30) (1) 44 326 - 339\nInvestment contributions - - - 2,800 - 2,800\nForeign currency adjustments - - (148) - - (148)\nInvestment balance October 31, 2020 1,920 511 1,641 57,142 - 61,214\nEquity earnings (losses) 296 (3) (164) 3,074 - 3,203\nCash distributions (219) - (106) - - (325)\nForeign currency adjustments - - (20) - - (20)\nInvestment balance October 31, 2021 1,997 508 1,351 60,216 - 64,072\nEquity earnings (losses) 510 (1) (106) 938 - 1,341\nCash distributions (483) - - - - (483)\nInvestment contributions - - - - 8,023 8,023\nForeign currency adjustments - - (98) - - (98)\nInvestment balance October 31, 2022 $ 2,024 $ 507 $ 1,147 $ 61,154 $ 8,023 $ 72,855\n7. Goodwill and Intangible Assets, Net\nA summary of the change in the carrying amount of goodwill is as follows (in thousands):\nGoodwill Carrying Amount\nBalance at October 31, 2020 $ 1,535\nForeign currency translation adjustment (8)\nBalance at October 31, 2021 1,527\nForeign currency translation adjustment (21)\nBalance at October 31, 2022 $ 1,506\nGoodwill is tested for impairment on an annual basis or when an event or changes in circumstances indicate that its carrying value may not be recoverable. The Company concluded that no potential impairment indicators existed during any interim period and performed its annual assessment of goodwill impairment as of July 31, 2022 with no impairment noted. The Company did not incur any goodwill impairment losses in fiscal years 2022, 2021 or 2020, as the estimated fair values of its reporting units were in excess of their carrying values.\nAs of October 31, 2022, the Company has allocated goodwill to its reportable segments as follows: Fresh Lemons $936,000 and Lemon Packing $570,000.\nDuring the fiscal year ended October 31, 2021, the Company acquired additional water rights in Chile for $186,000.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n7. Goodwill and Intangible Assets, Net (continued)\nIntangible assets consisted of the following as of October 31 (in thousands):\n2022 2021\nGross Carrying Amount Accumulated Amortization Net Carrying Amount Weighted Average Useful Life in Years Gross Carrying Amount Accumulated Amortization Net Carrying Amount Weighted Average Useful Life in Years\nIntangible assets:\nTrade names and trademarks $ 2,108 $ (881) $ 1,227 8 $ 2,108 $ (663) $ 1,445 8\nCustomer relationships 4,037 (1,660) 2,377 9 4,037 (1,209) 2,828 9\nNon-competition agreement 437 (76) 361 8 437 (22) 415 8\nAcquired water and mineral rights 3,352 - 3,352 Indefinite $ 3,641 $ - $ 3,641 Indefinite\nIntangible assets $ 9,934 $ (2,617) $ 7,317 $ 10,223 $ (1,894) $ 8,329\nAmortization expense totaled $723,000, $929,000, and $999,000 for the years ended October 31, 2022, 2021 and 2020, respectively.\nEstimated future amortization expense of intangible assets for each of the next five fiscal years and thereafter are as follows (in thousands):\n2023 $ 724\n2024 716\n2025 711\n2026 711\n2027 427\nThereafter 676\n$ 3,965\n8. Other Assets\nInvestments in Mutual Water Companies\nThe Companys investments in various not-for-profit mutual water companies provide the Company with the right to receive a proportionate share of water from each of the not-for-profit mutual water companies that have been invested in and do not constitute voting shares and/or rights. Amounts included in other assets in the consolidated balance sheets as of October 31, 2022 and 2021 were $6,500,000 and $5,994,000, respectively.\n9. Accrued Liabilities\nAccrued liabilities consist of the following at October 31 (in thousands):\n2022 2021\nCompensation $ 3,572 $ 2,112\nProperty taxes 664 676\nOperating expenses 2,341 1,203\nLeases 2,026 604\nOther 2,676 1,947\n$ 11,279 $ 6,542\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n10. Long-Term Debt\nLong-term debt is comprised of the following at October 31 (in thousands):\n2022 2021\nFarm Credit West revolving and non-revolving lines of credit: The interest rate of the revolving line of credit is variable based on the one-month London Interbank Offered Rate (LIBOR), which was 3.12% at October 31, 2022, plus 1.85%. The interest rate for the $40.0 million outstanding balance of the non-revolving line of credit was fixed at 4.77% through July 1, 2022, is 3.57% through July 1, 2025 and variable thereafter. Interest is payable monthly and the principal is due in full on July 1, 2026.\n$ 88,521 $ 111,293\nFarm Credit West term loan: The loan was repaid in September 2022. - 809\nFarm Credit West term loan: The interest rate is fixed at 3.24%. The loan is payable in monthly installments through October 2035.\n919 974\nFarm Credit West term loan: The interest rate is fixed at 3.24%. The loan is payable in monthly installments through March 2036.\n7,562 8,004\nFarm Credit West term loan: The interest rate is fixed at 2.77% until July 1, 2025, becoming variable for the remainder of the loan. The loan is payable in monthly installments through March 2036.\n5,555 5,892\nFarm Credit West term loan: The interest rate is fixed at 3.19%. The loan is payable in monthly installments through September 2026.\n2,003 2,475\nBanco de Chile term loan: The interest rate is fixed at 6.48%. The loan is payable in annual installments through January 2025.\n675 1,011\nNote Payable: The Note Payable was repaid in October 2022. - 1,435\nBanco de Chile COVID-19 loans: The interest rates are fixed at 3.48%. The loans are payable in monthly installments through September 2024.\n233 411\nBanco de Chile COVID-19 loans: The interest rates are fixed at 3.48% and 4.26%. The loans are payable in monthly installments through September 2026.\n434 652\nSubtotal 105,902 132,956\nLess deferred financing costs, net of accumulated amortization 94 131\nTotal long-term debt, net 105,808 132,825\nLess current portion 1,732 2,472\nLong-term debt, less current portion $ 104,076 $ 130,353\nThe Company entered into a Master Loan Agreement (the MLA) with Farm Credit West, PCA (the \"Lender\") dated June 1, 2021, together with a revolving credit facility supplement (the Revolving Credit Supplement), a non-revolving credit facility supplement (the Non-Revolving Credit Supplement, and together with the Revolving Credit Supplement, the Supplements) and an agreement to convert to a fixed interest rate for a period of time as described in the table above (\"Fixed Interest Rate Agreement\"). The MLA governs the terms of the Supplements. The MLA amends and restates the previous Master Loan Agreement between the Company and the Lender and extends the principal repayment to July 1, 2026.\nIn March 2020, the Company entered into a revolving equity line of credit promissory note and loan agreement with the Lender for a $15,000,000 Revolving Equity Line of Credit (the \"RELOC\") secured by a first lien on the Windfall Investors, LLC property. The RELOC matures in 2043 and features a 3-year draw period followed by 20 years of fully amortized loan payments.\nThe Supplements and RELOC provide aggregate borrowing capacity of $130,000,000 comprised of $75,000,000 under the Revolving Credit Supplement, $40,000,000 under the Non-Revolving Credit Supplement and $15,000,000 under the RELOC. As of October 31, 2022, the Company's outstanding borrowings under the revolving and non-revolving lines of credit were $88,521,000 and it had $41,479,000 available to borrow.\nThe interest rate in effect under the Revolving Credit Supplement automatically adjusted commencing July 1, 2021 and on the first day of each month thereafter. The interest rate for any amount outstanding under the Revolving Credit Supplement is based on the one-month LIBOR rate plus or minus an applicable margin. The applicable margin ranges from 1.75% to 2.35% depending on the ratio of current assets, plus the remaining available commitment divided by current liabilities. On each one year anniversary of July 1, the Company has the option to convert the interest rate in use under the Revolving Credit Supplement from the preceding LIBOR-based calculation to a variable interest rate. The Company may prepay any amounts outstanding under the Revolving Credit Supplement without penalty.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n10. Long-Term Debt (continued)\nThe initial interest rate in effect under the Non-Revolving Credit Supplement was a fixed interest rate of 4.77% through July 1, 2022 and then converted to a fixed interest rate of 3.57% per year until July 1, 2025 (the Fixed Rate Term). Thereafter, the interest rate will convert to a variable interest rate established by the Lender corresponding to the applicable interest rate group. The Company may not prepay any amounts under the outstanding Non-Revolving Credit Supplement during the Fixed Rate Term. Thereafter, the Company may prepay any amounts outstanding under the Non-Revolving Credit Supplement, provided that a fee equal to 0.50% of the amount prepaid and any other cost or loss suffered by the Lender must be paid with any prepayment.\nThe interest rate in effect under the RELOC is a variable interest rate established by the Lender corresponding to the applicable interest rate group, which was 5.50% as of October 31, 2022. The interest rate may be adjusted automatically under the provisions of the Lender's variable interest rate plan. The Company may prepay any amounts outstanding under the RELOC without penalty.\nAll indebtedness under the MLA and RELOC, including any indebtedness under the Supplements, is secured by a first lien on Company-owned stock or participation certificates, Company funds maintained with the Lender, the Lenders unallocated surplus, and certain of the Companys agricultural properties in Tulare and Ventura Counties in California and certain of the Companys building fixtures and improvements and investments in mutual water companies associated with the pledged agricultural properties. The MLA includes customary default provisions that provide should an event of default occur, the Lender, at its option, may declare all or any portion of the indebtedness under the MLA to be immediately due and payable without demand, notice of nonpayment, protest or prior recourse to collateral, and terminate or suspend the Companys right to draw or request funds on any loan or line of credit.\nThe MLA subjects the Company to affirmative and restrictive covenants including, among other customary covenants, financial reporting requirements, requirements to maintain and repair any collateral, restrictions on the sale of assets, restrictions on the use of proceeds, prohibitions on the incurrence of additional debt and restrictions on the purchase or sale of major assets of the Companys business. The Company is also subject to a financial covenant that requires it to maintain compliance with a specific debt service coverage ratio greater than or equal to 1.25:1.0 when measured at October 31, 2022 and annually thereafter. We were in compliance as of October 31, 2022.\nThe Company received annual cash patronage dividends from the Lender of $1,582,000, $1,170,000 and $1,566,000 in fiscal years 2022, 2021 and 2020, respectively.\nInterest is capitalized on non-bearing orchards, real estate development projects and significant construction in progress. The Company capitalized interest of $582,000, $1,110,000 and $921,000 during the fiscal years ended 2022, 2021 and 2020, respectively. Capitalized interest is included in property, plant and equipment and real estate development assets in the Companys consolidated balance sheets.\nThe Company incurs certain loan fees and costs associated with its new or amended credit arrangements. Such costs are capitalized as deferred financing costs and amortized as interest expense using the straight-line method over the terms of the credit agreements. The balance of deferred financing costs was $94,000 and $131,000, net of amortization at October 31, 2022 and 2021, respectively, and was included in long-term debt on the Companys consolidated balance sheet.\nPrincipal payments on the Companys long-term debt are due as follows (in thousands):\n2023 $ 1,732\n2024 1,758\n2025 90,523\n2026 1,452\n2027 961\nThereafter 9,476\n$ 105,902\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n11. Other Long-Term Liabilities\nOther long-term liabilities consist of the following at October 31 (in thousands):\n2022 2021\nMinimum pension liability $ 2,272 $ 847\nLoan guarantee 1,080 1,080\nLeases 5,062 2,532\nOther 1,393 42\n$ 9,807 $ 4,501\n12. Leases\nLessor Arrangements\nThe Company enters into leasing transactions in which it rents certain of its assets and the Company is the lessor. These lease contracts are typically classified as operating leases with remaining terms ranging from one month to 20 years, with various renewal terms available. All of the residential rentals have month-to-month lease terms.\nThe following table presents the components of the Companys operating lease portfolio included in property, plant and equipment, net as of October 31 (in thousands):\n2022 2021\nLand and land improvements $ 13,619 $ 3,516\nBuildings, equipment and building improvements 19,983 18,712\nOrchards 8,410 -\nLess: accumulated depreciation (7,912) (6,331)\nProperty, plant and equipment, net under operating leases $ 34,100 $ 15,897\nDepreciation expense for assets under operating leases was approximately $934,000 and $669,000 for the fiscal years 2022 and 2021, respectively.\nThe Companys rental operations revenue consists of the following (in thousands):\nYear ended October 31,\n2022 2021\nOperating lease revenue $ 4,998 $ 4,329\nVariable lease revenue 326 317\nTotal lease revenue $ 5,324 $ 4,646\nThe future minimum lease payments to be received by the Company related to these operating lease agreements as of October 31, 2022 are as follows (in thousands):\n2023 $ 1,278\n2024 964\n2025 964\n2026 222\n2027 74\nThereafter 672\nTotal $ 4,174\nLessee Arrangements\nThe Company enters into leasing transactions in which the Company is the lessee. These lease contracts are classified as either operating or finance leases. The Companys lease contracts are generally for agricultural land and packinghouse facilities and equipment with remaining lease terms ranging from one to 15 years, with various term extensions available. The Companys lease agreements do not contain any residual value guarantees or material restrictive covenants. Leases with an initial term of\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n12. Leases (continued)\nLessee Arrangements (continued)\n12 months or less are not recorded on the balance sheet and the Company recognizes lease expense for these leases on a straight-line basis over the lease term.\nOperating lease costs were $537,000 and $606,000 and variable lease costs were $242,000 and $288,000, for the fiscal years 2022 and 2021, respectively, which are primarily included in agribusiness costs and expenses in the Companys consolidated statements of operations. Finance lease costs and short term lease costs were $154,000 and $212,000 for fiscal year 2022, respectively, and were immaterial for fiscal year 2021.\nSupplemental balance sheet information related to leases consists of the following as of October 31 (in thousands):\nClassification 2022 2021\nAssets\nOperating lease ROU assets Other assets $ 6,190 $ 2,041\nFinance lease assets Other assets 1,091 1,142\n$ 7,281 $ 3,183\nLiabilities\nCurrent operating lease liabilities Accrued liabilities and payables to related parties $ 1,892 $ 488\nCurrent finance lease liabilities Accrued liabilities 268 249\nNon-current operating lease liabilities Other long-term liabilities 4,347 1,648\nNon-current finance lease liabilities Other long-term liabilities 715 884\n$ 7,222 $ 3,269\nWeighted-average remaining lease term (in years):\nOperating leases 5.1 10.9\nFinance leases 3.9 4.9\nWeighted-average discount rate:\nOperating leases 6.1 % 3.7 %\nFinance leases 3.5 % 3.3 %\nSupplemental cash flow information related to leases consists of the following (in thousands):\nYear ended October 31,\n2022 2021\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash outflows from operating leases $ 577 $ 603\nOperating cash outflows from finance leases $ 35 $ 3\nFinancing cash outflows from finance leases $ 219 $ 18\nROU assets obtained in exchange for new operating lease liabilities $ 4,612 $ 271\nLeased assets obtained in exchange for new finance lease liabilities $ 68 $ 1,151\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n12. Leases (continued)\nLessee Arrangements (continued)\nFuture minimum lease payments under non-cancellable leases for each of the subsequent five fiscal years and thereafter are as follows (in thousands), which excludes $470,000 of operating lease payments for leases that have been signed but not commenced:\nOperating Finance Total\n2023 $ 1,891 $ 268 $ 2,159\n2024 1,918 268 2,186\n2025 1,914 268 2,182\n2026 218 246 464\n2027 134 - 134\nThereafter 1,046 - 1,046\nTotal lease payments 7,121 1,050 8,171\nLess: Imputed interest (882) (67) (949)\nPresent value of lease liabilities $ 6,239 $ 983 $ 7,222\nIn addition to operating and finance lease commitments, the Company also has financing transactions and a contract for pollination services, which do not meet the definition of a lease, with minimum future payments of $275,000 in fiscal year 2023, $224,000 in fiscal years 2024, 2025 and 2026 and $37,000 in fiscal year 2027.\n13. Earnings Per Share\nBasic net loss per common share is calculated using the weighted-average number of common shares outstanding during the period without consideration of the dilutive effect of conversion of preferred stock. Diluted net loss per common share is calculated using the weighted-average number of common shares outstanding during the period plus the dilutive effect of conversion of unvested, restricted stock and preferred stock. The Series B and Series B-2 convertible preferred shares were anti-dilutive for fiscal years ended October 31, 2022, 2021 and 2020. The computations for basic and diluted net loss per common share are as follows (in thousands, except per share amounts):\nYear ended October 31,\n2022 2021 2020\nBasic net loss per common share:\nNet loss applicable to common stock $ (737) $ (3,942) $ (16,936)\nEffect of unvested, restricted stock (50) (35) (44)\nNumerator: Net loss for basic EPS (787) (3,977) (16,980)\nDenominator: Weighted average common shares-basic 17,513 17,555 17,666\nBasic net loss per common share $ (0.04) $ (0.23) $ (0.96)\nDiluted net loss per common share:\nNumerator: Net loss for diluted EPS $ (787) $ (3,977) $ (16,980)\nWeighted average common shares-basic 17,513 17,555 17,666\nEffect of dilutive unvested, restricted stock and preferred stock - - -\nDenominator: Weighted average common shares-diluted 17,513 17,555 17,666\nDiluted net loss per common share $ (0.04) $ (0.23) $ (0.96)\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n13. Earnings Per Share (continued)\nDiluted net loss per common share is calculated using the more dilutive method of either the two-class method or the treasury stock method. Unvested stock-based compensation awards that contain non-forfeitable rights to dividends as participating shares are included in computing earnings per share. The Companys unvested, restricted stock awards qualify as participating shares. Diluted net loss per common share was calculated under the two-class method for the fiscal year ended October 31, 2022. The Company excluded 117,000 and 164,000, unvested, restricted shares, as calculated under the treasury stock method, from its computation of diluted net losses per share for the fiscal years ended October 31, 2021 and 2020, respectively.\n14. Related-Party Transactions\nThe Company has transactions with equity method investments and various related-parties summarized in Note 5 - Real Estate Development, Note 6 - Equity in Investments and in the tables below (in thousands):\nOctober 31, 2022 October 31, 2021\nBalance Sheet Balance Sheet\nRef Related-Party Receivables/Other from Related Parties Other Assets Payables to Related Parties Other Long-Term Liabilities Receivables/Other from Related Parties Other Assets Payables to Related Parties Other Long-Term Liabilities\n2 Mutual water companies $ - $ 506 $ 133 $ - $ - $ 432 $ 40 $ -\n5 Cadiz / Fenner / WAM $ - $ 1,288 $ 446 $ 1,198 $ - $ 1,386 $ 273 $ 1,297\n8 FGF $ 2,965 $ 2,652 $ 837 $ - $ 4,598 $ 980 $ 832 $ -\n9 LLCB $ 66 $ - $ 3,444 $ - $ - $ - $ 5,771 $ -\nYear Ended October 31, 2022 Year Ended October 31, 2021\nConsolidated Statement of Operations Consolidated Statement of Operations\nRef Related-Party Net Revenue Agribusiness Net Revenue Rental Operations Agribusiness Expense and Other Dividends Paid Net Revenue Agribusiness Net Revenue Rental Operations Agribusiness Expense and Other Dividends Paid\n1 Employees $ - $ 869 $ - $ - $ - $ 814 $ - $ -\n2 Mutual water companies $ - $ - $ 1,454 $ - $ - $ - $ 1,160 $ -\n3 Cooperative association $ - $ - $ 1,834 $ - $ - $ - $ 1,750 $ -\n4 Calavo $ - $ 80 $ 2 $ 126 $ 6,594 $ 320 $ 721 $ 503\n5 Cadiz / Fenner / WAM $ - $ - $ 1,467 $ - $ - $ - $ 338 $ -\n6 Colorado River Growers $ - $ - $ - $ - $ 157 $ - $ 2,772 $ -\n7 YMIDD $ 225 $ - $ 142 $ - $ - $ - $ 123 $ -\n8 FGF $ 673 $ 343 $ 25 $ - $ 4,129 $ - $ 2,884 $ -\n10 Freska $ - $ - $ - $ - $ 128 $ - $ 150 $ -\n11 Third-party growers $ - $ - $ - $ - $ - $ - $ 147 $ -\n12 Principal owner $ - $ - $ - $ 593 $ - $ - $ - $ -\nYear Ended October 31, 2020\nConsolidated Statement of Operations\nRef Related-Party Net Revenue Agribusiness Net Revenue Rental Operations Agribusiness Expense and Other Other Income, Net Dividends Paid\n1 Employees $ - $ 785 $ - $ - $ -\n2 Mutual water companies $ - $ - $ 894 $ - $ -\n3 Cooperative association $ - $ - $ 1,849 $ - $ -\n4 Calavo $ 8,806 $ 330 $ 1,223 $ 220 $ 503\n5 Cadiz / Fenner / WAM $ - $ - $ 240 $ - $ -\n6 Colorado River Growers $ 603 $ - $ 6,613 $ - $ -\n7 YMIDD $ - $ - $ 139 $ - $ -\n8 FGF $ 10,338 $ - $ 13,478 $ - $ -\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n14. Related-Party Transactions (continued)\n(1) Employees - The Company rents certain of its residential housing assets to employees on a month-to-month basis and recorded rental income from employees. There were no material rental payments due from employees at October 31, 2022 and 2021.\n(2) Mutual water companies - The Company has representation on the boards of directors of the mutual water companies in which the Company has investments, as well as other water districts. Refer to Note 8 - Other Assets. The Company recorded capital contributions, purchased water and water delivery services and had water payments due to the mutual water companies.\n(3) Cooperative association - The Company has representation on the board of directors of a non-profit cooperative association that provides pest control services for the agricultural industry. The Company purchased services and supplies from and had no payments due to the cooperative association.\n(4) Calavo - Through January 2022, the Company had representation on the board of directors of Calavo. Calavo owned common stock of the Company and the Company paid dividends on such common stock to Calavo. Additionally, the Company leases office space to Calavo. As of February 2022, Calavo is no longer a related party.\n(5) Cadiz / Fenner / WAM - A member of the Companys board of directors serves as the CEO, President and a member of the board of directors of Cadiz, Inc. In 2013, the Company entered a long-term lease agreement (the Lease) with Cadiz Real Estate, LLC (Cadiz), a wholly owned subsidiary of Cadiz, Inc., and currently leases 670 acres located in eastern San Bernardino County, California. The annual base rental is equal to the sum of $200 per planted acre and 20% of gross revenues from the sale of harvested lemons (less operating expenses), not to exceed $1,200 per acre per year. In 2016, Cadiz assigned this lease to Fenner Valley Farms, LLC (Fenner), a subsidiary of Water Asset Management, LLC (WAM). An affiliate of WAM is the holder of 9,300 shares of Limoneira Company Series B-2 convertible preferred stock. Upon the adoption of ASC 842, the Company recorded a right-of-use, or ROU, asset and corresponding lease liability.\n(6) Colorado River Growers, Inc. (CRG) - The Company had representation on the board of directors of CRG, a non-profit cooperative association of fruit growers engaged in the agricultural harvesting business in Yuma County, Arizona. CRG was dissolved in August 2021. The Company paid harvest expense to CRG and provided harvest management and administrative services to CRG.\n(7) Yuma Mesa Irrigation and Drainage District (YMIDD) - The Company has representation on the board of directors of YMIDD. The Company purchased water from YMIDD and had no amounts payable to them for such purchases. Additionally, the Compnay received fallowing revenue from YMIDD.\n(8) FGF - In June 2021, the Company entered into an agreement, effective March 1, 2021, to sell and license certain assets of Trapani Fresh to FGF. These assets consist of packing supplies and certain intangible assets related to the packing, marketing, and selling business of Trapani Fresh. The total consideration to be received is approximately $3,900,000 over an 8-year term in 16 equal installments. Payments to be received are secured by FGFs interest in land parcels at the Santa Clara ranch and consist of a $1,200,000 note receivable and $2,700,000 of royalty payments. There was no material gain or loss recognized on the transaction. In August 2021, the Company entered into several additional agreements whereby the additional 25% interest in Santa Clara was transferred into the trust resulting in the trust now holding a 100% interest in Santa Clara. Trapani Fresh owns and operated the 1,200-acre Santa Clara ranch and sold the lemons it grew to FGF, who packed, marketed, and sold the fruit to its export customers. As a result of this transaction, Trapani Fresh recognized lemon revenues at the market price less packinghouse charges to harvest, pack and market the fruit. Effective November 1, 2021, the Company leases Finca Santa Clara to FGF and records rental revenue related to the leased land.\nThe Company advances funds to FGF for fruit purchases, which are recorded as an asset until the sales occur and the remaining proceeds become due to FGF. Additionally, FGF provided farming, packing, by-product processing and administrative services to Trapani Fresh. The Company had a receivable from FGF for lemon sales and the sale of packing supplies and a payable due to FGF for fruit purchases and services. The Company records revenue related to the licensing of intangible assets to FGF.\n(9) LLCB - Refer to Note 5 - Real Estate Development.\n(10) Freska - A former member of the Company's board of directors is a majority shareholder of Freska Produce International, LLC (\"Freska\"). The Company had avocado sales to Freska and corresponding receivables for such sales. The former board member resigned effective June 14, 2022 and Freska is no longer a related-party.\n(11) Third-party growers - A former member of the Company's board of directors marketed lemons through the Company. The former board member resigned effective June 14, 2022 and is no longer a related-party.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n14. Related-Party Transactions (continued)\n(12) Principal owner - The Company has one principal owner with ownership shares over 10% and paid dividends to such owner.\n15. Income Taxes\nA reconciliation of income (loss) before income taxes for domestic and foreign locations for the years ended October 31, 2022, 2021 and 2020 are as follows (in thousands):\n2022 2021 2020\nUnited States $ 1,911 $ (1,459) $ (23,195)\nForeign (1,562) (2,704) (3,240)\nIncome (loss) before income taxes $ 349 $ (4,163) $ (26,435)\nThe components of the provisions for income taxes for fiscal years 2022, 2021 and 2020 are as follows (in thousands):\n2022 2021 2020\nCurrent:\nFederal $ (178) $ 37 $ 5,835\nState (93) 40 332\nForeign (4) - 194\nTotal current (provision) benefit (275) 77 6,361\nDeferred:\nFederal (477) (17) 640\nState (127) 127 1,177\nForeign 56 79 316\nTotal deferred (provision) benefit (548) 189 2,133\nTotal income tax (provision) benefit $ (823) $ 266 $ 8,494\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n15. Income Taxes (continued)\nDeferred income taxes reflect the net of temporary differences between the carrying amount of the assets and liabilities for financial reporting and income tax purposes. The components of deferred income tax assets at October 31, 2022 and 2021 are as follows (in thousands):\n2022 2021\nDeferred income tax assets:\nReserve and other accruals $ 752 $ 646\nNet operating losses 5,917 6,312\nRight-of-use asset 1,672 531\nMinimum pension liability adjustment 621 231\nOther assets 151 240\nInterest expense limitation - 2\nStock-based compensation 604 493\nTotal deferred income tax assets 9,717 8,455\nValuation allowance (1,536) (1,324)\nTotal net deferred income tax assets 8,181 7,131\nDeferred income tax liabilities:\nProperty taxes (135) (161)\nDepreciation (18,343) (18,665)\nAmortization (175) (242)\nLand and other indefinite life assets (6,592) (6,581)\nInvestment in joint ventures and other basis adjustments (4,449) (3,510)\nRight-of-use asset (1,660) (510)\nPrepaids and receivables (298) (260)\nOther (26) (55)\nTotal deferred income tax liabilities (31,678) (29,984)\nNet deferred income tax liabilities $ (23,497) $ (22,853)\nDeferred income taxes - noncurrent assets $ - $ -\nDeferred income taxes - noncurrent liabilities $ (23,497) $ (22,853)\nThe Company periodically evaluates the recoverability of the deferred tax assets. The Company recognized deferred tax assets to the extent that it believes that these assets are more likely than not to be realized. In making such a determination, the Company considers all available positive and negative evidence, including future reversals of existing taxable temporary differences, projected future taxable income, tax-planning strategies, and results of recent operations. The Company has recorded a valuation allowance of $1,536,000 on the net deferred tax assets of its subsidiaries in Argentina and Chile as of October 31, 2022 as the Company does not believe it is more likely than not that these deferred tax assets will be realized due to the recent history of cumulative pre-tax book losses and lack of objectively verifiable future source of taxable income.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n15. Income Taxes (continued)\nAt October 31, 2022, the Company has recorded a deferred tax asset of $5,917,000 related to its federal, state, and foreign net operating loss carryforwards. The entire federal net operating loss is subject to the 80% taxable income limitation. The net operating losses begin to expire as follows (in thousands):\nJurisdiction Gross Amount Begin to Expire\nFederal 14,959 Indefinite\nState 23,027 10/31/2039\nChile 2,874 Indefinite\nHolland 108 10/31/2025\nArgentina 1,670 10/31/2025\nThe provision for income taxes differs from the amount of income tax determined by applying U.S. statutory federal income tax rate to pretax income as a result of the following differences (in thousands):\n2022 2021 2020\nAmount % Amount % Amount %\nProvision at statutory rates $ (73) (21.0) % $ 874 (21.0) % $ 5,551 (21.0) %\nState income tax, net of federal benefit (74) (21.1) % 224 (5.4) % 1,431 (5.4) %\nDividend exclusion - - % - - % 27 (0.1) %\nMeals and entertainment - - % - - % (18) 0.1 %\nShared-based compensation (110) (31.2) % (217) 5.2 % - - %\nExecutive compensation (98) (27.9) % (45) 1.1 % - - %\nTax law change - - % 57 (1.4) % 1,948 (7.4) %\nState rate adjustment (59) (16.9) % (78) 1.9 % (82) 0.3 %\nValuation allowance (357) (101.8) % (831) 20.0 % (168) 0.6 %\nForeign rate differential 74 21.1 % 130 (3.1) % - - %\nNoncontrolling interest (41) (11.8) % (83) 2.0 % (305) 1.1 %\nOther permanent items (12) (3.5) % 235 (5.7) % 110 (0.4) %\nTax credit and others (73) (20.7) % - - % - - %\nTotal income tax (provision) benefit $ (823) (234.8) % $ 266 (6.4) % $ 8,494 (32.2) %\nAt October 31, 2022 and 2021, the Company had no unrecognized tax benefits. The Company files income tax returns in the U.S., California, Arizona, Chile, Argentina and Holland. The Company is no longer subject to significant U.S., state and Chilean income tax examinations for years prior to the statutory periods of three years for federal, four years for state and three years for Chilean tax jurisdictions. The Company recognizes interest expense and penalties related to income tax matters as a component of income tax expense. There was no accrued interest or penalties associated with uncertain tax positions as of October 31, 2022.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n16. Retirement Plans\nThe Limoneira Company Retirement Plan (the Plan) is a noncontributory, defined benefit, single employer pension plan, which provides retirement benefits for all eligible employees. Benefits paid by the Plan are calculated based on years of service, highest five-year average earnings, primary Social Security benefit and retirement age. Effective June 2004, the Company froze the Plan and no additional benefits accrued to participants subsequent to that date. The Plan is administered by Principal Bank and Mercer Human Resource Consulting. In fiscal year 2021, the Company terminated the Plan effective December 31, 2021. The liabilities disclosed as of October 31, 2022 and 2021, reflect an estimate of the additional cost to pay lump sums to a portion of the active and vested terminated participants and purchase annuities for all remaining participants from an insurance company.\nThe Plan was funded consistent with the funding requirements of federal law and regulations. There were no funding contributions during fiscal years 2022 or 2021. Plan assets are invested in a group trust consisting primarily of cash.\nThe investment policy and strategy has been established to provide a total investment return that will, over time, maintain purchasing power parity for the Plans variable benefits and keep the Plan funding at a reasonable level. The target asset allocation is 100% cash.\nThe following tables set forth the Plans net periodic cost, changes in benefit obligation and Plan assets, funded status, amounts recognized in the Companys consolidated balance sheets, additional year-end information and assumptions used in determining the benefit obligations and net periodic benefit cost.\nThe components of net periodic benefit cost for the Plan for fiscal years 2022 and 2021 were as follows (in thousands):\n2022 2021\nAdministrative expenses $ 718 $ 277\nInterest cost 520 550\nExpected return on plan assets (511) (867)\nPrior service cost 45 45\nAmortization of net loss 398 737\nSettlement loss recognized 607 $ -\nNet periodic benefit cost $ 1,777 $ 742\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n16. Retirement Plans (continued)\nFollowing is a summary of the Plans funded status as of October 31 (in thousands):\n2022 2021\nChange in benefit obligation:\nBenefit obligation at beginning of year $ 21,417 $ 22,898\nAdministrative expenses 718 277\nPlan settlements (3,604) -\nInterest cost 520 550\nBenefits paid (1,327) (1,210)\nExpenses paid (643) (240)\nActuarial gain (2,474) (858)\nBenefit obligation at end of year $ 14,607 $ 21,417\nChange in plan assets:\nFair value of plan assets at beginning of year $ 20,570 $ 19,352\nActual return on plan assets (2,661) 2,668\nPlan settlements (3,604) -\nBenefits paid (1,327) (1,210)\nExpenses paid (643) (240)\nFair value of plan assets at end of year $ 12,335 $ 20,570\nReconciliation of funded status:\nFair value of plan assets $ 12,335 $ 20,570\nBenefit obligations 14,607 21,417\nNet plan obligations $ (2,272) $ (847)\nAmounts recognized in statements of financial position:\nNoncurrent liabilities $ (2,272) $ (847)\nNet obligation recognized in statements of financial position $ (2,272) $ (847)\nReconciliation of amounts recognized in statements of financial position:\nPrior service cost $ (54) $ (99)\nNet loss (2,459) (2,766)\nAccumulated other comprehensive loss (2,513) (2,865)\nAccumulated contributions in excess of net periodic benefit cost 241 2,018\nNet deficit recognized in statements of financial position $ (2,272) $ (847)\nPresented below are changes in accumulated other comprehensive income, before tax, in the Plan as of October 31, (in thousands):\n2022 2021\nChanges recognized in other comprehensive income:\nNet loss (gain) arising during the year $ 697 $ (2,658)\nAmortization of prior service cost (45) (45)\nAmortization of net loss (1,005) (737)\nTotal recognized in other comprehensive income $ (353) $ (3,440)\nTotal recognized in net periodic benefit and other comprehensive loss (income) $ 1,424 $ (2,699)\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n16. Retirement Plans (continued)\nThe following assumptions, as of October 31, were used in determining benefit obligations and net periodic benefit cost ($ in thousands):\n2022 2021\nWeighted-average assumptions used to determine benefit obligations:\nDiscount rate NA 2.58 %\nAssumptions used to determine net periodic benefit cost:\nDiscount rate 2.58 % 2.50 %\nExpected return on plan assets 2.98 % 5.05 %\nAdditional year-end information:\nProjected benefit obligation $ 14,607 $ 21,417\nAccumulated benefit obligation $ 14,607 $ 21,417\nFair value of plan assets $ 12,335 $ 20,570\nEmployer contributions of $2,500,000 and benefit payments of $14,607,000 are expected to be paid in fiscal year 2023.\nThe following table sets forth the Plans assets as of October 31, 2022, segregated by level using the hierarchy established by FASB ASC 820, Fair Value Measurements and Disclosures (in thousands):\nLevel 1 Level 2 Level 3 Total\nCash and cash equivalents $ 12,302 $ - $ - $ 12,302\nAccrued income - 33 - 33\n$ 12,302 $ 33 $ - $ 12,335\nThe Company has a 401(k) plan in which an employee can participate after one year of employment. Employees may elect to defer up to 100% of their annual earnings subject to Internal Revenue Code limits. The Company makes a matching contribution on these deferrals up to 4% of the employees annual earnings. Participants vest in any matching contribution at a rate of 20% per year beginning after one year of employment. During fiscal years 2022, 2021 and 2020, the Company contributed to the plan and recognized expenses of $445,000, $546,000 and $1,107,000, respectively.\n17. Commitments and Contingencies\nLitigation and Legal Proceedings\nThe Company is from time to time involved in various lawsuits and legal proceedings that arise in the ordinary course of business. At this time, the Company is not aware of any pending or threatened litigation against it that it expects will have a material adverse effect on its business, financial condition, liquidity, or operating results. Legal claims are inherently uncertain, however, and it is possible that the Companys business, financial condition, liquidity and/or operating results could be adversely affected in the future by legal proceedings.\nThe Company is party to a lawsuit, initiated on March 27, 2018, against Southern California Edison in Superior Court of the State of California, County of Los Angeles whereby the Company is claiming unspecified damages, attorneys' fees and other costs, as a result from the Thomas Fire in fiscal year 2018. While the outcome of this lawsuit is uncertain, the Company believes its claim for damages is valid.\n18. Series B and Series B-2 Preferred Stock\nSeries B Convertible Preferred Stock\nIn 1997, in connection with the acquisition of Ronald Michaelis Ranches, Inc., the Company issued 30,000 shares of Series B Convertible Preferred Stock at $100.00 par value (the Series B Stock).\nDividends: The holders of shares of Series B Stock are entitled to receive cumulative cash dividends at an annual rate of 8.75% of par value. Such dividends are payable quarterly on the first day of January, April, July and October in each year.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n18. Series B and Series B-2 Preferred Stock (continued)\nSeries B Convertible Preferred Stock (continued)\nVoting Rights: Each holder of Series B Stock is entitled to ten votes on all matters submitted to a vote of the stockholders of the Company.\nRedemption: The Company, at the option of the Board of Directors, may redeem the Series B Stock, as a whole or in part, at any time or from time to time on or after August 1, 2017 and before July 31, 2027, at a redemption price equal to the par value thereof, plus accrued and unpaid dividends thereon to the date fixed for redemption. Redemption by the Company of a portion of the Series B Stock totaling 14,790 shares is subject to certain conditions agreed upon between the Company and the holders of this portion of the Series B Stock.\nConversion: The holders of Series B Stock have the right, at their option, to convert such shares into shares of Common Stock of the Company at any time prior to redemption. The conversion price is $8.00 per share of Common Stock. Pursuant to the terms of the Certificate of Designation, Preferences and Rights of the Series B Stock, the conversion price shall be adjusted to reflect any dividends paid in Common Stock of the Company, the subdivision of the Common Stock of the Company into a greater number of shares of Common Stock of the Company or upon the advice of legal counsel.\nPut: The holders of Series B Stock may at any time after July 1, 2017 and before June 30, 2027 cause the Company to repurchase such shares at a repurchase price equal to the par value thereof, plus accrued and unpaid dividends thereon to the date fixed for repurchase. The put features of a portion of the Series B Stock totaling 14,790 shares are subject to certain conditions agreed upon between the Company and the holders of this portion of the Series B Stock.\nBecause the Series B Stock may be redeemed by holders of the shares at their discretion beginning July 1, 2017, the redemption is outside the control of the Company and accordingly, the Series B Stock has been classified as temporary equity.\nSeries B-2 Convertible Preferred Stock\nDuring March and April of 2014, pursuant to a Series B-2 Stock Purchase Agreement dated March 21, 2014, the Company issued an aggregate of 9,300 shares of Series B-2, 4% voting preferred stock with a par value of $100.00 per share (Series B-2 Preferred Stock) to WPI-ACP Holdings, LLC (WPI), an entity affiliated with WAM for total proceeds of $9,300,000. The transactions were exempt from the registration requirements of the Securities Act of 1933, as amended. The Series B-2 Preferred Stock has the following rights, preferences, privileges, and restrictions:\nConversion: Each share of Series B-2 Preferred Stock is convertible into common stock at a conversion price equal to the greater of (a) the then-market price of the Companys common stock based upon the closing price of the Companys common stock on The NASDAQ Stock Market, LLC or on such other principal market on which the Companys common stock may be trading or (b) $15.00 per share of common stock. Shares of Series B-2 Preferred Stock may be converted into common stock (i) at any time prior to the redemption thereof, or (ii) in the event the Option Agreement (as defined below) is terminated without all of the shares of Series B-2 Preferred Stock having been redeemed, within 30 calendar days following such termination.\nDividends: The holder of shares of the Series B-2 Preferred Stock is entitled to receive cumulative cash dividends at an annual rate of 4% of the liquidation value of $1,000 per share. Such dividends are payable quarterly on the first day of January, April, July and October in each year.\nLiquidation Rights: In the event of any voluntary or involuntary liquidation, dissolution or winding up of the Company, the holder of shares of the Series B-2 Preferred Stock is entitled to be paid out of the assets available for distribution, before any payment is made to the holders of the Companys common stock or any other series or class of the Companys shares ranking junior to the Series B-2 Preferred Stock, an amount equal to the liquidation value of $1,000 per share, plus an amount equal to all accrued and unpaid dividends.\nVoting Rights: Each share of Series B-2 Preferred Stock is entitled to one vote on all matters submitted to a vote of the Companys stockholders.\nRedemption: The Company may redeem shares of Series B-2 Preferred Stock only (i) from WPI or its designee and (ii) upon, and to the extent of, an election to exercise the option pursuant to the Option Agreement, described below, at a redemption price equal to the liquidation value of $1,000 per share plus accrued and unpaid dividends.\nBecause the Series B-2 Preferred Stock may be redeemed by WPI at its discretion with the exercise of the Option Agreement, the redemption is outside the control of the Company and accordingly, the Series B-2 Preferred Stock has been classified as temporary equity.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n18. Series B and Series B-2 Preferred Stock (continued)\nSeries B-2 Convertible Preferred Stock (continued)\nIn connection with the sale of the Series B-2 Preferred Stock, Associated Citrus Packers, Inc. (Associated) and another affiliate of WAM (WPI-ACP), entered into a series of agreements related to the future ownership and disposition of farmland with associated Colorado River water rights and other real estate that is held by Associated in Yuma, Arizona. The agreements allow the parties to explore strategies that will make the highest and best use of those assets, including but not limited to the sale or lease of assets or the expansion of a fallowing and water savings program in which a portion of Associateds property is currently enrolled.\nThe net proceeds of any monetization event would be shared equally by the parties. The agreements entered into include a Water Development Agreement and an Option Agreement. Pursuant to the Water Development Agreement, Associated granted WPI-ACP exclusive rights to develop water assets attributable to the real estate owned by Associated for the mutual benefit of Associated and WAM. Pursuant to the Option Agreement, Associated granted WPI-ACP an option to purchase an undivided interest of up to one-half of the real estate owned by Associated in Yuma County, Arizona (the Property) and the water rights associated therewith until January 1, 2026. The purchase price for the Property subject to the Option Agreement will be paid via the redemption by the Company of a proportionate percentage of the Series B-2 Preferred Stock. Unless and until a definitive agreement or definitive agreements with respect to Associateds real estate and water rights is entered into that would cause the cessation of farming operations, Associated expects to continue farming the Property and recognize all results of operations and retain all proceeds from such operations.\n19. Stockholders Equity\nSeries A Junior Participating Preferred Stock\nThe Company has 20,000 shares of preferred stock authorized as Series A Junior Participating Preferred Stock at $0.01 par value (the Series A Stock). No shares are issued or outstanding.\nStock-based compensation\nThe Company has a stock-based compensation plan that allows for the grant of common stock of the Company to members of management, key executives and non-employee directors. The fair value of such awards is based on the fair value of the Company's stock on the date of grant and all are classified as equity awards. In fiscal year 2022, the 2010 Stock Plan terminated and was replaced by the 2022 Stock Plan (both plans collectively the Stock Plans) with 500,000 authorized shares. The Stock Plan has 450,769 remaining shares available to be issued as of October 31, 2022.\nPerformance Awards\nCertain restricted stock grants are made to management each December under the Stock Plans based on the achievement of certain annual financial performance and other criteria achieved during the previous fiscal year (Performance Awards). The performance grants are based on a percentage of the employees base salary divided by the stock price on the grant date once the performance criteria has been met, and generally vest over a two-year period as service is provided. During December 2022, 79,972 shares of common stock with a per share price of $13.19 were granted to management under the Stock Plan for fiscal year 2022 performance, resulting in total compensation expense of approximately $1,055,000, with $365,000 recognized in the fiscal year ended October 31, 2022 and the balance to be recognized over the next two years as the shares vest. During December 2021 and 2020, there were no Performance Awards of restricted stock granted for fiscal year 2021 or 2020 performance because the financial performance and other criteria were not met.\nExecutive Awards\nCertain restricted stock grants are made to key executives under the Stock Plan (Executive Awards). These grants generally vest over a three to five-year period as service is provided. During December 2022, subsequent to fiscal year 2022, the Company granted 55,000 shares of common stock with a per share price of $13.19 to key executives under the Stock Plan. The related compensation expense of approximately $725,000 will be recognized equally over the next three years as the shares vest.\nIn fiscal year 2022, the Company entered into Retention Bonus Agreements with key executives (collectively, the Retention Bonus Agreements) whereby the executives will be eligible to receive cash and restricted stock grants. During December 2022, subsequent to fiscal year 2022, the Company granted 11,317 shares of common stock with a per share price of $13.19 to key executives related to the Retention Bonus Agreements. The related compensation expense of approximately $149,000 had\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n19. Stockholders Equity (continued)\nStock-based compensation (continued)\n$122,000 recognized in the fiscal year ended October 31, 2022 and the balance will be recognized over the next year as the shares vest.\nDirector Awards\nThe Company issues shares of common stock to non-employee directors under the Stock Plan on an annual basis that generally vest upon grant or over a one-year period (Director Awards).\nSummary of Awards\nA summary of the Performance, Executive, and Director awards granted under the Stock Plan during fiscal years 2022, 2021 and 2020, and the weighted average grant price is as follows:\nYear Ended October 31,\n2022 2021 2020\nNumber of Shares Weighted-Average Grant Price Number of Shares Weighted-Average Grant Price Number of Shares Weighted-Average Grant Price\nPerformance awards - $ - - $ - - $ -\nExecutive awards 70,000 $ 14.96 95,000 $ 15.26 95,000 $ 18.87\nDirector awards 49,231 $ 13.55 30,663 $ 16.85 17,841 $ 20.05\nTotal 119,231 $ 14.38 125,663 $ 15.65 112,841 $ 19.06\nThe Company recognized $2,732,000, $2,582,000 and $2,044,000 of stock-based compensation in fiscal years 2022, 2021 and 2020, respectively, of which substantially all of the expense has been included in selling, general and administrative expenses for all years presented. Forfeitures are accounted for in the period that the forfeiture occurs. The income tax benefit recognized in the income statement for stock-based compensation arrangements was $604,000, $476,000 and $400,000 for fiscal years 2022, 2021 and 2020, respectively. The total fair value of shares vested during the years ended October 31, 2022, 2021 and 2020 was $1,856,000, $2,951,000 and $2,365,000 respectively. The Company has unrecognized stock-based compensation expense of $1,208,000 as of October 31, 2022, which is expected to be recognized over the next one to two years as the shares vest. All unvested shares are expected to vest.\nDuring fiscal years 2022, 2021 and 2020, respectively, members of management exchanged 105,316, 46,993 and 11,314 shares of common stock with fair values of $1,530,000, $701,000 and $213,000, at the dates of the exchanges, for the payment of payroll taxes associated with the vesting of shares under the Companys stock-based compensation programs.\nA summary of the status of the Companys nonvested shares as of October 31, 2022, and changes during the fiscal year ended October 31, 2022, is presented below:\nNumber of Shares Weighted-Average\nGrant Price\nNonvested at October 31, 2021 113,000 $ 17.38\nGranted 119,231 $ 14.38\nVested (106,334) $ 17.46\nForfeited (15,000) $ 14.96\nNonvested at October 31, 2022 110,897 $ 14.40\nTreasury Stock\nShare Repurchase Program\nIn fiscal year 2021, the Company's Board of Directors approved a share repurchase program authorizing it to repurchase up to $10,000,000 of its outstanding shares of common stock through September 2022; no shares were repurchased under this program. In fiscal year 2020, the Company repurchased 250,977 shares for $3,493,000 under a program which expired in March 2021.\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n19. Stockholders Equity (continued)\nDividend\nOn December 20, 2022, the Company declared a $0.075 per share dividend payable on January 13, 2023, in the aggregate amount of $1,326,000 to common stockholders of record as of January 3, 2023.\n20. Segment Information\nThe Company operates in four reportable operating segments: fresh lemons, lemon packing, avocados and other agribusiness. The reportable operating segments of the Company are strategic business units with different products and services, distribution processes and customer bases. The fresh lemons segment includes sales, farming and harvest costs and third-party grower and supplier costs relative to fresh lemons. The lemon packing segment includes packing revenues and shipping and handling revenues relative to lemon packing. The lemon packing segment expenses are comprised of lemon packing costs. The lemon packing segment revenues include intersegment revenues between fresh lemons and lemon packing. The intersegment revenues are included gross in the segment note and a separate line item is shown as an elimination. The avocados segment includes sales, farming and harvest costs. The other agribusiness segment includes sales, farming and harvest costs and brokered fruit costs of oranges, specialty citrus and other crops. Revenues related to rental operations are included in Corporate and Other.\nThe Company does not separately allocate depreciation and amortization to its fresh lemons, lemon packing, avocados and other agribusiness segments. No asset information is provided for reportable operating segments, as these specified amounts are not included in the measure of segment profit or loss reviewed by the Companys chief operating decision maker. The Company measures operating performance, including revenues and operating income, of its operating segments and allocates resources based on its evaluation. The Company does not allocate selling, general and administrative expense, total other income (expense) and income taxes, or specifically identify them to its operating segments. The Company earns packing revenue for packing lemons grown on its orchards and lemons procured from third-party growers. Intersegment revenues represent packing revenues related to lemons grown on the Companys orchards.\nSegment information for fiscal year 2022 (in thousands):\nFresh\nLemons Lemon\nPacking Eliminations Avocados Other\nAgribusiness Total\nAgribusiness Corporate\nand Other Total\nRevenues from external customers $ 120,885 $ 22,176 $ - $ 17,331 $ 18,889 $ 179,281 $ 5,324 $ 184,605\nIntersegment revenue - 29,817 (29,817) - - - - -\nTotal net revenues 120,885 51,993 (29,817) 17,331 18,889 179,281 5,324 184,605\nCosts and expenses 115,119 43,017 (29,817) 5,524 18,204 152,047 20,559 172,606\nDepreciation and amortization - - - - - 8,604 1,194 9,798\nOperating income (loss) $ 5,766 $ 8,976 $ - $ 11,807 $ 685 $ 18,630 $ (16,429) $ 2,201\nSegment information for fiscal year 2021 (in thousands):\nFresh\nLemons Lemon\nPacking Eliminations Avocados Other\nAgribusiness Total\nAgribusiness Corporate\nand Other Total\nRevenues from external customers $ 125,448 $ 17,514 $ - $ 6,784 $ 11,635 $ 161,381 $ 4,646 $ 166,027\nIntersegment revenue - 25,637 (25,637) - - - - -\nTotal net revenues 125,448 43,151 (25,637) 6,784 11,635 161,381 4,646 166,027\nCosts and expenses 116,117 36,018 (25,637) 4,211 9,157 139,866 22,682 162,548\nDepreciation and amortization - - - - - 8,626 1,186 9,812\nOperating (loss) income $ 9,331 $ 7,133 $ - $ 2,573 $ 2,478 $ 12,889 $ (19,222) $ (6,333)\nSegment information for fiscal year 2020 (in thousands):\nFresh\nLemons Lemon\nPacking Eliminations Avocados Other\nAgribusiness Total\nAgribusiness Corporate\nand Other Total\nRevenues from external customers $ 124,150 $ 13,413 $ - $ 8,806 $ 13,568 $ 159,937 $ 4,622 $ 164,559\nIntersegment revenue - 36,820 (36,820) - - - - -\nTotal net revenues 124,150 50,233 (36,820) 8,806 13,568 159,937 4,622 164,559\nCosts and expenses 125,305 42,563 (36,820) 5,168 12,122 148,338 25,132 173,470\nDepreciation and amortization - - - - - 8,943 1,154 10,097\nOperating (loss) income $ (1,155) $ 7,670 $ - $ 3,638 $ 1,446 $ 2,656 $ (21,664) $ (19,008)\nLIMONEIRA COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (CONTINUED)\n20. Segment Information (continued)\nThe following is a detail of other agribusiness revenues for fiscal years 2022, 2021 and 2020 (in thousands):\nYear Ended October 31,\n2022 2021 2020\nOranges $ 9,911 $ 4,382 $ 7,722\nSpecialty citrus and other crops 8,978 7,253 5,846\nOther agribusiness revenues $ 18,889 $ 11,635 $ 13,568\n21. Subsequent Events\nThe Company evaluated events subsequent to October 31, 2022 through the date of this filing, to assess the need for potential recognition or disclosure in this Annual Report. Based upon this evaluation, except as described in the notes to consolidated financial statements, it was determined that no other subsequent events occurred that require recognition or disclosure in the consolidated financial statements. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures\nDisclosure Controls and Procedures. As of October 31, 2022, we carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures, as such term is defined in Rule 13a-15(e) promulgated under the Exchange Act. Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of the end of the period covered by this Annual Report.\nInternal Control over Financial Reporting. Refer to Managements Report on Internal Control over Financial Reporting and Report of Independent Registered Public Accounting Firm below.\nManagements Report on Internal Control over Financial Reporting\nManagement of Limoneira Company (the Company) is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined in the Exchange Act Rule 13a-15(f). Internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThe Companys management, including the principal executive officer and principal financial officer, conducted an evaluation of the effectiveness of Limoneira Companys internal control over financial reporting, based on the framework in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, management concluded that internal control over financial reporting was effective as of October 31, 2022. Deloitte & Touche LLP, an independent registered public accounting firm, has audited the effectiveness of the Companys internal control over financial reporting and has issued a report on internal control over financial reporting, which is included herein.\nHarold S. Edwards\nPresident and Chief Executive Officer\nMark Palamountain\nChief Financial Officer and Treasurer\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Limoneira Company\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Limoneira Company and subsidiaries (the Company) as of October 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of October 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended October 31, 2022, of the Company and our report dated December 22, 2022, expressed an unqualified opinion on those financial statements based on our audit and the report of the other auditors.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nLos Angeles, California\nDecember 22, 2022\nChanges in Internal Control over Financial Reporting. There have been no significant changes in our internal control over financial reporting during the quarter ended October 31, 2022 or, to our knowledge, in other factors that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nLimitations on the Effectiveness of Controls. Control systems, no matter how well conceived and operated, are designed to provide a reasonable, but not an absolute, level of assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III\nCertain information required by Part III is omitted from this Annual Report because we will file a definitive Proxy Statement for the Annual Meeting of Stockholders pursuant to Regulation 14A of the Exchange Act (the Proxy Statement), not later than 120 days after the end of the fiscal year covered by this Annual Report, and the applicable information included in the Proxy Statement is incorporated herein by reference. Item 10. Directors, Executive Officers, and Corporate Governance\nThe information required by this Item is incorporated herein by reference to the Proxy Statement. Item 11. Executive Compensation\nThe information required by this Item is incorporated herein by reference to the Proxy Statement. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item is incorporated herein by reference to the Proxy Statement. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item is incorporated herein by reference to the Proxy Statement. Item 14. Principal Accounting Fees and Services\nThe information required by this Item is incorporated herein by reference to the Proxy Statement.\nPart IV Item 15. Exhibits and Financial Statement Schedules\n(a)(1) Financial Statements\nReport of Independent Registered Public Accounting Firm (Public Company Accounting Oversight Board identification number 34)\nConsolidated Financial Statements of Limoneira Company\nConsolidated Balance Sheets at October 31, 2022 and 2021\nConsolidated Statements of Operations for the years ended October 31, 2022, 2021 and 2020\nConsolidated Statements of Comprehensive Loss for the years ended October 31, 2022, 2021 and 2020\nConsolidated Statements of Stockholders Equity and Temporary Equity for the years ended October 31, 2022, 2021 and 2020\nConsolidated Statements of Cash Flows for the years ended October 31, 2022, 2021 and 2020\nNotes to Consolidated Financial Statements\nManagements Report on Internal Control over Financial Reporting\nReport of Independent Registered Public Accounting Firm on Internal Control over Financial Reporting\n(a)(2) Financial Statement Schedules\nPer Item 15(a)(2), list the following documents filed as part of the report: those financial statements required to be filed by Item 8 of this Form 10-K, and by paragraph (b) below.\n(b) Exhibits\nSee Exhibit Index set forth on page 89.\n(c) Financial Statement Schedules\nPer Item 15(c), registrants shall file, as financial statement schedules to this Form 10-K, the financial statements required by Regulation S-X (17 CFR 210) which are excluded from the annual report to stockholders by Rule 14a-3(b) including: (1) separate financial statements of subsidiaries not consolidated and fifty percent or less owned persons; (2) separate financial statements of affiliates whose securities are pledged as collateral; and (3) schedules.\nItem 16. Form 10-K Summary\nNone\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on December 22, 2022.\nLIMONEIRA COMPANY\nBy: /s/ Harold S. Edwards\nHarold S. Edwards\nDirector, President and\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report has been signed below on December 22, 2022, by the following persons on behalf of the registrant and in the capacities indicated:\nSignature Title\n/s/ Scott S. Slater Chairman of the Board of Directors\nScott S. Slater\n/s/ Harold S. Edwards Director, President and Chief Executive Officer\nHarold S. Edwards (Principal Executive Officer)\n/s/ Mark Palamountain Chief Financial Officer and Treasurer\nMark Palamountain (Principal Financial and Accounting Officer)\n/s/ Gordon E. Kimball Director\nGordon E. Kimball\n/s/ Edgar Terry Director\nEdgar Terry\n/s/ Elizabeth Blanchard Chess Director\nElizabeth Blanchard Chess\n/s/ Elizabeth Mora Director\nElizabeth Mora\n/s/ John W.H. Merriman Director\nJohn W.H. Merriman\n/s/ Barbara Carbone Director\nBarbara Carbone\nEXHIBIT INDEX\nExhibit\nNo. Description\n2.1 Certificate of Merger of Limoneira Company and The Samuel Edwards Associates into Limoneira Company, dated October 31, 1990 (Incorporated by reference to exhibit 3.2 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n2.2 Certificate of Merger of McKevett Corporation into Limoneira Company dated December 31, 1994 (Incorporated by reference to exhibit 3.3 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n2.3 Agreement of Merger Between Ronald Michaelis Ranches, Inc. and Limoneira Company, dated June 24, 1997 (Incorporated by reference to exhibit 3.6 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n3.1 Restated Certificate of Incorporation of Limoneira Company, dated July 5, 1990 (Incorporated by reference to exhibit 3.1 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n3.2 Certificate of Amendment of Certificate of Incorporation of Limoneira Company, dated April 22, 2003 (Incorporated by reference to exhibit 3.7 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n3.3 Certificate of Amendment of Certificate of Incorporation of Limoneira Company, dated March 24, 2010 (Incorporated by reference to exhibit 3.9 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n3.4 Certificate of Amendment of Certificate of Incorporation of Limoneira Company, dated March 29, 2017 (Incorporated by reference to exhibit 3.1 to the Companys Current Report on Form 8-K, filed March 31, 2017 (File No. 001-34755))\n3.5 Amended and Restated Bylaws of Limoneira Company (Incorporated by reference to exhibit 3.1 to the Company's Current Report on Form 8-K, filed October 27, 2021 (File No. 001-34755))\n4.1 Specimen Certificate representing shares of Common Stock, par value $0.01 per share (Incorporated by reference to exhibit 4.1 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n4.2 Rights Agreement dated December 20, 2006 between Limoneira Company and The Bank of New York, as Rights Agent (Incorporated by reference to exhibit 4.2 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n4.3 Certificate of Designation, Preferences and Rights of Series A Junior Participating Preferred Stock, $.01 Par Value, of Limoneira Company, dated November 21, 2006 (Incorporated by reference to exhibit 3.8 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n4.4 Certificate of Designation, Preferences and Rights of $8.75 Voting Preferred Stock, $100.00 Par Value, Series B of Limoneira Company, dated May 21, 1997 (Incorporated by reference to exhibit 3.4 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n4.5 Amended Certificate of Designation, Preferences and Rights of $8.75 Voting Preferred Stock, $100.00 Par Value, Series B of Limoneira Company, dated May 21, 1997 (Incorporated by reference to exhibit 3.5 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\nExhibit\nNo. Description\n4.6 Certificate of Designation, Preferences and Rights of 4% Voting Preferred Stock, $100.00 Par Value, Series B-2 of Limoneira Company, dated March 20, 2014 (Incorporated by reference to exhibit 3.1 to the Companys Current Report on Form 8-K, filed March 24, 2014 (File No. 001-34755))\n4.7* Description of Securities\n10.1 Real Estate Advisory Management Consultant Agreement dated April 1, 2004, by and between Limoneira Company and Parkstone Companies (Incorporated by reference to exhibit 10.1 of the Companys Current Report on Form 8-K, filed August 25, 2010 (File No. 001-34755))\n10.2 Amendment No. 1 to Real Estate Advisory Management Consultant Agreement dated August 24, 2010, by and between Limoneira Company and Parkstone Companies (Incorporated by reference to exhibit 10.2 of the Companys Current Report on Form 8-K, filed August 25, 2010 (File No. 001-34755))\n10.3 Lease Agreement dated February 15, 2005, between Limoneira Company and Calavo Growers, Inc. (Incorporated by reference to exhibit 10.6 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n10.4 Revolving Equity Line of Credit Promissory Note and Loan Agreement, dated October 28, 1997, between Limoneira Company and Farm Credit West, FLCA (as successor by merger to Central Coast Federal Land Bank Association) (Incorporated by reference to exhibit 10.9 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n10.5 Promissory Note and Loan Agreement, dated April 23, 2007, between Farm Credit West, FLCA and Limoneira Company (Incorporated by reference to exhibit 10.10 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n10.6 Promissory Note and Loan Agreement, dated September 23, 2005, among Farm Credit West, FLCA and Windfall Investors, LLC (Incorporated by reference to exhibit 10.12 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n10.7 Master Loan Agreement, dated May 1, 2012, between Limoneira Company and Farm Credit West, PCA (Incorporated by reference to exhibit 10.2 to the Companys Current Report on Form 8-K, filed May 2, 2012 (File No. 001-34755))\n10.8 Promissory Note and Supplement to Master Loan Agreement, dated May 1, 2012, between Limoneira Company and Farm Credit West, PCA (Incorporated by reference to exhibit 10.1 to the Companys Current Report on Form 8-K filed, May 2, 2012 (File No. 001-34755))\n10.9 Pre-Annexation and Development Agreement, dated March 3, 2008, by and between the City of Santa Paula and Limoneira Company (Incorporated by reference to exhibit 10.20 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n10.10 Judgment, dated March 7, 1996, United Water Conservation Dist. v. City of San Buenaventura, et al., Case No. 115611, Superior Court of the State of California, Ventura County (Incorporated by reference to exhibit 10.24 to the Companys Registration Statement on Form 10, and amendments thereto, declared effective April 13, 2010 (File No. 000-53885))\n10.11 Option Agreement, dated February 27, 2013, by and among the Company, Jason B. Rushing as Trustee of the Jason B. Rushing Trust, Jennifer R. Rushing as trustee for the Jennifer R. Rushing Revocable trust, Zella A. Rushing as trustee of the 1988 Zella Rushing Trust (Incorporated by reference to exhibit 10.1 of the Companys Quarterly Report on Form 10-Q, filed June 10, 2013 (File No. 001-34755))\nExhibit\nNo. Description\n10.12 Purchase and Sale Agreement and Escrow Instructions, dated April 8, 2013, by and among HM East Ridge LLC, Limoneira Company and IPDC construction, Inc., (Incorporated by reference to exhibit 10.1 to the Current Report on Form 8-K, filed April 12, 2013 (File No. 001-34755))\n10.13 Lease Agreement, dated July 1, 2013, by and between the Company and Cadiz, Inc. (Incorporated by reference to exhibit 10.1 to the Current Report on Form 8-K, filed July 2, 2013 (File No. 001-34755))\n10.14 Cadiz-Limoneira Amended and Restated Lease, dated February 3, 2015, by and between Cadiz Real Estate LLC and Limoneira Company (Incorporated by reference to exhibit 10.1 of the Companys Quarterly Report on Form 10-Q, filed March 9, 2015 (File No. 001-34755)).\n10.15 Agreement and Plan of Merger, dated September 6, 2013, by and among Limoneira Company, ACP Merger Sub, Inc., Associated Citrus Packers, Inc., and Mark Spencer, as the Shareholder Representative defined therein (Incorporated by reference to exhibit 10.1 to the Current Report on form 8-K, filed September 12, 2013 (File No. 001-34755))\n10.16 Purchase and Sale Agreement and Joint Escrow Instructions, dated September 27, 2013, by and between Sun World International, LLC and Limoneira Company (Incorporated by reference to exhibit 10.1 to the Current Report on Form 8-K, filed October 15, 2013 (File No. 001-34755))\n10.17 Construction Contract and Agreement, dated October 1, 2013, by and between Limoneira Company and NEXGEN Builders, Inc. (Incorporated by reference to exhibit 10.1 to the Current Report on Form 8-K, filed December 4, 2013 (File No. 001-34755))\n10.18 General Conditions of the Contract and Agreement, dated October 1, 2013, by and between Limoneira company and NEXGEN Builders, Inc. (Incorporated by reference to exhibit 10.2 to the Current Report on Form 8-K, filed December 4, 2013 (File No. 001-34755))\n10.19 Purchase and Sale Agreement and Escrow Instructions, dated November 29, 2013, by and between Templeton Santa Barbara, LLC and MI Land, LLC related to the sale of the Sevilla Property (Incorporated by reference to exhibit 10.3 to the Current Report on Form 8-K, filed December 4, 2013 (File No. 001-34755))\n10.20 Series B-2 Preferred Stock Purchase Agreement, dated March 21, 2014, by and between Limoneira Company and WPI-ACP Holdings, LLC (Incorporated by reference to exhibit 10.1 to the Current Report on Form 8-K, filed March 24, 2014 (File No. 001-34755))\n10.21 Contribution Agreement, dated September 4, 2015, by and among Limoneira Company and Lewis Santa Paula Member, LLC (Incorporated by reference to exhibit 10.1 to the Companys Current Report on Form 8-K, filed September 10, 2015 (File No. 001-34755))\n10.22 First Amended and Restated Limited Liability Company Agreement of Limoneira Lewis Community Builders, LLC, dated November 10, 2015, by and among Limoneira EA1 Land LLC and Lewis Santa Paula Member, LLC (Incorporated by reference to exhibit 10.1 to the Companys Current Report on Form 8-K, filed November 16, 2015 (File No. 001-34755))\n10.23 Interim Funding Agreement, dated December 1, 2015, between Limoneira and Wells Fargo Equipment Finance, Inc. (Incorporated by reference to exhibit 10.1 to the Companys Current Report on Form 8-K, filed December 22, 2015 (File No. 001-34755))\n10.24 Master Loan and Security Agreement, dated December 1, 2015, between Limoneira Company and Wells Fargo Equipment Finance, Inc. (Incorporated by reference to exhibit 10.1 to the Companys Quarterly Report on Form 10-Q, filed March 10, 2016 (File No. 001- 34755))\nExhibit\nNo. Description\n10.25 Loan Schedule to Master Loan and Security Agreement, dated January 20, 2016, between Limoneira Company and Wells Fargo Equipment Finance, Inc. (Incorporated by reference to exhibit 10.2 to the Companys Quarterly Report on Form 10-Q, filed March 10, 2016 (File No. 001-34755))\n10.26 Promissory Note and Loan Agreement, dated February 11, 2016, between Limoneira Company and Farm Credit West, FLCA (Incorporated by reference to exhibit 10.1 to the Companys Current Report on Form 8-K, filed February 18, 2016 (File No. 001-34755))\n10.27 Retained Property Development Agreement, dated November 10, 2015, by and among Limoneira Company and Limoneira Lewis Community Builders, LLC (Incorporated by reference to exhibit 10.3 to the Companys Current Report on Form 8-K, filed November 16, 2015 (File No. 001-34755)\n10.28 Master Loan Agreement, dated June 19, 2017, between Limoneira Company and Farm Credit West, FLCA (Incorporated by reference to exhibit 10.1 to the Companys Current Report on Form 8-K, filed June 21, 2017 (File No. 001-34755))\n10.29 Revolving Credit Facility Promissory Note and Supplement to Master Loan Agreement, dated June 19, 2017, between Limoneira Company and Farm Credit West FLCA (Incorporated by reference to exhibit 10.2 to the Companys Current Report on Form 8-K, filed June 21, 2017 (File No. 001-34755))\n10.30 Non-revolving Credit Facility Promissory Note and Supplement to Master Loan Agreement, dated June 19, 2017, between Limoneira Company and Farm Credit West FLCA (Incorporated by reference to exhibit 10.3 to the Companys Current Report on Form 8-K, filed June 21, 2017 (File No. 001-24755))\n10.31 Revolving Credit Facility Supplement, dated January 29, 2018, between Limoneira Company and Farm Credit West, PCA (Incorporated by reference to exhibit 10.1 to the Companys Current Report on Form 8-K, filed February 1, 2018 (File No. 001-34755))\n10.32 Line of Credit Loan Agreement, dated February 22, 2018, by and between Limoneira Lewis Community Builders, LLC and Bank of America, N.A. (Incorporated by reference to exhibit 10.1 to the Companys Current Report on Form 8-K, filed March 2, 2018 (File No. 001-34755))\n10.33 Unsecured Line of Credit Promissory Note, dated February 22, 2018, by and between Limoneira Lewis Community Builders, LLC and Bank of America, N.A. (Incorporated by reference to exhibit 10.2 to the Companys Current Report on Form 8-K, filed March 2, 2018 (File No. 001-34755))\n10.34 Guaranty Agreement, dated February 22, 2018, by and among Richard A. Lewis, individually and as Trustee of the Richard A. Lewis Revocable Trust u/d/t dated August 16, 2004 , Robert E. Lewis, individually and as Trustee of the Robert E. Lewis Revocable Trust u/d/t dated August 17, 2004, Roger G. Lewis, individually and as Trustee of the Roger G. Lewis Revocable Trust u/d/t dated August 20, 2004, Randall W. Lewis, individually and as Trustee of the Randall W. Lewis Revocable Trust u/d/t dated September 1, 2006, and Limoneira Company (Incorporated by reference to exhibit 10.3 to the Companys Current Report on Form 8-K, filed March 2, 2018 (File No. 001-34755))\n10.35 Form of Restricted Share Award Agreement under the Limoneira Company 2010 Amended and Restated Omnibus Incentive Plan (Incorporated by reference to exhibit 10.1 to the Companys Current Report on Form 8-K, filed April 11, 2018 (File No. 001-34755))\n10.36 Master Loan Agreement, dated June 1, 2021, between Limoneira Company and Farm Credit West, PCA (Incorporated by reference to exhibit 10.1 of the Companys Current Report on Form 8-K, filed June 17, 2021 (File No. 001-34755))\n10.37 Promissory Note and Revolving Credit Facility Supplement to Master Loan Agreement, dated June 1, 2021, between Limoneira Company and Farm Credit West, PCA (Incorporated by reference to exhibit 10.2 of the Companys Current Report on Form 8-K, filed June 17, 2021 (File No. 001-34755))\nExhibit\nNo. Description\n10.38 Promissory Note and Non-Revolving Credit Facility Supplement to Master Loan Agreement, dated June 1, 2021, between Limoneira Company and Farm Credit West, PCA (Incorporated by reference to exhibit 10.3 of the Companys Current Report on Form 8-K, filed June 17, 2021 (File No. 001-34755))\n10.39 Agreement to Convert to Fixed Interest Rate, dated June 8, 2021, between Limoneira Company and Farm Credit West, PCA (Incorporated by reference to exhibit 10.4 of the Companys Current Report on Form 8-K, filed June 17, 2021 (File No. 001-34755))\n10.40 Separation Agreement, dated January 10, 2022, by and between Limoneira Company and Alex M. Teague (Incorporated by reference to exhibit 10.1 to the Company's Current Report on Form 8-K, filed January 14, 2022 (File No. 001-34755))\n10.41 Consulting Agreement, dated January 12, 2022, by and between Limoneira Company and AMT Ag Consulting, LLC (Incorporated by reference to exhibit 10.2 to the Company's Current Report on Form 8-K, filed January 14, 2022 (File No. 001-34755))\n10.42 Limoneira Company 2022 Omnibus Incentive Plan, as approved by the Stockholders on March 22, 2022 (Incorporated by reference to exhibit 10.2 of the Companys Current Report on Form 8-K, filed August 1, 2022 (File No. 001-34755))\n10.43 Form of Time-Based Restricted Share Award Agreement for Non-Employee Directors, Pursuant to the Limoneira Company 2022 Omnibus Incentive Plan (Incorporated by reference to exhibit 10.3 of the Companys Current Report on Form 8-K, filed August 1, 2022 (File No. 001-34755))\n10.44 Form of Performance-Based Restricted Share Award Agreement, Pursuant to the Limoneira Company 2022 Omnibus Incentive Plan (Incorporated by reference to exhibit 10.4 of the Companys Current Report on Form 8-K, filed August 1, 2022 (File No. 001-34755))\n10.45 Form of Time-Based Restricted Share Award Agreement for Employees, Pursuant to the Limoneira Company 2022 Omnibus Incentive Plan (Incorporated by reference to exhibit 10.5 of the Companys Current Report on Form 8-K, filed August 1, 2022 (File No. 001-34755))\n10.46 Purchase and Sale Agreement, dated as of September 7, 2022, by and between Limoneira Company and Limoneira Lewis Community Builders, LLC (Incorporated by reference to exhibit 10.1 of the Companys Current Report on Form 8-K, filed September 8, 2022 (File No. 001-34755))\n10.47 Purchase and Sale Agreement and Joint Escrow Instructions, dated as of September 12, 2022, by and between Limoneira Company and Ventura County Railway Company, LLC (Incorporated by reference to exhibit 10.1 of the Companys Current Report on Form 8-K, filed September 15, 2022 (File No. 001-34755))\n10.48 Retention Bonus Agreement, dated October 26, 2022, between Limoneira Company and Harold Edwards (Incorporated by reference to exhibit 10.1 of the Companys Current Report on Form 8-K, filed October 27, 2022 (File No. 001-34755))\n10.49 Retention Bonus Agreement, dated October 26, 2022, between Limoneira Company and Mark Palamountain (Incorporated by reference to exhibit 10.2 of the Companys Current Report on Form 8-K, filed October 27, 2022 (File No. 001-34755))\n10.50 Standard Industrial/Commercial Single Tenant Lease, dated October 26, 2022 (Incorporated by reference to exhibit 10.1 of the Companys Current Report on Form 8-K, filed October 31, 2022 (File No. 001-34755))\n10.51 First Amendment to the First Amended and Restated Limited Liability Company Agreement of Limoneira Lewis Community Builders, LLC, dated October 25, 2022 (Incorporated by reference to exhibit 10.1 of the Companys Current Report on Form 8-K/A, filed October 31, 2022 (File No. 001-34755))\nExhibit\nNo. Description\n10.52 Limited Liability Company Agreement of LLCB II, LLC, dated October 25, 2022 (Incorporated by reference to exhibit 10.2 of the Companys Current Report on Form 8-K, filed on October 26, 2022 (File No. 001-34755))\n10.53 Closing Agreement, dated October 25, 2022, between the Company, Limoneira Lewis Community Builders, LLC and Limoneira Lewis Community Builders II, LLC (Incorporated by reference to exhibit 10.4 of the Companys Current Report on Form 8-K/A, filed on October 31, 2022 (File No. 001-34755))\n21.1* Subsidiaries of Limoneira Company\n23.1* Consent of Independent Registered Public Accounting Firm - Deloitte & Touche LLP\n23.2* Consent of Independent Registered Public Accounting Firm - Ernst & Young LLP\n31.1* Certification of the Principal Executive Officer pursuant to Exchange Act Rule 13a-14(a) and 15d-14(a)\n31.2* Certification of the Principal Financial and Accounting Officer pursuant to Exchange Act Rule 13a-14(a) and 15d-14(a)\n32.1* Certification of the Principal Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2* Certification of the Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n99.1* Limoneira Lewis Community Builders, LLC - Financial Statements as of October 31, 2022 and 2021\n101.INS* XBRL Instance Document\n101.SCH* XBRL Taxonomy Extension Schema Document\n101.CAL* XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF* XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB* XBRL Taxonomy Extension Label Linkbase Document\n101.PRE* XBRL Taxonomy Extension Presentation Linkbase Document\n104 Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101)\n* Filed or furnished herewith. In accordance with Item 601(b)(32)(ii) of Regulation S-K and SEC Release Nos. 33-8238 and 34-47986, Final Rule: Management's Report on Internal Control Over Financial Reporting and Certification of Disclosure in Exchange Act Periodic Reports, the certifications furnished in Exhibits 32.1 and 32.2 hereto are deemed to accompany this Annual Report on Form 10-K and will not be deemed filed for purposes of Section 18 of the Exchange Act. Such certifications will not be deemed to be incorporated by reference into any filing under the Securities Act or the Exchange Act, except to the extent that the registrant specifically incorporates it by reference.\nDenotes management contracts and compensatory plans or arrangements."
}