{
    "cik": "1342792",
    "company": "WORLDWIDE STRATEGIES INC",
    "filing_type": "10-K",
    "filing_date": "2022-10-31",
    "period_of_report": "2022-07-31",
    "sic": "7372",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1342792/0001683168-22-007155-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1342792/000168316822007155/wwsg_10k-073122.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1342792/0001683168-22-007155.txt",
    "filename": "1342792_10K_2022_0001683168-22-007155.htm",
    "content": "Item 1. Business.\nWorldwide Strategies Inc. is a digital health and fitness technology company that provides fitness experiences and solutions through a mobile application available on Apple iOS and Google Android devices. Our data-driven wellness platform allows people to set and track fitness and nutrition goals, integrates with wearable fitness devices and offers community features, enabling users to compete and support each other as they work towards achieving their personal fitness and wellness goals. We plan to develop our platform into a single destination for fitness and wellbeing, offering content and products to our users based on their specific needs on their personal health and wellness journey.\nRecent Developments\nOn October 22, 2022, we successfully terminated a license agreement for certain intellectual property we had previously licensed and had not been able to commercialize. In connection with the termination of the license we were able to cancel 90,000 shares of our issued and outstanding Series B Preferred Stock and 1.2 million issued and outstanding shares of Series A Preferred stock; subsequent to the termination of the license agreement.\nWe successfully negotiated an amendment to our asset purchase agreement with Fitwell Limited, to remove the financing contingency and accelerate the closing of the purchase of the Fitwell assets. As of October 18, 2022, we successfully completed the purchase of the Fitwell assets, which includes a copy of the source code and data sets for a comprehensive health and fitness platform. In connection with the purchase of the Fitwell assets, we issued a promissory note for $0.5 million and issued 2 million shares of common stock as consideration for the purchase, and an additional 2.8 million shares for services rendered, and to be rendered in the future, for the benefit of the Company.\nThe net effect of canceling the license agreement and closing on the Fitwell asset purchase, was reverse dilution to the Company and its shareholders by 96 million shares of common stock and we believe the shift in strategy will allow for us to start generating revenue in the near term.\nThe Fitwell Software\nWe acquired a mobile fitness and wellness software platform which includes mobile apps native to the iOS and Android operating systems. The software enables video-based fitness curriculums, which provide beginner, intermediate and advanced cardiovascular and strength training programs, in easy to follow short-format instructional videos. We plan to enhance and improve the software, by i) adding fitness content, generated internally by fitness professionals which we plan to hire and through collaborations with fitness influencers, who we plan to work with to generate content and drive users to our platform, ii) segmenting users using artificial intelligence which will allow us to provide wellness content by user-group and demographic, iii) offering embedded e-commerce offerings of wellness products and services, iv) and eventually offer our mobile app users to book appointments at our planned brick and mortar locations, see Clinics; Preventative Care and Longevity, below.\nCurrently, content on our mobile app is available on a freemium model, with a small library of content offered for free, and unlimited access offered on a subscription basis. The platform also includes a comprehensive food library with meal and calorie tracking, a pedometer to track steps taken each day, artificial intelligence based coaching functionality, community-based features to provide peer based encouragement, and leaderboards to measure your progress against other users. The platform integrates with wearable fitness devices, such as the Apple Watch and aggregates and tracks collected health and fitness data. The app facilitates communication through push notifications as well as content and information features integrated seamlessly within the UX (user experience).\nIn addition to the feature rich experience, the platform provides for robust data capture and tracking which allows us to provide a highly customized user experience which is intended to maximize users fitness and wellness outcomes. We plan to leverage the source code and build on top of the existing platform a B2B wellness platform and market the platform to enterprise clients, data-mine the dataset for marketing opportunities, identify trends for new product launches and develop a DTC offering based on free content and micro-transactions.\nBusiness to Business (B2B) Enterprise Level Wellness Solution\nWe believe that there is a need and demand within medium to large enterprise to offer to employees a comprehensive, real-time fitness and nutrition platform, that with employees opt-in can track an employees daily dietary consumption, through integrated food tracking in the app, activity tracking through integrated pedometers and apple health integration, through which we can track and monitor various biomedical data points. Based on individual inputs our algorithm can/will suggest an employee take a break, stretch, take a short walk, eat lunch, and or change tasks. Moreover, we can incentivize certain behaviors by issuing food vouchers/coupons through the app, recommending and pushing stretching or exercise routines through the app, and or calming and or meditative routines.\nWe believe that an employers adoption of a program that improves the lives, physical and mental health of their employees is a meaningful step in employee retention, boosting productivity, morale and meets an enterprises social governance objectives.\nWe would be able to provide employers with macro and micro data points, macro points would speak to the general well-being of their work force and segmented by operating divisions, we can track health, stress and the physical and cardiovascular well-being of employees. Through the platform we can identify best performers and laggards who are in need of additional support. We believe that a healthy work force will be more motivated, more productive and have less turnover, which are measurable metrics for companies and offer significant value.\nBusiness to Consumer (B2C) and Direct to Consumer (DTC)\nPart of our mobile app acquisition, includes a video based, in-gym workout program, with users being able to choose their workouts. Users may choose workouts based on intensity, muscle group and or trainer. Most fitness apps are subscription based, we plan to differentiate our offering by adding alternative methods for users to purchase content, beyond the basic freemium model. The trend in fitness applications is a subscription-based model, which we intend to offer, however we plan to offer micro transactions an additional option for users to consume content. Users will be able to pay a small charge to view a workout once in a 12-hour period, and or will be able to add the workout to their permanent in-app library for a slightly higher cost. We believe these micro-transactions are preferable for consumers who prefer to pay based on use, rather than on a hard-to-cancel monthly or annual subscription. We also plan to offer a library of free fitness content to onboard and engage users. The software collects user inputted data and data the user chooses to share with us. We intend to use this data to make personalized suggestions to improve a users health, fitness and well-being.\nClinics; Preventative Care and Longevity\nWe plan to offer a premium in-person clinic based experience, sold on a subscription basis, that would provide customers with access to cutting edge wellness and longevity treatments including but not limited to hyper and hypo -baric chambers, cryotherapy treatments, infrared sauna, as well as real-time bio data tracking, a dedicated medical team assigned to clients who offer personalized recommendations based on a clients individual needs, based on their DNA, blood-based biomarkers, gut-biome, with adjustments being recommended as appropriate. We also plan to offer in-house and or facilitate for our clinic clients, regular preventative imagery and diagnostic scans, with the goal being to identify any medical complications early, where medical intervention has the highest likelihood of success.\nOur services as it relates to medical imaging are preventative only, we do not offer any medical treatments. Users will be encouraged to consult with their primary care practitioners subsequent to any imaging performed. We believe that there is a segment of individuals who demand both longevity and wellness offerings with a view to maintaining good health using cutting edge tools as well as a subset of the population who want to be proactive in their personal care through regular screenings, including comprehensive blood panels and imagery. Subscription packages will provide unlimited access to services with the exception of biologics.\nCorporate History\nWorldwide Strategies Incorporated (\"we\", \"us\", or \"our\") was originally incorporated in the State of Nevada on April 6, 1998 as Boyd Energy Corporation, on July 17, 2001 the corporations name was changed to Barnett Energy Corporation and on June 15, 2005, pursuant to a business combination with Worldwide Business Solutions Incorporated, a Colorado corporation (\"WBSI\"), WBSI became a wholly-owned subsidiary of the company and the corporations name was changed to Worldwide Strategies Inc.\nOn May 7, 2019, the Eighth Judicial District Court of Nevada appointed Small Cap Compliance, LLC (Custodian) as custodian for Worldwide Strategies Inc., and on May 8, 2019, the Custodian appointed an executive officer and board member, who on July 10, 2019, filed a certificate of reinstatement of WWSG with the state of Nevada. On October 16, 2019, the Eighth Judicial District Court of Nevada discharged Small Cap Compliance, LLC as custodian for Worldwide Strategies Inc. On July 10, 2019 the Custodian appointed board member and sole executive officer, appointed a new member to the board of directors and subsequently resigned from the board and as the companys sole executive officer. The board of directors subsequently appointed the current management team, who are reorganizing the business as a health technology company.\nEmployees\nThe Company has 2 employees, our CEO and CFO, each of whom are part-time employees and each of whom are our founders as of July 31, 2022.\nLegal Proceedings\nFrom time to time, we may be involved in various claims and legal actions arising in the ordinary course of business. There are no legal proceedings currently pending against us which we believe would have a material effect on our business, financial position or results of operations and, to the best of our knowledge, there are no such legal proceedings contemplated or threatened. Item 1A. Risk Factors.\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide this information. Item 1B. Unresolved Staff Comments.\nNot applicable. Item 2. Properties.\nOur principal business address is 1961 NW 150 Avenue, Suite 205 Pembroke Pines, FL 33028. The office space we are currently occupying is currently being provided to us at no cost to the company by our CFO. We expect this arrangement to continue until our operations require expansion. We currently do not own or lease any other property. Item 3. Legal Proceedings.\nThere are no legal proceedings which are pending or have been threatened against us or any of our officers, directors or control persons of which management is aware. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for the Registrants Common Equity and Related Stockholder Matters.\nTrading Price History\nThe Companys common stock is quoted on the OTC Pink tier of the OTC Markets Group, Inc. under the ticker symbol WWSG. Such quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nOn October 21, 2022, the closing price of our common units on the OTC Pink was $0.03 per share.\nShareholders of Record\nAs of October 21, 2022, we had 26,580,678 shares of common stock outstanding and there were approximately 126 holders of record of our common stock, not including holders who hold their units in street name.\nDividends\nThe Company did not declare or pay any cash dividends on its common stock for the years ended July 31, 2022 or 2021. The Company currently intends to retain future earnings to finance the growth and development of its business however, the directors will also consider alternative for distributing some or all of its cash and cash equivalents to stockholders.\nIssuer Purchases of Equity Securities\nWe did not, nor did any affiliated purchaser, make any repurchases of our securities during the year ended July 31, 2022. Item 6. Reserved Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nManagements Plan of Operation\nThe following discussion contains forward-looking statements. Forward-looking statements give our current expectations or forecasts of future events. You can identify these statements by the fact that they do not relate strictly to historical or current facts. They use of words such as anticipate, estimate, expect, project, intend, plan, believe, and other words and terms of similar meaning in connection with any discussion of future operating or financial performance. From time to time, we also may provide forward-looking statements in other materials we release to the public.\nOverview\nWorldwide Strategies Inc. is a digital health and fitness technology company that provides fitness experiences and solutions through a mobile application available on Apple iOS and Google Android devices. Our data-driven wellness platform allows people to set and track fitness and nutrition goals, integrates with wearable fitness devices and offers community features, enabling users to compete and support each other as they work towards achieving their personal fitness and wellness goals. We plan to develop our platform into a single destination for fitness and wellbeing, offering content and products to our users based on their specific needs on their personal health and wellness journey.\nRecent Developments\nOn October 22, 2022, we successfully terminated a license agreement for certain intellectual property we had previously licensed and had not been able to commercialize. In connection with the termination of the license we were able to cancel 90,000 shares of our issued and outstanding Series B Preferred Stock and 1.2 million issued and outstanding shares of Series A Preferred stock; subsequent to the termination of the license agreement.\nWe successfully negotiated an amendment to our asset purchase agreement with Fitwell Limited, to remove the financing contingency and accelerate the closing of the purchase of the Fitwell assets. As of October 18, 2022, we successfully completed the purchase of the Fitwell assets, which includes a copy of the source code and data sets for a comprehensive health and fitness platform. In connection with the purchase of the Fitwell assets, we issued a promissory note for $0.5 million and issued 2 million shares of common stock as consideration for the purchase, and an additional 2.8 million shares for services rendered, and to be rendered in the future, for the benefit of the Company.\nSignificant Recent Developments Regarding COVID-19\nDuring March 2020, a global pandemic was declared by the World Health Organization related to the rapidly spreading outbreak of a novel strain of coronavirus designated COVID-19. The pandemic has significantly impacted economic conditions in the United States. The long-term impact of COVID-19 on the economy and on our business remains uncertain, the duration and scope of which cannot currently be predicted. Please refer to the matters discussed under the caption Risk Factors.\nResults of Operations During the Year Ended July 31, 2022 As Compared to The Year Ended July 31, 2021\nNet Loss\nFor the years ended July 31, 2022 and 2021 we incurred net losses of approximately $79,000 and $1.4 million respectively.\nRevenue\nFor the years ended July 31, 2022 and 2021, we generated no revenue.\nExpenses\nFor the years ended July 31, 2022 and 2021, we incurred expenses of approximately $79,000 and $1.4 million respectively. The decrease of $1.3 million in expenses for the year ended July 31, 2022 was primarily related to stock compensation expense of approximately $1.3 million for the year ended July 31, 2021. For the years ended July 31, 2022 and 2021 we incurred interest expense of approximately $50,000 and $48,000 primarily in relation to the promissory notes outstanding.\nLiquidity\nCurrently, we rely on our management to provide us with the capital needed to run our business on a day-to-day basis.\nFor the years ended July 31, 2022 and 2021 we incurred net losses of approximately $79,000 and $1.4 million respectively. As of July 31, 2022 and 2021, we had no cash on hand and current liabilities of $1.0 million and $0.9 million. During the year ended July 31, 2022 our CEO and CFO provided loans to us in the amount of approximately $30,000.\nWe will seek additional funds through equity or debt financing, collaborative or other arrangements with corporate partners, licensees or others, and from other sources, which may have the effect of diluting the holdings of existing shareholders.\nThe Company has no current arrangements with respect to, or sources of, such additional financing and we do not anticipate that existing shareholders will provide any portion of our future financing requirements.\nNo assurance can be given that additional financing will be available when needed or that such financing will be available on terms acceptable to the Company. If adequate funds are not available, we may be required to delay or terminate expenditures for certain of its programs that it would otherwise seek to develop and commercialize. This would have a material adverse effect on the Company.\nGoing Concern\nThe report of our independent registered public accounting firm on the financial statements for the years ended July 31, 2022 and 2021, includes an explanatory paragraph relating to the uncertainty of our ability to continue as a going concern. We have incurred recurring losses, incurred liabilities in excess of assets over the past year, and have an accumulated deficit of $15.5 million. Based upon current operating levels, we will be required to obtain additional capital in order to sustain our operations through July 31, 2023.\nCritical Accounting Policies and Use of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates.\nFair Value of Financial Instruments\nOn August 1, 2012, the Company adopted ASC 820, Fair Value Measurements and Disclosures. ASC 820 defines fair value, establishes a three-level valuation hierarchy for disclosures of fair value measurement and enhances disclosure requirements for fair value measures. The three levels are defined as follows:\n· Level 1 inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets.\n· Level 2 inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\n· Level 3 inputs to valuation methodology are unobservable and significant to the fair measurement.\nOff-Balance Sheet Arrangements\nAs of July 31, 2022 and 2021, we did not have any off-balance sheet arrangements as defined in Item 303(a)(4)(ii) of Regulation S-K promulgated under the Securities Act of 1934.\nContractual Obligations and Commitments\nAs of July 31, 2022 and 2021, we did not have any contractual obligations. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide this information. Item 8. Financial Statements and Supplementary Data.\nIndex to the Financial Statements\nPage\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\nReport of Independent Registered Public Accounting Firm (PCAOB ID 2738)\nBalance Sheets\nStatements of Operations\nStatements of Changes in Stockholders Equity\nStatements of Cash Flows\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Worldwide Strategies, Inc.,\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Worldwide Strategies, Inc.., (the Company) as of July 31, 2022 and 2021, and the related statements of operations, changes in stockholders deficit, and cash flows for each of the years in the two-year period ended July 31, 2022, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and 2021, and the results of its operations and its cash flows for each of the years ended July 31, 2022 in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered net losses from operations in current and prior periods and has an accumulated deficiency, which raises substantial doubt about its ability to continue as a going concern. Managements plans regarding those matters are discussed in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB .\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and the significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinion on the critical audit matter or on the accounts or disclosures to which they relate.\nAs discussed in Note 3, to the financial statements, the Company has a going concern due to the lack of revenue and accumulated net losses from operations.\nAuditing managements evaluation of going concern involves significant judgement given the fact that the Company uses managements estimates of future revenues and expenses, which are not to be substantiated.\nTo evaluate the appropriateness of the significant doubt about the Companys ability to continue as a going concern, we examined and evaluated the financial information that was the initial cause of the doubt along with managements plans to mitigate the significant doubt about continuing as a going concern.\n/s/ M&K CPAS PLLC\nWe have served as the Companys auditor since 2021.\nHouston, TX\nOctober 31, 2022\nWorldwide Strategies, Inc.\nBalance Sheets\nJuly 31, 2022 and 2021\nJuly 31, 2022 July 31, 2021\nAssets\nCurrent Assets:\nCash $ - $ -\nTotal assets $ - $ -\nLiabilities and Stockholders' Deficit\nCurrent Liabilities:\nAccounts payable $ 43,703 $ 42,967\nAccrued liabilities 423,100 375,504\nConvertible notes payable, in default 452,406 452,406\nConvertible notes payable, related party - in default 40,000 40,000\nTotal current liabilities 959,209 910,877\nLong term notes payable - related party\n45,065 14,577\nTotal Liabilities 1,004,274 925,454\nStockholders' deficit:\nPreferred Stock; $.001 par value; 25,000,000 shares authorized\nSeries A, 5,000,000 and 1,491,743 shares issued and outstanding 5,000 5,000\nSeries B, 270,000 shares issued and outstanding\nCommon stock, $.001 par value, 975,000,000 shares authorized 19,830,679 shares issued and outstanding, respectively 19,831 19,831\nAdditional paid-in capital 14,497,273 14,497,273\nAccumulated deficit (15,526,648 ) (15,447,828 )\nTotal Stockholders' Deficit (1,004,274 ) (925,454 )\nTotal Liabilities and Stockholders' Deficit $ - $ -\nWorldwide Strategies, Inc.\nStatement of Operations\nFor the years ended July 31, 2022 and 2021\nFor The Year Ended July 31,\nOperating expenses:\nOther general and administrative expenses $ 29,134 $ 1,329,955\nTotal operating expenses 29,134 1,329,955\nLoss from operations (29,134 ) (1,329,955 )\nOther expense:\nInterest expense (49,686 ) (47,818 )\nLoss before income taxes (78,820 ) (1,377,773 )\nIncome tax provision - -\nNet loss $ (78,820 ) $ (1,377,773 )\nBasic and diluted loss per share $ (0.00 ) $ (0.07 )\nBasic and diluted weighted average common shares outstanding 19,830,679 19,830,679\nWorldwide Strategies, Inc.\nStatement of Changes in Stockholders Deficit\nFor the years ended July 31, 2022 and 2021\nPreferred Stock Common Stock\nSeries A Series B\nShares Par Value Shares Par Value Shares Par Value Additional Paid-In Capital Accumulated Deficit Total\nBalance July 31, 2020 1,491,743 $ 1,492 270,000 $ 270 19,830,679 $ 19,831 $ 13,185,185 $ (14,070,055 ) $ (863,277 )\nNet Loss - - - - - - - (1,377,773 ) (1,377,773 )\nIssuance of Preferred Stock 3,508,257 3,508 - - - - 1,312,088 - 1,315,596\nBalance July 31, 2021 5,000,000 $ 5,000 270,000 $ 270 19,830,679 $ 19,831 $ 14,497,273 $ (15,447,828 ) $ (925,454 )\nBalance July 31, 2021 5,000,000 $ 5,000 270,000 $ 270 19,830,679 $ 19,831 $ 14,497,273 $ (15,447,828 ) $ (925,454 )\nNet Loss - - - - - - - (78,820 ) (78,820 )\nBalance July 31, 2022 5,000,000 $ 5,000 270,000 $ 270 19,830,679 $ 19,831 $ 14,497,273 $ (15,526,648 ) $ (1,004,274 )\nWorldwide Strategies, Inc.\nStatement of Cash Flows\nFor the years ended July 31, 2022 and 2021\nFor The Year Ended July 31,\nCash flows from operating activities:\nNet loss $ (78,820 ) $ (1,377,773 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nAccounts payable and accrued liabilities 48,332 47,600\nStock Based Compensation - 1,315,596\nNet cash used in operating activities (30,488 ) (14,577 )\nCash flows from financing activities:\nRelated party loans 30,488 14,577\nNet cash provided by financing activities 30,488 14,577\nNet increase in cash - -\nCash, beginning of period - -\nCash, end of period $ - $ -\nSupplemental disclosure of cash flow information:\nCash paid for taxes $ - $ -\nCash paid for interest $ - $ -\nWorldwide Strategies, Inc.\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JULY 31, 2022 and 2021\n(Audited)\nNote 1 - Organization and Basis of Presentation\nOrganization and Basis of Presentation\nWorldwide Strategies Incorporated (WWSG or the Company) was incorporated under the laws of the State of Nevada on April 6, 1998 and ceased operations in 2015. The Company fully impaired all assets since the shutdown of its operations in 2015. On May 7, 2019, the eight judicial District Court of Nevada appointed Small Cap Compliance, LLC (Custodian) as custodian for Worldwide Strategies Incorporated., proper notice having been given to the officers and directors of Worldwide Strategies Incorporated with no opposition. On July 10, 2019, the Company filed a Certificate of Reinstatement with the state of Nevada.\nThe accompanying financial statements are prepared on the basis of accounting principles generally accepted in the United States of America (GAAP) and have been prepared assuming the continuation of the Company as a going concern. The Company has not yet established an ongoing source of revenues sufficient to cover its operating costs and is dependent on debt and equity financing to fund its operations. Management of the Company is making efforts to raise additional funding until a registration statement relating to an equity funding facility is in effect. While management of the Company believes that it will be successful in its capital formation and planned operating activities, there can be no assurance that the Company will be able to raise additional equity capital or be successful in the development and commercialization of the products it develops or initiates collaboration agreements thereon. The accompanying financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result from the possible inability of the Company to continue as a going concern.\nNote 2 - Summary of significant accounting policies\nCash and Cash Equivalents\nThe Company doesnt maintain any bank accounts and does not have any cash in hand. For day-to-day business activities, the Company depends upon the directors personal accounts. For purposes of reporting within the statements of cash flows, the Company considers all cash on hand, cash accounts not subject to withdrawal restrictions or penalties, and all highly liquid debt instruments purchased with a maturity of three months or less to be cash and cash equivalents.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates.\nLoss per Common Share\nNet loss per common share is computed by dividing net loss by the weighted average number of common shares outstanding for the period. As a result, diluted loss per common share is the same as basic loss per common share for the years ended July 31, 2022 and 2021. Excluded from the weighted average common shares outstanding amount is convertible preferred stock equivalent to 301,250,000 and 279,323,394 common shares for the years ended July 31, 2022 and 2021, as the effect of these on the computation of net loss per share would have been anti-dilutive.\nIncome Taxes\nThe Company accounts for income taxes pursuant to FASB ASC Topic 740, Income Taxes. Under FASB ASC Topic 740, deferred tax assets and liabilities are determined based on temporary differences between the bases of certain assets and liabilities for income tax and financial reporting purposes. The deferred tax assets and liabilities are classified according to the financial statement classification of the assets and liabilities generating the differences.\nThe Company maintains a valuation allowance with respect to deferred tax assets. The Company establishes a valuation allowance based upon the potential likelihood of realizing the deferred tax asset and taking into consideration the Companys financial position and results of operations for the current period. Future realization of the deferred tax benefit depends on the existence of sufficient taxable income within the carry-forward period under the Federal tax laws.\nChanges in circumstances, such as the Company generating taxable income, could cause a change in judgment about the reliability of the related deferred tax asset. Any change in the valuation allowance will be included in income in the year of the change in estimate.\nFair Value of Financial Instruments\nOn August 1, 2012, the Company adopted ASC 820, Fair Value Measurements and Disclosures. ASC 820 defines fair value, establishes a three-level valuation hierarchy for disclosures of fair value measurement and enhances disclosure requirements for fair value measures. The three levels are defined as follows:\n· Level 1 inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets.\n· Level 2 inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\n· Level 3 inputs to valuation methodology are unobservable and significant to the fair measurement.\nThe following tables represent our assets and liabilities by level measured at fair value on a recurring basis at July 31, 2022 and July 31, 2021:\nSchedule of fair value of assets and liabilities\nFair Value Measurements at July 31, 2022\nLevel 1 Level 2 Level 3\nDescription\nConvertible Debt $ - $ 492,406 $ -\nTotal Liabilities - 492,406 -\nTotals $ - $ 492,406 $ -\nFair Value Measurements at July 31, 2021\nLevel 1 Level 2 Level 3\nDescription\nConvertible Debt $ - $ 492,406 $ -\nTotal Liabilities - 492,406 -\nTotals $ - $ 492,406 $ -\nRecent Accounting Pronouncements\nThe Company reviewed all the recently issued, but not yet effective, accounting pronouncements and we do not believe any of these pronouncements will have a material impact on the Company.\nNote 3 - Going Concern\nFor the years ended July 31, 2022 and 2021 we incurred net losses of approximately $79,000 and $1.4 million respectively. As of July 31, 2022, we had no cash on hand and current liabilities of $1.0 million. As of July 31, 2021, we had no cash on hand and current liabilities of $0.9 million. These losses combined with our current liabilities cast significant doubt on the companys ability to operate under the going concern. The ability to continue as a going concern is dependent upon the Company generating profitable operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management intends to finance operating costs over the next twelve months with loans from directors and/or private placement of common stock. The failure to achieve the necessary levels of profitability or obtaining additional funding would be detrimental to the Company.\nNote 4 - Related party transactions\nThe Companys CFO has provided office space at no cost to the Company. Our CEO and CFO incurred expenses on behalf of the Company amounting to approximately $30,000 and $15,000 during the years ending July 31, 2022 and 2021. As of July 31, 2022 total amounts due to our CEO and CFO are approximately $45,000. These amounts are due on September 30, 2023 and bear interest at 8 eight percent per annum.\nAs of July 31, 2022 and 2021, the Company had a convertible promissory note in the principal outstanding balance of $40,000, payable to a shareholder. Such note bears interest at 9 nine percent per annum with a maturity date of July 31, 2015. The principal and accrued interest is convertible, at the option of the holder, into common shares at $.01 per share.\nAs of July 31, 2022 and 2021, our CEO and CFO owned 2.3 million shares of convertible Class A preferred stock and 180,000 shares of convertible Class B preferred stock.\nNote 5 - Convertible Notes Payable\nThe Company has convertible promissory notes that in the aggregate result in a principal outstanding balance of $160,750 as of July 31, 2022 and 2021, respectively. Interest on these notes range from nine to ten percent per annum and such notes had maturity dates of July 31, 2015. The principal and accrued interest is convertible, at the option of the holder, into common shares at $.01 per share.\nThe Company has convertible promissory notes that in the aggregate result in a principal outstanding balance of $157,945 as of July 31, 2022 and 2021, respectively. Interest on these notes range from eight to ten percent per annum and such notes had maturity dates of July 31, 2015. The principal and accrued interest is convertible, at the option of the holder, into common shares at $.04 per share.\nThe Company has convertible promissory notes that in the aggregate result in a principal outstanding balance of $50,000 as of July 31, 2022 and 2021, respectively. Interest on these notes are 8% per annum and such notes had maturity date of March 31, 2015. The principal and accrued interest is convertible, at the option of the holder, into non-restricted common stock in an amount equal to the total sum due, based on a mutually agreed discount (not to exceed 50%) to the then market price.\nThe Company has convertible promissory notes that in the aggregate result in a principal outstanding balance of $44,711 as of July 31, 2022 and 2021, respectively. Interest on these notes are 10% per annum and such notes had maturity dates ranging from July 31, 2015 to December 31, 2015. The principal and accrued interest is convertible, at the option of the holder, into common shares at $.07 per share.\nThe Company has convertible promissory notes that in the aggregate result in a principal outstanding balance of $39,000 as of July 31, 2022 and 2021, respectively. Interest on these notes are 10% per annum and such notes had maturity dates ranging from July 31, 2015 to December 31, 2015. The principal and accrued interest is convertible, at the option of the holder, into common shares at $.10 per share.\nAccrued interest on such notes total approximately $423,000 and $376,000 as of July 31, 2022 and 2021, respectively and are included within accrued liabilities on the accompanying balance sheet. Based on the maturity dates of the promissory notes, all promissory notes are in default.\nNote 6 - Shareholders Equity\nPreferred stock\nThe Company has two classes of preferred stock and is authorized to issue 25,000,000 shares of $.001 par value preferred stock. The Company's Board of Directors may divide and issue the preferred shares in series. Each Series, when issued, shall be designated to distinguish them from the shares of all other series. The relative rights and preferences of these series include preference of dividends, redemption terms and conditions, amount payable upon shares of voluntary or involuntary liquidation, terms and condition of conversion as well as voting powers.\nSeries A Preferred Stock\nOn December 15, 2008 the Company filed a certificate of designation with the Nevada Secretary of State, in which it was designated and authorized to issue 5,000,000 shares of Convertible Series A Preferred Stock at a par value of $0.001. Each share of Series A Preferred Stock is convertible into 6.25 shares of common stock at the election of the holder. Each Series A share is entitled to 6.25 votes in any vote of the common stock holders. Series A shares are redeemable by the Company at $.50 per share with 15 days written notice. Series A shares are entitled to a 5% dividend preference and a participation interest in the remaining 95% dividend.\nOn June 7, 2021 the Company issued an aggregate of 3,508,257 shares of our convertible Series A preferred stock to our founders as founder stock in connection with the reorganization of our business. The Company recorded $1.3 million as stock compensation in relation to the issuance of the Series A preferred stock based upon the fair value of such shares.\nSeries B Preferred Stock\nOn July 10, 2019 the Company filed a certificate of designation with the Nevada Secretary of State, in which it was designated and authorized to issue 5,000,000 shares of Convertible Series B Preferred Stock at a par value of $0.001. Each share of Series B Preferred Stock is convertible into 1,000 shares of common stock at the election of the holder. As of July 31, 2022 and 2021, 270,000 shares were issued and outstanding.\nCommon stock\nAs of July 31, 2022 and 2021, the Company was authorized to issue 975,000,000 shares of common stock respectively.\nTotal shares outstanding at July 31, 2022 and 2021 were 19,830,679, respectively.\nNote 7 - Income taxes\nThe Company accounts for income taxes under FASB ASC Topic 740, which requires use of the liability method. FASB ASC Topic 740 provides that deferred tax assets and liabilities are recorded based on the differences the tax basis of assets and liabilities and their carrying amounts for financial reporting purposes, referred to as temporary differences.\nAs of July 31, 2022, the Company incurred a net operating loss and, accordingly, no provision for income taxes has been recorded. In addition, no benefit for income taxes has been recorded due to the uncertainty of the realization of any tax assets. The Company has approximately $5.2 million and $5.1 million of federal net operating loss carry forwards at July 31, 2022 and 2021, respectively. In addition, the Company had gross deferred tax assets of $1.1 million as of July 31, 2022 and 2021 for which a full valuation allowance has provided.\nBased on the available objective evidence, including the Company's history of losses, management believes it is more likely than not, the net deferred tax assets will not be fully realizable. Accordingly, the Company provided for a full valuation allowance against its net deferred tax assets at July 31, 2022 and 2021. The Company had no uncertain tax positions as of July 31, 2022 and 2021.\nNote 8 - Asset Purchase\nOn February 17, 2022, the Company entered into an asset purchase agreement with Fitwell Limited, which was subsequently amended on October 18, 2022, for the purchase of a copy of its native mobile fitness application, including all source codes and associated databases for use on the iOS and Android platforms. The purchase price for the software application is $0.5 million to be payable upon the earlier of October 18, 2023 or the Company completing a capital raise, under Regulation A which generates no less than $2 million in proceeds to the Company and shares of the Company in the amount of $0.5 million. On October 18, 2022, the parties closed the asset purchase, and in connection with the purchase of the Fitwell assets, the Company issued a promissory note for $0.5 million and issued 2 million shares of common stock as consideration for the purchase and an additional 2.8 million shares for services rendered, and to be rendered in the future, for the benefit of the Company. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we evaluated the effectiveness of our disclosure controls and procedures (as that term is defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) as of July 31, 2022, which is the end of the period covered by this Annual Report. Based on this evaluation, our Chief Executive Officer and Chief Financial Officer concluded that the Companys disclosure controls and procedures were not effective as of July 31, 2022 to ensure that information required to be disclosed by the Company in reports we file or submit under the Exchange Act is (i) recorded, processed, summarized, evaluated and reported, as applicable, within the time periods specified in the United States Securities and Exchange Commissions rules and forms and (ii) accumulated and communicated to the Companys management, including the Companys Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosures.\nReport of Management on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, our principal executive officer and principal financial and accounting officer and effected by our Board of Directors to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. Because of our inherent limitations, our internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of July 31, 2022. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework (2013 Framework).\nBased on our evaluation, management concluded that our internal control over financial reporting was not effective as of July 31, 2022 due to a lack of segregation of duties. A material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of annual or interim financial statements will not be prevented or detected and corrected on a timely basis. As this deficiency created a reasonable possibility that a material misstatement would not be prevented or detected in a timely basis, management concluded that the control deficiency represented a material weakness and accordingly our internal control over financial reporting was not effective as of July 31, 2022. Management concluded that additional personnel should be hired to ensure that there is adequate segregation of duties.\nRemediation Plan for Material Weakness in Internal Control over Financial Reporting\nWe and our Board treat the controls surrounding, and the integrity of, our financial statements with the utmost priority. Management is committed to the planning and implementation of remediation efforts to address control deficiencies and any other identified areas of risk. These remediation efforts are intended to both address the identified material weakness and to enhance our overall financial control environment.\nWe are committed to maintaining a strong internal control environment. Our remediation efforts have begun, and we will continue to devote significant time and attention to these remedial efforts. As we continue to evaluate and work to improve our internal control over financial reporting, management may determine to take additional measures to strengthen controls or to modify the remediation plan described above, which may require additional implementation time.\nWe believe there are no material inaccuracies or omissions of material fact in this Form 10-K and, to the best of our knowledge, we believe that the financial statements in this Form 10-K fairly present in all material respects our financial condition, results of operations and cash flows in conformity with GAAP.\nChanges in Internal Control over Financial Reporting\nBased on our evaluation, management concluded that our internal control over financial reporting was not effective as of July 31, 2022 due to a lack of segregation of duties.\nOther than as set forth in the foregoing paragraph, there have been no changes in our internal control over financial reporting that occurred during the quarter ended July 31, 2022 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nThis annual report does not include an attestation report of the Company's registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by the Company's registered public accounting firm pursuant to rules of the SEC that permit the Company to provide only management's report in this annual report. Item 9B. Other Information\nNone\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nName\nAge\nPosition(s)\nAdam Laufer\nCEO, Director\nPavan Charan\nCFO, Director\nDr. Sandra Kaufmann\nFormer Director\nAdam Laufer, Since July 20, 2019, Mr. Laufer has served as our CEO and a member of our Board of Directors. Mr. Laufer leads the strategic vision of our company and oversees the implementation of our developing strategy and expansion as a direct-to-consumer health-tech company. Mr. Laufer is responsible for our acquisition, financing and growth strategies. We believe that Mr. Laufers experience as a corporate securities attorney, an entrepreneur, startup founder and patent holder, coupled with his previous executive positions, including CEO and general counsel of a public company and his directorship of a 501c3 non-profit corporation, contribute to his preparedness, and his qualification to serve as a director of the registrant. From 2017 until July 2019, and through the present day, Mr. Laufer, has principally engaged in the management of his personal investment portfolio. From February 10, 2014 until December 15, 2017, Mr. Laufer served as chief executive officer and a director of MJ Holdings, Inc. a publicly traded real estate holding company. From January 2009 until his resignation in 2013, Mr. Laufer served as chairman and chief executive officer of Soleil Capital L.P., a publicly traded company. In 2013, prior to his resignation as an executive officer and a director of Soleil Capital L.P., Mr. Laufer successfully negotiated and executed the acquisition of a portfolio of electronic cigarette and personal vaporizer patents. Mr. Laufer co-founded Vapor Corp., an electronic cigarette company, and from 2009-2013, Mr. Laufer served the company as an advisor and general counsel; consulting on matters of corporate strategy and regulatory issues related to electronic cigarette products, during which time the companys revenues grew from $1M to $23M. Mr. Laufer has significant experience in working with start-up and development stage businesses in defining their corporate strategy, identifying funding and growth opportunities, and in implementing liquidity strategies. Mr. Laufer is a member in good standing of the Florida Bar.\nPavan Charan. Pavan (Satyaketu) Charan has served as our CFO and a member of our board of directors since July 2019. Mr. Charan is a serial entrepreneur and has over twenty-five years of finance and accounting experience within the United States, Europe, Latin America and the Caribbean. Mr. Charan has served in in the CFO capacity for several fast-growing technology companies to enable rapid, repeatable and scalable growth and has also been involved in financial reporting, finance transformation and capital market transactions. Since 2004 Mr. Charan has served as a Managing Director of a management advisory firm specializing in accountancy advisory for public companies, due diligence, merger and acquisition advisory, preparation of financial statements, Sarbanes Oxley implementation, financial modeling, with an expertise in technology implementation for enterprise clients. Earlier in his career, Pavan was a Senior Manager at KPMG, LLP where he provided audit and advisory services to publicly and privately held clients as well as private equity groups. Pavan began his career at Price Waterhouse, is a Chartered Accountant (UK) and a Certified Public Accountant (inactive). His experience spans various industries from healthcare, distribution, and technology, combined with his experience as a senior manager at a global accounting and advisory firm and his experience as a Managing Director of a boutique advisory firm, give Mr. Charan all the experiences, qualifications, and attributes necessary to serve as the registrants CFO and a member of its board of directors.\nDr. Sandra Kaufmann M.D. Sandra Kaufmann, M.D., was a member of our board of directors from June 2021 to October 22, 2022.. Dr. Kaufmann, is currently the chief of pediatric anesthesiology at Joe DiMaggio Childrens Hospital. Dr. Kaufmann earned her Medical Degree at the University of Maryland School of Medicine in 1996, and completed a residency and fellowship at Johns Hopkins in the field of pediatric anesthesiology in 2002. She is board-certified in both Anesthesiology and Pediatric Anesthesiology from the American Board of Anesthesiology and earned her Bachelors Degree of Science from the University of Miami in 1990 followed by a Masters Degree from the University of Connecticut in Tropical Ecology and Evolutionary Biology. Dr. Kaufmann was recognized as Best in Medicine by the American Health Council. Dr. Kaufmann is the thought leader behind our business objective and possesses the vision for our corporate development and expansion in a medically responsible and ethical way, and as the head of a department at a major hospital, is equipped with the business processes, managerial skills and experience which qualifies her to serve as a director of the registrant. Sandra Kaufmann resigned from the board of directors on October 22, 2022.\nFamily Relationships\nNone.\nCommittees\nWe do not currently maintain an audit committee, compensation committee, corporate governance and nominating committee, conflicts committee or an executive committee.\nDirector Compensation\nWe do not currently have any non-employee directors and no additional compensation is currently paid to in connection with directorships over and above any employee-based compensation.\nCode of Ethics\nThe Company has adopted a code of ethics that applies to all of the Company's employees, including its principal executive officer, principal financial officer and principal accounting officer, and the Board. The Company will provide, free of charge, a copy of the Companys code of ethics to any person, upon request. A copy of the code of ethics can be requested by writing to the Company at 1961 NW 150 Avenue, Pembroke Pines, Suite 205 Florida 33028. Item 11. Executive Compensation\nNo executive compensation was paid during the fiscal years ended July 31, 2022 and 2021. The Company has no employment agreement with any of its officers and directors. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth as of October 20, 2022 the number of shares of the Companys common stock and preferred stock owned on record or beneficially by each person known to be the beneficial owner of 5% or more of the issued and outstanding shares of the Companys voting stock, and by each of the Companys directors and executive officers and by all its directors and executive officers as a group. Beneficial ownership representing less than one percent is denoted with an *. Unless otherwise indicated, the address for each person is our address at 1961 NW 150 Avenue, Pembroke Pines, Suite 205 Florida 33028.\nShares Beneficially Owned\nName of Beneficial Owner Common Stock Class A\nPreferred Stock Class B\nPreferred Stock\nShares % Shares % Shares % %Total\nVoting\nPower (1)\nOfficers and Directors\nAdam Laufer * 1,169,419 30.53 90,000 50.0 45.38\nPavan Charan * 1,169,419 30.53 90,000 50.0 45.38\nAll executive officers and directors as a group (3 persons) * 2,338,838 61.05 270,000 90.76\n5% Security Holders\nAdam Laufer * 1,169,419 30.53 90,000 50.0 45.38\nPavan Charan * 1,169,419 30.53 90,000 50.0 45.38\n__________________________\n(1)\nPercentage total voting power represents voting power with respect to all shares of our common stock, class A Preferred stock and class B Preferred Stock, as a single class. Each share of Class A preferred stock shall be entitled to 6.25 votes per share of common stock and each share of Class B preferred stock shall be entitled to one thousand votes per share of common stock on all matters submitted to our stockholders for a vote. The common stock, class A Preferred stock and class B preferred stock vote together as a single class on all matters submitted to a vote of our stockholders, except as may otherwise be required by law. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nOn May 7, 2019, the Eight Judicial District Court of Nevada appointed Small Cap Compliance, LLC as custodian for Worldwide Strategies Inc., proper notice having been given to the officers and directors of Worldwide Strategies Inc. There was no opposition.\nOn July 10, 2019, the Company filed a Certificate of Reinstatement with the state of Nevada. Also, on July 10, 2019, the Company issued to the Custodian 270,000 shares of Convertible Series B preferred stock to satisfy all outstanding obligations and debts owed to Custodian for costs associated with the custodianship proceedings, and all expenses incurred by the custodian in reinstating the company under Nevada state law, and settling all outstanding balances with the companys transfer agent.\nOur CFO, has provided us with office space at no charge.\nOur CEO, CFO in their respective capacities, as executive officers and board members and Dr. Kaufmann, as a board member are providing their services to us without compensation.\nOn October 22, 2022, we successfully terminated a license agreement for certain intellectual property we had previously licensed and had not been able to commercialize. In connection with the termination of the license we were able to cancel 90,000 shares of our issued and outstanding Series B Preferred Stock and 1,169,419 issued and outstanding shares of Series A Preferred stock. In connection with the termination of the license agreement, and pursuant to the terms of the agreement to cancel the license, our board member, Sandra Kaufmann resigned from our board of directors.\nBoard Composition and Director Independence\nOur business and affairs are managed under the direction of the board of directors. Our board of directors is currently comprised of two members, Messrs. Charan and Laufer. Because of their relationships with us, none of them are independent under the rules of any national securities exchange or Rule 10A-3 under the Securities Exchange Act of 1934, or the Exchange Act. Item 14. Principal Accounting Fees and Services.\nThe following table summarizes the aggregate fees for professional services provided by M & K CPAS, PLLC for the years ended July 31, 2022 and 2021.\nM & K CPAS PLLC\nAudit Fees $ 17,500 $ 12,000\nAudit-Related Fees 7,500 2,500\nTotal $ 25,000 $ 14,500\nAudit Fees - This category consists of fees for (a) the audits of our financial statements in our Annual Report on Form 10-K and services attendant to, or required by, statute or regulation; (b) reviews of the interim condensed financial statements included in our Form 10; (c) comfort letters, consents and other services related to SEC and other regulatory filings.\nAudit-Related Fees - This category consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees. The services for the fees disclosed under this category include consultation regarding our correspondence with the SEC, other accounting consulting and other audit services.\nTax Fees - This category consists of fees for services rendered for tax compliance and tax planning and advisory services.\nAll Other Fees - This category consists of fees for other miscellaneous items.\nPre-Approval Policies and Procedures\nOur board of directors pre-approves all services provided by our independent auditors. All of the above services and fees were reviewed and approved by our board of directors before the respective services were rendered.\nOur board of directors has considered the nature and amount of fees billed by our independent registered public accounting firm and believe that the provision of services for activities unrelated to the audit is compatible with maintaining their respective independence. Item 15. Exhibits and Financial Statement Schedules\n(a)(1) The following financial statements are included in Part II, Item 8. Financial Statements and Supplementary Data:\nPage\nFinancial Statements of Worldwide Strategies, Inc.:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets - July 31, 2022 and 2021\nConsolidated Statements of Operations - Years ended July 31, 2022 and 2021\nConsolidated Statements of Changes in Stockholders Equity - Years ended July 31, 2022 and 2021\nConsolidated Statements of Cash Flows - Years ended July 31, 2022 and 2021\nNotes to Consolidated Financial Statements\n(a)(2) Schedules have been omitted because they are not required or are not applicable, or the required information has been included in the financial statements or the notes thereto.\n(a)(3) See accompanying Index to Exhibits.\nExhibit No.\nDescription\n2.1\nNotice of Entry of Order Appointing, Eight Judicial District Court, Clark County, Nevada, Case No.: A-19-791451-P dated May 7, 2019 (Filed as an exhibit to Form 10-12G on June 21, 2021). **\n2.2\nNotice of Entry of Order Discharging, Eight Judicial District Court, Clark County, Nevada, Case No.: A-19-791451-P dated October 16, 2019 (Filed as an exhibit to Form 10-12G on June 21, 2021). **\n3.1\nAmended and Restated Articles of Incorporation (Filed as an exhibit to Form SB-2, File No. 333-129398, on November 2, 2005). **\n3.2\nAmended Bylaws (Filed as an exhibit to Form SB-2, File No. 333-129398, on November 2, 2005). **\n3.3\nCertificate of Change Pursuant to NRS 78.209 effective July 31, 2007 (Filed as an exhibit to the Form 8-K dated July 31, 2007, filed August 6, 2007). **\n3.4\nCertificate of Designation Pursuant to NRS 78.1955 effective December 8, 2008 (Filed as an exhibit to Form 8-K dated December 8, 2008, filed December 10, 2008). **\n3.5\nAmendment to Certificate of Designation Pursuant to NRS 78.1955 effective December 15, 2008 (Filed as an exhibit to the Form 8-K dated December 15, 2008, filed December 17, 2008). **\n3.6\nCertificate of Reinstatement dated July 10, 2019 (Filed as an exhibit to Form 10-12G on June 21, 2021). **\n3.7\nCertificate of Designation dated July 10, 2019 (Filed as an exhibit to Form 10-12G on June 21, 2021). **\n3.8\nCertificate of Amendment by Custodian filed July 10, 2019 (Filed as an exhibit to Form 10-12G on June 21, 2021). **\n3.9\nCertificate of Amendment Filed July 10, 2019 (Filed as an exhibit to Form 10-12G on June 21, 2021). **\n3.11\nCertificate of Amendment to the Articles of Incorporation Filed May 26, 2021 (Filed as an exhibit to Form 10-12G on June 21, 2021). **\nIntellectual Property License Agreement Between Worldwide Strategies Incorporated and Dr. Sandra Kaufmann (Filed as an exhibit to Form 10-12G on June 21, 2021) **\n10.1\n2005 Stock Plan (Filed as an exhibit to the initial filing of the registration statement on Form SB-2, File No. 333-129398, on November 2, 2005). **\n21.1 * List of Subsidiaries\n24.1\nPower of Attorney\n31.1 * Certification of the principal executive officer of the Registrant, pursuant to Securities Exchange Act Rule 13a-14(a)\n31.2 * Certification of the principal financial officer of the Registrant, pursuant to Securities Exchange Act Rule 13a-14(a)\n* Certifications pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of The Sarbanes-Oxley Act of 2002, signed by the principal executive officer and the principal financial officer of the Registrant\n101.INS * Inline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH * Inline XBRL Taxonomy Extension Schema Document\n101.CAL * Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF * Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB * Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE * Inline XBRL Taxonomy Extension Presentation Linkbase Document\n* Cover Page Interactive Data File (formatted in inline XBRL, and included in exhibit 101).\n_________________________________\n*Filed within\n** Previously Filed\nItem 16. Form 10-K Summary\nNone.\nPART IV\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nWORLDWIDE STRATEGIES, INC.\nDate: October 31, 2022 By: /s/ Adam Laufer\nName: Adam Laufer\nTitle:\nChief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nCapacity Date\n/s/ ADAM LAUFER\nChief Executive Officer October 31, 2022\nAdam Laufer\n(Principal Executive Officer)\n/s/ PAVAN CHARAN\nChief Financial Officer and Principal\nAccounting Officer October 31, 2022\nPavan Charan\n(Principal Financial Officer)"
}