{
    "cik": "1345865",
    "company": "Buildablock Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-12-01",
    "period_of_report": "2012-11-30",
    "sic": "4841",
    "state_of_inc": "FL",
    "state_location": "FL",
    "fiscal_year_end": "1130",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1345865/0001493152-23-043326-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1345865/000149315223043326/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1345865/0001493152-23-043326.txt",
    "filename": "1345865_10K_2012_0001493152-23-043326.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS Back to Table of Contents\nThe Company, f/k/a HIPSO Multimedia, Inc., a Florida corporation, was incorporated in April 2005. The Company entered into an Asset Purchase Agreement on November 30, 2011, providing for the acquisition of intellectual property rights comprised of an Internet and mobile service platform whose purpose is to empower or capitalize on the growth of the neighborhood, local economy (the Buildablock Assets).\nEffective March 7, 2012, the Company completed the acquisition of the Buildablock Assets. In connection with the completion of the acquisition, the Company effected a reverse st ck split oft e Companys outstanding shares of common stock, par value $0.00001, on a one-for-eight (1:8) basis (which occurred on March 7, 2012) and issued an aggregate of 8,755,484 shares of common s to ck effective March 7, 2012, representing 50% of the Companys then-outstandmg shares, after givmg effect to the one-for-eight reverse stock split and issuance of the shares.\nUpon the closing of the transaction, Gary Oberman and Bartek Bulzak were elected to the Companys Board of Directors, Mr. Oberman was appointed President and Chief Executive Officer and Mr. Bulzak was appointed Chief Technology Officer.\nEffective February 24, 2012, the name of the Company was changed to Buildablock Corp.\nBusiness\nSummary. Buildablock.com is an Internet service platform whose mission is to act as a transactional catalyst between buyers and sellers while leveraging a growing collection of patented, sophisticated user friendly tools. Growing beyond the scope of aggregation sites or group buying catalogs, Buildablock.com offers consumers maximum value for their purchasing dollar by combining group buying leverage, social media interactivity and automated negotiating tools. Buildablock.coms dashboard of buying tools and follow-on services represent a new paradigm in supply chain interaction for both retailers and consumers alike. The Company expects that ease of customer acquisition and diverse, recurring revenue streams will combine to return exceptional value to the Companys shareholders.\nRecent Activities. In January 2013, the Company launched its e-commerce website, Buildablock.com and the site is now live and fully integrated.\nIn the Companys press release announcing the launch, the Companys CEO, Gary Oberman, stated, we are excited by the live launch of our e-commerce website. We believe that group buying using the Buildablock platform is the wave of the future since it provides for negotiated discounting and user empowerment since it is the customer that chooses products for discounting by just uploading them onto our site. As just one example of how our economies of scale work, by consolidating large blocks of fuel buyers that number in the thousands, the Buildablock platform can approach large fuel providers to negotiate fleet pricing for its members. This is a very compelling application of our business model that can provide the opportunity for Buildablock users to save money on gas.\nThis press release further stated that the Company had progressed into the marketing phase where initiatives will include merchant awareness programs and buyer incentive campaigns. One such program is its joint venture relationship with Linen Chest, Canadas leading retailer in home fashion, with over 28 stores. Linen Chest is a very strong Canadian brand with an emerging digital presence that had been looking for an online solution to help drive traffic to its physical stores and increase online sales without the need for deep discounting.\nSheldon Liebner, President of the Linen Chest, was quoted in the Companys press release, stating, Buildablocks unique group bidding methodology ensures maximum traffic through negotiated price management. We had entertained doing business with fixed discounters like Groupon, but found very little user engagement during the sales process, which limits customer loyalty. With Buildablock, our view is that the user experience will be very engaging, which will maintain maximum value to both the buyer and the seller alike. Buildablock users completed several transactions with Linen Chest in the early phase of its live launch, which was easily facilitated and which Linen Chest reports drove new traffic to both its website and physical stores. Buildablock is the only platform we found that delivers high quality, free advertising without degrading our brand. This is very encouraging news for our firm as we transition our way across the digital landscape.\nFrom this alliance with Linen Chest, the Company was able to obtain essential user feedback through its soft launch in order to finalize systems and procedures and prepare for its live launch. Buildablock is now focused upon increasing its shopper population through various programs and initiatives. Since Buildablocks social login requirement is similar to that of other leading social networking sites, the Company expects to gain exposure to the friends networks of new subscribers it gained via marketing efforts already undertaken, which could lead to over 400,000 potential new subscribers by way of referral.\nThe Company views the social networking element as a key to enhancing the shopper experience and expects to go live with its mobile application in the near future. The Company is intent on increasing the consumer and merchant adoption of the Buildablock platform and remains confident in its ultimate success of its vibrant and exciting e-commerce platform.\nA Unique Shopping Platform. Buildablock.com is an online shopping platform that revolutionizes conventional online shopping. The site brings together great ideas, such as group discounts, wish lists, online negotiations, and more, into a unique venue that empowers consumers to save on the items they want from the merchants they choose.\nWhen a Buildablock.com user finds an item he or she likes, whether online or in a retail store, the Buildablock.com user simply posts basic details about it on Buildablock.com and shares the information on social media. The Company calls that action a Wink. Then, others with the same interest can join the Wink to form a buyer group. Once a certain number of buyers have joined the Wink, Buildablock.com automatically opens a negotiation with the merchant to win a substantial discount for everyone in the buyer group.\nThe Buildablock Advantage. Buildablock.com is capable of saving users money when it comes to buying the things users really want to purchase. While arranging terrific deals for users will always be Buildablock.coms primary objective, Buildablock.com is not one-dimensional. Rather, Buildablock.com empowers both shoppers and merchants, by acting as a mediator between shoppers and merchants.\nEmployees\nWe currently have approximately 4 full employees, including our president, and two part-time per diem installers for our Telecommunication Services and equipment.\nPatents, Trademarks, Service Marks And Licenses and Other Intellectual Property\nOn November 30, 2011, the Company, entered into an Asset Purchase Agreement (the Agreement) with 3324109 Canada Inc., a Canadian corporation owned by Gary Oberman (GaryCo) and 8040397 Canada Inc., a Canadian corporation, owned by Bartek Bulzak (BulzakCo), collectively, the Sellers, providing for the acquisition by the Company of the Buildablock Assets. The Sellers have conducted no other business other than the development of this platform. The intellectual property was funded l 00% by the respective owners of the Sellers personally. The Agreement provides for the issuance of 4,377,742 shares of the Companys common stock to each of GaryCo and BulzakCo, for an aggregate of 8,755,484 shares, representing 50% of the Companys outstanding shares after giving effect to a one-for-eight reverse stock split. On March 7, 2012, the Company completed the acquisition of the Buildablock Assets and the common shares were issued at that time\nMajor Customers\nAs of November 30, 2012, the Company had one customer who generated 75% of our revenues.\nGovernment Regulation\nThe Companys business is not subject to any governmental regulation.\nRecent Developments\nEffective March 7, 2012, the Company completed the acquisition of the Buildablock Assets. In connection with the completion of the acquisition, the Company effected a reverse stock split of the Companys outstanding shares of common stock, par value $0.00001, on a one-for- eight (1:8) basis (which occurred on March 7, 2012) and issued an aggregate of 8,755,484 shares of common stock effective March 7, 2012, representing 50% of the Companys outstanding shares after giving effect to the one-for-eight reverse stock split and issuance of the shares. The Buildablock Assets were valued at $10,000. Upon the closing of the transaction, Messrs. Gary Oberman and Bartek Bulzak were elected to the Companys Board of Directors, Mr. Oberman was appointed President and Chief Executive Officer and Mr. Bulzak was appointed Chief Technology Officer. Effective upon the closing of the transaction, Mr. Rene Arbic resigned as President and Chief Executive Officer of the Company. In addition, Mr. Arbic has agreed to resign from the Board within one year of the closing of the transaction.\nIn addition on April 13, 2012, the Board of Directors approved the sale ofValtech back to some or all of the original shareholders ofValtech for $1.00. This sale occurred on April 30, 2012.\nAs a result of this sale, the Company on April 13, 2012, became a development stage company, as it continues the development of its social networking platform under the Buildablock name. ITEM 1A. RISK FACTORS RELATED TO OUR BUSINESS Back to Table of Contents\nInvesting in our common stock will provide an investor with an equity ownership interest. Shareholders will be subject to risks inherent in our business. The performance of our shares will reflect the performance of our business relative to, among other things, general economic and industry conditions, market conditions and competition. The value of the investment may increase or decrease and could result in a loss. An investor should carefully consider the following factors as well as other information contained in this annual report on Form 10-K for the year ended November 30, 2012.\nThis annual report on Form 10-K also contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of many factors, including the risk factors described below and the other factors described elsewhere in this Form 10-K.\nRisk factors related to our business\nWith the disposition of Valtech, the Company commenced operating in the development stage as it develops its purchased intellectual property. The Company has no revenues and nominal assets other than cash which was raised during May 2012 as part of a private placement. New management has had some preliminary discussions regarding further capitalization of the Company. These plans include the raising of capital through the equity markets to fund future operations and generating adequate revenues for the new business of the Company. Even if the Company raises sufficient capital to support its operating expenses and generates revenues, there can be no assurance that the revenues will be sufficient to enable it to develop business to a level where it will generate profits and cash flows from operations. These matters raise substantial doubt about the Companys ability to continue as a going concern. However, the accompanying consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. These financial statements do not include any adjustments relating to the recovery of the recorded assets or the classification of the liabilities that might be necessary should the Company be unable to continue as a going concern. new and retain existing customers, generate and sustain a revenue base sufficient to meet operating expenses, and achieve profitability, if ever.\nOur auditor has raised doubts about the Companys ability to continue as a going concern.\nThe Company has lost money in every quarter since the inception of its business. As of November 30, 2012, our accumulated loss was $1,884,979. In April 2012, the related party loans with the four principal shareholders of the Company were assumed by Valtech, upon the sale back to Valtech along with the accrued interest on those loans. Currently there is a $0 balance due those shareholders. The amount outstanding prior to the sale was $1,928,319. The loans did bear interest at an annual rate of 10% for individual amounts exceeding $150,000 (CDN$). Interest expense for the years ended November 30, 2012 and 2011 were $35,361 and $97,401, respectively, and are reflected in operations from discontinued operations. Accrued interest on these loans prior to the sale was $329,395. The accrued interest along with the notes were sold in April 2012, and the balance is $0 as of November 30, 2012.\nThe Company may not be successful in implementing its business plan.\nWhile the Companys business model and strategy of offering triple play Telecommunications Services is similar to those being utilized by many existing providers of telecommunication services, the Company may not be successful, for many reasons, including but not limited to insufficient resources to compete in its present market or in expanded markets in Canada or elsewhere. If the assumptions underlying the business model are not valid or if the Company is unable to implement the business plan, achieve predicted levels of market penetration or obtain the desired level of pricing of services for sustained periods, the Company may not be successful. The Company focuses on selling directly to consumers and through hotels and apartment buildings. It may never be able to achieve significant market acceptance, favorable operating results or profitability.\nThe Company has a concentration of credit risk.\nOn August 31, 2011, $6,372, or 76% of the Companys accounts receivable was with three customers. In addition, there was one customer who represented approximately 66% of the revenue for the nine months ended August 31, 2011. This customer is considered a major customer of the Company.\nThe Company expects that its losses will continue for the foreseeable future.\nThe Company has incurred losses and experienced negative cash flow from operations since it commenced its Telecommunications Services business. It expects to continue to incur significant losses and negative cash flow from operations for the foreseeable future. If revenue does not grow as it expects or if its ability to raise capital is insufficient or operating expenditures exceed its expectations, then the Companys business, prospects, financial condition and results of operations will face materially adverse effects.\nCompetitive forces may result in the decrease of the price for the Companys Telecommunication Services.\nPrices for communications services have historically decreased over time. The Company expects that prices for its Telecommunications Services may decrease after the market for such services becomes saturated. While the Company believes that the market for Telecommunication Services shall continue to grow, the Company cannot predict with any certainty the number of years before which saturation occurs. At such time that market saturation occurs, the Company may have to reduce prices in order to remain competitive. The inability to sell its Telecommunication Services at desired pricing levels would significantly impair its ability to achieve profitability.\nThe actual amount and timing of future capital requirements will depend upon a number of factors, including, but not limited to:\n- the number of new markets it enters and the timing of entry;\n- the rate and price at which customers purchase services;\n- the level of marketing required to attract and retain customers; and\n- opportunities to invest in or acquire complementary businesses.\nFailure to manage growth could have a detrimental effect on the Companys business.\nThe Company anticipates that the number and rate of installations for new customers will continue to increase provided that the Company is able to raise sufficient capital. However, rapid growth would place a significant strain on the Companys management, financial controls, operations, personnel and other resources. If the Company fails to manage its anticipated rapid growth, its business could be materially adversely affected. If the Company is unable to provide its existing customers with adequate service and if it does not institute adequate financial and reporting systems, managerial controls and procedures, its financial condition will be adversely affected. It is currently implementing operational support systems to bill customers, process customer orders and coordinate with vendors and contractors. To manage growth effectively, it must successfully implement these systems on a timely basis and continually expand and upgrade these systems as our operations expand.\nThe Companys success depends in large part on its retention of executive officers.\nThe Company is managed by a small number of executive officers. Competition for qualified executives in the telecommunications industry is intense, and there are a limited number of persons with comparable experience. The Company depends upon its executive officers, and, in particular, Rene Arbic, President and Chief Executive Officer, to execute its business strategy and manage employees. While Company does not have employment agreements with nor does it have key person life insurance policies on any of its executive officers, Rene Arbic has an employment agreement with Valtech, the Companys operating subsidiary. The loss of these key individuals would have a material adverse effect on the Companys business.\nIf the Company fails to recruit and hire qualified personnel in a timely manner or to retain its employees, it will not be able to execute its business strategy.\nThe Companys strategy is to continue expanding its presence in Montreal and in Quebec Province. It also plans to expand its service areas to other provinces in Canada. In order to execute this strategy, it must identify, hire, train and retain highly qualified technical, sales, marketing and customer service personnel. If it cannot hire and retain a sufficient number of qualified employees, it will not be able to expand as planned. The Company may be unable to identify, hire or retain employees with experience in the telecommunications industry. Any failure to attract suitable employees would adversely affect its business.\nThe Company may make acquisitions of complementary businesses in the future which may disrupt its business and be dilutive to existing shareholders.\nThe Company intends to consider acquisitions of businesses in the future. Acquisitions of businesses and technologies involve numerous risks, including the diversion of the attention of management, difficulties in assimilating the acquired operations, loss of key employees from the acquired company and difficulties in transitioning key customer relationships. In addition, acquisitions may result in dilutive issuances of equity securities, the incurrence of additional debt, large one-time expenses and the creation of goodwill or other intangible assets that result in significant amortization expense. Any of these factors could materially harm the Companys business or operating results.\nThe Companys quarterly operating results are likely to fluctuate significantly, causing its stock price to be volatile.\nThe Company cannot accurately forecast quarterly revenue and operating results, which may fluctuate significantly from quarter to quarter. If quarterly revenue or operating results fall below the expectations of investors or securities analysts, the price of its common stock could fall substantially. Its quarterly revenue and operating results may fluctuate as a result of a variety of factors, many of which are outside our control, including:\n- the amount and timing of expenditures relating to the rollout of services;\n- the rate at which it is able to attract and retain customers;\n- the availability of future financing to continue expansion;\n- technical difficulties;\n- the introduction of new services or technologies by our competitors and\n- pressures on the pricing of services.\nThe Companys principal shareholders and management own a significant percentage of its capital stock and are able to exercise significant influence over the Company.\nThe Companys executive officers and directors and principal shareholders together beneficially own a majority of the total common stock of the Company. Accordingly, these stockholders, as a group, will be able to determine the composition of the board of directors and will retain the power to approve all matters requiring shareholder approval and will continue to have significant influence over the Companys affairs. This concentration of ownership could have the effect of delaying or preventing a change in control of the Company or otherwise discouraging a potential acquirer from attempting to obtain control of our company, which in turn could have a material and adverse effect on the market price of our common stock or prevent our stockholders from realizing a premium over the market prices for their shares of common stock.\nRisk factors related to the market for our common stock\nThere is no assurance that an active trading market will be sustained for our common stock.\nOur common stock became eligible for quotation on the FINRA OTCBB under the symbol HPSO on August 8, 2008. Further, there can be no assurance regarding the market price of our shares. In addition, the liquidity of any trading market in our common stock, and the market price quoted for the shares of common stock, may be adversely affected by changes in the overall market for securities generally and by changes in our financial performance or prospects for companies in our industry generally. As a result, you cannot be sure that an active trading market will develop or be sustained for our shares.\nState blue sky registration; potential limitations on resale of our securities.\nIt is the intention of the management to seek coverage and publication of information regarding the Company in an accepted publication which permits a manual exemption. This manual exemption permits a security to be distributed in a particular state without being registered if the Company issuing the security has a listing for that security in a securities manual recognized by the state. However, it is not enough for the security to be listed in a recognized manual. The listing entry must contain (1) the names of issuers, officers, and directors, (2) an issuers balance sheet, and (3) a profit and loss statement for either the fiscal year preceding the balance sheet or for the most recent fiscal year of operations. Furthermore, the manual exemption is a nonissuer exemption restricted to secondary trading transactions, making it unavailable for issuers selling newly issued securities.\nMost of the accepted manuals are those published in Standard and Poors, Moodys Investor Service, Fitchs Investment Service, and Bests Insurance Reports, and many states expressly recognize these manuals. A smaller number of states declare that they recognize securities manuals but do not specify the recognized manuals. The following states do not have any provisions and therefore do not expressly recognize the manual exemption: Alabama, Georgia, Illinois, Kentucky, Louisiana, Montana, South Dakota, Tennessee, Vermont and Wisconsin.\nDividends unlikely.\nWe do not expect to pay dividends for the foreseeable future. The payment of dividends, if any, will be contingent upon our future revenues and earnings, capital requirements and general financial condition. The payment of any dividends will be within the discretion of our board of directors. It is our intention to retain all earnings for use in the business operations and accordingly, we do not anticipate that the Company will declare any dividends in the foreseeable future.\nPossible Issuance of Additional Securities.\nOur Articles of Incorporation authorize the issuance of 100,000,000 shares of common stock, par value $0.00001. As of November 30, 2012, we had 23,937,979 shares of common stock issued and outstanding. We may issue additional shares of common stock in connection with any financing activities, as compensation for services or in connection with any future acquisitions. To the extent that additional shares of common stock are issued, our shareholders would experience dilution of their respective ownership interests in the Company. The issuance of additional shares of common stock may adversely affect the market price of our common stock and could impair our ability to raise additional capital through the sale of our equity securities.\nCompliance with Penny Stock Rules.\nOur securities are considered a penny stock as defined in the Exchange Act and the rules thereunder, since the price of our shares of common stock is less than $5. Unless our common stock will otherwise be excluded from the definition of penny stock, the penny stock rules apply with respect to our common stock. The penny stock rules require a broker-dealer prior to a transaction in penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document prepared by the SEC that provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its sales person in the transaction, and monthly account statements showing the market value of each penny stock held in the customers account. In addition, the penny stock rules require that the broker-dealer, not otherwise exempt from such rules, must make a special written determination that the penny stock is suitable for the purchaser and receive the purchasers written agreement to the transaction. These disclosure rules have the effect of reducing the level of trading activity in the secondary market for a stock that becomes subject to the penny stock rules. So long as the common stock is subject to the penny stock rules, it may become more difficult to sell such securities. Such requirements, if applicable, could additionally limit the level of trading activity for our common stock and could make it more difficult for investors to sell our common stock. ITEM 1B. UNRESOLVED STAFF COMMENTS Back to Table of Contents\nNone. ITEM 2. DESCRIPTION OF PROPERTIES Back to Table of Contents\nThe Companys corporate offices are located at 550 Chemin du Golf, Suite 202, Ile des Soeurs, Quebec H3E 1A8. The office building is owned by Canvar Group, which is owned by Peter Varadi, a principal shareholder. The office space is made available to us on a month-to-month basis on a rent-free basis. The Company believes that the office facilities of approximately 2,500 square feet are sufficient for the foreseeable future and that this arrangement will remain in effect. ITEM 3. LEGAL PROCEEDING Back to Table of Contents\nOn April 7, 2008, the Company entered into a consulting agreement with Thomas Klein and Arshad Shaw (the Consultants), pursuant to which each Consultant was issued 300,000 restricted shares of the Companys common stock, granted options to purchase 500,000 shares and options to purchase additional shares during the period commencing May 1, 2008 through October 1, 2008. As a result of the failure of Consultants to provide the services required under the consulting agreement, the Company terminated the consulting agreement on August 28, 2008.\nThe Company commenced a lawsuit against the Consultants and the former transfer agent for its common stock and filed an amended complaint on February 3, 2009, alleging, among other things, non-performance by the Consultants of their obligations under the consulting agreement and their failure to pay for the initial 500,000 options that each exercised.\nOn August 30, 2009, the Court entered a default judgment against the defendants which provide for an injunction against the transfer agent ordering it not to lift restrictions on the certificates evidencing the 300,000 restricted shares of common stock issued to and the 500,000 shares underlying the options granted to each Consultant. On January 26, 2011, the successor transfer agent cancelled the restricted shares in the Consultants names. On March 1, 2011, attorneys for the Consultants filed a motion seeking legal fess from the Company not to exceed\n$1,762.50.\nThe Company is not a party to any other litigation and does not believe that any litigation is pending or threatened. ITEM 4. SUBMISSION OF MATTERS TO A VOTE OF SECURITIES HOLDERS Back to Table of Contents\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON STOCK AND RELATED STOCKHOLDER MATTER Back to Table of Contents\n(a) Market Price Information\nThe Registrants common stock is subject to quotation on the FINRA OTCBB under the symbol BABL. To the best knowledge of the Registrant, there has been no liquid trading market for the Registrants common stock since its registration statement was declared effective. The following table shows the high and low bid prices for the Registrants common stock during the last three fiscal years as reported by the National Quotation Bureau Incorporated. These prices reflect inter-dealer quotations without adjustments for retail markup, markdown or commission, and do not necessarily represent actual transactions.\nFiscal 2011 Fiscal 2010 Fiscal 2009\nHigh Low High Low High Low\nFirst Quarter ended February 28, $ 0.18 $ 0.06 $ 0.12 $ 0.04 $ 1.29 $ 0.09\nSecond Quarter ended May 31, $ 0.10 $ 0.05 $ 0.18 $ 0.09 $ 0.25 $ 0.06\nThird Quarter ended August 31, $ 0.06 $ 0.02 $ 0.15 $ 0.10 $ 0.16 $ 0.06\nFourth Quarter ended November 30, $ 0.08 $ 0.03 $ 0.16 $ 0.09 $ 0.13 $ 0.04\nApproximate Number of Holders of Common Stock: On November 30, 2012, there were approximately 25 shareholders of record of our common stock.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe Registrants board of director approved an equity compensation plan under which 3,000,000 shares of our common stock is authorized for issuance. No shares have been issued under such plan as of the filing of this mended annual report for the year ended November 30, 2012.\nDividend Policy\nHolders of our common stock are entitled to dividends when, as, and if declared by the Board of Directors, out of funds legally available therefore. There are no restrictions in our articles of incorporation or by-laws that restrict us from declaring dividends.\nRecent Sales of Unregistered Securities\nDate of\nIssuance\nName\nNo. of\nShares\nConsideration\nExemption\n02/13/2009\nDan Ryan\n50,000\nExercise of options in exchange for $7,000\nSection 4(2)\n06/15/2009\nClaude Gendron\n300,000\nFor services valued at $48,000\nSection 4(2)\n09/05/2009\nMarc Chabot\n250,000\nPrivate placement valued at $25,000\nSection 4(2)\n09/21/2009\nMLCIA Publication\n180,000\nFor services valued at $18,900\nSection 4(2)\n02/10/2010\nHarold Gervais\n125,000\nFor services valued at $7,500\nSection 4(2)\n02/10/2010\nDaniel Ringuet\n90,000\nExercise of options in exchange for $5,400\nSection 4(2)\n02/10/2010\nDaniel Ringuet\n10,000\nFor services valued at $600\nSection 4(2)\n02/10/2010\nSolnex Inc.\n25,000\nFor services valued at $1,500\nSection 4(2)\n02/23/2010\nJoel Pensley\n500,000\nExercise of options in exchange for $25,000\nSection 4(2)\n04/01/2010\nClaude Gendron\n500,000\nPrivate placement valued at $24,000\nSection 4(2)\n04/08/2010\nDaniel Ringuet\n90,000\nExercise of options in exchange for $12,600\nSection 4(2)\n04/08/2010\nSolnex Inc.\n25,000\nFor services valued at $3,500\nSection 4(2)\n04/08/2010\nHarold Gervais\n75,000\nFor services valued at $10,500\nSection 4(2)\n05/21/2010\nGuylain Pelletier\n400,000\nConversion of $50,000 of debt into equity\nSection 4(2)\n05/28/2010\nGaetan Giguere\n80,000\nConversion of $10,000 of debt into equity\nSection 4(2)\n06/01/2010\nMichael Price\n200,000\nConversion of $25,000 of debt into equity\nSection 4(2)\n06/09/2010\nDavid Cleale\n160,000\nConversion of $20,000 of debt into equity\nSection 4(2)\n06/18/2010\nDavid Oliver-Trottier\n64,000\nConversion of $8,000 of debt into equity\nSection 4(2)\n06/25/2010\nRene Mathieu\n270,256\nConversion of $33,800 of debt into equity\nSection 4(2)\n06/25/2010\nLeandre Vachon\n160,000\nConversion of $20,000 of debt into equity\nSection 4(2)\n06/25/2010\nJulee Pare\n80,000\nConversion of $10,000 of debt into equity\nSection 4(2)\n07/02/2010\nCharles Rancourt\n200,000\nConversion of $25,000 of debt into equity\nSection 4(2)\n07/02/2010\nJean Boissonneault\n120,000\nConversion of $15,000 of debt into equity\nSection 4(2)\n07/22/2010\nRichard Chevenal\n200,000\nConversion of $25,000 of debt into equity\nSection 4(2)\n07/15/2010\nSylvie Vachon\n80,000\nConversion of $10,000 of debt into equity\nSection 4(2)\n07/16/2010\nHugues Pomerleau\n200,000\nConversion of $25,000 of debt into equity\nSection 4(2)\n07/16/2010\nDave Jacques\n80,000\nConversion of $10,000 of debt into equity\nSection 4(2)\n08/06/2010\nEric Lessard\n120,000\nConversion of $15,000 of debt into equity\nSection 4(2)\n09/01/2010\nPeter John Burningham\n100,000\nConversion of $12,500 of debt into equity\nSection 4(2)\n09/01/2010\nGilles Lamarche\n150,000\nFor services valued at $9,000\nSection 4(2)\n09/01/2010\nBenoit Desmeules\n100,000\nFor services valued at $6,000\nSection 4(2)\n09/01/2010\nJean-Rene Lemieux\n50,000\nFor services valued at $3,000\nSection 4(2)\n11/15/2010\nConstellation Asset Management\n570,000\nFor services valued at $68,400\nSection 4(2)\n11/15/2010\nJens Dalsgaard\n570,000\nFor services valued at $68,400\nSection 4(2)\nThe Company believes that the above issuances of restricted shares were exempt from registration pursuant to Section 4(2) of the Act as privately negotiated, isolated, non-recurring transactions not involving any public solicitation. The recipients in each case represented their intention to acquire the securities for investment only and not with a view to the distribution thereof. Appropriate restrictive legends are affixed to the stock certificates issued in such transactions.\nEquity Compensation Plans\nSecurities Authorized for Issuance Under Equity Compensation Plans.\nEquity Compensation Plan Information\nPlan category Number of securities to be issued upon exercise of outstanding options,\nwarrants and\nrights (a) Weighted-average exercise price of outstanding options,\nwarrants and\nrights (b) Number of securities remaining available for future issuance under equity compensation plans (excluding securities\nreflected in\ncolumn (a) (c)\nEquity compensation plans approved by security holders -0- 3,000,000\nEquity compensation plans not approved by security holders -0-\nTotal -0- 3,000,000 ITEM 6. SELECTED FINANCIAL DATA Back to Table of Contents\nOperating Results Data:\nRevenues $ 0 $ 134,422\nNet loss (1,379,032 ) (860,465 )\nNet loss per basic common shareholder (0.01 ) (0.01 )\nBasic weighted average common shares 17,790,270 67,167,107\nFinancial Position Data:\nTotal assets 372,007 35,181\nTotal liabilities 131,963 2,611,047\nStockholders deficit 240,044 (2,575,866 ) ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS AND RESULTS OF OPERATIONS AND FINANCIAL CONDITIONS Back to Table of Contents\nForward-Looking Statements\nThe following discussion contains forward-looking statements. Forward-looking statements give our current expectations or forecasts of future events. You can identify these statements by the fact that they do not relate strictly to historical or current facts. They use of words such as anticipate, estimate, expect, project, intend, plan, believe, and other words and terms of similar meaning in connection with any discussion of future operating or financial performance. From time to time, we also may provide forward-looking statements in other materials we release to the public.\nThe following discussion should be read in conjunction with our financial statements and the related notes appearing elsewhere in this report. The following discussion contains forward-looking statements reflecting our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to those discussed below and elsewhere in this report, particularly in the section entitled Risk Factors.\nTo the extent that statements in the report are not strictly historical, including statements as to revenue projections, business strategy, outlook, objectives, future milestones, plans, intentions, goals, future financial conditions, future collaboration agreements, the success of the Companys development, events conditioned on stockholder or other approval, or otherwise as to future events, such statements are forward-looking. The forward-looking statements contained in this annual report are subject to certain risks and uncertainties that could cause actual results to differ materially from the statements made. Other important factors that could cause actual results to differ materially include the following: business conditions and the amount of growth in the Companys industry and general economy; competitive factors; ability to attract and retain personnel; the price of the Companys stock; and the risk factors set forth from time to time in the Companys SEC reports, including but not limited to its annual report on Form 10-K; its quarterly reports on Forms 10-Q; and any reports on Form 8-K.\nOverview\nIn June 2008, we acquired our wholly-owned subsidiary, Valtech Communications Inc. (Valtech) in a reverse merger transaction, issuing 40 million restricted shares to the Valtech shareholders.\nValtech offers low-cost, highly reliable triple-play service of Digital Phone, Digital Voice, High-Speed Internet and Digital TV backed by fast, friendly and live customer service (Telecommunication Services). Our present plan is to expand our bundled services by providing an end-to- end IPTV solution consisting of IPTV middleware, video on demand, network based PVR, IPTV head ends, content protection, IPTV infrastructure, system integration and IPTV applications such as games. In order to expand our services to include end-to-end IPTV service, the Company is dependent upon its ability to raise sufficient capital to fund its agreement with Ericsson. To date, the Company has been unable to meet its obligations under the Ericsson agreement and at present no agreement with Ericsson has been negotiated and no negotiations with Ericsson are on-going.\nWe intend to use our limited resources to market our services to new residential and commercial building complexes and existing hotel chains. Further, we intend to market our bundled Telecommunication Services in industry publications and intend to develop our website and promote its presence in order to increase web traffic and possible sales to new clients (www.valtech.ca).\nOur management believes that the trend in our business is toward greater convergence to high speed Internet and high definition television. We believe that our bundled Telecommunication Services are competitive in terms of reliability and pricing as compared to the services offered by incumbent operators. Since we have no patent protection, it is possible that a well-funded company could enter the field and diminish our prospective business growth. We face uncertainties regarding our future growth because we must compete on price and quality of service with traditional communications companies with far longer operating histories, more established customer relationships, greater financial, technical and marketing resources, larger customer bases and greater brand or name recognition. Furthermore, companies that may seek to enter our markets may expose us to severe price competition and future technological developments could make us less competitive.\nCash and Cash Equivalents. The Company considers all highly liquid fixed income investments with maturities of three months or less, to be cash equivalents. On November 30, 2012, the Company had $362,007 in cash and cash equivalents. At November 30, 2011, the company had $0 in cash.\nAccounts Receivable. Management periodically reviews the current status of existing receivables and managements evaluation of periodic aging of accounts. The Company accounts receivable for the years ended November 30, 2012 and 2011 were $0 and $26,147 an respectively.\nDeferred Costs. Deferred costs as of November 30, 2012 and 2011, are reflected in assets held under discontinued operations. There was $0 and $71,100 charged to operations for amortization expense for the year ended November 30, 2012 and 2011, respectively, which are reflected in discontinued operations.\nRevenue Recognition. Through April 30, 2012, the Company through Valtech received revenue from subscribers to its triple play network in which it provided digital TV, voice over internet protocol (VoIP), and high speed internet access, all via fiber optic cable. The Company billed its subscribers on a monthly basis and recognized the monthly revenue based upon the specific plan selected by the subscriber. The Company additionally provided contracted services to wire commercial buildings with fiber optic cable in order to provide for similar services. Valtech was sold on April 30, 2012. For reporting periods ended after April 30, 2012, revenues for Valtech are reported net of operating expenses as gain or loss from discontinued operations.\nBuildablock is a development stage company and has not yet recorded any revenues. Buildablock plans to recognize revenue from sales when the following criteria are met: persuasive evidence of an arrangement exists; delivery has occurred; the selling price is fixed or determinable; and collectability is reasonably assured.\nFixed Assets: Fixed assets as of November 30, 2012 and 2011, are reflected in assets held under discontinued operations. There was $0 and $4,997 charged to operations for depreciation expense for the years ended November 30, 2012 and 2011, respectively, which are reflected in discontinued operations.\nResults of Operations.\nComparison of the years ended November 30, 2012 and 2011\nRevenues: Our revenues for the year ended November 30, 2012 were $0 compared to $134,422for year ended November 30, 2011. The Companys revenues decreased by $143,422, which represents a 100% decrease from the prior year. The Companys decrease in revenues is mainly attributable to the sale of Valtech.\nCost of Sales: Cost of Sales for the year ended November 30, 2012 was $0 compared to $301,379 for year ended November 30, 2011. The Companys cost of sales decrease was $301,379, which represents a 100% decrease from prior year. Thus, the decrease in the cost of sales was directly related to the decrease in wirings and installations as well as equipment.\nDepreciation and Amortization: For the year ended November 30, 2012 we recorded $0 in depreciation and amortization expenses compared to $132,490 during the year ended November 30, 2011.\nGeneral and Administrative Expenses: General and Administrative Expenses for the year ended November 30, 2012 was $1,121,464 compared to $429,616 for year ended November 30, 2011. The Companys general and administrative expenses increase was 691,848, which represents a 161% increase from the prior year mainly due to increased non-cash compensation expenses.\nInterest Expense: The Companys interest expense for the year ended November 30, 2012 was $0 compared to $131,402 for year ended November 30, 2010. The decrease of 131,402 were due to the fact that the related party loans with the four principal shareholders of the Company were assumed by Valtech, upon the sale back to Valtech along with the accrued interest on those loans. Currently there is a $0 balance due those shareholders.\nLiquidity and Capital Resources\nDuring the year ended November 30, 2012, our net cash increased by 362,007. During the year ended November 30, 2012 and 2011, net cash used in operating activities was $1,083,641and $388,545, respectively. This cash was used to fund our operations for the periods, adjusted for non-cash expenses and changes in operating assets and liabilities.\nWe had no investing activities in the years ended November 30, 2012 and 2011.\nNet cash provided by financing activities was $(1,486,449) during the year ended November 30, 2012 compared to $355,851 net cash provided by financing activities during the year ended November 30, 2011. The net cash provided by financing activities for the year ended November 30, 2012 resulted from proceeds of $1,486,730 related to the issuance of stoc. The net cash provided by financing activities for the year ended November 30, 2011 resulted from proceeds of $355,851 related to the issuance of stock.\nThe Company has only limited capital. Additional financing is necessary for the Company to continue as a going concern.\nOur continued operations will depend on whether we are able to raise additional funds through third parties, such as equity and debt financing, as well as additional loans from our affiliated shareholders. However, there can be no assurance that such additional funds will be available on acceptable terms and there can be no assurance that any additional funding that we do obtain will be sufficient to meet our needs in the long term. We will continue to fund operations from cash on hand and through the similar sources of capital previously described. We can give no assurances that any additional capital that we are able to obtain will be sufficient to fully fund our growth plan.\nCurrent and Future Financing Needs\nWe have incurred an accumulated deficit of $1,884,979 through November 30, 2012. We have incurred negative cash flow from operations since we started our Telecommunication Services business. We may need to obtain additional funds sooner or in greater amounts than we currently anticipate. Potential sources of financing include strategic relationships, public or private sales of our shares or debt and other sources. We may seek to access the public or private equity markets when conditions are favorable due to our long-term capital requirements. We do not have any committed sources of financing at this time, and it is uncertain whether additional funding will be available when we need it on terms that will be acceptable to us, or at all. If we raise funds by selling additional shares of common stock or other securities convertible into common stock, the ownership interest of our existing stockholders will be diluted. If we are not able to obtain financing when needed, we may be unable to carry out our business plan. As a result, we may have to significantly limit our operations and our business, financial condition and results of operations would be materially harmed.\nEffect of Exchange Rate on Cash.\nDuring 2012, the Company reported a loss of $59 due to changes in the exchange rate compared to a gain of $19,689 in 2011. A loss reflects an increase in the value of the Canadian dollar as compared to the United States dollar.\nCash end of Year. The Companys cash increased by $362,007 to $362,007 at the end of November 30, 2012 compared to an decrease of $13,005 at the end of November 30, 2011.\nOff-Balance Sheet Arrangements\nAs of November 30, 2012 we did not have any off-balance sheet arrangements as defined in Item 303(a)(4)(ii) of Regulation S-K promulgated under the Securities Act of 1934.\nContractual Obligations and Commitments\nThe Company leases its office space from a related party. See also footnote 7 in the consolidated financial statements.\nCritical Accounting Policies\nOur financial statements are prepared in accordance with accounting principles generally accepted in the United States, which require management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements, the disclosure of contingent assets and liabilities and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. The critical accounting policies that affect our more significant estimates and assumptions used in the preparation of our financial statements are reviewed and any required adjustments are recorded on a monthly basis.\nRecent Accounting Pronouncements\nIn May 2011, FASB issued Accounting Standards Update (ASU) No. 2011-04, Amendments to Achieve Common Fair Value Measurement and Disclosure Requirements in U.S. GAAP and IFRSs . FASB ASU 2011-04 amends and clarifies the measurement and disclosure requirements of FASB ASC 820 resulting in common requirements for measuring fair value and for disclosing information about fair value measurements, clarification of how to apply existing fair value measurement and disclosure requirements, and changes to certain principles and requirements for measuring fair value and disclosing information about fair value measurements. The new requirements are effective for fiscal years beginning after December 15, 2011. The Company plans to adopt this amended guidance on October 1, 2012 and at this time does not anticipate that it will have a material impact on the Companys results of operations, cash flows or financial position.\nIn June 2011, FASB issued ASU No. 2011-05, Presentation of Comprehensive Income , which amends the disclosure and presentation requirements of Comprehensive Income. Specifically, FASB ASU No. 2011-05 requires that all nonowner changes in stockholders equity be presented either in 1) a single continuous statement of comprehensive income or 2) two separate but consecutive statements, in which the first statement presents total net income and its components, and the second statement presents total other comprehensive income and its components. These new presentation requirements, as currently set forth, are effective for the Company beginning October 1, 2012, with early adoption permitted. The Company plans to adopt this amended guidance on October 1, 2012 and at this time does not anticipate that it will have a material impact on the Companys results of operations, cash flows or financial position.\nIn September 2011, FASB issued ASU 2011-08, Testing Goodwill for Impairment , which amended goodwill impairment guidance to provide an option for entities to first assess qualitative factors to determine whether the existence of events or circumstances leads to a determination that it is more likely than not that the fair value of a reporting unit is less than its carrying amount. After assessing the totality of events and circumstances, if an entity determines that it is not more likely than not that the fair value of a reporting unit is less than its carrying amount, performance of the two-step impairment test is no longer required. This guidance is effective for annual and interim goodwill impairment tests performed for fiscal years beginning after December 15, 2011, with early adoption permitted. Adoption of this guidance is not expected to have any impact on the Companys results of operations, cash flows or financial position.\nThere were other updates recently issued, most of which represented technical corrections to the accounting literature or application to specific industries and are not expected to have a material impact on the Companys financial position, results of operations or cash flows. ITEM 7A. QUANTITATIVEAND QUALITATIVE DISCLOSURE ABOUT MARKET RISK Back to Table of Contents\nWe have not entered into, and do not expect to enter into, financial instruments for trading or hedging purposes. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA Back to Table of Contents\nConsolidated Balance Sheets as of November 30, 2012 and 2011\nConsolidated Statements of Operations and Comprehensive Income (Loss) for the Years Ended November 30, 2012 and 2011\nConsolidated Statement of Changes in Stockholders Deficit for the Years Ended November 30, 2012 and 2011\nConsolidated Statements of Cash Flows for the Years Ended November 30, 2012 and 2011\nNotes to the Consolidated Financial Statements\nBUILDABLOCK CORP.\n(formerly Hipso Multimedia, Inc.\n(a development stage company)\nCONSOLIDATED BALANCE SHEETS\nNovember 30, 2012 and 2011\n(unaudited)\n11/30/12 11/30/11\n(unaudited) (unaudited)\nASSETS\nCURRENT ASSETS\nCash $ 362,007 $ -\nCurrent assets held under discontinued operations - 35,181\nTotal Current Assets 362,007 35,181\nOTHER ASSETS\nIntellectual property 10,000\nTotal other assets 10,000\nTotal Assets 372,007 35,181\nLIABILITY AND STOCKHOLDERS EQUITY (DEFICIT)\nCURRENT LIABILITIES\nCash overdraft $ - $ 301\nAccounts payable 69,083\nAccrued expenses 60,380 60,380\nConvertible note payable - third party 2,500\nCurrent liabilities held under discontinued operations - 2,550,328\nTotal Current Liabilities 131,963 2,611,047\nTotal Liabilities 131,963 2,611,047\nSTOCKHOLDERS EQUITY (DEFICIT)\nCommon stock, par value $0.00001, 100,000,000 shares authorized, 23,937,979 and 8,559,721 shares issued and outstanding at November 30, 2012 and 2011, respectively\nAdditional paid-in capital 2,357,129 1,551,368\nAdditional paid-in capital - options and warrants 1,075,539 145,512\nSubscription receivable (76,927 ) -\nAccumulated deficit (1,884,979 ) (4,150,676 )\nDeficit accumulated during the development stage (1,042,104 ) -\nAccumulated other comprehensive income (loss) (188,853 ) (122,156 )\nTotal Stockholders Equity (Deficit) 240,044 (2,575,866 )\nTotal Liabilities and Stockholders Equity (Deficit) $ 372,007 $ 35,181\nSee accompanying notes to consolidated financial statements\nBUILDABLOCK CORP.\n(formerly Hipso Multimedia, Inc.\n(a development stage company)\nCONSOLIDATED STATEMENTS OF OPERATIONS\nAND COMPREHENSIVE LOSS\nFor the Years Ended November 30, 2012 and 2011, and the\nPeriod May 1, 2012, through November 30, 2012 (Development Stage)\n(unaudited)\nYear Ended\nYear Ended\nPeriod 5/1/12\n11/30/12 11/30/11 through 11/30/12\n(unaudited)\nREVENUE $ - $ 134,422 $ -\nCOSTS AND EXPENSES\nCost of sales - 301,379 -\nDepreciation and amortization - 132,490 -\nResearch and development 257,568\n257,568\nAdministrative expenses 1,121,464 429,616 784,536\nTotal costs and expenses 1,379,032 863,485 1,042,104\nOPERATING LOSS (1,379,032 ) (729,063 ) (1,042,104 )\nNON-OPERATING INCOME (EXPENSE)\nInterest expense - (131,402 )\nTotal Non-Operating Expense\n(131,402 )\nNET LOSS FROM CONTINUING OPERATIONS (1,379,032 ) (860,465 ) (1,042,104 )\nDISCONTINUED OPERATIONS\nGain (loss) on disposal of subsidiary 2,648,735\nGain (loss) from discontinued operations (46,110 )\nNET GAIN FROM DISCONTINUED OPERATIONS 2,602,625\nNET INCOME (LOSS) $ 1,223,593 $ (860,465 ) $ (1,042,104 )\nNET INCOME PER COMMON SHARE (BASIC)\nFrom continuing operations $ (0.08 ) $ (0.10 )\nFrom discontinued operations 0.15\nNet income per common share (basic) $ 0.07 $ (0.10 )\nWeighted average shares outstanding (BASIC) 17,790,270 8,397,013\nNET INCOME PER COMMON SHARE (DILUTED)\nFrom continuing operations $ (0.08 ) $ (0.10 )\nFrom discontinued operations 0.15\nNet income per common share (diluted) $ 0.07 $ (0.10 )\nWeighted average shares outstanding (DILUTED) 17,790,270 8,397,013\nOTHER COMPREHENSIVE LOSS - CONTINUING OPERATIONS\nComprehensive loss - beginning of period $ (1,379,032 ) $ (860,465 )\nCumulative translation adjustments (59 ) (12,648 )\nComprehensive loss - end of period $ (1,379,091 ) $ (873,113 )\nThe accompanying notes are an integral part of these statements.\nBUILDABLOCK CORP.\n(formerly Hipso Multimedia, Inc.\n(a development stage company)\nCONSOLIDATED STATEMENTS OF CHANGES IN\nSTOCKHOLDERS EQUITY (DEFICIT)\nFor the Years Ended November 30, 2012 and 2011\n(unaudited)\nShares Amount Shares Amount Capital Warrants Receivable (Deficit) Stage (Loss) Total\nPreferred Stock Common Stock Additional Paid-in Additional Paid-in Capital- Subscription Retained Earnings Deficit Accumulated During the Development Accumulated Other Comprehensive Income\nShares Amount Shares Amount Capital Warrants Receivable (Deficit) Stage (Loss) Total\nBalance 11/30/09 - $ - 7,150,439 $ 71 $ 668,793 $ - $ - $ (2,138,376 ) $ - $ (61,301 ) $ (1,530,813 )\nShares issued for cash\n376,782 192,766 145,512\n338,282\nShares issued for services\n212,500 178,398\n178,400\nExercise of stock options\n85,000\n42,999\n43,000\nFair value of options granted\n36,000\n36,000\nFair value of rent contributed by major shareholder\n40,860\n40,860\nConversion of liability to paid in capital - related party\n40,000\n40,000\nNet loss for the year ended 11/30/10 - -\n- (1,151,835 ) - (48,207 ) (1,200,042 )\nBalance 11/30/10 - - 7,824,721 1,199,816 145,512 - (3,290,211 ) - (109,508 ) (2,054,313 )\nShares issued for conversion of loan payable to shareholders\n381,250 121,996\n122,000\nShares issued for services, net of shares cancelled for services\n174,583 93,698\n93,700\nShares issued for cash\n179,167 94,998\n95,000\nFair value of rent contributed by major shareholder\n40,860\n40,860\nBUILDABLOCK CORP.\n(formerly Hipso Multimedia, Inc.\n(a development stage company)\nCONSOLIDATED STATEMENTS OF CHANGES IN\nSTOCKHOLDERS EQUITY (DEFICIT)\nFor the Years Ended November 30, 2012 and 2011\n(unaudited)\nShares Amount Shares Amount Capital Warrants Receivable (Deficit) Stage (Loss) Total\nAdditional\nDeficit Accumulated Accumulated\nOther\nPreferred Stock Common Stock Additional\nPaid-in Paid-in\nCapital-\nSubscription Retained\nEarnings\nDuring the\nDevelopment Comprehensive Income\nShares Amount Shares Amount Capital Warrants Receivable (Deficit) Stage (Loss) Total\nNet loss for the year ended 11/30/11 - -\n- - (860,465 ) - (12,648 ) (873,113)\nBalance 11/30/11 - - 8,559,721 1,551,368 145,512 - (4,150,676 ) - (122,156 ) (2,575,866 )\nShares issued for services\n195,763 75,458\n75,460\nFair value of rent contributed by major shareholder\n10,215\n10,215\nNet income for the five months ended 4/30/12 - -\n- - 2,265,697 - (66,638 ) 2,199,059\nBalance 4/30/12 - - 8,755,484 1,637,041 145,512 - (1,884,979 ) - (188,794 ) (291,132 )\nBalance - - 8,755,484 1,637,041 145,512 - (1,884,979 ) - (188,794 ) (291,132 )\nShares issued for services and accounts payable\n480,000 119,996\n120,000\nShares issued for cash\n5,947,000 590,181 896,510 (85,655 )\n1,401,095\nShares issued for intellectual property\n8,755,484 9,912\n10,000\nFractional shares issued\n-\n( 1)\n(1 )\nCash received for shares issued\n8,728\n8,728\nFair value of options granted\n33,517\n33,517\nNet loss for the period 5/1/12 through 11/30/12 (development stage)\n- (1,042,104 ) (59 ) (1,042,163 )\nNet (income) loss\n(1,042,104 ) (59 ) (1,042,163 )\nBalance 11/30/12 - - 23,937,979 $ 239 $ 2,357,129 $ 1,075,539 $ (76,927 ) $ (1,884,979 ) $ (1,042,104 ) $ (188,853 ) $ 240,044\nBalance - - 23,937,979 $ 239 $ 2,357,129 $ 1,075,539 $ (76,927 ) $ (1,884,979 ) $ (1,042,104 ) $ (188,853 ) $ 240,044\nSee accompanying notes to consolidated financial statements.\nBUILDABLOCK CORP.\n(formerly Hipso Multimedia, Inc.\n(a development stage company)\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended November 30, 2012 and 2011, and the\nPeriod May 1, 2012, through November 30, 2012 (Development Stage)\n(unaudited)\nYear Ended Year Ended Period 5/1/12\nthrough 11/30/12\n11/30/12 11/30/11 (unaudited)\nCASH FLOWS FROM OPERATING ACTIVITIES - CONTINUING OPERATIONS:\nNet income (loss) $ (1,379,032 ) $ (860,465 ) $ (1,042,104 )\nAdjustments to reconcile net income (loss) to net cash used for operating activities: - - -\nDepreciation and amortization - 132,490 -\nStock based compensation and shares issued for services 192,476 73,270 -\nContributed expenses by management 30,645 40,860 -\nChanges in operating assets and liabilities: - - -\nAccounts receivable - (7,708 )\nPrepaid expenses and other current assets - - -\nAccounts payable and accrued expenses 72,270 233,008 113,930\nNet cash used for operating activities (1,083,641 ) (388,545 ) (928,174 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nIncrease (decrease) in cash overdraft (301 ) (196,569 )\nCash received for common stock 1,486,750 70,000 1,486,750\nLoan payable to bank - - -\nLoan payable to shareholders - 285,749 -\nNet cash provided by financing activities 1,486,449 355,851 1,290,181\nDISCONTINUED OPERATIONS\nOperating activities (40,765 ) - -\nInvesting activities\n- -\nFinancing activities - -\nTotal Discontinued Operations (40,742 ) - -\nEFFECT OF EXCHANGE RATE ON CASH (59 ) 19,689 -\nINCREASE (DECREASE) IN CASH 362,007 (13,005 ) 362,007\nCASH, BEGINNING OF YEAR - 13,005 -\nCASH, END OF PERIOD 362,007 $ - 362,007\nSee accompanying notes to financial statements.\nBUILDABLOCK CORP.\n(formerly Hipso Multimedia, Inc.\n(a development stage company)\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended November 30, 2012 and 2011, and the\nPeriod May 1, 2012, through November 30, 2012 (Development Stage)\n(unaudited)\nYear Ended 11/30/12 Year Ended 11/30/11 Period 5/1/12\nthrough 11/30/12\n(unaudited)\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid for interest $ - $ - $ -\nNONCASH OPERATING AND FINANCING ACTIVITIES:\nConversion of notes payable - related parties for equity $ - $ 25,000 $ -\nCommon shares issued for intellectual property $ 10,000 $ - $ -\nSee accompanying notes to financial statements.\nBUILDABLOCK CORP.\n(formerly Hipso Multimedia, Inc.\n(a development stage company)\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNovember 30, 2012 and 2011\n(unaudited)\nNOTE 1 - ORGANIZATION AND BASIS OF PRESENTATION\nThese consolidated unaudited financial statements reflect all adjustments, including normal recurring adjustments which, in the opinion of management, are necessary to present fairly the consolidated operations and cash flows for the periods presented.\nBuildablock Corp. (the Company) formerly HIPSO Multimedia, Inc., a Florida corporation, was incorporated in April 2005. As described in Note 7, the Company entered into an Asset Purchase Agreement on November 30, 2011 providing for the acquisition of intellectual property rights comprised of an Internet and mobile service platform whose purpose is to empower or capitalize on the growth of the neighborhood, local economy (the Buildablock Assets). The Buildablock Assets are in the development stage. In addition to Buildablocks social networking library, the service is enriched by its new DealWink engine, a new e-commerce platform that combines the power of group buying, couponing, and price aggregation, among other things, to drive both value to its customers and opportunity to the retailer. Effective March 7, 2012, the Company completed the acquisition of the Buildablock Assets. In connection with the completion of the acquisition, the Company effected a reverse stock split of the Companys outstanding shares of common stock, par value $0.00001, on a one-for-eight (1:8) basis (which occurred on March 7, 2012) and issued an aggregate of 8,755,484 shares of common stock effective March 7, 2012, representing 50% of the Companys outstanding shares after giving effect to the one-for-eight reverse stock split and issuance of the shares. The Buildablock Assets were valued at $10,000. Upon the closing of the transaction, Messrs. Gary Oberman and Bartek Bulzak were elected to the Companys Board of Directors, Mr. Oberman was appointed President and Chief Executive Officer and Mr. Bulzak was appointed Chief Technology Officer. Effective February 24, 2012, the name of the Company was changed to Buildablock Corp.\nOn June 5, 2012, the Company formed a Canadian subsidiary, Buildablock Canada Inc. (Buildablock Canada). Since inception, Buildablock Canada has had little activity. The Company anticipates that Buildablock Canada will engage in research and development activities.\nEffective July 1, 2009, the Company adopted the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 105-10, Generally Accepted Accounting Principles - Overall (ASC 105-1 0). ASC 105-10 establishes the FASB Accounting Standards Codification (the Codification) as the source of authoritative accounting principles recognized by the FASB to be applied by nongovernmental entities in the preparation of financial statements in conformity with U.S. GAAP. Rules and interpretive releases of the SEC under authority offederal securities laws are also sources of authoritative U.S. GAAP for SEC registrants. All guidance contained in the Codification carries an equal level of authority. The Codification superseded all existing n·on-SEC accounting and reporting standards. All other non-grandfathered, non-SEC accounting literature not included in the Codification is non-authoritative. The FASB will not issue new standards in the form of Statements, FASB Positions or Emerging Issue Task Force Abstracts. Instead, it will issue Accounting Standards Updates (ASUs). The FASB will not consider ASUs as authoritative in their own right. ASUs will serve only to update the Codification, provide background information about the guidance and provide the bases for conclusions on the change(s) in the Codification. References made to FASB guidance throughout this document have been updated for the Codification.\nGoing Concern\nWith the disposition of Valtech, the Company commenced operating in the development stage as it develops its purchased intellectual property. The Company has no revenues and nominal assets other than cash which was raised during May 2012 as part of a private placement. New management has had some preliminary discussions regarding further capitalization of the Company. These plans include the raising of capital through the equity markets to fund future operations and generating adequate revenues for the new business of the Company. Even if the Company raises sufficient capital to support its operating expenses and generates revenues, there can be no assurance that the revenues will be sufficient to enable it to develop business to a level where it will generate profits and cash flows from operations. These matters raise substantial doubt about the Companys ability to continue as a going concern. However, the accompanying consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. These financial statements do not include any adjustments relating to the recovery of the recorded assets or the classification of the liabilities that might be necessary should the Company be unable to continue as a going concern.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its subsidiary. All significant intercompany accounts and transactions have been eliminated in consolidation.\nDevelopment Stage Company\nThe Company is considered to be in the development stage as defined in ASC 915. The Company has devoted substantially all of its efforts to the development of its software platform.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. On an on-going basis, the Company evaluates its estimates, including, but not limited to, those related to investment tax credits, bad debts, income taxes and contingencies. The Company bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results could differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid debt instruments and other short-term investments with an initial maturity of three months or less to be cash equivalents.\nComprehensive Income\nThe Company adopted ASC 220-10, Reporting Comprehensive Income, (formerly SFAS No. 130). ASC 220-10 requires the reporting of comprehensive income in addition to net income from operations.\nComprehensive income is a more inclusive financial reporting methodology that includes disclosure of information that historically has not been recognized in the calculation of net income.\nFair Value of Financial Instruments\nThe carrying amounts reported in the consolidated balance sheets for cash and cash equivalents, accounts receivable and accounts payable approximate fair value because of the immediate or short-term maturity of these financial instruments. For the loans payable, the carrying amount reported is based upon the incremental borrowing rates otherwise available to the Company for similar borrowings.\nCurrency Translation\nFor subsidiaries outside the United States that prepare financial statements in currencies other than the U.S. dollar, the Company translates income and expense amounts at average exchange rates for the year, translates assets and liabilities at year-end exchange rates and equity at historical rates. The Companys functional currency is the Canadian dollar, while the Company reports its currency in the US dollar. The Company records these translation adjustments as accumulated other comprehensive income (loss). Gains and losses from foreign currency transactions are included in other income (expense) in the results of operations.\nRevenue Recognition\nThrough April 30, 2012, the Company through Valtech received revenue from subscribers to its triple play network in which it provided digital TV, voice over internet protocol (VoIP), and high speed internet access, all via fiber optic cable. The Company billed its subscribers on a monthly basis and recognized the monthly revenue based upon the specific plan selected by the subscriber. The Company additionally provided contracted services to wire commercial buildings with fiber optic cable in order to provide for similar services. Valtech was sold on April 30, 2012. For reporting periods ended after April 30, 2012, revenues for Valtech are reported net of operating expenses as gain or loss from discontinued operations.\nBuildablock is a development stage company and has not yet recorded any revenues. Buildablock plans to recognize revenue from sales when the following criteria are met: persuasive evidence of an arrangement exists; delivery has occurred; the selling price is fixed or determinable; and collectability is reasonably assured.\nThe Company plans to record as revenue the net amount it retains fr m the sale of produ ts, excluding any applicab e taxes, after remitting the payment to the merchant minus the transaction fees. Revenue will be recorded on a net basis because the Company plans to act as an agent of the merchant in the transaction.\nThe Company plans that the merchant will be the primary obligor in these transactions,_ will be s bject to inventory risk, and will have latitude in establishing prices. The Company plans to perform a service by actmg as the agent of the merchant which will be responsible for fulfillment, and therefore revenue is planned to be recorded on a net basis.\nAccounts Receivable\nThe Company conducts business and extends credit based on an evaluation of the customers financial condition, generally without requiring collateral.\nExposure to losses on receivables is expected to vary by customer due to the financial condition of each customer. The Company monitors exposure to credit losses and maintains allowances for anticipated losses considered necessary under the circumstances. The Company has no allowance for doubtful accounts as of August 31, 2012.\nAccounts receivable are generally due within 30 days and collateral is not required. Unbilled accounts receivable represents amounts due from customers for which billing statements have not been generated and sent to the customers.\nIncome Taxes\nThe Company accounts for income taxes utilizing the liability method of accounting.Under the liability method, deferred taxes are determined based on differences between financial statement and tax bases of assets and liabilities at enacted tax rates in effect in years in which differences are expected to reverse. Valuation allowances are established, when necessary, to reduce deferred tax assets to amounts that are expected to be realized.\nAdvertising Costs\nThe Company expenses the costs associated with advertising as incurred. Advertising expenses for the nine months ended August 31, 2012 and 2011 are included in administrative expenses in the consolidated statements of operations.\nFixed Assets\nFixed assets are stated at cost. Depreciation is computed using the straight-line method over the estimated useful lives of the assets; office and computer equipment - 5 years.\nWhen assets are retired or otherwise disposed of, the costs and related accumulated depreciation are removed from the accounts, and any resulting gain or loss is recognized in income for the period. The cost of maintenance and repairs is charged to income as incurred; significant renewals and betterments are capitalized. Deduction is made for retirements resulting from renewals or betterments.\nImpairment of Long-Lived Assets\nLong-lived assets, primarily fixed assets, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the assets might not be recoverable. The Company does perform a periodic assessment of assets for impairment in the absence of such information or indicators. Conditions that would necessitate an impairment assessment include a significant decline in the observable market value of an asset, a significant change in the extent or manner in which an asset is used, or a significant adverse change that would indicate that the carrying amount of an asset or group of assets is not recoverable. For long-lived assets to be held and used, the Company recognizes an impairment loss only if its carrying amount is not recoverable through its undiscounted cash flows and measures the impairment loss based on the difference between the carrying amount and estimated fair value.\nIncome (Loss) Per Share of Common Stock\nBasic net loss per common share is computed using the weighted average number of common shares outstanding. Diluted earnings per share (EPS) includes additional dilution from common stock equivalents, such as stock issuable pursuant to the exercise of stock options and warrants. All shares are reflected post 1:8 reverse split which occurred March 7, 2012. Common stock equivalents were not included in the computation of diluted earnings per share when the Company reported a loss because to do so would be antidilutive for periods presented.\nStock-Based Compensation\nIn 2006, the Company adopted the provisions of ASC 718-10 Share Based Payments for its year ended November 30, 2008. The adoption of this principle had no effect on the Companys operations.\nThe Company has elected to use the modified-prospective approach method.Under that transition method, the calculated expense in 2006 is equivalent to compensation expense for all awards granted prior to, but not yet vested as of January 1, 2006, based on the grant-date fair values. Stock-based compensation expense for all awards granted after January 1, 2006 is based on the grant-date fair values. The Company recognizes these compensation costs, net of an estimated forfeiture rate, on a pro rata basis over the requisite service period of each vesting tranche of each award.\nThe Company considers voluntary termination behavior as well as trends of actual option forfeitures when estimating the forfeiture rate. The Company measures compensation expense for its non-employee stock-based compensation under ASC 505-50, Accounting for Equity Instruments that are Issued to Other Than Employees for Acquiring, or in Conjunction with Selling, Goods or Services. The fair value of the option issued is used to measure the transaction, as this is more reliable than the fair value of the services received. The fair value is measured at the value of the Companys common stock on the date that the commitment for performance by the counterparty has been reached or the counterpartys performance is complete. The fair value of the equity instrument is charged directly to expense and additional paid-in capital.\nSegment Information\nThe Company follows the provisions of ASC 280-10, Disclosures about Segments of an Enterprise and Related Information. This standard requires that companies disclose operating segments based on the manner in which management disaggregates the Company in making internal operating decisions. As of November 30, 2012 and for the years ended November 30, 2012 and 2011, the Company operates in only one segment and in only one geographical location.\nReclassifications\nThe Company has reclassified certain amounts in its condensed consolidated statement of operations for the year ended November 30, 2011 to conform with the November 30, 2012 presentation. These reclassifications had no effect on the net loss for the year ended November 30, 2011.\nUncertainty in Income Taxes\nThe Company follows ASC 740-10, Accounting for Uncertainty in Income Taxes (ASC 740-10). This interpretation requires recognition and measurement of uncertain income tax positions using a more-likely-than-not approach. ASC 740-10 is effective for fiscal years beginning after December 15, 2006. Management has adopted ASC 740-10 for 2009, and they evaluate their tax positions on an annual basis, and has determined that as ofN ovember 30, 2012, no additional accrual for income taxes other than the federal and state provisions is considered necessary.\nFair Value Measurements\nIn September 2006, the FASB issued ASC 820, Fair Value Measurements. ASC 820 defines fair value, establishes a framework for measuring fair value in generally accepted accounting principles, and expands disclosure about fair value measurements. This statement is effective for financial statements issued for fiscal years beginning after November 15, 2007. Early adoption is encouraged. The adoption of ASC 820 is not expected to have a material impact on the financial statements.\nIn February 2007, the FASB issued ASC 825-10, The Fair Value Option for Financial Assets and Financial Liabilities- Including an amendment of ASC 320-10, (ASC 825-10) which permits entities to choose to measure many financial instruments and certain other items at fair value at specified election dates. A business entity is required to report unrealized gains and losses on items for which the fair value option has been elected in earnings at each subsequent reporting date. This statement is expected to expand the use of fair value measurement. ASC 825-10 is effective for financial statements issued for fiscal years beginning after November 15, 2007, and interim periods within those fiscal years.\nRecent Accounting Pronouncements\nIn May 2011, FASB issued Accounting Standards Update (ASU) No. 2011-04, Amendments to Achieve Common Fair Value Measurement and Disclosure Requirements in U.S. GAAP and IFRSs. ASU 2011-04 amends and clarifies the measurement and disclosure requirements of ASC 820 resulting in common requirements for measuring fair value and for disclosing information about fair value measurements, clarification of how to apply existing fair value measurement and disclosure requirements, and changes to certain principles and requirements for measuring fair value and disclosing information about fair value measurements. The new requirements are effective for fiscal years beginning after December 15, 2011. The Company adopted this amended guidance, which did not have a material impact on the Companys results of operations, cash flows or financial position.\nIn June 2011, FASB issued ASU No. 2011-05, Presentation of Comprehensive Income, which amends the disclosure and presentation requirements of Comprehensive Income. Specifically, ASU No. 2011-05 requires that all nonowner changes in stockholders equity be presented either in 1) a single continuous statement_ of compreh nsive income or 2) two separate but consecutive statements, in which the first statement presents total net mcome and its components, and the second statement presents total other comprehensive income and its components.\nThe Company adopted this amended guidance, which did not have a material impact on the Companys results of operations, cash flows or financial position.\nIn September 2011, FASB issued ASU 2011-08, Testing Goodwill for Impairment, which amended goodwill impairment guidance to provide an option for entities to first assess qualitative factors to determine whether the existence of events or circumstances leads to a determination that it is more likely than not that the fair value of a reporting unit is less than its carrying amount. After assessing the totality of events and circumstances, if an entity determines that it is not more likely than not that the fair value of a reporting unit is less than its carrying amount, performance of the two-step impairment test is no longer required. This guidance is effective for annual and interim goodwill impairment tests performed for fiscal years beginning after December 15, 2011.\nThere were other updates recently issued, most of which represented technical corrections to the accounting literature or application to specific industries and are not expected to have a material impact on the Companys financial position, results of operations or cash flows.\nNOTE 3 - FIXED ASSETS\nFixed assets as of November 30, 2012 and 2011, are reflected in assets held under discontinued operations. There was $0 and $4,997 charged to operations for depreciation expense for the years ended November 30, 2012 and 2011, respectively, which are reflected in discontinued operations.\nNOTE 4 - DEFERRED COSTS\nDeferred costs as of November 30, 2012 and 2011, are reflected in assets held under discontinued operations. There was $0 and $71,100 charged to operations for amortization expense for the year ended November 30, 2012 and 2011, respectively, which are reflected in discontinued operations.\nNOTE 5 - RELATED PARTY LOANS\nIn April 2012, the related party loans with the four principal shareholders of the Company were assumed by Valtech, upon the sale back to Valtech along with the accrued interest on those loans. Currently there is a $0 balance due those shareholders. The amount outstanding prior to the sale was $1,928,319. The loans did bear interest at an annual rate of 10% for individual amounts exceeding $150,000 (CDN$). Interest expense for the years ended November 30, 2012 and 2011 were $35,361 and $97,401, respectively, and are reflected in operations from discontinued operations. Accrued interest on these loans prior to the sale was $329,395. The accrued interest along with the notes were sold in April 2012, and the balance is $0 as of November 30, 2012 (see Note 12).\nNOTE 6 - COMMITMENTS\nOffice Space\nThe Company occupies approximately 2,500 square feet of office space owned by a company that is owned by a shareholder of the Company. The occupancy is on a month-to-month basis, without a lease and without payment ofrent. The Company has occupied the space since February 1, 2008. Accordingly, a rent expense was recorded at the fair value of the applicable rent and with an offset to additional paid-in capital. The Company as of April 1, 2012, no longer utilized this space.\nService Agreement\nIn July 2009, the Companys subsidiary, Valtech Communications, Inc. entered into a written agreement with Groupe Canvar Inc. (a related party through common ownership). The agreement provides for Groupe Canvar, Inc. to provide brochures, price lists, contact information and other literature relating to Valtech Communications, Inc. services to the tenants leasing the apartments or office space in the buildings owned by Groupe Canvar, Inc. In addition, the agreement provides for Valtech Communications, Inc. to install wiring in new and refurbished buildings owned by Groupe Canvar, Inc. to their server for these services. All pricing is at the same terms as those for Valtech Communications, Inc. other customers. The agreement was to expire July 2010, and was extended for another two years through July 2012. This agreement will remain with Valtech in connection with the sale of Valtech in April 2012 (see Note 12).\nFinancing Agreement\nOn June 15, 20 l 0, the Company entered into an Engagement Agreement with DME Securities LLC (DME) to raise $10,000,000 in debt or equity financing on a best efforts basis. The Company was responsible to pay a 10% success fee and to issue Placement Agent Warrants upon the successful completion of any amounts raised. DME was not able to raise any funds for the Company and the Engagement Agreement terminated on May 31, 2011.\nOn August 18, 20 l 0, the Company executed an equity financing commitment ofup to $5,000,000 from Dutchess Capital through its Dutchess Opportunity Fund, L.P. The commitment had a 3 year term, and the Company would sell its shares of common stock to Dutchess Capital up to the total committed amount. The Company would determine, at its sole discretion, the amount and timing of any sales of these shares. The purchase price of the shares would be set at 95% of the lowest daily VW AP of the common stock of the Company during the 5 consecutive trading days immediately after the put date as defined in the term sheet. The Company has not sold any shares under this term sheet and the agreement was cancelled.\nOn October 12, 20 l 0, the Company entered into an agreement with Notre-Dame Capital Inc. to raise $15,000,000 through an equity and debt financing on a best effort basis. Debentures would be offered in tranches of $50,000 and would bear interest at a rate of 8% per annum, payable quarterly in arrears, and maturing five years from the date of issuance. The principal amount of each debenture would be convertible into common shares of the Companys stock at the option of the holder. The conversion price would be $2.00 per share for the first two years from the date of issuance, and thereafter at a price per share of $2.40 until maturity.\nIn connection with the financing, Notre-Dame Capital Inc. would receive a cash fee equal to 8% of the gross proceeds raised under the offering plus 4% warrants of the raised funds. Each warrant would entitle Notre-Dame Capital Inc. to purchase one share of common stock. The warrants would be exercisable at the financing price for a period of three years after the closing of the financing. In addition to the proposed financing, Notre-Dame Capital Inc. and its affiliates would purchase 375,000 common shares of the Company from the directors of the Company. No money was raised under this proposed financing and the agreement was cancelled.\nInvestor Relation/Public Relation Agreements\nThe Company entered into an agreement with Complete Advisory Partners on April 12, 2011 to provide public relation services. The agreement is for a term of one year but the Company can terminate the services every 90 days. In accordance with the term of the agreement, the Company issued 50,000 shares of common stock as an initial payment. The Agreement with Complete Advisory Partners was cancelled and the company retained the 50,000 shares of common stock issued to it.\nThe Company entered into an Investor Relations Agreement with CCG Investor Relations effective July 1, 2012. The Agreement is for a term of l year. Consideration for the services that CCG Investor Relations will provide is in the form of 20,000 options per month under the 2012 Plan (as defined in Note 8).\nDistribution Agreement\nOn April 11, 2011, the Company signed a long-term distribution agreement with Level Vision Electronics Ltd (Level). The five (5) year renewable distribution agreement with Level includes the distribution in North America of its 3-D Television screens technology, including High Definition, LCD screens and computer monitors for commercial applications. The Company was to deploy and bring to market a unique new multimedia solution to enhance the advertising market. This agreement will remain with Valtech in connection with the sale of Valtech in April 2012 (see Note 12).\nNOTE 7 - ACQUISITION - BUILDABLOCK\nOn November 30, 2011, the Company, entered into an Asset Purchase Agreement (the Agreement) with 3324109 Canada Inc., a Canadian corporation owned by Gary Oberman (GaryCo) and 8040397 Canada Inc., a Canadian corporation, owned by Bartek Bulzak (BulzakCo), collectively, the Sellers, providing for the acquisition by the Company of the Buildablock Assets. The Sellers have conducted no other business other than the development of this platform. The intellectual property was funded 100% by the respective owners of the Sellers personally. The Agreement provides for the issuance of 4,377,742 shares of the Companys common stock to each of GaryCo and BulzakCo, for an aggregate of 8,755,484 shares, representing 50% of the Companys outstanding shares after giving effect to a one-for-eight reverse stock split. On March 7, 2012, the Company completed the acquisition of the Buildablock Assets and the common shares were issued at that time (see Note 12).\nNOTE 8 - STOCKHOLDERS DEFICIT\nCommon Stock\nAs of November 30, 2012, the Company has 100,000,000 shares of common stock authorized with a par value of $.00001 per share.\nThe Company has 23,937,979 shares issued and outstanding as of November 30, 2012. During the year ended November 30, 2012, the Company issued:\nThe Company issued 8,755,484 shares of stock for the acquisition of the Buildablock Assets valued at $10,000; 480,000 shares ofcommon stock to settle accounts payable of$36,500 and for services of$83,500; and issued 5,947,000 shares of common stock in a private placement which included 5,947,000 warrants at a value of$1,486,750.\nThe Company issued 195,750 shares of stock for services rendered valued at $75,460 at prices per share ranging from $0.24 to $0.48 for the quarter.\nThe Company occupied office space owned by a principal shareholder, and recorded $10,215 of rent expense as contributed capital for the space. There was an adjustment made for back rent in the amount of $20,430 as well.\nThe Company occupied office space owned by a principal shareholder, and recorded $10,215 of rent expense as contributed capital for the space.\nThe Company issued 50,000 shares of stock for cash and liability for stock to be issued and 12,500 shares of stock for services rendered ($5,000).\nThe Company occupied office space owned by a principal shareholder, and recorded $10,215 of rent expense as contributed capital for the space.\nThe Company issued 366,250 shares of stock for cash and liability for stock to be issued and services rendered ($124,700) at a value of $199,700.\nThe Company occupied office space owned by a principal shareholder, and recorded $10,215 of rent expense as contributed capital for the space.\nThe Company issued 38,125 shares of common stock to three of its shareholders to convert $122,000 of loans to them.\nThe Company also cancelled 75,000 shares of stock to consultants at $0.48 for services to be rendered to the Company back in 2008 (see Note 6).\nThe Company also incurred a $50,000 liability for stock to be issued for subscriptions of cash received in the three months ended February 28, 2011 for certificates not issued.\nThe Company occupied office space owned by a principal shareholder, and recorded $10,215 of rent expense as contributed capital for the space.\nStock Options\nThe Company accounts for stock-based compensation using the fair value method. The fair value method requires the cost of employee services received for awards of equity instruments, such as stock options and restricted stock, to be recorded at the fair value on the date of the grant. The value of restricted stock awards, based upon market prices, is amortized over the requisite service period.\nOn July 6, 2012, the Board ofDirectors of the Company adopted the 2012 Equity Incentive Plan (the 2012 Plan). The 2012 Plan provides for the grant of stock options, stock appreciation rights, restricted stock awards, restricted stock units, performance shares and performance share units to employees, consultants and non-employee directors of the Company and its subsidiaries. The Company has reserved 2,000,000 ofits shares for issuance under the 2012 Plan. During the year ended November 30, 2012, the Company issued 440,000 options under the 2012 Plan.\nThe estimated fair value of stock options and warrants on the grant date is amortized on a straight line basis over the requisite service period. During the years ended November 30, 2012 and 2011, stock based compensation was $33,516 and $0, respectively.\nIn February 2010, the Company entered into a few option agreements for the issuance of options relating to various consulting agreements. The Company is obligated to issue to consultants in one agreement 33,750 options that vest evenly over a 3-month period of time at a $0.48 exercise price. The Company who is receiving the options has agreed to reduce their invoices by the cash required to exercise the options. These options expired in February 2011.\nIn another agreement entered into in February 2010, the Company is obligated to issue 75,000 options evenly over a 6-month period of time at a $0.48 exercise price. The Company expensed the fair value of these options ($36,000) as of August 31, 2010 to this consultant. These options also expired February 2011.\nOn August 25, 2008 and October 30, 2008, the Company issued a total of 75,000 stock options to two consultants. Of these options, 62,500 vested upon issuance and the remaining options vest March 4, 2009. These options have a three-year life and are exercisable at $0.40. These options were issued in the money as the market value of the underlying shares was $1.44 and $1.12, respectively.\nThe fair value of these options were determined to be the intrinsic value at the date of issuance, or $32,500 ($0.13 per share) and $22,500 ($0.09 per share) on August 25, 2008 and October 30, 2008, respectively. Additionally, the Company did not receive the total required option payments of $25,000 (500,000 options at $0.05).\nThe Company has expensed the entire amount due to the uncertainty of the collectability of this amount. Of the 75,000 options, there were 6,250 options that remained unexercised, however expired in May 2012.\nWarrants\nThe Company entered into private placement agreements with various individuals through November 30, 2010 for the issuance of 339,282 shares of common stock along with 339,282 warrants. The Company received the proceeds of $314,282 for these units. The warrants expire 3 years from issuance, at an exercise price of $1.60 per share. The warrants were valued using the Black-Scholes method and were recorded as additional paid in capital - warrants of $145,512. The criteria established for the valuation of these warrants were as follows: risk free interest rate- 1.25%; dividend yield\n- 0%; volatility- 185%. The warrants were issued in November 2010.\nThe Company entered into private placement agreements with various individuals for the issuance of 5,947,000 shares of common stock along with 5,947,000 warrants. The Company received the proceeds of$1,486,750 for these units. The warrants expire August 31, 2013 and have an exercise price of $0.50 per share. The warrants were valued using the Black-Scholes method and were recorded as additional paid in capital- warrants of$896,510. The criteria established for the valuation of these warrants were as follows: risk free interest rate - 0.75%; dividend yield - 0%; volatility - 235%. The warrants were issued in May 2012.\nNOTE 9 - PROVISION FOR INCOME TAXES\nDeferred income taxes are determined using the liability method for the temporary differences between the financial reporting basis and income tax basis of the Companys assets and liabilities. Deferred income taxes are measured based on the tax rates expected to be in effect when the temporary differences are included in the Companys tax return. Deferred tax assets and liabilities are recognized based on anticipated future tax consequences attributable to differences between financial statement carrying amounts of assets and liabilities and their respective tax bases.\nNOTE 10 - FAIR VALOE MEASUREMENTS\nOn January 1, 2008, the Company adopted ASC 820. ASC 820 defines fair value, provides a consistent framework for measuring fair value under generally accepted accounting principles and expands fair value financial statement disclosure requirements. ASC 820s valuation techniques are based on observable and unobservable inputs. Observable inputs reflect readily obtainable data from independent sources, while unobservable inputs reflect our market assumptions. ASC 820 classifies these inputs into the following hierarchy:\nLevel 1 inputs: Quoted prices for identical instruments in active markets.\nLevel 2 inputs: Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations whose inputs are observable or whose significant value drivers are observable.\nLevel 3 inputs: Instruments with primarily unobservable value drivers.\nNOTE 11 - CONCENTRATION OF CREDIT RISK\nOn August 31, 2011, $6,372, or 76% of the Companys accounts receivable was with three customers. In addition, there was one customer who represented approximately 66% of the revenue for the nine months ended August 31, 2011. This customer is considered a major customer of the Company.\nNOTE 12 - SALE OF VALTECH/ DISPOSITION OF SUBSIDIARY\nEffective March 7, 2012, the Company completed the acquisition of the Buildablock Assets. In connection with the completion of the acquisition, the Company effected a reverse stock split of the Companys outstanding shares of common stock, par value $0.00001, on a one-for-eight (1:8) basis (which occurred on March 7, 2012) and issued an aggregate of 8,755,484 shares of common stock effective March 7, 2012, representing 50% of the Companys outstanding shares after giving effect to the one-for-eight reverse stock split and issuance of the shares. The Buildablock Assets were valued at $10,000. Upon the closing of the transaction, Messrs. Gary Oberman and Bartek Bulzak were elected to the Companys Board of Directors, Mr. Oberman was appointed President and Chief Executive Officer and Mr. Bulzak was appointed Chief Technology Officer. Effective upon the closing of the transaction, Mr. Rene Arbic resigned as President and Chief Executive Officer of the Company. In addition, Mr. Arbic has agreed to resign from the Board within one year of the closing of the transaction.\nIn addition on April 13, 2012, the Board of Directors approved the sale ofValtech back to some or all of the original shareholders ofValtech for $1.00. This sale occurred on April 30, 2012.\nAs a result of this sale, the Company on April 13, 2012, became a development stage company, as it continues the development of its social networking platform under the Buildablock name.\nAs a result of this transaction, the Companys financial statements have been prepared with the results of operations and cash flows of this disposed entity shown as discontinued operations. All historical statements have been restated in accordance with GAAP. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE Back to Table of Contents\nNot applicable. ITEM 9A. CONTROLS AND PROCEDURES Back to Table of Contents\nEvaluation of Disclosure Controls and Procedures\nEvaluation of disclosure controls and procedures. As of November 30, 2011, the Companys chief executive officer/chief financial officer conducted an evaluation regarding the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) or 15d- 15(e) under the Exchange Act. Based upon the evaluation of these controls and procedures, our chief executive officer/chief financial officer concluded that our disclosure controls and procedures were effective as of the end of the fiscal year 2011.\nManagements Annual Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting and for the assessment of the effectiveness of those internal controls. As defined by the SEC, internal control over financial reporting is a process designed by our principal executive officer/principal financial officer, who is also the sole member of our Board of Directors, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the financial statements in accordance with U.S. generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement has assessed the effectiveness of our internal control over financial reporting as of November 30, 2011. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control- Integrated Framework. Based on our assessment and those criteria, we have concluded that our internal control over financial reporting was effective as of November 30, 2011.\nThis annual report does not include an attestation report of the companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit the Company to provide only Managements report in this annual report.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting or in other factors identified in connection with the evaluation required by paragraph (d) of Exchange Act Rules 13a-15 or 15d-15 that occurred during the fourth quarter ended November 30, 2011 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION Back to Table of Contents\nNone.\nPART III ITEM 10. DIRECTORS AND EXECUTIVE OFFICERS OF THE REGISTRANT AND CORPORATE GOVERNANCE Back to Table of Contents\nName\nAge\nTitle\nGary Oberman\nPresident and Director\nBartek Bulzak\nChief Technical Officer, Secretary and Director\nOfficers are not elected for a fixed term of office but hold office until their successors have been elected.\nGary Oberman. Prior to launching Buildablock as President and CEO, Mr. Oberman served as CEO ofWCCL Networks, a private company and an online book publisher with a large network of commercial websites and publishers of proprietary products that serve popular niches, including the self-help or self-improvement arenas. Mr. Oberman was instrumental in establishing WCCL as one of the largest providers of online self-help content for the Internet, with approximately 1,000,000 in paid Internet downloads. WCCL also owns and operates numerous forums and online radio stations in multiple markets with a network-wide affiliate program consisting of more than 19,000 affiliates, and publishes several online newsletters for each niche with over 400,000 subscribers. From 2002 to 2007, Mr. Oberman served as the COO and co-founder of Budget Conferencing, Inc., a conference calling company. As co-founder, Mr. Oberman maintained the companys operational growth and prepared for its eventual multi-million dollar sale to Premiere Conferencing, Inc., a $1.2 billion publicly-traded corporation.\nBartek Bulzak. Prior to co-founding Buildablock with Mr. Oberman, Mr. Bulzak served in the role of Chief Technical Officer for Budget Conferencing, Inc., an industry leader and pioneer of online and offline teleconferencing solutions. Mr. Bulzak has created highly innovative conferencing bridges and holds numerous patents in the field of high tech communications. In 2007, in connection with the sale of Budget Conferencing to Premiere Global, a billion dollar multinational company, Mr. Bulzak was appointed to the role of chief transition engineer where he took a lead position ensuring that Premiers acquisition of Budget Conferencing was accomplished in an efficient and cost-effective manner. Mr. Bulzaks extensive experience in the design and development of integrated VOiP multimedia communications has enabled his development of multiple online inventions including various proprietary phone-based authentication systems. Mr. Bulzak also has extensive experience in the design and development of scalable e-commerce solutions, high availability cloud-based computing and Payment Card Industry (PCI) Data Security Standards (DSS) compliance. Mr. Bulzak was co-founder of Infinite Loop Inc., a turn-key paper to PDF document management software provider which was acquired by William Resources Inc.\nWe have not adopted a code of ethics that applies to our principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions. ITEM 11. EXECUTIVE COMPENSATION Back to Table of Contents\nThe following table contains the executive compensation to the chief executive officer of the Company for the periods set forth below.\nSummary Compensation Table\nAnnual Compensation Long Term Compensation Awards\nSalary Bonus Other Annual\nCompensation Restricted Stock\nAward(s) Securities Underlying\nOptions All Other Compensation\nName and Principal Position Year ($) ($) ($) ($) ($) ($)\nRene Arbic, CEO * * * * * *\n50,770 - - - - 50,770\n80,000 - - - - 80,000\n63,744 - - - - 63,744\nAlex Kestenbaum, CFO - - - - - -\n- - - - - -\n- - - - - -\nRene Arbic became Chief Executive Officer of the Registrant on June 2, 2008. He entered into a one year employment agreement to serve as President of the Registrants subsidiary, Valtech, on October 1, 2006 which agreement has been extended and is still in full force. He receives no compensation for serving as President of the Registrant.\nAlex Kestenbaum became Chief Financial Officer, Treasurer and Secretary on June 2, 2008 of the Registrant and Chief Financial Officer of Valtech, its subsidiary. He has not entered into a contract with the Registrant and receives no compensation for acting as an officer or director of the Registrant nor for his services to Valtech.\n*Amount of compensation is unknown for period ending November 31, 2012.\nOutstanding Equity Awards at Fiscal Year-End Table.\nAs of November 30, 2012, there were no outstanding equity awards for the directors and executive officers of the Company.\nOther Compensation.\nThe Company has no plans that provide for the payment of retirement benefits, or benefits that will be paid primarily following retirement. In addition, there are no contracts, agreements, plans or arrangements that provide for payments to our executive officer in connection with the resignation, retirement or other termination of our executive officer, or a change in control of the Registrant.\nCompensation of Directors.\nThe Companys board members receive no remuneration.\nDirector Independence.\nThe Registrant does not have a nominating committee, compensation committee or executive committee of the board of directors, stock plan committee or any other committees. The Registrant currently has no independent directors. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED SHAREHOLDER MATTERS Back to Table of Contents\nThe table below discloses any person (including any group) who is known to the Registrant to be the beneficial owner of more than five (5%) percent of the Registrants common stock. As of November 30, 2011, the Registrant had 68,477,765 shares of common stock issued.\nTitle of Class Name and Address of Beneficial Owner Amount and Nature of\nBeneficial Owner (1) Percent of Class (1)\nCommon Stock Gary Oberman\n382 NE 191st Street, #83251\nMiami, Florida 33179 4,377,742 shares 16.63 %\nCommon Stock Gary Oberman\n382 NE 191st Street, #83251\nMiami, Florida 33179 4,377,742 shares 16.63 %\nCommon Stock All officers and directors as a group (2 people) 8,755,484 shares 33.26 %\n(1) Based on 26,329,383 shares outstanding, including 2,391,404 unissued shares that underlie the currently convertible portion of a debt instrument and outstanding warrants.\nNone of the above shareholders has the right to acquire additional Shares. Unless otherwise noted below, we believe that all persons named in the table have sole voting and investment power with respect to all shares of common stock beneficially owned by them. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE Back to Table of Contents\nAs of November 30, 2011, the four principal shareholders of the Company had advanced $1,874,681 to the Company for working capital purposes. These loans bear interest at an annual rate of 10% for individual amounts exceeding $150,000 (CDN$) ($141,870 (US$)). The loans have no specific terms of repayment and are unsecured. Interest expense for the years ended November 30, 2011 and 2010 were $131,402 and $120,775, respectively. Accrued interest on these loans as of November 30, 2011 and 2010 was $285,354 and $157,075, respectively.\nAs of November 30, 2010, the four principal shareholders of the Company had advanced $1,697,980 to the Company for working capital purposes. These loans bear interest at an annual rate of 10% for individual amounts exceeding $150,000 (CDN$) ($141,870 (US$)). The loans have no specific terms of repayment and are unsecured. Interest expense for the years ended November 30, 2010 and 2009 were $120,775 and $30,879, respectively. Accrued interest on these loans as of November 30, 2010 and 2009 was $157,075 and $34,597, respectively. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES Back to Table of Contents\nIndependent Public Accountants\nThe Registrants Board of Directors has appointed KBL, LLP, which firm has issued its report on our consolidated financial statements for the years ended November 30, 2011 and 2010.\nPrincipal Accounting Fees\nThe following table presents the fees for professional audit services rendered by KBL, LLP for the audit of the Registrants annual financial statements for the years ended November 30, 2011 and 2010, and fees billed for other services rendered by KBL, LLP during those periods.\nYear Ended\nNovember 30, 2012 November 30, 2011\nAudit fees (1) $ 0 $ 31,000\nAudit-related fees (2) N/A N/A\nTax fees (3) N/A N/A\nAll other fees N/A N/A\n(1) Audit fees consist of audit and review services, consents and review of documents filed with the SEC.\n(2) Audit-related fees consist of assistance and discussion concerning financial accounting and reporting standards and other accounting issues.\n(3) Tax fees consist of preparation of federal and state tax returns, review of quarterly estimated tax payments, and consultation concerning tax compliance issues.\nSection 16(a) Compliance\nSection 16(a) of the Securities and Exchange Act of 1934 requires the Registrants directors and executive officers, and persons who own beneficially more than ten percent (10%) of the Registrants Common Stock, to file reports of ownership and changes of ownership with the Securities and Exchange Commission. Copies of all filed reports are required to be furnished to the Registrant pursuant to Section 16(a). Based solely on the reports received by the Registrant and on written representations from reporting persons, the Registrant was informed that the following officers, directors and 10% sharehoders have not filed reports required under Section 16(a): Rene Arbic, Alex Kenstenbaum, Peter Varadi and Morden Lazarus . ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES Back to Table of Contents\n(a) The following documents are filed as exhibits to this report on Form 10-K or incorporated by reference herein. Any document incorporated by reference is identified by a parenthetical reference to the SEC filing that included such document.\nExhibit\nDescription\n3.01\nArticles of Incorporation. (1)\n3.02\nBylaws. (1)\n4.01\nForm of Specimen Stock Certificate for the Registrants Common Stock. (1)\n10.01\nAsset and Rights Purchase Agreement as of September 10, 2005 by and between Dr. Christina Del Pin and Voxtech Products, Inc. (1)\n10.02\nAmendment of January 25, 2006 to Asset and Rights Purchase Agreement as of September 10, 2005 by and between Dr. Christina Del Pin and Voxtech Products, Inc. (1)\n10.03\nServices Agreement of June 12, 2005 between VoxTech Products, Inc. and GetAGeek, Inc. (1)\n10.04\nDevelopment Agreement of September 26, 2005 between VoxTech Products, Inc. and GetAGeek, Inc. (1)\n10.06\nEmployment Agreement as of August 1, 2006 by and between the Registrant and Christopher LaRose. (2) (4)\n10.07\nNon-Exclusive Sales Agreement of August 14, 2006 between Voxtech Products, Inc. and Northcoast Biomedical, Inc. (2)\n10.08\nIndependent Sales Representative Agreement of September 5, 2006 by and between Voxtech Products, Inc., the Registrant and Daniel P. Elsbree. (2)\n10.09\n2008 Employees, Directors, Officers and Consultants Stock Option and Stock Award Plan (5)\n10.10\nAcquisition of Valtech Communications, Inc. (6)\n10.11\nCertificate of amendment changing name to Hipso Multimedia, Inc. (7)\n10.12\nRetainer Agreement between the Registrant and Joel Pensley, Attorney at Law dated March 13, 2008 (8)\n10.13\nRetainer Agreement between the Registrant and Antonio Moura dated March 13, 2008 (8)\n10.14\nConsulting Agreement between the Registrant and Thomas Klein dated as of January 15, 2008 (8)\n10.15\nConsulting Agreement between the Registrant and Arshad Shah dated as of January 15, 2008 (8)\n10.16\nConsulting Agreement between the Registrant and Gaetan Fontaine dated August 25, 2008 (8)\n10.17\nConsulting Agreement between the Registrant and Downshire Capital dated December 16, 2008 (8)\n10.18\nExecutive Employment Agreement Between Valtec Communications and Rene Arbic (8)\n31.1\nCertification of Ben W. Quick, Chief Executive Officer, Chief Financial Officer and Director, pursuant to Section 302 of the Sarbanes-Oxley Act of 2002. (9)\n32.1\nCertification of Ben W. Quick, Chief Executive Officer, Chief Financial Officer and Director, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. (9)\n(1) Filed as an exhibit to the registration statement on Form SB-2 and hereby incorporated by reference.\n(2) Filed as an exhibit to Amendment No. 2 to the Registration statement on Form SB-2 and hereby incorporated by reference.\n(3) Filed as an exhibit to the Annual Report on Form 10-KSB for the fiscal year ended November 30, 2006 and hereby incorporated by reference.\n(4) Management contract or compensatory plan or arrangement.\n(5) Filed as an exhibit to Form S-8 filed April 2, 2008 and hereby incorporated by reference.\n(6) Filed as an exhibit to Form 8K dated June 3, 2008 hereby incorporated by reference.\n(7) Referenced on Form 8K dated August 12, 2008 hereby incorporated by reference.\n(8) Filed as an exhibit to the Companys annual report on Form 10-K for the year ended November 30, 2008.\n(9) Filed herewith.\nSIGNATURES Back to Table of Contents\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nBuildablock Corp.\n(Registrant)\nDated: November 30, 2023 By: /s/ Ben W. Quick\nChief Executive Officer, Chief Financial Officer, and Director (Principal Executive Officer and Principal Financial Officer)\nDISCLAIMER\nThe management signing the above financial statements was not employed by the Company nor Board members for the financial periods listed above. The current Board of Directors in the best interests of the Shareholders chooses to file the necessary reporting obligations as a Voluntary Reporting Company. These financial reports are prior to the filing of the FORM 15 dated October 4, 2013, with the SEC. The information is to the best of managements knowledge and efforts at the time of the filing."
}