{
    "cik": "1346022",
    "company": "Enertopia Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-11-29",
    "period_of_report": "2022-08-31",
    "sic": "1000",
    "state_of_inc": "NV",
    "state_location": "A1",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1346022/0001062993-22-022865-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1346022/000106299322022865/form10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1346022/0001062993-22-022865.txt",
    "filename": "1346022_10K_2022_0001062993-22-022865.htm",
    "content": "Item 1. Business\nThis annual report contains forward-looking statements. These statements relate to future events or our future financial performance. In some cases, you can identify forward-looking statements by terminology such as \"may\", \"should\", \"expects\", \"plans\", \"anticipates\", \"believes\", \"estimates\", \"predicts\", \"potential\" or \"continue\" or the negative of these terms or other comparable terminology. These statements are only predictions and involve known and unknown risks, uncertainties and other factors, including the risks in the section entitled \"Risk Factors\" that may cause our or our industry's actual results, levels of activity, performance or achievements to be materially different from any future results, levels of activity, performance or achievements expressed or implied by these forward-looking statements.\nAlthough we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance or achievements. Except as required by applicable law, including the securities laws of the United States, we do not intend to update any of the forward-looking statements to conform these statements to actual results.\nOur financial statements are stated in United States Dollars (US$) and are prepared in accordance with United States Generally Accepted Accounting Principles.\nIn this annual report, unless otherwise specified, all dollar amounts are expressed in United States dollars and all references to \"common shares\" refer to the common shares in our capital stock.\nAs used in this annual report and unless otherwise indicated, the terms \"we\", \"us\", \"our\", \"our Company, \"the Company\", and \"Enertopia\" mean Enertopia Corp.\nGeneral Overview\nEnertopia Corp. was formed on November 24, 2004 under the laws of the State of Nevada and commenced operations on November 24, 2004.\nEnertopia is focused on building shareholder value through a combination of our Nevada Lithium claims and intellectual property & patents in the green technology space.\nThe Company announced the acquisition of the Clayton Valley Lithium project in August 2017. On April 29, 2022, at the Company's Special General Meeting (\"SGM\") shareholders voted in favor to sell the 160 acre Clayton Valley property. On May 4, 2022, the Company closed the Clayton valley property sale and received the remainder of $1,050,000 in cash and 3,000,000 shares of Cypress Development Corp (Note 4) on closing. The Company has been focused on using modern technology on extracting lithium and verifying or sourcing other intellectual property in the EV & green technology sectors in developing environmental solutions. In May and August 2021, it announced three provisional patents applicable to the above sectors.\nThe address of our principal executive office is #18 1873 Spall Rd., Kelowna, British Columbia V1Y 4R2. Our telephone number is (250) 870-2219. Our current location provides adequate office space for our purposes at this stage of our development.\nSummary of Recent Business\nOn October 29, 2020 the Company signed a 1% royalty agreement with respect to any future commercial lithium production from the Company's Clayton Valley, Nevada claims in exchange for $250,000. The Company has a right of first refusal to repurchase the royalty upon any proposed sale by the royalty holder to a third party.\nOn November 12, 2020 the Company signed Flathead Business Solutions to a 12 month contract for $12,000 and the issuance of 500,000 stock options valid for 5 years at $0.05 cents each.\nOn December 14, 2020 the Company signed Definitive Agreement to acquire 100% interest in United States Patent and Trademark Office (\"USPTO\") patent #6,024,086 - Solar energy collector having oval absorption tubes by issuing 1,000,000 common shares of the Company. The Company issued 1,000,000 additional common shares in escrow to be released upon the successful approval of patent pending work derived from patent #6,024,086.\nOn December 14, 2020 the Company signed Rodney Blake to a 12 month contract for the issuance of 100,000 stock options valid for 5 years at $0.05 cents each.\nOn December 14, 2020 the Company signed Albert Clark Rich to a 12 month contract for the issuance of 500,000 stock options valid for 5 years at $0.05 cents each.\nOn January 28, 2021 the Company signed Mark Snyder to a 12 month contract for $30,000 and the issuance of 2,000,000 stock options valid for 5 years at $0.14 cents each.\nOn February 4, 2021 the Company signed Barry Brooks to a 12 month contract for the issuance of 100,000 stock options valid for 5 years each at $0.18 cents each.\nOn February 5, 2021 the Company signed Paul Sandler to a 12 month contract for the issuance of 100,000 stock options valid for 5 years each at $0.18 cents each.\nOn February 5, 2021 the Company signed Bruce Shellinger to a 12 month contract for the issuance of 100,000 stock options valid for 5 years each at $0.18 cents each.\nOn February 5, 2021 the Company signed Richard Smith to a 12 month contract for the issuance of 100,000 stock options valid for 5 years each at $0.18 cents each.\nOn April 27, 2021 the Company signed Michael Cornelius to a 12 month contract for the issuance of 100,000 stock options valid for 5 years at $0.12 cents each.\nOn May 25, 2021 the Company announced the filing of provisional patent #1, known as the Enertopia Solar Booster TM\nOn May 26, 2021the Company announced the filing of provisional patent #2, known as Enertopia Heat ExtractorTM\nOn May 28, 2021, the Company issued 50,000 stock options to one of the consultants of the Company with an exercise price of $0.12 vested immediately, expiring May 28, 2026.\nOn July 29, 2021 the Company announced it had engaged Fundamental Research Corp. Fundamental Research Corp. is an issuer-paid independent research house.\nOn August 17, 2021 the Company announced the filing of provisional patent #3, known as Enertopia RainmakerTM\nOn September 1, 2021 the Company granted 500,000 options to a consultant of the Company for 5yrs at $0.08 per common share.\nOn December 6, 2021, the Company issued 500,000 stock options to one of the consultants of the Company with an exercise price of $0.07 vested immediately, expiring December 6, 2026.\nOn December 6, 2021, the Company issued 250,000 stock options to one of the consultants of the Company with an exercise price of $0.07 vested immediately, expiring December 6, 2026.\nOn December 6, 2021, the Company issued 250,000 stock options to the president of the Company with an exercise price of $0.07 vested immediately, expiring December 6, 2026.\nOn February 23, 2022, the Company accepted an offer subject to shareholder approval to sell the 160 Acre mineral property in Clayton Valley Nevada to Cypress Development (Nevada) Inc. for $1,100,000 cash with a deposit of $50,000 being paid on signing and the issuance of 3,000,000 common shares of Cypress Development Corp.\nOn February 25, 2022, the Company issued 1,000,000 shares at $0.04 to one consultant of the Company and $2,500 cash.\nOn February 25, 2022, the Company received confirmation of staking 1,760 Acres of 88 unpatented lode claims in Esmeralda county, Nevada.\nOn April 29, 2022, at the Company's SGM shareholders voted 99.12% 45,021,336 in favor, 0.46% 209,236 against and 0.42% 189,752 abstained, for the resolution to sell the 160 acre clayton valley property.\nOn May 4, 2022, the Company closed the sale of the 160 acre clayton valley property and received the remaining $1,050,000 in cash and the issuance of 3,000,000 shares of Cypress Development Corp on closing, as per the agreement.\nOn May 23, 2022 the Company announced the filing of Non provisional patent #1, known as the\nEnertopia Solar BoosterTM\nOn May 23, 2022 the Company announced the filing of Non provisional patent #2, known as Enertopia Heat ExtractorTM\nOn August 15, 2022 the Company announced the filing of Non provisional patent #3, known as Enertopia Rain MakerTM\nOn August 18, 2022 the Company issued 1,000,000 stock options to two Directors of the Company with an exercise price of $0.06 vested immediately, expiring August 18, 2027.\nOn August 18, 2022 the Company issued 1,000,000 stock options to Chief Financial Officer of the Company with an exercise price of $0.06 vested immediately, expiring August 18, 2027.\nChronological Overview of our Business over the Last Five Years\nOn October 27, 2017 we entered into a one year Investor Relations Consulting agreement with FronTier Merchant Capital Group. Terms of the agreement, FronTier Capital Group has been retained for a 12-month period at $87,000 (plus applicable sales tax) per annum plus direct expenses. The company will also grant 300,000 stock options to FronTier at an exercise price of 0.05 per share expiring 5 years from the date of grant.\nOn November 1, 2017, we closed the first tranche of a private placement of 2,600,000 units at a price of CAD$0.05 per unit for gross proceeds of CAD$130,000. Each unit consists of one common share of our Company and one non-transferable share purchase warrant, each full warrant entitling the holder to purchase one additional common share of our Company for a period of 24 months from the date of issuance, at a purchase price of $0.06.\nOn November 1, 2017, we granted 500,000 stock options to a director of the company at an exercise price of 0.05 per share expiring 5 years from the date of grant.\nOn December 8, 2017, we closed the second tranche of a private placement of 3,954,000 units at a price of CAD$0.05 per unit for gross proceeds of CAD $197,700. Each unit consists of one common share of our Company and one non-transferable share purchase warrant, each full warrant entitling the holder to purchase one additional common share of our Company for a period of 24 months from the date of issuance, at a purchase price of $0.06. A cash finder's fee for CAD $12,770 and 230,400 full broker warrants was paid to third parties. Each full broker warrant entitling the holder to purchase one additional common share of our Company for a period of 24 months from the date of issuance, at a purchase price of $0.06.\nOn December 8, 2017 we issued 240,000 common shares of our Company on the exercise of 240,000 stock options that were exercised by a director of the Company at $0.05 for $12,000 for net proceeds to the company.\nOn December 15, 2017 we paid Genesis Water Technologies (GWT) $96,465 for the second and final payment for the Second phase of the second bench test and $8,998 for the bill of materials for the bench test.\nOn January 12, 2018, we closed the final tranche of a private placement of 1,611,000 units at a price of CAD$0.05 per unit for gross proceeds of CAD$80,550. Each unit consists of one common share of the Company and one non-transferable share purchase warrant, each full warrant entitling the holder to purchase one additional common share of the Company for a period of 24 months from the date of issuance, at a purchase price of $0.06. A cash finder's fee of CAD$3,880 and 77,600 broker warrants was paid to a third party. The broker warrants have the same terms as the warrants issued as part of the unit offering.\nOn February 2, 2018 we issued 50,000 common shares of our Company on the exercise of 50,000 warrants that were exercised at $0.07 for $3,500 for net proceeds to the company.\nOn May 11, 2018, we issued 200,000 shares for gross proceeds of $12,000 from the exercise of stock options at $0.06.\nOn May 11, 2018, we closed the first tranche of a private placement of 1,746,900 units at a price of CAD$0.06 per unit for gross proceeds of CAD$104,814. Each unit consists of one common share of the Company and one non-transferable share purchase warrant, each full warrant entitling the holder to purchase one additional common share of the Company for a period of 24 months from the date of issuance, at a purchase price of $0.075. A cash finders' fee of CAD$9,281 and 144,690 full broker warrants that expire May 11, 2020 was paid to third parties. The broker warrants have the same terms as the warrants issued as part of the unit offering.\nOn May 22, 2018, we entered into an Investor Relations Consulting agreement with FronTier Flex Marketing. Terms of the agreement, FronTier Flex Marketing has been retained for a 9-month period at $66,000 (plus applicable sales taxes) plus direct expenses. The Company will also grant 300,000 stock options at an exercise price of $0.07 per share expiring 5 years from the date of grant.\nOn May 25, 2018, we closed the final tranche of a private placement of 2,470,000 units at a price of CAD$0.06 per unit for gross proceeds of CAD$148,200. Each unit consists of one common share of the Company and one non-transferable share purchase warrant, each full warrant entitling the holder to purchase one additional common share of the Company for a period of 24 months from the date of issuance, at a purchase price of $0.075. A cash finders' fee of CAD$5,820 and 70,000 full broker warrants that expire May 25, 2020 was paid to third parties. The broker warrants have the same terms as the warrants issued as part of the unit offering.\nOn July 4, 2018, the Company, after receiving 3rd party lab results that reported impurities above allowable limits for battery-grade Li2CO3, provided formal notice of termination to GWT of the commercialization agreement dated December 6, 2016 and as amended on October 9, 2017.\nOn August 31, 2018, we closed the first tranche of a private placement of 4,400,000 units at a price of CAD$0.03 per unit for gross proceeds of CAD$132,000. Each unit consists of one common share of the Company and one non-transferable share purchase warrant, each full warrant entitling the holder to purchase one additional common share of the Company for a period of 36 months from the date of issuance, at a purchase price of $0.05. A cash finders' fee of CAD$12,000 and 400,000 full broker warrants that expire August 31, 2021 was paid to third parties. The broker warrants have the same terms as the warrants issued as part of the unit offering.\nOn August 31, 2018, we issued 170,000 shares for gross proceeds of $9,000 from the exercise of 50,000 stock options at $0.06 and 120,000 stock options at $0.05 respectively.\nOn October 28, 2019, the Company signed an LOI with Eagle Plains Resources Ltd. (\"Eagle Plains\"). to earn up to 75% interest in the Pine Channel gold project in Saskatchewan, Canada (the \"Pine Channel SK Property\"). The terms of the LOI included periodic payments cash payments, exploration expenditures, as well as issuance of common shares of the Company. Upon signing the LOI, the Company issued 1,000,000 of its common shares to Eagle Plains, valued at $11,489.\nOn December 13th 2019 the Company dropped the LOI with Eagle Plains Resources Ltd.\nOn December 31st 2019 the Company dropped its Canadian Securities Listing (CSE).\nOn December 31st 2019 the Company accepted the resignation of directors Kristian Ross and Kevin Brown.\nOn February 11th 2020 the Company signed a 1% Royalty agreement with respect to any future commercial lithium production from the Company's Clayton Valley, Nevada claims in exchange for $200,000. The Company has a right of first refusal to repurchase the royalty upon any proposed sale by the royalty holder to a third party.\nOn February 25th 2020 the Company signed Mark Snyder to a one year Technology Advisory Board. Monthly contract rate of $1,000 per month and the issuance of 2,000,000 stock options valid for two years at a strike price of $0.02 per share.\nOn April 2, 2020 the Company announced it's maiden 43-101 Lithium resource report. The project this report referenced was sold on May 5, 2022.\nOn October 30th, 2020 the Company signed a 1% Royalty agreement with respect to any future commercial lithium production from the Company's Clayton Valley, Nevada claims in exchange for $250,000. The Company has a right of first refusal to repurchase the royalty upon any proposed sale by the royalty holder to a third party.\nOur Current Business\nEnertopia is engaged in the business of Lithium exploration at their Nevada claims, along with holding intellectual property & non provisional pending patents in the green technology space.\nMineral Property\nWest Tonopah Lithium\nOn February 25, 2022, the Company had 88 unpatented mineral lode claims in Esmeralda County, NV staked covering 1,760 acres of land administrated by the BLM. The property is in good standing until August 31,2023. Estimated respective yearly holding fees to the BLM $14,520 and $1,068 to Esmeralda County NV.\nEnertopia Claim name State or Federal Agency Claim number from Claim number to\nMS 1-88 BLM NV 105296951 NV 105297038\nMS 1-88 Esmeralda County, NV\nCompany completed its maiden drill program in June 2022 and further information can be found at www.enertopia.com.\nDisposed Property\nClayton Valley Lithium project On April 29, 2022, at the Company's Special General Meeting (\"SGM\") shareholders voted in favor to sell the 160 acre Clayton Valley property.\nOn May 4, 2022, the Company closed the Clayton valley property sale and received the remainder of $1,050,000 in cash and was issued 3,000,000 shares of Cypress Development Corp (Note 4) on closing. The Company also has no further potential liability from the two one percent royalties that were issued by the Company as these were transferred to Cypress Development on the sale of the asset.\nCLEAN TECHNOLOGY\nThe company continues to test off-the-shelf technology under the potential for lower capex scenarios in lithium extraction.\nNON PROVISIONAL PATENTS\nOn May 23, 2022 the Company announced the filing of Non provisional patent #1, known as the Enertopia Solar Booster TM. The Enertopia Solar Booster captures heat from the solar panels, increasing PV output enhancing production and increasing the lifetime of the PV panels.\nOn May 23, 2022 the Company announced the filing of Non provisional patent #2, known as Enertopia Heat ExtractorTM Heat Extractor Technology can be used behind the PV panels or in a glazed format on their own to create liquid temperatures to 200 degrees F.\nOn August 15, 2022 the Company announced the filing of Non provisional patent #3, known as Enertopia RainmakerTM By cooling the backside of the PV panels below the dew point the atmospheric moisture condenses on the back side of the panel and drips as rain into the tray collecting the water.\nPROVISIONAL PATENTS\nDecember 17, 2021 the Company filed an 8k on the technology acquisition that included the 100% interest in Provisional Patent filed on November 4, 2021 known as Energy Management System.\nSummary\nThe continuation of our business is dependent upon obtaining further financing, a successful program of development, and, finally, achieving a profitable level of operations. The issuance of additional equity securities by us could result in a significant dilution in the equity interests of our current stockholders. Obtaining commercial loans, assuming those loans would be available, will increase our liabilities and future cash commitments.\nThere are no assurances that we will be able to obtain further funds required for our continued operations. As noted herein, we are pursuing various financing alternatives to meet our immediate and long-term financial requirements. There can be no assurance that additional financing will be available to us when needed or, if available, that it can be obtained on commercially reasonable terms. If we are not able to obtain the additional financing on a timely basis, we will be unable to conduct our operations as planned, and we will not be able to meet our other obligations as they become due. In such event, we will be forced to scale down or perhaps even cease our operations. There is significant uncertainty as to whether we can obtain additional financing.\nEmployees\nWe primarily used the services of sub-contractors and consultants for our intended business operations. Our technical consultant is Mr. McAllister, our president, CEO and a director.\nOn November 30, 2007, Mr. McAllister was appointed as our President and on April 14, 2008 he was appointed as a director. On July 31, 2017, Mr. McAllister was appointed interim CFO. Mr. McAllister voluntarily suspended and terminated accrual of these consulting fees commencing on December 1, 2019 and continuing until such time as the Company's financial condition permits a resumption of such cost. On May 1, 2022, the Company entered into a consulting agreement with President of the Company for $9,500 per month plus goods and services tax (\"GST\") on a continuing basis. On August 16th Mr. McAllister resigned from the interim CFO position.\nThe Company has a consulting agreement with the CFO of the Company Mr. Allan Spissinger for corporate administration and consulting services for $5,000 per quarter plus goods and services tax (\"GST\") on a continuing basis.\nWe do not expect any material changes in the number of employees over the next 12-month period. We do and will continue to outsource contract employment as needed.\nResearch and Development\nWe have incurred $821,366 in research and development expenditures over the last two fiscal years. Item 1A. Risk Factors\nOur business operations are subject to a number of risks and uncertainties, including, but not limited to those set forth below:\nRisks Associated with Our Business\nOur company has no operating history and an evolving business model. which raises doubt about our ability to achieve profitability or obtain financing.\nOur Company has no operating history. Moreover, our business model is still evolving, subject to change, and will rely on the cooperation and participation of our joint venture partners. Our Company's ability to continue as a going concern is dependent upon our ability to obtain adequate financing and to reach profitable levels of operations has and we no proven history of performance, earnings or success. There can be no assurance that we will achieve profitability or obtain future financing.\nUncertain demand for mineral resources sector may cause our business plan to be unprofitable.\nDemand for mineral resources is based on the world economy and new technologies. Current lithium demand exceeds available supply due to the rapid increase in lithium batteries in portable electronics and the growing electric vehicle markets. There can be no assurance that current supply and demand factors will remain the same or that projected supply and demand factors will actually come to pass from 3rd party projections that are currently believed to be true and accurate. There can be no assurance that new disruptive technologies will replace lithium as a significant component in battery storage over time.\nConflicts of interest between our company and our directors and officers may result in a loss of business opportunity.\nOur directors and officers are not obligated to commit their full time and attention to our business and, accordingly, they may encounter a conflict of interest in allocating their time between our future operations and those of other businesses. In the course of their other business activities, they may become aware of investment and business opportunities which may be appropriate for presentation to us as well as other entities to which they owe a fiduciary duty. As a result, they may have conflicts of interest in determining to which entity a particular business opportunity should be presented. They may also in the future become affiliated with entities, engaged in business activities similar to those we intend to conduct.\nIn general, officers and directors of a corporation are required to present business opportunities to a corporation if:\nthe corporation could financially undertake the opportunity;\nthe opportunity is within the corporation's line of business; and\nit would be unfair to the corporation and its stockholders not to bring the opportunity to the attention of the corporation.\nWe plan to adopt a code of ethics that obligates our directors, officers and employees to disclose potential conflicts of interest and prohibits those persons from engaging in such transactions without our consent. Despite our intentions, conflicts of interest may nevertheless arise which may deprive our company of a business opportunity, which may impede the successful development of our business and negatively impact the value of an investment in our company.\nThe speculative nature of our business plan may result in the loss of your investment.\nOur operations are in the start-up or early stage only and are unproven. We may not be successful in implementing our business plan to become profitable. There may be less demand for our services than we anticipate. There is no assurance that our business will succeed, and you may lose your entire investment.\nChanging consumer preferences may cause our planned products to be unsuccessful in the marketplace.\nThe decision of a potential client to undergo an environmental audit or review may be based on ethical or commercial reasons. In some instances, or with certain businesses, there may be no assurance that an environmental review will result in any cost savings or increased revenues. As such, unless the ethical consideration is also a material factor, there may be no incentive for such businesses to undertake an environmental review. Changes in consumer and commercial preferences, or trends, toward or away from environmental issues may impact on businesses\" decisions to undergo environmental reviews.\nGeneral economic factors may negatively impact the market for our planned products.\nThe willingness of businesses to spend time and money on energy efficiency may be dependent upon general economic conditions; and any material downturn may reduce the likelihood of businesses incurring costs toward what some businesses may consider a discretionary expense item.\nA wide range of economic and logistical factors may negatively impact our operating results.\nOur operating results will be affected by a wide variety of factors that could materially affect revenues and profitability, including the timing and cancellation of customer orders and projects, competitive pressures on pricing, availability of personnel, and market acceptance of our services. As a result, we may experience material fluctuations in future operating results on a quarterly and annual basis which could materially affect our business, financial condition and operating results.\nChanges in environmental regulations may have an impact on our operations\nWe believe that we currently comply with existing environmental laws and regulations affecting our proposed operations. While there are no currently known proposed changes in these laws or regulations, significant changes have affected the industry in the past and additional changes may occur in the future. The company is subject to the Bureau of Land Management (\"BLM\"), State and potentially other government agencies with respect to its lithium brine business.\nOur operations may be subject to environmental laws, regulations and rules promulgated from time to time by government. In addition, certain types of operations require the submission and approval of environmental impact assessments. Environmental legislation is evolving in a manner that means stricter standards and enforcement. Fines and penalties for non-compliance are more stringent. Environmental assessments of proposed projects carry a heightened degree of responsibility for companies, directors, officers and employees. The cost of compliance with changes in governmental regulations has potential to reduce the profitability of operations. We intend to comply with all environmental regulations in the United States and Canada.\nIf we fail to effectively and efficiently advertise, the growth of our business may be compromised.\nThe future growth and profitability of our business will be dependent in part on the effectiveness and efficiency of our advertising and promotional expenditures, including our ability to (i) create greater awareness of our products, (ii) determine the appropriate creative message and media mix for future advertising expenditures, and (iii) effectively manage advertising and promotional costs in order to maintain acceptable operating margins. There can be no assurance that we will experience benefits from advertising and promotional expenditures in the future. In addition, no assurance can be given that our planned advertising and promotional expenditures will result in increased revenues, will generate levels of service and name awareness or that we will be able to manage such advertising and promotional expenditures on a cost-effective basis.\nOur success is dependent on our unproven ability to attract qualified personnel.\nWe depend on our ability to attract, retain and motivate our management team, consultants and advisors. There is strong competition for qualified technical and management personnel in the business sector, and it is expected that such competition will increase. Our planned growth will place increased demands on our existing resources and will likely require the addition of technical personnel and the development of additional expertise by existing personnel. There can be no assurance that our compensation packages will be sufficient to ensure the continued availability of qualified personnel who are necessary for the development of our business.\nWe have a limited operating history with losses, and we expect the losses to continue, which raises concerns about our ability to continue as a going concern.\nWe have generated minimal revenues since our inception and will, in all likelihood, continue to incur operating expenses with minimal revenues until we are able to successfully develop our business. Our business plan will require us to incur further expenses. We may not be able to ever become profitable. These circumstances raise concerns about our ability to continue as a going concern. We have a limited operating history and must be considered in the start-up stage.\nThere is an explanatory paragraph to their audit opinion issued in connection with the financial statements for the year ended August 31, 2022 with respect to their doubt about our ability to continue as a going concern. As discussed in Note 2 to our financial statements for the year ended August 31, 2022, we have incurred cumulative losses of $12,694,988 that raises substantial doubt about its ability to continue as a going concern. Our management has been able, thus far, to finance the operations through equity financing and cash on hand. There is no assurance that our company will be able to continue to finance our company on this basis.\nWithout additional financing to develop our business plan, our business may fail.\nBecause we have generated only minimal revenue from our business and cannot anticipate when we will be able to generate meaningful revenue from our business, we will need to raise additional funds to conduct and grow our business. We do not currently have sufficient financial resources to completely fund the development of our business plan. We anticipate that we will need to raise further financing. We do not currently have any arrangements for financing and we can provide no assurance to investors that we will be able to find such financing if required. The most likely source of future funds presently available to us is through the sale of equity capital. Any sale of share capital will result in dilution to existing security-holders.\nWe may not be able to obtain all of the licenses necessary to operate our business, which would cause our business to fail.\nOur operations require licenses and permits from various governmental authorities related to the establishment of our planned facilities, to the production, storage and distribution of our products, and to the disposal of waste. We believe that we will be able to obtain all necessary licenses and permits under applicable laws and regulations for our operations and believe we will be able to comply in all material respects with the terms of such licenses and permits. However, such licenses and permits are subject to change in various circumstances. There can be no guarantee that we will be able to obtain or maintain all necessary licenses and permits.\nIf we are unable to recruit or retain qualified personnel, it could have a material adverse effect on our operating results and stock price.\nOur success depends in large part on the continued services of our executive officers and third party relationships. We currently do not have key person insurance on these individuals. The loss of these people, especially without advance notice, could have a material adverse impact on our results of operations and our stock price. It is also very important that we be able to attract and retain highly skilled personnel, including technical personnel, to accommodate our exploration plans and to replace personnel who leave. Competition for qualified personnel can be intense, and there are a limited number of people with the requisite knowledge and experience. Under these conditions, we could be unable to recruit, train, and retain employees. If we cannot attract and retain qualified personnel, it could have a material adverse impact on our operating results and stock price.\nIf we fail to effectively manage our growth our future business results could be harmed and our managerial and operational resources may be strained.\nAs we proceed with our business plan, we expect to experience significant and rapid growth in the scope and complexity of our business. We will need to add staff to market our services, manage operations, handle sales and marketing efforts and perform finance and accounting functions. We will be required to hire a broad range of additional personnel in order to successfully advance our operations. This growth is likely to place a strain on our management and operational resources. The failure to develop and implement effective systems, or to hire and retain sufficient personnel for the performance of all of the functions necessary to effectively service and manage our potential business, or the failure to manage growth effectively, could have a materially adverse effect on our business and financial condition.\nRisks Associated with the Shares of Our Company\nBecause we do not intend to pay any dividends on our shares, investors seeking dividend income or liquidity should not purchase our shares.\nWe have not declared or paid any dividends on our shares since inception, and do not anticipate paying any such dividends for the foreseeable future. We presently do not anticipate that we will pay dividends on any of our common stock in the foreseeable future. If payment of dividends does occur at some point in the future, it would be contingent upon our revenues and earnings, if any, capital requirements, and general financial condition. The payment of any common stock dividends will be within the discretion of our Board of Directors. We presently intend to retain all earnings to implement our business plan; accordingly, we do not anticipate the declaration of any dividends for common stock in the foreseeable future.\nInvestors seeking dividend income or liquidity should not invest in our shares.\nBecause we can issue additional shares, purchasers of our shares may incur immediate dilution and may experience further dilution.\nWe are authorized to issue up to 200,000,000 shares. The board of directors of our company has the authority to cause us to issue additional shares, and to determine the rights, preferences and privileges of such shares, without consent of any of our stockholders. Consequently, our stockholders may experience more dilution in their ownership of our company in the future.\nOther Risks\nTrading on the OCTQB may be volatile and sporadic, which could depress the market price of our common stock and make it difficult for our stockholders to resell their shares.\nOur common stock is quoted on the OTCQB electronic quotation service operated by OTC Markets Group Inc. Trading in stock quoted on the OTCQB is often thin and characterized by wide fluctuations in trading prices, due to many factors that may have little to do with our operations or business prospects. This volatility could depress the market price of our common stock for reasons unrelated to operating performance. Moreover, the OTCQB is not a stock exchange, and trading of securities on the OTCQB is often more sporadic than the trading of securities listed on a quotation system like Nasdaq or a stock exchange like Amex. Accordingly, shareholders may have difficulty reselling any of the shares.\nOur stock is a penny stock. Trading of our stock may be restricted by the Securities and Exchange Commission's penny stock regulations which may limit a stockholder's ability to buy and sell our stock.\nOur stock is a penny stock. The Securities and Exchange Commission has adopted Rule 15g-9 which generally defines \"penny stock\" to be any equity security that has a market price (as defined) less than $5.00 per share or an exercise price of less than $5.00 per share, subject to certain exceptions. Our securities are covered by the penny stock rules, which impose additional sales practice requirements on broker-dealers who sell to persons other than established customers and \"accredited investors\". The term \"accredited investor\" refers generally to institutions with assets in excess of $5,000,000 or individuals with a net worth in excess of $1,000,000 or annual income exceeding $200,000 or $300,000 jointly with their spouse. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document in a form prepared by the Securities and Exchange Commission which provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction and monthly account statements showing the market value of each penny stock held in the customer's account. The bid and offer quotations, and the broker-dealer and salesperson compensation information, must be given to the customer orally or in writing prior to effecting the transaction and must be given to the customer in writing before or with the customer's confirmation. In addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from these rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchaser's written agreement to the transaction. These disclosure requirements may have the effect of reducing the level of trading activity in the secondary market for the stock that is subject to these penny stock rules. Consequently, these penny stock rules may affect the ability of broker-dealers to trade our securities. We believe that the penny stock rules discourage investor interest in and limit the marketability of our common stock.\nThe Financial Industry Regulatory Authority, or FINRA, has adopted sales practice requirements which may also limit a stockholder's ability to buy and sell our stock.\nIn addition to the \"penny stock\" rules described above, FINRA has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customer's financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nWe believe that our operations comply, in all material respects, with all applicable environmental regulations.\nOur operating partners maintain insurance coverage customary to the industry; however, we are not fully insured against all possible environmental risks.\nAny change to government regulation/administrative practices may have a negative impact on our ability to operate and our profitability.\nThe laws, regulations, policies or current administrative practices of any government body, organization or regulatory agency in the United States, Canada, or any other jurisdiction, may be changed, applied or interpreted in a manner which will fundamentally alter the ability of our company to carry on our business.\nThe actions, policies or regulations, or changes thereto, of any government body or regulatory agency, or other special interest groups, may have a detrimental effect on us. Any or all of these situations may have a negative impact on our ability to operate and/or our profitably.\nBecause we can issue additional shares, purchasers of our shares may incur immediate dilution and may experience further dilution.\nWe are authorized to issue up to 200,000,000 shares. The board of directors of our company has the authority to cause us to issue additional shares, and to determine the rights, preferences and privileges of such shares, without consent of any of our stockholders. Consequently, our stockholders may experience more dilution in their ownership of our company in the future.\nOur by-laws contain provisions indemnifying our officers and directors against all costs, charges and expenses incurred by them.\nOur by-laws contain provisions with respect to the indemnification of our officers and directors against all costs, charges and expenses, including an amount paid to settle an action or satisfy a judgment, actually and reasonably incurred by him, including an amount paid to settle an action or satisfy a judgment in a civil, criminal or administrative action or proceeding to which he is made a party by reason of his being or having been one of our directors or officers.\nInvestors' interests in our company will be diluted and investors may suffer dilution in their net book value per share if we issue additional shares or raise funds through the sale of equity securities.\nOur constating documents authorize the issuance of 200,000,000 shares of common stock with a par value of $0.001. In the event that we are required to issue any additional shares or enter into private placements to raise financing through the sale of equity securities, investors\" interests in our company will be diluted and investors may suffer dilution in their net book value per share depending on the price at which such securities are sold. If we issue any such additional shares, such issuances also will cause a reduction in the proportionate ownership and voting power of all other shareholders. Further, any such issuance may result in a change in our control.\nOur by-laws do not contain anti-takeover provisions, which could result in a change of our management and directors if there is a take-over of our company.\nWe do not currently have a shareholder rights plan or any anti-takeover provisions in our By-laws. Without any anti-takeover provisions, there is no deterrent for a take-over of our company, which may result in a change in our management and directors.\nAs a result of a majority of our directors and officers are residents of other countries other than the United States, investors may find it difficult to enforce, within the United States, any judgments obtained against our company or our directors and officers.\nOur only office space is located Kelowna, British Columbia, Canada and we do not currently maintain a permanent place of business within the United States. In addition, a majority of our directors and officers are nationals and/or residents of countries other than the United States, and all or a substantial portion of such persons\" assets are located outside the United States. As a result, it may be difficult for investors to enforce within the United States any judgments obtained against our company or our officers or directors, including judgments predicated upon the civil liability provisions of the securities laws of the United States or any state thereof.\nTrends, risks and uncertainties.\nWe have sought to identify what we believe to be the most significant risks to our business, but we cannot predict whether, or to what extent, any of such risks may be realized nor can we guarantee that we have identified all possible risks that might arise such as a black swan event. An absolute worst case scenario with sufficient potential impact to risk the future of the company as an independent business operating in its chosen markets. Significant reputational impact as a result of a major issue resulting in multiple fatalities, possibly compounded by apparently negligent management behavior; extreme adverse press coverage and viral social media linking the Company name to consumer brands, leads to a catastrophic share price fall, very significant loss of consumer confidence and inability to retain and recruit quality people. Investors should carefully consider all of such risk factors before making an investment decision with respect to our common shares. Item 1B. Unresolved Staff Comments\nAs a \"smaller reporting company\", we are not required to provide the information required by this Item. Item 2. Properties\nExecutive Offices\nThe address of our executive office is #18 1873 Spall Rd., Kelowna, British Columbia V1Y 4R2. Our main telephone number is (250) 870-2219. Our current location provides adequate office space for our purposes at this stage of our development. Item 3. Legal Proceedings\nWe know of no material, existing or pending legal proceedings against us, nor are we involved as a plaintiff in any material proceeding or pending litigation. There are no proceedings in which any of our directors, officers or affiliates, or any registered or beneficial shareholder, is an adverse party or has a material interest adverse to our Company. Item 4. (Removed and Reserved).\nPART II Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common shares are quoted on the Over-the-Counter Bulletin Board and the OTCQB quotation service under the symbol \"ENRT.\" Our CUSIP number is 29277Q 107.\nThe following quotations reflect the high and low bids for our common shares based on inter-dealer prices, without retail mark-up, mark-down or commission and may not represent actual transactions.\nThe high and low bid prices of our common stock on the OTCQB quotation service and Over-the-Counter Bulletin Board for the periods indicated below are as follows:\nQuarter Ended(1) High Low\nAugust 2022 $0.062 $0.031\nMay 2022 $0.05 $0.034\nFebruary 2022 $0.05 $0.033\nNovember 2021 $0.085 $0.051\nQuarter Ended(1) High Low\nAugust 2021 $0.12 $0.053\nMay 2021 $0.185 $0.037\nFebruary 2021 $0.285 $0.03\nNovember 2020 $0.067 $0.008\n(1) The quotations above were obtained from Yahoo Finance, reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not represent actual transactions.\nOn November 18, 2022, the last closing price for one share of our common stock as reported by the OTC Bulletin Board was $0.041. This closing price reflects an inter-dealer price, without retail mark-up, mark-down or commission, and may not represent an actual transaction.\nAs of September 6, 2022, there were 4,395 holders of record of our common stock. As of November 28, 2022, 155,116,088 common shares were issued and outstanding.\nOur common shares are issued in registered form. Nevada Agency and Trust Company, is the registered agent, 50 West Liberty Street, Suite 880, Reno, Nevada 89501 (Telephone: 775.322.0626; Facsimile: 775.322.5623).\nDividend Policy\nWe have not paid any cash dividends on our common stock and have no present intention of paying any dividends on the shares of our common stock. Our current policy is to retain earnings, if any, for use in our operations and in the development of our business. Our future dividend policy will be determined from time to time by our board of directors.\nRecent Sales of Unregistered Securities\nOn December 6, 2021 the Company issued 1,000,000 common shares and an additional 1,000,000 common shares in escrow in connection with the purchase of Hydrogen Technology (Note 6).\nOn December 17, 2021 the Company issued 5,000,000 common shares and an additional 5,000,000 common shares in escrow in connection with the Investment in JV (Note 7).\nOn February 23, 2022 the Company issued 113,388 common shares as a result of the exercise of 276,766 cashless stock options exercised at $0.02 per common share.\nOn February 28, 2022, the Company issued 1,000,000 shares to one consultant of the Company.\nEquity Compensation Plan Information\nWe have no long-term incentive plans other than the stock option plan described below:\n2014 Stock Option Plan\nOn July 15, 2014, the shareholders approved and adopted at the Annual General Meeting the Company's 2014 Stock Option Plan. The purpose of these Plan is to advance the interests of the Corporation, through the grant of Options, by providing an incentive mechanism to foster the interest of eligible persons in the success of the Corporation and its affiliates; encouraging eligible persons to remain with the Corporation or its affiliates; and attracting new Directors, Officers, Employees and Consultants.\nThis Plan shall be administered by our board. Subject to the provisions of this Plan, our board shall have the authority: to determine the Eligible Persons to whom Options are granted, to grant such Options, and to determine any terms and conditions, limitations and restrictions in respect of any particular Option grant, including but not limited to the nature and duration of the restrictions, if any, to be imposed upon the acquisition, sale or other disposition of shares of common stock acquired upon exercise of the Option, and the nature of the events and the duration of the period, if any, in which any Participant's rights in respect of an Option or shares of common stock acquired upon exercise of an Option may be forfeited; to interpret the terms of this Plan, to make all such determinations and take all such other actions in connection with the implementation, operation and administration of this Plan, and to adopt, amend and rescind such administrative guidelines and other rules and regulations relating to this Plan, as it shall from time to time deem advisable, including without limitation for the purpose of ensuring compliance with Section legislation hereof. Our board's interpretations, determinations, guidelines, rules and regulations shall be conclusive and binding upon our company, Eligible Persons, Participants and all other persons.\nThe aggregate number of Common Shares that may be reserved, allotted and issued pursuant to Options shall not exceed 17,400,000 shares of common stock, less the aggregate number of shares of common stock then reserved for issuance pursuant to any other share compensation arrangement. For greater certainty, if an Option is surrendered, terminated or expires without being exercised, the Common Shares reserved for issuance pursuant to such Option shall be available for new Options granted under this Plan.\nThe Board may amend, subject to the approval of any regulatory authority whose approval is required, suspend or terminate this Plan or any portion thereof. No such amendment, suspension or termination shall alter or impair any outstanding unexercised Options or any rights without the consent of such Participant. If this Plan is suspended or terminated, the provisions of this Plan and any administrative guidelines, rules and regulations relating to this Plan shall continue in effect for the duration of such time as any Option remains outstanding.\nAs at the date of the annual report, there were no stock options exercised except for those disclosed in the regulatory filings and in the notes to the financial statements.\nEquity Compensation Plan Information\nPlan category\nEquity compensation plans\napproved by Security\nholders Number of securities\nto be issued upon\nexercise of\noutstanding options,\nwarrants and rights Weighted-average\nexercise price of\noutstanding options,\nwarrants and rights Number of securities\nremaining available\nfor future issuance\nunder equity\ncompensation plans\n(excluding securities\nreflected in column\n(a))\n2014 Stock Option Plan approved by security holders 9,900,000 $0.08 3,801,612\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nWe did not purchase any of our shares of common stock or other securities during our fiscal year ended August 31, 2022. Item 6. Selected Financial Data\nAs a \"smaller reporting company\", we are not required to provide the information required by this Item. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with our audited financial statements and the related notes that appear elsewhere in this annual report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward looking statements. Factors that could cause or contribute to such differences include, but are not limited to; those discussed below and elsewhere in this annual report, particularly in the section Item 1A entitled Risk Factors of this annual report.\nOur audited financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles.\nPlan of Operation\nDuring the next twelve month period (beginning September 1, 2022), we intend to:\nidentify and secure sources of equity and/or debt financing for property payments;\nidentify and secure sources of equity and/or debt financing for resource acquisitions;\nidentify and secure sources of equity and/or debt financing for continued testing for Lithium technology\nidentify and secure sources of equity and/or debt financing for clean technology acquisitions;\nWe anticipate that we will incur the following operating expenses during this period:\nEstimated Funding Required During the 12 Months beginning September 1, 2022\nExpense Amount ($)\nMineral Costs 16,000\nBench Tests for Lithium Technology 60,000\nResource Acquisitions and or Drilling 300,000\nManagement Consulting Fees 180,000\nTechnology Acquisition and Development 160,000\nProfessional fees 75,000\nRent 12,000\nOther general administrative expenses 125,000\nTotal $928,000\nAs at the date of this annual report, we do not have sufficient cash on hand to finance our entire potential and estimated $928,000 cash obligation to the proposed spending for the 12 months beginning September 1, 2022. Based on our current cash position of $615,207 we anticipate that we will require approximately $312,793 in additional cash to execute our business plan. In the event that we are unable raise sufficient cash we intend to reduce our planned expenditures to accommodate our means with a view toward prioritizing revenue generating activity and fulfilling our public reporting obligations. As at the date of this registration statement we have no financing arrangements in place.\nResults of Operations for our Years Ended August 31, 2022 and 2021\nOur net income (loss) and comprehensive income (loss) for our year ended August 31, 2022, for our year ended August 31, 2021 and the changes between those periods for the respective items are summarized as follows:\nYear Ended\nAugust 31,\n$\nYear Ended\nAugust 31,\n$\nChange Between\nYear Ended\nAugust 31, 2022\nand Year Ended\nAugust 31, 2021\n$\nRevenue $ - $ - $ -\nNon-operating (Income) Expenses\n(3,540,642)\n(225,414)\n(3,315,228)\nExploration Costs\n212,348\n7,888\n204,460\nConsulting Fees\n262,880\n367,579\n(104,699)\nProfessional Fees\n111,027\n127,962\n(16,935)\nFees and dues\n57,332\n35,828\n21,504\nInvestor relations\n47,917\n49,718\n(1,801)\nResearch and Development\n808,800\n12,566\n796,234\nOther administrative costs\n65,931\n13,241\n52,690\nNet (income) loss\n(1,974,407)\n389,368\n(2,363,775)\nOur financial statements report no revenue for the years ended August 31, 2022, and August 31, 2021. Our financial statements report a net income of $1,974,407 for the year ended August 31, 2022, compared to a net loss of $389,368 for the year ended August 31, 2021. Our net income has increased by $2,363,775 for the year ended August 31, 2022, primarily due to the increase in non-operating income as a result of the sale of our Clayton Valley unpatented mining claims. Our operating costs were higher by $951,453 for August 31, 2022, compared to August 31, 2021, primarily due to research and development costs for the Hydrogen Technology project - $293,416 (August 31, 2021 - $0), Rainmaker and Soler Booster projects - $25,717 (August 31, 2021 - $0) and Battery Management Technology - $480,000 (August 31, 2021 - $0). The increase of exploration costs by $204,460 is due to increase in the exploration activities of the Company after a slowdown period due to COVID -19, the exploration costs are primarily attributable to the West Tonopah property. Overall, the operating expenses have increased due to increase in the exploration activity and addition of new research and development projects during the year ended August 31, 2022.\nLiquidity and Financial Condition\nWorking Capital\nAt\nAt\nAugust 31\nAugust 31\nCurrent assets $ 3,203,141\n$ 415,095\nCurrent liabilities\n357,855\n420,936\nWorking capital (deficit) $ 2,845,286\n$ (5,841 )\nCash Flows\nYear Ended\nAugust 31\nAugust 31,\nCash flows used in operating activities $ (970,033 )\n(408,202 )\nCash flows from investing activities\n1,099,564\n307,168\nCash flows from financing activities\n131,390\n409,792\nNet increase in cash during year $ 260,921\n$ 308,758\nOperating Activities\nNet cash used in operating activities was $970,033 for the year ended August 31, 2022 compared with cash used in operating activities of $408,202 in 2021. The increase in net cash used in operating activities is due to the overall increase in cost as described above.\nInvesting Activities\nNet cash provided in investing activities was $1,099,564 for the year ended August 31, 2022 compared to $307,168 in the same period in 2021. The net cash inflow was primarily the result of the sale of Clayton Valley, Nevada claims.\nFinancing Activities\nNet cash provided in financing activities was $131,390 for the year ended August 31, 2022, compared to $409,792 in the same period in 2021.\nContractual Obligations\nAs a \"smaller reporting company\", we are not required to provide tabular disclosure obligations.\nGoing Concern\nOur financial statements have been prepared in accordance with accounting principles generally accepted in the United States applicable to a going concern, which contemplates the realization of assets and the satisfaction of liabilities and commitments in the normal course of business. The Company had a working capital of $2,845,286 as at August 31, 2022 (2021 - deficit of $5,841). As at August 31, 2022, the Company has incurred cumulative losses of $ 12,694,988. We require additional funds to maintain our existing operations and to acquire new business assets. These conditions raise substantial doubt about our Company's ability to continue as a going concern. Management's plans in this regard are to raise equity and debt financing as required, but there is no certainty that such financing will be available or that it will be available at acceptable terms. The outcome of these matters cannot be predicted at this time and the financing environment is exceptionally difficult.\nThe Company's financial statements do not include any adjustments to reflect the future effects on the recoverability and classification of assets or the amounts and classification of liabilities that might result from the outcome of this uncertainty.\nAt this time, we cannot provide investors with any assurance that we will be able to raise sufficient funding from the sale of our common stock or through a loan from our directors to meet our obligations over the next twelve months. We do not have any arrangements in place for any future debt or equity financing.\nOff-Balance Sheet Arrangements\nWe have no significant off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to stockholders.\nCritical Accounting Policies\nThe discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with the accounting principles generally accepted in the United States of America. Preparing financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, and expenses. These estimates and assumptions are affected by management's application of accounting policies. We believe that understanding the basis and nature of the estimates and assumptions involved with the following aspects of our financial statements is critical to an understanding of our financial statements.\nMineral Properties\nAcquisition costs of mineral rights are initially capitalized as incurred while exploration and pre-extraction expenditures are expensed as incurred until such time proven or probable reserves are established for that project. Acquisition costs include cash consideration and the fair market value of shares issued on the acquisition of mineral properties.\nExpenditures relating to exploration activities are expensed as incurred and expenditures relating to pre-extraction activities are expensed as incurred until such time proven or probable reserves are established for that project, after which subsequent expenditures relating to development activities for that particular project are capitalized as incurred.\nWhere proven and probable reserves have been established, the project's capitalized expenditures are depleted over proven and probable reserves using the units-of-production method upon commencement of production. Where proven and probable reserves have not been established, the project's capitalized expenditures are depleted over the estimated extraction life using the straight-line method upon commencement of extraction. The Company has not established proven or probable reserves for any of its projects.\nThe carrying values of the mineral rights are assessed for impairment by management on a quarterly basis and as required whenever indicators of impairment exist. An impairment loss is recognized if it is determined that the carrying value is not recoverable and exceeds fair value.\nLong-Lived Assets Impairment\nIn accordance with ASC 360, \"Accounting for Impairment or Disposal of Long Lived Assets\", the carrying value of long lived assets are tested for recoverability whenever events or changes in circumstances indicate that its carrying amount may not be recoverable. The Company recognizes impairment when the sum of the expected undiscounted future cash flows is less than the carrying amount of the asset. Impairment losses, if any, are measured as the excess of the carrying amount of the asset over its estimated fair value.\nRevenue Recognition\nThe Company recognizes revenue from product sales when persuasive evidence of an arrangement exists, title to product and associated risk of loss has passed to the customer, the price is fixed or determinable, collection from the customer is reasonably assured, the Company has no further performance obligation, and returns can be reasonably estimated.\nGoing Concern\nWe have suffered recurring losses from operations. The continuation of our Company as a going concern is dependent upon our Company attaining and maintaining profitable operations and/or raising additional capital. The financial statements do not include any adjustment relating to the recovery and classification of recorded asset amounts or the amount and classification of liabilities that might be necessary should our Company discontinue operations.\nThe continuation of our business is dependent upon us raising additional financial support and/or attaining and maintaining profitable levels of internally generated revenue. The issuance of additional equity securities by us could result in a significant dilution in the equity interests of our current stockholders. Obtaining commercial loans, assuming those loans would be available, will increase our liabilities and future cash commitments. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nAs a \"smaller reporting company\", we are not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Directors of\nEnertopia Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Enertopia Corp. (the Company) as of August 31, 2022 and 2021, and the related statements of stockholders equity (deficiency), operations and comprehensive income (loss), and cash flows for the years ended August 31, 2022 and 2021, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021, and the results of its operations and its cash flows for the years ended August 31, 2022 and 2021, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the entity has suffered recurring losses from operations and has a net capital deficiency that raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\nWe have served as the Company's auditor since 2017.\n/s/ DAVIDSON & COMPANY LLP\nVancouver, Canada\nChartered Professional Accountants\nNovember 28, 2022\nENERTOPIA CORP.\nBALANCE SHEETS\n(Expressed in U.S. Dollars)\nAugust 31\nAugust 31\nASSETS\nCurrent\nCash $ 615,207\n$ 354,286\nMarketable securities (Note 4)\n2,443,750\n14,994\nAccounts receivable\n4,877\n4,552\nPrepaid expenses and deposit\n139,307\n41,263\nTotal current assets\n3,203,141\n415,095\nNon-Current\nMineral property (Note 5)\n10,500\n-\nTotal Assets\n$ 3,213,641\n$ 415,095\nLIABILITIES AND STOCKHOLDERS' EQUITY (DEFICIENCY)\nLIABILITIES\nCurrent\nAccounts payable $ 293,446\n$ 309,277\nDue to related parties (Note 8)\n64,409\n111,659\nTotal Liabilities\n357,855\n420,936\nSTOCKHOLDERS' EQUITY (DEFICIENCY)\nShare capital\nAuthorized:\n200,000,000 common shares with a par value of $0.001 per share\nIssued and outstanding:\n155,116,088 common shares at August 31, 2022 and\nAugust 31, 2021: 139,211,700\n155,117\n139,213\nAdditional paid-in capital (Note 9)\n15,395,657\n14,524,341\nDeficit\n(12,694,988 )\n(14,669,395 )\nTotal Stockholders' Equity (Deficiency)\n2,855,786\n(5,841 )\nTotal Liabilities and Stockholders' Equity (Deficiency)\n$ 3,213,641\n$ 415,095\nCommitments (Note 11)\nSubsequent Event (Note 14)\nThe accompanying notes are an integral part of these financial statements\nENERTOPIA CORP.\nSTATEMENTS OF STOCKHOLDERS' EQUITY (DEFICIENCY)\n(Expressed in U.S. Dollars)\nCOMMON STOCK\nTOTAL\nADDITIONAL\nSTOCKHOLDERS'\nSHARES\nAMOUNT\nPAID-IN\nCAPITAL\nDEFICIT\nEQUITY (DEFICIENCY)\nBalance, August 31, 2020\n128,471,700\n$ 128,473\n$ 13,758,598\n$ (14,280,027 ) $ (392,956 )\nShares issued for patent\n2,000,000\n2,000\n67,000\n-\n69,000\nPrivate placement\n3,000,000\n3,000\n177,000\n-\n180,000\nStock options granted\n-\n-\n297,691\n-\n297,691\nStock options exercised\n3,020,000\n3,020\n92,972\n-\n95,992\nWarrants exercised\n2,720,000\n2,720\n131,080\n-\n133,800\nComprehensive loss\n-\n-\n-\n(389,368 )\n(389,368 )\nBalance, August 31, 2021\n139,211,700\n$ 139,213\n$ 14,524,341\n$ (14,669,395 ) $ (5,841 )\nWarrants exercised\n2,791,000\n2,791\n128,599\n-\n131,390\nStock options granted\n-\n-\n163,130\n-\n163,130\nShares issued for hydrogen technology\n2,000,000\n2,000\n98,400\n-\n100,400\nShares issued for investment in battery management technology\n10,000,000\n10,000\n440,000\n-\n450,000\nShares issued for services\n1,000,000\n1,000\n41,300\n-\n42,300\nStock options exercised\n113,388\n(113 )\n-\n-\nComprehensive income\n-\n-\n-\n1,974,407\n1,974,407\nBalance, August 31, 2022\n155,116,088\n$\n155,117\n$\n15,395,657\n$\n(12,694,988 )\n$\n2,855,786\nThe accompanying notes are an integral part of these financial statements\nENERTOPIA CORP.\nSTATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME (LOSS)\n(Expressed in U.S. Dollars)\nYear Ended\nAugust 31\nAugust 31\nExpenses\nAccounting and audit\n$\n43,770\n$\n44,655\nBank charges and interest expense\n6,251\n1,416\nConsulting (Notes 8 and 9)\n262,880\n367,579\nMineral exploration costs\n212,348\n7,888\nFees and dues\n57,332\n35,828\nInvestor relations\n47,917\n49,718\nLegal and professional\n67,257\n83,307\nOffice and miscellaneous\n22,525\n4,708\nResearch and development (Note 6 and 7)\n808,800\n12,566\nRent\n10,404\n7,042\nTelephone\nTravel\n26,732\n-\nTotal expenses\n1,566,235\n614,782\nLoss for the year before other items\n(1,566,235 )\n(614,782 )\nOther income (expense)\nForeign exchange gain (loss)\n1,822\n(3,394 )\nGain (loss) on marketable securities\n(7,641 )\n53,488\nUnrealized loss on marketable securities\n(923,533 )\n(5,680 )\nUnrealized foreign exchange loss on marketable securities\n(62,388\n)\n-\nWrite down of assets (Note 6)\n-\n(69,000 )\nIncome from royalty granted (Note 5)\n-\n250,000\nGain from mineral property sale (Note 5)\n4,532,382\n-\nIncome (loss) and comprehensive income (loss) for the year $ 1,974,407\n$ (389,368 )\nIncome (loss) per share\n-Basic $ 0.01\n$ (0.00 )\n-Diluted\n0.01\n(0.00 )\nWeighted average number of common shares outstanding\n-Basic\n150,994,325\n134,809,673\n-Diluted\n151,955,536\n134,809,673\nThe accompanying notes are an integral part of these financial statements\nENERTOPIA CORP.\nSTATEMENTS OF CASH FLOWS\n(Expressed in U.S. Dollars)\nYear Ended\nAugust 31\nAugust 31\nCash flows used in operating activities\nNet Income/(Loss) $ 1,974,407\n$ (389,368 )\nChanges to reconcile net loss to net cash used in operating activities\nShares issued for consulting\n42,300\n-\nShares issued for battery management system\n450,000\n-\nShares issued for hydrogen technology\n100,400\n-\nStock-based compensation\n163,130\n297,691\nUnrealized loss on marketable securities\n985,921\n5,680\nLoss (gain) on disposal of marketable securities\n7,641\n(53,488 )\nWrite down of assets\n-\n69,000\nGain on mineral property sale\n(4,532,382 )\n-\nIncome from royalty grant\n-\n(250,000 )\nChange in non-cash working capital items:\nAccounts receivable\n(325 )\n(3,044 )\nPrepaid expenses and deposit\n(98,044 )\n(26,439 )\nAccounts payable and accrued liabilities\n(15,831 )\n18,941\nDue to related parties\n(47,250 )\n(77,175 )\nNet cash used in operating activities\n(970,033 )\n(408,202 )\nCash flows from investing activities\nProceeds from sale of marketable securities\n10,064\n74,873\nProceeds from mineral property sale\n1,100,000\n-\nPurchase of mineral property\n(10,500 )\n-\nPurchase of marketable securities\n-\n(17,705 )\nProceeds from sale of royalty grant\n-\n250,000\nNet cash from investing activities\n1,099,564\n307,168\nCash flows from financing activities\nNet proceeds from options exercised\n-\n95,992\nNet proceeds from warrants exercised\n131,390\n133,800\nNet proceeds from subscriptions received\n-\n180,000\nNet cash from financing activities\n131,390\n409,792\nIncrease in cash\n260,921\n308,758\nCash, beginning of year\n354,286\n45,528\nCash, end of year $ 615,207\n$ 354,286\nSupplemental cash flow information\nCash paid for interest\n$\n-\n$\n-\nCash paid for taxes\n$\n-\n$\n-\nThe accompanying notes are an integral part of these financial statements\nENERTOPIA CORP.\nNOTES TO FINANCIAL STATEMENTS\nAugust 31, 2022\n(Expressed in U.S. Dollars)\n1. ORGANIZATION\nThe Company was formed on November 24, 2004 under the laws of the State of Nevada and commenced operations on November 24, 2004. The Company is an independent natural resource company engaged in the exploration, development, and acquisition of natural resources in the United States. The Company is exploring the West Tonopah Lithium Project (\"West Tonopah\") in the Big Smokey Valley, Nevada The Company is also developing various renewable energy technologies. The Company's office is located in Kelowna, B.C., Canada.\n2. GOING CONCERN UNCERTAINTY\nThe accompanying financial statements have been prepared on a going concern basis which contemplates the realization of assets and the satisfaction of liabilities and commitments in the normal course of business for the foreseeable future. The Company had a working capital of $2,845,286 as at August 31, 2022 (2021 - $5,841 deficit). As at August 31, 2022 the Company has incurred cumulative losses of $12,694,988 that raises substantial doubt about its ability to continue as a going concern. Management has been able, thus far, to finance the operations through equity financing and cash on hand. There is no assurance that the Company will be able to continue to finance the Company on this basis.\nIn view of these conditions, the ability of the Company to continue as a going concern is in substantial doubt and dependent upon its ability to generate sufficient cash flow to meet its obligations on a timely basis, to obtain additional financing as may be required, to receive the continued support of the Company's shareholders, and ultimately to obtain successful operations. There are no assurances that we will be able to obtain further funds required for our continued operations. As noted herein, we are pursuing various financing alternatives to meet our immediate and long-term financial requirements. There can be no assurance that additional financing will be available to us when needed or, if available, that it can be obtained on commercially reasonable terms. If we are not able to obtain the additional financing on a timely basis, we will be unable to conduct our operations as planned, and we will not be able to meet our other obligations as they become due. In such event, we will be forced to scale down or perhaps even cease our operations. There is significant uncertainty as to whether we can obtain additional financing. These financial statements do not give effect to any adjustments which would be necessary should the Company be unable to continue as a going concern and therefore be required to realize its assets and discharge its liabilities in other than the normal course of business and at amounts different from those reflected in the accompanying financial statements.\nSince March 2020, several measures have been implemented in Canada, the United States, and the rest of the world in response to the impact from the novel coronavirus (\"COVID-19\"). While the impact of COVID-19 is expected to be temporary, the current circumstances are dynamic and the impact on our business operations cannot be reasonably estimated at this time. We anticipate this could have an adverse impact on our exploration plans, results of operations, financial position and cash flows.\n3. SIGNIFICANT ACCOUNTING POLICIES\na. Basis of Presentation\nThe accompanying financial statements have been prepared in accordance with U.S. generally accepted accounting principles.\nb. Mineral Properties\nAcquisition costs of mineral rights are initially capitalized as incurred while exploration and pre-extraction expenditures are expensed as incurred until such time proven or probable reserves are established for that project. Acquisition costs include cash consideration and the fair market value of shares issued on the acquisition of mineral properties.\nExpenditures relating to exploration activities are expensed as incurred and expenditures relating to pre-extraction activities are expensed as incurred until such time proven or probable reserves are established for that project, after which subsequent expenditures relating to development activities for that particular project are capitalized as incurred.\nWhere proven and probable reserves have been established, the project's capitalized expenditures are depleted over proven and probable reserves using the units-of production method upon commencement of production. Where proven and probable reserves have not been established, the project's capitalized expenditures are depleted over the estimated extraction life using the straight-line method upon commencement of extraction. The Company has not established proven or probable reserves for any of its projects.\nThe carrying values of the mineral rights are assessed for impairment by management on a quarterly basis and as required whenever indicators of impairment exist. An impairment loss is recognized if it is determined that the carrying value is not recoverable and exceeds fair value.\nc. Stock-Based Compensation\nThe Company followed Accounting Standards Codification (\"ASC\") 718, \"Compensation - Stock Compensation\", to account for its stock options and similar equity instruments issued. Accordingly, compensation costs attributable to stock options or similar equity instruments granted are measured at the fair value at the grant date, and expensed over the expected vesting period. ASC 718 requires excess tax benefits be reported as a financing cash inflow rather than as a reduction of taxes paid.\nd. Accounting Estimates\nThe preparation of financial statements in conformity with U.S GAAP requires us to make certain estimates, judgements and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Some of the Company's accounting policies require us to make subjective judgments, often as a result of the need to make estimates of matters that are inherently uncertain. These accounting policies involve critical accounting estimates because they are particularly dependent on estimates and assumptions made by management about matters that are highly uncertain at the time the accounting estimates are made. Although we have used our best estimates based on facts and circumstances available to us at the time, different estimates reasonably could have been used. Changes in the accounting estimates used by the Company are reasonably likely to occur from time to time, which may have a material effect on the presentation of financial condition and results of operations.\nThe Company reviews these estimates, judgments and assumptions periodically and reflect the effects of revisions in the period in which they are deemed to be necessary. We believe that these estimates are reasonable; however, actual results could differ from these estimates.\nSignificant accounting estimates and assumptions are used for, but not limited to:\na) The Valuation of Deferred Tax Assets\nJudgement is required in determining whether deferred tax assets are recognized on the balance sheet. The recognition of deferred tax assets requires management to assess the likelihood that the Company will generate taxable income in future periods to utilize the deferred tax assets. Due to the Company's history of losses, deferred tax assets have not been recognized by the Company.\nb) Value of Stock Options\nThe Company provides compensation benefits to its employees, directors, officers, and consultants, through a stock option plan. The fair value of each option award is estimated on the date of grant using the Black-Scholes option pricing model. Expected volatility assumption used in the model is based on the historical volatility of the Company's share price. The Company uses historical data to estimate the period of option exercises for use in the valuation model. The risk-free interest rate for the expected term of the option is based on the yields of government bonds. Changes in these assumptions, especially the share price volatility and the expected life determination could have a material impact on the Company's profit and loss for the periods presented. All estimates used in the model are based on historical data which may not be representative of future results.\nc) Fair value of shares issued in non cash transactions\nThe Company at times grants common shares in lieu of cash to certain vendors for their services to the Company. The Company recognizes the associated cost in the same period and manner as if the Company paid cash for the services provided by calculating the fair value of the share offering at the cost of the service provided.\ne. Earnings Per Share\nLoss per share is computed using the weighted average number of shares outstanding during the period. The Company has adopted ASC 220 \"Earnings Per Share\". Basic earnings per share (\"EPS\") is computed based on the weighted average number of shares of common stock outstanding during the period. Diluted EPS is computed based on the weighted average number of shares of common stock plus the effect of dilutive potential common shares outstanding during the period using the treasury stock method. Dilutive potential common shares include outstanding stock options and stock awards.\nf. Foreign Currency Translations\nThe Company's operations are located in the United States of America and has its office in Canada. The Company maintains its accounting records in U.S. Dollars, as follows:\nAt the transaction date, each asset, liability, revenue and expense that was acquired or incurred in a foreign currency is translated into U.S. dollars by the using of the exchange rate in effect at that date. At the year end, monetary assets and liabilities are translated at the exchange rate in effect at that date. The resulting foreign exchange gains and losses are included in operations.\ng. Financial Instruments\nASC 820 \"Fair Value Measurements and Disclosures\" requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. ASC 820 establishes a fair value hierarchy based on the level of independent, objective evidence surrounding the inputs used to measure fair value. A financial instrument's categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. ASC 820 prioritizes the inputs into three levels that may be used to measure fair value:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities;\nLevel 2 - Inputs other than quoted prices included within Level 1 that are either directly or indirectly observable; and\nLevel 3 - Unobservable inputs that are supported by little or no market activity, therefore requiring an entity to develop its own assumptions about the assumptions that market participants would use in pricing.\nThe Company's financial instruments consist primarily of cash, marketable securities, accounts receivable, accounts payable and due to related parties. The carrying amounts of these financial instruments approximate their fair values due to their short maturities. Cash and marketable securities are in Level 1 within the fair value hierarchy.\nThe Company's operations are in United States of America and Canada, which results in exposure to market risks from changes in foreign currency rates. The financial risk is the risk to the Company's operations that arise from fluctuations in foreign exchange rates and the degree of volatility of these rates. Currently, the Company does not use derivative instruments to reduce its exposure to foreign currency risk.\nh. Income Taxes\nThe Company has adopted ASC 740, \"Income Taxes\", which requires the Company to recognize deferred tax liabilities and assets for the expected future tax consequences of events that have been recognized in the Company's financial statements or tax returns using the liability method. Under this method, deferred tax liabilities and assets are determined based on the temporary differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect in the year in which the differences are expected to reverse. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the period that includes the enactment date. In addition, a valuation allowance is established to reduce any deferred tax asset for which it is determined that it is more likely than not that some portion of the deferred tax asset will not be realized.\ni. Long-Lived Assets Impairment\nIn accordance with ASC 360, \"Accounting for Impairment or Disposal of Long Lived Assets\", the carrying value of long lived assets are tested for recoverability whenever events or changes in circumstances indicate that its carrying amount may not be recoverable. The Company recognizes impairment when the sum of the expected undiscounted future cash flows is less than the carrying amount of the asset. Impairment losses, if any, are measured as the excess of the carrying amount of the asset over its estimated fair value.\nj. Asset Retirement Obligations\nThe Company accounts for asset retirement obligations in accordance with the provisions of ASC 410, \"Asset Retirement and Environmental Obligations\". ASC 410 requires the Company to record the fair value of an asset retirement obligation as a liability in the period in which it incurs a legal obligation associated with the retirement of tangible long-lived assets that result from the acquisition, construction, development and/or normal use of the assets. The Company does not believe it has any asset retirement obligation as of August 31, 2022 and 2021.\nk. Comprehensive Income\nThe Company has adopted ASC 220, \"Comprehensive Income\", which establishes standards for reporting and display of comprehensive income, its components and accumulated balances. The Company is disclosing this information on its Statement of Stockholders' Deficiency. Comprehensive income comprises equity except those transactions resulting from investments by owners and distributions to owners.\nl. Concentration of credit risk\nThe Company places its cash with high credit quality financial institutions.\nm. Commitments and Contingencies\nIn accordance with ASC 450-20, \"Accounting for Contingencies\", the Company records accruals for such loss contingencies when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. In the event that estimates or assumptions prove to differ from actual results, adjustments are made in subsequent periods to reflect more current information. Historically, the Company has not experienced any material claims.\nn. Research and Development\nResearch and development costs are expensed as incurred.\n4. MARKETABLE SECURITIES\nOn May 4, 2022 (\"Closing Date\"), the Company announced the sale of its Clayton Valley unpatented mining claims to Cypress Development Corporation (\"Cypress\") and as a result of this transaction received 3,000,000 shares of Cypress along with $1,100,000 in cash. The 3,000,000 shares have been restricted for trade: the Company may trade 1,000,000 of these shares six months and one day after the Closing Date and thereafter may trade 1,000,000 shares in each three-month period following the Closing Date. Given the lock up conditions, the Company believes that there is a Lack of Marketability (\"LOM\") related to these shares and thus recorded the shares using a discounting factor. The discounting factor was also used in fair valuing the shares as at the year end date of August 31, 2022. Marketable securities as at August 31, 2022 consist of the Company's investment in 3,000,000 shares of Cypress.\nAs at August 31, 2022, the movement in the Company's marketable securities is as follows:\nBalance, August 31, 2020 $ 24,354\nAdditions\n17,705\nProceeds from disposals\n(21,385 )\nUnrealized loss\n(5,680 )\nBalance, August 31, 2021 $ 14,994\nAdditions 1\n3,432,382\nUnrealized loss\n(923,533 )\nUnrealized foreign exchange loss\n(62,388\n)\nProceeds from disposal\n(10,064 )\nLoss on disposal\n(7,641 )\nBalance, August 31, 2022 $ 2,443,750\n1 Company recorded the 3,000,000 shares received from Cypress on May 4, 2022 as an investment and valued the investment using the closing rate of CAD1.63 per share and a discount rate of 10% due to LOM. The shares were subsequently revalued as at the year end date of August 31, 2022 using the closing rate of CAD1.20 per share and a discount rate of 11%, with the resulting changes in fair value being recorded as part of other profit or loss.\n5. MINERAL PROPERTY\nClayton Valley\nDuring the year ended August 31, 2017 the Company staked lode and placer claims on Bureau of Land Management lands in Esmerelda county Nevada covering approximately 160 Acres subject to adjustment. The Company has a 100% interest in the lands and is only responsible for the yearly maintenance fees to keep its 100% interest.\nOn February 11, 2020 the Company signed a 1% Royalty agreement with respect to any future commercial lithium production from the Company's Clayton Valley, Nevada claims in exchange for $200,000. The Company has a right of first refusal to repurchase the royalty upon any proposed sale by the royalty holder to a third party.\nOn October 30, 2020 the Company signed a 1% Royalty agreement with respect to any future commercial lithium production from the Company's Clayton Valley, Nevada claims in exchange for $250,000. The Company has a right of first refusal to repurchase the royalty upon any proposed sale by the royalty holder to a third party.\nOn May 4, 2022, the Company closed the Clayton Valley property sale and disposed of the unpatented mining claims for consideration consisting of $1,100,000 in cash and 3,000,000 shares of Cypress Development Corp (Note 4). The royalty liabilities from the project were transferred to Cypress Development Corp.\nWest Tonopah\nOn February 25, 2022, the Company staked 1,760 acres of unpatented mineral claims in Esmeralda County, Nevada for cash consideration of $10,500.\n6. TECHNOLOGY DEVELOPMENT\nOn December 14, 2020 the Company signed Definitive Agreement to acquire 100% interest in United States Patent and Trademark Office (\"USPTO\") patent #6,024,086 - Solar energy collector having oval absorption tubes by issuing 1,000,000 common shares of the Company. The Company issued 1,000,000 additional common shares in escrow to be released upon the successful approval of patent pending work derived from patent #6,024,086. The shares were issued at a price of $0.0345 resulting in a purchase price of $69,000. The patent has since expired and was therefore written off.\nOn May 25, 2021 the Company announced the filing of its first provisional patent application, Solar Heat Absorber technology.\nOn May 26, 2021 the Company announced the filing of its second provisional patent application, Solar PV Heat Extraction Technology.\nOn August 17, 2021 the Company announced the filing of provisional patent #3, known as Enertopia RainmakerTM.\nOn December 6, 2021, The Company entered into a Definitive Purchase and Sale Agreement to acquire 100% ownership and rights to the hydrogen technology (Hydrogen Technology). By acquiring this Hydrogen Technology, the Company is currently researching the opportunity to create process gas that can be used in commercial, industrial and mining applications by splitting the hydrogen from water via electrolysis. The Company paid $25,000 in cash and issued 1,000,000 shares in consideration for acquiring the Hydrogen Technology, with an additional 1,000,000 common shares issued and held in escrow pending successful patenting of the intellectual property. The Company has recorded the consideration for the purchase of the Hydrogen Technology as research and development expense in the statement of operations for the year ended August 31, 2022, as follows:\nConsideration for Purchase of Hydrogen Technology\nAmount $\n2,000,000 shares at FV 0.0502 (Adjusted closing price on the date of the issuance) 100,400\nCash Payment 25,000\nTotal 125,400\nThe technology is still in research and development phase and is not commercially feasible as at the year end date of August 31, 2022. The Company has incurred $168,016 as research and development costs for the hydrogen technology, in addition to the $125,400 acquisition related costs for the year ended August 31, 2022.\n7. BATTERY MANAGEMENT TECHNOLOGY (\"BMT\")\nOn December 17, 2021, The Company entered into a Definitive Purchase and Sale Agreement to acquire 100% ownership and rights to their Provisional Patent Pending BMT. The Company created a Joint Venture (\"JV\") with 51% controlling interest in CapNTrack to run the commercial and industrial operations related to the BMT and has paid $30,000 in cash and issued 10,000,000 shares (5,000,000 shares of which are in escrow) valued at $450,000 for purchase of the BMT. As at the year ended date of August 31, 2022, there have been no operations in the JV and it is a dormant entity. The BMT is still in research and development phase and has not obtained commercial or operational feasibility as at the year end date of August 31, 2022. The Company has recorded the entire consideration of $480,000 for the ownership of the BMT as research and development expense in the statement of operations for the year ended August 31, 2022.\n8. RELATED PARTY TRANSACTIONS\nFor the year ended August 31, 2022, the Company was party to the following related party transactions with key management personnel, which consists of the President and Chief Financial Officer of the Company and its Directors:\nIncurred $38,000 (2021 - $0) to the President of the Company in consulting fees. As at August 31, 2022, the accounts payable to the President of the Company was $64,409 (2021: $111,659). On December 6, 2021 the Company issued 250,000 stock options valued at $12,205 to the President of the Company (Note 10).\nIncurred $769 (2021 - $0) to the Chief Financial Officer of the Company in consulting fees. As at August 31, 2022, the accounts payable to the Chief Financial Officer of the Company was $0 (2021: $0). ). On August 18, 2022, the Company issued 1,000,000 stock options valued at $40,543 to the Chief Financial Officer of the Company (Note 10).\nOn August 18, 2022 the Company issued a total of 1,000,000 stock options valued at $40,543 to the Directors of the Company.\nOn December 6, 2021, the Company issued a total of 250,000 stock options valued at $12,205 to the president of the Company.\nThe related party transactions are recorded at the exchange amount established and agreed to between the related parties.\n9. COMMON STOCK\nOn December 14, 2020 the Company issued 1,000,000 common shares and an additional 1,000,000 common shares in escrow in connection with the signed Definitive Agreement (Note 6).\nOn January 14, 2021 the Company closed the final tranche of a private placement of 3,000,000 units at a price of $0.06 per unit for gross proceeds of $180,000. Each unit consists of one common share of the Company and one half (0.5) of a non-transferable share purchase warrant, each warrant entitling the holder to purchase one additional common share of the Company for a period of 12 months from the date of issuance at a purchase price of $0.09.\nDuring the year ended August 31, 2021 the Company also issued 3,020,000 common shares as a result of the exercise of stock options and 2,720,000 common shares as a result of the exercise of warrants (Note 10).\nDuring the year ended August 31, 2022 the Company issued 113,388 common shares as a result of the exercise of stock options and 2,791,000 common shares as a result of the exercise of warrants (Note 10).\nOn December 6, 2021 the Company issued 1,000,000 common shares and an additional 1,000,000 common shares in escrow in connection with the purchase of Hydrogen Technology (Note 6).\nOn December 17, 2021 the Company issued 5,000,000 common shares and an additional 5,000,000 common shares in escrow in connection with the purchase of JV (Note 7).\nOn February 25, 2022, the Company issued 1,000,000 shares to one consultant of the Company.\nAs at August 31, 2022 the Company had 155,116,088 shares issued and outstanding (2021 - 139,211,700).\nAs at August 31, 2022 the Company had 7,000,000 (2021 - 1,000,000) shares held in escrow.\n10. STOCK OPTIONS AND WARRANTS\nStock Options\nOn July 15, 2014, the shareholders approved and adopted at the Annual General Meeting the Company's 2014 Stock Option Plan. The purpose of these Plans is to advance the interests of the Corporation, through the grant of Options, by providing an incentive mechanism to foster the interest of eligible persons in the success of the Corporation and its affiliates; encouraging eligible persons to remain with the Corporation or its affiliates; and attracting new Directors, Officers, Employees and Consultants. The aggregate number of Common Shares that may be reserved, allotted and issued pursuant to Options shall not exceed 17,400,000 shares of common stock, less the aggregate number of shares of common stock then reserved for issuance pursuant to any other share compensation arrangement. For greater certainty, if an Option is surrendered, terminated or expires without being exercised, the Common Shares reserved for issuance pursuant to such Option shall be available for new Options granted under this Plan. The options are deemed as vested and exercisable on issuance and the maximum life of the options granted under this Plan may not exceed 5 years.\nOn November 12, 2020, the Company issued 500,000 stock options to one of the consultants of the Company with an exercise price of $0.05 vested immediately, expiring November 12, 2025.\nOn December 14, 2020, the Company issued 2,100,000 stock options to consultants and officers of the Company with an exercise price of $0.05 vested immediately, expiring December 14, 2025.\nOn January 28, 2021, the Company issued 2,000,000 stock options to one of the consultants of the Company with an exercise price of $0.14 vested immediately, expiring January 28, 2026.\nOn February 4, 2021, the Company issued 100,000 stock options to one of the consultants of the Company with an exercise price of $0.18 vested immediately, expiring February 4, 2026.\nOn February 5, 2021, the Company issued 300,000 stock options to three of the consultants of the Company with an exercise price of $0.18 vested immediately, expiring February 5, 2026.\nOn April 27, 2021, the Company issued 100,000 stock options to one of the consultants of the Company with an exercise price of $0.12 vested immediately, expiring April 27, 2026.\nOn May 28, 2021, the Company issued 50,000 stock options to one of the consultants of the Company with an exercise price of $0.12 vested immediately, expiring May 28, 2026.\nOn August 18, 2022, the Company issued 2,000,000 stock options with an exercise price of $0.06 vesting immediately, expiring August 18, 2027. 1,000,000 to the Chief Financial Officer and 500,000 each to two Directors of the Company (Note 8).\nOn December 6, 2021, the Company issued 250,000 stock options to the president of the Company with an exercise price of $0.07 vested immediately, expiring December 6, 2026.\nOn December 6, 2021, the Company issued 500,000 stock options to one of the consultants of the Company with an exercise price of $0.07 vested immediately, expiring December 6, 2026.\nOn December 6, 2021, the Company issued 250,000 stock options to one of the consultants of the Company with an exercise price of $0.07 vested immediately, expiring December 6, 2026.\nOn September 9, 2021, the Company issued 500,000 stock options to one of the consultants of the Company with an exercise price of $0.08 vested immediately, expiring September 9, 2026.\nThe fair value of the options granted during the year ended August 31, 2022 and 2021 was estimated on the date of the grant using the Black-Scholes options pricing model, with the following weighted average assumptions:\nExpected dividend yield\n0.00%\n0.00%\nExpected stock volatility\n202%\n98%\nRisk-free interest rate\n2.26%\n0.41%\nExpected life of options (years)\n5.00\n5.00\nExpected forfeiture rate\n0.00%\n0.00%\nGrant date fair value per option $ 0.05\n$ 0.06\nDuring the year ended August 31, 2022, the Company recorded $163,130 (August 31, 2021 $297,691) as stock-based compensation expense. In addition, the Company issued 113,388 (August 31, 2021: 3,293,224) common shares of the Company as a result of exercise of 226,776 cashless stock options and a total of 3,450,000 stock options expired without being exercised (August 31, 2021: 1,100,000).\nA summary of the changes in stock options is presented below:\nOptions Outstanding\nWeighted Average\nNumber of Shares\nExercise Price\nBalance, August 31, 2020\n9,320,000\n$ 0.06\nIssued\n5,150,000\n0.10\nExpired\n(1,100,000 )\n0.05\nExercised\n(3,293,224 )\n0.04\nBalance, August 31, 2021\n10,076,776\n$ 0.08\nIssued\n3,500,000\n0.07\nExpired\n(3,450,000 )\n0.07\nExercised\n(226,776 )\n0.04\nBalance, August 31, 2022\n9,900,000\n$ 0.08\nThe Company has the following options outstanding and exercisable as at August 31, 2022:\nIssue Date Expiry Date Exercise\nPrice Number of\nOptions Remaining\nLife\nOctober 27, 2017\nOctober 27, 2022\n0.05 800,000\n0.16 years\nMay 11, 2018\nMay 11, 2023\n0.06 500,000\n0.69 years\nMay 22, 2018\nMay 22, 2023\n0.07 450,000\n0.72 years\nDecember 14, 2020\nDecember 14, 2025\n0.05 2,100,000\n3.29 years\nJanuary 28, 2021\nJanuary 28, 2026\n0.14 2,000,000\n3.41 years\nFebruary 4, 2021\nFebruary 4, 2026\n0.18 100,000\n3.43 years\nFebruary 5, 2021\nFebruary 5, 2026\n0.18 300,000\n3.44 years\nApril 27, 2021\nApril 27, 2026\n0.12 100,000\n3.66 years\nMay 28, 2021\nMay 28, 2026\n0.12 50,000\n3.74 years\nSeptember 01, 2021\nSeptember 01, 2026\n0.08 500,000\n4.01 years\nDecember 06, 2021\nDecember 06, 2026\n0.07 1,000,000\n4.27 years\nAugust 18, 2022\nAugust 18, 2027\n0.06 2,000,000\n4.97 years\nBalance outstanding and exercisable\n0.08 9,900,000\n3.30 years\n*As at August 31, 2022 the market price of the Company's common shares was $0.048 per share. The intrinsic value of the stock options was $0.\nWarrants\nThere were no warrants issued during the year ended August 31, 2022.\nDuring the year ended August 31, 2021, the Company issued 1,500,000 warrants attached to units in private placements.\nA summary of warrants as at August 31, 2022 and August 31, 2021 is as follows:\nWeighted Average\nNumber of warrants\nExercise Price\nBalance, August 31, 2020\n13,236,869\n$ 0.05\nIssued\n1,500,000\n0.09\nForfeited\n(2,300,000 )\n0.05\nExercised\n(2,720,000 )\n0.04\nBalance, August 31, 2021\n9,716,869\n$ 0.05\nForfeited\n(1,952,500 )\n0.08\nExercised\n(2,791,000 )\n0.05\nBalance, August 31, 2022\n4,973,369\n$ 0.04\nThe Company has the following warrants outstanding as at August 31, 2022:\nIssue Date Expiry Date Exercise\nPrice Number of\nWarrants*\nMarch 27, 2019\nMarch 27, 2023\n0.04 4,973,369\n0.04 4,973,369\n*Each warrant entitles a holder to purchase one common share.\n11. COMMITMENTS\nThe Company has a consulting agreement with the President of the Company for corporate administration and consulting services for $9,500 per month plus goods and services tax (\"GST\") on a continuing basis.\nThe Company has a consulting agreement with the CFO of the Company for corporate administration and consulting services for $5,000 per quarter plus goods and services tax (\"GST\") on a continuing basis.\nThe Company has a rental agreement for a corporate office for CAD$1,100 per month plus GST. The agreement expires December 31, 2022.\n12. INCOME TAXES\nThe following table reconciles the income tax benefit at the U.S. Federal statutory income tax rates to income tax benefit at the Company's effective tax rates at August 31, 2022 and 2021:\nAugust 31,\nAugust 31,\nIncome (loss) before taxes $ 1,974,407\n$ (389,368 )\nStatutory tax rate\n21.0%\n21.0%\nExpected income tax expense (recovery)\n414,625\n(81,767 )\nNon-deductible items\n34,257\n62,515\nChange in enacted rates and other\n(26,649 )\n3,952\nChange in valuation allowance\n(422,234 )\n15,300\nIncome tax expense (recovery) $ -\n$ -\nDeferred taxes reflect the tax effects of temporary differences between the carrying amount of assets and liabilities for financial reporting purposes. Deferred tax assets (liabilities) at August 31, 2022 and 2021 are comprised of the following:\nAugust 31,\nAugust 31,\nNet operating loss carry forwards $ 2,154,456\n$ 2,795,131\nMarketable securities\n207,613\n2,549\nMineral property\n64,364\n50,987\nCapital loss carry forwards\n4,526\n4,526\n2,430,960\n2,853,193\nValuation allowance\n2,430,960\n2,853,193\nDeferred tax assets (liabilities) $ -\n$ -\nThe Company has net operating loss carry forwards of approximately $10,259,316 (2021 - $14,266,681) a portion of which may be carried forward up to 20 years to apply against future taxable income for US tax purposes, subject to the final determination by the taxation authority, expiring in the following years. Future tax assets have not been recognized because it is not probable that future taxable profit will be available against which the Company can utilize the benefits therefrom.\nThe expiry of the Companys non-capital tax loss carryforwards are as follows:\nExpiry Year\nAmount\n$ 1,057,783\n-\n611,284\n379,241\n4,641,005\n1,207,633\n525,587\n801,509\n650,398\n-\n384,533\nBalance - August 31, 2022 $ 10,259,316\n13. SEGMENTED INFORMATION\nThe Companys operations involve the development of natural resources and green technologies. The Company is centrally managed and its chief operating decision maker, being the CEO, uses the consolidated and other financial information to make operational decisions and to assess the performance of the Company. The Company has increased its reportable segments from one to three during the year ended August 31, 2022. The decision for this change was made keeping in mind the Companys strategic direction and the need to better report the results for each of the identified three reportable segments: Natural Resources, Technology and Corporate, none of which are revenue generating as at the year ended date of August 31, 2022.\nLong term Assets\nAmount\nUnited States of America $ 10,500\nBalance - August 31, 2022 $ 10,500\nAugust 31, 2022\nNatural\nResources\nTechnology\nCorporate\nTotal\nOperating expenses $ (212,348 ) $ (808,800 ) $ (545,087 ) $ 1,566,235\nOther income (expenses) (Note 4, 5, 6)\n4,532,382\n-\n(991,740 )\n3,540,642\nSegment income (loss) $ 4,320,034\n$ (808,800 ) $ (1,536,827 ) $ 1,974,407\nTotal Assets (Note 4, 5) $ 10,500\n$ -\n$ 3,203,141\n$ 3,213,641\n14. SUBSEQUENT EVENTS\nManagement has evaluated subsequent events through the date these financial statements were issued. Based on our evaluation the are no material events have occurred that require disclosure. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure\nThere were no disagreements related to accounting principles or practices, financial statement disclosure, internal controls or auditing scope or procedure during the two fiscal years and interim periods, including the interim period up through the date the relationship ended. Item 9A. Controls and Procedures\nManagement's Report on Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports filed under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission's rules and forms, and that such information is accumulated and communicated to our management, including our president and chief executive officer (also our principal executive officer) and our chief financial officer (also our principal financial and accounting officer) to allow for timely decisions regarding required disclosure.\nAs of August 31, 2022, the end of our fiscal year covered by this report, we carried out an evaluation, under the supervision and with the participation of our president and chief executive officer (also our principal executive officer) and our interim chief financial officer (also our principal financial and accounting officer), of the effectiveness of the design and operation of our disclosure controls and procedures. Based on the foregoing, our president and chief executive officer (also our principal executive officer) and our chief financial officer (also our principal financial and accounting officer) concluded that our disclosure controls and procedures were effective as of the end of the period covered by this annual report.\nManagement's Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Responsibility, estimates and judgments by management are required to assess the expected benefits and related costs of control procedures. The objectives of internal control include providing management with reasonable, but not absolute, assurance that assets are safeguarded against loss from unauthorized use or disposition, and that transactions are executed in accordance with management's authorization and recorded properly to permit the preparation of financial statements in conformity with accounting principles generally accepted in the United States. Our management assessed the effectiveness of our internal control over financial reporting as of August 31, 2022. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\") in Internal Control-Integrated Framework. Our management has concluded that, as of August 31, 2022, our internal control over financial reporting is effective in providing reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with US generally accepted accounting principles. Our management reviewed the results of their assessment with our Board of Directors.\nThis annual report does not include an attestation report of our Company's registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by our Company's registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit our Company to provide only management's report in this annual report.\nInherent limitations on effectiveness of controls\nInternal control over financial reporting has inherent limitations which include but is not limited to the use of independent professionals for advice and guidance, interpretation of existing and/or changing rules and principles, segregation of management duties, scale of organization, and personnel factors. Internal control over financial reporting is a process which involves human diligence and compliance and is subject to lapses in judgment and breakdowns resulting from human failures. Internal control over financial reporting also can be circumvented by collusion or improper management override. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements on a timely basis, however these inherent limitations are known features of the financial reporting process and it is possible to design into the process safeguards to reduce, though not eliminate, this risk. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control over Financial Reporting\nOn August 16, 2022, Allan Spissinger replaced Robert McAllister as the chief financial officer of the Company. There have been no other changes in our internal controls over financial reporting that occurred during the year ended August 31, 2022 that have materially or are reasonably likely to materially affect, our internal controls over financial reporting. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nAll directors of our company hold office until the next annual meeting of the security holders or until their successors have been elected and qualified. The officers of our company are appointed by our board of directors and hold office until their death, resignation or removal from office. Our directors and executive officers, their ages, positions held, and duration as such, are as follows:\nName\nPosition Held with our Company\nAge Date First Elected\nOr Appointed\nRobert McAllister President, Chief Executive Officer, Chief Financial Officer and Director November 2007\nApril 14, 2008\nAllan Spissinger Chief Financial Officer and Director August 16, 2022\nNote Robert McAllister resigned from interim Chief Financial Officer on August 16, 2022\nBusiness Experience\nThe following is a brief account of the education and business experience of each director and executive officer during at least the past five years, indicating each person's principal occupation during the period, and the name and principal business of the organization by which he was employed.\nRobert McAllister, President, Director\nMr. McAllister was appointed as president in November 2007 and director in April 2008.\nMr. McAllister has devoted approximately 90% of his professional time to the business and intends to continue to devote this amount of time in the future, or more as required.\nMr. McAllister has been a corporate consultant since 2004. He has also provided and written business and investment articles from 1996 to 2006 in various North American publications. Mr. McAllister is a resource investment entrepreneur with over 20 years of experience in resource sector evaluations and commodity cycle analysis.\nAllan Spissinger, Chief Financial Officer\nMr. Spissinger was appointed as Chief Financial Officer in August 2022.\nMr. Spissinger worked within the Informational Technologies (IT) sector for over a decade; specializing in corporate IT infrastructure and software development projects. Mr. Spissinger joined the audit and assurance department at PricewaterhouseCoopers (PwC) where he obtained his Chartered Professional Accountant (CPA) designation focusing on financial reporting and Sarbanes-Oxley (SOX) compliance in the following sectors: resources, manufacturing and technologies. Mr. Spissinger's positive mentorship, excellent communication and extensive leadership skills have enabled him to successfully manage a variety of private and public businesses for over 20 years.\nFamily Relationships\nThere are no family relationships between any of our directors, executive officers and proposed directors or executive officers.\nInvolvement in Certain Legal Proceedings\nNone of our directors, executive officers, promoters or control persons has been involved in any of the following events during the past five years:\n1. A petition under the Federal bankruptcy laws or any state insolvency law was filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two years before the time of such filing;\n2. Such person was convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. Such person was the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\ni. Acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity\nii. Engaging in any type of business practice; or\niii. Engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n4. Such person was the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in paragraph (f)(3)(i) of this section, or to be associated with persons engaged in any such activity;\n5. Such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6. Such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7. Such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\ni. Any Federal or State securities or commodities law or regulation; or\nii. Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\niii. Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCompliance with Section 16(a) of the Securities Exchange Act of 1934\nSection 16(a) of the Securities Exchange Act of 1934 requires our executive officers and directors and persons who own more than 10% of our common stock to file with the Securities and Exchange Commission initial statements of beneficial ownership, reports of changes in ownership and annual reports concerning their ownership of our common stock and other equity securities, on Forms 3, 4 and 5 respectively. Executive officers, directors and greater than 10% shareholders are required by the SEC regulations to furnish us with copies of all Section 16(a) reports that they file.\nBased solely on our review of the copies of such forms received by us, or written representations from certain reporting persons, we believe that during fiscal year ended August 31, 2022, all filing requirements applicable to our officers, directors and greater than 10% percent beneficial owners were complied with.\nCode of Ethics\nWe adopted a Code of Ethics applicable to our senior financial officers and certain other finance executives, which is a \"code of ethics\" as defined by applicable rules of the SEC. Our Code of Ethics is attached as an exhibit to our Annual Report on Form 10-KSB filed on November 29, 2007. If we make any amendments to our Code of Ethics other than technical, administrative, or other non-substantive amendments, or grant any waivers, including implicit waivers, from a provision of our Code of Ethics to our chief executive officer, chief financial officer, or certain other finance executives, we will disclose the nature of the amendment or waiver, its effective date and to whom it applies in a Current Report on Form 8-K filed with the SEC.\nBoard and Committee Meetings\nOur board of directors held no formal meetings during the year ended August 31, 2022. All proceedings of the board of directors were conducted by resolutions consented to in writing by all the directors and filed with the minutes of the proceedings of the directors. Such resolutions consented to in writing by the directors entitled to vote on that resolution at a meeting of the directors are, according to the Nevada General Corporate Law and our Bylaws, as valid and effective as if they had been passed at a meeting of the directors duly called and held.\nNomination Process\nAs of August 31, 2022, we did not affect any material changes to the procedures by which our shareholders may recommend nominees to our board of directors. Our board of directors does not have a policy with regards to the consideration of any director candidates recommended by our shareholders. Our board of directors has determined that it is in the best position to evaluate our Company's requirements as well as the qualifications of each candidate when the board considers a nominee for a position on our board of directors. If shareholders wish to recommend candidates directly to our board, they may do so by sending communications to the president of our Company at the address on the cover of this annual report.\nAudit Committee and Audit Committee Financial Expert\nCurrently our audit committee consists of our entire board of directors. We currently do not have nominating, compensation committees or committees performing similar functions. There has not been any defined policy or procedure requirements for shareholders to submit recommendations or nomination for directors.\nOur board of directors has determined that it does not have a member of its board of directors (audit committee) that qualifies as an \"audit committee financial expert\" as defined in Item 407(d)(5)(ii) of Regulation S-K, and is \"independent\" as the term is used in Item 7(d)(3)(iv) of Schedule 14A under the Securities Exchange Act of 1934, as amended.\nWe believe that the members of our board of directors are collectively capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. We believe that retaining an independent director who would qualify as an \"audit committee financial expert\" would be overly costly and burdensome and is not warranted in our circumstances given the early stages of our development and the fact that we have not generated any material revenues to date. In addition, we currently do not have nominating, compensation or audit committees or committees performing similar functions nor do we have a written nominating, compensation or audit committee charter. Our board of directors does not believe that it is necessary to have such committees because it believes the functions of such committees can be adequately performed by our board of directors. Item 11. Executive Compensation\nThe particulars of the compensation paid to the following persons:\n(a) our principal executive officer;\n(b) each of our two most highly compensated executive officers who were serving as executive officers at the end of the years ended August 31, 2022 and 2021; and\n(c) up to two additional individuals for whom disclosure would have been provided under (b) but for the fact that the individual was not serving as our executive officer at the end of the years ended August 31, 2022 and 2021\nwho we will collectively refer to as the named executive officers of our Company, are set out in the following summary compensation table, except that no disclosure is provided for any named executive officer, other than our principal executive officers, whose total compensation did not exceed $100,000 for the respective fiscal year:\nSUMMARY COMPENSATION TABLE\nName\nand Principal\nPosition\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n(#)\nNon-Equity\nIncentive\nPlan\nCompensa-\ntion\n($)\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nAll\nOther\nCompensa-\ntion\n($)\nTotal\n($)\nRobert\nMcAllister(1)\nPresident and Director\n$38,000\n- -\n- -\n- 250,000\n500,000 -\n- -\n- -\n- $38,000\n-\nAllan Spissinger,(2) CFO $796 - - 1,000,000 - - - $796\n(1) On November 30, 2007, Mr. McAllister was appointed as our President and on April 14, 2008 he was appointed as a director. On July 31, 2017, Mr. McAllister was appointed interim CFO. Mr. McAllister voluntarily suspended and terminated accrual of these consulting fees commencing on December 1, 2019 and continuing until such time as the Company's financial condition permits a resumption of such cost. On May 1, 2022, the Company entered into a consulting agreement with President of the Company for $9,500 per month plus goods and services tax (\"GST\") on a continuing basis. On August 16th Mr. McAllister resigned from the interim CFO position.\n(2) On August 16, 2022, Mr. Spissinger was appointed as our CFO.\nEmployment/Consulting Agreements\nJuly 1, 2017, a consulting contract was entered into with remuneration set at $3,500 per month plus GST. We may terminate this agreement without prior notice based on a number of conditions. Mr. McAllister may terminate the agreement at any time by giving 30 days written notice of his intention to do so. Mr. McAllister voluntarily suspended and terminated accrual of these consulting fees commencing on December 1, 2019. On May 1, 2022, the Company entered into a consulting agreement with President of the Company for $9,500 per month plus goods and services tax (\"GST\") on a continuing basis.\nOther than as set out in this annual report on Form 10-K we have not entered into any employment or consulting agreements with any of our current officers, directors or employees.\nGrants of Plan-Based Awards Table\nOn October 23, 2015, the Company granted 1,850,000 stock options to directors, officers and consultant of the Company with an exercise price of $0.05 vested immediately, expiring October 23, 2020. 50,000 stock options were cancelled.\nOn February 4, 2016, the Company granted 100,000 stock options to Advisor of the Board of the Company with an exercise price of $0.05 vested immediately, expiring February 4, 2021.\nOn January 20, 2017, the Company granted 1,535,000 stock options to directors, officers and consultant of the Company with an exercise price of $0.07 vested immediately, expiring January 20, 2022.\nOn November 1, 2017, the Company granted 800,000 stock options to a director and consultant of the Company with an exercise price of $0.05, expiring November 2, 2022.\nOn May 11, 2018, the Company granted 535,000 stock options to a director and consultant of the Company with an exercise price of $0.06, expiring May 11, 2023.\nOn November 12, 2020 the Company signed Flathead Business Solutions to a 12 month contract for $12,000 and the issuance of 500,000 stock options valid for 5 years at $0.05 cents each.\nOn December 14, 2020 the Company signed Rodney Blake to a 12 month contract for the issuance of 100,000 stock options valid for 5 years at $0.05 cents each.\nOn December 14, 2020 the Company signed Albert Clark Rich to a 12 month contract for the issuance of 500,000 stock options valid for 5 years at $0.05 cents each.\nOn December 14, 2020 the Company issued 500,000 stock options to the CEO of the Company valid for 5 years at $0.05 cents each.\nOn December 14, 2020 the Company issued 1,000,000 stock options to a Consultant of the Company valid for 5 years at $0.05 cents each.\nOn February 25, 2020, the Company granted 2,000,000 stock options to a consultant of the Company with an exercise price of $0.02, expiring February 25, 2022.\nOn January 28, 2021 the Company signed Mark Snyder to a 12 month contract for $30,000 and the issuance of 2,000,000 stock options valid for 5 years at $0.14 cents each.\nOn February 4, 2021 the Company signed Barry Brooks to a 12 month contract for the issuance of 100,000 stock options valid for 5 years each at $0.18 cents each.\nOn February 5, 2021 the Company signed Paul Sandler to a 12 month contract for the issuance of 100,000 stock options valid for 5 years each at $0.18 cents each.\nOn February 5, 2021 the Company signed Bruce Shellinger to a 12 month contract for the issuance of 100,000 stock options valid for 5 years each at $0.18 cents each.\nOn February 5, 2021 the Company signed Richard Smith to a 12 month contract for the issuance of 100,000 stock options valid for 5 years each at $0.18 cents each.\nOn April 27, 2021 the Company signed Michael Cornelius to a 12 month contract for the issuance of 100,000 stock options valid for 5 years at $0.12 cents each.\nOn May 28, 2021, the Company issued 50,000 stock options to one of the consultants of the Company with an exercise price of $0.12 vested immediately, expiring May 28, 2026.\nOn June 8, 2021 the Company issued 100,000 common shares as a result of the exercise of 100,000 options exercised at $0.07 per common share.\nOn September 9, 2021, the Company issued 500,000 stock options to one of the consultants of the Company with an exercise price of $0.08 vested immediately, expiring September 9, 2026.\nOn December 6, 2021, the Company issued 250,000 stock options to one director of the Company with an exercise price of $0.07 vested immediately, expiring December 6, 2026.\nOn December 6, 2021, the Company issued 500,000 stock options to one of the consultants of the Company with an exercise price of $0.07 vested immediately, expiring December 6, 2026.\nOn December 6, 2021, the Company issued 250,000 stock options to one of the consultants of the Company with an exercise price of $0.07 vested immediately, expiring December 6, 2026.\nOn August 18, 2022, the Company issued 2,000,000 stock options with an exercise price of $0.06 vesting immediately, expiring August 18, 2027. 1,000,000 to the Chief Financial Officer and 500,000 each to two directors of the Company (Note 8).\nOutstanding Equity Awards at Fiscal Year End\nThe particulars of unexercised options, stock that has not vested and equity incentive plan awards for our named executive officers are set out in the following table:\nOUTSTANDING EQUITY AWARDS AT FISCAL YEAR-END\nOPTION AWARDS STOCK AWARDS\nName\n(a)\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions\n(#)\nExercisable\n(b)\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions\n(#)\nUnexercisable\n(c)\nEquity\nIncentive\nPlan\nAwards:\nNumber of\nSecurities\nUnderlying\nUnexercised\nUnearned\nOptions\n(#)\n(d)\nOption\nExercise\nPrice\n($)\n(e)\nOption\nExpiration\nDate\n(f)\nNumber\nof\nShares\nor Units\nof\nStock\nThat\nHave\nNot\nVested\n(#)\n(g)\nMarket\nValue of\nShares\nor Units\nof Stock\nThat\nHave\nNot\nVested\n($)\n(h) Equity\nIncentive\nPlan\nAwards:\nNumber\nof\nUnearned\nShares,\nUnits or\nOther\nRights\nThat\nHave Not\nVested\n(#)\n(i) Equity\nIncentive\nPlan\nAwards:\nMarket or\nPayout\nValue of\nUnearned\nShares,\nUnits or\nOther\nRights\nThat Have\nNot Vested\n(#)\n(j)\nRobert\nMcAllister 500,000\n250,000\n$0.05\n$0.07\n2025/12/14\n2026/12/06\nAllan Spissinger 1,000,000\n$0.06 2027/08/18\nKevin Brown 250,000\n500,000\n$0.06\n$0.06 2023/05/11\n2027/08/18\nJohn Nelson 500,000\n$0.06 2027/08/18\nOption Exercises\nDuring our fiscal year ended August 31, 2022, a total of 226,776 (August 31, 2021 - 2,720,000) stock options were exercised resulting in issuance of 113,388 common shares on a cashless basis, valued at $0.02 per each stock option exercised.\nCompensation of Directors\nExcept as otherwise disclosed, we do not have any agreements for compensating our directors for their services in their capacity as directors, although such directors are expected in the future to receive stock options to purchase shares of our common stock as awarded by our board of directors.\nPension, Retirement or Similar Benefit Plans\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. We have no material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that stock options may be granted at the discretion of the board of directors or a committee thereof.\nIndebtedness of Directors, Senior Officers, Executive Officers and Other Management\nNone of our directors or executive officers or any associate or affiliate of our Company during the last two fiscal years is or has been indebted to our Company by way of guarantee, support agreement, letter of credit or other similar agreement or understanding currently outstanding. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth, as of November 28, 2022, certain information with respect to the beneficial ownership of our common shares by each shareholder known by us to be the beneficial owner of more than 5% of our common shares, as well as by each of our current directors and executive officers as a group. Each person has sole voting and investment power with respect to the shares of common stock, except as otherwise indicated. Beneficial ownership consists of a direct interest in the shares of common stock, except as otherwise indicated.\nName and Address of Beneficial Owner Amount and\nNature of\nBeneficial\nOwnership Percentage\nof Class(1)\nRobert McAllister\nKelowna, British Columbia, Canada 7,755,000(1) 4.99%\nAllan Spissinger\nLangley, British Columbia, Canada 1,000,000(2) 0.64%\nKevin Brown\nKelowna, British Columbia, Canada 1,050,000(3) 0.67%\nJohn Nelson\nCalgary, Alberta, Canada 750,000(4) 0.48%\n(1)\nUnder Rule 13d-3, a beneficial owner of a security includes any person who, directly or indirectly, through any contract, arrangement, understanding, relationship, or otherwise has or shares: (i) voting power, which includes the power to vote, or to direct the voting of shares; and (ii) investment power, which includes the power to dispose or direct the disposition of shares. Certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire the shares (for example, upon exercise of an option) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares outstanding is deemed to include the amount of shares beneficially owned by such person (and only such person) by reason of these acquisition rights. As a result, the percentage of outstanding shares of any person as shown in this table does not necessarily reflect the persons actual ownership or voting power with respect to the number of shares of common stock actually outstanding on November 28, 2022. As of November 28, 2022, there were 155,116,088 shares of our companys common stock issued and outstanding.\n(1) Includes:\n1. 500,000 Options which are exercisable at $0.05 into common shares;\n2. 250,000 Options which are exercisable at $0.07 into common shares; and\n3. 7,005,000 common shares.\n(2) Includes:\n1. 1,000,000 Options which are exercisable at $0.06 into common shares;\n(3) Includes:\n1. 500,000 Options which are exercisable at $0.06 into common shares;\n2. 250,000 Options which are exercisable at $0.06 into common shares; and\n3. 300,000 common shares.\n(4) Includes:\n1. 500,000 Options which are exercisable at $0.06 into common shares; and\n2. 250,000 common shares.\nChanges in Control\nWe are unaware of any contract or other arrangement the operation of which may at a subsequent date result in a change in control of our company. Item 13. Certain Relationships and Related Transactions, and Director Independence\nExcept as disclosed herein, no director, executive officer, shareholder holding at least 5% of shares of our common stock, or any family member thereof, had any material interest, direct or indirect, in any transaction, or proposed transaction in which the amount involved in the transaction exceeded or exceeds the lesser of $120,000 or one percent of the average of our total assets at the year-end for the last two completed fiscal years.\nFor the year ended August 31, 2022, the Company was party to the following related party transactions:\nIncurred $38,000 (2021 - $10,500) to the President of the Company in consulting fees. As at August 31, 2022, the accounts payable to the President of the Company was $64,409 (2021: $111,659). On December 6, 2021 the Company issued 250,000 stock options valued at $12,205 to the President of the Company (Note 10).\nIncurred $769 (2021 - $0) to the Chief Financial Officer of the Company in consulting fees. As at August 31, 2022, the accounts payable to the Chief Financial Officer of the Company was $0 (2021: $0). On August 18, 2022, the Company issued 1,000,000 stock options valued at $40,543 to the Chief Financial Officer of the Company (Note 10).\nOn August 18, 2021, the Company issued a total of 1,000,000 stock options valued at $40,543 to the directors of the Company.\nThe related party transactions are recorded at the exchange amount established and agreed to between the related parties.\nDirector Independence\nWe currently act with three directors, Kevin Brown, John Nelson who qualify as independent directors and Robert McAllister, who does not qualify as an \"independent director\" as defined in NASDAQ Marketplace Rule 4200(a)(15).\nWe currently have an audit committee, but. there has not been any defined policy or procedure requirements for shareholders to submit recommendations or nomination for directors.\nOur board of directors has determined that it does not have a member of its audit committee who qualifies as an \"audit committee financial expert\" as defined in as defined in Item 407(d)(5)(ii) of Regulation S-K.\nFrom inception to present date, we believe that the members of our audit committee and the board of directors have been and are collectively capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting.\nWe do not have a standing compensation or nominating committee, but our entire board of directors act in such capacity. We believe that our directors are capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. Our directors do not believe that it is necessary to have an audit committee because we believe that the functions of an audit committee can be adequately performed by the board of directors. In addition, we believe that retaining additional independent directors who would qualify as an \"audit committee financial expert\" would be overly costly and burdensome and is not warranted in our circumstances given the early stages of our development. Item 14. Principal Accounting Fees and Services\nThe aggregate fees billed for the most recently completed fiscal year ended August 31, 2022 and for fiscal year ended August 31, 2021 for professional services rendered by the principal accountant for the audit of our annual financial statements and review of the financial statements included in our quarterly reports on Form 10-Q and services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for these fiscal periods were as follows:\nYear Ended\nAugust 31, 2022 August 31, 2021\nAudit Fees 31,354 36,048\nAudit Related Fees - -\nTax Fees - -\nAll Other Fees - -\nTotal 31,354 36,048\nAudit Fees. Audit fees consist of fees billed for professional services rendered for the audits of our financial statements, reviews of our interim financial statements included in quarterly reports, services performed in connection with filings with the Securities and Exchange Commission and related comfort letters and other services that are normally provided by Davidson & Company LLP for fiscal year ended August 31, 2022.\nAudit related Fees. There were no audit related fees paid to Davidson & Company LLP for the fiscal year ended August 31, 2022 or for the fiscal year ended August 31, 2021.\nTax Fees. Tax fees consist of fees billed for professional services for tax compliance, tax advice and tax planning. These services include assistance regarding federal, state and local tax compliance and consultation in connection with various transactions and acquisitions. For the fiscal years ended August 31, 2022 and August 31, 2021, we did not use Davidson & Company LLP for non-audit professional services or preparation of corporate tax returns.\nWe do not use Davidson & Company LLP, for financial information system design and implementation. These services, which include designing or implementing a system that aggregates source data underlying the financial statements or generates information that is significant to our financial statements, are provided internally or by other service providers. We do not engage Davidson & Company LLP to provide compliance outsourcing services.\nEffective May 6, 2003, the Securities and Exchange Commission adopted rules that require that before our independent auditors are engaged by us to render any auditing or permitted non-audit related service, the engagement be:\napproved by our audit committee (which consists of our entire board of directors); or\nentered into pursuant to pre-approval policies and procedures established by the board of directors, provided the policies and procedures are detailed as to the particular service, the board of directors is informed of each service, and such policies and procedures do not include delegation of the board of directors' responsibilities to management.\nOur board of directors pre-approves all services provided by our independent auditors. All of the above services and fees were reviewed and approved by the board of directors either before or after the respective services were rendered.\nOur board of directors has considered the nature and amount of fees billed by our independent auditors and believes that the provision of services for activities unrelated to the audit is compatible with maintaining our independent auditors' independence.\nPART IV Item 15. Exhibits, Financial Statement Schedules\n(a) Financial Statements\n(1) Financial statements for our Company are listed in the index under Item 8 of this document\n(2) All financial statement schedules are omitted because they are not applicable, not material or the required information is shown in the financial statements or notes thereto.\n(b) Exhibits\nExhibit Description\nNo.\n3.1 Articles of Incorporation of Enertopia Corp. dated November 22, 2004 (incorporated by reference to our Registration Statement on Form SB-2 filed January 10, 2006 as Exhibit 3.1).\n3.2 Certificate of Amendment filed with the Nevada Secretary of State on February 22, 2010 (incorporated by reference to Exhibit 3.02 of our Current Report on Form 8-K filed March 4, 2010).\n3.3 Amended and Restated Bylaws (incorporated by reference to Exhibit 3.1 of our Current Report on Form 8-K filed December 18, 2009).\n10.1 Agreement dated December 14, 2020 with Al Rich (incorporated by reference to Exhibit 10.1 of our Current Report on Form 8-K filed December 15, 2020).\n10.2* Consulting Agreement dated December 6, 2021 with Terry Gaylon.\n10.3* Hydrogen Asset Purchase Agreement dated December 6, 2021\n10.4* Asset Purchase Agreement dated December 17, 2021 with Paul Sandler and Mark Snyder dated December 17, 2021.\n10.5 Asset Sale Agreement with Cypress Development Corp dated February 23, 2022 (incorporated by reference to Exhibit 10.1 our Current Report on Form 8-K filed February 28, 2022).\n10.6 Consulting Agreement with Mr. Robert McAllister dated May 1, 2022 (incorporated by reference to Exhibit 10.1 of our Current Report on Form 8-K filed May 4, 2022).\n10.7 Consulting Agreement with Mr. Allan Spissinger dated August 16, 2022 (incorporated by reference to Exhibit 10.1 of our Current Report on Form 8-K filed August 19, 2022).\n14.1 Code of Ethics (incorporated by reference by from our annual report on Form 10-KSB filed on November 29, 2007).\n31.1* Certification pursuant to Rule 13a-14 and Rule 15d-14(a), promulgated under the Securities and Exchange Act of 1934, as amended (Chief Executive Officer).\n31.2* Certification pursuant to Rule 13a-14 and Rule 15d-14(a), promulgated under the Securities and Exchange Act of 1934, as amended (Chief Financial Officer).\n32.1* Certification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (Chief Executive Officer).\n32.2* Certification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (Chief Financial Officer).\n101.INS Inline XBRL Instance Document-the instance document does not appear in the Interactive Data File as its XBRL tags are embedded within the Inline XBRL document\n101.SCH Inline XBRL Taxonomy Extension Schema Document\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n* Filed herewith.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nENERTOPIA CORP.\nBy: /s/ Robert McAllister\nRobert McAllister\nPresident and Director\nPrincipal Executive Officer\nDate: November 28, 2022.\nBy: /s/ Allan Spissinger\nAllan Spissinger CPA, CA\nChief Financial Officer\nPrincipal Financial Officer and Principal Accounting Officer\nDate: November 28, 2022.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nBy: /s/ Robert McAllister\nRobert McAllister\nPresident and Director\nPrincipal Executive Officer\nDate: November 28, 2022.\nBy: /s/ Allan Spissinger\nAllan Spissinger CPA, CA\nChief Financial Officer\nPrincipal Financial Officer and Principal Accounting Officer\nDate: November 28, 2022."
}