{
    "cik": "1350593",
    "company": "Mueller Water Products, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-14",
    "period_of_report": "2023-09-30",
    "sic": "3490",
    "state_of_inc": "DE",
    "state_location": "GA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1350593/0001350593-23-000060-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1350593/000135059323000060/mwa-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1350593/0001350593-23-000060.txt",
    "filename": "1350593_10K_2023_0001350593-23-000060.htm",
    "content": "Item 1.BUSINESS\nOur Company\nMueller Water Products, Inc. (Mueller, we, our, or the Company) is a leading manufacturer and marketer of products and services used in the transmission, distribution and measurement of water in North America. Our products and services are used by municipalities and the residential and non-residential construction industries. Some of our products have leading positions as a result of their strong brand recognition and reputation for quality, service and innovation. We believe we have one of the largest installed bases of iron gate valves and fire hydrants in the United States. Our iron gate valve or fire hydrant products are specified for use in the largest 100 metropolitan areas in the United States. Our large installed base, broad product range and well-known brands have led to long-standing relationships with the key distributors and end users of our products. Our consolidated net sales were $1,275.7 million in 2023.\nWe operate our business through two segments, Water Flow Solutions and Water Management Solutions. Segment sales, operating results and additional financial data and commentary are provided in the Segment Analysis section in Part II, Item 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS and in Note 14. of the Notes to Consolidated Financial Statements in Part II, Item 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA of this Annual Report.\nOrganization Updates\nEffective October 1, 2021, we implemented a new management structure designed to increase revenue growth, drive operational excellence, accelerate new product development and enhance profitability. Our two operating segments, Water Flow Solutions and Water Management Solutions, align with this management structure.\nEffective August 21, 2023, the Companys Chief Executive Officer (CEO) left his role and Marietta Edmunds Zakas, the Companys Chief Financial Officer (CFO) was named President and CEO. Steven S. Heinrichs, the Companys Chief Legal and Compliance Officer, was named CFO, and continues to serve as Chief Legal and Compliance Officer. In addition, certain other management changes occurred. As a result, the Company incurred transition and retention expense which has been recorded to Strategic reorganization and other charges in our consolidated statements of operations.\nWater Flow Solutions\nThe Water Flow Solutions product portfolio includes iron gate valves, specialty valves and service brass products. Net sales of products in the Water Flow Solutions business unit were approximately 50% of fiscal 2023 consolidated net sales.\nWater Management Solutions\nThe Water Management Solutions product and service portfolio includes fire hydrants, repair and installation, natural gas, metering, leak detection, and pressure management and control products and solutions. Net sales of products and services in the Water Management Solutions business unit were approximately 50% of fiscal 2023 consolidated net sales.\nBusiness Strategy\nOur business strategy is to capitalize on the large, attractive and growing water infrastructure markets worldwide. Key elements of this strategy are as follows:\nDrive operational improvements and deliver benefits from capital investments.\nWe seek to bring best practices focused on Lean manufacturing and Six Sigma business process improvement methodologies, with an investment mindset to deliver manufacturing productivity improvements. We expect these efforts will drive sales growth, improve product margins, and facilitate innovation and new product development. Productivity improvements within our facilities should allow us to lower costs, which can help fund additional manufacturing initiatives and continued investment in product development.\nOver the past five years, we have prioritized capital investments to modernize our manufacturing facilities and processes, expand capacity and capabilities for domestic manufacturing and accelerate new product development. We believe these investments will drive margin expansion by lowering costs, expand our product portfolio, and improve product quality. We have completed our large valve manufacturing expansion in Chattanooga, Tennessee and our new facility in Kimball,\nTennessee, which included consolidating multiple facilities. We expect these investments to support our domestic manufacturing capabilities for specialty and large valves and to capitalize on the growing need for highly engineered valves required for water infrastructure projects. During 2023, we started initial production at a new brass foundry in Decatur, Illinois, which will eventually replace our original brass foundry built there in the early 1900s. These three projects accounted for a significant portion of our capital expenditures over the past five years. They are expected to drive operational efficiencies, expand capabilities for American-made products, advance our sustainability environmental initiatives, and help accelerate product development.\nAccelerate product development and innovation.\nWe plan to continue to invest in our product development capabilities, including expanding our research and development staff, to develop and market new products and services. We expect to add new products to our portfolio and offer new products in different end markets. We continue to enhance our software platform, Sentryx™, which provides data intelligence to help water utilities make strategic and operational decisions. This data includes leak detection, pressure monitoring, advanced metering and water quality metrics, which are aggregated and consolidated within the Sentryx™ platform, providing utilities with critical information to monitor and control their water networks. As our customers seek to use real-time data and analytics to manage and repair their aging pipe networks more efficiently, we believe we are well-positioned to provide solutions given our expertise and the large installed base of our products.\nExecute sales initiatives and channel strategies to enhance customer service and increase growth.\nWhile our distribution network covers all of the major locations for our principal products in the United States and Canada, we want to continue to invest in process improvements to support our objective of being the preferred partner for our customers. Expanding the capabilities of our systems and employees will allow us to improve our customers experiences. We continue to invest time and resources to deepen our channel partnerships and end customer relationships to increase our presence in the fastest growing markets. Additionally, we seek to attract and retain customers through product training and engineering resources to ascertain, educate and understand project requirements.\nContinue to seek, acquire, and invest in businesses and technologies that expand our existing portfolio or allow us to enter new markets.\nWe will continue to evaluate the acquisition of strategic businesses, technologies and product lines that have the potential to strengthen our competitive position, enhance or expand our existing product and service offerings, expand our technological capabilities, leverage our manufacturing capabilities, provide synergistic opportunities, enhance our customer relationships or allow us to enter new markets. As part of this strategy, we may pursue international opportunities, including acquisitions, joint ventures and partnerships.\nDescription of Products and Services\nWe offer a broad line of water infrastructure, flow control, metering and leak detection products and services primarily in the United States and Canada. Water Flow Solutions sells iron gate and specialty valves, and service brass products. Water Management Solutions sells fire hydrants, repair and installation, natural gas, metering, leak detection and pressure management and control products and solutions. Our products are designed, manufactured and tested in compliance with relevant industry standards. Our water distribution products are manufactured to meet or exceed American Water Works Association (AWWA) standards and, where applicable, certified to National Science Foundation (NSF)/American National Standards Institute (ANSI) Standard 61 for potable water conveyance. Underwriters Laboratory (UL) and FM Approvals (FM) have approved many of these products. Additionally, our products are typically specified by a water utility for use in its infrastructure system.\n, leak detection and pressure control products\nWater Flow Solutions\nWater Flow Solutions product portfolio includes iron gate valves, specialty valves and service brass products. We recognized $634.4 million, $714.1 million and $617.8 million of net sales in our 2023, 2022 and 2021 fiscal years, respectively, for Water Flow Solutions products and solutions.\nWater Valves and Related Products. Water Flow Solutions manufactures valves for water systems, including iron gate, butterfly, tapping, check, knife, plug, and ball valves, and sells these products under a variety of brand names, including Mueller®, Pratt®, and U.S. Pipe Valve and Hydrant. These valve products are used to control distribution and transmission of potable water and non-potable water. Water valve products typically range in size from ¾ inch to 36 inches in diameter. Water Flow Solutions also manufactures significantly larger valves as custom orders through some of its product lines. Most of these valves are used in water transmission or distribution, water treatment facilities or industrial applications.\nWater Management Solutions\nWater Management Solutions portfolio includes fire hydrants, repair and installation, natural gas, metering, leak detection and pressure management and control products and solutions. We recognized $641.3 million, $533.3 million and $493.2 million of net sales in our 2023, 2022, and 2021 fiscal years respectively, for Water Management Solutions products and solutions.\nFire Hydrants. Water Management Solutions manufactures dry-barrel and wet-barrel fire hydrants. Water Management Solutions sells fire hydrants for new water infrastructure development, fire protection systems and water infrastructure repair and replacement projects.\nOur fire hydrants consist of an upper barrel and nozzle section and a lower barrel and valve section that connects to a water main. In dry-barrel fire hydrants, the valve connecting the barrel of the hydrant to the water main is located below ground at or below the frost line, which keeps the upper barrel dry. Water Management Solutions sells dry-barrel fire hydrants under the Mueller and U.S. Pipe Valve and Hydrant brand names in the United States and Mueller and the Canada Valve™ brand names in Canada. Water Management Solutions also makes wet-barrel fire hydrants, where the valves are located in the hydrant nozzles and the barrel contains water at all times. Wet-barrel fire hydrants are made for warm weather climates, such as in California and Hawaii, and are sold under the Jones® brand name.\nMost municipalities have approved a limited number of fire hydrant brands for installation as a result of their desire to use the same tools and operating instructions across their systems and to minimize inventories of spare parts. We believe the large installed base of Mueller fire hydrants throughout the United States and Canada, reputation for superior quality and performance as well as specified position have contributed to the leading market position of our fire hydrants. This large installed base also leads to recurring sales of replacement fire hydrants and hydrant parts.\nRepair Products and Services. Water Management Solutions also sells pipe repair products, such as couplings, grips and clamps used to repair leaks, under the HYMAX®, Mueller® and Krausz® brand names.\nWater Metering Products and Systems. Water Management Solutions manufactures and sources a variety of water technology products under the Mueller® brand name that are designed to help water providers accurately measure and control water usage. Water Management Solutions offers a complete line of residential, fire protection and commercial metering solutions. Residential and commercial water meters are generally classified as either manually read meters or remotely read meters via radio technology. A manually read meter consists of a water meter and a register that gives a visual meter reading display. Meters equipped with radio transmitters (endpoints) use encoder registers to convert the measurement data from the meter (mechanical or static) into an encrypted digital format which is then transmitted via radio frequency to a receiver that collects and formats the data appropriately for water utility billing systems. These remotely or electronically read systems are either automatic meter reading (AMR) systems or fixed network advanced metering infrastructure (AMI) systems. With an AMR system, utility personnel with mobile equipment, including a radio receiver, computer and reading software, collect the data from utilities meters. With an AMI system, a network of permanent data collectors or gateway receivers that are always active or listening for the radio transmission from the utilities meters gather the data. AMI systems eliminate the need for utility personnel to travel through service territories to collect meter reading data. These systems provide the utilities with more frequent and diverse data at specified intervals from the utilities meters and allow for two-way communication. Water Management Solutions sells both AMR and AMI systems and related products. Our remote disconnect water meter enables the water flow to be stopped and started remotely via handheld devices or from a central operating facility.\nWater Leak Detection and Pipe Condition Assessment Products and Services. Water Management Solutions develops technologies and offers products and services under the Echologics® brand name that can non-invasively (i.e., without disrupting service or introducing a foreign object into the water system) detect underground leaks and assess the condition of water mains comprised of a variety of materials. We leverage our proprietary acoustic technology to offer leak detection and condition assessment surveys. We also offer fixed leak detection systems that allow customers to continuously monitor and detect leaks on water distribution and transmission mains. We believe Water Management Solutions ability to offer non-invasive leak detection and pipe condition assessment services is a key competitive advantage.\nAdditionally, Water Management Solutions produces machines and tools for tapping, drilling, extracting, installing and stopping-off, which are designed to work with its water and gas fittings and valves as an integrated system. We also provide gas valve products primarily for use in gas distribution systems. With our Singer Valve and i2O products, we provide a range of intelligent water solutions including pressure control valves, advanced pressure management, network analytics, event management and data logging.\nManufacturing\nSee Item 2. PROPERTIES for a description of our principal manufacturing facilities.\nWe will continue to expand the use of Lean manufacturing and Six Sigma business process improvement methodologies where appropriate to safely capture higher levels of quality, service and operational efficiency in our manufacturing facilities in both segments.\nMueller Water Products operates ten manufacturing facilities located in the United States, Israel and China. These manufacturing operations include foundry, machining, fabrication, assembly, testing and painting operations. Not all facilities perform each of these operations. Our existing manufacturing capacity is sufficient for anticipated near-term requirements. In order to meet longer-term capacity requirements and modernize some production facilities, we have expanded the large valve casting capabilities at the facility located in Chattanooga, Tennessee, and added a new facility nearby in Kimball, Tennessee to expand domestic manufacturing capabilities for specialty large valves. Additionally, our new brass foundry in Decatur, Illinois, is nearly complete and will replace our existing brass foundry there. Our foundries use both lost foam and green sand casting techniques. We use the lost foam technique for fire hydrant production in our Albertville, Alabama facility and for iron gate valve production in our Chattanooga, Tennessee facility. The lost foam technique has several advantages over the green sand technique, especially for high-volume products, including a reduction in the number of manual finishing operations, lower scrap levels and the ability to reuse some of the materials.\nAdditionally, we design, manufacture, and assemble water metering products in Cleveland, North Carolina. In Atlanta, Georgia, we design and support AMR and AMI systems in our research and development center of excellence for software and electronics. Our research and development center in Toronto, Ontario, Canada, designs and supports leak detection and pipe condition assessment products and solutions. Product design and support for our intelligent water solutions products and services for pressure management are in Southampton, United Kingdom.\nPurchased Components and Raw Materials\nOur products are made using various purchased components and several basic raw materials that include brass ingot, scrap steel, sand and resin. Purchased parts and raw materials represented approximately 45% and 11%, respectively, of Cost of sales in 2023.\nPatents, Licenses and Trademarks\nWe have active patents relating to the design of our products and trademarks for our brands and products. We have filed and continue to file when appropriate, patent applications used in connection with our business and products. Many of the patents for technology underlying the majority of our products have been in the public domain for many years, and we do not believe third-party patents individually or in the aggregate are material to our business. However, we consider the pool of proprietary information, consisting of expertise and trade secrets relating to the design, manufacture and operation of our products to be particularly important and valuable. We generally own the rights to the products that we manufacture and sell, and we are not dependent in any material way upon any third-party license or franchise to operate. See Item 1A. RISK FACTORS\nRisks related to our industries\nA significant portion of our business depends on spending for water and wastewater infrastructure construction activity.\nOur primary end markets are repair and replacement of water infrastructure, driven by municipal spending and new water infrastructure installation driven by new residential construction. As a result, a significant portion of our business depends on local, state and federal spending on water and wastewater infrastructure upgrade, repair and replacement. Funds for water and wastewater infrastructure repair and replacement typically come from local taxes, water fees and water rates. State and local governments and private water entities that do not adequately budget for expenditures when setting tax rates, water rates and water fees, as applicable, could be unable to pay for water infrastructure repair and replacement if they do not have access to other funding sources. In addition, reductions or delays in federal spending related to water or wastewater infrastructure could adversely affect state or local projects and thus may adversely affect our financial results.\nGovernments and private water entities may have limited abilities to increase taxes, water fees or water rates, as applicable. It is not unusual for water and wastewater projects to be delayed and rescheduled for a number of reasons, including changes in project priorities, increasing interest rates, inflation and difficulties in complying with environmental and other governmental regulations. For example, changes in interest rates and credit markets, including municipal bonds, mortgages, home equity loans and consumer credit, have in the past and may in the future significantly increase the costs of the projects in which our products are utilized, such as in new residential construction and water and wastewater infrastructure upgrade, repair and replacement projects, and lead to such projects being reduced, delayed and/or rescheduled, which could result in a decrease in our sales and earnings and adversely affect our financial condition. In addition, higher interest rates are often accompanied by inflation. We have in the past and may in the future be unable to raise the prices of our products sufficiently to keep up with the rate of inflation, which would reduce our profit margins and cash flows.\nSome state and local governments may place significant restrictions on the use of water by their constituents and/or increase their water conservation efforts. These types of water use restrictions and water conservation efforts may lead to reduced water revenues by private water entities, municipalities or other governmental agencies, which could similarly affect funding decisions for water-related projects.\nPoor economic conditions may cause states, municipalities or private water entities to receive lower than anticipated revenues, which may lead to reduced or delayed funding for water infrastructure projects. Even if favorable economic conditions exist, water infrastructure owners may choose not to address deferred infrastructure needs as a result of a variety of political factors or competing spending priorities.\nLow levels of spending for water and wastewater infrastructure construction activity could adversely affect our sales, profitability and cash flows.\nResidential construction activity is important to our business and adverse conditions or sustained uncertainty within this market could adversely affect our financial results.\nNew water and wastewater infrastructure spending is heavily dependent upon residential construction. As a result, our financial performance depends significantly on the stability and growth of the residential construction market. This market depends on a variety of factors beyond our control, including household formation, consumer confidence, interest rates, inflation and the availability of mortgage financing, as well as the mix between single and multifamily construction, availability of construction labor and ultimately the extent to which new construction leads to the development of raw land. Adverse conditions or sustained uncertainty regarding the residential construction market have had, and may in the future have, an adverse effect on our sales, profitability and cash flows, including the risk that one or more of our distributors and/or end use customers decide to delay purchasing, or determine not to purchase, our products or services.\nOur business depends on a small group of key customers for a significant portion of our sales.\nA majority of our products are sold primarily to distributors and our success depends on these third parties operating their businesses profitably and effectively. These distributors profitability and effectiveness can vary significantly from company to company and from region to region within the same company. Further, our largest distributors generally also carry competing products. We may fail to align our operations with successful distributors in any given market.\nDistributors in our industry have experienced consolidation in recent years. If such consolidation continues, our distributors could be acquired by other distributors who have better relationships with our competitors, and consequently,\npricing and profit margin pressure may intensify. Pricing and profit margin pressure or the loss of any one of our key distributors in any market could adversely affect our operating results.\nCertain products and solutions, primarily technology-enabled products and solutions as well as gas repair products, are sold directly to end users. Some of these customers represent a relatively high concentration of sales. Over time, expected growth in sales is expected to lessen the significance of individual customers. In the short term, net sales could decline if existing significant customers do not continue to purchase our products or services and new customers are not obtained to replace them.\nStrong competition could adversely affect prices and demand for our products and services, which would adversely affect our operating results and financial condition.\nThe United States and Canadian markets for water infrastructure and flow control products are very competitive. While there are only a few competitors for most of our product and service offerings, many of our competitors are well-established companies with strong brand recognition. We compete on the basis of a variety of factors, including the quality, price and innovation of our products, services and service levels, and product specifications and availability. Our ability to retain customers in the face of competition depends on our ability to market our products and services to our customers and end users effectively.\nThe United States markets for water metering products and systems are highly competitive. Our primary competitors benefit from strong market positions and many end users are slow to transition to new products or new brands. Our ability to attract new customers depends on our technological advancements and ability to market our products and services to our customers and end users effectively.\nIn addition to competition from North American companies, we face the threat of competition from outside of North America. The intensity of competition from these companies is affected by fluctuations in the value of the United States dollar against foreign local currencies, the cost to ship competitive products into North America and the availability of trade remedies, if any. Competition may also increase as a result of competitors located in the United States shifting their operations to lower-cost countries or otherwise reducing their costs.\nOur competitors may reduce the prices of their products or services, improve their quality, improve their functionality or enhance their marketing or sales activities. Any of these potential developments could adversely affect our prices and demand for our products and services.\nThe long-term success of our newer systems and solutions, including the related products, software and services, such as smart metering, leak detection, pressure monitoring and pipe condition assessment, depends on market acceptance.\nOur technology-enabled smart metering, leak detection, pressure monitoring and pipe condition assessment products and services have much less market history than many of our traditional products. Our investments in smart metering have primarily focused on the market for AMI and have been based on our belief that water utilities will transition over time from traditional manually-read meters to automatically-read meters. The market for AMI continues to evolve, and the United States markets for water meter products and systems are highly competitive. Water utilities have traditionally been slow adopters of new technology and may not adopt AMI as quickly as we expect, partially as a result of the substantial investment related to installation of AMI systems. The strong market positions of our primary competitors may also slow the adoption of our products. Similarly, the adoption of our pressure monitoring, leak detection and pipe condition assessment products and services depends on the willingness of our customers to invest in new product and service offerings, and the pace of adoption may be slower than we expect. The markets for our technology-enabled products and services have developed more slowly than we expected and may continue to do so. If these products and services fail to gain market acceptance, our opportunity to grow these businesses will be limited.\nRisks related to our business strategy\nWe may not be able to adequately manage the risks associated with installed products and the introduction and deployment of new products and systems, including increased warranty costs.\nThe success of our existing and new products and systems, such as our smart hydrant and Sentryx™ software platform, will depend on our ability to manage the risks associated with their introduction and continued maintenance and management, including the risk that existing and new products and systems may have quality or other defects or deficiencies that result in their failure to satisfy performance or reliability requirements. Our success will depend in part on our ability to manage these risks, including costs associated with design, manufacturing, installation, maintenance and warranties. These challenges can be costly and technologically challenging, and we cannot determine in advance the ultimate effect they may have. Warranty liabilities and the related reserve estimation process is highly judgmental as a result of the complex nature of these exposures and the unique circumstances of each claim. Furthermore, once claims are asserted for an alleged product defect by customers, it can be difficult to determine the level of potential exposure or liability related to such allegation to which the assertion of these claims may expand geographically. Although we have obtained insurance for certain product related claims, such policies may not be available to us or adequately cover the liability for damages, the cost of repairs and/or the expense of litigation. Current and future claims may arise out of events or circumstances not covered by insurance and not subject to effective indemnification agreements with our subcontractors. Failure to successfully manage these challenges could result in lost sales, significant expense, and harm to our reputation.\nOur products and services may be affected from time to time by design and manufacturing defects that could materially adversely affect the business and result in harm to our reputation.\nWe offer several technologically enhanced, complex hardware and software products and services that can be affected by design and manufacturing defects. Unanticipated defects can also exist in components and products we purchase from third parties. Component defects could make our products unsafe and create a risk of environmental or property damage and personal injury. In addition, our offerings can have quality issues and from time-to-time experience outages, disruptions, slowdowns or errors. As a result, our products and services may not perform as anticipated and may not meet customer expectations. There can be no assurance we will be able to detect and fix all issues and defects in the hardware, software and services we offer. Failure to do so can result in widespread technical and performance issues affecting our offerings. In addition, we can be exposed to product liability claims, recalls, product replacements or modifications, write-offs of inventory, property, plant and equipment, and/or intangible assets, and significant warranty and other expenses, including litigation costs. Quality problems can also adversely affect the experience for our customers and result in harm to our reputation, loss of competitive advantage, poor market acceptance, reduced demand for products and services, new product and service introduction delays and lost sales.\nInefficient or ineffective allocation of capital, along with increased capital expenditure levels to modernize our aging facilities and expand our capabilities, could adversely affect our operating results and/or stockholder value, including a negative impact on our available cash reserves and prevent acquisition or other cash-intensive opportunities.\nOur goal is to invest capital to generate long-term value for our stockholders. This includes spending on capital projects; developing or acquiring strategic businesses; technologies and product lines with the potential to strengthen our industry position; enhancing our existing set of product and service offerings, or entering into new markets; as well as periodically returning value to our stockholders through share repurchases and dividends. For example, we have completed the construction of our large valve manufacturing expansion in Chattanooga, Tennessee, and a facility in Kimball, Tennessee and are nearly complete with our new brass manufacturing facility in Decatur, Illinois. To a large degree, capital efficiency reflects how well we manage key risks. The actions taken to address specific risks may affect how well we manage the more general risk of capital efficiency. If we do not allocate properly and manage our capital, we may fail to produce expected financial results, and we may experience a reduction in stockholder value, including increased volatility in our stock price.\nWe may not realize the expected benefits from our strategic reorganization plans.\nBetween November 2019 and September 2022, we transitioned all, or substantially all, operations from our facilities in Hammond, Indiana; Aurora, Illinois; Woodland, Washington; and Surrey, British Columbia, Canada; to our Kimball, Tennessee facility. Additionally, we are nearing completion of a new brass foundry in Decatur, Illinois to replace our original brass foundry. We cannot guarantee that the activities under the restructuring and reorganization activities will result in the desired efficiencies and estimated cost savings, if any.\nOur business strategy includes developing, acquiring and investing in companies and technologies that broaden our product portfolio or complement our existing business, which could be unsuccessful or consume significant resources and adversely affect our operating results.\nAs part of our long-term business strategy, we continue to evaluate the development or acquisition of strategic businesses, technologies and product lines with the potential to strengthen our industry position, enhance and expand our existing set of product and service offerings, or enter new markets. We may be unable to identify or successfully complete suitable acquisitions in the future and completed acquisitions may not be successful.\nAcquisitions and technology investments may involve significant cash expenditures, the incurrence of debt, operating losses and expenses that could have a materially adverse effect on our business, financial condition, results of operations and cash flows. These types of transactions involve numerous other risks, including but not limited to:\nDiversion of management time and attention from existing operations,\nDifficulties in integrating acquired businesses, technologies and personnel into our business or into our compliance and control programs, particularly those that include international operations,\nWorking with partners or other ownership structures with shared decision-making authority (our interests and other ownership interests may be inconsistent),\nDifficulties in obtaining and verifying relevant information regarding a business or technology prior to the consummation of the transaction, including the identification and assessment of liabilities, claims or other circumstances, including those relating to intellectual property claims, that could result in litigation or regulatory exposure,\nAssumptions of liabilities that exceed our estimated amounts,\nVerification of financial statements and other business information of an acquired business,\nInability to obtain required regulatory approvals and/or required financing on favorable terms,\nPotential loss of key employees, contractual relationships or customers of the acquired business,\nIncreased operating expenses related to the acquired businesses or technologies,\nThe failure of new technologies, products or services to gain market acceptance with acceptable profit margins,\nEntering new markets in which we have little or no experience or in which competitors may have stronger market positions,\nDilution of stockholder value through the issuance of equity securities or equity-linked securities, and\nInability to achieve expected synergies or the achievement of such synergies taking longer than expected to realize, including increases in sales, enhanced efficiencies, or increased market share, or the benefits ultimately may be smaller than we expected.\nAny acquisitions or investments may ultimately harm our business or financial condition, as they may not be successful and may ultimately have an adverse effect on our operating results, financial condition and/or result in impairment charges.\nPotential international business opportunities may expose us to additional risks, including foreign currency exchange rate fluctuations.\nPart of our growth strategy depends on expanding internationally. Although sales outside of the United States account for a relatively small percentage of our total net sales, we have business activity in Canada, Israel and the United Kingdom. Some countries that present potential good business opportunities also face political and economic instability and vulnerability to infrastructure and other disruptions. Seeking to expand our business internationally exposes us to additional risks, which include foreign exchange risks and currency fluctuations, as discussed more fully below, political and economic uncertainties, changes in local business conditions and national and international conflicts. A primary risk we face in connection with our export shipments relates to our ability to collect amounts due from customers. We also face the potential risks arising from staffing, monitoring and managing international operations, including the risk that such activities may divert our resources and management time.\nIn addition, compliance with the laws, regulations and taxes of multiple international jurisdictions increases our cost of doing business. International operations are subject to anti-corruption laws and anti-competition regulations, among others. For example, the United States Foreign Corrupt Practices Act and similar anti-corruption laws outside of the United States\ngenerally prohibit companies and their intermediaries from making improper payments or providing anything of value to improperly influence foreign government officials and certain others for the purpose of obtaining or retaining business, or obtaining an unfair advantage. Violations of these laws and regulations could result in criminal and civil sanctions, disrupt our business and adversely affect our brands, international expansion efforts, business and operating results.\nWe make sales, incur expenses and invest cash in foreign currencies as part of our operations outside of the United States. Accordingly, fluctuations in foreign currency exchange rates may significantly increase the amount of United States dollars required for foreign currency expenses or significantly decrease the United States dollars we receive from sales denominated in a foreign currency. Changes between a foreign exchange rate and the United States dollar affect the amounts we record for our foreign assets, liabilities, revenues and expenses, and could have a negative effect on our financial results. We expect that our exposure to foreign currency exchange rate fluctuations will grow as the relative contribution of our operations outside the United States increases through both organic and inorganic growth.\nRisks related to our operations\nOur reliance on vendors for certain products, some of which are single-source or limited-source suppliers, could harm our business by adversely affecting product availability, reliability or cost.\nWe maintain several single-source or limited-source supplier relationships with manufacturers, including some outside of the United States. If the supply of a critical single- or limited-source product is delayed or curtailed, we may not be able to ship the related products in desired quantities or in a timely manner. Even where multiple sources of supply are available, qualification of the alternative suppliers and establishment of reliable supplies could result in delays and a possible loss of profits, which could harm our operating results.\nThese relationships reduce our direct control over production. Our reliance on these vendors subjects us to a greater risk of shortages, and reduced control over delivery schedules of products, as well as a greater risk of increased product costs. In instances where we stock lower levels of product inventories, a disruption in product availability could harm our financial performance and our ability to satisfy customer needs. In addition, defective products from these manufacturers could reduce product reliability and harm our reputation.\nA disruption in our supply chain or other factors impacting the distribution of our products could adversely affect our business.\nA disruption within our logistics or supply chain network at any of the freight companies that deliver components for our manufacturing operations in the United States or ship our fully-assembled products to our customers could adversely affect our business and result in lost sales and increased expenses or harm to our reputation. Our supply chain is dependent on third party ocean-going container ships, rail, barge, air and trucking systems and, therefore, disruption in these logistics services because of weather-related problems, strikes, bankruptcies, inflation, public health crises, such as pandemics, or other events could adversely affect our financial performance and financial condition, negatively impacting sales, profitability and cash flows.\nThe Israel-Hamas war caused a temporary shutdown in our facility in Ariel, Israel in October 2023. While we have partially reopened the facility, continued disruptions and escalations of conflicts in the area increase the likelihood of supply interruptions and may hinder our ability to acquire the necessary materials we need to make our products. Supply disruptions from lack of access to materials has impacted, and continues to impact, our ability to produce and deliver our products on time and at favorable pricing.\nSeasonal demand for certain of our products and services may adversely affect our financial results.\nSales of some of our products, including iron gate valves and fire hydrants, are seasonal, with lower sales in our first and second fiscal quarters when weather conditions throughout the northern United States and most of Canada tend to be cold resulting in lower levels of construction activity. This seasonality in demand has resulted in fluctuations in our sales and operating results. To satisfy demand during expected peak periods, we may incur costs associated with building inventory in off-peak periods, and our projections as to future needs may not be accurate. Because many of our expenses are fixed, seasonal trends can cause reductions in our profitability and profit margins and deterioration of our financial condition during periods affected by lower production or sales activity.\nTransportation costs are relatively high for most of our products.\nTransportation costs can be an important factor in a customers purchasing decision. Many of our products are big, bulky and heavy, which tend to increase transportation costs. We also have relatively few manufacturing sites, which tends to increase transportation distances to our customers and consequently increases our transportation costs. High transportation costs could make our products less competitive compared to similar or alternative products offered by competitors.\nOur business, financial condition and results of operations may be adversely impacted by the effects of inflation.\nInflation has the potential to adversely affect our business, financial condition and results of operations by increasing our overall cost structure, including purchased parts, commodity and raw material costs and labor. In an inflationary environment, we may be unable to raise the prices of our products sufficiently to keep up with the rate of inflation, which would reduce our profit margins and cash flows. Other inflationary pressures could affect wages, the cost and availability of components and raw materials and other inputs and our ability to meet customer demand. Inflation may further exacerbate other risk factors, including supply chain disruptions, risks related to international operations and the recruitment and retention of qualified employees.\nOur high fixed costs may make it more difficult for us to respond to economic cycles.\nA significant portion of our cost structure is fixed, including manufacturing overhead, capital equipment and research and development costs. In a prolonged economic downturn, these fixed costs may cause our gross margins to erode and our earnings to decline.\nWe may experience difficulties implementing upgrades to our software systems.\nWe engage in implementations and upgrades to our software systems, including to our Enterprise Resource Planning (ERP) system. The ERP is designed to accurately maintain the Companys books and records and provide information important to the operation of the business to the Companys management team. Any software implementation or upgrade requires significant investment of human and financial resources, and we may experience significant delays, increased costs and other difficulties. Any significant disruption or deficiency in the design and implementation of our software systems, including our ERP, could adversely affect our ability to process orders, ship product, send invoices and track payments, fulfill contractual obligations or otherwise operate our business. While we invest significant resources in planning and project management, significant issues may arise.\nNormal operations at our key manufacturing facilities may be interrupted.\nSome of our key products, including fire hydrants, iron gate valves, service brass products, specialty valves and repair products are manufactured at a single facility or a few facilities, that depend on critical pieces of heavy equipment that cannot be moved economically to other locations or sourced quickly. We are therefore limited in our ability to shift production among locations. The operations at our manufacturing facilities may be interrupted or impaired by various operating risks, including, but not limited to:\nCatastrophic events, such as fires, floods, explosions, natural disasters, public health crises, severe weather or other similar occurrences,\nTerrorist attacks, wars, mass shootings or other acts of violence,\nInterruptions in the delivery of raw materials or purchased parts, shortages of equipment or spare parts, or other manufacturing inputs,\nAdverse government regulations,\nEquipment or information systems breakdowns or failures,\nViolations of our permit requirements or revocation of permits,\nRelease of pollutants and hazardous substances to air, soil, surface water or ground water,\nLabor disputes, and\nCyberattacks and events.\nThe occurrence of any of these events may impair our production capabilities and adversely affect our sales, profitability and cash flows.\nAny inability to protect our intellectual property or our failure to effectively defend against intellectual property infringement claims could adversely affect our competitive position.\nOur business depends on our technology and expertise, which were largely developed internally and are not subject to statutory protection. We rely on a combination of patent protection, copyright and trademark laws, trade secrets protection, employee and third-party confidentiality agreements as well as technical measures to protect our intellectual property rights. The methods we employ to protect our intellectual property rights may not adequately deter infringement, misappropriation or\nindependent development of our technology, and they may not prevent an unauthorized party from obtaining or using information or intellectual property that we regard as proprietary or keep others from using brand names similar to our own. The disclosure, misappropriation or infringement of our intellectual property could harm our competitive position. In addition, our actions to enforce our rights may result in substantial costs and the diversion of management time and other resources. We may also be subject to intellectual property infringement claims from time to time, which may result in additional expense and the diversion of resources to respond to these claims. Finally, for those products in our portfolio that rely on patent protection, once a patent has expired the product is further subjected to competition. Products under patent protection potentially generate significantly higher sales and earnings than those not protected by patents. If we fail to successfully enforce our intellectual property rights or register new patents, our competitive position could suffer, which could adversely affect our business, financial condition, results of operations and cash flows.\nIf we do not successfully maintain our information and technology networks, including the security of those networks, our operations could be disrupted and unanticipated increases in costs and/or decreases in sales could result.\nWe rely on various information technology systems, some of which are controlled by outside service providers, to manage key aspects of our operations. The proper functioning of our information technology systems is important to the successful operation of our business. If critical information technology systems fail, or are otherwise unavailable, our ability to manufacture products, process orders, track credit risk, identify business opportunities, maintain proper levels of inventories, collect accounts receivable, pay expenses and otherwise manage our business would be adversely affected.\nWe depend on the Internet and our information technology infrastructure for electronic communications among our locations around the world and among our personnel, suppliers and customers. Cyber and other data security breaches of this infrastructure can create system disruptions, shutdowns or unauthorized disclosure of confidential information. For example, as a result of the cybersecurity incident announced on October 28, 2023, we experienced disruptions in our ability to manufacture products, perform normal financial-related activities (including accepting orders and invoicing third parties), and conduct daily administrative and operational functions. Likewise, if we or our service providers are unable to prevent future cybersecurity incidents, our operations could be disrupted or we may suffer financial, reputational or other harm. As a result of the cybersecurity incidents we experienced in October 2023, we have incurred costs, and we expect to continue to incur costs, which may be significant, in connection with efforts to investigate, assess the relevant impacts, recover our systems, enhance our data security, and protect against unauthorized access to, or manipulation of, our systems and data. Despite incurring these costs, we may not have identified and may not be able to remediate all of the potential causes of our cybersecurity incident, and similar incidents may occur in the future. Further, customers and third-party providers increasingly demand rigorous contractual provisions regarding privacy, cybersecurity, data protection, confidentiality, and intellectual property, which may also increase our overall compliance burden and related costs.\nWe may fail to effectively manage confidential data, which could harm our reputation, result in substantial additional costs and subject us to litigation.\nAs we grow our technology-enabled products, services and solutions, we continue to accumulate increasing volumes of customer data. In addition, we store personal information in connection with our human resources operations. Our efforts to protect this information may be unsuccessful as a result of employee errors or malfeasance, technical malfunctions, the actions of third parties such as a cyberattack or other factors. If our cyber defenses and other countermeasures are unable to protect personal data, it could be accessed or disclosed improperly, which could expose us to liability, harm our reputation and deter current and potential users from using our products and services. The regulatory environment related to cyber and information security, data collection and privacy is increasingly rigorous, with new and constantly changing requirements applicable to our business, and compliance with those requirements could result in additional costs.\nCyberattacks and security vulnerabilities could lead to reduced sales, increased costs, liability claims, unauthorized access to customer data, or harm to our reputation.\nCybersecurity threats are constantly evolving and can take a variety of forms, increasing the difficulty of preventing, detecting and successfully defending against them. Individual and groups of hackers and sophisticated organizations, including state-sponsored organizations or nation-states, continuously undertake attacks that pose threats to our customers and our information technology systems. These actors may use a wide variety of methods, which may include developing and deploying malicious software or exploiting vulnerabilities in hardware, software, radio communication protocols, or other infrastructure in order to attack our products and services. Additionally, these actors may reverse engineer trade secrets or other confidential intellectual property, or gain access to our networks and data centers, using social engineering techniques to induce our employees, users, partners, or customers to disclose passwords or other sensitive information or take other actions to gain access to our data or our users or customers data, or act in a coordinated manner to launch distributed denial of service attacks, deny or postpone access to critical water infrastructure telemetry through vulnerabilities in our cloud services and infrastructure,\nor logging, sensing, and telemetry products. Inadequate account security practices may also result in unauthorized access to confidential data.\nFor example, in October 2023, the cybersecurity event we suffered required us to temporarily suspend operations at certain of our facilities and we expect it to adversely impact our results for the first fiscal quarter of 2024, and such impact may be material. As a result of this incident, our relationship with our customers may be negatively impacted, and we may be subject to subsequent investigations, claims or actions, in addition to other costs, fines, penalties, or other obligations including additional administrative remediation costs. For additional information regarding this incident, please refer to Managements Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources in Part II, Item 7. of this Annual Report on Form 10-K.\nDespite the implementation of a variety of security controls and measures, as well as those of our third-party administrators and vendors, there is no assurance that such actions will be sufficient to prevent or detect another cybersecurity incident or other vulnerabilities, which may allow them to persist in the environment over long periods of time. Cybersecurity events, such as our October 2023 incident, have had and in the future may have cascading impacts that unfold with increasing speed across our internal networks and systems. Such threats may also impact the networks and systems of our business associates and customers. Breaches of our facilities, network, or data security could disrupt the security of our systems and business applications, impair our ability to provide services to our customers and protect the privacy of their data, result in product development delays, compromise confidential or technical business information harming our reputation, result in theft or misuse of our intellectual property or other assets, require us to allocate more resources to improved technologies, or otherwise adversely affect our business. As a result of our October 2023 incident, we have incurred costs, and we expect to continue to incur costs, which may be significant, in connection with efforts to investigate, assess the relevant impacts, recover our systems, enhance our data security, and protect against unauthorized access to, or manipulation of, our systems and data. Despite incurring these costs, we may not have identified and may not be able to remediate all of the potential causes of our cybersecurity incidents and similar incidents may occur in the future. Further, customers and third-party providers increasingly demand rigorous contractual provisions regarding privacy, cybersecurity, data protection, confidentiality and intellectual property, which may also increase our overall compliance burden and related costs.\nMisuse of our technology-enabled products, services and solutions could lead to reduced sales, increased costs, liability claims, or harm to our reputation.\nAs we continue to design and develop products, services and solutions that leverage our hosted or cloud-based resources, the internet-of-things and other wireless/remote technologies and include networks of distributed and interconnected devices that contain sensors, data transfers and other computing capabilities, our customers data and systems may be subjected to harmful or illegal content or attacks, including potential cybersecurity threats. Additionally, we may not have adequately anticipated or precluded such cybersecurity threats through our product design or development. These products, services and solutions inevitably contain vulnerabilities or critical security defects which may not have been remedied and cannot be disclosed without compromising security. We may also make prioritization decisions in determining which vulnerabilities or security defects to fix, and the timing of these fixes, which could result in compromised security. These vulnerabilities and security defects could expose us or our customers to a risk of loss, disclosure, or misuse of information/data; adversely affect our operating results; result in litigation, liability, or regulatory action (including under laws related to privacy, data protection, data security, network security, and consumer protection); deter customers or sellers from using our products, services and solutions; and otherwise harm our business and reputation.\nWe are subject to a variety of claims, investigations and litigation that could adversely affect our results of operations and harm our reputation.\nIn the normal course of business, we are subject to claims and lawsuits, including from time to time, claims for damages related to product liability and warranties, investigations by governmental agencies, litigation alleging the infringement of intellectual property rights and litigation related to employee matters and commercial disputes. We may also be subject to investigations, claims, litigation and other proceedings outside the ordinary course of business, such as the June 2021 mass shooting event in our Albertville, Alabama facility. Defending these lawsuits and becoming involved in these investigations may divert managements attention, and may cause us to incur significant expenses, even if there is no evidence that our systems or practices were the cause of the claim. In addition, we may be required to pay damage awards, penalties or settlements, or become subject to injunctions or other equitable remedies, that could have a materially adverse effect on our business, financial condition, results of operations and cash flows. Moreover, any insurance or indemnification rights that we have may be insufficient or unavailable to protect us against potential loss exposures. See Item 1. BUSINESS - Regulatory and Environmental Matters, Item 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS - Contingencies and Note 15. of the Notes to Consolidated Financial Statements.\nWe are subject to stringent environmental, health and safety laws and regulations that impose significant compliance costs. Any failure to comply with these laws and regulations may adversely affect us.\nWe are subject to stringent laws and regulations relating to the protection of the environment, health and safety and incur significant capital and other expenditures to comply with these requirements. Failure to comply with any environmental, health or safety requirements could result in the assessment of damages, the imposition of penalties, suspension of production, changes to equipment or processes or a cessation of operations at our facilities, any of which could have a materially adverse effect on our business. Because these laws are complex, subject to change and may be applied retroactively, we cannot predict with certainty the extent of our future liabilities with respect to environmental, health and safety matters and whether they will be material.\nIn addition, certain statutes such as CERCLA may impose joint and several liability for the costs of remedial investigations and actions on entities that generated waste, arranged for disposal of waste, transported to or selected the disposal sites and the past and present owners and operators of such sites. All such potentially responsible parties (PRP), or any one of them, including us, may be required to bear all of such costs regardless of fault, the legality of the original disposal or ownership of the disposal site. As a result, we may be required to conduct investigations and perform remedial activities at current and former operating and manufacturing sites where we have been deemed, or in the future could be named, a PRP with respect to such environmental liabilities, any of which could require us to incur material costs. The final remediation costs of these environmental sites may exceed estimated costs, and additional sites in the future may require material remediation expenses. If actual expenditures exceed our estimates, our results of operations and financial position could be materially and adversely affected. See Item 1. BUSINESS - Regulatory and Environmental Matters, - Item 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS - Contingencies and Note 15. of the Notes to Consolidated Financial Statements.\nClimate change and legal or regulatory responses thereto may have an adverse impact on our business and results of operations.\nThere is growing concern that a gradual increase in global average temperatures as a result of increased concentration of carbon dioxide and other greenhouse gases in the atmosphere will cause significant changes in weather patterns around the globe and an increase in the frequency and severity of natural disasters. Many of our manufacturing plants use significant amounts of electricity generated by burning fossil fuels, which releases carbon dioxide. Such climate change may impair our production capabilities, disrupt our supply chain or impact demand for our products. Growing concern over climate change also may result in additional legal or regulatory requirements designed to reduce or mitigate the effects of carbon dioxide and other greenhouse gas emissions on the environment. Increased energy or compliance costs and expenses as a result of increased legal or regulatory requirements may cause disruptions in, or an increase in the costs associated with, the manufacturing and distribution of our products. The impacts of climate change and legal or regulatory initiatives to address climate change could have a long-term adverse impact on our business and results of operations. If we fail to achieve or improperly report on our progress toward achieving our goals and commitments to reduce our carbon footprint or in environmental and sustainability programs and initiatives, the results could have an adverse impact on our business and results of operations.\nWe rely on successors to Tyco to indemnify us for certain liabilities and they may become financially unable or fail to comply with the terms of the indemnity.\nUnder the terms of the acquisition agreement relating to the August 1999 sale by Tyco of businesses which make up certain of the companies within Mueller Water Products, Inc., we are indemnified by certain Tyco entities (Tyco Indemnitors) for all liabilities arising in connection with the operation of these businesses prior to their sale by Tyco, including with respect to products manufactured or sold prior to the closing of that transaction, as well as certain environmental liabilities. These indemnities survive indefinitely and are not subject to any dollar limits. In the past, Tyco Indemnitors have made substantial payments and assumed defense of claims in connection with these indemnification obligations. Tycos indemnity does not cover liabilities to the extent caused by us or the operation of our businesses after August 1999, nor does it cover liabilities arising with respect to businesses or sites acquired after August 1999. Since 2007, Tyco has engaged in multiple corporate restructurings, split-offs and divestitures. The result of these transactions is that the assets of, and control over, Tyco Indemnitors has changed. Should any Tyco Indemnitor become financially unable or fail to comply with the terms of the indemnity, we may be responsible for such obligations or liabilities.\nRisks related to our human capital\nWe depend on qualified personnel and if we are unable to retain or hire executive officers, key employees and skilled personnel, we may not be able to achieve our strategic objectives and our business may be adversely affected.\nFrom time to time, there may be changes to our executive leadership team, including as a result of the hiring, departure or realignment of key personnel. For example, in August 2023, we experienced changes to our executive leadership team as a result of the departure of our Chief Executive Officer. Any significant leadership change or senior management transition involves inherent risk, and any failure to find a necessary, suitable replacement on a timely basis to ensure a smooth transition could hinder our strategic planning, business execution and future performance. Our ability to expand or maintain our business depends on our ability to hire, train and retain employees, including executive officers, with the skills necessary to understand and adapt to the continuously developing needs of our customers. The increasing demand for qualified personnel makes it more difficult to attract and retain employees with requisite skill sets, particularly executive officers, as well as employees with specialized technical and trade experience. Changing demographics and labor work force trends also may result in a loss of knowledge and skills as experienced workers retire. If we fail to attract, motivate, train and retain qualified personnel, or if we experience excessive turnover, we may experience declining sales, manufacturing delays or other inefficiencies, increased recruiting, training and relocation costs and other difficulties, and our business, financial condition, results of operations and cash flows could be materially and adversely affected. Competition for qualified personnel, particularly executive officers and skilled technical and trade workers, is intense, and we may not be successful in attracting or retaining qualified personnel, which could negatively impact our business.\nIf we are unable to negotiate collective bargaining agreements on satisfactory terms or we experience strikes, work stoppages, labor unrest or higher than normal absenteeism, our business could suffer.\nMany of our employees at our manufacturing locations are covered by collective bargaining agreements. While we generally have been able to renegotiate collective bargaining agreements on generally satisfactory terms, negotiations may be challenging as the Company must have a competitive cost structure in each market while meeting the compensation and benefits needs of our employees. If we are unable to renew collective bargaining agreements on satisfactory terms, our labor costs could increase, which could impact our financial position and results of operations. Strikes, work stoppages or other forms of labor unrest at any of our plants could impair our ability to supply products to our distributors and customers, which could reduce our sales, increase our expenses and expose us to customer claims.\nFurthermore, our ability to meet product delivery commitments and labor needs while controlling labor costs is subject to numerous external factors, including, but not limited to:\nMarket pressures with respect to prevailing wage rates,\nUnemployment levels,\nHealth and other insurance costs,\nThe impact of legislation or regulations governing labor relations, immigration, minimum wage, and healthcare benefits,\nChanging demographics,\nAvailability of skilled labor, and\nOur reputation within the labor market.\nWe also compete with many other industries and businesses for most of our hourly production employees. An inability to provide wages and/or benefits that are competitive could adversely impact our ability to attract and retain employees. Further, changes in market compensation rates may adversely affect our labor costs.\nOur expenditures for pension obligations could be materially higher than we have predicted.\nWe provide pension benefits to certain current and former employees. To determine our future payment obligations under the plans, certain rates of return on the plans assets, growth rates of certain costs and participant longevity have been estimated. The proportion of the assets held by our United States pension plan invested in fixed income securities, instead of equity securities, has decreased over historical levels. This shift in asset allocation has not resulted in a material change to our estimated rate of return on plan assets for this plan. Assumed discount rates, expected return on plan assets and participant longevity have significant effects on the amounts reported for our pension obligations and pension expense.\nThe funded status of our pension plans may also be influenced by regulatory requirements, which can change unexpectedly and impose higher costs if funding levels are below certain thresholds. We may increase contributions to our pension plans to avoid or reduce these higher costs.\nSignificant adverse changes in credit and capital markets or changes in investments could result in discount rates or actual rates of return on plan assets being materially lower than projected and require us to increase pension contributions in future years to meet funding level requirements. Increasing life spans for plan participants may increase the estimated benefit payments and increase the amounts reported for pension obligations, pension contributions and pension expense. If increased funding requirements are particularly significant and sustained, our overall liquidity could be materially reduced, which could cause us to reduce investments and capital expenditures, or restructure or refinance our debt, among other things.\nThe Israel-Hamas war may adversely affect our ability to staff and operate our Ariel, Israel facility.\nWe have historically employed Palestinians in our Ariel, Israel facility. As a result of the Israel-Hamas war, upon reopening the facility after a temporary shutdown, Palestinian employees have not been permitted to return to the area due to travel and movement restrictions imposed on Palestinian workers in connection with the war. This has resulted in some delays in our ability to produce and deliver products. If this situation continues and we are unable to successfully add supplemental staff resources with sufficient technical skills to replace such workers, we may experience increased delays in our ability to produce and deliver certain of our products to customers, and our results of operations could be adversely impacted.\nRisks related to our international operations\nAny failure to satisfy international trade laws and regulations or to otherwise comply with changes or other trade developments may adversely affect us.\nOur operations require importing and exporting goods and technology among countries on a regular basis. Thus, the sale and shipment of our products and services across international borders, as well as the purchase of components and products from international sources, subject us to extensive trade laws and regulations. Trade laws and regulations are complex, differ by country, and are enforced by a variety of government agencies. Because we are subject to extensive trade laws and regulations in the countries in which we operate, we are subject to the risk that laws and regulations could change in a manner that would expose us to additional costs, penalties or liabilities, and our policies and procedures may not always protect us from actions that would violate international trade laws and regulations. For example, certain federal legislation requires the use of American iron and steel products in certain water projects receiving certain federal appropriations. We have incurred costs in connection with ensuring our ability to certify to these requirements, including those associated with enhancing our assembly operations and sourcing practices. As a result of the varying legal and regulatory requirements to which our cross-border activities are subject, we may not always be in compliance with the trade laws and regulations in all respects. Any improper actions could subject us to civil or criminal penalties, including material monetary fines, or other adverse actions, including denial of import or export privileges, and could harm our reputation and our business prospects.\nIf significant tariffs or other restrictions continue to be placed on foreign imports by the United States and related countermeasures are taken by impacted foreign countries, our sales and results of operations may be harmed.\nIf significant tariffs or other restrictions continue to be placed on foreign imports by the United States and related countermeasures are taken by impacted foreign countries, our sales and results of operations may be harmed. For example, trade tensions between the United States and China have led to a series of significant tariffs on the importation of certain product categories over recent years. The materials subject to these tariffs could impact our raw material costs as well. However, if further tariffs are imposed on a broader range of imports, or if further retaliatory trade measures are taken by China or other countries in response to additional tariffs, we may be required to raise our prices or incur additional expenses, which may result in the loss of customers and harm our operating performance, sales and earnings.\nThe prices of our purchased components and raw materials can be volatile.\nOur operations require substantial amounts of purchased components and raw materials, such as scrap steel, sand, resin, brass ingot and steel pipe. The cost and availability of these materials are subject to economic forces largely beyond our control, including North American and international demand, inflation, foreign currency exchange rates, freight costs, tariffs, commodity speculation and other external factors, including public health crises (such as the COVID-19 pandemic) or other supply chain challenges. Inflation in material costs has occurred in 2022 and 2023 and we expect it to continue into fiscal 2024.\nWe may not be able to pass on all, or any, of increased costs for purchased components and raw materials to our customers or offset fully the effects of these higher costs through productivity improvements. In particular, when purchased component or raw material prices increase rapidly or to significantly higher than normal levels, we may not be able to pass cost increases\nthrough to our customers on a timely basis, if at all, which would reduce our profitability and cash flows. In addition, if purchased components or raw materials are not available or not available on commercially reasonable terms, our sales, profitability and cash flows would be reduced. Our competitors may secure more reliable sources of purchased components and raw materials or they may obtain these supplies on more favorable terms than we do, which could give them a cost advantage.\nOur business, operating results and financial condition may be negatively impacted by geopolitical events, including wars, terrorism, industrial accidents and other business interruptions.\nPolitical events, international disputes, wars, terrorism, industrial accidents and other business interruptions can harm or disrupt international commerce as well as the global economy and could have a materially adverse effect on us and our customers, suppliers, logistics providers, distributors and other channel partners. The threat of terrorism and heightened security and military action in response thereto, or any other current or future acts of terrorism, wars, including the Israel-Hamas and Russia-Ukraine wars, and other events, including economic sanctions and trade restrictions, have disrupted the worlds economies and may cause further disruptions that could negatively impact our business, operating results, and financial condition.\nOur Krausz business includes a manufacturing facility in Ariel, Israel. Supply chain disruptions and our inability to appropriately staff the Ariel facility has limited, and may continue to limit, our ability to produce Krausz products. These impacts are requiring us to take various actions, including changing suppliers, restructuring business relationships, outsourcing portions of the manufacturing process and modifying the manner in which we staff our facilities. Changing our operations in response to wartime impacts can be expensive, time-consuming and disruptive to our operations. If the Israel-Hamas war further escalates, additional restrictions and other governmental actions could increase the severity of the impact on our operations in Israel and could materially adversely affect our business. A severe disruption to our business may result in significant lost sales and may require substantial recovery time and expenditures to resume operations.\nAdditionally, to the extent the Israel-Hamas war causes loss of infrastructure and utilities services, such as energy, transportation, or telecommunications, plant closures and employee concerns in our Krausz business, we could experience increased costs and other negative financial impacts. If such disruptions result in delays or cancellations of customer orders or the manufacture or shipment of our products, our business, operating results, and financial condition could be materially adversely affected.\nOther risks related to our business\nOur business, operations and markets, and those of our suppliers, business partners and customers, may be adversely affected by current and future outbreaks of infectious diseases or other health crises.\nThe COVID-19 pandemic and the resulting impact on global economies have created a number of macroeconomic challenges that have impacted our business, including volatility and uncertainty in business planning, disruptions in global supply chains, material, freight and labor inflation, shortages of and delays in obtaining certain materials and component parts, and labor shortages.\nFuture outbreaks of infectious diseases, including further developments in the COVID-19 pandemic, may result in widespread or localized health crises that adversely affect general commercial activity and the economies and markets of the countries and localities in which we operate, sell, and purchase goods and services. Any outbreak of infectious disease poses the risk that we or our employees, contractors, suppliers, customers, transportation providers, and other business partners may be prevented or impaired from conducting ordinary business activities for an indefinite period of time, including self-imposed facility shutdowns to protect the health and well-being of our employees or government-mandated shutdowns. In addition, our suppliers, business partners and customers may also experience similar negative impacts. Global supply chains may be disrupted, causing shortages, which could impact our ability to manufacture or supply our products. This disruption of our employees, distributors, suppliers and customers may impact our sales and future operating results.\nItem 1C. Cybersecurity\nNot currently applicable.  Item 2.PROPERTIES\nOur principal properties are listed below.\nLocation Activity Square Footage Owned or\nleased\nAlbertville, AL Manufacturing 422,000 Owned\nAriel, Israel Manufacturing 218,300 Leased\nAriel, Israel\nResearch and development\n2,700 Leased\nAtlanta, GA Corporate headquarters 25,000 Leased\nAtlanta, GA Research and development 21,000 Leased\nBarrie, Ontario Distribution 50,000 Leased\nBrownsville, TX Manufacturing 50,000 Leased\nCalgary, Alberta Distribution 40,000 Leased\nChattanooga, TN Manufacturing 525,000 Owned\nChattanooga, TN General and administration 17,000 Leased\nChattanooga, TN Research and development 22,000 Leased\nCleveland, NC Manufacturing 190,000 Owned\nCleveland, TN Manufacturing 109,500 Owned\nCleveland, TN Distribution\n100,000 Leased\nDallas, TX Distribution 26,000 Leased\nDecatur, IL Manufacturing 467,000 Owned\nDecatur, IL\nManufacturing\n168,000 Owned\nEmporia, KS Distribution\n63,000 Leased\nJingmen, China Manufacturing 154,000 Owned\nKimball, TN Manufacturing 233,000 Owned\nOcala, FL Distribution 50,000 Leased\nOntario, CA Distribution 73,000 Leased\nRosh Haayin, Israel General and administration 8,400 Leased\nSouthampton, United Kingdom Research and development 2,300 Leased\nToronto, Ontario Research and development 18,000 Leased\nOur locations are not managed by segment as several of our locations are not dedicated to products from only one of our two segments. We consider our facilities to be well maintained and believe we have sufficient capacity to meet our anticipated needs through 2024. Our leased properties have terms expiring at various dates through 2033. Item 3.LEGAL PROCEEDINGS\nWe are involved in various legal proceedings that have arisen in the normal course of operations. The effect of the outcome of these matters on our financial statements cannot be predicted with certainty as any such effect depends on the amount and timing of the resolution of such matters. Other than the litigation described elsewhere in this Annual Report, we do not believe that any of our outstanding litigation would have a material adverse effect on our business or prospects.\nSee Item 1. BUSINESS - Regulatory and Environmental Matters, Item 1A. RISK FACTORS - We are subject to increasingly stringent environmental, health and safety laws and regulations that impose significant compliance costs. Any failure to satisfy these laws and regulations may adversely affect us, Item 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS - Contingencies and Note 15. of the Notes to Consolidated Financial Statements.\nPART II  Item 5.MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is listed on the New York Stock Exchange under the trading symbol MWA.\nCovenants contained in certain of the debt instruments described in Note 7. of the Notes to Consolidated Financial Statements restrict our ability to declare and pay dividends. Future dividends will be declared at the discretion of our Board of Directors and will depend on our future earnings, financial condition and other factors.\nAt September 30, 2023, there were 89 stockholders of record for our common stock. This figure does not include stockholders whose shares are held in the account of a stockbroker, bank or custodian on behalf of a stockholder or shares which are otherwise beneficially held.\nEquity Compensation Plan Information\nInformation regarding our compensation plans under which equity securities are authorized for issuance is set forth in Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nSale of Unregistered Securities\nWe did not issue any unregistered securities within the past three years.\nIssuer Purchases of Equity Securities\nIn 2015, we announced the authorization of a stock repurchase program for up to $50.0 million of our common stock. The program does not commit us to a particular timing or quantity of purchases, and we may suspend or discontinue the program at any time. In 2017, we announced an increase to the authorized amount of this program to $250.0 million.\nDuring the three months ended September 30, 2023, we repurchased 714,830 shares of our common stock for $10.0 million under our share repurchase authorization, and we had $90.0 million remaining under this authorization as of September 30, 2023.\nPeriod Total number of shares purchased Average price paid per share Total number of shares purchased as part of publicly announced plans or programs Maximum dollar value of shares that may yet be purchased under the plans or programs (in millions)\nJuly 1-31, 2023\n426 $ 16.21 - $ 100.0\nAugust 1-31, 2023\n261,322 $ 13.91 252,336 $ 96.5\nSeptember 1-30, 2023\n505,892 $ 13.96 462,494 $ 90.0\nTotal 767,640 $ 13.94 714,830\nStock Price Performance Graph\nThe following graph compares the Companys cumulative quarterly common stock price performance with the Russell 2000 Stock Index (Russell 2000) and the Dow Jones U.S. Building Materials & Fixtures Index (DJ U.S. Building Materials & Fixtures) since September 30, 2018. Total return values were calculated based on cumulative total return assuming (i) the investment of $100 in our common stock, the Russell 2000 and the DJ U.S. Building Materials & Fixtures on the dates indicated and (ii) reinvestment of all dividends. Item 6. [Reserved]\nNot applicable. Item 7.MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with the consolidated financial statements and related notes included in Item 8. Financial Statements and Supplementary Data of this Annual Report. This discussion and analysis contains forward-looking statements that involve risks, uncertainties and other factors that may cause actual results to differ materially from those projected in any forward-looking statements, as discussed in Disclosure Regarding Forward-Looking Statements. These risks and uncertainties include but are not limited to those set forth in Item 1A. RISK FACTORS. This section of this Form 10-K generally discusses 2023 and 2022 items and year-to-year comparisons between 2023 and 2022. Discussion of year-to-year comparisons between 2022 and 2021 that are not included in this Form 10-K can be found in Managements Discussion and Analysis of Financial Condition and Results of Operations in Item 7. of our Annual Report on Form 10-K for the year ended September 30, 2022.\nOverview\nBusiness\nWe adopted our current management structure effective October 1, 2021 which resulted in a change to our reportable segments. Under this structure, we operate our business through two segments, Water Flow Solutions and Water Management Solutions.\nEffective August 21, 2023, the Companys Chief Executive Officer (CEO) left his role and Marietta Edmunds Zakas, the Companys Chief Financial Officer (CFO) was named President and CEO. Steven S. Heinrichs, the Companys Chief Legal and Compliance Officer was named CFO and continues to serve as Chief Legal and Compliance Officer. In addition, certain other management changes occurred. As a result, the Company incurred transition and retention expense which has been recorded to Strategic reorganization and other charges in our consolidated statements of operations.\nWe estimate approximately 60% to 65% of the Companys 2023 net sales were associated with repair and replacement of municipal water infrastructure, approximately 25% to 30% were related to residential construction activity and approximately 10% were related to natural gas utilities and industrial applications.\nAfter experiencing challenges in 2020 and 2021 resulting from the pandemic, municipal spending on repair and replacement projects in 2023 and 2022 returned to more normalized levels. According to the United States Department of Labor, the trailing twelve-month average consumer price index for water and sewerage rates at September 30, 2023 increased 4.6%.\nRecent Developments\nIn October 2023, the Israel-Hamas war caused a temporary shutdown in our facility in Ariel, Israel. While we have reopened the facility, the war increases the likelihood of supply interruptions and may hinder our ability to acquire the necessary materials we need to make our products. Supply disruptions from lack of access to materials has impacted, and continues to impact, our ability to produce and deliver our products on time and at favorable pricing from our facility in Ariel, Israel.\nAs announced on October 28, 2023, we identified a cybersecurity incident impacting certain internal operations and information technology systems. Based on the information reviewed to date, we believe the unauthorized activity has been contained. All of our facilities are operational and have substantially returned to normalized operations.\nThe cybersecurity incident consisted of unauthorized access and deployment of ransomware by a third party to a portion of our internal information infrastructure. The incident caused temporary disruptions and limitations of access to portions of our business applications supporting aspects of our operations and corporate functions, which limited our ability to take orders and ship products. Shipping delays and investigation and remediation costs in connection with the incident are expected to adversely impact our results for the first quarter of 2024, and such impact may be material. We have largely restored the impacted applications and systems, and we continue to execute business continuity and restoration plans for the remaining impacted applications and systems. As reported on November 29, 2023, we identified a separate cybersecurity incident, which primarily related to a system that was at the end of its useful life and was already in the process of being replaced in the ordinary course of business.\nOur investigation and remediation efforts remain ongoing, including an analysis of data accessed, exfiltrated or otherwise impacted in connection with the cybersecurity incidents. We continue to evaluate the business, financial and related impacts of the cybersecurity incidents.\nOutlook\nWe expect the operating environment during fiscal 2024 to continue to be challenging as a result of high interest rates, the inflationary environment, labor challenges and a potential recession. We anticipate lower demand in the municipal repair and replacement end market due to budgetary pressures on municipalities resulting from high interest rates and inflation, especially for smaller municipalities. Demand from the new residential construction end market decreased in fiscal 2023 reflecting a 12.9% decrease in total housing starts as compared with fiscal 2022 according to Census data. For fiscal 2024, we anticipate that high interest rates will continue to impact housing starts and new lot and land development. In November 2023, Blue Chip Economic Indicators forecasted a 2.2% decrease in total housing starts for the calendar year 2024 compared to the calendar year 2023.\nFor our fiscal year 2024, we anticipate that consolidated net sales will be 3% to 8% lower than our fiscal year 2023 sales primarily driven by a decrease in volumes. In 2023, material costs rose as a result of an increase in purchased parts costs, primarily driven by higher freight, labor and energy costs. In 2024, we anticipate that inflation will continue in some areas leading to a modest increase in manufacturing costs. Additionally, as a result of the cybersecurity incident that occurred subsequent to the end of fiscal 2023, our 2024 operating results will be impacted by the expenses we have incurred and will continue to incur to investigate, assess, and remedy this incident. We currently are unable to estimate the impact that this will have on our financial results.\nResults of Operations\nYear Ended September 30, 2023 Compared to Year Ended September 30, 2022\nYear ended September 30, 2023\nWater Flow\nSolutions Water\nManagement\nSolutions Corporate Consolidated\n(in millions)\nNet sales $ 634.4 $ 641.3 $ - $ 1,275.7\nGross profit 164.9 214.6 - 379.5\nOperating expenses:\nSelling, general and administrative\n85.3 106.9 49.7 241.9\nStrategic reorganization and other charges - 1.7 8.5 10.2\nTotal operating expenses 85.3 108.6 58.2 252.1\nOperating income (loss) $ 79.6 $ 106.0 $ (58.2) 127.4\nPension expense other than service 3.7\nInterest expense, net 14.7\nIncome before income taxes 109.0\nIncome tax expense 23.5\nNet income $ 85.5\nYear ended September 30, 2022\nWater Flow\nSolutions Water\nManagement\nSolutions Corporate Consolidated\n(in millions)\nNet sales $ 714.1 $ 533.3 $ - $ 1,247.4\nGross profit 212.4 151.9 - 364.3\nOperating expenses:\nSelling, general and administrative\n87.1 102.8 48.8 238.7\nStrategic reorganization and other charges 0.2 0.4 6.6 7.2\nGoodwill impairment 6.8 - - 6.8\nTotal operating expenses 94.1 103.2 55.4 252.7\nOperating income (loss)\n$ 118.3 $ 48.7 $ (55.4) 111.6\nPension benefit other than service (3.9)\nInterest expense, net 16.9\nIncome before income taxes 98.6\nIncome tax expense 22.0\nNet income $ 76.6\nConsolidated Analysis\nNet sales for 2023 increased $28.3 million, or 2.3%, to $1,275.7 million from $1,247.4 million in the prior year primarily as a result of higher pricing across most of our product lines partially offset by lower volumes at Water Flow Solutions.\nGross profit increased $15.2 million, or 4.2%, to $379.5 million for 2023 compared with $364.3 million in the prior year. This increase was primarily a result of higher pricing which was partially offset by lower volumes, unfavorable manufacturing performance, including labor and material inefficiencies and increased outsourcing, as well as inflation. Gross margin increased to 29.7% in 2023 as compared with 29.2% in the prior year.\nSelling, general and administrative expenses (SG&A) increased 1.3% to $241.9 million for 2023 from $238.7 million in the prior year. The increase in SG&A was primarily a result of higher costs associated with inflation, third-party fees, and insurance, partially offset by lower personnel-related and incentive costs. As a percentage of net sales, SG&A decreased 10 basis points to 19.0% of net sales from 19.1% in the prior year.\nStrategic reorganization and other charges for 2023 of $10.2 million primarily consisted of expenses associated with the leadership transition and other restructuring charges related to severance in addition to certain transaction-related expenses. Strategic reorganization and other charges for 2022 of $7.2 million primarily consisted of certain transaction-related costs, expenses associated with our restructuring activities, and the Albertville tragedy.\nDuring the year ended September 30, 2022, we incurred a non-cash goodwill impairment charge of $6.8 million within the Water Flow Solutions segment. No impairment charge was recorded in 2023.\nInterest expense, net declined $2.2 million in 2023 from the prior year primarily as a result of higher interest income associated with higher interest rates. The components of net interest expense are provided below.\nYear ended September 30,\n2023 2022\n(in millions)\n4.0% Senior Notes $ 18.0 $ 18.0\nDeferred financing costs amortization 1.0 1.0\nABL Agreement 0.9 0.9\nCapitalized interest (1.6) (2.6)\nOther interest expense 0.1 0.3\nTotal interest expense 18.4 17.6\nInterest income (3.7) (0.7)\nTotal interest expense, net $ 14.7 $ 16.9\nIncome tax expense of $23.5 million in 2023 resulted in an effective income tax rate of 21.6%, which was lower than the 22.3% rate in the prior year reflecting benefits from research and development tax credits and lower effective state tax rates due to state apportionment changes.\nSegment Analysis\nWater Flow Solutions\nNet sales for 2023 decreased $79.7 million, or 11.2%, to $634.4 million from $714.1 million in the prior year. Net sales decreased primarily as a result of lower volumes in iron gate valves and service brass products partially offset by higher pricing across most of Water Flow Solutions product lines.\nGross profit for 2023 decreased $47.5 million, or 22.4%, to $164.9 million from $212.4 million in the prior year primarily as a result of lower volumes, as well as unfavorable manufacturing performance and inflation partially offset by higher pricing across most product lines. Gross margin was 26.0% in 2023, as compared with 29.7% in the prior year.\nSG&A in 2023 decreased 2.1% to $85.3 million from $87.1 million in the prior year primarily as a result of lower personnel and incentive related costs partially offset by higher costs associated with inflation, increased third-party fees, and higher insurance expense. SG&A as a percentage of net sales was 13.4% and 12.2% for 2023 and 2022, respectively.\nDuring the year ended September 30, 2022, Water Flow Solutions incurred a non-cash goodwill impairment charge of $6.8 million. No impairment charge was recorded in 2023.\nWater Management Solutions\nNet sales in 2023 increased $108.0 million, or 20.3%, to $641.3 million from $533.3 million in the prior year primarily as a result of higher pricing across most of Water Management Solutions product lines and increased volumes, particularly of fire hydrants due to an elevated backlog, as well as across most product lines.\nGross profit in 2023 increased $62.7 million or 41.3%, to $214.6 million from $151.9 million in the prior year. Gross margin increased to 33.5% in 2023 from 28.5% in the prior year primarily as a result of higher pricing and increased volumes across most product lines partially offset by unfavorable manufacturing performance and inflation.\nSG&A increased 4.0% to $106.9 million in 2023 from $102.8 million in the prior year primarily as a result of higher costs associated with inflation, third-party fees, and new product development, partially offset by lower personnel-related and incentive costs. SG&A as a percentage of net sales was 16.7% for 2023 and 19.3% in the prior year.\nCorporate\nSG&A increased $0.9 million from $48.8 million in 2022 to $49.7 million in 2023 as a result of higher costs associated with inflation offset by lower personnel and incentive related costs.\nFinancial Condition\nCash and cash equivalents were $160.3 million at September 30, 2023 and $146.5 million at September 30, 2022. Cash and cash equivalents increased during 2023 as a result of $109.0 million in cash provided by operating activities, partially offset by capital expenditures of $47.6 million, dividend payments of $38.1 million, $10.0 million in common stock repurchases, and $4.3 million in effect of currency exchange rate changes on cash.\nReceivables, net were $217.1 million at September 30, 2023 and $228.0 million at September 30, 2022. This decrease was primarily a result of lower sales in the final quarter of the year compared with the prior year.\nInventories, net were $297.9 million at September 30, 2023 and $278.7 million at September 30, 2022. Inventories increased during 2023 as a result of inflation and select inventory management to meet anticipated orders.\nProperty, plant and equipment, net was $311.7 million at September 30, 2023 and $301.6 million at September 30, 2022. Property, plant and equipment increased as a result of $47.6 million in capital expenditures primarily associated with our new foundry in Decatur, Illinois. Depreciation expense was $34.4 million in 2023 compared with $32.0 million in 2022 as a result of generally higher level of capital expenditures over the last two years.\nIntangible assets were $334.0 million at September 30, 2023 and $361.2 million at September 30, 2022. Finite-lived intangible assets, net totaling $61.4 million at September 30, 2023, are amortized over their estimated useful lives. Amortization expense was $28.1 million in 2023 and $28.5 million in 2022. We expect amortization expense for these assets to be approximately $27 million for 2024, decreasing to approximately $7 million in fiscal 2025, approximately $6 million in fiscal 2026 and fiscal 2027, and approximately $5 million in fiscal 2028. Indefinite-lived intangible assets, $272.6 million at September 30, 2023, are not amortized but are tested for potential impairment at least annually.\nAccounts payable and other current liabilities were $218.1 million at September 30, 2023 and $240.2 million at September 30, 2022. Accounts payable decreased during 2023 as a result of timing and a comparative reduction in the volume of inventory purchases. Other current liabilities decreased during 2023 primarily as a result of lower personnel-related expenses, including incentive compensation.\nTotal outstanding debt was $447.4 million as of September 30, 2023 and $446.9 million as of September 30, 2022. Total debt increased due to the amortization of deferred financing costs.\nDeferred income taxes were net liabilities of $73.8 million at September 30, 2023 and $86.3 million at September 30, 2022, primarily related to intangible assets. The $12.5 million decrease in the net liability was primarily a result of an increase in deferred tax assets related to Internal Revenue Code Section 174 pertaining to the amortization of research and development expenditures which was first applicable to us beginning in our fiscal year 2023.\nLiquidity and Capital Resources\nWe had cash and cash equivalents of $160.3 million at September 30, 2023 and approximately $162.4 million of additional borrowing capacity under our asset-based lending arrangement (the ABL) based on September 30, 2023 data. Undistributed earnings from our subsidiaries in Israel, Canada and China are considered to be permanently invested outside of the United States. At September 30, 2023, cash and cash equivalents included $66.7 million, $8.7 million, and $10.9 million in Israel, Canada, and China, respectively.\nWe declared a quarterly dividend of $0.064 per common share on October 24, 2023, payable on or about November 20, 2023 to holders of record as of November 9, 2023, resulting in an estimated $10.0 million cash outlay.\nWe repurchased $10.0 million of our outstanding common stock during the fiscal year ended September 30, 2023 and had $90.0 million remaining under our share repurchase authorization as of September 30, 2023.\nThe ABL and 4.0% Senior Notes contain customary representations and warranties, covenants and provisions governing an event of default. The covenants restrict our ability to engage in certain activities including, but not limited to, the payment of dividends and the redemption of our common stock.\nCollections from customers were higher during the fiscal year ended September 30, 2023 as compared with the prior year period primarily as a result of higher sales during the comparative periods. Inventories increased during the fiscal year ended September 30, 2023 as a result of timing and an increased volume of inventory purchases, partially offset by a decrease in inventory backlog. Other current liabilities and other noncurrent liabilities decreased as a result of employee incentive payouts, operating lease liabilities, and the repayment of the CARES Act employer payroll tax deferral, partially offset by an increase in the warranty accrual and returned goods refund liability.\nCapital expenditures were $47.6 million for 2023 compared with $54.7 million for 2022. Capital expenditures decreased compared with the prior year period primarily as a result of lower expenditures associated with the new Decatur, Illinois foundry. We estimate 2024 capital expenditures will be between $45.0 million and $50.0 million.\nIncome tax payments were higher during 2023 compared with the prior year primarily as a result of higher income before income taxes as well as the timing of certain federal and state extension payments. We expect the effective tax rate in 2024 to be between 23% and 25%.\nOur stock repurchase program allows us to repurchase up to $250.0 million of our common stock, of which we had remaining authorization of $90.0 million as of September 30, 2023. The program does not commit us to any particular timing or quantity of purchases, and we may suspend or discontinue the program at any time. We repurchased 714,830 and 2,654,254 shares of our common stock in 2023 and 2022, respectively.\nWe use letters of credit and surety bonds in the ordinary course of business to ensure the performance of contractual obligations. As of September 30, 2023, we had $12.4 million of letters of credit and $22.2 million of surety bonds outstanding.\nWe anticipate our existing cash, cash equivalents and borrowing capacity combined with our expected operating cash flows will be sufficient to meet our anticipated operating needs, income tax payments, capital expenditures and debt service obligations as they become due through the twelve months from the date of this filing. However, our ability to make these payments will depend largely on our future operating performance, which may be affected by general economic, financial, competitive, legislative, regulatory, business and other factors beyond our control.\nABL Agreement\nOur ABL, as amended, is provided by a consortium of banking institutions and consists of a revolving credit facility of $175.0 million in borrowing capacity that expires in July 29, 2025. Included in the ABL is the ability to borrow up to $25.0 million of swing line loans and up to $60.0 million of letters of credit. The ABL permits us to increase the size of the credit facility by an additional $150.0 million in certain circumstances subject to adequate borrowing base availability.\nOn April 5, 2023, we amended the ABL to replace LIBOR-based loans with Secured Overnight Financing Rate (SOFR) based loans plus an adjustment of 10 basis points, among other immaterial modifications.\nBorrowings under the ABL bear interest at a floating rate equal to SOFR plus an adjustment of 10 basis points and an applicable margin range of 200 to 225 basis points, or a base rate, as defined in the ABL, plus an applicable margin of 100 to 125 basis points. At September 30, 2023, the applicable margin was 200 basis points for SOFR-based loans and 100 basis points for base rate loans.\nThe ABL is subject to mandatory prepayments if total outstanding borrowings under the ABL are greater than the aggregate commitments under the revolving credit facility or if we dispose of overdue accounts receivable in certain circumstances. The borrowing base under the ABL is equal to the sum of (a) 85% of the value of eligible accounts receivable and (b) the lesser of (i) 70% of the value of eligible inventory or (ii) 85% of the net orderly liquidation value of eligible inventory, less certain reserves. Prepayments can be made at any time without penalty.\nSubstantially all of our United States subsidiaries are borrowers under the ABL and are jointly and severally liable for any outstanding borrowings. Our obligations under the ABL are secured by a first-priority perfected lien on all of our United States inventory, accounts receivable, certain cash balances and other supporting obligations.\nThe ABL includes a commitment fee for any unused borrowing capacity of 37.5 basis points per annum. Borrowings are not subject to any financial maintenance covenants unless excess availability is less than the greater of $17.5 million and 10% of the Loan Cap as defined in the ABL. Excess availability based on September 30, 2023 data was $162.4 million, as reduced by $12.4 million of outstanding letters of credit and $0.2 million of accrued fees and expenses.\nIn December 2023, we obtained a waiver under our ABL to provide us additional time to deliver to the ABL lenders certain information that was delayed as a result of the cybersecurity incident. The maximum aggregate of borrowings and other credit extensions under the ABL is limited to $50.0 million at any time outstanding until all of the delayed deliveries required under the ABL have been made.\n4.0% Senior Unsecured Notes\nOn May 28, 2021, we privately issued $450.0 million of 4.0% Senior Unsecured Notes (4.0% Senior Notes), which mature on June 15, 2029 and bear interest at 4.0%, paid semi-annually in June and December. We capitalized $5.5 million of financing costs, which are being amortized over the term of the 4.0% Senior Notes using the effective interest method. Proceeds from the 4.0% Senior Notes, along with cash on hand were used to redeem previously existing 5.5% Senior Notes. Substantially all of our U.S. subsidiaries guarantee the 4.0% Senior Notes, which are subordinate to borrowings under our ABL. Based on quoted market prices the outstanding 4.0% Senior Notes had a fair value of $393.7 million at September 30, 2023.\nAn indenture securing the 4.0% Senior Notes (Indenture) contains customary covenants and events of default, including covenants that limit our ability to incur certain debt and liens. We believe we were in compliance with these covenants at September 30, 2023. There are no financial maintenance covenants associated with the Indenture.\nWe may redeem some or all of the 4.0% Senior Notes at any time prior to June 15, 2024, at certain make-whole redemption prices and on or after June 15, 2024 at specified redemption prices. Additionally, we may redeem up to 40% of the aggregate principal amount of the 4.0% Senior Notes at any time prior to June 15, 2024, with the net proceeds of specified equity offerings at specified redemption prices as set forth in the Indenture. Upon a change of control, as defined, we would be required to offer to purchase the 4.0% Senior Notes at a price equal to 101% of the outstanding principal amount of the 4.0% Senior Notes.\n5.5% Senior Unsecured Notes\nOn June 12, 2018, we privately issued $450.0 million of 5.5% Senior Unsecured Notes (5.5% Senior Notes), which were set to mature in 2026 and bore interest at 5.5%, paid semi-annually. We called the 5.5% Senior Notes effective June 17, 2021 and settled with proceeds from the issuance of the 4.0% Senior Notes and cash on hand. As a result, we incurred $16.7 million in loss on early extinguishment of debt, comprised of a $12.4 million call premium and a $4.3 million write-off of the remaining deferred debt issuance costs associated with the retirement of the 5.5% Senior Notes.\nCredit Ratings\nOur corporate credit rating and the credit ratings for our debt and outlook are presented below.\nMoodys Standard & Poors\nSeptember 30, September 30,\n2023 2022 2023 2022\nCorporate credit rating Ba1 Ba1 BB BB\nABL Agreement Not rated Not rated Not rated Not rated\n4.0% Senior Notes Ba1 Ba1 BB BB\nOutlook Stable Stable Stable Stable\nEffect of Inflation\nWe experience changing price levels primarily related to purchased components and raw materials. During our fiscal year 2023, we experienced an 8% decrease in the average cost per ton of scrap steel and a 2% decrease in the average cost of brass as compared with our fiscal year 2022. We anticipate inflation in raw and other material costs in 2024, including on purchased components, which is likely to have an adverse effect on our margins to the extent we are unable to pass on such higher costs to our customers.\nDuring fiscal year 2023, we experienced labor inflation of approximately 4.5%, consistent with the U.S. Bureau of Labor Statistics for the 12-month period ended September 30, 2023.\nMaterial Cash Requirements\nWe enter into a variety of contractual obligations as part of our normal operations in addition to capital expenditures. As of September 30, 2023, we have (i) debt obligations related to our $450.0 million 4.0% Senior Notes which mature in 2029 and include cash interest payments of $18.0 million in 2024 annually through 2029; (ii) cumulative cash obligations of $29.0 million for operating leases through 2033 and $1.4 million for finance leases through 2028; and (iii) purchase obligations for raw materials and other purchased parts of approximately $106.1 million and $1.4 million which we expect to incur during 2024 and 2025, respectively. Additionally, we will incur costs in 2024 to address and remediate the October 2023 cybersecurity incident, the extent of which is uncertain at this time. We expect to fund these cash requirements from cash on hand and cash generated from operations.\nSeasonality\nOur business is seasonal as a result of the impact of cold weather conditions. Net sales and operating income historically have been lowest in the three month periods ending December 31 and March 31 when the northern United States and most of Canada generally face weather conditions that restrict significant construction activity. For example, prior to the COVID-19 pandemic, net sales for the first half of the fiscal year averaged approximately 45% of consolidated net sales for the five-year period from 2015 to 2019. See Item 1A. RISK FACTORS-Seasonal demand for certain of our products and services may adversely affect our financial results.\nCritical Accounting Estimates\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States (GAAP) requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, sales, expenses and related disclosure of contingent assets and liabilities. These estimates are based upon experience and on various other assumptions we believe to be reasonable under the circumstances. Actual results may differ from these estimates. We consider an accounting estimate to be critical if changes in the estimate that are reasonably likely to occur over time or the use of reasonably different estimates could have a material impact on our financial condition or results of operations. Our critical accounting estimates include the below items.\nRevenue Recognition\nFor the majority of sales, we recognize revenue when control of promised products is transferred to our customers, in amounts that reflect the consideration to which we expect to be entitled in exchange for those products. We account for a contract when it has approval and commitment from both parties, the rights of the parties are identified, the payment terms are identified, the contract has commercial substance and collectability of consideration is probable. We determine the appropriate revenue recognition for our contracts with customers by analyzing the type, terms and conditions of each contract or arrangement with a customer. See Note 3. for more information regarding our revenues.\nInventories, net\nWe record inventories at the lower of first-in, first-out method cost or estimated net realizable value. Inventory cost includes an overhead component that can be affected by levels of production and actual costs incurred. We evaluate the need to record adjustments for impairment of inventory at least quarterly. This evaluation includes such factors as anticipated usage, inventory levels and ultimate product sales value. If in our judgment persuasive evidence exists that the net realizable value of\ninventory is lower than its cost, the inventory value is written-down to its estimated net realizable value. Significant judgments regarding future events and market conditions must be made when estimating net realizable value.\nIncome Taxes\nWe recognize deferred tax liabilities and deferred tax assets for the expected future tax consequences of events that have been included in the financial statements or tax returns. Deferred tax liabilities and assets are determined based on the differences between the financial statements and the tax basis of assets and liabilities, using enacted tax rates in effect for the years in which the differences are expected to reverse. A valuation allowance is provided to offset any net deferred tax assets when, based upon the available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized. Our deferred tax liabilities and assets are based on our expectations of future operating performance, reversal of taxable temporary differences, tax planning strategies, interpretation of the tax regulations currently enacted and rulings in numerous tax jurisdictions.\nWe only record tax benefits for positions that we believe are more likely than not of being sustained under audit examination based solely on the technical merits of the associated tax position. The amount of tax benefit recognized for any position that meets the more-likely-than-not threshold is the largest amount of the tax benefit that we believe is greater than 50% likely of being realized.\nAccounting for the Impairment of Goodwill and Indefinite-lived Intangible Assets\nWe test goodwill and indefinite-lived intangible assets for impairment annually or more frequently if events or circumstances indicate possible impairment. We perform this annual impairment testing on September 1, using standard valuation methodologies and rates that we considered reasonable and appropriate.\nWe evaluate goodwill for impairment using a quantitative analysis. The carrying value of the reporting unit, including goodwill, is compared with the estimated fair value of the reporting unit utilizing a combination of the income and market approaches. The income approach, which is a level 3 fair value measurement, is based on projected debt-free cash flow which is discounted to the present value using discount rates that consider the timing and risk of the cash flows. The market approach is based on the guideline public company method, which uses market multiples to value our reporting units. We weight the income and market approaches in a manner considering the risks of the underlying cash flows.\nThis income approach is dependent on managements best estimates of future operating results, including forecasted sales, earnings before interest, taxes, depreciation and amortization (EBITDA) margins and the selection of discount rates. There are inherent uncertainties related to the assumptions used and to management's application of these assumptions.\nWe test our trade name indefinite-lived intangible assets for impairment using a royalty savings method, which is a variation of the discounted cash flow method. This method estimates a fair value by calculating an estimated discounted future cash flow stream from the hypothetical licensing of the indefinite-lived intangible assets. If this estimated fair value exceeds the carrying value, no impairment is indicated. This analysis is dependent on managements best estimates of future operating results and the selection of reasonable discount rates and hypothetical royalty rates.\nWe performed our annual impairment testing at September 1, 2023. The results of the testing indicated that the fair value exceeded the carrying value of our reporting units which contain goodwill. As such, no impairment charge was recorded. Our determination of the estimated fair value was based on a combination of the discounted cash flow method and the guideline public company method. Additionally, we performed our annual impairment testing of indefinite-lived intangible assets at September 1, 2023 and concluded no impairment losses should be recognized.\nWarranty Cost\nWe accrue for warranty expenses that can include customer costs of repair and/or replacement, including labor, materials, equipment, freight and reasonable overhead costs. We accrue for the estimated cost of product warranties at the time of sale if such costs are determined to be reasonably estimable at that time. Warranty cost estimates are revised throughout applicable warranty periods as better information regarding warranty costs becomes available. Critical factors in our analyses include warranty terms, specific claim situations, general incurred and projected failure rates, the nature of product failures, product and labor costs, and general business conditions. These estimates are inherently uncertain as they are based on historical data. If warranty claims are made in the current period for issues that have not historically been the subject of warranty claims and were not taken into consideration in establishing the accrual or if claims for issues already considered in establishing the accrual exceed expectations, warranty expense may exceed the accrual for that particular product. Additionally, a significant increase in costs to repair or replace could require additional warranty expense. We monitor and analyze our warranty experience and costs periodically and revise our warranty accrual as necessary. However, as we cannot predict actual future claims, the potential exists for the difference in any one reporting period to be material.\nContingencies\nWe are involved in litigation, investigations and claims arising in the normal course of business. We estimate and accrue liabilities resulting from such matters based on a variety of factors, including outstanding legal claims and proposed settlements; assessments by counsel of pending or threatened litigation; and assessments of potential environmental liabilities and remediation costs. We believe we have adequately accrued for these potential liabilities; however, facts and circumstances may change and could cause the actual liability to exceed estimates, or may require adjustments to the recorded liability balances in the future. As we learn new facts concerning contingencies, we reassess our position both with respect to accrued liabilities and other potential exposures. Estimates particularly sensitive to future changes include liabilities recorded for environmental remediation, tax and legal matters. Estimated future environmental remediation costs are subject to change as a result of such factors as the uncertain magnitude of cleanup costs, the unknown time and extent of such remedial actions that may be required, and the determination of our liability in proportion to that of other responsible parties. Estimated future costs related to tax and legal matters are subject to change as events evolve and as additional information becomes available during the administrative and litigation processes. For more information on these and other contingencies, see Note 15. of the Notes to Consolidated Financial Statements. See also Item 1. BUSINESS - Regulatory and Environmental Matters, Item 1A. RISK FACTORS.\nWorkers Compensation, Defined Benefit Pension Plans, Environmental and Other Long-term Liabilities\nWe are obligated for various liabilities that ultimately will be determined over what could be very long future time periods. We established the recorded liabilities for such items at September 30, 2023 using estimates for when such amounts will be paid and what the amounts of such payments will be. These estimates are subject to change based on numerous factors including, among others, claim development, regulatory changes, technology changes, the investment performance of related assets, longevity of participants, the discount rate used and changes to plan designs. Item 7A.QUANTITATIVE AND QUALITATIVE DISCLOSURE ABOUT MARKET RISK\nWe are exposed to various market risks, including potential losses arising from adverse changes in market prices and rates, such as various commodity prices and foreign exchange rates. We do not enter into derivatives or other financial instruments for trading or speculative purposes.\nOur primary financial instruments are cash and cash equivalents. This includes cash in banks and highly rated, liquid money market investments. We believe these instruments are not subject to material potential near-term losses in future earnings from reasonably possible near-term changes in market rates or prices.\nCommodity Price Risk\nOur products are made using various purchased components and several basic raw materials, including brass ingot, scrap steel, sand and resin. We expect prices for these items to fluctuate based on marketplace demand. Our product margins and level of profitability may fluctuate whether or not we sufficiently pass increases in purchased component and raw material costs on to our customers.\nWe experienced an 8% decrease in the average cost per ton of scrap steel and a 2% decrease in the average cost of brass ingot in 2023 compared to 2022. See Item 1A. RISK FACTORS-The prices of our purchased components and raw materials can be volatile.\nCurrency Risk\nOur principal assets, liabilities and operations outside the United States are in Israel, Canada and China. Foreign reporting entities are remeasured into local currencies with the effect reflected in the consolidated statements of operations. Assets and liabilities are translated into United States dollars at currency exchange rates in effect at the end of each period, with the effect of such translation reflected in other comprehensive income (loss). Our stockholders equity will fluctuate depending upon the weakening or strengthening of the United States dollar against these non-United States currencies. Net sales and expenses of these subsidiaries are translated into United States dollars at the average relevant foreign currency exchange rate during the period. Item 8.FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe Reports of Independent Registered Public Accounting Firm, Consolidated Financial Statements and the accompanying Notes to Consolidated Financial Statements that are filed as part of this Annual Report are listed under Item 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES and are set forth beginning on page.  Item 9A.CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in the reports we file or submit under the Securities Exchange Act of 1934, as amended (the Exchange Act) is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission and that such information is accumulated and communicated to our management, including the Chief Executive Officer and the Chief Financial Officer as appropriate, to allow timely decisions regarding required disclosure.\nOur Chief Executive Officer and Chief Financial Officer evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act) as of the end of the period covered by this Annual Report. Based on this evaluation, those officers have concluded that, at September 30, 2023, our disclosure controls and procedures were effective.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in internal control over financial reporting during the quarter ended September 30, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) of the Exchange Act). Internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nWe assessed the effectiveness of our internal control over financial reporting at September 30, 2023. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control - Integrated Framework (2013 framework). After doing so, management concluded that, at September 30, 2023, our internal control over financial reporting was effective.\nThe effectiveness of our internal control over financial reporting at September 30, 2023 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their report which is included in this Annual Report. Item 9B. OTHER INFORMATION\n(a) On December 11, 2023, the Company and certain subsidiaries of the Company entered into a Limited Waiver Agreement to the Companys Credit Agreement dated August 26, 2021 (the Waiver), by an among the Company, each of the subsidiaries party thereto as borrowers, the lenders identified therein and Bank of America, N.A., as administrative agent for the lenders as swing line lender and a Letter of Credit issuer, with respect to the Companys ABL. The Waiver provides the Company with additional time to deliver to the ABL lenders certain information that was delayed as a result of the cybersecurity incident announced on October 28, 2023 and described elsewhere in this Annual Report. Additionally, the maximum aggregate of borrowings and other credit extensions under the ABL is limited to $50.0 million at any time outstanding until all of the delayed deliveries required under the ABL have been made. The foregoing summary of the Waiver is qualified in its entirety by the full text of the Waiver, a copy of which is attached hereto as Exhibit 10.19.7 and incorporated herein by reference.\n(b) Not applicable.\nItem 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III Item 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe name and position at December 14, 2023 and age of each of our executive officers and directors at September 30, 2023 are presented below.\nName Age Position\nMarietta Edmunds Zakas 64 President and Chief Executive Officer\nSteven S. Heinrichs 55 Executive Vice President, Chief Financial Officer and Chief Legal and Compliance Officer\nPaul McAndrew 49 Executive Vice President and Chief Operating Officer\nScott P. Floyd 54 Senior Vice President, Water Flow Solutions\nTodd P. Helms 56 Senior Vice President and Chief Human Resources Officer\nKenji Takeuchi 51 Senior Vice President, Water Management Solutions\nChason A. Carroll 48 Vice President, General Counsel and Corporate Secretary\nRichelle R. Feyerherm 52 Vice President, Operations Controller\nSuzanne G. Smith 56 Vice President and Chief Accounting Officer\nMark J. OBrien 80 Non-Executive Chairman of the Board of Directors\nShirley C. Franklin 78 Director\nThomas J. Hansen 74 Director\nChristine Ortiz 52 Director\nJeffery S. Sharritts 55 Director\nBrian L. Slobodow 55 Director\nLydia W. Thomas 78 Director\nMichael T. Tokarz 73 Director\nStephen C. Van Arsdell 73 Director\nKarl Niclas Ytterdahl\n58 Director\nMarietta Edmunds Zakas has served as our President and Chief Executive Officer since August 2023. She served as Executive Vice President and Chief Financial Officer from January 2018 to August 2023 and as Senior Vice President, Strategy, Corporate Development and Communications from November 2006 to December 2017. She was also the interim head of Human Resources from January 2016 to December 2017. Previously, Ms. Zakas held various positions at Russell Corporation, an athletic apparel, footwear and equipment company, culminating in her role as Corporate Vice President, Chief of Staff, Business Development and Treasurer. From 1993 to 2000, she served as Corporate Vice President, Director of Investor Relations, and Corporate Secretary for Equifax Inc. Ms. Zakas began her career as an investment banker at Morgan Stanley. She earned a Bachelor of Arts degree with honors from Randolph-Macon Womans College (now known as Randolph College), a Master of Business Administration degree from the University of Virginia Darden School of Business and a Juris Doctor from the University of Virginia School of Law. Ms. Zakas is a director of BlueLinx Holdings Inc. and is a former director of Atlantic Capital Bank and Atlantic Capital Bancshares.\nSteven S. Heinrichs has served as our Executive Vice President, Chief Financial Officer and Chief Legal and Compliance Officer since August 2023. He served as our Executive Vice President, Chief Legal and Compliance Officer and Secretary from August 2018 to August 2023. He served as Senior Vice President, General Counsel and Secretary of Neenah, Inc. (f/k/a Neenah Paper, Inc.), which spun off from Kimberly-Clark Corporation in December 2004, from June 2004 to July 2018. Mr. Heinrichs joined Kimberly-Clark as Chief Counsel, Pulp and Paper and General Counsel for Neenah, Inc. Prior to his employment with Kimberly-Clark, Mr. Heinrichs served as Associate General Counsel and Assistant Secretary for Mariner Health Care, Inc., a nursing home and long-term acute care hospital company. Before joining Mariner Health Care in 2003, Mr. Heinrichs served as Associate General Counsel and Assistant Secretary for American Commercial Lines LLC, a leading inland barge and shipbuilding company from 1998 through 2003. Mr. Heinrichs engaged in the private practice of law with Skadden, Arps, Slate, Meagher and Flom LLP and Shuttleworth, Smith, McNabb and Williams PLLC from 1994 through 1998. Mr. Heinrichs earned a Master of Business Administration from the Kellogg School of Management at Northwestern University in 2008, his law degree from Tulane University in 1994, and his Bachelor of Arts degree from the University of Virginia.\nPaul McAndrew has served as our Executive Vice President and Chief Operating Officer since August 2023. He served as our Senior Vice President of Global Operations and Supply Chain from November 2022 to August 2023. Previously, Mr. McAndrew served as Vice President and General Manager of Professional Tools in the Commercial and Residential Solutions business with Emerson Electric Co. from April 2017 to November 2022. Prior to that, he held various operating roles at Kautex Textron GmbH & Co. KG from June 2002 to April 2017, culminating in his role as Vice President. Mr. McAndrew earned a Bachelor of Science degree from Cardiff University.\nScott P. Floyd has served as our Senior Vice President, Water Flow Solutions since October 2021. He served as Senior Vice President, Infrastructure from June 2020 to September 2021; Vice President and General Manager - Specialty Valves from February 2019 to May 2020; Plant Manager of our Cleveland, Tennessee facility from October 2007 to February 2019; Plant Manager of our Brownsville, Texas facility from March 2016 to February 2019; and Operations Manager of our Cleveland, Tennessee facility from September 1998 to October 2007.\nTodd P. Helms has served as our Senior Vice President and Chief Human Resources Officer since February 2020. Previously, Mr. Helms held the position of Executive Vice President and Chief Human Resource Officer at Synovus Financial Corporation and as Senior Vice President, Human Resources at Genuine Parts Company. Mr. Helms earned a Bachelor of Science degree from King College, a Bachelor of Mechanical Engineering from Georgia Institute of Technology and a Master of Business Administration from Ohio University.\nKenji Takeuchi has served as our Senior Vice President, Water Management Solutions since October 2021. He served as Senior Vice President, Technology Solutions from October 2019 to September 2021. Previously, Mr. Takeuchi served as a Startup Catalyst at the Advanced Technology Development Center at Georgia Tech, Georgias technology incubator. Prior to that, he served as Chief Technology Officer and Vice President of Engineering of Honeywell International Inc. and held various executive-level positions at Flextronics, culminating in his role as Vice President, Products and Technology. Mr. Takeuchi earned a Bachelor of Mechanical Engineering from Georgia Institute of Technology and a Master of Engineering from the University of California at Berkeley and completed the Executive Education Program at Stanford Universitys Graduate School of Business.\nChason A. Carroll has served as our Vice President, General Counsel and Corporate Secretary since August 2023. He served as our Vice President, Deputy General Counsel and Assistant Secretary from January 2019 to August 2023 and Senior Assistant General Counsel from March 2013 to January 2019. Prior to joining us, Mr. Carroll held various positions at Atlanticus Holdings Corporation and Motorola Inc and engaged in the private practice of law with Taylor English Duma LLP. Mr. Carroll earned a Bachelor of Electrical Engineering and a Master of Electrical Engineering from Georgia Institute of Technology and his law degree from Georgia State University.\nRichelle R. Feyerherm has served as our Vice President, Operations Controller since November 2019. Previously, Ms. Feyerherm served as a Financial Officer of the Water Products division of Lonza Group, Ltd. from October 2011 to February 2019. Ms. Feyerherm earned her Bachelor of Science degree from the State University of New York and is a certified public accountant.\nSuzanne G. Smith has served as our Vice President and Chief Accounting Officer since January 2021. Previously, Ms. Smith served as Chief Accounting Officer for ModivCare Inc. from February 2019 through November 2020 and for Cumulus Media from May 2017 through February 2019. Ms. Smith is a certified public accountant, and she earned a Bachelor of Science degree from The Ohio State University and a Master of Business Administration from Georgia State University.\nMark J. OBrien has been a member of our Board of Directors since April 2006 and has served as our Non-Executive Chairman since January 2018. He served as Chairman of Walter Investment Management Corp. (formerly Walter Industries Homes Business), a mortgage portfolio owner and mortgage originator and servicer, from 2009 through December 2015, and he served as its Chief Executive Officer from 2009 to October 2015. Mr. OBrien served as President and Chief Executive Officer of Brier Patch Capital and Management, Inc., a real estate management and investment firm, from 2004 to 2009. He served in various executive capacities at Pulte Homes, Inc., a home building company, for 21 years, retiring as President and Chief Executive Officer in 2003. Mr. OBrien earned a Bachelor of Arts degree in history from the University of Miami.\nShirley C. Franklin has been a member of our Board of Directors since November 2010. Ms. Franklin serves as the President of Clarke-Franklin & Associates, Inc., a management consulting firm, and of Clark Lyons LLC, a business development and professional services firm. She is also a co-founder of Authenticity Partners. In addition, Ms. Franklin serves as Chair of the board of directors of the National Center for Civil and Human Rights and is a board member of the Paul Volcker Alliance, both non-profit organizations dedicated to public service missions. Ms. Franklin also serves as a board member on CDC Foundation and several other non-profit organizations including CF Foundation, Atlanta Regional Commission on\nHomelessness, National Alliance for Public Charter Schools, and Purpose Built Schools Atlanta. From 2002 to 2010, Ms. Franklin was mayor of Atlanta, Georgia. Ms. Franklin earned a Bachelor of Arts degree in sociology from Howard University and a Master of Arts degree in sociology from the University of Pennsylvania.\nThomas J. Hansen has been a member of our Board of Directors since October 2011. Until 2012, Mr. Hansen served as the Executive Vice President and Vice Chairman of Illinois Tool Works Inc. (ITW), a manufacturer of fasteners and components, consumable systems and a variety of specialty products and equipment. He joined ITW in 1980 as sales and marketing manager of the Shakeproof Industrial Products businesses. From 1998 until May 2006, Mr. Hansen served as Executive Vice President of ITW. Mr. Hansen earned a Bachelor of Science degree in marketing from Northern Illinois University and a Master of Business Administration degree from Governors State University.\nChristine Ortiz has been a member of our Board of Directors since November 2018. Dr. Ortiz is the Morris Cohen Professor of Materials Science and Engineering at the Massachusetts Institute of Technology. The author of more than 200 scholarly publications, she has supervised research projects across multiple academic disciplines, received 30 national and international honors, including the Presidential Early Career Award in Science and Engineering awarded to her by President George W. Bush, and served as the Dean for Graduate Education at Massachusetts Institute of Technology from 2010 to 2016. She is also the founder of an innovative, nonprofit, higher education educational institution, Station1. Dr. Ortiz has served as a director of Enovis Corporation since 2022. She earned a Bachelor of Science degree from Rensselaer Polytechnic Institute and a Master of Science degree and a Doctor of Philosophy degree from Cornell University, each in the field of materials science and engineering.\nJeffery S. Sharritts has been a member of our Board of Directors since March 2021. Mr. Sharritts is the Executive Vice President and Chief Customer and Partner Officer at Cisco. During his 22-year tenure at Cisco, Mr. Sharritts has held several executive sales roles, most recently Senior Vice President of the Americas from 2018 to 2022 and Senior Vice President, U.S. Commercial Sales from 2014 to 2018. Mr. Sharritts holds Advisory Board Member positions with the Georgia Chamber of Commerce and Metro Atlanta Chamber of Commerce. Mr. Sharritts earned a Bachelor of Science degree in Business Administration from The Ohio State University.\nBrian L. Slobodow has been a member of our Board of Directors since October 2022. Mr. Slobodow Chief Executive Officer of Better Being Co., a manufacturer and distributor of supplements and personal care products. From 2021 to 2023, he served as an Operating Partner of Operational Resource Group, LLC and from 2015 to 2020 he served as an Operating Executive at Golden Gate Capital, where, between 2007 and 2015, he also held senior leadership positions in multiple former portfolio companies. Prior to joining Golden Gate Capital, Mr. Slobodow held multiple leadership positions within Johnson & Johnson Consumer Products from 2003 to 2007 and was a Principal at A.T. Kearney from 2000 to 2003. Mr. Slobodow holds a Bachelor of Science degree in Industrial and Manufacturing Engineering and a Master of Business Administration degree from the Massachusetts Institute of Technology Sloan School of Management.\nLydia W. Thomas has been a member of our Board of Directors since January 2008. Dr. Thomas served as President and Chief Executive Officer of Noblis, Inc., a public interest scientific research, technology and strategy company, from 1996 to 2007. She was previously with The MITRE Corporation, Center for Environment, Resources and Space, serving as Senior Vice President and General Manager from 1992 to 1996, Vice President from 1989 to 1992 and Technical Director from 1982 to 1989. In 2013, she was honored by the Outstanding Directors Exchange as an Outstanding Director of the Year. Dr. Thomas is also a member of the Council on Foreign Relations. She earned a Bachelor of Science degree in zoology from Howard University, a Master of Science degree in microbiology from American University and a Doctor of Philosophy degree in cytology from Howard University.\nMichael T. Tokarz has been a member of our Board of Directors since April 2006. From 1985 until 2002, Mr. Tokarz served as a member of the limited liability company that serves as the general partner of Kohlberg Kravis Roberts & Co. L.P., a private equity company. He served as non-executive Chairman of the Board of Walter Energy, Inc. until July 2016, and until May 2017, he served as a director of CNO Financial Group, Inc. (formerly Conseco, Inc.), an insurance provider, and as a director of Walter Investment Management Corp. Mr. Tokarz has served as the Chairman of the Board of the Tokarz Group, LLC, an investment company, since 2002 and the Chairman of MVC Capital, Inc., a registered investment company, since 2003. He assumed the role of vice chair of Shield T3, LLC in 2020. In 2007, he was honored by the Outstanding Directors Exchange as an Outstanding Director of the Year. Mr. Tokarz earned a Bachelor of Arts degree in economics with high distinction and a Master of Business Administration degree in finance from the University of Illinois.\nStephen C. Van Arsdell has been a member of our Board of Directors since July 2019. Mr. Van Arsdell is a former senior partner of Deloitte LLP, where he served as Chairman and Chief Executive Officer of Deloitte & Touche LLP from 2010-2012 and as Deputy Chief Executive Officer from 2009-2010. He also served as a member of Deloittes board of directors from 2003-2009, during which time he held the position of Vice-Chair. Mr. Van Arsdell has served as a member of the board of\ndirectors of Old National Bancorp since February 2022 and has been a member of the audit committee of Brown Brothers Harriman since 2015. Mr. Van Arsdell previously served as a director of First Midwest Bancorp, Inc. from 2017 to February 2022. Mr. Van Arsdell earned both a Bachelor of Science degree in Accounting and a Master of Accounting Science degree from the University of Illinois. He is a certified public accountant.\nKarl Niclas Ytterdahl has been a member of our Board of Directors since February 2023. Prior to his appointment as a member of the Board, Mr. Ytterdahl served as Board Observer from October 2022 to February 2023. He is an Independent Sponsor, partnering with capital investors to consolidate vehicle service sector companies, and the former Executive Chairman and Chief Operating Officer of Industrial Service Solutions (ISS), an industrial service provider for critical process equipment and a portfolio company of Wynnchurch Capital, a private equity firm. Prior to joining ISS, Mr. Ytterdahl was the President of Dover Vehicle Service Group and a Senior Vice President at Dover Corporation. From 2006 to 2011, Mr. Ytterdahl was Chief Procurement Officer at AES and from 2000 to 2006, he held various roles including Vice President and General Manager at Fisher Scientific and President at Fisher Scientific Switzerland. Mr. Ytterdahl began his career at the management consulting firms A.T. Kearney and Accenture. He has previously served as a director on the board of Advanced Converting Works and currently serves on the board of Euro Motorparts Group. Mr. Ytterdahl earned a Master of Science degree from Chalmers University of Technology and Master of Science degree from the MIT Sloan School of Management.\nAdditional Information\nAdditional information required by this item will be contained in our definitive proxy statement issued in connection with the 2024 Annual Meeting of Stockholders filed with the SEC within 120 days after September 30, 2023 and is incorporated herein by reference.\nOur website address is www.muellerwaterproducts.com. You may read and print our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements and any amendments to those reports from the investor relations section of our website free of charge. These reports are available on our website soon after we file them with or furnish them to the SEC. These reports should also be available through the SECs website at www.sec.gov.\nWe have adopted a written code of conduct that applies to all directors, officers and employees, including a separate code that applies only to our principal executive officer and senior financial officers in accordance with Section 406 of the Sarbanes-Oxley Act of 2002 and the rules of the SEC promulgated thereunder. Our Code of Business Conduct and Ethics is available in the corporate governance section of our website. In the event that we make changes in, or provide waivers from, the provisions of this Code of Business Conduct and Ethics for which SEC disclosure is required, we will make such disclosure in the corporate governance section of our website.\nWe have adopted corporate governance guidelines. The guidelines and the charters of our Board of Directors committees are available in the corporate governance section of our website. Copies of the Code of Business Conduct and Ethics, corporate governance guidelines and Board of Director committee charters are also available in print upon written request to the Corporate Secretary, Mueller Water Products, Inc., 1200 Abernathy Road N.E., Suite 1200, Atlanta, GA 30328. Item 11.EXECUTIVE COMPENSATION\nThe information required by this item will be contained in our definitive proxy statement issued in connection with our 2024 Annual Meeting of Stockholders and is incorporated herein by reference. Item 12.SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nExcept for the information set forth below and the information set forth in Part II, Item 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES, the information required by this item will be contained in our definitive proxy statement issued in connection with our 2024 Annual Meeting of Stockholders and is incorporated herein by reference.\nSecurities Authorized for Issuance under Equity Compensation Plans\nWe have two compensation plans under which our equity securities are authorized for issuance: (1) The Mueller Water Products, Inc. 2006 Employee Stock Purchase Plan (ESPP), as amended; and (2) The Mueller Water Products, Inc. 2006 Stock Incentive Plan (2006 Plan), as amended.\nThe following table sets forth certain information relating to these equity compensation plans at September 30, 2023.\nNumber of securities\nto be issued\nupon exercise of\noutstanding options,\nwarrants and rights Weighted average\nexercise price of\noutstanding options,\nwarrants and rights Number of securities\nremaining available\nfor future issuance\nEquity compensation plans approved by stockholders:\n2006 Plan 2,609,215 (1)\n$ 12.10 (2)\n4,389,099 (3)\nESPP 31,139 - 1,921,631 (4)\nTotal 2,640,354 6,310,730\n(1)Consists of the maximum number of shares that could be earned upon exercise or vesting of outstanding stock-based awards granted under the 2006 Plan. This includes 908,464 shares associated with share-settled performance units that may or may not be earned, depending on Company performance or stock market performance, as described in Note 10. of the Notes to the Consolidated Financial Statements.\n(2)Weighted-average exercise price of 1,127,468 options.\n(3)The number of securities initially available for issuance under the 2006 Plan was 20,500,000 shares.\n(4)The number of securities initially available for issuance under the ESPP Plan was 5,800,000 shares. Item 13.CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this item will be contained in our definitive proxy statement issued in connection with our 2024 Annual Meeting of Stockholders and is incorporated herein by reference. Item 14.PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this item will be contained in our definitive proxy statement issued in connection with our 2024 Annual Meeting of Stockholders and is incorporated herein by reference.\nPART IV Item 15.EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)Financial Statements\nIndex to financial statements Page\nnumber\nReports of Independent Registered Public Accounting Firm (PCAOB ID: 42)\nConsolidated Balance Sheets at September 30, 2023 and 2022\nConsolidated Statements of Operations for the years ended September 30, 2023, 2022 and 2021\nConsolidated Statements of Comprehensive Income for the years ended September 30, 2023, 2022 and 2021\nConsolidated Statements of Equity for the years ended September 30, 2023, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended September 30, 2023, 2022 and 2021\nNotes to Consolidated Financial Statements for the three years ended September 30, 2023, 2022 and 2021\n(b)Financial Statement Schedules\nThe information required by Schedule II is included in the Notes to Consolidated Financial Statements. All other schedules required by Item 15(b) are not applicable or not required.\n(c)Exhibits\nExhibit no. Document\n2.1 Agreement and Plan of Merger dated as of June 17, 2005 among Mueller Water Products, Inc., Walter Industries, Inc., JW MergerCo, Inc. and DLJ Merchant Banking II, Inc., as stockholders representative. Incorporated by reference to Exhibit 2.1 to Mueller Water Products, Inc. Form 8-K (File no. 333-116590) filed on June 21, 2005.\n2.2 Letter Agreement dated as of February 23, 2006 between Walter Industries, Inc. and Mueller Water Products, Inc. Incorporated by reference to Exhibit 10.1 to Mueller Water Products, Inc. Form 8-K (File no. 333-131521) filed February 27, 2006.\n2.3 Agreement and Plan of Merger, dated as of January 31, 2006, by and among Mueller Holding Company, Inc., Mueller Water Products, LLC and Mueller Water Products Co-Issuer, Inc. Incorporated by reference to Exhibit 2.1 Mueller Water Products, Inc. Form 8-K (File no. 333-116590) filed on February 3, 2006.\n2.4 Purchase Agreement dated as of January 6, 2017, by and among OEP Pioneer LLC, OEP Pioneer (Canada) Holdings Corp., Mueller Co. LLC, Anvil International, LLC and Mueller Water Products, Inc. Incorporated by reference to Exhibit 2.1 to Mueller Water Products, Inc. Form 8-K (File No. 001-32892) filed January 10, 2017.\n3.1 Amended and Restated Bylaws of Mueller Water Products, Inc. Incorporated by reference to Exhibit 3.1 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on December 4, 2017.\n3.2 Second Restated Certificate of Incorporation of Mueller Water Products, Inc. Incorporated by reference to Exhibit 3.2 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on January 25, 2012.\n4.1 Indenture, dated as of May 28, 2021, between Mueller Water Products, Inc., the Guarantors and Wells Fargo Bank, National Association, as trustee. Incorporated by reference to Exhibit 4.1 to Mueller Water Products, Inc. Form 8-K (File no.001-32892) filed on June 1, 2021.\n4.3 Description of Securities registered under Section 12 of the Securities Exchange Act of 1934. Incorporated by reference to Exhibit 4.2 to Mueller Water Products, Inc. Form 10-K (File no. 001-32892) filed on November 19, 2020).\n10.2 Income Tax Allocation Agreement by and among Walter Industries, Inc., the Walter Affiliates (as defined therein), Mueller Water Products, Inc. and the Mueller Affiliates (as defined therein). Incorporated by reference to Exhibit 10.2 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on May 30, 2006.\n10.3.1+\nMueller Water Products, Inc. Second Amended and Restated 2006 Stock Incentive Plan. Incorporated by reference to Exhibit D to Mueller Water Products, Inc. Form DEF 14A (File no. 001-32892) filed on January 15, 2016.\n10.4.2+\nMueller Water Products, Inc. Form of Notice of Stock Option Grant. Incorporated by reference to Exhibit 10.4.2 to Mueller Water Products, Inc. Form 10-K (File no. 001-32892) filed on November 26, 2014.\nExhibit no. Document\n10.6.1+\nMueller Water Products, Inc. Amended and Restated 2006 Employee Stock Purchase Plan. Incorporated by reference to Exhibit C to Mueller Water Products, Inc. Form DEF 14A (File no. 001-32892) filed on January 15, 2016.\n10.7+\nMueller Water Products, Inc. Directors Deferred Fee Plan. Incorporated by reference to Exhibit 10.7 to Mueller Water Products, Inc. 8-K (File no. 001-32892) filed on May 30, 2006.\n10.8+\nForm of Mueller Water Products, Inc. Director Indemnification Agreement. Incorporated by reference to Exhibit 99.2 to Mueller Water Products, Inc. 8-K (File no. 001-32892) filed on October 31, 2008.\n10.9+\nExecutive Incentive Plan of Mueller Water Products, Inc. Incorporated by reference to Exhibit 10.6 to Mueller Water Products, Inc. 8-K (File no. 001-32892) filed on May 30, 2006.\n10.10+\nMueller Water Products, Inc. Executive Deferred Compensation Plan. Incorporated by reference to Exhibit 99.3 to Mueller Water Products, Inc. 8-K (File no. 001-32892) filed on October 31, 2008.\n10.11.2+\nAmended and Restated Mueller Water Products, Inc. Supplemental Defined Contribution Plan, effective as of January 1, 2009. Incorporated by reference to Exhibit 10.13.2 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on February 9, 2009.\n10.14 Joint Litigation Agreement dated December 14, 2006 between Walter Industries, Inc. and Mueller Water Products, Inc. Incorporated by reference to Exhibit 10.3 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on December 19, 2006.\n10.16+\nForm of Amendment to Executive Employment Agreement. Incorporated by reference to Exhibit 99.1 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on February 6, 2009.\n10.17.1+\nMueller Water Products, Inc. Amended and Restated 2010 Management Incentive Plan. Incorporated by reference to Exhibit B to Mueller Water Products, Inc. Form DEF 14A (File no. 001-32892) filed on January 15, 2016.\n10.19 Credit Agreement, dated August 26, 2010, among Mueller Water Products, Inc. and the borrowing subsidiaries named on the signature pages thereto, each as a Borrower, certain financial institutions, as Lenders, JPMorgan Chase Bank, N.A., as Syndication Agent, Wells Fargo Bank, National Association and SunTrust Bank, as Co-Documentation Agents, Bank of America, N.A. as Administrative Agent and Banc of America Securities LLC and J.P. Morgan Securities Inc., as Joint Lead Arrangers and Joint Bookrunners. Incorporated by reference to Exhibit 10.23 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on August 27, 2010.\n10.19.1 First Amendment to Credit Agreement, dated December 18, 2012. Incorporated by reference to Exhibit 10.20.1 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on December 19, 2012.\n10.19.2 Second Amendment to Credit Agreement, dated November 25, 2014. Incorporated by reference to Exhibit 10.19.2 to Mueller Water Products, Inc. Form 10-K (File no. 001-32892) filed on November 26, 2014.\n10.19.3 Third Amendment to Credit Agreement, dated July 12, 2016. Incorporated by reference to Exhibit 10.19.3 to Mueller Water Products, Inc. Form 10-Q (File no. 001-32892) filed on August 8, 2016.\n10.19.4\nFourth Amendment to Credit Agreement, dated January 6, 2017. Incorporated by reference to Exhibit 10.1 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on January 10, 2017.\n10.19.5\nFifth Amendment to Credit Agreement, dated July 30, 2020. Incorporated by reference to Exhibit 10.1 to Mueller Water Products, Inc. Form 10-Q (File no. 001-32892) filed on August 6, 2020.\n10.19.6\nSixth Amendment to Credit Agreement, dated April 5, 2023. Incorporated by reference to Exhibit 10.1 to Mueller Water Products, Inc. Form 10-Q (File no. 001-32892) filed on May 9, 2023.\n10.19.7*\nLimited Waiver Agreement to Credit Agreement, Dated December 11, 2023.\n10.21 Purchase Agreement, dated March 7, 2012, among Mueller Water Products, Inc., Mueller Group, LLC and USP Holdings Inc. Incorporated by reference to Exhibit 2.3 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed on March 8, 2012.\n10.29+\nEmployment Agreement, dated September 15, 2008, as amended, between Mueller Water Products Inc. and Marietta Edmunds Zakas. Incorporated by reference to Exhibit 10.28 to Mueller Water Products, Inc. Form 10-K (File no. 001-32892) filed November 22, 2016.\n10.29.2+\nFourth Amendment, dated December 27, 2017, to Employment Agreement, dated September 15, 2008, as amended, between Mueller Water Products Inc. and Marietta Edmunds Zakas. Incorporated by reference to Exhibit 10.1 to Mueller Water Products, Inc. Form 8-K (File no. 001-32892) filed December 28, 2017.\n10.29.3+\nExecutive Change-in-Control Severance Agreement, dated September 30, 2019 by and between Mueller Water Products Inc. and Marietta Edmunds Zakas. Incorporated by reference to Exhibit 10.29.4 to Mueller Water Products, Inc. Form 10-K (File no. 001-32892) filed on November 19, 2020).\nExhibit no. Document\n10.29.4+*\nLetter Agreement, dated August 21, 2023, by and between Mueller Water Products Inc. and Marietta Edmunds Zakas.\n10.29.5+*\nTransition Grant Award Agreement, dated August 24, 2023, by and between Mueller Water Products, Inc. and Marietta Edmunds Zakas.\n10.30+\nEmployment Agreement, dated January 4, 2017, by and between Mueller Water Products Inc. and John Scott Hall. Incorporated by reference to Exhibit 10.2 to Mueller Water Products, Inc. Form 8-K (File No. 001-32892) filed January 10, 2017.\n10.30.1+\nExecutive Change-in-Control Severance Agreement, dated September 30, 2019 by and between Mueller Water Products Inc. and J. Scott Hall. Incorporated by reference to Exhibit 10.30.3 to Mueller Water Products, Inc. Form 10-K (File no. 001-32892) filed on November 19, 2020).\n10.30.2+*\nTransition and Separation Agreement, dated August 21, 2023, by and between Mueller Water Products, Inc. and J. Scott Hall.\n10.31+\nEmployment Agreement, dated July 18, 2018, by and between Mueller Water Products Inc. and Steven S. Heinrichs. Incorporated by reference to Exhibit 10.31 to Mueller Water Products, Inc. Form 10-K (File No. 001-32892) filed November 21, 2018.\n10.31.2+\nExecutive Change-in-Control Severance Agreement, dated September 30, 2019 by and between Mueller Water Products and Steven S. Heinrichs. Incorporated by reference to Exhibit 10.30.2 to Mueller Water Products, Inc. Form 10-K (File no. 001-32892) filed on November 19, 2020).\n10.31.3+*\nLetter Agreement, dated August 21, 2023, by and between Mueller Water Products, Inc. and Steven S. Heinrichs.\n10.31.4+*\nTransition Grant Award Agreement, dated August 24, 2023, by and between Mueller Water Products, Inc. and Steven S. Heinrichs.\n10.32+\nMueller Water Products, Inc. Form of Performance Restricted Stock Unit Award Agreement. Incorporated by reference to Exhibit 10.32 to Mueller Water Products, Inc. Form 10-K (File No. 001-32892) filed November 19, 2021.\n10.33+\nMueller Water Products, Inc. Form of Restricted Stock Unit Award Agreement. Incorporated by reference to Exhibit 10.33 to Mueller Water Products, Inc. Form 10-K (File No. 001-32892) filed November 19, 2021.\n10.34+\nMueller Water Products, Inc. Form of Stock Option Grant Award Agreement. Incorporated by reference to Exhibit 10.34 to Mueller Water Products, Inc. Form 10-K (File No. 001-32892) filed November 19, 2021.\n10.35 Cooperation Agreement dated October 11, 2022, among Mueller Water Products, Inc. and Ancora Catalyst Institutional, LP; Ancora Merlin Institutional, LP; Ancora Catalyst, LP; Ancora Merlin, LP; Ancora Alternatives LLC; Ancora Advisors, LLC; Ancora Family Wealth Advisors, LLC; The Ancora Group LLC; Inverness Holdings LL; Ancora Holdings Group, LLC and Frederick D. DiSanto. Incorporated by reference to Exhibit 10.1 to Mueller Water Products, Inc. Form 8-K (File no 001-32892) filed October 13, 2022.\n10.36.1+*\nLetter Agreement, dated August 21, 2023, by and between Mueller Water Products, Inc. and Paul McAndrew.\n10.36.2+*\nEmployment Agreement, dated August 21, 2023, by and between Mueller Water Products, Inc. and Paul McAndrew.\n10.36.3+*\nTransition Grant Award Agreement, dated August 24, 2023, by and between Mueller Water Products, Inc. and Paul McAndrew.\n10.36.4+*\nExecutive Change-in-Control Severance Agreement, dated August 21, 2023, by and between Mueller Water Products, Inc. and Paul McAndrew.\n10.37+*\nMueller Water Products, Inc. Form of Retention Award Agreement.\n14.1+*\nCode of Business Conduct and Ethics for Mueller Water Products, Inc.\n21.1*\nSubsidiaries of Mueller Water Products, Inc.\n23.1*\nConsent of Independent Registered Accounting Firm.\n31.1*\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1*\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2*\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97.1*\nMueller Water Products, Inc. Incentive Compensation Recovery Policy.\nExhibit no. Document\n101*\nThe following financial information from the Annual Report on Form 10-K for the year ended September 30, 2023, formatted in XBRL (Extensible Business Reporting Language), (i) the Consolidated Balance Sheets, (ii) the Consolidated Statements of Operations, (iii) the Consolidated Statements of Comprehensive Income, (iv) the Consolidated Statements of Equity, (v) the Consolidated Statements of Cash Flows, and (vi) the Notes to Consolidated Financial Statements.\n104*\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n+ Management compensatory plan, contract or arrangement\n* Filed or furnished, as applicable, with this Annual Report\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: December 14, 2023\nMUELLER WATER PRODUCTS, INC.\nBy: /s/ Marietta Edmunds Zakas\nName: Marietta Edmunds Zakas\nTitle: President and Chief Executive Officer\nPursuant to the requirements of the Securities Act of 1934, as amended, this report has been signed by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Marietta Edmunds Zakas President and Chief Executive Officer December 14, 2023\nMarietta Edmunds Zakas\n/s/ Steven S. Heinrichs Chief Financial Officer and Chief Legal and Compliance Officer (Principal Financial Officer)\nDecember 14, 2023\nSteven S. Heinrichs\n/s/ Suzanne G. Smith Vice President and Chief Accounting Officer (Principal Accounting Officer)\nDecember 14, 2023\nSuzanne G. Smith\n/s/ Mark J. OBrien Non-Executive Chairman of the Board of Directors December 14, 2023\nMark J. OBrien\n/s/ Shirley C. Franklin Director December 14, 2023\nShirley C. Franklin\n/s/ Thomas J. Hansen Director December 14, 2023\nThomas J. Hansen\n/s/ Christine Ortiz Director December 14, 2023\nChristine Ortiz\n/s/ Jeffery S. Sharritts Director December 14, 2023\nJeffery S. Sharritts\n/s/ Brian L. Slobodow Director December 14, 2023\nBrian L. Slobodow\n/s/ Lydia W. Thomas Director December 14, 2023\nLydia W. Thomas\n/s/ Michael T. Tokarz\nDirector December 14, 2023\nMichael T. Tokarz\n/s/ Stephen C. Van Arsdell Director December 14, 2023\nStephen C. Van Arsdell\n/s/ Karl Niclas Ytterdahl\nDirector December 14, 2023\nKarl Niclas Ytterdahl\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Mueller Water Products, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Mueller Water Products, Inc. and subsidiaries (the Company) as of September 30, 2023 and 2022, the related consolidated statements of operations, comprehensive income, equity and cash flows for each of the three years in the period ended September 30, 2023, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated December 14, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nF- 1\nValuation of Goodwill\nDescription of the Matter At September 30, 2023, the Companys goodwill was $93.7 million. As described in Note 5 to the consolidated financial statements, goodwill is tested at the reporting unit level on an annual basis and between annual tests if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value. The Company performed its annual impairment tests of goodwill and determined the fair values of its reporting units using the discounted cash flow method, a form of the income approach, and the guideline public company method, a form of the market approach.\nAuditing managements estimates of reporting unit fair values using the discounted cash flow method involved especially subjective judgments due to the significant estimation uncertainty in determining the fair values of the reporting units. In particular, the fair value estimates were sensitive to significant assumptions such as forecasted revenues, EBITDA margins and discount rates. These significant assumptions are forward-looking and could be affected by future industry, market and economic conditions.\nHow We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design and tested the operating effectiveness of the Companys controls over review of the fair values of the reporting units. This included testing controls over managements review of the significant assumptions described above.\nTo test the estimated fair values of the reporting units, we performed audit procedures that included, among others, assessing the methodologies used to estimate fair values, testing the significant assumptions used to develop the fair value estimates, and testing the underlying data used by the Company in its analysis for completeness and accuracy. For example, we evaluated managements forecasted revenues and EBITDA margins used in the fair value estimates by comparing those assumptions to historical results and available market information. We also involved our valuation specialists to evaluate the valuation methodologies and the discount rates. As part of this evaluation, we compared the discount rates to market data. In addition, we performed a sensitivity analysis on the significant assumptions to evaluate the potential change in the fair values of the reporting units that would result from changes in the assumptions.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2007.\nAtlanta, Georgia\nDecember 14, 2023\nF- 2\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Mueller Water Products, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Mueller Water Products, Inc. and subsidiaries internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Mueller Water Products, Inc. and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 30, 2023 and 2022, the related consolidated statements of operations, comprehensive income, equity and cash flows for each of the three years in the period ended September 30, 2023, and the related notes and our report dated December 14, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nAtlanta, Georgia\nDecember 14, 2023\nF- 3\nMUELLER WATER PRODUCTS, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nSeptember 30,\n2023 2022\n(in millions, except share amounts)\nAssets:\nCash and cash equivalents $ 160.3 $ 146.5\nReceivables, net of allowance for credit losses of $7.3 million and $5.6 million\n217.1 228.0\nInventories, net 297.9 278.7\nOther current assets 31.5 26.8\nTotal current assets 706.8 680.0\nProperty, plant and equipment, net 311.7 301.6\nIntangible assets, net 334.0 361.2\nGoodwill, net 93.7 98.6\nOther noncurrent assets 58.8 56.7\nTotal assets $ 1,505.0 $ 1,498.1\nLiabilities and stockholders equity:\nCurrent portion of long-term debt $ 0.7 $ 0.8\nAccounts payable 102.9 122.8\nOther current liabilities 115.2 117.4\nTotal current liabilities 218.8 241.0\nLong-term debt 446.7 446.1\nDeferred income taxes 73.8 86.3\nOther noncurrent liabilities 54.2 55.4\nTotal liabilities 793.5 828.8\nCommitments and contingencies (Note 15.)\nPreferred stock: par value $0.01 per share; 60,000,000 shares authorized, none outstanding at September 30, 2023 and 2022\n- -\nCommon stock: par value $0.01 per share; 600,000,000 shares authorized; 155,871,932 and 155,844,138 shares outstanding at September 30, 2023 and 2022, respectively\n1.6 1.6\nAdditional paid-in capital 1,240.4 1,279.6\nAccumulated deficit (481.8) (567.3)\nAccumulated other comprehensive loss (48.7) (44.6)\nTotal stockholders equity 711.5 669.3\nTotal liabilities and stockholders equity $ 1,505.0 $ 1,498.1\nThe accompanying notes are an integral part of the consolidated financial statements.\nF- 4\nMUELLER WATER PRODUCTS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear ended September 30,\n2023 2022 2021\n(in millions, except per share amounts)\nNet sales $ 1,275.7 $ 1,247.4 $ 1,111.0\nCost of sales 896.2 883.1 752.5\nGross profit 379.5 364.3 358.5\nOperating expenses:\nSelling, general and administrative 241.9 238.7 218.8\nStrategic reorganization and other charges 10.2 7.2 8.0\nGoodwill impairment - 6.8 -\nTotal operating expenses 252.1 252.7 226.8\nOperating income 127.4 111.6 131.7\nPension expense (benefit) other than service 3.7 (3.9) (3.3)\nInterest expense, net 14.7 16.9 23.4\nLoss on early extinguishment of debt - - 16.7\nIncome before income taxes 109.0 98.6 94.9\nIncome tax expense 23.5 22.0 24.5\nNet income $ 85.5 $ 76.6 $ 70.4\nNet income per share:\nBasic $ 0.55 $ 0.49 $ 0.44\nDiluted $ 0.55 $ 0.48 $ 0.44\nWeighted average shares outstanding:\nBasic 156.3 157.4 158.4\nDiluted 156.8 158.0 159.2\nDividends declared per share $ 0.244 $ 0.232 $ 0.220\nThe accompanying notes are an integral part of the consolidated financial statements.\nF- 5\nMUELLER WATER PRODUCTS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYear ended September 30,\n2023 2022 2021\n(in millions)\nNet income $ 85.5 $ 76.6 $ 70.4\nOther comprehensive income (loss), net of income tax::\nPension actuarial amortization 7.8 (14.1) 10.5\nForeign currency translation (11.9) (25.5) 9.2\nTotal other comprehensive (loss) income (4.1) (39.6) 19.7\nTotal comprehensive income $ 81.4 $ 37.0 $ 90.1\nThe accompanying notes are an integral part of the consolidated financial statements.\nF- 6\nMUELLER WATER PRODUCTS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EQUITY\nCommon\nstock Additional\npaid-in\ncapital Accumulated\ndeficit Accumulated\nother\ncomprehensive\n(loss) income Total\n(in millions)\nBalance at September 30, 2020 $ 1.6 $ 1,378.0 $ (714.2) $ (24.7) $ 640.7\nNet income - - 70.4 - 70.4\nCumulative effect of accounting change - - (0.1) - (0.1)\nDividends declared - (34.8) - - (34.8)\nStock-based compensation - 8.1 - - 8.1\nShares retained for employee taxes - (1.0) - - (1.0)\nCommon stock issued - 1.9 - - 1.9\nStock repurchased under buyback program - (10.0) - - (10.0)\nOther comprehensive income, net of tax - - - 19.7 19.7\nBalance at September 30, 2021 1.6 1,342.2 (643.9) (5.0) 694.9\nNet income - - 76.6 - 76.6\nDividends declared - (36.5) - - (36.5)\nStock-based compensation - 8.7 - - 8.7\nShares retained for employee taxes - (1.8) - - (1.8)\nCommon stock issued - 2.0 - - 2.0\nStock repurchased under buyback program - (35.0) - - (35.0)\nOther comprehensive loss, net of tax - - - (39.6) (39.6)\nBalance at September 30, 2022 1.6 1,279.6 (567.3) (44.6) 669.3\nNet income - - 85.5 - 85.5\nDividends declared - (38.1) - - (38.1)\nStock-based compensation - 8.5 - - 8.5\nShares retained for employee taxes - (2.3) - - (2.3)\nCommon stock issued - 2.7 - - 2.7\nStock repurchased under buyback program - (10.0) - - (10.0)\nOther comprehensive loss, net of tax - - - (4.1) (4.1)\nBalance at September 30, 2023 $ 1.6 $ 1,240.4 $ (481.8) $ (48.7) $ 711.5\nThe accompanying notes are an integral part of the consolidated financial statements.\nF- 7\nMUELLER WATER PRODUCTS, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear ended September 30,\n2023 2022 2021\n(in millions)\nOperating activities:\nNet income $ 85.5 $ 76.6 $ 70.4\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation 34.4 32.0 31.4\nAmortization 28.1 28.5 28.2\nGain on sale of assets (4.0) - -\nGoodwill impairment - 6.8 -\nLoss on early extinguishment of debt\n- - 16.7\nStock-based compensation 8.5 8.7 8.1\nPension cost (benefit) 4.4 (2.6) (1.9)\nDeferred income taxes (14.4) (3.5) (5.3)\nInventory reserves provision 0.4 1.6 3.1\nOther, net 0.9 1.3 1.3\nChanges in assets and liabilities, net of acquisitions:\nReceivables, net 10.9 (17.8) (29.9)\nInventories, net (19.9) (98.3) (23.5)\nOther assets (3.3) 1.3 (4.9)\nAccounts payable (19.7) 32.2 23.0\nOther current liabilities (2.0) (8.5) 37.5\nOther noncurrent liabilities (0.8) (6.0) 2.5\nNet cash provided by operating activities\n109.0 52.3 156.7\nInvesting activities:\nCapital expenditures (47.6) (54.7) (62.7)\nAcquisitions, net of cash acquired - (0.2) (19.7)\nProceeds from sales of assets 5.5 - 0.7\nNet cash used in investing activities (42.1) (54.9) (81.7)\nFinancing activities:\nRepayment of 5.5% Senior Notes - - (462.4)\nIssuance of 4.0% Senior Notes - - 450.0\nDividends paid (38.1) (36.5) (34.8)\nStock repurchased under buyback program\n(10.0) (35.0) (10.0)\nProceeds from financing transaction - - 3.9\nEmployee taxes related to stock-based compensation (2.3) (1.8) (1.0)\nCommon stock issued 2.7 2.0 1.9\nDeferred financing costs paid\n- - (6.0)\nPayments for finance lease obligations (1.1) (0.7) (0.4)\nNet cash used in financing activities (48.8) (72.0) (58.8)\nEffect of currency exchange rate changes on cash (4.3) (6.4) 2.4\nNet change in cash and cash equivalents 13.8 (81.0) 18.6\nCash and cash equivalents at beginning of year 146.5 227.5 208.9\nCash and cash equivalents at end of year $ 160.3 $ 146.5 $ 227.5\nThe accompanying notes are an integral part of the consolidated financial statements.\nF- 8\nSupplemental cash flow information:\nCash paid for interest $ 15.1 $ 19.2 $ 25.3\nCash paid for income taxes $ 37.7 $ 26.9 $ 16.8\nThe accompanying notes are an integral part of the consolidated financial statements.\nF- 9\nMUELLER WATER PRODUCTS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1. Organization\nMueller Water Products, Inc., a Delaware corporation, together with its consolidated subsidiaries, operates in two business segments: Water Flow Solutions and Water Management Solutions. These segments are based on a management reorganization that became effective October 1, 2021; prior period information was recast to conform to the current presentation. Water Flow Solutions portfolio includes iron gate valves, specialty valves and service brass products. Water Management Solutions portfolio includes fire hydrants, repair and installation, natural gas, metering, leak detection, and pressure management and control products and solutions. The Company, we, us or our refers to Mueller Water Products, Inc. and its subsidiaries. With regard to the Companys segments, we, us or our may also refer to the segment being discussed.\nWe have approximately 3,200 employees globally, of which approximately 58% of our United States hourly workers are covered by collective bargaining agreements.\nOn December 3, 2018, we completed our acquisition of Krausz Industries Development Ltd. and subsidiaries (Krausz). During our 2020 and 2019 fiscal years, we included the financial statements of Krausz on a one-month lag. During the year ended September 30, 2021, we aligned the consolidation of the financial statements of Krausz in the Companys consolidated financial statements, eliminating the previous inclusion of Krausz financial statements with a one-month reporting lag. In accordance with applicable accounting literature, the elimination of the one-month reporting lag is considered to be a change in accounting principle. We believe this change in accounting principle is preferable as the financial statements of all of our subsidiaries are now reported on the same basis, providing the most current information available. The effect of the elimination of the reporting lag during the year ended September 30, 2021 resulted in an increase of $6.0 million to net sales. We concluded that the effect of this change was not material to the financial statements.\nOur consolidated financial statements are prepared in conformity with accounting principles generally accepted in the United States of America (GAAP), which require us to make certain estimates and assumptions that affect the reported amounts of assets, liabilities, sales and expenses and the disclosure of contingent assets and liabilities for the reporting periods. Actual results could differ from those estimates. All significant intercompany balances and transactions have been eliminated. Certain reclassifications have been made to previously reported amounts to conform to the current presentation. These reclassifications primarily relate to a change in our reportable segments as described in Note 14.\nUnless the context indicates otherwise, whenever we refer to a particular year, we mean our fiscal year ended or ending September 30 in that particular calendar year.\nNew Markets Tax Credit Program On December 22, 2020, we entered into a financing transaction with Wells Fargo Community Investment Holdings, LLC (Wells Fargo) related to our brass foundry construction project in Decatur, Illinois under a qualified New Markets Tax Credit program (NMTC). The NMTC is a federal program intended to encourage capital investment in qualified lower income communities. Under the NMTC, investors claim federal income tax credits over a period of seven years in connection with qualified investments in the equity of community development entities (CDEs), which are privately managed investment institutions that are certified to make qualified low-income community investments, such as in our foundry project.\nUnder the NMTC, Wells Fargo contributed capital of $4.8 million to an investment fund and we loaned $12.2 million to the fund. Wells Fargo is entitled to the associated tax credits, which are subject to 100% recapture if we do not comply with various regulations and contractual provisions surrounding the foundry project. We have indemnified Wells Fargo for any loss or recapture of tax credits related to the transaction until the seven-year period elapses. We do not anticipate any credit recaptures will be required in connection with this arrangement.\nThe investment fund contributed $16.5 million cash for a 99.99% stake in a joint venture (Sub-CDE) with a CDE. The Sub-CDE then loaned $16.2 million to us, with the use of the loan proceeds restricted to foundry project expenditures. This transaction also includes a put/call provision under which we may be obligated or entitled to repurchase Wells Fargos interest in the investment fund. We believe that Wells Fargo will exercise its put option in December 2027 for nominal consideration, resulting in our becoming the sole owner of the investment fund, cancelling the related loans, and recognizing an estimated gain of $3.9 million.\nF- 10\nWe determined that the investment fund and the Sub-CDE are variable interest entities (VIEs) and that we are the primary beneficiary of the VIEs. The ongoing activities of the VIEs, namely collecting and remitting interest and fees and administering NMTC compliance, were contemplated in the initial design of the transaction and are not expected to significantly affect economic performance throughout the life of the VIEs. Additionally, we are obligated to deliver tax benefits and provide various other guarantees to Wells Fargo and to absorb the losses of the VIEs. Wells Fargo does not have a material interest in the underlying economics of the project. Consequently, we have included the financial statements of the VIEs in our consolidated financial statements.\nIntercompany transactions between us and the VIEs have been eliminated in consolidation. Wells Fargos contribution to the investment fund is consolidated in our financial statements within Other noncurrent liabilities as a result of its redemption features.\nDirect costs associated with Wells Fargos capital contribution were netted against the recorded proceeds, resulting in a net cash contribution of $3.9 million. Other direct costs associated with the transaction were capitalized and are being recognized as interest expense over the seven-year tax credit period. Incremental costs to maintain the structure during the compliance period are expensed as incurred and were immaterial to the consolidated financial statements.\nNote 2. Summary of Significant Accounting Policies\nCash and Cash Equivalents. All highly liquid investments with maturities of 90 days or less when purchased are classified as cash equivalents. Where there is no right of offset against cash balances, outstanding checks are included in Accounts payable.\nReceivables, net. Receivables are amounts due from customers. To reduce credit risk, credit investigations are generally performed prior to accepting orders from new customers and, when necessary, we require letters of credit, bonds or other instruments to ensure payment.\nWe present trade receivables net of customer discounts and an allowance for credit losses. Our consolidated statements of operations reflect the measurement of credit losses for newly recognized trade receivables, as well as the expected increases or decreases of expected credit losses that have taken place during the period. When we determine a specific trade receivable will not be collected, we charge off the uncollectible amount against the allowance. Our periodic evaluations of expected credit losses are based upon our judgments regarding prior collection experience, specific customer creditworthiness, other current conditions, and forecasts of current economic trends within the industries served that may affect the collectability of the reported amounts. Significantly weaker than anticipated industry or economic conditions could impact our customers ability to pay such that actual credit losses may be greater than the amounts provided for in this allowance.\nThe following table summarizes information concerning our allowance for credit losses.\n2023 2022 2021\n(in millions)\nBalance at beginning of year $ 5.6 $ 3.5 $ 2.5\nProvision charged to expense 1.9 2.5 1.1\nOther (0.2) (0.4) (0.1)\nBalance at end of year $ 7.3 $ 5.6 $ 3.5\nInventories, net. Inventories are recorded at the lower of first-in, first-out method cost or estimated net realizable value. We evaluate our inventory in terms of excess and obsolete exposures. This evaluation includes such factors as anticipated usage, inventory turnover, inventory levels and ultimate product sales value. Inventory cost includes an overhead component that is affected by levels of production and actual costs incurred. We periodically evaluate the effects of production levels and costs capitalized as part of Inventories, net.\nF- 11\nThe following table summarizes information concerning our inventory valuation reserves.\n2023 2022 2021\n(in millions)\nBalance at beginning of year $ 16.5 $ 14.8 $ 11.7\nProvision charged to expense 3.8 1.8 5.9\nInventory disposed (2.5) (1.4) (3.6)\nOther (1.0) 1.3 0.8\nBalance at end of year $ 16.8 $ 16.5 $ 14.8\nMaintenance and repair supplies and tooling. Maintenance and repair supplies and tooling is included in Other current assets and Other noncurrent assets. Costs for perishable tools and maintenance items are expensed when put into service. Costs for more durable items are amortized over their estimated useful lives, ranging from 3 to 10 years.\nProperty, Plant and Equipment, net. Property, plant and equipment is recorded at cost, less accumulated depreciation. Depreciation is recorded using the straight-line method over the estimated useful lives of the assets. Estimated useful lives are 10 to 20 years for land improvements, 10 to 40 years for buildings and 3 to 20 years for machinery and equipment. Leasehold improvements and capitalized leases are depreciated using the straight-line method over the lesser of the useful life of the asset or the remaining lease term. Gains and losses upon disposition are reflected in operating results in the period of disposition.\nDirect internal and external costs to implement computer systems and software for internal use are capitalized. Capitalized costs are depreciated over the estimated useful life of the system or software, generally six years, beginning when the system or software is ready for its intended use.\nLiabilities are recognized at fair value for asset retirement obligations related to plant and landfill closures in the period in which they are reasonably estimable and the carrying amounts of the related long-lived assets are correspondingly adjusted. Over time, the liabilities are accreted to their estimated future values. At September 30, 2023 and 2022, asset retirement obligations were $4.2 million.\nLeases. Refer to Note 4. for information regarding our leases.\nAccounting for the Impairment of Long-Lived Assets. We test indefinite-lived intangible assets and goodwill for impairment annually or more frequently if events or circumstances indicate impairment is possible. We perform our annual impairment testing at September 1. We amortize finite-lived intangible assets over their respective estimated useful lives and review for impairment if events or circumstances indicate impairment is possible. Refer to Note 5. for information regarding our goodwill impairment testing.\nWorkers Compensation. Our exposure to workers compensation claims is generally limited to $0.8 million per incident. Liabilities, including those related to claims incurred but not reported, are recorded principally using annual valuations based on discounted future expected payments and using historical data combined with insurance industry data when historical data is limited. Our gross workers compensation liabilities were $9.9 million as of September 30, 2023, and we expect to recover $4.6 million in insurance which is included as a receivable in Other current assets and Other noncurrent assets. As of September 30, 2022, our gross workers compensation liability was $11.1 million and our insurance receivable was $5.9 million.\nWarranty Costs. We accrue for warranty expenses, which include costs to repair and/or replace, including labor, materials, equipment, freight and reasonable overhead costs. We accrue for the estimated cost of product warranties at the time of sale if such costs are determined to be probable and reasonably estimable at that time. We monitor and analyze our warranty experience and costs periodically and revise our warranty accruals as necessary. Factors considered in our accrual analyses include warranty terms, specific claim situations, general incurred and projected failure rates, the nature of product failures, product and labor costs, and general business conditions.\nF- 12\nActivity in our accrued warranty, reported as part of both Other current liabilities and Other noncurrent liabilities, is presented below.\n2023 2022 2021\n(in millions)\nBalance at beginning of year $ 10.7 $ 9.7 $ 14.4\nWarranty accruals 14.8 9.5 3.5\nWarranty costs (9.8) (8.5) (8.2)\nBalance at end of year $ 15.7 $ 10.7 $ 9.7\nDeferred Financing Costs. Costs to obtain debt are deferred and charged to expense over the life of the underlying debt agreement. Remaining costs and the future period over which financing costs would be charged to expense are reassessed when amendments to the related financing agreements or prepayments occur.\nDeferred financing costs are offset against the underlying long-term debt in the accompanying consolidated balance sheets. Deferred financing costs under agreements that do not have outstanding debt and in other instances, such as our ABL and with regard to our NMTC transaction, are included in Other noncurrent assets consistent with the life of the instrument. Deferred financing costs of $4.6 million at September 30, 2023 include: $0.5 million related to the ABL, $0.2 million related to the NMTC transaction which are amortized on a straight-line basis and; $3.9 million related to the 4.0% Senior Unsecured Notes (4.0% Senior Notes) which is amortized using the effective interest rate method. These amounts are amortized over the remaining term of the respective debt. Refer to Note 7. for disclosures related to our borrowing arrangements.\nIncome Taxes. Deferred tax liabilities and deferred tax assets are recognized for the expected future tax consequences of events that have been included in the financial statements or tax returns. Such assets and liabilities are determined based on the differences between the financial statement basis and the tax basis of assets and liabilities, using tax rates in effect for the years in which the differences are expected to reverse. A valuation allowance is provided when, based upon the available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized.\nWe only record tax benefits for positions that management believes are more likely than not of being sustained under audit based solely on the technical merits of the associated tax position. The amount of tax benefit recognized for any position that meets the more-likely-than-not threshold is the largest amount of the tax benefit that we believe is greater than 50% likely of being realized.\nEnvironmental Expenditures. We capitalize environmental expenditures that increase the life or efficiency of noncurrent assets or that reduce or prevent environmental contamination. We accrue for environmental expenses resulting from existing conditions that relate to past operations when the costs are probable and reasonably estimable. We are indemnified for certain environmental liabilities under an agreement with a predecessor to Tyco that existed at August 16, 1999. Refer to Note 15. for additional disclosures regarding our environmental liabilities.\nRevenue Recognition. Refer to Note 3. for disclosures regarding our revenues.\nStock-based Compensation. Compensation expense for stock-based awards granted to employees and directors is based on the fair value at the grant dates for our stock-settled share awards and is based on the fair value at each reporting date for our cash-settled share awards. Stock-based compensation expense is included within Selling, general and administrative expense within our consolidated statements of operations. Refer to Note 10. for more information regarding our stock-based compensation.\nResearch and Development. Research and development costs are expensed as incurred.\nAdvertising. Advertising costs are expensed as incurred.\nTranslation of Foreign Currency. Foreign reporting entities are remeasured into local currencies with the effect reflected in the consolidated statements of operations. Assets and liabilities of our businesses whose functional currencies are not denominated in the United States dollar are translated into United States dollars using currency exchange rates at the balance sheet date. Revenues and expenses are translated at average currency exchange rates during the period. Foreign currency translation gains and losses are reported as a component of accumulated other comprehensive income (loss). Gains and losses resulting from foreign currency transactions are included in earnings as incurred.\nF- 13\nRecently Adopted Accounting Pronouncements\nIn December 2019, the FASB issued Accounting Standards Update (ASU) No. 2019-12, \"Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (ASU 2019-12). ASU 2019-12 simplifies the accounting for income taxes by clarifying and amending existing guidance related to the recognition of franchise tax, the evaluation of a step up in the tax basis of goodwill, and the effects of enacted changes in tax laws or rates in the effective tax rate computation, among other clarifications. ASU 2019-12 is effective for public business entities for fiscal years beginning after December 15, 2020, including interim periods within that fiscal year, with early adoption permitted. We adopted this standard on October 1, 2021 and there was no material impact to our financial statements.\nIn March 2020, the FASB issued ASU No. 2020-04, \"Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting\" (ASU 2020-04). ASU 2020-04 provides optional expedients and exceptions for applying GAAP to contracts, hedging relationships and other transactions affected by reference rate reform if certain criteria are met. The amendments apply only to contracts and hedging relationships that reference the London Inter Bank Offered Rate (LIBOR) or another reference rate expected to be discontinued due to reference rate reform. ASU 2020-04 is effective from March 12, 2020; however, the standard may be adopted prospectively from a date within an interim period subsequent to March 12, 2020. We adopted this standard on October 1, 2021, and there was no material impact to our financial statements.\nAccounting Pronouncements Not Yet Adopted\nIn June 2022, the FASB issued ASU No. 2022-03 Fair Value Measurement (Topic 820): Fair Value Measurement of Equity Securities Subject to Contractual Sale Restrictions (ASU 2022-03). ASU 2022-03 was issued to (1) clarify the guidance in Topic 820 on the fair value measurement of an equity security that is subject to a contractual sale restriction; and (2) to require specific disclosures related to such an equity security. This guidance is effective for fiscal years beginning after December 15, 2023, and interim periods within those fiscal years, with early adoption permitted. We do not expect ASC 2022-03 to have a material impact on our financial statements and related disclosures.\nIn November 2023, the FASB issued ASU No. 2023-07 Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures (ASU 2023-07). ASU 2023-07 requires public business entities that disclose information on their reportable segments to provide additional information on their significant expense categories and other segment items, which represent the difference between segment revenue less significant segment expense and a segments measure of profit or loss. A description of other segment items is also required. Further, certain segment related disclosures that were limited to annual disclosure are now required at interim periods. Finally, public business entities are required to disclose the title and position of their Chief Operating Decision Maker (CODM) and explain how the CODM uses the reported measures of profit or loss to assess segment performance. This guidance is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. We do not expect ASU 2023-07 to have a material impact on our financial statement and related disclosures.\nNote 3. Revenue from Contracts with Customers\nWe recognize revenue when control of promised products or services is transferred to our customers, in amounts that reflect the consideration to which we expect to be entitled in exchange for those products or services. We account for a contract when it has approval and commitment from both parties, the rights of the parties are identified, the payment terms are identified, the contract has commercial substance and collectability of consideration is probable. We determine the appropriate revenue recognition for our contracts with customers by analyzing the type, terms and conditions of each contract or arrangement with a customer.\nDisaggregation of Revenue\nRefer to Note 14. for disaggregation of our revenues from contracts with customers by reportable segment and by geographical region, which we believe best depicts how the nature, amount, timing and certainty of our revenue and cash flows are affected by economic factors. Geographical region represents the location of the customer.\nContract Asset and Liability Balances\nDifferences in the timing of revenue recognition, billing and cash collection result in customer receivables, advance payments and billings in excess of revenue recognized. Customer receivables include amounts billed and currently due from customers as well as unbilled amounts (contract assets). Amounts are billed in accordance with contractual terms and unbilled amounts arise when the timing of billing differs from the timing of revenue recognized.\nF- 14\nAdvance payments and billings in excess of revenue are recognized and recorded as deferred revenue, the majority of which is classified as current based on the timing of when we expect to recognize revenue. We include current deferred revenue within Other current liabilities in the accompanying consolidated balance sheets. Deferred revenue represents contract liabilities and is recorded when customers remit cash payments in advance of our satisfaction of performance obligations under contractual arrangements. Contract liabilities are reversed when the performance obligation is satisfied and revenue is recognized.\nThe table below represents the balances of our customer receivables and deferred revenue.\nSeptember 30,\n2023 2022\n(in millions)\nBilled receivables $ 218.1 $ 230.5\nUnbilled receivables 6.3 3.1\nGross customer receivables 224.4 233.6\nAllowance for credit losses (7.3) (5.6)\nReceivables, net $ 217.1 $ 228.0\nDeferred revenue\n$ 9.2 $ 8.1\nPerformance Obligations\nA performance obligation is a promise in a contract to transfer a distinct good or service to the customer. Our performance obligations are satisfied at a point in time as related to sales of equipment and products or over time as related to our software hosting and leak detection monitoring services. Performance obligations are supported by customer contracts, which provide frameworks for the nature of the distinct products or services. The transaction price is adjusted for our estimate of variable consideration which may include discounts, and rebates. To estimate variable consideration, we apply the expected value or the most likely amount method, based on whichever method most appropriately predicts the amount of consideration we expect to receive. The method applied is typically based on historical experience and known trends. We constrain the amounts of variable consideration that are included in the transaction price, to the extent that it is probable that a significant reversal in the amount of cumulative revenue recognized will not occur or when uncertainties around the variable consideration are resolved.\nWe exclude from the measurement of the transaction price all taxes assessed by a governmental authority.\nWe do not adjust the transaction price of a contract for the effects of a significant financing component if, at the inception of the contract, we expect that the period between when we transfer a product or service to a customer and when a customer remits payment will be one year or less.\nRevenues from products and services transferred to customers at a point in time represented 98% of our revenues in fiscal years 2023, 2022, and 2021. The revenues recognized at a point in time related to the sale of our products and services are recognized when the obligations of the terms of our contract are satisfied, which is when the customer is able to direct the use of and obtain substantially all of the benefits from the product or service, which generally occurs upon shipment when control of the product or service transfers to the customer.\nRevenues from products and services transferred to customers over time represented 2% of our revenues in fiscal years 2023, 2022, and 2021.\nWe offer warranties to our customers in the form of assurance-type warranties, which provide assurance that the products provided will function as intended and comply with any agreed-upon specifications. These cannot be purchased separately. We offer extended warranties on limited products which may be purchased separately.\nF- 15\nCosts to Obtain or Fulfill a Contract\nShipping and handling costs associated with freight activities after the customer has obtained control are accounted for as fulfillment costs and are expensed to Cost of sales within our consolidated statements of operations at the time revenue is recognized.\nWe incur certain incremental costs to obtain a contract, which primarily relate to incremental sales commissions. Our commissions are paid based on a combination of orders and shipments, and we reserve the right to claw back any commissions in case of product returns or lost collections. As the expected benefit associated with these incremental costs is generally one year or less based on the nature of the product sold and benefits received, we have applied the practical expedient and therefore do not capitalize the related costs and expense them as incurred.\nNote 4. Leases\nPresentation of Leases\nWe lease certain office, warehouse, manufacturing, distribution, and research and development facilities and equipment under operating leases. Our leases have remaining lease terms of up to 10 years. The terms and conditions of our leases may include options to extend or terminate the lease. These factors are considered at lease inception or at the time of the amendment and included in the lease term when these options are reasonably certain of exercise.\nWe determine if a contract is, or contains, a lease at inception by evaluating whether the contract conveys the right to control the use of an identified asset. For all classes of leased assets, we have elected the practical expedient to account for any non-lease components in the contract together with the related lease component in the same unit of account.\nRight-of-Use (ROU) assets and lease liabilities are recognized in our consolidated balance sheets at the commencement date based on the present value of lease payments over the lease term. Additionally, ROU assets include any lease payments made at or before the commencement date, as well as any initial direct costs incurred, and are reduced by any lease incentives received. As most of our operating leases do not provide an implicit rate, we apply our incremental borrowing rate to determine the present value of remaining lease payments. Our incremental borrowing rate is determined based on information available at the commencement date of the lease.\nFor all classes of leased assets, we have applied an accounting policy election to exclude short-term leases from recognition in our consolidated balance sheets. A short-term lease has a term of 12 months or less at the commencement date and does not include a purchase option that is reasonably certain of exercise. We recognize short-term lease cost in our consolidated statements of operations on a straight-line basis over the lease term.\nOur short-term lease cost for the years ended September 30, 2023, 2022, and 2021 and short-term lease commitments at September 30, 2023 and 2022 are immaterial.\nWe have certain lease contracts with terms and conditions that provide for variability in the payment amount based on changes in facts or circumstances occurring after the commencement date. These variable lease payments are recognized in our consolidated statements of operations as the obligation is incurred.\nAt September 30, 2023, any legally-binding minimum lease payments for operating leases signed but not yet commenced, subleases, leases that impose significant restrictions or covenants, related party leases or sale-leaseback arrangements were immaterial.\nThe components of lease cost are presented below.\nYear ended September 30,\n2023 2022 2021\n(in millions)\nOperating lease cost $ 6.3 $ 5.8 $ 6.1\nFinance lease cost 1.1 1.3 1.2\nTotal lease cost\n$ 7.4 $ 7.1 $ 7.3\nF- 16\nSupplemental cash flow information related to leases are presented below, in millions.\nYear ended September 30,\n2023 2022\n(in millions)\nOperating cash used for operating leases $ 6.4 $ 5.8\nFinancing cash used for finance leases $ 1.1 $ 0.7\nSupplemental information regarding our lease assets and liabilities is below.\nSeptember 30,\n2023 2022\n(in millions)\nRight-of-use assets:\nOperating leases Other noncurrent assets $ 23.6 $ 26.0\nFinance leases Plant, property and equipment 1.2 1.4\nTotal right-of-use assets $ 24.8 $ 27.4\nLease liabilities:\nOperating leases - current Other current liabilities $ 4.9 $ 4.4\nOperating leases - noncurrent Other noncurrent liabilities 19.8 22.4\nFinance leases - current Current portion of long-term debt 0.7 0.8\nFinance leases - noncurrent Long-term debt 0.6 0.8\nTotal lease liabilities $ 26.0 $ 28.4\nSupplemental information related to lease terms and discount rates are presented below.\nYear ended September 30,\n2023 2022\nWeighted-average remaining lease term (years):\nOperating leases 5.81 6.67\nFinance leases 2.24 2.15\nWeighted-average interest rate:\nOperating leases 5.51 % 5.48 %\nFinance leases 4.69 % 3.64 %\nTotal lease liabilities at September 30, 2023 have scheduled maturities as follows:\nOperating Leases Finance Leases\n(in millions)\n2024 $ 6.2 $ 0.7\n2025 5.7 0.4\n2026 5.2 0.2\n2027 4.3 0.1\n2028 2.7 -\nThereafter 4.9 -\nTotal lease payments 29.0 1.4\nLess: imputed interest (4.3) (0.1)\nPresent value of lease liabilities $ 24.7 $ 1.3\nF- 17\nNote 5. Goodwill and Intangible Assets\nGoodwill\nGoodwill is tested for impairment at the reporting unit level (operating segment or one level below an operating segment) on an annual basis on September 1 of each fiscal year or more frequently if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value.\nThe carrying value of the reporting unit, including goodwill, is compared with the estimated fair value of the reporting unit as determined utilizing a combination of the income and market approaches. The income approach, which involves significant unobservable inputs (Level 3 inputs), is based on projected debt-free cash flow which is discounted to the present value using discount rates that consider the timing and risk of the cash flows. The market approach is based on the guideline public company method, which uses market multiples to value our reporting units. The Company weights the income and market approaches in a manner considering the risks of the underlying cash flows. The key assumptions used in estimating the fair value of the Company's reporting units utilizing the income approach include management's best estimate of revenue, EBITDA margin, and discount rate. Accordingly, a change in market conditions or other factors could have a material effect on the estimated values. There are inherent uncertainties related to the assumptions used and to management's application of these assumptions.\nWe performed our annual impairment testing at September 1, 2023. The results of the testing indicated that the fair value exceeded the carrying value of our reporting units which contained goodwill. As such, no impairment charge was recorded during the fiscal year ended September 30, 2023.\nIndefinite-lived Intangible Assets\nIndefinite-lived intangible assets are tested for impairment on an annual basis on September 1 of each fiscal year or more frequently if events or circumstances indicate that it is more likely than not that the asset is impaired. We performed our annual impairment testing at September 1, 2023 based on quantitative factors and concluded no impairment losses should be recognized.\nIntangible Assets\nDirect internal and external costs to develop software used in the provision of services to customers by Water Management Solutions are capitalized and amortized over the six-year estimated useful life of the software, beginning when the software is ready for its intended use. At September 30, 2023, the remaining weighted-average amortization period for this software was 4.2 years. Amortization expense related to such software assets was $2.9 million in 2023 and 2022, and $3.3 million in 2021. Amortization expense for each of the next five years is expected to be $2.6 million in 2024, $2.0 million in 2025, $1.5 million in 2026, $1.1 million in 2027, and $0.8 million in 2028.\nAt September 30, 2023, the remaining weighted-average amortization period for business combination-related finite-lived customer relationships and technology intangible assets were 3.3 years and 7.7 years, respectively. Amortization expense related to these assets was $25.2 million, $25.5 million and $25.2 million for 2023, 2022 and 2021, respectively. Amortization expense for each of the next five years is scheduled to be $24.8 million in 2024, $5.5 million in 2025, $5.1 million in 2026, $4.9 million in 2027 and $4.8 million in 2028.\nF- 18\nIntangible assets are presented below.\nSeptember 30,\n2023 2022\n(in millions)\nCapitalized internal-use software:\nCost $ 38.1 $ 35.5\nAccumulated amortization (29.7) (26.8)\nCapitalized internal-use software, net $ 8.4 $ 8.7\nBusiness combination-related:\nCost:\nFinite-lived intangible assets:\nTechnology $ 119.6 $ 119.9\nCustomer relationships and other 371.5 371.6\nIndefinite-lived intangible assets:\nTrade names and trademarks 272.6 272.7\n$ 763.7 $ 764.2\nAccumulated amortization:\nTechnology $ (95.3) $ (89.5)\nCustomer relationships and other (342.8) (322.2)\n(438.1) (411.7)\nBusiness combination-related intangible assets, net 325.6 352.5\nIntangible assets, net $ 334.0 $ 361.2\nGoodwill\nAs of September 30, 2023, our remaining goodwill balance is within our Water Management Solutions segment. Changes in the carrying amount of goodwill for the years ended September 30, 2023 and 2022 were as follows, in millions:\nBalance at September 30, 2021:\nGoodwill $ 832.4\nAccumulated impairment (717.3)\nNet goodwill 115.1\n2022 Activity:\nGoodwill impairment (6.8)\nChange in foreign currency exchange rates (9.7)\nBalance at September 30, 2022:\nGoodwill 822.7\nAccumulated impairment (724.1)\nNet goodwill 98.6\n2023 Activity:\nChange in foreign currency exchange rates (4.9)\nBalance at September 30, 2023:\nGoodwill 817.8\nAccumulated impairment (724.1)\nNet goodwill $ 93.7\nF- 19\nNote 6. Income Taxes\nThe components of income before income taxes are presented below.\n2023 2022 2021\n(in millions)\nU.S. $ 83.2 $ 81.6 $ 94.0\nNon-U.S. 25.8 17.0 0.9\nIncome before income taxes $ 109.0 $ 98.6 $ 94.9\nThe Tax Cuts and Jobs Act (the Act) imposed a one-time transition tax on the undistributed, previously untaxed, post-1986 foreign earnings and profits as defined by the Internal Revenue Services (IRS) of certain United States-owned corporations. At September 30, 2023, the remaining balance of our transition obligation is $4.1 million, which will be paid in full by January 2026, as provided in the Act. Other than for Krauszs investment in its United States subsidiary and other anticipated distributions which result cumulatively in immaterial income tax, we have not recorded income taxes for unrepatriated foreign earnings that may be subject to withholding tax or any outside cost basis differences inherent in our foreign subsidiaries, as these amounts continue to be indefinitely reinvested in foreign operations. We have a foreign tax credit carryforward of $4.7 million, for which we have recorded a valuation allowance as we do not expect to utilize it prior to expiration.\nThe federal income tax returns for Mueller Water Products, Inc. are closed for years prior to our fiscal year 2020. We remain liable for any taxes related to U.S. Pipe income for periods prior to 2012 pursuant to the terms of the sale agreement with the purchaser of the business.\nOur state income tax returns are generally closed for years prior to our fiscal year 2020, except with regard to our state net operating loss carryforwards. Our Canadian income tax returns are generally closed for years prior to our fiscal year 2016. We do not have any material unpaid assessments.\nThe components of income tax expense are as follows:\n2023 2022 2021\n(in millions)\nCurrent:\nU.S. federal $ 28.4 $ 19.5 $ 21.9\nU.S. state and local 6.0 4.3 6.3\nNon-U.S. 3.5 1.7 1.6\nTotal current income tax expense 37.9 25.5 29.8\nDeferred:\nU.S. federal (11.2) (3.4) (4.7)\nU.S. state and local (3.3) (0.9) (1.3)\nNon-U.S. 0.1 0.8 0.7\nTotal deferred income tax benefit\n(14.4) (3.5) (5.3)\nIncome tax expense $ 23.5 $ 22.0 $ 24.5\nF- 20\nThe reconciliation between income tax expense at the United States federal statutory income tax rate and reported income tax expense is presented below.\n2023 2022 2021\n(in millions)\nExpense at U.S. federal statutory income tax rate $ 22.9 $ 20.7 $ 19.9\nAdjustments to reconcile to income tax expense:\nState income taxes, net of federal benefit 1.5 2.6 3.1\nUncertain tax positions 0.5 - 0.3\nNondeductible compensation 1.8 0.9 0.6\nNondeductible expenses, other than compensation 0.9 0.8 0.5\nValuation allowances (0.6) 1.0 (0.4)\nBasis difference in foreign investment 0.1 0.1 1.5\nForeign income taxes (2.0) (1.5) (1.7)\nExcess tax benefits related to stock compensation 0.3 (0.1) (0.2)\nTax credits (3.5) (2.3) (1.6)\nOther 1.6 (0.2) 2.5\nIncome tax expense $ 23.5 $ 22.0 $ 24.5\nThe following table summarizes information concerning our gross unrecognized tax benefits.\n2023 2022\n(in millions)\nBalance at beginning of year $ 4.7 $ 4.8\nIncrease related to current year positions 1.0 0.7\nDecrease related to current year positions - (0.4)\nDecrease as a result of statute of limitations lapse (0.6) (0.3)\nForeign currency exchange losses (0.1) (0.1)\nBalance at end of year $ 5.0 $ 4.7\nSubstantially all unrecognized tax benefits would, if recognized, impact the effective tax rate. We recognize interest related to uncertain tax positions as interest expense and recognize any penalties incurred as a component of Selling, general and administrative expenses. At September 30, 2023 and 2022, we had $0.8 million and $0.7 million, respectively, of accrued interest expense related to unrecognized tax benefits.\nF- 21\nDeferred income tax balances are presented below.\nSeptember 30,\n2023 2022\n(in millions)\nDeferred income tax assets:\nAccrued expenses $ 10.8 $ 10.5\nLease liabilities 6.4 8.1\nInventories 7.2 7.0\nState net operating losses 1.9 2.1\nNet operating losses and credit carryovers 16.2 12.9\nStock-based compensation 3.9 4.1\nPension - 0.1\nSection 174 research and development capitalization\n15.6 -\nOther 4.4 2.3\nTotal deferred income tax assets 66.4 47.1\nValuation allowance (15.1) (13.2)\nTotal deferred income tax assets, net of valuation allowance 51.3 33.9\nDeferred income tax liabilities:\nIntangible assets 74.5 77.7\nLease assets 5.9 7.4\nBasis difference in foreign investment 5.9 6.2\nPension 1.3 -\nProperty, plant and equipment 36.6 28.4\nOther 0.9 0.5\nTotal deferred income tax liabilities 125.1 120.2\nNet deferred income tax liabilities $ 73.8 $ 86.3\nWe reevaluate the need for a valuation allowance against our deferred tax assets each quarter considering results to date, projections of taxable income, tax planning strategies and reversing taxable temporary differences.\nOur state net operating loss carryforwards, which expire between our fiscal years 2025 and 2027, remain available to offset future taxable earnings.\nNote 7. Borrowing Arrangements\nThe components of our long-term debt are as follows:\nSeptember 30,\n2023 2022\n(in millions)\n4.0% Senior Notes $ 450.0 $ 450.0\nFinance leases 1.3 1.6\nTotal debt 451.3 451.6\nLess deferred financing costs 3.9 4.7\nLess current portion of long-term debt 0.7 0.8\nLong-term debt $ 446.7 $ 446.1\nThe scheduled maturities of all borrowings outstanding at September 30, 2023 are $0.7 million in 2024, $0.4 million in 2025, $0.2 million in 2026, none in 2027 and 2028, and $450.0 million in 2029.\nF- 22\nABL Agreement. Our ABL Agreement, as amended, (ABL) is provided by a consortium of banking institutions and consists of a revolving credit facility for up to $175.0 million in borrowings that expires on July 29, 2025. Included in the ABL is the ability to borrow up to $25.0 million of swing line loans and up to $60.0 million of letters of credit. The ABL permits us to increase the size of the credit facility by an additional $150.0 million in certain circumstances subject to adequate borrowing base availability.\nOn April 5, 2023, we amended the ABL. This amendment replaced LIBOR-based loans with Secured Overnight Financing Rate (SOFR) based loans plus an adjustment of 10 basis points, among other immaterial modifications. In December 2023, we obtained a waiver under our ABL to provide for additional time associated with certain deliverables which were delayed as a result of the cybersecurity incident. The maximum aggregate amount of borrowings and other credit extensions under the ABL is limited to $50.0 million at any time outstanding until all of the delayed deliveries required under the ABL are made.\nBorrowings under the ABL bear interest at a floating rate equal to SOFR plus an adjustment of 10 basis points and an applicable margin range of 200 to 225 basis points, or a base rate, as defined in the ABL, plus an applicable margin range of 100 to 125 basis points. At September 30, 2023, the applicable margin was 200 basis points for SOFR-based loans, and 100 basis points for base rate loans.\nThe ABL is subject to mandatory prepayments if total outstanding borrowings under the ABL are greater than the aggregate commitments under the revolving credit facility or if we dispose of overdue accounts receivable in certain circumstances. The borrowing base under the ABL is equal to the sum of (a) 85% of the value of eligible accounts receivable and (b) the lesser of (i) 70% of the value of eligible inventory or (ii) 85% of the net orderly liquidation value of eligible inventory, less certain reserves. Prepayments can be made at any time without penalty.\nSubstantially all of our United States subsidiaries are borrowers under the ABL and are jointly and severally liable for outstanding borrowings. Our obligations under the ABL are secured by a first-priority perfected lien on all of our United States inventory, accounts receivable, certain cash balances and other supporting assets.\nThe ABL includes a commitment fee for any unused borrowing capacity of 37.5 basis points per annum. Borrowings are not subject to any financial maintenance covenants unless excess availability is less than the greater of $17.5 million and 10% of the Loan Cap as defined in the ABL. Excess availability based on September 30, 2023 data was $162.4 million, as reduced by $12.4 million of outstanding letters of credit and $0.2 million of accrued fees and expenses.\n4.0% Senior Unsecured Notes. On May 28, 2021, we privately issued $450.0 million of 4.0% Senior Notes, which mature on June 15, 2029 and bear interest at 4.0%, paid semi-annually in June and December. We capitalized $5.5 million of financing costs, which are being amortized over the term of the 4.0% Senior Notes using the effective interest method. Proceeds from the 4.0% Senior Notes, along with cash on hand were used to redeem our previously existing 5.5% Senior Notes. Substantially all of our United States subsidiaries guarantee the 4.0% Senior Notes, which are subordinate to borrowings under our ABL. Based on quoted market prices, which is a Level 1 measurement, the outstanding 4.0% Senior Notes had a fair value of $393.7 million as of September 30, 2023.\nAn indenture securing the 4.0% Senior Notes (Indenture) contains customary covenants and events of default, including covenants that limit our ability to incur certain debt and liens. There are no financial maintenance covenants associated with the Indenture. We believe we were in compliance with these covenants at September 30, 2023.\nWe may redeem some or all of the 4.0% Senior Notes at any time prior to June 15, 2024 at certain make-whole redemption prices and on or after June 15, 2024, at specified redemption prices. Additionally, we may redeem up to 40% of the aggregate principal amount of the 4.0% Senior Notes at any time prior to June 15, 2024 with the net proceeds of specified equity offerings at specified redemption prices as set forth in the Indenture. Upon a change of control as defined, we would be required to offer to purchase the 4.0% Senior Notes at a price equal to 101% of the outstanding principal amount.\n5.5% Senior Unsecured Notes. On June 12, 2018, we privately issued $450.0 million of 5.5% Senior Notes, which were set to mature in June 2026 and bore interest at 5.5%, paid semi-annually. We called the 5.5% Senior Notes effective June 17, 2021 and redeemed the 5.5% Senior Notes with the proceeds from the 4.0% Senior Notes and cash on hand. As a result, we incurred $16.7 million in loss on early extinguishment of debt, comprised of a $12.4 million call premium and a $4.3 million write-off of the remaining deferred financing costs.\n.\nF- 23\nNote 8. Retirement Plans\nDefined Benefit Plans. We have a defined benefit plan (Pension Plan) that we fund in accordance with its requirements and, where applicable, in amounts sufficient to satisfy the minimum funding requirements of applicable laws. The Pension Plan provides benefits based on years of service and compensation or at stated amounts for each year of service with an annual measurement date of September 30.\nA summary of key assumptions for the valuations of our Pension Plan is as follows:\nSeptember 30,\n2023 2022 2021\nWeighted average used to determine benefit obligations:\nDiscount rate\n6.29 % 5.79 % 3.01 %\nWeighted average used to determine net periodic cost:\nDiscount rate\n5.79 % 3.01 % 2.84 %\nExpected return on plan assets\n5.75 % 4.50 % 4.50 %\nThe discount rates for determining the present value of pension obligations were selected using a bond settlement approach, which constructs a hypothetical bond portfolio that could be purchased such that the coupon payments and maturity values could be used to satisfy the projected benefit payments. The discount rate is the equivalent rate that results in the present value of the projected benefit payments equaling the market value of this bond portfolio. Only high quality (AA graded or higher), non-callable corporate bonds are included in this bond portfolio. We rely on the Pension Plans actuaries to assist in the development of the discount rate model.\nThe expected return on plan assets is determined with the assistance of the Pension Plans actuaries and investment consultants. Expected return on plan assets was developed using forward-looking returns over a time horizon of approximately 20 years for major asset classes along with projected risk and historical correlations.\nF- 24\nAmounts recognized for the Pension Plan are presented below.\nSeptember 30,\n2023 2022\n(in millions)\nProjected benefit obligations:\nBeginning of year $ 251.2 $ 336.8\nService cost 0.8 1.3\nInterest cost 13.9 9.8\nActuarial gain (10.4) (74.0)\nBenefits paid (22.3) (22.7)\nAccumulated benefit obligations at end of year $ 233.2 $ 251.2\nPlan assets:\nBeginning of year $ 251.8 $ 353.5\nActual return on plan assets 10.3 (79.0)\nBenefits paid (22.3) (22.7)\nFair value of plan assets at end of year $ 239.8 $ 251.8\nAccrued benefit cost at end of year:\nFunded status $ 6.6 $ 0.6\nRecognized on balance sheet:\nOther noncurrent assets $ 6.6 $ 0.6\nRecognized in accumulated other comprehensive income (loss), before tax:\nNet actuarial loss $ 68.2 $ 78.7\n$ 68.2 $ 78.7\nThe components of net periodic cost (benefit) for our Pension Plan are presented below.\n2023 2022 2021\n(in millions)\nService cost $ 0.8 $ 1.3 $ 1.5\nComponents of net periodic cost (benefit) excluded from operating income:\nInterest cost 13.9 9.8 9.9\nExpected return on plan assets (13.9) (15.4) (15.7)\nAmortization of actuarial net loss 3.7 1.7 2.5\nPension expense (benefit) other than service\n3.7 (3.9) (3.3)\nNet periodic cost (benefit)\n$ 4.5 $ (2.6) $ (1.8)\nPension Plan activity in accumulated other comprehensive loss, before tax, in 2023 is presented below, in millions.\nBalance at beginning of year $ 78.7\nActuarial loss (6.8)\nPrior year actuarial loss amortization to net periodic cost (3.7)\nBalance at end of year $ 68.2\nF- 25\nWe amortize amounts in accumulated other comprehensive loss representing unrecognized prior year service cost and unrecognized loss related to the Pension Plan over the weighted average life expectancy of the inactive participants. Actuarial gains and losses are amortized using a corridor approach. The gain/loss corridor is equal to 10% of the greater of the benefit obligation and the market-related value of assets. Gains and losses in excess of the corridor are generally amortized over the average remaining lifetime of the plan participants.\nWe expect to amortize $4.6 million of unrecognized loss into net periodic expense from accumulated other comprehensive loss in 2024.\nStrategic asset allocations, tactical range at September 30, 2023 and actual asset allocations are as follows:\nStrategic asset allocation Actual asset allocations at\nSeptember 30,\nTactical range 2023 2022 2021\nFixed income investments 70 % 67 % - 73 % 70 % 70 % 70 %\nEquity investments 30 27 % - 33 % 29 29 29\nCash - 0 % - 5 % 1 1 1\n100 % 100 % 100 % 100 %\nAssets of the Pension Plan are allocated to various investments to attain diversification and reasonable risk-adjusted returns while also managing the exposure to asset and liability volatility. These ranges are targets and deviations may occur from time to time as a result of market fluctuations. Portfolio assets are typically rebalanced to the allocation targets at least annually.\nThe assets of the Pension Plan are primarily invested in mutual funds and investment trusts valued at net asset value, which in turn hold fixed income and equity investments. The valuation methodologies used to measure the assets of the Pension Plan at fair value are:\nMutual funds are valued at the closing price reported on the active market;\nFixed income fund investments held by the investment trusts are valued using the closing price reported in the active market in which the investment is traded. When market quotations are not readily available, these assets are valued by a method the trustees believe accurately reflects fair value.\nF- 26\nThe assets of the Pension Plan by level within the fair value hierarchy are as follows:\nSeptember 30, 2023\nLevel 1 Level 2 Total\n(in millions)\nFixed income $ 121.1 $ 45.6 $ 166.7\nEquity:\nLarge cap index funds 35.6 - 35.6\nInternational stocks:\nInternational funds 35.6 - 35.6\nTotal equity 71.2 - 71.2\nCash and cash equivalents 1.9 - 1.9\nTotal Plan assets\n$ 194.2 $ 45.6 $ 239.8\nSeptember 30, 2022\nLevel 1 Level 2 Total\n(in millions)\nFixed income $ 125.2 $ 50.1 $ 175.3\nEquity:\nLarge cap index funds 37.2 - 37.2\nInternational stocks:\nInternational funds 37.4 - 37.4\nTotal equity 74.6 - 74.6\nCash and cash equivalents 1.9 - 1.9\nTotal Plan assets\n$ 201.7 $ 50.1 $ 251.8\nOur estimated future pension benefit payments are presented below (in millions):\n2024 $ 23.0\n2025 22.7\n2026 22.3\n2027 21.9\n2028 21.4\n2029-2033 97.3\nTotal\n$ 208.6\nDefined Contribution Retirement Plans. Certain of our employees participate in a defined contribution 401(k) plan or similar plan outside of the United States. We make matching contributions as a function of employee contributions. We expensed our matching contributions of $8.2 million, $7.3 million and $5.9 million during 2023, 2022 and 2021, respectively.\nF- 27\nNote 9. Capital Stock\nCommon stock share activity is presented below.\nShares outstanding at September 30, 2020 158,064,750\nVesting of restricted stock units, net of shares withheld for taxes 182,024\nExercise of stock options 151,399\nExercise of employee stock purchase plan instruments 146,135\nSettlement of performance-based restricted stock units, net of shares withheld for taxes 62,396\nStock repurchased under buyback program (651,271)\nShares outstanding at September 30, 2021 157,955,433\nVesting of restricted stock units, net of shares withheld for taxes 195,156\nExercise of stock options 36,731\nExercise of employee stock purchase plan instruments 150,909\nSettlement of performance-based restricted stock units, net of shares withheld for taxes 160,163\nStock repurchased under buyback program (2,654,254)\nShares outstanding at September 30, 2022 155,844,138\nVesting of restricted stock units, net of shares withheld for taxes 256,724\nExercise of stock options 110,989\nExercise of employee stock purchase plan instruments 181,483\nSettlement of performance-based restricted stock units, net of shares withheld for taxes 193,428\nStock repurchased under buyback program (714,830)\nShares outstanding at September 30, 2023 155,871,932\nThe Company has authorized 60.0 million shares of $0.01 par value preferred stock. The preferred stock may be issued in one or more series and with such designations and preferences for each series as shall be stated in the resolutions providing for the designation and issue of each such series adopted by the Board of Directors of the Company. The Board of Directors is authorized by the Company's articles of incorporation to determine the voting, dividend, redemption and liquidation preferences pertaining to each such series. No shares of preferred stock have been issued by the Company as of September 30, 2023.\nNote 10. Stock-based Compensation Plans\nThe effect of stock-based compensation on our consolidated statements of operations within Selling, general and administrative costs is presented below.\n2023 2022 2021\n(in millions, except per share data)\nDecrease in operating income $ 11.1 $ 9.9 $ 11.0\nDecrease in net income\n8.7 7.6 8.2\nDecrease in earnings per basic share 0.06 0.05 0.05\nDecrease in earnings per diluted share $ 0.06 $ 0.05 $ 0.05\nWe excluded 779,150, 790,759 and 578,005 stock-based instruments from the calculation of diluted earnings per share for 2023, 2022 and 2021, respectively, because the effect of including them would have been antidilutive.\nAt September 30, 2023, there was approximately $9.8 million of unrecognized compensation expense related to stock-based awards not yet vested. We expect to recognize this expense over a weighted average life of approximately 1.5 years.\nF- 28\nThe Mueller Water Products, Inc. 2006 Stock Incentive Plan (2006 Plan) authorizes an aggregate of 20,500,000 shares of common stock that may be granted through the issuance of stock-based awards. Any awards canceled are available for reissuance. Generally, all of our employees and members of our Board of Directors are eligible to participate in the 2006 Plan. At September 30, 2023, 4,389,099 shares of common stock were available for future grants of awards under the 2006 Plan. This total assumes that the maximum number of shares will be earned for awards for which the final number of shares to be earned has not yet been determined.\nAn award granted under the 2006 Plan vests at such times and in such installments as set by the Compensation and Human Resources Committee of our Board of Directors (Compensation Committee), but no award will be exercisable after the 10-year anniversary of the date on which it is granted. Management expects some instruments will be forfeited prior to vesting. Grants to members of our Board of Directors are expected to vest fully. Based on historical forfeitures, we expect certain grants to employees to be forfeited at an annual rate of 2%.\nRestricted Stock Units. Depending on the specific terms of each award, restricted stock units generally vest ratably over the life of the award, usually three years, on each anniversary date of the original grant. Compensation expense for restricted stock units is recognized between the grant date and the vesting date (or the date on which a participant becomes Retirement-eligible, if sooner) on a straight-line basis for each tranche of each award. Fair values of restricted stock units are determined using the closing price of our common stock on the respective grant date.\nRestricted stock unit activity under the 2006 Plan is summarized below.\nRestricted stock units Weighted\naverage\ngrant date fair value per unit Weighted\naverage\nremaining\ncontractual\nterm (years) Aggregate\nintrinsic\nvalue\n(millions)\nOutstanding at September 30, 2020 408,506 $ 11.41 0.9\nGranted 220,795 12.29\nVested (228,121) 11.62 $ 2.8\nCancelled (5,083) 11.41\nOutstanding at September 30, 2021 396,097 11.78 0.8\nGranted 223,379 13.41\nVested (251,981) 11.81 $ 2.8\nCancelled (8,763) 11.87\nOutstanding at September 30, 2022 358,732 12.77 0.7\nGranted 625,518 12.78\nVested (301,864) 12.83 $ 7.3\nCancelled (109,103) 12.00\nOutstanding at September 30, 2023 573,283 $ 12.88 0.9\nPerformance-Based Awards. Our performance-based awards consist of performance-based restricted stock units (PRSUs). PRSUs represent a target number of units that may be paid out at the end of a multi-year award cycle consisting of annual performance periods coinciding with our fiscal years. As determined at the date of award, PRSUs may settle in cash-value equivalent of, or directly in, shares of our common stock. Settlement will range from zero to two times the number of PRSUs granted, depending on our financial performance against predetermined targets. The grant date for each years performance period is set when the Compensation Committee establishes performance goals for the period, normally within 90 days of the beginning of each performance period. At the end of each annual performance period, the Compensation Committee confirms performance against the applicable performance targets. PRSUs do not convey voting rights or earn dividends. PRSUs vest on the last day of an award cycle, unless vested sooner as a result of a Change of Control of the Company, or the death, disability or retirement of a participant.\nWe recognize compensation expense for stock-settled PRSUs starting on the first day of the applicable performance period and ending on the respective vesting dates. We base the recognized compensation expense upon the number of units awarded for each performance period, the closing price of our common stock on the grant date and the estimated performance factor. In 2023, 2022 and 2021, 282,472, 240,412 shares and 103,058 shares, respectively, vested related to PRSUs.\nF- 29\nStock-settled PRSUs activity under the 2006 Plan is summarized below.\nAward date Settlement year Performance period Grant date per unit fair value Units\nawarded Units forfeited Net units Performance factor Shares\nearned\nNovember 29, 2016 2020 2017 $ 13.26 59,285 (5,279) 54,006 1.000 54,006\n2018 $ 12.50 59,286 (39,910) 19,376 1.357 26,294\n2019 $ 10.53 59,290 (39,909) 19,381 0.645 12,501\nJanuary 23, 2017 2020 2017 $ 13.15 19,012 - 19,012 1.000 19,012\n2018 $ 12.50 19,011 - 19,011 1.357 25,798\n2019 $ 10.53 19,011 - 19,011 0.645 12,263\nNovember 28, 2017 2021 2018 $ 12.50 57,092 - 57,092 1.357 77,474\n2019 $ 10.53 57,092 (4,793) 52,299 0.645 33,733\n2020 $ 11.26 57,104 (21,679) 35,425 0.909 32,202\nNovember 27, 2018 2022 2019 $ 10.53 110,954 (8,751) 102,203 0.645 65,921\n2020 $ 11.26 110,954 (13,182) 97,772 0.909 88,875\n2021 $ 11.86 110,967 (28,478) 82,489 1.161 95,770\nDecember 3, 2019 2023 2020 $ 11.26 69,988 (2,391) 67,597 0.909 61,446\n2021 $ 11.86 69,989 (9,614) 60,375 1.161 70,096\n2022 $ 13.81 69,988 (9,614) 60,374 0.700 42,262\nNovember 29, 2022 2026 2023-2025\n$ 11.41 166,284 (80,337) 85,947 - -\nMarket-Based Awards. Our market-based awards consist of market-based restricted stock units (MRSUs). MRSUs represent a target number of units that may be paid out at the end of a three-fiscal year award cycle based on a calculation of our relative total shareholder return (TSR) performance as compared with the TSR of a selected peer group. Settlements in our common shares, will range from zero to two times the number of MRSUs granted, depending on our TSR performance ranking within the peer group. The fair values of MRSUs are fixed at the date of grant and the related expense is recognized ratably over the vesting period, which is roughly three years from the date of grant.\nThe table below provides information regarding MRSU awards, which were valued using Monte Carlo simulations on the grant date.\nNovember 29, 2022 November 30, 2021 January 27, 2021 December 2, 2020\nFair value at grant date $ 15.08 $ 15.76 $ 14.26 $ 15.39\nUnits granted 166,284 230,089 4,187 234,199\nVariables used in determining grant date fair value:\nDividend yield 2.20 % 1.70 % 1.84 % 1.77 %\nRisk-free rate 4.20 % 0.76 % 0.16 % 0.21 %\nExpected term (in years) 2.83 2.83 2.67 2.83\nStock Options. Stock options generally vest on each anniversary date of the original grant ratably over three years. Compensation expense attributed to stock options is based on the fair value of the awards on their respective grant dates, as determined using a Black-Scholes model.\nF- 30\nThe assumptions used to determine the grant date fair value are indicated below for grants issued during our 2023 fiscal year.\nNovember 29, 2022\nVariables used in determining grant date fair value:\nDividend yield 1.80%\nRisk-free rate 3.89%\nExpected term (in years) 6.00\nThe expected dividend yield is based on our estimated annual dividend and our stock price history at the grant date. The risk-free interest rate is based on the United States Treasury zero-coupon yield in effect at the grant date with a term equal to the expected term. The expected term represents the average period of time the options are expected to be outstanding.\nStock option activity under the 2006 Plan is summarized below.\nOptions Weighted\naverage\nexercise\nprice\nper option Weighted\naverage\nremaining\ncontractual\nterm (years) Aggregate\nintrinsic\nvalue\n(millions)\nOutstanding at September 30, 2020 328,099 $ 6.11 2.3 $ 1.4\nGranted\n431,520 11.86\nExercised (151,399) 4.09 1.7\nCancelled (8,421) -\nOutstanding at September 30, 2021 599,799 10.67 7.8 $ 2.7\nGranted 457,482 13.64\nExercised (36,731) 5.67 0.2\nCancelled (7,257) -\nOutstanding at September 30, 2022 1,013,293 12.19 7.7 $ 0.3\nGranted 573,279 11.41\nExercised (131,989) 9.59 0.4\nCancelled (327,115) -\nOutstanding at September 30, 2023 1,127,468 $ 12.10 7.8 $ 1.0\nExercisable at September 30, 2023 412,095 $ 11.97 6.5 $ 0.4\nStock option exercise prices are equal to the closing price of our common stock on the relevant grant date.\nThe ranges of exercise prices for stock options outstanding at September 30, 2023 are summarized below.\nExercise price Options Weighted\naverage\nexercise price Weighted\naverage\nremaining\ncontractual\nterm (years) Exercisable options Weighted\naverage\nexercise price\n$ 5.00 - $ 9.99 61,341 $ 9.31 0.9 61,341 $ 9.31\n$ 10.00 - $ 14.99 1,066,127 $ 12.26 8.2 348,050 $ 12.43\n1,127,468 $ 12.10 7.8 409,391 $ 11.97\nEmployee Stock Purchase Plan. The Mueller Water Products, Inc. 2006 Employee Stock Purchase Plan (ESPP) authorizes the sale of up to 5,800,000 shares of our common stock to employees. Generally, all full-time, active employees are eligible to participate in the ESPP, subject to certain restrictions. Employee purchases are funded through payroll deductions, and any excess payroll withholdings are returned to the employee. The price for shares purchased under the ESPP is 85% of\nF- 31\nthe lower of the closing price on the first day or the last day of the offering period. At September 30, 2023, 1,921,631 shares were available for issuance under the ESPP.\nPhantom Plan. Under the Mueller Water Products, Inc. Phantom Plan adopted in 2012 (Phantom Plan), we have awarded phantom units to certain non-officer employees. A phantom unit settles in cash equal to the price of one share of our common stock on the vesting date. Phantom units generally vest ratably over three years on each anniversary date of the original grant. We recognize compensation expense for phantom units on a straight-line basis for each tranche of each award based on the closing price of our common stock at each balance sheet date. The outstanding phantom units had a fair value of $12.68 per unit at September 30, 2023 and our accrued liability for such units was $3.1 million.\nPhantom Plan activity is summarized below.\nPhantom\nPlan units Weighted\naverage\ngrant date\nfair value\nper unit Weighted\naverage\nremaining\ncontractual\nterm (years) Aggregate\nintrinsic\nvalue\n(millions)\nOutstanding at September 30, 2020 314,475 $ 11.16 0.9\nGranted 185,808 11.91\nVested (131,182) $ 1.6\nCancelled (24,257) 11.30\nOutstanding at September 30, 2021 344,844 11.51 0.9\nGranted 203,834 13.60\nVested (162,969) $ 1.6\nCancelled (46,578) 12.39\nOutstanding at September 30, 2022 339,131 12.74 1.1\nGranted 294,063 11.53\nVested (156,012) $ 1.9\nCancelled (120,515) 12.22\nOutstanding at September 30, 2023 356,667 $ 12.09 1.0\nF- 32\nNote 11. Supplemental Balance Sheet Information\nSelected supplemental asset information is presented below.\nSeptember 30,\n2023 2022\n(in millions)\nInventories, net:\nPurchased components and raw materials $ 176.9 $ 181.8\nWork in process 60.0 56.8\nFinished goods 61.0 40.1\nTotal inventories, net $ 297.9 $ 278.7\nOther current assets:\nPrepaid expenses $ 17.8 $ 14.6\nNon-trade receivables 1.7 1.6\nIncome taxes 0.8 0.8\nMaintenance and repair supplies and tooling 4.1 2.8\nWorkers compensation reimbursement receivable 2.2 2.3\nOther current assets 4.9 4.7\nTotal other current assets $ 31.5 $ 26.8\nProperty, plant and equipment, net:\nLand $ 6.4 $ 5.7\nBuildings 117.2 87.6\nMachinery and equipment 525.8 456.0\nConstruction in progress 36.9 104.7\nTotal property, plant and equipment $ 686.3 $ 654.0\nAccumulated depreciation (374.6) (352.4)\nTotal property, plant and equipment, net $ 311.7 $ 301.6\nOther noncurrent assets:\nOperating lease right-of-use assets $ 23.6 $ 26.0\nMaintenance and repair supplies and tooling 21.1 20.4\nWorkers compensation reimbursement receivable 2.4 3.6\nNote receivable 1.8 1.7\nPension asset\n6.6 0.6\nDeferred financing fees 0.7 1.0\nOther noncurrent assets 2.6 3.4\nTotal noncurrent assets $ 58.8 $ 56.7\nF- 33\nSelected supplemental liability information is presented below.\nSeptember 30,\n2023 2022\n(in millions)\nOther current liabilities:\nCompensation and benefits $ 33.8 $ 40.2\nCustomer rebates 14.6 16.2\nInterest payable 5.3 5.3\nWarranty accrual 8.6 6.5\nDeferred revenues 9.2 8.1\nReturned goods accrual\n6.7 4.2\nOperating lease liabilities 4.9 4.4\nTaxes other than income taxes 2.0 4.4\nRestructuring liabilities 6.6 3.3\nIncome taxes payable 8.5 7.5\nWorkers compensation accrual 4.0 4.6\nCARES Act payroll tax liabilities - 4.4\nOther current liabilities 11.0 8.3\nTotal current liabilities $ 115.2 $ 117.4\nOther noncurrent liabilities:\nOperating lease liabilities $ 19.8 $ 22.4\nWarranty accrual 7.1 4.2\nTransition tax liability 3.1 4.1\nUncertain tax position liability 5.0 4.7\nWorkers' compensation accrual 5.9 6.5\nNMTC liability 3.9 3.9\nAsset retirement obligation 4.2 4.2\nDeferred development grant 2.5 2.5\nOther noncurrent liabilities 2.7 2.9\nTotal noncurrent liabilities $ 54.2 $ 55.4\nCARES Act\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (CARES Act) was signed into law. The CARES Act was a relief package intended to assist in many aspects of the American economy through direct secured loans and deferrals of the employer portion of social security taxes through the end of calendar year 2020, with 50% of the deferral due December 31, 2021 and the remainder due December 31, 2022. We elected to defer these obligations and the second portion of the deferral of approximately $4.4 million was outstanding as shown above. No amounts related to the CARES act deferral were outstanding as of September 30, 2023.\nNote 12. Supplemental Statement of Operations Information\nIn the year ended September 30, 2023, we incurred $10.2 million of Strategic reorganization and other charges primarily related to the leadership transition and other restructuring charges related to severance in addition to certain transaction-related expenses.\nF- 34\nBetween November 2019 and March 2021, we announced the purchase and closure of several facilities. We purchased a new facility in Kimball, Tennessee, to support and enhance our investment in our Chattanooga, Tennessee large casting foundry and closed our facilities in Hammond, Indiana and Woodland, Washington. We also completed the closures of our facilities in Aurora, Illinois and Surrey, British Columbia, Canada during our fiscal year 2022. The majority of the activities from these plants were transferred to our Kimball, Tennessee facility. We incurred $1.5 million and $5.6 million of expenses, respectively, for the years ended September 30, 2022, and 2021, as a result of these plant closures. The $5.6 million incurred during fiscal 2021 included approximately $3.2 million of termination benefit costs which are included in Strategic reorganization and other charges and approximately $2.4 million in inventory write-downs which are included in Cost of sales in our consolidated statements of operations.\nAdditionally, fiscal year 2022 included Strategic reorganization and other charges related to the Albertville tragedy and certain transaction-related costs. Fiscal year 2021 included Strategic reorganization and other charges related to the Albertville tragedy, and certain transaction costs, partially offset by a one-time settlement gain in connection with an indemnification from a previously owned property.\nActivity in accrued restructuring, reported as part of other current liabilities, is presented below.\n2023 2022 2021\n(in millions)\nBeginning balance $ 3.3 $ 3.1 $ 2.8\nExpenses incurred 10.2 7.2 5.4\nAmounts paid (6.9) (7.0) (5.1)\nEnding balance $ 6.6 $ 3.3 $ 3.1\nSelected supplemental statement of operations information is presented below.\n2023 2022 2021\n(in millions)\nIncluded in selling, general and administrative expenses:\nResearch and development $ 25.9 $ 24.5 $ 17.1\nAdvertising $ 4.7 $ 5.5 $ 3.2\nInterest expense, net:\n5.5% Senior Notes $ - $ - $ 17.6\n4.0% Senior Notes 18.0 18.0 6.2\nDeferred financing costs amortization 1.0 1.0 1.1\nABL Agreement 0.9 0.9 0.9\nCapitalized interest (1.6) (2.6) (2.3)\nOther interest expense 0.1 0.3 0.3\nTotal interest expense 18.4 17.6 23.8\nInterest income (3.7) (0.7) (0.4)\nNet interest expense $ 14.7 $ 16.9 $ 23.4\nF- 35\nNote 13. Accumulated Other Comprehensive Income (Loss)\nAccumulated other comprehensive income (loss) is as follows:\nForeign currency translation, net of income tax Pension liability, net of income tax Total\n(in millions)\nBalance at September 30, 2022 $ (8.3) $ (36.3) $ (44.6)\nCurrent period other comprehensive income (loss) (11.9) 7.8 (4.1)\nBalance at September 30, 2023 $ (20.2) $ (28.5) $ (48.7)\nFor the year end September 30, 2023, pension liability included in the consolidated statements of comprehensive income was $10.4 million, net of income tax of $2.6 million. For the year ended September 30, 2023, foreign currency translation included in the consolidated statements of comprehensive income was $11.9 million, net of no income tax.\nNote 14. Segment Information\nWe adopted our current management structure effective October 1, 2021 which resulted in a change to our reportable segments. Prior period information was recast to conform to the current presentation. The recasting has no effect on our previously reported consolidated balance sheets, consolidated statements of operations, or consolidated statements of cash flows. Our business units and reportable segments are Water Flow Solutions and Water Management Solutions. Water Flow Solutions portfolio includes iron gate valves, specialty valves and service brass products. Water Management Solutions portfolio includes fire hydrants, repair and installation, natural gas, metering, leak detection, and pressure management and control products and solutions.\nSegment results are not reflective of their results on a stand-alone basis. Intersegment sales and transfers are made at selling prices generally intended to cover costs. The determination of segment results excludes certain expenses designated as Corporate because they are not directly attributable to segment operations. Interest expense, loss on early extinguishment of debt and income taxes are not allocated to the segments. Corporate expenses include those costs incurred by our corporate function, such as accounting, treasury, risk management, human resources, legal, tax and other administrative functions. Corporate assets principally consist of our cash, operating lease assets, and certain real property previously owned by U.S. Pipe and Anvil. Business segment assets primarily consist of inventories, property, plant and equipment, and intangible assets.\nThe Company has two significant customers that comprise greater than 10% of gross sales. One customer comprised 18%, 21%, and 18% of consolidated revenues for the fiscal years ended September 30, 2023, 2022, and 2021, respectively. The Company has outstanding Accounts receivable from this customer of $46.4 million and $52.1 million as of September 30, 2023 and 2022, respectively. Another customer comprised 18%, 20%, and 19% of consolidated revenues for the fiscal years ended September 30, 2023, 2022, and 2021, respectively. The Company has outstanding Accounts receivable from this customer of $37.7 million and $38.6 million as of September 30, 2023 and 2022, respectively. The Company reports revenue for these customers in both reportable segments, Water Flow Solutions and Water Management Solutions.\nGeographical area information is presented below.\nUnited States Israel Other Total\n(in millions)\nProperty, plant and equipment, net:\nSeptember 30, 2023 $ 295.6 $ 11.9 $ 4.2 $ 311.7\nSeptember 30, 2022 $ 284.9 $ 12.6 $ 4.1 $ 301.6\nF- 36\nYear ended September 30,\n2023 2022 2021\n(in millions)\nWater Flow Solutions disaggregated net revenue:\nCentral $ 176.0 $ 190.9 $ 155.1\nNortheast 130.6 125.3 110.4\nSoutheast 118.4 154.3 125.7\nWest 160.9 182.8 172.4\nUnited States $ 585.9 $ 653.3 $ 563.6\nCanada 36.2 55.0 45.7\nOther international locations 12.3 5.8 8.5\n$ 634.4 $ 714.1 $ 617.8\nWater Management Solutions disaggregated net revenue:\nCentral $ 169.2 $ 142.9 $ 125.6\nNortheast 151.2 115.1 100.2\nSoutheast 137.4 109.4 106.5\nWest 119.0 102.9 99.1\nUnited States $ 576.8 $ 470.3 $ 431.4\nCanada 38.3 39.2 38.1\nOther international locations 26.2 23.8 23.7\n$ 641.3 $ 533.3 $ 493.2\nF- 37\nSummarized financial information for our segments is presented below.\nWater Flow\nSolutions Water Management\nSolutions Corporate Total\n(in millions)\nNet revenue:\n2023 $ 634.4 $ 641.3 $ - $ 1,275.7\n2022 714.1 533.3 - 1,247.4\n2021 $ 617.8 $ 493.2 $ - $ 1,111.0\nOperating income (loss):\n2023 $ 79.6 $ 106.0 $ (58.2) $ 127.4\n2022 118.3 48.7 (55.4) 111.6\n2021 $ 120.9 $ 70.3 $ (59.5) $ 131.7\nDepreciation and amortization:\n2023 $ 32.8 $ 29.5 $ 0.2 $ 62.5\n2022 30.0 30.3 0.2 60.5\n2021 $ 30.5 $ 28.9 $ 0.2 $ 59.6\nStrategic reorganization and other charges:\n2023 $ - $ 1.7 $ 8.5 $ 10.2\n2022 0.2 0.4 6.6 7.2\n2021 $ 0.1 $ (0.4) $ 8.3 $ 8.0\nCapital expenditures:\n2023 $ 33.4 $ 14.2 $ - $ 47.6\n2022 43.4 11.3 - 54.7\n2021 $ 51.0 $ 11.6 $ 0.1 $ 62.7\nIntangible assets, net and goodwill\nSeptember 30, 2023 $ 283.8 $ 143.9 $ - $ 427.7\nSeptember 30, 2022 $ 302.6 $ 157.2 $ - $ 459.8\nInventories, net:\nSeptember 30, 2023 $ 173.8 $ 124.1 $ - $ 297.9\nSeptember 30, 2022 $ 160.5 $ 118.2 $ - $ 278.7\nNote 15. Commitments and Contingencies\nWe are involved in various legal proceedings that have arisen in the normal course of operations, including the proceedings summarized below. We provide for costs relating to these matters when a loss is probable and the amount is reasonably estimable. Legal and administrative costs related to these matters are expensed as incurred. The effect of the outcome of these matters on our financial statements cannot be predicted with certainty as any such effect depends on the amount and timing of the resolution of such matters. Other than the litigation described below, we do not believe that any of our outstanding litigation would have a materially adverse effect on our financial position, results of operations, cash flows or liquidity.\nEnvironmental. We are subject to a wide variety of laws and regulations concerning the protection of the environment, both with respect to the operations at many of our properties and with respect to remediating environmental conditions that may exist at our own or other properties. We accrue for environmental expenses resulting from existing conditions that relate to past operations when the costs are probable and reasonably estimable.\nIn the acquisition agreement pursuant to which a predecessor to Tyco International plc, now Johnson Controls International plc (Tyco), sold our businesses to a previous owner in August 1999, Tyco agreed to indemnify us and our affiliates, among other things, for all Excluded Liabilities. Excluded Liabilities include, among other things, substantially all liabilities relating to the time prior to August 1999, including environmental liabilities. The indemnity survives indefinitely. Tycos indemnity does not cover liabilities to the extent caused by us or the operation of our businesses after August 1999, nor does it cover\nF- 38\nliabilities arising with respect to businesses or sites acquired after August 1999. Since 2007, Tyco has engaged in multiple corporate restructurings, split-offs and divestitures. While none of these transactions directly affects the indemnification obligations of the Tyco indemnitors under the 1999 acquisition agreement, the result of such transactions is that the assets of, and control over, such Tyco indemnitors has changed. Should any of these Tyco indemnitors become financially unable or fail to comply with the terms of the indemnity, we may be responsible for such obligations or liabilities.\nThe purchaser of U.S. Pipe has been identified as a potentially responsible party (PRP) under the Comprehensive Environmental Response, Compensation and Liability Act in connection with a former manufacturing facility operated by U.S. Pipe that was in the vicinity of a proposed Superfund site located in North Birmingham, Alabama. Under the terms of the acquisition agreement relating to our sale of U.S. Pipe, we agreed to indemnify the purchaser for certain environmental liabilities, including those arising out of the former manufacturing site in North Birmingham. Accordingly, the purchaser tendered the matter to us for indemnification, which we accepted. Ultimate liability for the site will depend on many factors that have not yet been determined, including the determination of the Environmental Protection Agencys remediation costs, the number and financial viability of the other PRPs (there are four other PRPs currently) and the determination of the final allocation of the costs among the PRPs. Since the amounts of such costs cannot be reasonably estimated at this time, no amounts have been accrued for this matter at September 30, 2023.\nIndemnifications. We are a party to contracts in which it is common for us to agree to indemnify third parties for certain liabilities that arise out of or relate to the subject matter of the contract. In some cases, this indemnity extends to related liabilities arising from the negligence of the indemnified parties, but usually excludes any liabilities caused by gross negligence or willful misconduct. We cannot estimate the potential amount of future payments under these indemnities until events arise that would trigger a liability under the indemnities.\nAdditionally, in connection with the sale of assets and the divestiture of businesses, such as the divestitures of U.S. Pipe and Anvil, we may agree to indemnify buyers and related parties for certain losses or liabilities incurred by these parties with respect to: (i) the representations and warranties made by us to these parties in connection with the sale and (ii) liabilities related to the pre-closing operations of the assets or business sold. Indemnities related to pre-closing operations generally include certain environmental and tax liabilities and other liabilities not assumed by these parties in the transaction.\nIndemnities related to the pre-closing operations of sold assets or businesses normally do not represent additional liabilities to us, but simply serve to protect these parties from potential liability associated with our obligations existing at the time of the sale. As with any liability, we have accrued for those pre-closing obligations that are considered probable and reasonably estimable. Should circumstances change, increasing the likelihood of payments related to a specific indemnity, we will accrue a liability when future payment is probable and the amount is reasonably estimable.\nOther Matters. We monitor and analyze our warranty experience and costs periodically and may revise our accruals as necessary. Factors considered in our analyses include warranty terms, specific claim situations, general incurred and projected failure rates, the nature of product failures, product and labor costs, and general business conditions.\nWe are party to a number of lawsuits arising in the ordinary course of business, including product liability cases for products manufactured by us or third parties. While the results of litigation cannot be predicted with certainty, we believe that the final outcome of such other litigation is not likely to have a materially adverse effect on our financial position, results of operations, cash flows or liquidity.\nNote 16. Subsequent Events\nIsrael-Hamas War\nIn October 2023, the Israel-Hamas war caused a temporary shutdown of our facility in Ariel, Israel. While we have reopened the facility, continued disruptions and escalations of conflicts in the area increase the likelihood of supply interruptions and may hinder our ability to acquire the necessary materials we need to make our products. Supply disruptions from lack of access to materials has impacted, and continues to impact, our ability to produce and deliver our products on time and at favorable pricing.\nDividend Declaration\nOn October 24, 2023, our Board of Directors declared a dividend of $0.064 per share on our common stock, payable on or about November 20, 2023 to stockholders of record at the close of business on November 9, 2023.\nF- 39\nCybersecurity Incident\nOn October 28, 2023, we announced a cybersecurity incident impacting certain internal operational and information technology systems. Our incident response team has implemented response and containment protocols to respond to and address this issue. We are working with leading third-party cybersecurity specialists to support our investigations, recovery and remediation efforts. The incident resulted in additional expenditures during the first quarter of fiscal 2024 and caused delays in parts of our business operations that is expected to adversely impact the Companys financial results.\nF- 40"
}