{
    "cik": "1352081",
    "company": "Cardinal Ethanol LLC",
    "filing_type": "10-K",
    "filing_date": "2023-11-30",
    "period_of_report": "2023-09-30",
    "sic": "2860",
    "state_of_inc": "IN",
    "state_location": "IN",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1352081/0001352081-23-000035-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1352081/000135208123000035/card-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1352081/0001352081-23-000035.txt",
    "filename": "1352081_10K_2023_0001352081-23-000035.htm",
    "content": "ITEM 1. BUSINESS\nBusiness Development\nCardinal Ethanol, LLC is an Indiana limited liability company formed on February 7, 2005 with the name of Indiana Ethanol, LLC. On September 27, 2005, we changed our name to Cardinal Ethanol, LLC. References to we, us, our, Cardinal and the Company refer to Cardinal Ethanol, LLC. We began producing ethanol, distillers grains and corn oil at the plant in November 2008 (the \"Ethanol Division\"). In addition, in 2017 we added a facility to allow us to procure, transport and sell grain commodities through our new grain operations (the \"Trading Division\").\nOn January 20, 2022, we entered into an Equipment Purchase and Installation Agreement (the \"EPC Agreement\") with ICM, Inc. pursuant to which ICM has agreed to engineer, procure, construct, and install its high protein feed system and license to us its proprietary, patent-protected technology to use, operate and maintain the system. Pursuant to the EPC Agreement and subsequent adjustments due to change orders executed by the parties, we expect to pay approximately $50,000,000, including recent change orders, which is payable in installments. This price is subject to further adjustment in the event additional change orders are executed. We will also pay license fees of $10 per ton of PROTOMAX™, a high protein feed product, produced by the system for a period of 10 years. We expect to fund the project from operations and from our current credit facilities as amended. We began installation of the system during the fourth quarter of our fiscal year 2022 and expect to complete installation by the end of calendar year 2023. Our distillers grains production will eventually be replaced with high protein feed once the installation of our high protein feed system is complete. We expect to experience temporary shutdowns of our plant from time to time during our 2024 fiscal year in connection with the installation of our high protein feed system which could result in an overall reduction in gallons of ethanol and pounds of corn oil produced. We also expect that, once the project is complete, there will be a period of time of up to three months before our production rates of ethanol and corn oil production will return to historic levels and our production of high protein feed will ramp up to expected rates. This may result in a significant reduction in our production for the fiscal year 2024 when compared to previous levels.\nOn September 14, 2022, we entered into Amendment No. 4 to the Ethanol Purchase and Sale Agreement with Murex, LLC (the \"Murex Amendment\"). The Murex Amendment amends the Ethanol Purchase and Sale Agreement dated December 18, 2006, as amended. The Murex Amendment was effective on December 1, 2022. Please refer to Item 1 - Business - Reportable Operating Segments - Ethanol Division for more information.\nOn February 21, 2023, we executed a Nineteenth Amendment of First Amended and Restated Construction Loan Agreement with our primary lender, First National Bank of Omaha (the \"Bank\"), which amends the First Amended and Restated Construction Loan Agreement dated June 10, 2013 (the \"Amendment\"). The Amendment increased the maximum availability on the Declining Revolving Credit Loan from $36,000,000 to $39,000,000 and extended the date at which the principal balance of the Declining Revolving Credit Loan is expected to be converted to term debt from February 1, 2024 to May 1, 2024. The Amendment also extended the date that the Revolving Credit Loan matures from February 28, 2023 to February 28, 2024 and increased the capital expenditures loan covenant from $5,000,000 per year to $6,000,000 per year of expenditures without prior approval from the Bank. In connection with the Amendment, we executed a Fifth Amended and Restated Declining Revolving Credit Note and a Fifth Amendment of First Amended and Restated Construction Loan Mortgage, Security Agreement, Assignment of Leases and Rents and Fixture Financing Statement. The financing is secured by a mortgage on our real property and a security interest in all other assets, both tangible and intangible.\nWe record Indiana passthrough entity tax in accordance with ASC 740 and have elected to account for the payments as an equity transaction through member distributions. At September 30, 2023, accrued distributions for passthrough entity tax was $2,100,000. The Company paid approximately $2,279,000 for 2022 taxes during the fiscal year ended September 30, 2023.\nWe have engaged with an unrelated third party to pursue the possible joint development of integrated carbon dioxide facilities, transportation infrastructure and a carbon sequestration site for the carbon dioxide emissions produced by our plant (the \"CCS Project\"). On January 16, 2023, Cardinal One Carbon Holdings, LLC, a wholly owned subsidiary of Cardinal\nEthanol, LLC, entered into a Partnership Agreement (the \"LPA\") with Vault CCS Holdings LP pursuant to which Cardinal One Carbon Holdings, LLC and Vault CCS Holdings LP formed a joint venture operating under the name of One Carbon Partnership Holdings LP (the \"Limited Partnership\") to pursue the CCS Project. The LPA governs the rights, duties and responsibilities of the parties in connection with the ownership of the Limited Partnership. In addition, on the same date, Cardinal One Carbon Holdings, LLC and Vault CCS Holdings LP entered into an Amended and Restated Limited Liability Company Agreement of One Carbon Partnership GP LLC (the \"GP\"). The purpose of the GP is to serve as the general partner of the Limited Partnership. The CCS Project is still in its early stages and is subject to many variables that could have a material effect on its feasibility and the parties' ability to complete the CCS Project. Please refer to Item 8 - Financial Statements - Note 15 - Equity Method Investments for more information.\nOn October 23, 2023, Cardinal Colwich, LLC (\"Cardinal Colwich\"), a wholly owned subsidiary of Cardinal Ethanol, LLC, entered into an Asset Purchase Agreement with Element, LLC (\"Seller\") by and through Alliance Management, LLC (the \"Receiver\") acting in its capacity as the court-appointed receiver (the \"APA\"). The APA provides for the purchase of substantially all of the assets of Seller used in connection with the production of ethanol, high protein distillers grains and corn oil as set forth in more detail in the APA (the \"Purchased Assets\") free and clear of any claims, restrictions, mortgages, security interest, demands, charges and encumbrances. The facility was constructed by ICM, Inc. with a name plate capacity to produce 70 million gallons of ethanol annually and is located in Colwich, Kansas. The cash purchase price for the Purchased Assets is $44,000,000. In addition, Cardinal Colwich will assume certain liabilities specified in the APA. The APA and the consummation of the sale transaction is subject to approval by the court and other closing conditions including, but not limited to, receipt of consents and approvals necessary for the assignment and transfer of certain contracts to be assigned by Seller and assumed by Cardinal Colwich, transfer of the Purchased Assets free and clear of any claims, and receipt of a title insurance policy insuring good, marketable title. We expect to fund the purchase from operations and are currently exploring an amendment of our current credit facilities to allow us to borrow up to 50% of the cash purchase price upon consummation of the transaction.\nReportable Operating Segments\nOperating segments are defined as components of an enterprise for which separate financial information is available that are evaluated regularly by the chief operating decision maker in deciding how to allocate resources and in assessing performance. Based on the nature of the products, services and operations and the expected financial results, we review our operations within the following two separate operating segments: (1) ethanol production through our Ethanol Division; and (2) trading of agricultural grains through our Trading Division. We currently do not have or anticipate we will have any other lines of business or other significant sources of revenue other than the sale of ethanol, distillers grains, corn oil and the trading of agricultural grains.\nEthanol Division\nIn October 2020, we obtained a new Title V air permit allowing us to increase our annual ethanol production to 175 million gallons compared to 140 million gallons under our previous permit. Our annual ethanol production rate for the fiscal year ended September 30, 2023 was approximately 135 million gallons annually which is approximately 35% above the nameplate capacity for the plant.\nOur revenues are primarily derived from the sale of our ethanol, distillers grains and corn oil. We market and sell ethanol and its co-products (distillers grains and corn oil) primarily in the continental United States using third party marketers. Murex, LLC markets all of our ethanol. Our distillers grains are marketed by CHS, Inc. We market and distribute all of the corn oil we produce directly to end users and third party brokers.\nPrincipal Products\nThe principal products in our Ethanol Division are fuel-grade ethanol and distillers grains. In addition, we are extracting corn oil and capturing a portion of the raw carbon dioxide we produce for sale. The table below shows the approximate percentage of our total ethanol division revenue which is attributed to each of our products for each of our last three fiscal years.\nProduct Fiscal Year 2023 Fiscal Year 2022 Fiscal Year 2021\nEthanol 78 % 80 % 77 %\nDistillers Grains 15 % 14 % 18 %\nCorn Oil 7 % 6 % 5 %\nCarbon Dioxide < 1 % < 1 % < 1%\nEthanol\nOur primary product is ethanol. Ethanol is ethyl alcohol, a fuel component made primarily from corn and various other grains. The ethanol we produce is manufactured from corn. Although the ethanol industry continues to explore production technologies employing various feedstocks, such as biomass, corn-based production technologies remain the most practical and provide the lowest operating risks. Corn produces large quantities of carbohydrates, which convert into glucose more easily than most other kinds of biomass.\nAn ethanol plant is essentially a fermentation plant. Ground corn and water are mixed with enzymes and yeast to produce a substance called beer, which contains about 10% alcohol and 90% water. The beer is boiled to separate the water, resulting in ethyl alcohol, which is then dehydrated to increase the alcohol content. This product is then mixed with a certified denaturant to make the product unfit for human consumption and commercially saleable.\nEthanol can be used as: (i) an octane enhancer in fuels; (ii) an oxygenated fuel additive for the purpose of reducing ozone and carbon monoxide emissions; and (iii) a non-petroleum-based gasoline substitute. Approximately 95% of all ethanol is used in its primary form for blending with unleaded gasoline and other fuel products. Used as a fuel oxygenate, ethanol provides a means to control carbon monoxide emissions in large metropolitan areas. The principal purchasers of ethanol are generally the wholesale gasoline marketer or blender. The principal markets for our ethanol are petroleum terminals in the northeastern United States.\nDistillers Grains\nThe principal co-product of the ethanol production process is distillers grains, a high protein, high-energy animal feed supplement primarily marketed to the dairy, beef, poultry and swine industries. Dry mill ethanol processing creates three forms of distillers grains: Distillers Wet Grains with Solubles (\"DWS\"), Distillers Modified Wet Grains with Solubles (\"DMWS\") and Distillers Dried Grains with Solubles (\"DDGS\"). DWS is processed corn mash that contains approximately 70% moisture. DWS has a shelf life of approximately three days and can be sold only to farms within the immediate vicinity of an ethanol plant. DMWS is DWS that has been dried to approximately 50% moisture. DMWS have a slightly longer shelf life of approximately ten days and are often sold to nearby markets. DDGS is DWS that has been dried to 10% to 12% moisture. DDGS has an almost indefinite shelf life and may be sold and shipped to any market regardless of its vicinity to an ethanol plant.\nCorn Oil\nSince November 2008, we have been separating some of the corn oil contained in our distillers grains for sale. We have worked hard to improve corn oil production levels and continue to fine tune the operation of our equipment to further increase production rates. The corn oil that we produce is not food grade corn oil and therefore cannot be used for human consumption. However, corn oil can be used as the feedstock to produce biodiesel, as a feed ingredient and has other industrial uses.\nCarbon Dioxide\nSince March 2010, we have been selling some of the carbon dioxide gas produced at the plant.\nWe have engaged with an unrelated third party to pursue the possible joint development of integrated carbon dioxide facilities, transportation infrastructure and a carbon sequestration site for the carbon dioxide emissions produced by our plant (the \"CCS Project\").\nEthanol, Distillers Grains, Corn Oil and Carbon Dioxide Markets\nAs described below in \"Distribution Methods,\" we market and distribute our ethanol and distillers grains through third parties. Our ethanol and distillers grains marketers make all decisions, in consultation with management, with regard to where our products are marketed. Our ethanol and distillers grains are predominately sold in the domestic market. Specifically, we ship a substantial portion of the ethanol we produce to the New York harbor. We expect our ethanol and distillers grains marketers to explore all markets for our products, including export markets, and believe that there is potential for increased international sales of our products. However, due to high transportation costs, and the fact that we are not located near a major international shipping port, we expect a large portion of our products to be marketed and sold domestically. In addition, export demand is typically more unpredictable than domestic demand and tends to fluctuate over time as it is subject to monetary and political forces in other nations.\nCanada was the leading destination for United States ethanol exports during the past year with the European Union, United Kingdom and South Korea importing a significant amount of ethanol from the United States. Ethanol exports for the first half of 2023 have been lower compared to the same period in 2022. Tariffs implemented by Brazil and China on ethanol imported from the United States have virtually eliminated export demand from those countries. In March 2022, Brazil suspended its tariff through the end of the year on ethanol imported from the United States following a 10% reduction on the tariff in November 2021. However, Brazil reinstated the tariff earlier this year. Trade barriers with key markets may continue to take a toll on ethanol export demand which could negatively affect domestic ethanol prices.\nExports of distillers grains have been lower for the first half of 2023 compared to the same period in 2022. Mexico was the largest distillers grains market. Indonesia, South Korea and Vietnam were also top destinations for distillers grains exports. Historically, the United States ethanol industry exported a significant amount of distillers grains to China. Anti-dumping and anti-subsidy duties first imposed by China in 2016 have effectively closed the Chinese market.\nAs described below in \"Distribution Methods,\" we sell carbon dioxide to Air Products and Chemicals, Inc. (\"Air Products\") and we market and distribute all of the corn oil we produce directly to end users and third party brokers in the domestic market.\nDistribution Methods\nOur ethanol plant is located near Union City, Indiana in Randolph County. We selected the site because of its proximity to existing ethanol consumption and accessibility to road and rail transportation. Our site is in close proximity to rail and major highways that connect to major population centers such as Indianapolis, Cincinnati, Columbus, Cleveland, Toledo, Detroit, New York and Chicago.\nEthanol\nWe entered into an Ethanol Purchase and Sale Agreement with Murex, LLC (\"Murex\") for the purpose of marketing and distributing all of the ethanol we produce at the plant. Under the terms of the agreement, Murex markets all of our ethanol unless we choose to sell a portion at a retail fueling station owned by us or one of our affiliates. Murex pays to us the purchase price invoiced to the third-party purchaser less all resale costs, taxes paid by Murex and Murex's commission which is calculated on each net gallon of ethanol taken under the agreement. Murex has agreed to purchase on its own account and at market price any ethanol which it is unable to sell to a third party purchaser. Murex has promised to use its best efforts to obtain the best purchase price available for our ethanol. In addition, Murex has agreed to promptly notify us of any and all price arbitrage opportunities. Under the agreement, Murex is responsible for all transportation arrangements for the distribution of our ethanol. Murex handles all RIN activity, submits regulatory reports, and leases us a minimum number of tank cars for rail transportation and manages the tank car fleet in exchange for a monthly payment.\nOn September 14, 2022, we executed an amendment to extend the term until December 31, 2024, subject to automatic renewals thereafter for one-year periods unless either party gives notice of non-renewal at least 90 days prior to the end of the current term. The agreement may also be terminated due to the insolvency or intentional misconduct of either party or upon the default of one of the parties as set forth in the agreement. In addition, the amendment added a provision that allows Cardinal to terminate the agreement on 90 days prior written notice if we experience a \"Material Change in Control\". However, upon termination of the agreement for any reason, we may be obligated to continue to deliver ethanol to Murex for a period of time to cover certain contractual commitments for which we gave prior written approval. The amendment also provides for certain adjustments to the purchase price for sales made to Murex for its own account or for sales of exported ethanol. If this adjusted price can not be finalized at time of payment, the parties may agree upon a provisional price which shall be trued up later. The amendment was effective on December 1, 2022.\nDistillers Grains\nWe have entered into an agreement with CHS, Inc. to market all distillers grains we produce at the plant. CHS, Inc. is a diversified energy, grains and foods company owned by farmers, ranchers and cooperatives. CHS, Inc. provides products and services ranging from grain marketing to food processing to meet the needs of its customers around the world. We receive a percentage of the selling price actually received by CHS, Inc. in marketing our distillers grains to its customers. The agreement remains in effect unless otherwise terminated by either party with 120 days notice. Under the agreement, CHS, Inc. is responsible for all transportation arrangements for the distribution of our distillers grains.\nCorn Oil\nWe market and distribute all of the corn oil we produce directly to end users and third party brokers. Our corn oil is mainly used as an animal feed ingredient and as a feedstock in biodiesel production.\nCarbon Dioxide\nAir Products purchases a portion of the carbon dioxide gas produced at our plant. We entered into a Carbon Dioxide Purchase and Sale Agreement with Air Products under which Air Products was obligated to purchase a minimum of 98,700 tons of carbon dioxide gas. In addition, we executed a Site Lease Agreement with Air Products under which Air Products leased a portion of our property, on which it is operating a carbon dioxide liquefaction plant. On November 26, 2019, we sent written notice of termination of the Carbon Dioxide Purchase and Sale Agreement and Site Lease Agreement which was to be effective on June 1, 2020. However, due to disruptions related to COVID-19, the Company and Air Products agreed to rescind the terminations and extend the agreements one year to June 1, 2021. Effective June 1, 2021, we amended the agreement with Air Products. The amendment extended the initial term of the agreement to May 31, 2026 with automatic one-year renewal periods thereafter unless terminated by either party by providing at least six months written notice prior to the expiration of the term. The amendment increased the price paid for carbon dioxide subject to a price adjustment in the event of a take or pay shortfall. The amendment also provided that we may do anything we wish with excess carbon dioxide gas produced provided that if the excess is sold to competitors of Air Products then Air Products' annual take or pay obligation will be reduced accordingly and Air Products has the option to terminate the Agreement upon 90 days written notice. In addition, the amendment provides that, after the three year anniversary, we may terminate the agreement upon the occurrence of a Change of Control Event as defined in the amendment or if we decide to sequester our carbon dioxide.\nFederal Ethanol Supports and Governmental Regulation\nFederal Ethanol Supports\nThe ethanol industry is dependent on several economic incentives to produce ethanol. One significant federal ethanol support is the Federal Renewable Fuels Standard (the RFS). The RFS requires that in each year, a certain amount of renewable fuels must be used in the United States. The RFS is a national program that does not require that any renewable fuels be used in any particular area or state, allowing refiners to use renewable fuel blends in those areas where it is most cost-effective. The RFS statutory volume requirement increased incrementally each year until the United States reached the requirement to use 36 billion gallons of renewable fuels in 2022. Starting in 2009, the RFS required that a portion of the RFS must be met by certain advanced renewable fuels. These advanced renewable fuels include ethanol that is not made from corn, such as cellulosic ethanol and biomass based biodiesel. The use of these advanced renewable fuels increases each year as a percentage of the total renewable fuels required to be used in the United States.\nAnnually, the United States Environmental Protection Agency (\"EPA\") was required by statute to pass a rule that established the number of gallons of different types of renewable fuels that must be used in the United States which is called the renewable volume obligation (\"RVO\"). The EPA had the authority to waive the RFS statutory volume requirement, in whole or in part, provided one of the following two conditions have been met: (1) there is inadequate domestic renewable fuel supply; or (2) implementation of the requirement would severely harm the economy or environment of a state, region or the United States. For the last nine years of the program's statutory annual requirements, the EPA exercised its waiver authority and set the RVO below the statutory amount. The RFS began a new phase in 2023 as the EPA is now required to determine the annual RVO.\nThe statutory volumes and the EPA's volumes for 2021 and 2022 and the EPA's volumes for 2023, 2024 and 2025 (in billion gallons) are as follows:\nTotal Renewable Fuel Volume Requirement Portion of Volume Requirement That Can Be Met By Corn-based Ethanol\n2021 Statutory 33.00 15.00\nEPA Rule 7/2022 18.84 13.79\n2022 Statutory 36.00 15.00\nEPA Rule 7/2022 20.63 (+0.25) 15.00\n2023 EPA Rule 7/2023\n20.94 (+0.25)\n15.00\n2024 EPA Rule 7/2023\n21.54\n15.00\n2025 EPA Rule 7/2023\n22.33\n15.00\nSmall refineries can petition the EPA annually for an exemption from their ethanol use requirements for the prior compliance year. The EPA granted significantly more small refinery waivers in 2018 and 2019 than in past years and did not reallocate the waived gallons to other refiners. These actions resulted in decreased ethanol demand which led to reduced market ethanol prices and negative operating margins in the ethanol industry. In January 2020, the Tenth Circuit Court of Appeals ruled that small refinery exemptions may only be granted to refineries that had secured them continuously each year since 2010. Consistent with this ruling, in September 2020, the EPA denied certain small refinery exemption petitions filed by oil refineries in 2020 seeking retroactive relief from their ethanol use requirements for prior years. In June 2021, the U.S. Supreme Court reversed the decision finding that a small refinery may obtain a hardship exemption even if its earlier exemption had lapsed in one or more previous years. In June 2022, the EPA announced the denial of 69 small refinery exemption petitions for one or more compliance years between 2016 and 2021 on the grounds that the petitioners had failed to show that the EPA had a basis to approve them. In July 2023, the EPA announced the denial of 26 small refinery exemption petitions for one or more compliance years between 2016 and 2023 on the grounds that the petitioners had failed to show that the EPA had a basis to approve them.\nIn February 2010, the EPA issued new regulations governing the RFS. These new regulations have been called RFS2. Specifically, the EPA adopted rules to determine which renewable fuels provided sufficient reductions in green house gases, compared to conventional gasoline, to qualify under the RFS program. RFS2 establishes a tiered approach, where regular renewable fuels are required to accomplish a 20% green house gas reduction compared to gasoline, advanced biofuels and biomass-based biodiesel must accomplish a 50% reduction in green house gases, and cellulosic biofuels must accomplish a 60% reduction in green house gases. Any fuels that fail to meet this standard cannot be used by fuel blenders to satisfy their obligations under the RFS program. However, RFS2 as adopted by the EPA provides that corn-based ethanol from modern ethanol production processes meets the definition of a renewable fuel under the RFS program. Our ethanol plant was grandfathered into the RFS up to 115,000,000 gallons annually due to the fact that it was constructed prior to the effective date of the lifecycle green house gas requirement. Therefore, we are not required to prove compliance with the lifecycle green house gas reductions for a significant amount of our production. Certain provisions of RFS2 as adopted may disproportionately benefit ethanol produced from sugarcane. This could make sugarcane based ethanol, which is primarily produced in Brazil, more competitive in the United States ethanol market.\nMost ethanol that is used in the United States is sold in a blend called E10. E10 is a blend of 10% ethanol and 90% gasoline. E10 is approved for use in all standard vehicles. In 2022, gasoline demand in the United States was approximately 135.73 billion gallons compared to consumption of approximately 135.06 billion gallons in 2021. Assuming that all gasoline in the United States is blended at a rate of 10% ethanol and 90% gasoline, the maximum demand for ethanol in 2022 was 13.57 billion gallons per year. This is commonly referred to as the blending wall, which represents a theoretical limit where more ethanol cannot be blended into the national gasoline pool. This is a theoretical limit because it is believed that it would not be possible to blend ethanol into every gallon of gasoline that is being used in the United States and it discounts the possibility of additional ethanol used in higher percentage blends. Gasoline demand is estimated to rise in 2023 but remain shy of pre-COVID-19 levels.\nIn June 2012, the EPA gave final approval for the sale of E15, gasoline which is blended at a rate of 15% ethanol and 85% gasoline, for use in vehicles manufactured in the model year 2001 and later. Although there have been significant steps towards introduction of E15 in the marketplace, there are still obstacles to meaningful market penetration by E15. Many states\nstill have regulatory issues that hamper or prevent the sale of E15. In addition, sales of E15 may be limited because E15 is not approved for use in all vehicles, the EPA requires a label that may discourage consumers from using E15, and retailers may choose not to sell E15 due to concerns regarding liability. Previously, different gasoline blendstocks were required at certain times of the year due to federal regulations related to fuel evaporative emissions which prevented E15 from being used during certain times of the year in various states. In May 2019, the EPA issued a final rule allowing the year-round sale of E15. However in June 2021, the U.S. Court of Appeals for the District of Columbia struck down this rule finding that the EPA exceeded its authority. In May 2022, the EPA issued an emergency waiver to temporarily allow summer sales of E15. In March 2023, the EPA proposed a rule to to allow year-round sales but the rule would not take effect until 2024. In May 2023, the EPA again issued an emergency waiver to temporarily allow summer sales of E15.\nA blender pump is a gasoline pump that can dispense a variety of different ethanol/gasoline blends. Blender pumps typically can dispense E10, E20, E30, E40, E50 and E85. These blender pumps accomplish these different ethanol/gasoline blends by internally mixing ethanol and gasoline which are held in separate tanks at the retail gas stations. Many in the ethanol industry believe that increased use of blender pumps will increase demand for ethanol by allowing gasoline retailers to provide various mid-level ethanol blends in a cost effective manner and allowing consumers with flex-fuel vehicles to purchase more ethanol through these mid-level blends. However, the expense of blender pumps has delayed their availability in the retail gasoline market.\nIn May 2020, the United States Department of Agriculture (\"USDA\") announced the Higher Blends Infrastructure Incentive Program (\"HBIIP\") which consists of funding for grants to be used to increase the availability of higher blends of ethanol and biodiesel fuels. Funds may be awarded to retailers such as fueling stations and convenience stores to assist in the cost of installation or upgrading of fuel pumps and other infrastructure. Earlier this year, the USDA announced $25 million in grants awarded for 59 biofuel infrastructure projects through the HBIIP. In June 2023, the USDA announced that the department would accept new applications for $450 million in grants through the HBIIP accessible in quarterly windows starting July 2023 and ending September 30, 2024.\nOn August 16, 2022, the Inflation Reduction Act of 2022, which has several provisions that may benefit the ethanol industry, was signed into law. Since then, the Department of the Treasury (Treasury) has issued proposed regulations on certain aspects of the new law and more are forthcoming; however, considerable uncertainty remains as to how many of the new provisions will be implemented. The Inflation Reduction Act maintains the 12-year credit period for the existing Section 45Q tax credit for carbon capture and storage (\"CCS\"). However, the Act extends eligibility for the credit to facilities that have commenced construction by December 31, 2032, and substantially lowers the minimum annual capture requirements to 12,500 tons for qualifying facilities. In addition, the potential credit rate is increased five times for industrial facilities and power plants that capture their carbon emissions to $85 per metric ton of carbon oxide stored in secure geologic formations, $60 per ton for the beneficial utilization of captured carbon emissions, and $60 per ton for carbon oxide stored in oil and gas fields. Prevailing wage and apprenticeship requirements must be met by the facility to claim the full amount of the higher credit. On August 29, 2023, the Treasury issued proposed regulations providing guidance on when and how to satisfy the prevailing wage and apprenticeship requirements. Comments are due to the Treasury by October 29, 2023, with final regulations coming thereafter. In addition, projects will now be eligible to be directly paid for the credit by the Internal Revenue Service for the first five years with no direct pay for many projects for the final seven years of the credit, and, as an alternative to direct pay, projects will now be allowed to sell their credits to unrelated third parties for cash without adverse tax consequences. This direct pay and credit transfer feature is another area where the Treasury provided guidance in June 2023 through proposed and temporary regulations.\nThe Act also creates a new Clean Fuel Production Tax Credit under Section 45Z for the production of low-emissions transportation fuel produced and sold in 2025, 2026 and 2027, subject to certain requirements as to prevailing wage and apprenticeship. Except as to certain tax-exempt entities, this credit is not eligible for direct pay but may be sold or otherwise transferred in most circumstances. Note that the Act provides that the Clean Fuel Production Tax Credit is not available for a facility that qualifies for the Section 45Q tax credit. Additional incentives for production of sustainable aviation fuel and $500 million in funding for biofuels infrastructure funding are also included in the Act.\nEffect of Governmental Regulation\nThe government's regulation of the environment changes constantly. We are subject to extensive air, water and other environmental regulations and we have been required to obtain a number of environmental permits to construct and operate the plant. It is possible that more stringent federal or state environmental rules or regulations could be adopted, which could increase our operating costs and expenses. It also is possible that federal or state environmental rules or regulations could be adopted that could have an adverse effect on the use of ethanol. For example, changes in the environmental regulations regarding the required oxygen content of automobile emissions could have an adverse effect on the ethanol industry. Plant operations are governed by the Occupational Safety and Health Administration (OSHA). OSHA regulations may change\nsuch that the costs of operating the plant may increase. Any of these regulatory factors may result in higher costs or other adverse conditions affecting our operations, cash flows and financial performance.\nIn late 2009, California passed a Low Carbon Fuels Standard (\"LCFS\"). The California LCFS requires that renewable fuels used in California must accomplish certain reductions in greenhouse gases which is measured using a lifecycle analysis, similar to the RFS. On December 29, 2011, a federal district court in California ruled that the California LCFS was unconstitutional which halted implementation of the California LCFS. However, the California Air Resources Board (\"CARB\") appealed this court ruling and on September 18, 2013, the federal appellate court reversed the federal district court finding the LCFS constitutional and remanding the case back to federal district court to determine whether the LCFS imposes a burden on interstate commerce that is excessive in light of the local benefits. On June 30, 2014, the United States Supreme Court declined to hear the appeal of the federal appellate court ruling and CARB recently re-adopted the LCFS with some slight modifications. The LCFS could have a negative impact on demand for corn-based ethanol and result in decreased ethanol prices affecting our ability to operate profitably.\nWe have obtained all of the necessary permits to operate the plant. In the fiscal year ended September 30, 2023, we incurred costs and expenses of approximately $233,000 complying with environmental laws. Although we have been successful in obtaining all of the permits currently required, any retroactive change in environmental regulations, either at the federal or state level, could require us to obtain additional or new permits or spend considerable resources in complying with such regulations.\nWe are subject to regulation by many governmental agencies, both federal and state. The chart below refers to some of the most important agencies and the areas of regulation.\nAgency Area of Regulation\nU.S. Environmental Protection Agency Environmental Discharge and Renewable Volume Obligations\nIndiana Department of Environmental Management Air Permit and Environmental Discharge\nAlcohol and Tobacco Tax and Trade Bureau Regulation of Alcohol Fuel and Distilled Spirits Permit\nFederal Railroad Administration Shipments Via Rail of Hazardous Material\nU.S. Department of Agriculture Food Safety Modernization Act\nIndiana Department of Agriculture Grain Procurement\nU.S. Occupational Safety and Health Administration Workplace Safety\nU.S. Department of Labor Wage and Hour\nU.S. Immigration and Customs Enforcement Employment Eligibilty of Alien Workers\nU.S. Securities Exchange Commission Public Reporting of Financial Related Information\nU.S. Internal Revenue Service Tax Policy\nCommodities Futures Trading Commission Dodd-Frank and Commodities Trading\nIf any of these agencies find us in violation of any regulation, we could incur significant penalties and other economic disadvantages, including loss of permission to operate.\nCompetition\nEthanol\nWe are in direct competition with numerous ethanol producers, several of whom have greater resources than we do. Following the significant growth during 2005 and 2006, the ethanol industry has grown at a much slower pace. The ethanol industry was impacted by the pandemic in fiscal year 2020, which resulted in decreased demand. The ethanol industry rebounded in 2021. The Renewable Fuels Association estimates that there are approximately 204 ethanol production facilities in the United States with capacity to produce approximately 17.8 billion gallons of ethanol.\nSince ethanol is a commodity product, competition in the industry is predominantly based on price. We have also experienced increased competition from oil companies who have purchased ethanol production facilities. These oil companies are required to blend a certain amount of ethanol each year. Therefore, the oil companies may be able to operate their ethanol production facilities at times when it is unprofitable for us to operate. Larger ethanol producers may be able to realize\neconomies of scale that we are unable to realize. This could put us at a competitive disadvantage to other ethanol producers. The ethanol industry is continuing to consolidate where a few larger ethanol producers are increasing their production capacities and are controlling a larger portion of the United States ethanol production. Further, some ethanol producers own multiple ethanol plants which may allow them to compete more effectively by providing them flexibility to run certain production facilities while they have other facilities shut down. This added flexibility may allow these ethanol producers to compete more effectively, especially during periods when operation margins are unfavorable in the ethanol industry.\nFollowing the acquisition of several plants by POET Biorefining from Flint Hills Resources in 2021, the largest ethanol producers now include Archer Daniels Midland, Green Plains Renewable Energy, POET Biorefining and Valero Renewable Fuels, each of which are capable of producing significantly more ethanol than we produce.\nThe following table identifies the majority of the largest ethanol producers in the United States along with their production capacities.\nU.S. FUEL ETHANOL PRODUCTION CAPACITY\nBY TOP PRODUCERS\nProducers of Approximately 750\nmillion gallons per year (mmgy) or more\nCompany Approximate Current Capacity\n(mmgy)\nPOET Biorefining 3,005\nValero Renewable Fuels 1,625\nArcher Daniels Midland 1,613\nGreen Plains Renewable Energy 958\nThe ethanol industry in the United States experienced increased competition from ethanol produced outside of the United States during 2012 which was likely the result of the expiration of the tariff on imported ethanol which expired on December 31, 2011. Although ethanol imports have since decreased, if competition from ethanol imports were to increase again that could negatively impact demand for ethanol produced in the United States which could result in lower operating margins.\nOur ethanol plant also competes with producers of other gasoline additives having similar octane and oxygenate values as ethanol. Alternative fuels, gasoline oxygenates and alternative ethanol production methods are also continually under development. The major oil companies have significantly greater resources than we have to market other additives, to develop alternative products, and to influence legislation and public perception of ethanol. These companies also have sufficient resources to begin production of ethanol should they choose to do so.\nA number of automotive, industrial and power generation manufacturers are developing alternative clean power systems using fuel cells, plug-in hybrids, electric cars or clean burning gaseous fuels. Electric car technology has recently grown in popularity, especially in urban areas. While in the past there were a limited number of vehicle recharging stations, making electric cars not feasible for all consumers, there has been an increased focus on developing these recharging stations which have made electric car technology more widely available. This additional competition from alternate sources could reduce the demand for ethanol, which would negatively impact our profitability.\nDistillers Grains\nEthanol plants in the Midwest produce the majority of distillers grains and primarily compete with other ethanol producers in the production and sales of distillers grains.\nThe primary consumers of distillers grains are dairy and beef cattle. In recent years, an increasing amount of distillers grains have been used in the swine and poultry markets. Numerous feeding trials show advantages in milk production, growth, rumen health, and palatability over other dairy cattle feeds. With the advancement of research into the feeding rations of poultry and swine, we expect these markets to expand and create additional demand for distillers grains; however, no assurance can be given that these markets will in fact expand, or if they do, that we will benefit from it. The market for distillers grains is generally confined to locations where freight costs allow it to be competitively priced against other feed ingredients. Distillers grains compete with three other feed formulations: soybean meal, corn gluten feed, dry brewers grain and mill feeds. The\nprimary value of these products as animal feed is their protein content. Soybean meal, dry brewers grain and distillers grains have about the same protein content, and corn gluten feed and mill feeds have slightly lower protein contents.\nSources and Availability of Raw Materials\nThe major raw material required for our ethanol plant to produce ethanol, distillers grain and corn oil is corn. To produce 135 million gallons of ethanol per year, our ethanol plant needs approximately 47 million bushels of corn per year, or approximately 129,000 bushels per day, as the feedstock for its dry milling process. Traditionally, corn grown in the area of the plant site has been fed locally to livestock or exported for feeding or processing and/or overseas export sales.\nThe price at which we purchase corn will depend on prevailing market prices. We are significantly dependent on the availability and price of corn. The price and availability of corn are subject to significant fluctuations depending upon a number of factors affecting grain commodity prices in general, including crop conditions, weather, governmental programs and foreign purchases. Because the market price of ethanol is not directly related to grain prices, ethanol producers are generally not able to compensate for increases in the cost of grain feedstock through adjustments in prices charged for their ethanol. We therefore anticipate that our plant's profitability will be negatively impacted during periods of high grain prices.\nIn an attempt to minimize the effects of the volatility of corn costs on operating profits, we take hedging positions in corn futures markets. Hedging means protecting the price at which we buy corn and the price at which we will sell our products in the future. It is a way to attempt to reduce the risk caused by price fluctuation. The effectiveness of hedging activities is dependent upon, among other things, the cost of corn and our ability to sell sufficient amounts of ethanol and distillers grains to utilize all of the corn subject to the futures contracts. Hedging activities can result in costs to us because price movements in grain contracts are highly volatile and are influenced by many factors beyond our control. These costs may be significant.\nHigh corn prices have a negative effect on our operating margins unless the price of ethanol and distillers grains out paces rising corn prices. Corn prices were lower during the fiscal year ended September 30, 2023, compared to the same period in 2022. Global economic uncertainty, market disruptions and increased volatility in commodity prices due to the Russian invasion of Ukraine contributed to higher corn prices towards the beginning of our 2023 fiscal year. However, corn prices fell towards the end of the period due primarily to favorable growing conditions for the corn crop for fall of 2023. On October 12, 2023, the USDA released a report estimating the 2023 corn crop in the United States at approximately 15.1 billion bushels, up 10% from last year's production, with yields averaging 173 bushels per acre. The USDA forecasted area harvested for grain at 87.1 million acres, up 10% from 2022. The Indiana corn crop is estimated to be approximately 1.1 billion bushels, up approximately 17% from 2022. Yields in Indiana are expected to be approximately 197 bushels per acre, up approximately 4% from 2022. Management will continue to monitor the availability of corn in our area.\nUtilities\nWe engaged Capstone Energy Services, LLC (\"Capstone\") to provide us with on-going energy management services. Capstone manages the procurement and delivery of energy to our location. They assist with strategy development, cost analysis, risk management, supply management and reporting services in exchange for a monthly fee. The agreement commenced on June 1, 2015, and continues for one year unless earlier terminated due to an event of default. Following the expiration of the initial one-year term, the agreement will be on a month-to-month basis and may be terminated by either party upon sixty days prior written notice.\nNatural Gas\nNatural gas is also an important input commodity to our manufacturing process. Our natural gas usage for our fiscal year ended September 30, 2023 was 1.0% less MMBTUs than for last fiscal year, constituting 3.3% of our total costs of goods sold. We are using natural gas to produce process steam and to dry our distillers grain products to a moisture content at which they can be stored for long periods of time, and can be transported greater distances, so that we can market the product to broader livestock markets, including poultry and swine markets in the continental United States.\nOn March 20, 2007, we entered into a Long-Term Transportation Service Contract for Redelivery of Natural Gas with Ohio Valley Gas Corporation (\"Ohio Valley\"). Under the contract, Ohio Valley receives, transports and redelivers natural gas to us for all of our natural gas requirements up to a maximum of 100,000 therms per purchase gas day and our estimated annual natural gas requirements of 34,000,000 therms. For all gas delivered to us by Ohio Valley, we pay a throughput rate in the amount of $0.0138 per therm for the first five years of the contract term, and $0.0138 increased by the compounded inflation rate as established and determined by the U.S. Consumer Price Index - All Urban Consumers for Transportation for the following five years. In addition, we pay a service charge for all gas delivered to us by Ohio Valley in the amount of $750 per\ndelivery meter per billing cycle per month for the first five years of the contract term and $750 increased by the compounded inflation rate over the initial rate as established and determined by the U.S. Consumer Price Index - All Urban Consumers for Transportation for the following five years. The initial term of the contract was ten years. Provided neither party terminates the contract, the contract will automatically renew for a series of not more than three consecutive one year periods.\nElectricity\nWe require a significant amount of electrical power to operate the plant. On May 2, 2007, we entered into an agreement with Indiana Michigan Power Company to furnish our electric energy. The initial term of the contract was 30 months from the time service is commenced and continues thereafter unless terminated by either party with 12 months written notice. We pay Indiana Michigan Power Company monthly pursuant to their standard rates.\nWater\nWe require a significant supply of water. Engineering specifications show our plant's water requirements to be approximately 774 gallons per minute, 1.1 million gallons per day, depending on the quality of water. We have assessed our water needs and available supply and have determined that we have an adequate supply. Union City Water Works is supplying the water necessary to operate our plant.\nRecycling water back into the process minimizes discharge water. This will have the long-term effect of lowering wastewater treatment costs. Our plant design incorporates the ICM/Phoenix Bio-Methanator wastewater treatment process resulting in a zero discharge of plant process water. There are, however, certain areas of production where fresh water is needed.\nPatents, Trademarks, Licenses, Franchises and Concessions\nWe do not currently hold any patents, trademarks, franchises or concessions. We were granted a license by ICM, Inc. to use certain ethanol production technology necessary to operate our ethanol plant. The cost of the license granted by ICM, Inc. was included in the amount we paid to Fagen, Inc. to design and build our ethanol plant. In addition, we were granted a license by ICM, Inc. to use certain corn oil technologies necessary to extract corn oil during our plant operations. We have also engaged ICM, Inc. to install a system to produce high protein feed and expect to license from ICM the technology to use, operate and maintain the system once the project is complete.\nSeasonality of Ethanol Sales\nWe experience some seasonality of demand for ethanol. Since ethanol is predominantly blended with conventional gasoline for use in automobiles, ethanol demand tends to shift in relation to gasoline demand. As a result, we experience some seasonality of demand for ethanol in the summer months related to increased driving. In addition, we experience some increased ethanol demand during holiday seasons related to increased gasoline demand.\nDependence on One or a Few Major Customers\nAs discussed above, we have entered into a marketing agreement with Murex for the purpose of marketing and distributing our ethanol and have engaged CHS, Inc. for the purpose of marketing and distributing our distillers grains. We rely on Murex for the sale and distribution of our ethanol and CHS, Inc. for the sale and distribution of our distillers grains. Therefore, although there are other marketers in the industry, we are highly dependent on Murex and CHS, Inc. for the successful marketing of our products. Any loss of Murex or CHS, Inc. as our marketing agent for our ethanol and distillers grains, respectively, could have a significant negative impact on our revenues.\nTrading Division\nWe procure, transport and sell grain commodities through our Trading Division, which began operations at the end of our fourth fiscal quarter of 2017.\nPrincipal Products\nWe have and expect to continue to buy primarily soybeans and corn from producers relying principally on forward purchase contracts to ensure an adequate supply of grain. However, we occasionally also purchase grain the day of delivery.\nGrain prices are typically comprised of futures prices on the Chicago Mercantile Exchange (\"CME\") and local basis adjustments.\nGrain Markets and Distribution Methods\nGrain shipments are made by rail and truck. Our sales are made to grain processors and export markets in the southeastern United States. Our grain sales are generally made by contract for delivery in a future period. Income is expected to be earned on grain bought and sold, the appreciation or depreciation in the basis value of the grain held and the appreciation or depreciation between the futures contract months.\nCompetition\nWe primarily compete in the purchase of grain on a local or regional basis although there are some larger national and international companies that maintain regional grain purchase and storage facilities. We compete in the sale of grain with other public and private grain brokers, elevator operators and farmer owned cooperatives. Competition is based primarily on price, service and reliability.\nSeasonality of Grain Purchases and Sales\nOur grain operations are somewhat seasonal in nature in that the grain we procure is harvested in October and November. The largest portion of the grain is delivered by producers in the fall although we buy and sell a significant portion of our grain throughout the year.\nRisk Management\nWe manage the futures price risk of changing commodity prices by entering into exchange-traded futures contracts on the CME. The CME is a regulated commodity futures exchange that maintains futures markets for the grain we trade. Futures prices are determined by worldwide supply and demand.\nWe entered into a Risk Management Agreement with John Stewart & Associates (\"JS&A\") under which JS&A provides risk management and related services pertaining to grain hedging, grain pricing information, aid in purchase of grain, and assistance in risk management as it pertains to ethanol, co-products and soybeans. In exchange for JS&A's risk management services, we pay JS&A a fee of $1,500 per month. We are currently on a month-to-month basis for this contract with JS&A. The agreement may be terminated by either party at any time upon written notice.\nWe also entered into an agreement with Advance Trading to assist us with hedging corn, ethanol, natural gas and soybeans. We pay them a fee of $3,000 per month for these services. The term of the agreement is month-to-month and may be terminated by either party at any time upon proper notice.\nWe also entered into an agreement with Commodity & Ingredient Hedging, LLC to evaluate and provide marketing advice and margin management related to cash sales and purchases, forward contracts and exchange-traded futures and options. We pay an annual fee of $12,000 in exchange for these services. The agreement automatically renews for additional one year terms unless either party gives written notice of non-renewal as provided in the agreement.\nEmployees\nWe have 72 full-time employees as of November 30, 2023. We employ individuals in the local region around our one facility. Many of our employees require some technical or professional background and we compete for them via wages and benefits. We attract them from schools and colleges within our region, which are numerous. There are several other ethanol plants within a fifty mile radius of our facility. Individuals with ethanol specific skills are available to us because of this proximity. However, this competition for resources also presents a challenge in retaining those with specialized skills.\nWorking Capital\nWe primarily use our working capital for purchases of raw materials necessary to operate the Ethanol Division and for purchases of grain commodities for the Trading Division. Our primary sources of working capital is cash we generate from our operations along with our Declining Loan and our Revolving Credit Loan with our primary lender First National Bank of Omaha. The Declining Loan provides $39,000,000 in total for us to use on capital projects allowing us to preserve our working capital at a sufficient level. We have engaged ICM, Inc. to install a system to produce high protein feed which is currently\nexpected to cost approximately $50,000,000, including recent change orders, and be funded from operations and borrowings from the Declining Loan. We have also engaged with an unrelated third party to pursue the CCS Project. As of September 30, 2023, our wholly owned subsidiary, Cardinal One Carbon Holdings, LLC, has invested $6,075,000 into the CCS Project. It is currently expected that the CCS Project will require Cardinal One Carbon Holdings, LLC to invest up to $18,000,000 to reach commercial operations. However, the CCS Project is subject to many variables that could have a material effect on its feasibility and our ability to construct and complete the CCS Project.\nAt September 30, 2023, we have approximately $20,000,000 available to draw on the Revolving Credit Loan to provide working capital. We will discuss the Declining Loan and Revolving Credit Loan in more detail in \"Item 7 - Management's Discussion and Analysis of Financial Condition and Results of Operations\". ITEM 1A. RISK FACTORS\nYou should carefully read and consider the risks and uncertainties below and the other information contained in this report. The risks and uncertainties described below are not the only ones we may face. The following risks, together with additional risks and uncertainties not currently known to us or that we currently deem immaterial could impair our financial condition and results of operation.\nRisks Relating to Our Business\nOur existing debt financing agreements contain, and our future debt financing agreements may contain, restrictive covenants that limit distributions and impose restrictions on the operation of our business. The use of debt financing makes it more difficult for us to operate because we must make principal and interest payments on the indebtedness and abide by covenants contained in our debt financing agreements. Although we have significantly reduced our level of debt, the restrictive covenants contained in our financing agreements may have important implications on our operations, including, among other things: (a) limiting our ability to obtain additional debt or equity financing; (b) subjecting all or substantially all of our assets to liens; and (c) limiting our ability to make business and operational decisions regarding our business, including, among other things making capital improvements and selling or purchasing assets or engaging in transactions we deem to be appropriate and in our best interest.\nFailures of our information technology infrastructure could have a material adverse effect on operations. We utilize various software applications and other information technology that are critically important to our business operations. We rely on information technology networks and systems, including the Internet, to process, transmit and store electronic and financial information, to manage a variety of business processes and activities, including production, manufacturing, financial, logistics, sales, marketing and administrative functions. We depend on our information technology infrastructure to communicate internally and externally with employees, customers, suppliers and others. We also use information technology networks and systems to comply with regulatory, legal and tax requirements. These information technology systems, some of which are managed by third parties, may be susceptible to damage, disruptions or shutdowns due to failures during the process of upgrading or replacing software, databases or components thereof, power outages, hardware failures, computer viruses, attacks by computer hackers or other cybersecurity risks, telecommunication failures, user errors, natural disasters, terrorist attacks or other catastrophic events. If any of our significant information technology systems suffer severe damage, disruption or shutdown, and our disaster recovery and business continuity plans do not effectively resolve the issues in a timely manner, our product sales, financial condition and results of operations may be materially and adversely affected.\nA cyber attack or other information security breach could have a material adverse effect on our operations and result in financial losses. We are regularly the target of attempted cyber and other security threats and must continuously monitor and develop our information technology networks and infrastructure to prevent, detect, address and mitigate the risk of unauthorized access, misuse, computer viruses and other events that could have a security impact. If we are unable to prevent cyber attacks and other information security breaches, we may encounter significant disruptions in our operations which could adversely impact our business, financial condition and results of operations or result in the unauthorized disclosure of confidential information. Such breaches may also harm our reputation, result in financial losses or subject us to litigation or other costs or penalties.\nWe may violate the terms of our credit agreements and financial covenants which could result in our lender demanding immediate repayment of our loans. We were in compliance with all financial covenants at September 30, 2023. Current management projections indicate that we will be in compliance with our loan covenants through September 30, 2023. However, unforeseen circumstances may develop which could result in violations of our loan covenants. If we violate the terms of our credit agreement, our primary lender could deem us in default of our loans and require us to immediately repay any outstanding balance of our loans.\nOur inability to maintain or secure credit facilities we may require in the future may negatively impact our liquidity. While we do not currently require more financing than we have, in the future we may need additional financing. If we require financing in the future and we are unable to secure such financing, or we are unable to secure the financing we require on reasonable terms, it may have a negative impact on our liquidity. This could negatively impact the value of our units.\nWe depend on our management and key employees, and the loss of these relationships could negatively impact our ability to operate profitably. We are highly dependent on our management team to operate our ethanol plant. We may not be able to replace these individuals should they decide to cease their employment with us, or if they become unavailable for any other reason. While we seek to compensate our management and key employees in a manner that will encourage them to continue their employment with us, they may choose to seek other employment. Any loss of these officers and key employees may prevent us from operating the ethanol plant profitably and could decrease the value of our units.\nWe are subject to global and regional economic downturns, inflation, rising interest rates and related risks. Our business is affected by global and regional demographic and macroeconomic conditions. A significant downturn in global economic growth, or recessionary conditions in major geographic regions for prolonged periods, may lead to a variety of adverse consequences for our business including reduced demand for our products, increases in our corn and natural gas costs and rising interest rates on our variable rate loans. These and other adverse consequences could result in our inability to operate profitably and reduce our earnings.\nThe invasion of Ukraine by Russia and resulting sanctions by the United States, European Union and other countries have contributed to inflation, market disruptions and increased volatility in commodity prices in the United States and a slowdown in global economic growth. On February 24, 2022, a full-scale military invasion of Ukraine by Russian troops was reported. In response to the attacks on Ukraine, sanctions and other penalties have been levied by the United States, European Union and other countries and additional sanctions and penalties have been proposed. The invasion by Russia and resulting sanctions have had a broad range of adverse impacts on global business and financial markets some of which have had and may continue to have adverse impacts on our business. These include increased inflation, significant market disruptions and increased volatility in commodity prices such as corn, oil and natural gas. Although the duration and extent of the ongoing military conflict is highly unpredictable and the magnitude of the potential economic impact is currently unknown, Russian military actions and resulting sanctions could have a negative effect on our financial condition and operating results.\nRisks Related to our Trading Division\nOur Trading Division business is affected by the supply and demand of commodities, and is sensitive to factors outside of our control. Adverse price movements could negatively affect our profitability and results of operations. Our Trading Division buys, sells and holds inventories of agricultural commodities, some of which are readily traded on commodity futures exchanges. Unfavorable weather conditions, both local and worldwide, as well as other factors beyond our control, can affect the supply and demand of these commodities and expose us to liquidity pressures to finance hedges in the grain business in rapidly rising markets. Increased costs of inventory and prices of raw material would decrease our profit margins and adversely affect our results of operations. While we attempt to manage the risk associated with commodity price changes for our grain inventory positions with derivative instruments, including purchase and sale contracts, we are unable to offset 100% of the price risk of each transaction due to timing, availability of futures and options contracts and third-party credit risk. Furthermore, there is a risk that the derivatives we employ will not be effective in offsetting all of the risks that we are trying to manage. This can happen when the derivative and the underlying value of grain inventories and purchase and sale contracts are not perfectly matched. Our grain derivatives, for example, do not perfectly correlate with the basis component of our grain inventory and contracts. (Basis is defined as the difference between the local cash price of a commodity and the corresponding exchange-traded futures price.) Differences can reflect time periods, locations or product forms. Although the basis component is smaller and generally less volatile than the futures component of our grain market price, basis moves on a large grain position can significantly impact the profitability of the Trading Division. Our futures, options and over-the-counter contracts are subject to margin calls. If there are large movements in the commodities market, we could be required to post significant levels of margin, which would impact our liquidity. There is no assurance that the efforts we have taken to mitigate the impact of the volatility of the prices of commodities upon which we rely will be successful and any sudden change in the price of these commodities could have an adverse effect on our business and results of operations.\nWe face intense competition in our Trading Division. We face significant competition in our Trading Division and we have numerous competitors, some of which are larger and have greater financial resources than we have. Competition could cause us to lose market share and talented employees, exit certain lines of business, increase marketing or other expenditures or reduce pricing, each of which could have an adverse effect on our business and profitability.\nOur Trading Division uses derivative contracts to reduce volatility in the commodity markets. Non-performance by the counter-parties to those contracts could adversely affect our future results of operations and financial position. A significant amount of our commodity purchases and sales are done through forward contracting. In addition, we use exchange traded and to a lesser degree over-the-counter contracts to reduce volatility in changing commodity prices. A significant adverse change in commodity prices could cause a counter-party to one or more of our derivative contracts to not perform on their obligation.\nIf a substantial portion of our inventory becomes damaged or obsolete, its value would decrease and our profit margins would suffer. We may carry significant amounts of inventory in our Trading Division. The value of our inventories could decrease due to deterioration in the quality of our grain inventory due to damage, moisture, insects, disease or foreign material. If the quality of our grain were to deteriorate below an acceptable level, the value of our inventory could decrease significantly.\nRisks Related to our Ethanol Division\nDeclines in the price of ethanol or distillers grain would significantly reduce our revenues. The sales prices of ethanol and distillers grains can be volatile as a result of a number of factors such as overall supply and demand, the price of gasoline and corn, levels of government support, and the availability and price of competing products. We are dependent on a favorable spread between the price we receive for our ethanol and distillers grains and the price we pay for corn and natural gas. Any lowering of ethanol and distillers grains prices, especially if it is associated with increases in corn and natural gas prices, may affect our ability to operate profitably. We anticipate the price of ethanol and distillers grains to continue to be volatile in our 2024 fiscal year as a result of the net effect of changes in the price of gasoline and corn and increased ethanol supply offset by increased export demand. In addition, growing conditions in a particular seasons harvest may cause the corn crop to be of poor quality resulting in corn shortages and a decrease in distillers grains prices. Declines in the prices we receive for our ethanol and distillers grains will lead to decreased revenues and may result in our inability to operate the ethanol plant profitably for an extended period of time which could decrease the value of our units.\nIncreases in the price of corn or natural gas would reduce our profitability. Our primary source of revenue is from the sale of ethanol, distillers grains and corn oil. Our results of operations and financial condition are significantly affected by the cost and supply of corn and natural gas. Changes in the price and supply of corn and natural gas are subject to and determined by market forces over which we have no control including weather and general economic factors.\nEthanol production requires substantial amounts of corn. Generally, higher corn prices will produce lower profit margins and, therefore, negatively affect our financial performance. If a period of high corn prices were to be sustained for some time, such pricing may reduce our ability to operate profitably because of the higher cost of operating our plant. We may not be able to offset any increase in the price of corn by increasing the price of our products. If we cannot offset increases in the price of corn, our financial performance may be negatively affected.\nThe prices for and availability of natural gas are subject to volatile market conditions. These market conditions often are affected by factors beyond our control such as higher prices as a result of colder than average weather conditions or natural disasters, overall economic conditions and foreign and domestic governmental regulations and relations. Significant disruptions in the supply of natural gas could impair our ability to manufacture ethanol and more significantly, distillers grains for our customers. Furthermore, increases in natural gas prices or changes in our natural gas costs relative to natural gas costs paid by competitors may adversely affect our results of operations and financial condition. We seek to minimize the risks from fluctuations in the prices of corn and natural gas through the use of hedging instruments. However, these hedging transactions also involve risks to our business. See Risks Relating to Our Business - We engage in hedging transactions which involve risks that could harm our business. If we were to experience relatively higher corn and natural gas costs compared to the selling prices of our products for an extended period of time, the value of our units may be reduced.\nWe engage in hedging transactions which involve risks that could harm our business. We are exposed to market risk from changes in commodity prices. Exposure to commodity price risk results from our dependence on corn and natural gas in the ethanol production process along with ethanol sales prices. We seek to minimize the risks from fluctuations in the prices of corn, natural gas and ethanol through the use of hedging instruments. The effectiveness of our hedging strategies is dependent on the price of corn, natural gas and ethanol and our ability to sell sufficient products to use all of the corn and natural gas for which we have futures contracts. Our hedging activities may not successfully reduce the risk caused by price fluctuation which may leave us vulnerable to high corn and natural gas prices. Alternatively, we may choose not to engage in hedging transactions in the future and our operations and financial conditions may be adversely affected during periods in which corn and/or natural gas prices increase. Utilizing cash for margin calls has an impact on the cash we have available for our operations which could result in liquidity problems during times when corn prices rise or fall significantly.\nPrice movements in corn, natural gas and ethanol contracts are highly volatile and are influenced by many factors that are beyond our control. There are several variables that could affect the extent to which our derivative instruments are impacted by price fluctuations in the cost of corn, natural gas and ethanol. However, it is likely that commodity cash prices will have the greatest impact on the derivatives instruments with delivery dates nearest the current cash price. We may incur such costs and they may be significant which could impact our ability to profitably operate the plant and may reduce the value of our units.\nOur Ethanol Division is not diversified. While we do procure, transport and sell grain commodities through our Trading Division, our success depends largely on our ability to profitably operate our ethanol plant. We do not have other significant sources of revenue if we are unable to operate our ethanol plant and manufacture ethanol, distillers grains, corn oil and carbon dioxide or if economic or political factors adversely affect the market for ethanol, distillers grains, corn oil or carbon dioxide. Our business would also be significantly harmed if the ethanol plant could not operate at full capacity for any extended period of time.\nThe ethanol industry is an industry that is changing rapidly which can result in unexpected developments that could negatively impact our operations and the value of our units. The ethanol industry has grown significantly in the last decade. This rapid growth has resulted in significant shifts in supply and demand of ethanol over a very short period of time. As a result, past performance by the ethanol plant or the ethanol industry generally might not be indicative of future performance. We may experience a rapid shift in the economic conditions in the ethanol industry which may make it difficult to operate the ethanol plant profitably. If changes occur in the ethanol industry that make it difficult for us to operate the ethanol plant profitably, it could result in a reduction in the value of our units.\nChanges and advances in ethanol production technology could require us to incur costs to update our plant or could otherwise hinder our ability to compete in the ethanol industry or operate profitably. Advances and changes in the technology of ethanol production are expected to occur. Such advances and changes may make the ethanol production technology installed in our plant less desirable or obsolete. These advances could also allow our competitors to produce ethanol at a lower cost than we are able. If we are unable to adopt or incorporate technological advances, our ethanol production methods and processes could be less efficient than our competitors, which could cause our plant to become noncompetitive or completely obsolete. If our competitors develop, obtain or license technology that is superior to ours or that makes our technology obsolete, we may be required to incur significant costs to enhance or acquire new technology so that our ethanol production remains competitive. Alternatively, we may be required to seek third-party licenses, which could also result in significant expenditures. These third-party licenses may not be available or, once obtained, they may not continue to be available on commercially reasonable terms. These costs could negatively impact our financial performance by increasing our operating costs and reducing our net income.\nDecreasing gasoline prices could negatively impact our ability to operate profitably. Discretionary blending is an important secondary market which is often determined by the price of ethanol versus the price of gasoline. In periods when discretionary blending is financially unattractive, the demand for ethanol may be reduced. Lower gasoline prices reduce the spread between the price of gasoline and the price of ethanol which can discourage discretionary blending, dampen the export market and result in a downwards market adjustment in the price of ethanol. If oil and gasoline prices were to decrease for a significant period of time, it could hurt our ability to profitably operate the ethanol plant which could decrease the value of our units.\nDemand for ethanol may not grow unless ethanol can be blended into gasoline in higher percentage blends for conventional automobiles. Currently, ethanol is blended with conventional gasoline for use in standard (non-flex fuel) vehicles to create a blend which is 10% ethanol and 90% conventional gasoline. In order to expand demand for ethanol, higher percentage blends of ethanol must be utilized in conventional automobiles. Such higher percentage blends of ethanol have become a contentious issue with automobile manufacturers and environmental groups having fought against higher percentage ethanol blends. E15 is a blend which is 15% ethanol and 85% conventional gasoline. Although there have been significant developments towards the availability of E15 in the marketplace, there are still obstacles that could inhibit meaningful market penetration by E15.\nTechnology advances in the commercialization of cellulosic ethanol may decrease demand for corn based ethanol which may negatively affect our profitability. The Energy Independence and Security Act of 2007 and the 2008 Farm Bill offer a very strong incentive to develop commercial scale cellulosic ethanol. If an efficient method of producing ethanol from cellulose-based biomass is developed, we may not be able to compete effectively. If we are unable to produce ethanol as cost-effectively as cellulose-based producers, our ability to generate revenue and our financial condition will be negatively impacted.\nDecreasing ethanol prices could reduce our ability to operate profitably. Decreases in the price of ethanol reduce our revenue. Our profitability depends on a favorable spread between our corn and natural gas costs and the price we receive for\nour ethanol. If ethanol prices fall during times when corn and/or natural gas prices are high, we may not be able to operate our ethanol plant profitably.\nIf a substantial portion of our corn inventory becomes damaged or obsolete, its value would decrease and our profit margins would suffer. We may carry significant amounts of corn inventory in our Ethanol Division. The value of our inventories could decrease due to deterioration in the quality of our inventory due to damage, moisture, insects, disease or foreign material. If the quality of our corn inventory were to deteriorate below an acceptable level, the value of our inventory could decrease significantly.\nWe operate in an intensely competitive industry and compete with larger, better financed entities which could impact our ability to operate profitably. There is significant competition among ethanol producers. There are numerous producer-owned and privately-owned ethanol plants planned and operating throughout the Midwest and elsewhere in the United States. In addition, we have seen increased competition from oil companies who have purchased ethanol production facilities. We also face competition from outside of the United States. The largest ethanol producers include Archer Daniels Midland, Green Plains Renewable Energy, POET Biorefining and Valero Renewable Fuels, each of which is capable of producing significantly more ethanol than we produce. Further, many believe that there will be further consolidation occurring in the ethanol industry in the future which will likely lead to a few companies which control a significant portion of the ethanol production market. We may not be able to compete with these larger entities. These larger ethanol producers may be able to affect the ethanol market in ways that are not beneficial to us which could affect our financial performance.\nCompetition from the advancement of alternative fuels may lessen the demand for ethanol. Alternative fuels, gasoline oxygenates and ethanol production methods are continually under development. Like ethanol, these emerging technologies offer an option to address worldwide energy costs, the long-term availability of petroleum reserves and environmental concerns. If these alternative technologies continue to expand and gain broad acceptance and become readily available to consumers for motor vehicle use, we may not be able to compete effectively. This additional competition could reduce the demand for ethanol, resulting in lower ethanol prices that might adversely affect our results of operations and financial condition.\nIncreased use of fuel cells, plug-in hybrids and electric cars may lessen the demand for ethanol. Automotive, industrial and power generation manufacturers have developed alternative clean power systems using fuel cells, plug-in hybrids, electric cars or clean burning gaseous fuels. Electric car technology has recently grown in popularity, especially in urban areas, which has led to an increase in recharging stations which has made electric car technology more widely available. This additional competition from alternate sources could reduce the demand for ethanol, resulting in lower ethanol prices which could negatively impact our results of operations and financial condition.\nConsumer resistance to the use of ethanol based on the belief that ethanol is expensive, uses too much corn, adds to air pollution, harms engines and/or takes more energy to produce than it contributes may affect the demand for ethanol. Certain individuals believe that the use of ethanol will have a negative impact on gasoline prices at the pump and that ethanol uses too much of the available corn supply. Many also believe that ethanol adds to air pollution and harms car and truck engines. Still other consumers believe that the process of producing ethanol actually uses more fossil energy, such as oil and natural gas, than the amount of energy that is produced. These consumer beliefs could potentially be wide-spread and may be increasing as a result of recent efforts to increase the allowable percentage of ethanol that may be blended for use in conventional automobiles. If consumers choose not to buy ethanol based on these beliefs, it would affect the demand for the ethanol we produce which could negatively affect our profitability and financial condition.\nRisks Related to Regulation and Governmental Action\nGovernment incentives for ethanol production may be eliminated in the future, which could hinder our ability to operate at a profit. The ethanol industry is assisted by various federal ethanol production and tax incentives, including the RFS set forth in the Energy Policy Act of 2005. The RFS helps support a market for ethanol that might disappear without this incentive. The United States Environmental Protection Agency (\"EPA\") has the authority to set the statutory volume requirement. In addition, in the past the EPA expanded its use of waivers to small refineries allowing those refineries to avoid their ethanol use requirements under the RFS resulting in decreased ethanol demand. If the EPA were to significantly reduce the volume requirements under the RFS or if the RFS were to be otherwise reduced or eliminated by the exercise of the EPA authority or by Congress, the market price and demand for ethanol could decrease which will negatively impact our financial performance.\nGovernment policies and regulations, particularly those affecting the agricultural sector and related industries, could adversely affect our operations and profitability. Agricultural commodity production and trade flows are significantly\naffected by government policies and regulations. Governmental policies affecting the agricultural industry, such as taxes, tariffs, duties, subsidies, import and export restrictions on agricultural commodities and commodity products can influence industry profitability, the planting of certain crops versus other uses of agricultural resources, the location and size of crop production, whether unprocessed or processed commodity products are traded and the volume and types of imports and exports. In addition, international trade disputes can adversely affect agricultural commodity trade flows by limiting or disrupting trade between countries or regions. Future governmental policies, regulations or actions affecting our industry may adversely affect the supply of, demand for and prices of our products, restrict our ability to do business and cause our financial results to suffer.\nReductions in distillers grains exports to China have a negative effect on the price of distillers grains in the U.S. and could negatively affect our profitability. China was the world's largest buyer of distillers grains produced in the United States. On January 12, 2016, the Chinese government began an anti-dumping and countervailing duty investigation related to distillers grains imported from the United States which contributed to a decline in distillers grains shipped to China. China began imposing anti-dumping and anti-subsidy duties during 2016 as a result of a preliminary ruling on its investigation. On January 10, 2017, China announced a final ruling related to its anti-dumping and countervailing duty investigation imposing anti-dumping duties from a range of 42.2% to 53.7% and anti-subsidy duties from 11.2% to 12.0%. The imposition of these duties has resulted in a significant decline in demand from this top importer and negatively impacted prices for distillers grains produced in the United States. This reduction in demand could negatively impact our ability to profitably operate the ethanol plant.\nReductions in ethanol exports to China due to the imposition of a tariff on U.S. ethanol have a negative impact on ethanol prices. China imposed a tariff on ethanol which is produced in the United States and exported to China which has negatively impacted exports of ethanol to China. The decrease could negatively impact the market price of ethanol in the United States and our ability to profitably operate the ethanol plant.\nReductions in ethanol exports to Brazil due to the imposition by the Brazilian government of a tariff on U.S. ethanol have a negative impact on ethanol prices. Brazil was historically a top destination for ethanol produced in the United States. However, Brazil imposed a tariff on ethanol which is produced in the United States and exported to Brazil. The tariff has resulted in a decline in demand for ethanol from Brazil and could negatively impact the market price of ethanol in the United States and our ability to profitably operate the ethanol plant. The tariff was temporarily suspended in March 2022 through the end of the year following a 10% reduction in the tariff in November of 2021. However, the tariff was reinstituted earlier this year.\nChanges in environmental regulations or violations of these regulations could be expensive and reduce our profitability. We are subject to extensive air, water and other environmental laws and regulations. In addition, some of these laws require our plant to operate under a number of environmental permits. These laws, regulations and permits can often require expensive pollution control equipment or operational changes to limit actual or potential impacts to the environment. A violation of these laws and regulations or permit conditions can result in substantial fines, damages, criminal sanctions, permit revocations and/or plant shutdowns. In the future, we may be subject to legal actions brought by environmental advocacy groups and other parties for actual or alleged violations of environmental laws or our permits. Additionally, any changes in environmental laws and regulations, both at the federal and state level, could require us to spend considerable resources in order to comply with future environmental regulations. The expense of compliance could be significant enough to reduce our profitability and negatively affect our financial condition.\nThe California Low Carbon Fuel Standard may decrease demand for corn based ethanol which could negatively impact our profitability. California passed a Low Carbon Fuels Standard (\"LCFS\") which requires that renewable fuels used in California must accomplish certain reductions in greenhouse gases which reductions are measured using a lifecycle analysis. Management believes that these regulations could preclude corn based ethanol produced in the Midwest from being used in California. California represents a significant ethanol demand market. If the ethanol industry is unable to supply corn based ethanol to California, it could significantly reduce demand for the ethanol we produce. This could result in a reduction of our revenues and could negatively impact our ability to profitably operate the ethanol plant.  ITEM 2. PROPERTIES\nOur plant site is made up of two adjacent parcels which together total approximately 295 acres in east central Indiana near Union City, Indiana. The address of our plant is 1554 N. County Road 600 E., Union City, Indiana 47390. On October 31, 2016, we purchased approximately 64 acres of land adjacent to our property for a total purchase price of approximately $646,000.\nIn November 2008, the plant was substantially completed and plant operations commenced. The plant consists of the following buildings:\nA grains area, fermentation area, distillation - evaporation area;\nA dryer/energy center area;\nA tank farm;\nAn auxiliary area; and\nAn administration building.\nOur plant is in excellent condition and is capable of functioning at over 100% of its 100 million gallons per year nameplate production capacity.\nIn September 2017, we completed a construction project to add grain receiving and train loading facilities and additional rail spurs, track and grain storage to allow us to procure, transport and sell grain commodities.\nAll of our tangible and intangible property, real and personal, serves as the collateral for the debt financing with First National Bank of Omaha, which is described below under \"Item 7 - Management's Discussion and Analysis of Financial Condition and Results of Operations.\" ITEM 3. LEGAL PROCEEDINGS\nNone. ITEM 4. MINE SAFETY DISCLOSURES\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED MEMBER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket for Our Units\nAs of November 30, 2023, we had approximately 14,606 membership units outstanding and approximately 1,036 unit holders of record. There is no public trading market for our units. However, we have established through FNC Ag Stock, LLC a Unit Trading Bulletin Board, a private online matching service, in order to facilitate trading among our members. The Unit Trading Bulletin Board has been designed to comply with federal tax laws and IRS regulations establishing an alternative trading service, as well as state and federal securities laws. Our Unit Trading Bulletin Board consists of an electronic bulletin board that provides a list of interested buyers with a list of interested sellers, along with their non-firm price quotes. The Unit Trading Bulletin Board facilitates matches between potential sellers and buyers and assists the sellers and buyers with transfers. We do not become involved in any purchase or sale negotiations arising from our Unit Trading Bulletin Board and have no role in effecting the transactions beyond approval, as required under our operating agreement, and the issuance of new certificates. We do not give advice regarding the merits or shortcomings of any particular transaction. We do not receive, transfer or hold funds or securities as an incident of operating the Unit Trading Bulletin Board. We do not receive any compensation for creating or maintaining the Unit Trading Bulletin Board. In advertising our alternative trading service, we do not characterize Cardinal as being a broker or dealer or an exchange. We do not use the Unit Trading Bulletin Board to offer to buy or sell securities other than in compliance with the securities laws, including any applicable registration requirements.\nThere are detailed timelines that must be followed under the Unit Trading Bulletin Board Rules and Procedures with respect to offers and sales of membership units. All transactions must comply with the Unit Trading Bulletin Board Rules, our operating agreement, and are subject to approval by our board of directors.\nAs a limited liability company, we are required to restrict the transfers of our membership units in order to preserve our partnership tax status. Our membership units may not be traded on any established securities market or readily traded on a secondary market (or the substantial equivalent thereof). All transfers are subject to a determination that the transfer will not cause the Company to be deemed a publicly traded partnership.\nThe following table contains historical information by fiscal quarter for the past two fiscal years regarding the actual unit transactions that were completed by our unit-holders during the periods specified. We believe this most accurately represents the current trading value of the Company's units. The information was compiled by reviewing the completed unit transfers that occurred on our qualified matching service bulletin board during the quarters indicated.\nSelling Quarter Low Price High Price Average Price # of\nUnits Traded\n2022 1st\n$ 8,750 $ 10,360 $ 9,691 40\n2022 2nd\n$ 10,000 $ 13,950 $ 11,934 56\n2022 3rd\n$ 11,665 $ 12,500 $ 12,085 19\n2022 4th\n$ 12,000 $ 15,500 $ 13,862 45\n2023 1st\n$ 15,000 $ 15,450 $ 15,279 77\n2023 2nd\n$ 15,400 $ 17,500 $ 15,879 48\n2023 3rd\n$ 15,400 $ 16,400 $ 16,181 68\n2023 4th\n$ 16,400 $ 18,000 $ 16,855 100\nThe following table contains the bid and asked prices that were posted on the Company's alternative trading service bulletin board and includes some transactions that were not completed. The Company believes the table above more accurately describes the trading value of its units as the bid and asked prices below include some offers that never resulted in completed transactions. The information was compiled by reviewing postings that were made on the Company's alternative trading service bulletin board.\nListing Quarter Low Price High Price Average Price # of\nUnits Listed\n2022 1st\n$ 12,000 $ 18,500 $ 12,250 8\n2022 2nd\n$ 18,500 $ 18,500 $ 18,500 4\n2022 3rd\n$ - $ - $ - -\n2022 4th\n$ 15,450 $ 21,000 $ 16,444 172\n2023 1st\n$ 15,150 $ 15,150 $ 15,150 4\n2023 2nd\n$ 15,225 $ 17,500 $ 16,552 12\n2023 3rd\n$ 22,500 $ 22,500 $ 22,500 20\n2023 4th\n$ 18,000 $ 22,000 $ 20,400 15\nDistributions\nOur board of directors has complete discretion over the timing and amount of distributions to our members. Our expectations with respect to our ability to make future distributions are discussed in greater detail in \"Item 7 - Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\nPerformance Graph\nThe following graph shows a comparison of cumulative total member return since September 30, 2017, calculated on a dividend reinvested basis, for the Company, the NASDAQ Composite Index (the Composite) and the NASDAQ Clean Edge Green Energy Index (the \"CELS\"). The graph assumes $100 was invested in each of our units, the Composite and the CELS on September 30, 2018. Data points on the graph are annual. Note that historic unit price performance is not necessarily indicative of future unit price performance.\nPursuant to the rules and regulations of the Securities and Exchange Commission, the performance graph and the information set forth therein shall not be deemed to be filed for purposes of Section 18 of the Securities Exchange Act of 1934, and shall not be deemed to be incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing. ITEM 6. [RESERVED] ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nWe produce ethanol, distillers grains and corn oil at our plant located near Union City, Indiana. In addition, we procure, transport and sell grain commodities.\nResults of Operations for the Fiscal Years Ended September 30, 2023 and 2022\nThe following table shows the results of our operations and the percentage of revenues, cost of goods sold, operating expenses and other items to total revenues in our statement of operations for the fiscal years ended September 30, 2023 and 2022:\n2023 2022\nStatement of Operations Data Amount % Amount %\nRevenues $ 502,734,878 100.0 $ 546,691,371 100.0\nCost of Goods Sold 427,014,319 84.9 460,306,891 84.2\nGross Profit 75,720,559 15.1 86,384,480 15.8\nOperating Expenses 9,053,455 1.8 8,083,150 1.5\nOperating Income 66,667,104 13.3 78,301,330 14.3\nOther Income (Expense), net 3,151,487 0.6 7,402,534 1.4\nNet Income $ 69,818,591 13.9 $ 85,703,864 15.7\nRevenues\nWe have two reportable segments-the Ethanol Division and the Trading Division. Our revenues from operations from our Ethanol Division come from three primary sources: sales of fuel ethanol, distillers grains and corn oil. Revenues from operations of our Trading Division are derived from procuring, transporting and selling grain commodities. Revenues in each division also include net gains or losses from derivatives related to products sold.\nThe following table shows the sources of our total revenue from the two segments and the approximate percentage of revenues to total revenues in our consolidated statements of operations for the fiscal years ended September 30, 2023 and 2022:\n2023 2022\nRevenue: Amount % of Total Revenues Amount % of Total Revenues\nEthanol division $ 425,556,965 84.6 % $ 451,720,815 82.6 %\nTrading division 77,177,913 15.4 94,970,556 17.4\nTotal Revenue $ 502,734,878 100.0 % $ 546,691,371 100.0 %\nEthanol Division\nThe following table shows the sources of our ethanol division revenue for the fiscal years ended September 30, 2023 and 2022:\n2023 2022\nRevenue Source Amount % of Revenues Amount % of Revenues\nEthanol Sales $ 330,330,829 77.6 % $ 359,726,018 79.6 %\nDistillers Grains Sales 65,062,188 15.3 63,798,998 14.2\nCorn Oil Sales 29,456,495 6.9 27,656,525 6.1\nCarbon Dioxide Sales 434,261 0.1 473,449 0.1\nOther Revenue 273,192 0.1 65,825 -\nTotal Revenues $ 425,556,965 100.0 % $ 451,720,815 100.0 %\nEthanol\nOur revenues from ethanol decreased for our fiscal year ended September 30, 2023, as compared to our fiscal year ended September 30, 2022. This decrease in revenues is primarily the result of a lower average price per gallon of ethanol sold offset by an increase in gallons of ethanol sold for the fiscal year ended September 30, 2023, as compared to the same period in 2022. Revenue also includes the net gains or losses from derivatives related to the commodities purchased.\nOur average price per gallon of ethanol sold for the fiscal year ended September 30, 2023, was 8.4% lower than our average price per gallon of ethanol sold for the same period in 2022. Ethanol market prices have overall been lower due to a decrease in energy prices, including crude oil and gasoline prices, for the current period compared to the same period in 2022. In addition, an increase in industry-wide ethanol production levels due to positive operating margins and corn availability contributed to decreased ethanol market prices for the current period. Ethanol prices are also typically directionally consistent with the price of corn meaning that lower corn prices can lead to volatility and have a significant negative effect on ethanol prices.\nManagement believes that ethanol prices will continue to be influenced by corn and energy prices, shipping disruptions, inventory levels, and inflationary factors. If corn and oil prices further decrease that would likely contribute to lower ethanol prices and our profitability. Industry over-production due to positive operating margins could also continue to have a negative effect on ethanol prices unless foreign or domestic demand reduce inventory levels.\nWe experienced an increase in ethanol gallons sold of 0.2% for the fiscal year ended September 30, 2023, as compared to the same period in 2022 resulting primarily from increased ethanol production rates. We are currently operating at a rate of approximately 138 million gallons annually. We have installed an ethanol recovery system which we expect will result in an increase in efficiencies allowing us to achieve higher ethanol production rates going forward. However, we expect this will likely be offset by temporary shutdowns of our plant from time to time during our 2024 fiscal year in connection with the\ninstallation of our high protein feed system. We also expect that there will be a period of time of up to three months before our ethanol production will return to historic levels once the installation of our high protein feed system is complete. This overall reduction in gallons of ethanol produced during the fiscal year ended September 30, 2024 as compared to the same period in 2023 could be significant. In addition, management continues to monitor economic conditions carefully. If market conditions worsen affecting our ability to profitably operate the plant, we may be forced to reduce our ethanol production rate or even temporarily shut down ethanol production altogether.\nDistillers Grains\nOur revenues from distillers grains increased in the fiscal year ended September 30, 2023, as compared to the same period in 2022. This increase in revenues is primarily the result of an increase in the average price per ton of distillers grains sold for the period ended September 30, 2023, as compared to the same period in 2022.\nThe average market price per ton of distillers grains sold for the fiscal year ended September 30, 2023, increased by 1.8% compared to the average price per ton of distillers grains sold for the same period in 2022. This increase in the market price of distillers grains is primarily due to higher overall corn and soybean meal prices for the current period which resulted in end users seeking out distillers grains as the lower cost alternative. In addition, vomitoxin levels in some distillers grains produced by some plants in our region reduced supply and allowed us to receive a premium on our distillers grains. Distillers grains ground from corn contaminated with vomitoxin can sicken livestock. However, the market price of distillers grains was lower towards the end of the period due primarily to lower corn and soybean meal prices as well as a seasonal decrease in the ration of distillers grains in livestock feed.\nManagement anticipates that distillers grains prices will continue to be affected by the price of corn and soybean meal. We also typically experience some seasonal decline in prices during warmer months as cattle feeders turn more to grazing their herds. Trade disputes with foreign countries, such as China, will continue to have a negative effect on distillers grains prices unless additional demand can be sustained from domestic or other foreign markets.\nWe sold 0.2% more tons of distillers grains in the fiscal year ended September 30, 2023, as compared to the same period in 2022 due to higher distillers grains production rates during the fiscal year. This was offset by a slightly lower yield for the period. An increase or decrease in ethanol production rates in the future would result in a corresponding change in distillers grains production. We expect our distillers grains production to eventually be replaced with a high protein feed product once the installation of our high protein feed system is complete and we have ramped up production of high protein feed.\nCorn Oil\nOur revenues from corn oil sales increased by 6.5% in the fiscal year ended September 30, 2023, as compared to the same period in 2022 which was mainly the result of an increase in the average price per pound of corn oil sold for the fiscal year ended September 30, 2023, as compared to the same period in 2022. The average price per pound of corn oil sold for the fiscal year ended September 30, 2023, increased by 1.5% as compared to the same period in 2022. Overall, higher soybean oil prices along with increased biodiesel production had a positive effect on corn oil prices for the period. However, corn oil prices were lower towards the end of the period due to decreased soybean oil prices. Soybean oil is the primary competitor with distillers corn oil. However, the supply of used cooking oil has also become more prevalent and may compete with distillers corn oil in the market.\nManagement anticipates that corn oil prices will continue to follow soybean oil prices. Corn oil prices are also likely to be negatively affected by an industry changes in corn oil supply due to improved operating conditions. The extension of the biodiesel tax credit by Congress is likely to continue to have a positive impact on demand from biodiesel producers and corn oil prices. However, an increase in the supply of used cooking oil could have a negative effect on corn oil prices.\nWe experienced an increase of 4.4% in pounds of corn oil sold during the fiscal year ended September 30, 2023, as compared to the same period in 2022 due to a higher corn oil yield on production for the period coupled with increased ethanol production. An increase or decrease in ethanol production rates in the future would result in a corresponding change in corn oil production. We also expect that there will be a period of time of up to three months before our corn oil production will return to historic levels once the installation of our high protein feed system is complete. This reduction in corn oil produced during the fiscal year ended September 30, 2024 as compared to the same period in 2023 could be significant.\nTrading Division\nThe following table shows the sources of our revenues from our Trading Division for the fiscal year ended September 30, 2023 and 2022:\n2023 2022\nRevenue Source Amount % of Revenues Amount % of Revenues\nSoybean Sales $ 77,177,913 100.0 % $ 94,854,225 99.9 %\nOther Revenue - - 116,331 0.1\nTotal Revenues $ 77,177,913 100.0 % $ 94,970,556 100.0 %\nSoybeans\nDuring the fiscal year ended September 30, 2023, revenues from our Trading Division were derived primarily from transporting and selling soybeans. Our revenues from soybean sales decreased for the fiscal year ended September 30, 2023, as a result of a decrease in bushels of soybeans sold of 18.2% during the fiscal year ended September 30, 2023, as compared to the same period in 2022. The decrease in bushels of soybeans sold is primarily due to less conducive market conditions for selling for the fiscal year ended September 30, 2023.\nWe also experienced a decrease of 0.3% in the average price per bushel of soybeans sold for the fiscal year ended September 30, 2023, as compared to the same period in 2022 primarily due to an adequate national supply of soybeans resulting in slightly lower soybean prices. The average price per bushel of soybeans sold was $14.89 based on sales of approximately 5,167,000 bushels for the fiscal year ended September 30, 2023.\nCost of Goods Sold\nEthanol Division\nOur cost of goods sold for this division as a percentage of its total revenues was 82.7% for the fiscal year ended September 30, 2023, as compared to 81.7% for the same period in 2022. This increase in cost of goods sold as a percentage of revenues was the result of an improved relationship between the prices of ethanol and corn, offset by decreased natural gas costs for the fiscal year ended September 30, 2023, as compared to the same period in 2022. Our two largest costs of production are corn and natural gas. Cost of goods sold also includes net gains or losses from derivatives related to commodities purchased as well as our additional expense for our estimate of our rail car rehabilitation expense described below.\nCorn\nOur largest cost associated with the production of ethanol, distillers grains and corn oil is corn cost. During the fiscal year ended September 30, 2023, the bushels of corn we used to produce our ethanol, distillers grains and corn oil was nearly the same compared to the same period in 2022 due to slightly higher ethanol production levels coupled with decreased efficiencies for the fiscal year ended September 30, 2023, compared to the same period in 2022.\nDuring the fiscal year ended September 30, 2023, our average price paid per bushel of corn decreased 4.1% as compared to the same period in 2022. Global economic uncertainty, market disruptions and increased volatility in commodity prices due to the Russian invasion of Ukraine contributed to higher corn prices towards the beginning of our 2023 fiscal year. However, corn prices fell towards the end of the period due primarily to favorable growing conditions for the corn crop for fall of 2023.\nWeather, world supply and demand, current and anticipated stocks, agricultural policy and other factors can contribute to volatility in corn prices. Higher corn prices and increased volatility would have a negative effect on our operating margins unless the price of ethanol and distillers grains out paces rising corn prices. Volatility in the price of corn could significantly impact our cost of goods sold.\nNatural Gas\nOur natural gas cost was lower during our fiscal year ended September 30, 2023, as compared to the fiscal year ended September 30, 2022. This decrease in the cost of natural gas for the fiscal year ended September 30, 2023, as compared to the same period in 2022 was primarily the result of a decrease of 34.1% in the average price per MMBTU of natural gas due to a\nmild winter season, a decrease in the price of crude oil, and decreased volatility in prices. We also used 1.0% less MMBTUs of natural gas for the fiscal year ended September 30, 2023, as compared to the same period in 2022 which was primarily due to increased efficiencies.\nManagement expects that natural gas prices will be dependent upon government policy and the severity of the winter weather. If the nation were to experience a recession this could also influence natural gas prices. In addition, natural gas supply shortages due to a catastrophic weather event could have a negative effect on natural gas prices.\nRail Car Rehabilitation Costs\nWe lease 180 hopper rail cars under a multi-year agreement which ends in November 2023. We have executed a renewal to continue to lease 179 hopper cars under a multi-year agreement effective December 2023 through November 2028. Under the agreement, we are required to pay to rehabilitate each car for \"damage\" that is considered to be other than normal wear and tear upon turn in of each car at the termination of the lease. We have evaluated the condition of the cars and believe that it is probable that we may be assessed for damages incurred. Management has estimated total costs to rehabilitate the cars at September 30, 2023, to be approximately $2,358,000. During the year ended September 30, 2023, we have recorded an expense in cost of goods of approximately $360,000. We accrue the estimated cost per railcar damages over the term of the lease. The accrued liability for these rehabilitation costs is approximately $2,358,000 at September 30, 2023.\nTrading Division\nThe following table shows the costs incurred to procure various agricultural commodities for our Trading Division for the fiscal year ended September 30, 2023 and 2022:\n2023 2022\nAmount % of Revenues Amount % of Revenues\nSoybeans $ 74,918,828 97.1 % $ 91,224,755 96.1 %\nTotal Cost of Goods Sold $ 74,918,828 97.1 % $ 91,224,755 96.1 %\nSoybeans\nDuring the fiscal year ended September 30, 2023, our cost was primarily the procurement of soybeans sold. During the fiscal year ended September 30, 2023, our average price paid per bushel of soybeans was 2.7% more as compared to the same period in 2022 due to concerns over a smaller carryout of soybean inventory from the 2022 harvest and an increase in exports towards the end of the current period. We also purchased 28.7% less bushels of soybeans during the fiscal year ended September 30, 2023, as compared to the same period in 2022 due to a cash price that was not conducive to producer selling.\nDerivatives\nWe enter into hedging instruments to minimize price fluctuations in the prices of our finished products and inputs. As the current market price of our hedge positions changes, the realized or unrealized gains and losses are immediately recognized in our revenues and our cost of goods sold. These commodity-based derivatives are not designated as effective hedges for accounting purposes. Please refer to \" ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to the impact of market fluctuations associated with interest rates and commodity prices as discussed below. We have no exposure to foreign currency risk as all of our business is conducted in U.S. Dollars. We use derivative financial instruments as part of an overall strategy to manage market risk. We use cash, futures and option contracts to hedge changes to the commodity prices of corn and natural gas. We do not enter into these derivative financial instruments for trading or speculative purposes, nor do we designate these contracts as hedges for accounting purposes.\nInterest Rate Risk\nWe are exposed to market risk from changes in interest rates. Exposure to interest rate risk results primarily from our Declining Loan and Revolving Credit Loan which bear variable interest rates. We had borrowings outstanding of approximately $30,569,000 on the Declining Loan at September 30, 2023 and the applicable interest rate was 8.45% at September 30, 2023. We had no borrowings on the Revolving Credit Loan at September 30, 2023 and the applicable interest rate was 8.25% at September 30, 2023. The specifics of the Declining Loan and the Revolving Credit Loan are discussed in greater detail above. If we were to experience a 10% adverse change in the applicable interest rate, the annual effect such change would have on our statement of operations, based on the amount we had outstanding on our variable interest rate loans at September 30, 2023, would be approximately $260,000.\nCommodity Price Risk\nWe expect to be exposed to market risk from changes in commodity prices. Exposure to commodity price risk results from our dependence on corn in the ethanol production process and the sale of ethanol.\nWe seek to minimize the risks from fluctuations in the prices of raw material inputs, such as corn and natural gas, and finished products, such as ethanol and distillers grains, through the use of hedging instruments. In practice, as markets move, we actively manage our risk and adjust hedging strategies as appropriate. Although we believe our hedge positions accomplish an economic hedge against our future purchases and sales, management has chosen not to use hedge accounting, which would match the gain or loss on our hedge positions to the specific commodity purchase being hedged. We are using fair value accounting for our hedge positions, which means as the current market price of our hedge positions changes, the realized or unrealized gains and losses are immediately recognized in our cost of goods sold or as an offset to revenues. The immediate recognition of hedging gains and losses can cause net income to be volatile from quarter to quarter due to the timing of the change in value of the derivative instruments relative to the cost and use of the commodity being hedged.\nWe enter into forward contracts for our commodity purchases and sales on a regular basis. It is our intent that, as we enter in to these contracts, we will use various hedging instruments to maintain a near even market position. For example, if we have 1 million bushels of corn under fixed price contracts we would generally expect to enter into a short hedge position to offset our price risk relative to those bushels we have under fixed price contracts. Because our ethanol marketing company is selling substantially all of the gallons it markets on a spot basis we also include the corn bushel equivalent of the ethanol we have produced that is inventory but not yet priced as bushels that need to be hedged.\nAt September 30, 2023, we had a net short position of 45,360,000 gallons of ethanol under derivative contracts used to hedge our future ethanol sales for various delivery periods through September 2024, a net short (selling) position of 1,395,001 bushels of corn under derivative contracts used to hedge our forward corn contracts, corn inventory and ethanol sales for various delivery periods through December 2024. At September 30, 2023 we had a net long (buying) position of 1,263,012 mmbtus of natural gas under derivatives contracts used to hedge our forward natural gas contracts for various delivery periods through April 2024. At September 30, 2023, we had a net long (buying) position of 600,000 pounds of soybean oil under derivative contracts used to hedge our future corn oil sales for various delivery periods through December 2023. At September 30, 2023, we had a net short (selling) position of 530,000 bushels of soybeans under derivative contracts used to hedge its forward soybean purchase contracts for various periods through January 2025 that it had entered into for its new Trading Division. These derivatives have not been designated as an effective hedge for accounting purposes. There may be offsetting positions that are not shown on a net basis that could lower the notional amount of positions outstanding as disclosed above. At September 30, 2023, we also had entered into certain forward purchase contracts for soybeans at fixed prices for which we elected to account for as derivatives. The following table provides details regarding the gains and (losses) from our derivative instruments in the statements of operations, none of which are designated as hedging instruments for the fiscal years ended September 30, 2023, 2022 and 2021:\nFiscal Year Ended Fiscal Year Ended Fiscal Year Ended\nSeptember 30, 2023 September 30, 2022 September 30, 2021\nCorn Derivative Contracts $ 12,891,994 $ (4,677,214) $ (18,881,451)\nEthanol Derivative Contracts 6,873,197 (6,192,448) 1,392,605\nNatural Gas Derivative Contracts (2,569,990) (39,039) (836)\nSoybean Oil Derivative Contracts 44,610 179,637 1,813,519\nSoybean Derivative Contracts (869,262) (3,883,992) (6,518,841)\nSoybean Forward Purchase and Sales Contracts Derivatives (122,959) (621,040) (894,717)\nTotals $ 16,247,590 $ (15,234,096) $ (23,089,721)\nAt September 30, 2023, we had forward corn purchase contracts at various fixed prices for various delivery periods through December 2024 for 7.5% of our expected production needs for the next 15 months. At September 30, 2023, we also had forward dried distiller grains sales contracts at various fixed prices for various delivery periods through December 2023 for 24.8% of expected production for the next 3 months and forward corn oil contracts at various prices for various delivery periods through October 2023 for 48.2% of expected production for the next month. Also, at September 30, 2023, we had forward natural gas contracts for 46.9% of expected purchases for the next 13 months at various prices for various delivery periods through October 2024. We had no forward ethanol sales contracts at fixed prices as of September 30, 2023.\nWe began operating our Trading Division in late September 2017. In preparation for beginning those operations, we entered into forward purchases contracts for soybeans. At September 30, 2023, the Company had soybean forward purchase and sales contracts at various fixed prices for various delivery periods through January 2025 for 6.3% of its anticipated trading volume of that commodity for the next 16 months.\nAs contracts are delivered, any gains or losses realized will be recognized in our gross margin. Due to the volatility and risk involved in the commodities market, we cannot be certain that these gains or losses will be realized.\nAs corn prices move in reaction to market trends and information, our income statement will be affected depending on the impact such market movements have on the value of our derivative instruments. Depending on market movements, crop prospects and weather, these price protection positions may cause immediate adverse effects, but are expected to produce long-term positive growth for us.\nA sensitivity analysis has been prepared to estimate our exposure to ethanol, distillers grains, corn oil, corn, natural gas and soybeans price risk. Market risk related to these factors is estimated as the potential change in income resulting from a hypothetical 10% adverse change in the average cost of our corn and natural gas and average ethanol, distillers grains, corn oil and soybeans prices as of September 30, 2023 net of the forward and future contracts used to hedge our market risk. The volumes are based on our expected use, purchase and sale of these commodities for a one year period from September 30, 2023. The results of this analysis, which may differ from actual results, are approximately as follows:\nEstimated Volume Requirements for the next 12 months (net of forward and futures contracts) Unit of Measure Hypothetical Adverse Change in Price as of\nSeptember 30, 2023 Approximate Adverse Change to Income\nNatural Gas 1,773,000 MMBTU 10 % $ 519,000\nEthanol 138,000,000 Gallons 10 % $ 29,946,000\nCorn 42,496,000 Bushels 10 % $ 20,260,000\nDDGs 304,000 Tons 10 % $ 5,315,000\nCorn Oil 42,180,000 Pounds 10 % $ 2,657,000\nSoybeans - Purchase 4,586,000 Bushels 10 % $ 5,595,000\nSoybeans - Sale 4,806,000 Bushels 10 % $ 5,935,000\nFor comparison purposes, the results of our sensitivity analysis as of September 30, 2022, were approximately as follows:\nEstimated Volume Requirements for the next 12 months (net of forward and futures contracts) Unit of Measure Hypothetical Adverse Change in Price as of\nSeptember 30, 2022 Approximate Adverse Change to Income\nNatural Gas 1,778,000 MMBTU 10 % $ 1,203,000\nEthanol 138,000,000 Gallons 10 % $ 34,299,000\nCorn 40,784,000 Bushels 10 % $ 27,652,000\nDDGs 307,000 Tons 10 % $ 6,745,000\nCorn Oil 40,176,000 Pounds 10 % $ 2,812,000\nSoybeans - Purchase 4,234,000 Bushels 10 % $ 5,652,000\nSoybeans - Sale 5,000,000 Bushels 10 % $ 6,824,000\nLiability Risk\nWe participate in a captive reinsurance company (the Captive). The Captive reinsures losses related to worker's compensation, commercial property and general liability. Premiums are accrued by a charge to income for the period to which the premium relates and is remitted by our insurer to the captive reinsurer. The Captive reinsures catastrophic losses in excess of a predetermined amount. Our premiums are structured such that we have made a prepaid collateral deposit estimated for losses related to the above coverage. The Captive insurer has estimated and collected an amount in excess of the estimated losses but less than the catastrophic loss limit insured by the Captive. We cannot be assessed in excess of the amount in the collateral fund. ITEM 8. CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nMembers of Cardinal Ethanol, LLC and Subsidiaries\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Cardinal Ethanol, LLC and Subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of operations and comprehensive income, changes in members equity, and cash flows for each of the years in the three-year period ended September 30, 2023, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the years in the three-year period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgements. We determined that there were no critical audit matters.\n/s/ Boulay PLLP\nWe have served as the Company's auditor since 2005.\nMinneapolis, Minnesota\nNovember 30, 2023\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nConsolidated Balance Sheets\nASSETS September 30, 2023 September 30, 2022\nCurrent Assets\nCash and cash equivalents $ 69,859,066 $ 53,937,943\nRestricted cash 13,425,343 9,301,671\nTrade accounts receivable 18,407,126 12,511,601\nInvestments in available-for-sale debt securities\n12,407,939 -\nMiscellaneous receivables 478,069 1,114,588\nInventories 15,103,440 23,370,767\nPrepaid and other current assets 298,635 464,498\nFutures and options derivatives 352,464 972,041\nForward purchase/sales derivatives 66,825 360,620\nTotal current assets 130,398,907 102,033,729\nProperty, Plant, and Equipment\nLand and land improvements 22,522,222 22,522,222\nPlant and equipment 162,403,592 160,156,395\nBuilding 8,913,364 8,913,364\nOffice equipment 961,001 948,749\nVehicles 31,928 31,928\nConstruction in process 42,798,504 19,624,102\n237,630,611 212,196,760\nLess accumulated depreciation (145,307,052) (133,739,702)\nProperty, Plant, and Equipment, Net 92,323,559 78,457,058\nOther Assets\nOperating lease right of use asset, net 3,012,582 6,808,992\nInvestments 7,033,199 1,656,049\nTotal other assets 10,045,781 8,465,041\nTotal Assets $ 232,768,247 $ 188,955,828\nNotes to Consolidated Financial Statements are an integral part of this Statement.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nConsolidated Balance Sheets\nLIABILITIES AND MEMBERS' EQUITY September 30, 2023 September 30, 2022\nCurrent Liabilities\nAccounts payable $ 3,171,886 $ 4,426,732\nAccounts payable - grain 11,005,387 12,335,894\nAccrued expenses 4,695,515 3,897,364\nDue to broker 1,232,522 -\nFutures and options derivatives 3,817,921 2,669,433\nForward purchase/sales derivatives 356,177 507,408\nOperating lease liability current 2,611,799 3,594,335\nCurrent maturities of long-term debt 1,136,681 -\nTotal current liabilities 28,027,888 27,431,166\nLong-Term Liabilities\nLong-term debt, net of current maturities 29,432,277 9,000,000\nOperating lease long-term liabilities 416,931 3,217,532\nLiability for railcar rehabilitation costs 2,358,134 2,036,638\nTotal long-term liabilities 32,207,342 14,254,170\nCommitments and Contingencies\nMembers Equity\nMembers' contributions, net of cost of raising capital, 14,606 units authorized, issued and outstanding\n70,912,213 70,912,213\nAccumulated other comprehensive loss (10,671) -\nRetained earnings 101,631,475 76,358,279\nTotal members' equity 172,533,017 147,270,492\nTotal Liabilities and Members Equity $ 232,768,247 $ 188,955,828\nNotes to Consolidated Financial Statements are an integral part of this Statement.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nConsolidated Statements of Operations and Comprehensive Income\nFiscal Year Ended Fiscal Year Ended Fiscal Year Ended\nSeptember 30, 2023 September 30, 2022 September 30, 2021\nRevenues $ 502,734,878 $ 546,691,371 $ 404,002,166\nCost of Goods Sold 427,014,319 460,306,891 369,373,828\nGross Profit 75,720,559 86,384,480 34,628,338\nOperating Expenses 9,053,455 8,083,150 7,179,061\nOperating Income 66,667,104 78,301,330 27,449,277\nOther Income (Expense)\nInterest income 2,541,382 6,152 -\nInterest expense - (36,560) (133,619)\nMiscellaneous income (expense) 1,030,219 7,436,663 (205,780)\nLoss on equity method investment\n(420,114) (3,721) -\nTotal $ 3,151,487 $ 7,402,534 $ (339,399)\nNet Income\n$ 69,818,591 $ 85,703,864 27,109,878\nWeighted Average Units Outstanding - basic and diluted 14,606 14,606 14,606\nNet Income Per Unit - basic and diluted $ 4,780 $ 5,868 $ 1,856\nDistributions Per Unit $ 2,750 $ 4,325 $ 775\nUnrealized loss on available-for-sale debt securities\n(10,671) - -\nTotal comprehensive loss\n(10,671)\n- -\nNet Comprehensive Income $ 69,807,920 $ 85,703,864 $ 27,109,878\nNotes to Consolidated Financial Statements are an integral part of this Statement.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nConsolidated Statements of Cash Flows\nFiscal Year Ended Fiscal Year Ended Fiscal Year Ended\nSeptember 30, 2023 September 30, 2022 September 30, 2021\nCash Flows from Operating Activities\nNet income $ 69,818,591 $ 85,703,864 $ 27,109,878\nAdjustments to reconcile net income to net cash provided by operations:\nDepreciation and amortization 11,567,350 11,296,772 11,296,401\nEarnings on available-for-sale debt securities\n(530,845) - -\nEarnings on held-to-maturity debt securities\n(14,196) - -\nChange in fair value of commodity derivative instruments 1,910,629 807,345 (125,703)\nLoss on sale of equipment - - 906,785\nForgiveness of Paycheck Protection Program Loan - - (856,665)\nNon-cash dividend income (122,264) - -\nNon-cash lease expense 13,273 1,262 -\nLoss on equity method investments\n420,114 3,721 -\nChange in operating assets and liabilities:\nTrade accounts receivables (5,895,525) 874,809 (4,211,473)\nMiscellaneous receivables 636,519 (710,315) 408,787\nInventories 8,267,327 3,216,265 (9,268,332)\nPrepaid and other current assets 165,863 (252,237) (25,500)\nContract liability - - (15,000)\nAccounts payable (993,273) 560,101 (429,407)\nAccounts payable - grain (1,330,507) 393,171 6,268,938\nAccrued expenses (2,059,290) 1,798,289 791,353\nLiability for railcar rehabilitation costs 321,496 285,958 298,080\nDue to broker 1,232,522 - -\nNet cash provided by operating activities 83,407,784 103,979,005 32,148,142\nCash Flows from Investing Activities\nCapital expenditures - - -\nPayments for construction in process (27,887,983) (20,064,388) (3,846,527)\nInvestments in Cardinal One Carbon Holdings\n(5,675,000) (400,000) -\nInvestments in available-for-sale debt securities\n(28,487,765) - -\nProceeds from maturities of available-for-sale debt securities\n16,600,000 - -\nInvestments in held-to-maturity debt securities\n(585,804) - -\nProceeds from maturities of held-to-maturity debt securities\n600,000 - -\nNet cash used for investing activities (45,436,552) (20,464,388) (3,846,527)\nCash Flows from Financing Activities\nDistributions paid (42,445,395) (63,170,950) (11,319,650)\nProceeds from revolving credit loan 49,427,275 26,255,550 105,850,279\nPayments on revolving credit loan (49,427,275) (26,255,550) (105,850,279)\nProceeds from economic development fund 2,950,000 - -\nProceeds from long-term debt 21,568,958 9,000,000 1,222,417\nPayments on long-term debt - - (1,222,417)\nNet cash used for financing activities (17,926,437) (54,170,950) (11,319,650)\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nConsolidated Statements of Cash Flows\nFiscal Year Ended Fiscal Year Ended Fiscal Year Ended\nSeptember 30, 2023 September 30, 2022 September 30, 2021\nNet Increase in Cash, Cash Equivalents and Restricted Cash\n20,044,795 29,343,667 16,981,965\nCash, Cash Equivalents and Restricted Cash - Beginning of Period 63,239,614 33,895,947 16,913,982\nCash, Cash Equivalents and Restricted Cash - End of Period $ 83,284,409 $ 63,239,614 $ 33,895,947\nReconciliation of Cash, Cash Equivalents and Restricted Cash\nCash and Cash Equivalents - Balance Sheet $ 69,859,066 $ 53,937,943 $ 25,798,906\nRestricted Cash - Balance Sheet 13,425,343 9,301,671 8,097,041\nCash, Cash Equivalents and Restricted Cash $ 83,284,409 $ 63,239,614 $ 33,895,947\nSupplemental Cash Flow Information\nInterest paid $ 1,404,258 $ 4,010 $ 133,619\nSupplemental Disclosure of Non-cash Investing and Financing Activities\nConstruction in process included in accrued expenses and accounts payable $ 839,008 $ 343,140 $ 53,343\nConstruction period interest capitalized in property, plant and equipment $ 1,584,092 $ - $ -\nNotes to Consolidated Financial Statements are an integral part of this Statement.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nConsolidated Statements of Changes in Members' Equity\nMember Retained Accumulated Other Comprehensive\nContributions Earnings Income (Loss)\nTotal\nBalance - September 30, 2020 $ 70,912,213 $ 38,035,137 $ - $ 108,947,350\nNet income for year ended September 30, 2021 - 27,109,878 - 27,109,878\nMember Distributions - (11,319,650) - (11,319,650)\nBalance - September 30, 2021 $ 70,912,213 $ 53,825,365 $ - $ 124,737,578\nNet income for year ended September 30, 2022 - 85,703,864 - 85,703,864\nMember Distributions - (63,170,950) - (63,170,950)\nBalance - September 30, 2022 $ 70,912,213 $ 76,358,279 $ - $ 147,270,492\nNet income for year ended September 30, 2023 - 69,818,591 - 69,818,591\nMember Distributions - (44,545,395) - (44,545,395)\nUnrealized loss on available-for-sale debt securities\n- - (10,671) (10,671)\nBalance - September 30, 2023 $ 70,912,213 $ 101,631,475 $ (10,671) $ 172,533,017\nNotes to Consolidated Financial Statements are an integral part of this Statement.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\n1. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nNature of Business\nCardinal Ethanol, LLC and Subsidiaries (the Company) is an Indiana limited liability company currently producing fuel-grade ethanol, distillers grains, corn oil and carbon dioxide near Union City, Indiana and sells these products throughout the continental United States. During the fiscal years ended September 30, 2023, 2022 and 2021, the Company produced approximately 138,800,000, 136,700,000 and 136,100,000 gallons of ethanol, respectively.\nIn addition, the Company procures, transports, and sells grain commodities through grain operations.\nBasis of Accounting\nThe Company prepared the accompanying consolidated financial statements in conformity with accounting principles generally accepted in the United States of America (\"U.S. GAAP\"). The consolidated financial statements include the operations, assets and liabilities of the Company. In the opinion of the Company's management, the accompanying consolidated financial statements contain all adjustments, consisting of normal recurring accruals, necessary to fairly present the accompanying consolidated financial statements.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts of Cardinal Ethanol, LLC and its wholly owned subsidiaries, Cardinal Ethanol Export Sales, Inc. and Cardinal One Carbon Holdings, LLC (collectively, the Company). Cardinal Ethanol Export Sales, Inc. is an Interest Charge Domestic to International Sales Company (\"IC-DISC\") designed to take advantage of certain tax incentives for export sales to other countries. Cardinal One Carbon Holdings, LLC was formed to hold the partnership interest for the investigation and pursuit of carbon dioxide capture and sequestration. All inter-company balances and transactions have been eliminated in consolidation.\nFiscal Reporting Period\nThe Company has adopted a fiscal year ending September 30 for reporting financial operations and a year ending December 31 for tax return purposes.\nReportable Segments\nAccounting Standards Codification (ASC) 280, Segment Reporting, establishes the standards for reporting information about segments in consolidated financial statements. Operating segments are defined as components of an enterprise for which separate financial information is available that are evaluated regularly by the chief operating decision maker in deciding how to allocate resources and in assessing performance. Based on the related business nature and expected financial results criteria set forth in ASC 280, the Company has two reportable operating segments for financial reporting purposes.\nEthanol Division. Based on the nature of the products and production process and the expected financial results, the Companys operations at its ethanol plant, including the production and sale of ethanol and its co-products, are aggregated into one financial reporting segment.\nTrading Division. The Company has a grain loading facility within the Company's single site to buy, hold and sell inventories of agricultural grains, primarily soybeans. The Company performs no additional processing of these grains, unlike the corn inventory the Company holds and uses in ethanol production. The activities of buying, selling and holding of grains other than for ethanol and co-product production comprise this financial reporting segment.\nAccounting Estimates\nManagement uses estimates and assumptions in preparing these consolidated financial statements in accordance with U.S. GAAP. Those estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nassets and liabilities, and the reported revenues and expenses. The Ethanol Division uses estimates and assumptions in accounting for the following significant matters, among others: the useful life of fixed assets, valuation of inventories, the assumptions used in the analysis of the impairment of long lived assets, allowance for credit losses, railcar rehabilitation costs, and inventory purchase commitments.\nThe Trading Division uses estimates and assumptions in accounting for the following significant matters, among others: the useful lives of fixed assets, allowance for credit losses, the valuation of inventory purchase and sale commitment derivatives and inventory at market.\nActual results may differ from previously estimated amounts, and such differences may be material to the consolidated financial statements. The Company periodically reviews estimates and assumptions, and the effects of revisions are reflected in the period in which the revision is made. Actual results could differ materially from those estimates.\nCash and Cash Equivalents\nThe Company maintains its accounts primarily at three financial institutions. At times throughout the year, the Company's cash balances may exceed amounts insured by the Federal Deposit Insurance Corporation. Cash equivalents represent money market funds or short-term investments with original maturities of three months or less from the date of purchase, except for those amounts that are held in the investment portfolio for long-term investment.\nRestricted Cash\nAs a part of its commodities hedging activities, the Company is required to maintain cash balances with its commodities trading companies for initial and maintenance margins on a per futures contract basis. Changes in the market value of contracts may increase these requirements. As the futures contracts expire, the margin requirements also expire. Accordingly, the Company records the cash maintained with the traders in the margin accounts as restricted cash. Since this cash is immediately available upon request when there is a margin excess, the Company considers this restricted cash to be a current asset.\nInvestments in Available-for-Sale Debt Securities\nThe Company holds funds in short-term investments in debt securities, such as U.S. treasury bills or treasury notes. As some of the investments in debt securities have an original maturity date greater than three months, these investments are classified as available-for-sale. The Company is holding these short-term investments until maturity or for sale in the event cash is needed. Unrealized gains and losses on the Company's investments classified as available-for-sale are recognized in other comprehensive income (loss) until realized.\nInvestments in Held-to-Maturity Debt Securities\nThe Company holds funds in short-term investments in debt securities, such as U.S. treasury bills or treasury notes. Some of the investments in debt securities have an original maturity date greater than three months and are being held until maturity in the hedge accounts as collateral for initial margin requirements, these investments are classified as held-to-maturity. The Company has the ability and intent to hold until maturity and the classification was determined at the time of purchase. Held-to-maturity securities are recorded at amortized cost, adjusted for the amortization of accretion of premiums and discounts. Premiums and discounts are amortized or accreted over the life of the related held-to-maturity security using a straight-line method. At September 30, 2023, and 2022, the Company did not have any held-to-maturity investments.\nTrade Accounts Receivable\nCredit terms are extended to customers in the normal course of business. The Company performs ongoing credit evaluation of its customers' financial condition and, generally, requires no collateral. The Company maintains an allowance for credit losses for accounts receivable, which is recorded as an offset to accounts receivable, and changes in such are included as a component of operating expenses in the statements of operations. The Company assesses collectibility by reviewing accounts receivable on a collective basis where similar characteristics exist and on an individual basis when the Company identifies specific customers with known disputes or collectibility issues. In determining the amount of the allowance for credit losses, the Company\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nconsiders historical collectibility based on past due status and make judgements about the creditworthiness of customers based on ongoing credit evaluations. The Company also considers customer-specific information, current market conditions, and reasonable and supportable forecasts of future economic conditions. At September 30, 2023, and 2022, the Company determined that an allowance for credit losses was not necessary.\nInventories\nEthanol Division (see Reportable Segments) inventories consist of raw materials, work in process, finished goods and spare parts. Corn is the primary raw material. Finished goods consist of ethanol, dried distiller grains and corn oil. Inventories are stated at the lower of weighted average cost or net realizable value. Net realizable value is the estimated selling prices in the normal course of business, less reasonably predictable selling costs.\nTrading Division (see Reportable Segments) inventories consist of grain. Soybeans were the only grains held and traded at September 30, 2023 and 2022. These inventories are stated at market value less estimated selling costs, which may include reductions for quality.\nProperty, Plant and Equipment\nProperty, plant, and equipment are stated at cost. Depreciation is provided over estimated useful lives by use of the straight-line depreciation method. Maintenance and repairs are expensed as incurred; major improvements and betterments are capitalized. Construction in process expenditures will be depreciated using the straight-line method over their estimated useful lives once the assets are placed into service.\nMinimum years Maximum years\nLand improvements 15 20\nPlant and equipment 5 20\nBuilding 10 40\nOffice equipment 7 15\nVehicles 5 5\nLong-Lived Assets\nThe Company reviews its long-lived assets, such as property, plant and equipment and financing costs, subject to depreciation and amortization, for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. If circumstances require a long-lived asset be tested for possible impairment, the Company first compares undiscounted cash flows expected to be generated by an asset to the carrying value of the asset. If the carrying value of the long-lived asset is not recoverable on an undiscounted cash flow basis, impairment is recognized to the extent that the carrying value exceeds its fair value. Fair value is determined through various valuation techniques including discounted cash flow models, quoted market values and third-party independent appraisals, as considered necessary. Management evaluated and determined no impairment write-downs were considered necessary for the fiscal years ending September 30, 2023, 2022, and 2021.\nInvestments\nInvestments consist of the capital stock and patron equities of the Company's distillers grains marketer. The investment is stated at the lower of cost or fair value and adjusted for non-cash patronage equities and cash equity redemptions received. Non-cash patronage dividends are recognized when received and included within revenue in the statements of operations.\nThe Company has also created certain subsidiaries to achieve some of its varying business interests that are not directly related to ethanol production or trading of grain. One has been formed as a corporation, while the other has been formed as a limited liability company (LLC) to hold interests in affiliated companies for carbon capture and underground sequestration (CCS). Through its LLC, the Company owns a fifty percent interest in a joint venture which is accounted for as an equity method investment as described in detail in Note 15 - Equity Method Investments.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nPassthrough Entity Tax\nThe Company records Indiana passthrough entity tax in accordance with ASC 740 and has elected to account for the payments as an equity transaction through member distributions. At September 30, 2023, accrued distributions for Indiana passthrough entity tax was $2,100,000. The Company paid approximately $2,279,000 for 2022 taxes during the fiscal year ended September 30, 2023.\nEconomic Development Fund\nIn September 2007, the Company entered into a development agreement with Randolph County Redevelopment Commission (the \"Commission\") to promote economic development in the area. Under the terms of this agreement, beginning in January 2008 through December 2028, the money paid towards property tax is allocated to an expense and an acquisition account. The funds in the acquisition account can be used by the Commission to purchase equipment, at the Company's direction, for the plant. The Company does not have title to or control over the funds in the acquisition account.\nOn February 14, 2023, the Company received $2,950,000 from the Commission. The Company has elected to account for this transaction under the International Accounting Standards (IAS) No. 20 Accounting for Government Disclosure of Government Assistance as the U.S. Accounting Standards Codification (U.S. GAAP) does not contain explicit guidance. The Company reported this transaction in the statement of cash flows as proceeds form the economic development fund, and in the balance sheet as a reduction of payments for construction in process.\nRevenue Recognition\nRevenue is recognized upon transfer of control of promised products or services to customers in an amount that reflects the consideration the Company expects to receive in exchange for those products or services. The Company's contracts primarily consist of agreements with marketing companies and other customers as described below. The Company's performance obligations consist of the delivery of ethanol, distillers grains, corn oil, soybeans and carbon dioxide to its customers. The consideration the Company receives for these products is fixed based on current observable market prices at the Chicago Mercantile Exchange, generally, and adjusted for local market differentials. The Company's contracts have specific delivery modes, rail or truck, and dates. Revenue is recognized when the Company delivers the products to the mode of transportation specified in the contract, at the transaction price established in the contract, net of commissions, fees, and freight. The Company sells each of the products via different marketing channels as described below.\nEthanol. The Company sells its ethanol via a marketing agreement with Murex, LLC. Murex markets one hundred percent of the Company's ethanol production based on agreements with end users at prices agreed upon mutually among the end user, Murex and the Company. Murex then provides a schedule of deliveries required and an order for each rail car or tankers needed to fulfill their commitment with the end user. These are individual performance obligations of the Company. The marketing agreement calls for control and title to pass when the delivery vehicle is filled. Revenue is recognized then at the price in the agreement with the end user, net of commissions, freight, and insurance.\nDistillers grains. The Company engages another third-party marketing company, CHS, Inc. to market one hundred percent of the distillers grains it produces at the plant. The process for selling the distillers grains is like that of ethanol, except that CHS takes title and control once a rail car is released to the railroad or a truck is released from the Company's scales. Prices are agreed upon among the three parties, and CHS provides schedule and orders representing performance obligations. Revenue is recognized net of commissions, freight, and fees.\nDistillers corn oil (corn oil). The Company sells its production of corn oil directly to commercial customers. The customer is provided with a delivery schedule and pick up orders representing performance obligations. These are fulfilled when the customer's driver picks up the scheduled load. The price is agreed upon at the time each contract is made, and the Company recognizes revenue at the time of delivery at that price.\nCarbon dioxide. The Company sells a portion of the carbon dioxide it produces to a customer that maintains a plant on-site for a set price per ton. Delivery is defined as transference of the gas from our stream to their plant.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nSoybeans and other grains. The Company sells soybeans exclusively to commercial mills, processors or grain traders. Contracts are negotiated directly with the parties at prices based on negotiated prices.\nCost of Goods Sold\nCost of goods sold include corn, trading division grains, natural gas and other components which includes processing ingredients, electricity, railcar lease, railcar maintenance, depreciation of ethanol production fixed assets and wages, salaries and benefits of production personnel.\nOperating Expenses\nOperating expenses include wages, salaries and benefits of administrative employees at the plant, insurance, professional fees, depreciation of trading division fixed assets, property taxes and similar costs.\nDerivative Instruments\nFrom time to time the Company enters into derivative transactions to hedge its exposures to commodity price fluctuations. The Company is required to record these derivatives in the balance sheet at fair value.\nIn order for a derivative to qualify as a hedge, specific criteria must be met and appropriate documentation maintained. Gains and losses from derivatives that do not qualify as hedges, or are undesignated, must be recognized immediately in earnings. If the derivative does qualify as a hedge, depending on the nature of the hedge, changes in the fair value of the derivative will be either offset against the change in fair value of the hedged assets, liabilities, or firm commitments through earnings or recognized in other comprehensive income until the hedged item is recognized in earnings. Changes in the fair value of undesignated derivatives are recorded in the statement of operations, depending on the item being hedged.\nAdditionally, the Company is required to evaluate its contracts to determine whether the contracts are derivatives. Certain contracts that literally meet the definition of a derivative may be exempted as normal purchases or normal sales. Normal purchases and normal sales are contracts that provide for the purchase or sale of something other than a financial instrument or derivative instrument that will be delivered in quantities expected to be used or sold over a reasonable period in the normal course of business. Contracts that meet the requirements of normal purchases or sales are documented as normal and exempted from accounting and reporting requirements, and therefore, are not marked to market in the consolidated financial statements.\nThe Company has elected for its Ethanol Division to apply the normal purchase normal sale exemption to all forward commodity contracts. For the Trading Division, the Company has elected not to apply the normal purchase normal sale exemption to its forward purchase and sales contracts and therefore, marks these derivative instruments to market.\nFair Value of Financial Instruments\nThe Company follows guidance for accounting for fair value measurements of financial assets and financial liabilities and for fair value measurements of nonfinancial items that are recognized or disclosed at fair value in the consolidated financial statements on a recurring and nonrecurring basis. The guidance establishes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to measurements involving significant unobservable inputs (Level 3 measurements). The three levels of the fair value hierarchy are as follows:\nLevel 1 inputs are quoted prices (unadjusted) in active markets for identical assets or liabilities that the Company has the ability to access at the measurement date.\nLevel 2 inputs are inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the asset or liability.\nLevel 3 inputs are unobservable inputs for the asset or liability used to measure fair values to the extent that observable inputs are not available, thereby allowing for situations in which there is little, if any, market activity for the asset or liability at measurement date.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nThe level in the fair value hierarchy within which a fair measurement in its entirety falls is based on the lowest level input that is significant to the fair value measurement in its entirety.\nThe carrying value of cash and cash equivalents, restricted cash, trade accounts receivable, miscellaneous receivables, accounts payable (other than those measured as fair value discussed in Note 8), accounts payable-grain, and accrued expenses approximates fair value at September 30, 2023 and 2022 due to the short maturity nature of these instruments. The fair value of derivative instruments, available-for-sale debt securities, Trading Division inventory, and debt is disclosed in Note 8.\nExcept for those assets and liabilities, which are required by authoritative accounting guidance to be recorded at fair value on the balance sheets, the Company has elected not to record any other assets or liabilities at fair value. No events occurred during the fiscal years ended September 30, 2023, 2022, or 2021 that required adjustment to the recognized balances of assets or liabilities, which are recorded at fair value on a nonrecurring basis.\nEnvironmental Liabilities\nThe Company's operations are subject to environmental laws and regulations adopted by various governmental entities in the jurisdiction in which it operates. These laws require the Company to investigate and remediate the effects of the release or disposal of materials at its location. Accordingly, the Company has adopted policies, practices and procedures in the areas of pollution control, occupational health, and the production, handling, storage and use of hazardous materials to prevent material environmental or other damage, and to limit the financial liability, which could result from such events. Environmental liabilities are recorded when the liability is probable and the costs can be reasonably estimated. No liabilities were recorded at September 30, 2023 or 2022.\nNet Income per Unit\nBasic net income per unit is computed by dividing net income by the weighted average number of members' units outstanding during the period. Diluted net income per unit is computed by dividing net income by the weighted average number of members' units and members' unit equivalents outstanding during the period. There were no member unit equivalents outstanding during the periods presented; accordingly, the Company's basic and diluted net income per unit are the same.\nIncome Taxes\nCardinal Ethanol, LLC and Subsidiaries is treated as a partnership for federal and state income tax purposes and generally does not incur income taxes. Instead, income or losses are included in the income tax returns of the members and partners. Accordingly, no provision or liability for federal or state income taxes has been included in these consolidated financial statements. The Company had no significant uncertain tax positions as of September 30, 2023 or 2022. Differences between the financial statement basis of assets and tax basis of assets is related to capitalization and amortization of organization and start-up costs for tax purposes, whereas these costs are expensed for financial statement purposes. In addition, the Company uses the modified accelerated cost recovery system method (MACRS) for tax depreciation instead of the straight-line method that is used for book depreciation, which also causes temporary differences. For years before 2019, the Company is no longer subject to U.S. Federal income tax examinations.\n2. REVENUE\nRevenue Recognition\nRevenue is recognized at a single point in time when the Company satisfies its performance obligation under the terms of a contract with a customer. Generally, this occurs with the transfer of control of products or services. Revenue is measured as the amount of consideration expected, as specified in the contract with a customer, to be received in exchange for transferring goods or providing services.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nRevenue by Source\nAll revenues from contracts with customers under ASC Topic 606 are recognized at a point in time. The following tables disaggregate revenue by major source:\nFiscal Year Ended September 30, 2023\nEthanol Division Trading Division Total\nRevenues from contracts with customers under ASC Topic 606\nEthanol $ 330,330,829 $ - $ 330,330,829\nDistillers Grains\n65,062,188 - 65,062,188\nCorn Oil 29,456,495 - 29,456,495\nCarbon Dioxide 434,261 - 434,261\nOther Revenue 273,192 - 273,192\nTotal revenues from contracts with customers 425,556,965 - 425,556,965\nRevenues from contracts accounted for as derivatives under ASC Topic 815 (1)\nSoybeans and Other Grains\n- 77,177,913 77,177,913\nTotal revenues from contracts accounted for as derivatives - 77,177,913 77,177,913\nTotal Revenues $ 425,556,965 $ 77,177,913 $ 502,734,878\nFiscal Year Ended September 30, 2022\nEthanol Division Trading Division Total\nRevenues from contracts with customers under ASC Topic 606\nEthanol $ 359,726,018 $ - $359,726,018\nDistillers Grains\n63,798,998 - 63,798,998\nCorn Oil 27,656,525 - 27,656,525\nCarbon Dioxide 473,449 - 473,449\nOther Revenue 65,825 116,331 182,156\nTotal revenues from contracts with customers 451,720,815 116,331 451,837,146\nRevenues from contracts accounted for as derivatives under ASC Topic 815 (1)\nSoybeans and Other Grains\n- 94,854,225 94,854,225\nTotal revenues from contracts accounted for as derivatives - 94,854,225 94,854,225\nTotal Revenues $ 451,720,815 $ 94,970,556 $ 546,691,371\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nFiscal Year Ended September 30, 2021\nEthanol Division Trading Division Total\nRevenues from contracts with customers under ASC Topic 606\nEthanol $ 251,922,325 $ - $ 251,922,325\nDistillers Grains\n57,818,038 - 57,818,038\nCorn Oil 17,966,544 - 17,966,544\nCarbon Dioxide 484,752 - 484,752\nOther Revenue 54,275 121,200 175,475\nTotal revenues from contracts with customers 328,245,934 121,200 328,367,134\nRevenues from contracts accounted for as derivatives under ASC Topic 815 (1)\nSoybeans and Other Grains\n- 75,635,032 75,635,032\nTotal revenues from contracts accounted for as derivatives - 75,635,032 75,635,032\nTotal Revenues $ 328,245,934 $ 75,756,232 $ 404,002,166\n(1) Revenues from contracts accounted for as derivatives represent physically settled derivative sales that are outside the scope of ASC Topic 606, Revenue from Contracts with Customers (ASC Topic 606), where the company recognizes revenue when control of the inventory is transferred within the meaning of ASC Topic 606 as required by ASC Topic 610-20, Gains and Losses from the Derecognition of Nonfinancial Assets.\nPayment Terms\nThe Company has contractual payment terms with each respective marketer that sells ethanol and distillers grains. These terms are generally 7 - 14 days after the week of the transfer of control.\nThe Company has standard payment terms of net 10 days for its sale of corn oil.\nThe Company has standard payments terms due upon delivery for its sale of soybeans.\nThe contractual terms with the carbon dioxide customer calls for an annual settlement.\nShipping and Handling Costs\nShipping and handling costs related to contracts with customers for sale of goods are accounted for as a fulfillment activity and are included in cost of goods sold. Accordingly, amounts billed to customers for such costs are included as a component of revenue.\nContract Liabilities\nThe Company records unearned revenue when consideration is received, or such consideration is unconditionally due, from a customer prior to transferring goods or services to the customer under the terms of its contracts with customers.\n3. CONCENTRATIONS\nTwo major customers accounted for approximately 86% and 82% of the outstanding accounts receivable balance at September 30, 2023 and September 30, 2022, respectively. The same two customers, with the addition of one other not included in the receivable concentration, accounted for approximately 90% of revenue for the year ended September 30, 2023. The same two customers, with the addition of one other not included in the receivable concentration, accounted for approximately 93% for the year ended September 30, 2022. The same two customers also accounted for approximately 81% the year ended September 30, 2021.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\n4. INCOME TAXES\nThe differences between financial statement basis and tax basis of assets and liabilities at September 30, 2023 and 2022 are as follows:\n2023 2022\nFinancial statement basis of assets $ 232,768,247 $ 188,955,828\nOrganization and start-up costs 2,899,172 3,160,001\nBook to tax depreciation and amortization (40,375,253) (48,551,783)\nBook to tax derivative instruments (352,464) (967,461)\nBook to tax operating lease right of use asset (3,012,581) (6,808,992)\nCapitalized inventory 132,000 127,000\nBook to tax investment in subsidiary\n807,189 -\nIncome tax basis of assets $ 192,866,310 $ 135,914,593\nFinancial statement basis of liabilities $ 60,235,230 $ 41,685,336\nBook to tax derivative instruments (3,817,921) (2,664,853)\nBook to tax operating lease liability (3,028,730) (6,811,869)\nAccrued employee benefits (1,258,375) (849,646)\nAccrued rail car rehabilitation costs (2,358,134) (2,036,638)\nIncome tax basis of liabilities $ 49,772,070 $ 29,322,330\n5. MEMBERS' EQUITY\nThe Company has one class of membership units, which include certain transfer restrictions as specified in the operating agreement and pursuant to applicable tax and securities laws. Income and losses are allocated to all members based upon their respective percentage of units held.\nDistribution dates and amounts for the fiscal year ended September 30, 2023 are listed in the table below:\nDate Declared Distribution Declared Per Unit Total Distribution Amount Month Distribution Paid\nNovember 15, 2022 $ 500 $ 7,303,000 November 2022\nFebruary 21, 2023 500 7,303,000 March 2023\nMay 16, 2023 1,250 18,257,500 May 2023\nSeptember 19, 2023 500 7,303,000 September 2023\nTotals $ 2,750 $ 40,166,500\nIn November 2023, the Company declared a distribution of $300 per unit for a total distribution of $4,381,800.\nIn addition to the distributions seen in the table above, the Company recorded Indiana passthrough entity tax as an equity transaction through member distributions of approximately $4,379,000 during the fiscal year ended September 30, 2023.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nDistribution dates and amounts for the fiscal year ended September 30, 2022 are listed in the table below:\nDate Declared Distribution Declared Per Unit Total Distribution Amount Month Distribution Paid\nNovember 16, 2021 $ 650 $ 9,493,900 November 2021\nFebruary 15, 2022 1,500 21,909,000 March 2022\nMay 17, 2022 675 9,859,050 June 2022\nAugust 16, 2022 1,500 21,909,000 August 2022\nTotals $ 4,325 $ 63,170,950\nDistribution dates and amounts for the fiscal year ended September 30, 2021 are listed in the table below:\nDate Declared Distribution Declared Per Unit Total Distribution Amount Month Distribution Paid\nNovember 17, 2020 $ 100 $ 1,460,600 November 2020\nFebruary 9, 2021 150 2,190,900 February 2021\nJune 15, 2021 200 2,921,200 June 2021\nAugust 17, 2021 325 4,746,950 August 2021\nTotals $ 775 $ 11,319,650\n6. INVENTORIES\nInventories consist of the following as of September 30, 2023 and 2022:\nSeptember 30, 2023 September 30, 2022\nEthanol Division:\nRaw materials $ 3,517,682 $ 7,206,914\nWork in progress 1,848,663 2,442,453\nFinished goods 4,638,966 7,513,988\nSpare parts 4,789,021 4,178,807\nEthanol Division Subtotal $ 14,794,332 $ 21,342,162\nTrading Division:\nGrain inventory $ 309,108 $ 2,028,605\nTrading Division Subtotal 309,108 2,028,605\nTotal Inventories $ 15,103,440 $ 23,370,767\nThe Company did not have a net realizable value write-down of ethanol inventory for the years ended September 30, 2023, 2022 and 2021.\nIn the ordinary course of its ethanol business, the Company enters into forward purchase contracts for its commodity purchases and sales. Certain contracts for the ethanol division that literally meet the definition of a derivative may be exempted from derivative accounting as normal purchases or normal sales. At September 30, 2023, the Company has forward corn purchase contracts at various fixed prices for various delivery periods through December 2024 for approximately 7% of expected production needs for the next 15 months. Given the uncertainty of future ethanol and corn prices, the Company could incur a\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nloss on the outstanding corn purchase contracts in future periods. Management has evaluated these forward contracts and its inventories using the lower of cost or net realizable value evaluation, and has determined that no impairment existed at September 30, 2023 and September 30, 2022. At September 30, 2023, the Company has forward natural gas purchase contracts for 47% of expected usage for the next 13 months at various prices for various delivery periods through October 2024. The Company has no forward ethanol sales contracts at fixed prices at September 30, 2023. The Company did have dried distiller grains sales contracts for 25% of expected production for the next 3 months through December 2023. The Company has forward corn oil sales contracts for 48% of expected production for the next month at various fixed prices for various delivery periods through October 2023. Also, the Company purchased corn from related parties during the year ended September 30, 2023 totaling approximately $783,000.\nAt September 30, 2023, the Company has soybean forward purchase contracts at various fixed prices for various delivery periods through January 2025 for 6% of its anticipated trading volume of that commodity for the next 16 months. Also, the Company did not purchase any soybeans from related parties during the fiscal year ended September 30, 2023.\n7. DERIVATIVE INSTRUMENTS\nThe Company enters into corn, ethanol, natural gas, soybean oil, and soybean derivative instruments, which are required to be recorded as either assets or liabilities at fair value in the balance sheet. Derivatives qualify for treatment as hedges when there is a high correlation between the change in fair value of the derivative instrument and the related change in value of the underlying hedged item. The Company must designate the hedging instruments based upon the exposure being hedged as a fair value hedge, a cash flow hedge or a hedge against foreign currency exposure.\nCommodity Contracts\nThe Company enters into commodity-based derivatives, for corn, ethanol, soybeans, soybean oil, and natural gas in order to protect cash flows from fluctuations caused by volatility in commodity prices and to protect gross profit margins from potentially adverse effects of market and price volatility on commodity based purchase commitments where the prices are set at a future date. These derivatives are not designated as effective hedges for accounting purposes. For derivative instruments that are not accounted for as hedges, or for the ineffective portions of qualifying hedges, the change in fair value is recorded through earnings in the period of change. The changes in the fair market value of ethanol derivative instruments are included as a component of revenue. The changes in the fair market value of corn, natural gas, soybean oil, and soybean derivative instruments are included as a component of cost of goods sold.\nAt September 30, 2023, the Ethanol Division had a net short (selling) position of 1,395,001 bushels of corn under derivative contracts used to hedge its forward corn purchase contracts, corn inventory and ethanol sales. The Ethanol Division had a net short (selling) position of 10,080,000 bushels of corn under derivative contracts as of September 30, 2022. Most of these corn derivatives are traded on the Chicago Board of Trade and are forecasted to settle for various delivery periods through December 2024 as of September 30, 2023. The Ethanol Division had a net short (selling) position of 45,360,000 gallons of ethanol under derivative contracts used to hedge its future ethanol sales as of September 30, 2023. The Ethanol Division had a net short (selling) position of 12,390,000 gallons of ethanol under derivative contracts as of September 30, 2022. These ethanol derivatives are traded on the New York Mercantile Exchange and are forecasted to settle for various delivery periods through September 2024 as of September 30, 2023. The Ethanol Division had a net long (buying) position of 1,263,012 mmbtus of natural gas under derivative contracts used to hedge its future natural gas sales as of September 30, 2023. The Ethanol Division had no open positions of natural gas under derivative contracts as of September 30, 2022. These natural gas derivatives are traded on the New York Mercantile Exchange and other markets and are forecasted to settle for various delivery periods through April 2024 as of September 30, 2023. The Ethanol Division had a net long (buying) position of 600,000 pounds of soybean oil under derivative contracts used to hedge its future corn oil sales as of September 30, 2023. The Ethanol Division had no open positions of soybean oil under derivative contracts as of September 30, 2022. These soybean oil derivatives are traded on the Chicago Board of trade and are forecasted to settle through December 2023 as of September 30, 2023.\nAt September 30, 2023, the Trading Division had a net short (selling) position of 530,000 bushels of soybeans under derivative contracts used to hedge its forward soybean purchase contracts. These soybean derivatives are traded on the Chicago Board of Trade and are forecasted to settle for various period through January 2025 as of September 30, 2023. The Trading Division had\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\na short (selling) position of 1,235,000 bushels of soybeans under derivative contracts as of September 30, 2022. These derivatives have not been designated as effective hedges for accounting purposes.\nThe following table provides balance sheet details regarding the Company's derivative financial instruments at September 30, 2023:\nInstrument Balance Sheet Location Assets Liabilities\nEthanol Futures and Options Contracts\nFutures and Options Derivatives $ - $ 3,513,693\nCorn Futures and Options Contracts\nFutures and Options Derivatives $ - $ 29,108\nNatural Gas Futures and Options Contracts\nFutures and Options Derivatives\n$ - $ 253,586\nSoybean Oil Futures and Options Contracts\nFutures and Options Derivatives\n$ - $ 21,534\nSoybean Futures and Options Contracts\nFutures and Options Derivatives $ 352,464 $ -\nSoybean Forward Purchase and Sales Contracts\nForward Purchase/Sales Derivatives $ 66,825 $ 356,177\nAs of September 30, 2023, the Company had approximately $13,400,000 of cash collateral (restricted cash) related to ethanol, corn, soybean oil, natural gas, and soybean derivatives held by three brokers.\nThe following table provides balance sheet details regarding the Company's derivative financial instruments at September 30, 2022:\nInstrument Balance Sheet Location Assets Liabilities\nEthanol Futures and Options Contracts\nFutures and Options Derivatives $ - $ 841,470\nCorn Futures and Options Contracts\nFutures and Options Derivatives $ - $ 1,827,963\nSoybean Futures and Options Contracts\nFutures and Options Derivatives $ 972,041 $ -\nSoybean Forward Purchase and Sales Contracts\nForward Purchase/Sale Derivatives $ 360,620 $ 507,408\nAs of September 30, 2022, the Company had approximately $9,300,000 of cash collateral (restricted cash) related to ethanol, corn, and soybean derivatives held by three brokers.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nThe following table provides details regarding the gains and (losses) from the Company's derivative instruments in the statements of operations, none of which are designated as hedging instruments for the fiscal year ended September 30, 2023:\nInstrument Statement of Operations Location Amount\nEthanol Futures and Options Contracts Revenues $ 6,873,197\nCorn Futures and Options Contracts Cost of Goods Sold 12,891,994\nNatural Gas Futures and Options Contracts Cost of Goods Sold (2,569,990)\nSoybean Oil Futures and Options Contracts Cost of Goods Sold 44,610\nSoybean Futures and Options Contracts Cost of Goods Sold (869,262)\nSoybean Forward Purchase and Sales Contracts Cost of Goods Sold (122,959)\nTotals $ 16,247,590\nThe following table provides details regarding the gains and (losses) from the Company's derivative instruments in the statements of operations, none of which are designated as hedging instruments for the fiscal year ended September 30, 2022:\nInstrument Statement of Operations Location Amount\nEthanol Futures and Options Contracts Revenues $ (6,192,448)\nCorn Futures and Options Contracts Cost of Goods Sold (4,677,214)\nNatural Gas Futures and Options Contracts Cost of Goods Sold (39,039)\nSoybean Oil Futures and Options Contracts Cost of Goods Sold 179,637\nSoybean Futures and Options Contracts Cost of Goods Sold (3,883,992)\nSoybean Forward Purchase and Sales Contracts Cost of Goods Sold (621,040)\nTotals $ (15,234,096)\nThe following table provides details regarding the gains and (losses) from the Company's derivative instruments in the statements of operations, none of which are designated as hedging instruments for the fiscal year ended September 30, 2021:\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nInstrument Statement of Operations Location Amount\nEthanol Futures and Options Contracts Revenues $ 1,392,605\nCorn Futures and Options Contracts Cost of Goods Sold (18,881,451)\nNatural Gas Futures and Options Contracts Cost of Goods Sold (836)\nSoybean Oil Futures and Options Contracts Cost of Goods Sold 1,813,519\nSoybeans Futures and Options Contracts Cost of Goods Sold (6,518,841)\nSoybean Forward Purchase and Sales Contracts Cost of Goods Sold (894,717)\nTotals $ (23,089,721)\n8. FAIR VALUE MEASUREMENTS\nThe following table provides information on those assets and liabilities measured at fair value on a recurring basis as of September 30, 2023:\nInstruments Carrying Amount Fair Value Level 1 Level 2 Level 3\nCorn Futures and Options Contracts $ (29,108) $ (29,108) $ (60,637) $ 31,529 $ -\nEthanol Futures and Options Contracts $ (3,513,693) $ (3,513,693) $ (3,513,693) $ - $ -\nNatural Gas Futures and Options Contracts\n$ (253,586) $ (253,586) $ (39,300) $ (214,286) $ -\nSoybean Oil Futures and Options Contracts $ (21,534) $ (21,534) $ (21,534) $ - $ -\nSoybean Futures and Options Contracts $ 352,464 $ 352,464 $ 352,464 $ - $ -\nSoybean Forward Purchase Contracts $ (289,352) $ (289,352) $ - $ (289,352) $ -\nSoybean Inventory $ 309,108 $ 309,108 $ - $ 309,108 $ -\nAccounts Payable $ (3,908,868) $ (3,908,868) $ - $ (3,908,868) $ -\nTreasury Bills (classified as investments in available-for-sale debt securities)\n$ 12,407,939 $ 12,407,939 $ 12,407,939 $ - $ -\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nThe following table provides information on those assets and liabilities measured at fair value on a recurring basis as of September 30, 2022:\nInstruments Carrying Amount Fair Value Level 1 Level 2 Level 3\nCorn Futures and Options Contracts $ (1,827,963) $ (1,827,963) $ (1,827,963) $ - $ -\nEthanol Futures and Options Contracts $ (841,470) $ (841,470) $ (841,470) $ - $ -\nSoybean Futures and Options Contracts $ 972,041 $ 972,041 $ 972,041 $ - $ -\nSoybean Forward Purchase Contracts $ (146,788) $ (146,788) $ - $ (146,788) $ -\nSoybean Inventory $ 2,028,605 $ 2,028,605 $ - $ 2,028,605 $ -\nAccounts Payable $ (4,379,251) $ (4,379,251) $ - $ (4,379,251) $ -\nTreasury Bills (classified as investments in available-for-sale debt securities)\n$ 33,228,697 $ 33,228,697 $ 33,228,697 $ - $ -\nWe determine the fair value of commodity derivative instruments utilizing Level 1 inputs by obtaining fair value measurements from an independent pricing service. The fair value measurements consider observable data that may include dealer quotes and live trading levels from the Chicago Board of Trade market and New York Mercantile Exchange.\nWe determine the fair value of treasury bill Level 1 inputs by obtaining fair value measurements from an independent pricing service. The fair value measurements consider observable data based on quoted market prices in active markets.\nWe determine the fair value of corn and soybean futures and options Level 2 instruments by model-based techniques in which all significant inputs are observable in the markets noted above. Soybean forward purchase and sale contracts are reported at fair value using Level 2 inputs from current contract prices that are being issued by the Company.\nSoybean inventory held in the trading division is reported at fair value using Level 2 inputs which are based on purchases and sales transactions that occurred on or near September 30, 2023 and 2022.\nAccounts payable is generally stated at historical amounts with the exception of approximately $3,909,000 and $4,379,000 at September 30, 2023 and 2022, respectively, related to certain delivered inventory for which the payable fluctuates based on changes in commodity prices. These payables are hybrid financial instruments for which the Company has elected the fair value option.\nThe Company believes the fair value of its long-term debt at September 30, 2023 and September 30, 2022 approximated the carrying value of approximately $30,569,000 and $9,000,000, respectively and are considered to be a Level 2 input. The fair values and carrying values consider the terms of the related debt and exclude the impacts of discounts and derivative/hedging activity.\n9. BANK FINANCING\nThe Company has a loan agreement consisting of two loans, the Declining Revolving Loan (Declining Loan) and the Revolving Credit Loan in exchange for liens on all property (real and personal, tangible and intangible) which include, among other things, a mortgage on the property, a security interest on commodity trading accounts and assignment of material contracts. The loan agreement assigns an interest rate based on the U.S. prime rate published daily in the Wall Street Journal to each of the individual loans. The interest rate on each of the loans changes daily.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nDeclining Loan\nThe maximum availability of the Declining Loan was formerly $5,000,000 and such amount was to be available for working capital purposes. However, the maximum availability of the Declining Loan was increased from $5,000,000 to $39,000,000 in order to provide financing to fund the construction and installation of a high protein feed system at the plant. The interest rate on the Declining Loan is currently based on the prime rate minus five basis points (.05%) subject to a floor of 2.85%. The interest rate on the Declining Loan at September 30, 2023 and 2022 was 8.45% and 6.20%, respectively. The Company is required to make monthly interest payments on the Declining Loan during the draw period. The principal balance of the Declining Loan is expected to be converted to term debt on or before May 1, 2024, to be repaid in 60 equal monthly installments based on a ten year amortization period. In addition, the Company will be required to make mandatory annual prepayments on the term debt within 120 days following the end of each fiscal year beginning with the fiscal year ended September 30, 2024. The annual prepayment will be in the amount of the lesser of 40% of excess cash flow (as defined in the agreement) or $7,200,000, up to an aggregate prepayment amount of $18,000,000. The Company had borrowings outstanding of approximately $30,569,000 on the Declining Loan at September 30, 2023 and $9,000,000 borrowings outstanding at September 30, 2022.\nRevolving Credit Loan\nThe Revolving Credit Loan has a limit of $20,000,000 supported by a borrowing base made up of the Company's corn, ethanol, dried distillers grain, corn oil and soybean inventories reduced by accounts payable associated with those inventories having a priority. It is also supported by the eligible accounts receivable and commodity trading account excess margin funds. The interest rate on the Revolving Credit Loan is the prime rate minus twenty-five basis points (.25%) and is subject to a floor of 2.75%. The interest rate at September 30, 2023 and 2022 was 8.25% and 6.00%, respectively. There were no borrowings outstanding on the Revolving Credit Loan at September 30, 2023 and September 30, 2022. The Revolving Credit Loan is set to mature on February 28, 2024.\nThese loans are subject to protective covenants, which require the Company to maintain various financial ratios. The covenants include a working capital requirement of $15,000,000, and a capital expenditures covenant that allows the Company $6,000,000 of expenditures per year without prior approval. The cost of the high protein feed system is excluded from the capital expenditures calculation until the principal balance of the Declining Loan converts to term debt. There is also a requirement to maintain a minimum fixed charge coverage ratio of no less than 1.15:1.0 measured quarterly. A debt service charge coverage ratio of no less than 1.25:1.0 in lieu of the fixed charge coverage ratio will apply for any reporting period that working capital is equal to or more than $23,000,000.\nLong-term debt, as discussed above, consists of the amount drawn on the Declining Note of $30,568,958 at September 30, 2023 with $1,136,681 due within one year.\nThe estimated maturities of long-term debt at September 30, 2023 are as follows:\nOctober 1, 2023 to September 30, 2024\n$ 1,136,681\nOctober 1, 2024 to September 30, 2025\n3,478,432\nOctober 1, 2025 to September 30, 2026\n3,788,424\nOctober 1, 2026 to September 30, 2027\n4,126,042\nOctober 1, 2027 to September 30, 2028\n4,489,778\nThereafter 13,549,601\nTotal\n$ 30,568,958\nLess: amounts due in one year\n1,136,681\nTotal long-term debt, net of current maturities\n$ 29,432,277\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\n10. LEASES\nThe Company leases rail cars for its facility to transport ethanol and dried distillers grains to its end customers. Operating lease right of use assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. The Company uses its estimated incremental borrowing rate, unless an implicit rate is readily determinable, as the discount rate for each lease in determining the present value of lease payments. At September 30, 2023, the Companys weighted average discount rate was 5.88%. Operating lease expense is recognized on a straight-line basis over the lease term.\nThe Company determines if an arrangement is a lease or contains a lease at inception. The Companys leases have remaining lease terms of approximately 1 year to 2.5 years, which may include options to extend the lease when it is reasonably certain the Company will exercise those options. At September 30, 2023, the weighted average remaining lease term was 1.10 years. The Company does not have lease arrangements with residual value guarantees, sale leaseback terms or material restrictive covenants. The Company does not have any material finance lease obligations nor sublease agreements.\nThe following table summarizes the remaining maturities of the Companys operating lease liabilities at September 30, 2023:\nFor the Fiscal Year Ending September 30,\n2024 $ 2,704,780\n2025 417,980\nTotals 3,122,760\nAmount representing interest (94,030)\nLease liabilities $ 3,028,730\nAt September 30, 2023, the Company recorded operating lease costs of approximately $3,770,000 in cost of goods sold in the Companys statement of operations. At September 30, 2022, the Company recorded $1,135,000 in cost of goods sold in the Company's statement of operations. Cash paid for the operating leases was approximately $3,780,000 for the year ended September 30, 2023 and approximately $3,659,000 for the year ended September 30, 2022.\n11. COMMITMENTS AND CONTINGENCIES\nMarketing Agreement\nThe Company entered into an agreement with an unrelated company for the purpose of marketing and selling all the distillers grains the Company is expected to produce. The buyer agrees to remit a fixed percentage rate of the actual selling price to the Company for distillers dried grain solubles and wet distiller grains. The agreement may be terminated by either party at its unqualified option, by providing written notice of not less than 120 days to the other party.\nThe Company entered into an agreement with an unrelated company to sell all of the ethanol the Company produces at the plant. The Company agrees to pay a commission of a fixed percent of the net purchase price for marketing and distribution. In July 2009, the initial term of the agreement was extended to eight years and the commission increased in exchange for reducing the payment terms from 14 days to 7 days after shipment. In November 2012, the Company amended this agreement to extend the initial term of the agreement to eleven years, expiring in 2019, in exchange for capping the commissions at $1,750,000 per year. Effective November 18, 2018, the two companies amended the marketing agreement. The amendment added a renewal term to the initial agreement that extended the contract until November 30, 2022. It provided for the payment of the commission to Murex to be calculated on each net gallon of ethanol taken under the agreement. It modified how the cost of rail car shipments are charged to the Company, moving from a per gallon fee to requiring that the marketer provide a minimum 225 rail cars to the Company on a per car per month lease basis as described in Note 10. Finally, it reduced the delivery to payment period. On September 14, 2022, the Company executed an amendment to extend the term until December 31, 2024, subject to automatic renewals thereafter for one-year periods unless either party gives notice of non-renewal at least 90 days prior to the end of the current term. The agreement may also be terminated due to the insolvency or intentional misconduct of either party or upon the default of one of the parties as set forth in the agreement. In addition, the amendment added a provision that allows the Company to terminate the agreement on 90 days prior written notice upon a \"Material Change in Control\". Upon\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\ntermination of the agreement for any reason, the Company may be obligated to continue to deliver ethanol for a period of time to cover certain contractual commitments for which the Company gave prior written approval. The amendment also provides for certain adjustments to the purchase price for sales made to the marketer for its own account or for sales of exported ethanol. If this adjusted price can not be finalized at time of payment, the parties may agree upon a provisional price which shall be trued up later. The amendment was effective on December 1, 2022.\nRail Car Rehabilitation Costs\nThe Company leases 180 hopper rail cars under a multi-year agreement which ends in November 2023. The Company has executed a renewal to lease 179 hopper rail cars under a multi-year agreement effective December 2023 and ending in November 2028. Under the agreement, the Company is required to pay to rehabilitate each car for \"damage\" that is considered to be other than normal wear and tear upon turn in of the car(s) at the termination of the lease. Company management has estimated total costs to rehabilitate the cars at September 30, 2023, to be approximately $2,358,000. During the year ended September 30, 2023, the Company has recorded an expense in cost of goods totaling $360,000. The Company accrues the estimated cost of railcar damages over the term of the lease.\nUtility Agreement\nThe Company entered into a natural gas services contract with an initial term of ten years and automatic renewals for up to three consecutive one year periods. Under the contract, the Company agrees to pay a fixed transportation charge per therm delivered for the first five years. For the remaining contract term, the fixed transportation charge will be increased by the compounded inflation rate (as determined by the Consumer Price Index). The contract commenced in November 2008 when plant operations began.\nThe Company has a commitment to buy electricity from a utility. The Company pays the utility company monthly pursuant to their standard rates.\nDevelopment Agreement\nIn September 2007, the Company entered into a development agreement with Randolph County Redevelopment Commission (the Commission) to promote economic development in the area. Under the terms of this agreement, beginning in January 2008 through December 2028, the money the Company pays toward property tax expense is allocated to an expense and an acquisition account. The funds in the acquisition account can be used by the Commission to purchase equipment, at the Company's direction, for the plant. The Company does not have title to or control over the funds in the acquisition account, no amounts have been recorded in the balance sheet relating to this accounts. During the year ended September 30, 2023, $2,950,000 was refunded to the Company and used to offset capital expenditures. During the year ended September 30, 2022, no amount was refunded to the Company and used to offset costs of capital expenditures.\nCarbon Dioxide Agreement\nIn March 2010, the Company entered into an agreement with an unrelated party to sell the raw carbon dioxide gas produced as a byproduct at the Company's ethanol production facility. As part of the agreement, the unrelated company leased a portion of the Company's property to construct a carbon dioxide liquefaction plant. The Company agreed to supply raw carbon dioxide to the plant at a rate sufficient for production of 150 tons of liquid carbon dioxide per day and receive a price of $5.00 per ton of liquid carbon dioxide shipped, with price incentives for increased production levels specified in the contract. The Company is to be paid for a minimum of 40,000 tons each year or approximately $200,000 annually. In November 2011, the Company amended this agreement to allow for an expansion of the carbon dioxide liquefaction plant. Under the amendment, the Company was paid for a new minimum of 98,700 tons each year or $493,500 annually. On November 26, 2019, the Company sent written notice of termination of the agreement which was to be effective on June 1, 2020. However, due to disruptions related to COVID-19, the Company agreed to rescind the termination and extend the agreement one year to June 1, 2021.\nIn June 2021, the Company amended the agreement, to increase the price to $7.00 per ton subject to an annual 2% price increase. However, in the event of a take or pay shortfall, the price paid for the shortfall per ton is reduced by $1.00. The amendment also allows the Company to do anything it wishes with carbon dioxide gas it produces in excess of the quantity it is\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nobligated to sell provided that if the Company sells to others in direct competition then the annual take or pay obligation shall be reduced accordingly and the agreement may be terminated. The initial term of the agreement continues until May 31, 2026, with automatic one-year renewal periods thereafter unless terminated by either party by providing at least six months written notice prior to the expiration of the term. In addition, after the three year anniversary of the effective date, the Company has certain rights to terminate upon the occurrence of a \"Change of Control Event\" or if the Company decides to sequester its carbon dioxide.\nHigh Protein System Installation Agreement\nOn January 20, 2022, the Company contracted with ICM, Inc. to install a system to produce high protein feed which is expected to cost approximately $50,000,000, including recent change orders, and be funded from operations and from the current credit facilities as amended. This project is expected to be completed by the end of calendar year 2023.\nAsset Purchase Agreement\nOn October 23, 2023, Cardinal Colwich, LLC (\"Cardinal Colwich\"), a wholly owned subsidiary of the Company, entered into an Asset Purchase Agreement with Element, LLC (\"Seller\") by and through Alliance Management, LLC (the \"Receiver\") acting in its capacity as the court-appointed receiver (the \"APA\"). The APA provides for the purchase of substantially all of the assets of Seller used in connection with the production of ethanol, high protein distillers grains and corn oil as set forth in more detail in the APA (the \"Purchased Assets\") free and clear of any claims, restrictions, mortgages, security interest, demands, charges and encumbrances. The facility was constructed by ICM, Inc. with a name plate capacity to produce 70 million gallons of ethanol annually and is located in Colwich, Kansas. The cash purchase price for the Purchased Assets is $44,000,000. In addition, Cardinal Colwich will assume certain liabilities specified in the APA. The APA and the consummation of the sale transaction is subject to approval by the court and other closing conditions including, but not limited to, receipt of consents and approvals necessary for the assignment and transfer of certain contracts to be assigned by Seller and assumed by Cardinal Colwich, transfer of the Purchased Assets free and clear of any claims, and receipt of a title insurance policy insuring good, marketable title. The Company expects to fund the purchase from operations and is currently exploring an amendment of its current credit facilities to allow it to borrow up to 50% of the cash purchase price upon consummation of the transaction.\nLegal Proceedings and Contingencies\nThe Company is subject to legal proceedings and claims which arise in the ordinary course of its business. While the ultimate outcome of these matters is not presently determinable, it is in the opinion of management that the resolution of outstanding claims will not have a material adverse effect on the financial position or results of operations of the Company. Due to the uncertainties in the settlement process, it is at least reasonably possible that management's view of outcomes will change in the near term.\n12. EMPLOYEE BENEFIT PLAN\nThe Company has a defined contribution plan available to all of its qualified employees. Effective January 2022, the Company contributes 100% of employee contributions up to 5% of the eligible wages of each employee. The plan is a safe harbor plan where the Company match is guaranteed prior to the beginning of the year. Employees are eligible after six months of service. The Company contributed approximately $176,000, $147,000 and $121,000 to the defined contribution plan during the years ended September 30, 2023, 2022 and 2021, respectively.\n13. RISKS AND UNCERTAINTIES IMPACTING THE ETHANOL INDUSTRY AND OUR FUTURE OPERATIONS\nThe Company has certain risks and uncertainties that it experiences during volatile market conditions, which can have a severe impact on operations. The Company's revenues are derived from the sale and distribution of ethanol, distillers grains and corn oil to customers primarily located in the U.S. Corn for the production process is supplied to the plant primarily from local agricultural producers and from purchases on the open market. During the fiscal year ended September 30, 2023, ethanol sales averaged approximately 66% of total revenues and corn costs averaged 68% of total cost of goods sold.\nThe Company's operating and financial performance is largely driven by prices at which the Company sells ethanol, distillers grains and corn oil, and the related cost of corn. The price of ethanol is influenced by factors such as supply and demand,\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nweather, government policies and programs, and the unleaded gasoline and petroleum markets, although, since 2005, the prices of ethanol and gasoline began a divergence with ethanol selling for less than gasoline at the wholesale level. Excess ethanol supply in the market, in particular, puts downward pressure on the price of ethanol. The Company's largest cost of production is corn. The cost of corn is generally impacted by factors such as supply and demand, weather, government policies and programs. The Company's risk management program is used to protect against the price volatility of these commodities.\nEconomic conditions for the ethanol industry have been favorable during fiscal years 2022 and 2023. However, the military invasion of Ukraine by Russia in the second quarter of fiscal year 2022 and sanctions imposed by other countries as a result have created global economic uncertainty and contributed to increased inflation, significant market disruptions and increased volatility in commodity prices such as corn, oil and natural gas. The economic impact of this war and the potential effects on the Company's operating and financial performance is currently unknown. Additionally, there have been economic indicators that the United States could be facing a possible recession which have primarily resulted in interest rate hikes by the Federal Reserve in an attempt to reduce inflation. The Company continues to monitor economic conditions that might affect our profitability. The Company believes that its cash on hand and available debt from its lender will provide sufficient liquidity to meets its anticipated working capital, debt service and other liquidity needs through the next twelve months. If market conditions worsen affecting the Company's ability to profitably operate the plant or if the Company is unable to transport ethanol, it may be forced to further reduce the ethanol production rate or even temporarily shut down ethanol production altogether.\nOn May 23, 2022, the Company received an award of approximately $7,652,000 from the United States Department of Agriculture (\"USDA\") under the Biofuel Producer Program. The Biofuel Producer Program was created as part of the Coronavirus Aid Relief and Economic Security Act. The USDA announced that the funds were made available to provide economic relief to biofuels producers who faced unexpected market losses due to the COVID-19 pandemic and support a significant market for agricultural producers who supply products used in biofuel production. This award was unconditional and was recognized as a component of other income on the statement of operations during the year ended September 30, 2022. On August 31, 2023, the Company received a residual award of approximately $950,000 from the USDA under the Biofuel Producer Program. The award was unconditional and was recognized as a component of other income on the statement of operations during the year ended September 30, 2023.\n14. BUSINESS SEGMENTS\nThe Company has two reportable operating segments. Segment reporting is intended to give financial statement users a better view of how the Company manages and evaluates its businesses. The accounting policies for each segment are the same as those described in the summary of significant accounting policies. Segment income or loss does not include any allocation of shared-service costs. Segment assets are those that are directly used in or identified with segment operations. Inter-segment balances and transactions have been eliminated.\nThe following tables summarize financial information by segment and provide a reconciliation of segment revenue, gross profit, grain inventories, operating income, and total assets:\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2023 and 2022\nFiscal Year Ended\nSeptember 30, 2023 September 30, 2022 September 30, 2021\nRevenue:\nEthanol division $ 425,556,965 $ 451,720,815 $ 328,245,934\nTrading division 77,177,913 94,970,556 75,756,232\nTotal Revenue $ 502,734,878 $ 546,691,371 $ 404,002,166\nFiscal Year Ended\nSeptember 30, 2023 September 30, 2022 September 30, 2021\nGross Profit:\nEthanol division $ 73,461,474 $ 82,638,679 $ 32,646,809\nTrading division 2,259,085 3,745,801 1,981,529\nTotal Gross Profit $ 75,720,559 $ 86,384,480 $ 34,628,338\nFiscal Year Ended\nSeptember 30, 2023 September 30, 2022 September 30, 2021\nOperating Income:\nEthanol division $ 65,676,991 $ 75,824,501 $ 26,736,720\nTrading division 990,113 2,476,829 712,557\nTotal Operating Income\n$ 66,667,104 $ 78,301,330 $ 27,449,277\nSeptember 30, 2023 September 30, 2022\nGrain Inventories:\nEthanol division $ 3,517,682 $ 7,206,914\nTrading division 309,108 2,028,605\nTotal Grain Inventories $ 3,826,790 $ 9,235,519\nSeptember 30, 2023 September 30, 2022\nTotal Assets:\nEthanol division $ 234,913,852 $ 188,055,176\nTrading division (2,145,605) 900,652\nTotal Assets $ 232,768,247 $ 188,955,828\n15. EQUITY METHOD INVESTMENTS\nThe Company, through its wholly owned subsidiary, Cardinal One Carbon Holdings, LLC, owns a fifty percent interest in a limited partnership. That partnership was formed as a joint venture with another unrelated investor to investigate and pursue carbon dioxide capture and underground sequestration. The Company accounts for this investment using joint venture accounting and, therefore, under the equity method. Cardinal One Carbon Holdings, LLC was formed on June 22, 2022 to hold the partnership interest in the limited partnership and began its administrative operations on September 1, 2022.\nThe Company's policy related to investments in both common stock and in-substance common stock that give the Company the ability to exercise significant influence over the operating and financial polices of an entity in which it invests even though the Company holds 50% or less of the common stock or in-substance common stock (or both common and in-substance common stock) is to account for such investment under the equity method. The Company considers its financial position and results of operations in evaluating the extent of disclosures of the financial position and results of operations of an entity in which the Company invests.\nAs the Company owns a fifty percent interest in the limited partnership, an investment in affiliate of $5,651,166 and $396,279 was reflected on the consolidated balance sheet as of September 30, 2023 and 2022, respectively. A loss on equity method investment of $420,113 and $3,721 was reflected on the consolidated statement of operations for the year ended September 30, 2023 and 2022, respectively. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nBoulay PLLP (PCAOB ID #542) has been our independent auditor since the Company's inception and is the Company's independent auditor at the present time. We have had no disagreements with our auditor. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nOur management is responsible for maintaining disclosure controls and procedures that are designed to ensure that information required to be disclosed in the reports that the Company files or submits under the Securities Exchange Act of 1934, as amended (the Exchange Act) is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission's rules and forms. In addition, the disclosure controls and procedures must ensure that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required financial and other required disclosures.\nOur management, including our Chief Executive Officer (the principal executive officer), Jeffrey L. Painter, along with our Chief Financial Officer (the principal financial officer), William Dartt, have reviewed and evaluated the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) and Rule 15d-15(e) under the Exchange Act) as of September 30, 2023. Based on this review and evaluation, these officers have concluded that our disclosure controls and procedures are effective to ensure that information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods required by the forms and rules of the Securities and Exchange Commission; and to ensure that the information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to our management including our principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nInternal Control Over Financial Reporting\nInherent Limitations Over Internal Controls\nOur internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that:\n(i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n(ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of consolidated financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n(iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on the consolidated financial statements.\nManagement, including our Chief Executive Officer and Chief Financial Officer, does not expect that our internal controls will prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of internal controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Also, any evaluation of the effectiveness of\ncontrols in future periods are subject to the risk that those internal controls may become inadequate because of changes in business conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement's Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934, as amended). Management conducted an evaluation of the effectiveness of our internal control over financial reporting based on the criteria set forth in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this evaluation, management has concluded that our internal control over financial reporting was effective as of September 30, 2023.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. As we are a non-accelerated filer, management's report is not subject to attestation by our registered public accounting firm pursuant to Section 404(b) of the Sarbanes-Oxley Act of 2002 that permit us to provide only management's report in this annual report.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting during the fourth quarter of our 2023 fiscal year, which were identified in connection with managements evaluation required by paragraph (d) of rules 13a-15 and 15d-15 under the Exchange Act, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item is incorporated by reference from the definitive proxy statement for our 2024 Annual Meeting of Members to be filed with the Securities and Exchange Commission within 120 days after the end of our 2023 fiscal year. This proxy statement is referred to in this report as the 2024 Proxy Statement. ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this Item is incorporated by reference from the 2024 Proxy Statement. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED MEMBER MATTERS\nThe information required by this Item is incorporated by reference from the 2024 Proxy Statement. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated by reference from the 2024 Proxy Statement. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item is incorporated by reference from the 2024 Proxy Statement.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\nThe following exhibits and consolidated financial statements are filed as part of, or are incorporated by reference into, this report:\n(1)Consolidated Financial Statements\nThe consolidated financial statements appear beginning at page 43 of this report.\n(2)Financial Statement Schedules\nAll supplemental schedules are omitted as the required information is inapplicable or the information is presented in the consolidated financial statements or related notes.\n(3) Exhibits\nExhibit No. Exhibit Filed Herewith Incorporated by Reference\n3.1 Articles of Organization\nExhibit 3.1 to the registrant's registration statement on Form SB-2 (Commission File 333-131749) filed on February 10, 2006.\n3.1A Name Change Amendment\nExhibit 3.1A to the registrant's registration statement on Form SB-2 (Commission File 333-131749) filed on February 10, 2006.\n3.2 Second Amended and Restated Operating Agreement of the registrant\nExhibit 3.2 to the registrant's registration statement on Form SB-2 (Commission File 333-131749) filed on February 10, 2006.\n3.2A First Amendment to the Second Amended and Restated Operating Agreement dated February 20, 2018\nExhibit 3.1 to the registrant's Form 10-K filed with the Commission on May 8, 2018\n4.1 Form of Membership Unit Certificate.\nExhibit 4.1 to the registrant's registration statement on Form SB-2 (Commission File 333-131749) filed on February 10, 2006.\n4.2 Description of Membership Units contained within Registrant's Registration Statement on Form SB-2 (Commission File 333-131749) filed on February 10, 2006\nRegistrant's registration statement on Form SB-2 (Commission File 333-131749) filed on February 10, 2006.\n10.1 Distiller's Grain Marketing Agreement dated December 13, 2006 between Cardinal Ethanol, LLC and Commodity Specialist Company.\nExhibit 10.19 to the registrant's Form 10-KSB filed with the Commission on December 22, 2006.\n10.2 Ethanol Purchase and Sale Agreement dated December 18, 2006 between Cardinal Ethanol, LLC and Murex N.A., Ltd.\nExhibit 10.21 to the registrant's Form 10-KSB filed with the Commission on December 22, 2006.\n10.3 Letter of Credit Promissory Note and Continuing Letter of Credit Agreement dated December 19, 2006 between Cardinal Ethanol, LLC and First National Bank of Omaha.\nExhibit 10.25 to the registrant's Form 10-KSB filed with the Commission on December 22, 2006.\n10.4 Employment Agreement dated January 22, 2007 between Cardinal Ethanol, LLC and Jeff Painter.\nExhibit 10.29 to the registrant's Form 10-QSB filed with the Commission on February 14, 2007.\n10.5 Long Term Transportation Service Contract for Redelivery of Natural Gas between Ohio Valley Gas Corporation and Cardinal Ethanol, LLC dated March 20, 2007.\nExhibit 10.32 to the registrant's Form 10-QSB filed with the Commission on May 15, 2007.\n10.6 Agreement between Indiana Michigan Power Company and Cardinal Ethanol, LLC dated April 18, 2007.\nExhibit 10.33 to the registrant's Form 10-QSB filed with the Commission on May 15, 2007.\n10.7 Risk Management Agreement entered into between Cardinal Ethanol, LLC and John Stewart & Associates, Inc. dated July 16, 2007.\nExhibit 10.34 to the registrant's Form 10-QSB filed with the Commission on August 3, 2007.\n10.8 Consent to Assignment and Assumption of Marketing Agreement between Commodity Specialists Company and Cardinal Ethanol, LLC dated August 28, 2007.\nExhibit 10.37 to the registrant's Form 10-KSB filed with the Commission on December 17, 2007.\n10.9 Tricanter Installation and Purchase Agreement between ICM, Inc. and Cardinal Ethanol, LLC dated June 27, 2008.\nExhibit 10.1 to the registrant's Form 10-QSB filed with the Commission on August 14, 2008\n10.10 Amendment No 1 to Ethanol Purchase and Sale Agreement between Murex N.A., LTD and Cardinal Ethanol, LLC dated July 2, 2009.\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on July 7, 2009.\n10.11 Results Guarantee Agreement between Pavilion Technologies and Cardinal Ethanol, LLC dated September 30, 2009.\nExhibit 10.6 to the registrant's Form 10-K filed with the Commission on December 28, 2009.\n10.12 Amendment to Tricanter Purchase and Installation Agreement between ICM, Inc. and Cardinal Ethanol, LLC dated February 16, 2010.\nExhibit 10.1 to the registrant's Form 10-Q filed with the Commission on May 14, 2010.\n10.13 Carbon Dioxide Purchase and Sale Agreement between EPCO Carbon Dioxide Products, Inc. and Cardinal Ethanol, LLC dated March 8, 2010.\nExhibit 10.2 to the registrant's Form 10-Q filed with the Commission on May 14, 2010.\n10.14 Non-Exclusive Co2 Facility Site Lease Agreement between EPCO Carbon Dioxide Products, Inc and Cardinal Ethanol, LLC dated August 11, 2010.\nExhibit 10.1 to the registrant's Form 10-Q filed with the Commission on August 12, 2010.\n10.15 Amendment No. 2 to Ethanol Purchase and Sale Agreement between Cardinal Ethanol, LLC and Murex N.A., LTD. dated November 22, 2011.\nExhibit 10.35 to the registrant's Form 10-K filed with the Commission on December 13, 2011\n10.16 First Amendment to Carbon Dioxide Purchase and Sale Agreement between EPCO Carbon Dioxide Products, Inc. and Cardinal Ethanol, LLC dated November 22, 2011.\nExhibit 10.36 to the registrant's Form 10-K filed with the Commission on December 13, 2011\n10.17 First Amended and Restated Construction Loan Agreement between First National Bank of Omaha and Cardinal Ethanol, LLC dated June 10, 2013.\nExhibit 10.1 to the registrant's Form 10-Q filed with the Commission on August 7, 2013\n10.18 Second Amended and Restated Security Agreement between First National Bank of Omaha and Cardinal Ethanol, LLC dated June 10, 2013.\nExhibit 10.2 to the registrant's Form 10-Q filed with the Commission on August 7, 2013\n10.19 First Amended and Restated Security Agreement and Assignment of Hedging Accounts between First National Bank of Omaha and Cardinal Ethanol, LLC dated June 10, 2013.\nExhibit 10.3 to the registrant's Form 10-Q filed with the Commission on August 7, 2013\n10.20 First Amended and Restated Security Agreement and Assignment of Hedging Accounts between First National Bank of Omaha and Cardinal Ethanol, LLC dated June 10, 2013.\nExhibit 10.4 to the registrant's Form 10-Q filed with the Commission on August 7, 2013\n10.21 Revolving Credit Note between First National Bank of Omaha and Cardinal Ethanol, LLC dated June 10, 2013.\nExhibit 10.6 to the registrant's Form 10-Q filed with the Commission on August 7, 2013\n10.22 First Amended and Restated Construction Loan Mortgage, Security Agreement, Assignment of Leases and Rents and Fixture Financing Statement between First National Bank of Omaha and Cardinal Ethanol, LLC dated June 10, 2013.\nExhibit 10.7 to the registrant's Form 10-Q filed with the Commission on August 7, 2013\n10.23 Termination Agreement between First National Bank of Omaha and Cardinal Ethanol, LLC dated October 8, 2013.\nExhibit 10.39 to the registrant's Form10-K filed with the Commission on November 27, 2013.\n10.24 First Amendment of First Amended and Restated Construction Loan Agreement between First National Bank of Omaha and Cardinal Ethanol, LLC dated October 8, 2013.\nExhibit 10.40 to the registrant's Form10-K filed with the Commission on November 27, 2013.\n10.25 Second Amendment of First Amended and Restated Construction Loan Agreement between First National Bank of Omaha and Cardinal Ethanol, LLC dated February 27, 2014.\nExhibit 10.1 to the registrant's Form10-Q filed with the Commission on May 6, 2014.\n10.26 Capstone Energy Agreement\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on April 2, 2015.\n10.27 Fourth Amendment of First Amended and Restated Construction Loan Agreement dated effective March 31, 2015.\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on April 23, 2015.\n10.28 Third Amendment of First Amended and Restated Construction Loan Agreement dated effective February 28, 2015\nExhibit 10.1 to the registrant's Form10-Q filed with the Commission on May 5, 2015.\n10.29 Fifth Amendment of First Amended and Restated Construction Loan Agreement dated July 23, 2015\nExhibit 10.1 to the registrant's Form10-Q filed with the Commission on August 4, 2015.\n10.30 First Amendment of Amended and Restated Construction Loan Mortgage, Security Agreement, Assignment of Leases and Rents and Fixture Financing Statement dated July 23, 2015\nExhibit 10.3 to the registrant's Form10-Q filed with the Commission on August 4, 2015.\n10.31 Sixth Amendment of First Amended and Restate Construction Loan Agreement dated effective February 28, 2016\nExhibit 10.1 to the registrant's Form10-Q filed with the Commission on May 9, 2016.\n10.32 Seventh Amendment of First Amended and Restate Construction Loan Agreement dated effective May 6, 2016\nExhibit 10.2 to the registrant's Form10-Q filed with the Commission on May 9, 2016.\n10.33 Second Amendment of First Amended and Restated Construction Loan Mortgage, Security Agreement, Assignment of Leases and Rents and Fixture Financing Statement dated effective July 31, 2016\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on September 9, 2016\n10.34 Term Credit Note between First National Bank of Omaha and Cardinal Ethanol, LLC dated July 31, 2016\nExhibit 99.2 to the registrant's Form 8-K filed with the Commission on September 9, 2016\n10.35 Third Amended and Restated Declining Revolving Credit Note between First National Bank of Omaha and Cardinal Ethanol, LLC dated July 31, 2016\nExhibit 99.3 to the registrant's Form 8-K filed with the Commission on September 9, 2016\n10.36 Eighth Amendment of First Amended and Restated Construction Loan Agreement dated effective July 21, 2016\nExhibit 99.4 to the registrant's Form 8-K filed with the Commission on September 9, 2016\n10.37 Ninth Amendment of First Amended and Restated Construction Loan Agreement dated effective September 30, 2016\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on November 7, 2016\n10.38 Tenth Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha dated effective February 28, 2017.\nExhibit 10.1 to the registrant's Form10-Q filed with the Commission on May 8, 2017.\n10.39 Disbursing Agreement with First National Bank of Omaha dated effective February 28, 2017.\nExhibit 10.2 to the registrant's Form10-Q filed with the Commission on May 8, 2017.\n10.40 Construction Note with First National Bank of Omaha dated effective February 28, 2017.\nExhibit 10.3 to the registrant's Form10-Q filed with the Commission on May 8, 2017.\n10.41 Third Amendment of First Amended and Restated Construction Loan Mortgage, Security Agreement, Assignment of Leases and Rents and Fixture Financing Statement with First National Bank of Omaha dated effective February 28, 2017.\nExhibit 10.4 to the registrant's Form10-Q filed with the Commission on May 8, 2017.\n10.42 Eleventh Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha dated effective October 31, 2017\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on November 29, 2017\n10.43 Twelfth Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha dated effective January 29, 2018\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on January 30, 2018\n10.44 Grain Loadout Facility Term Note\nExhibit 99.2 to the registrant's Form 8-K filed with the Commission on January 30, 2018\n10.45 Thirteenth Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha dated effective February 28, 2018\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on February 28, 2018\n10.46 Amendment No. 3 to Ethanol Purchase and Sale Agreement with Murex LLC dated July 27, 2018+\nExhibit 10.47 to the registrant's Form 10-K filed with the Commission on November 21, 2018\n10.47 Fourteenth Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on March 8, 2019\n10.48 Security Agreement and Assignment of Hedging Accounts with First National Bank of Omaha\nExhibit 99.2 to the registrant's Form 8-K filed with the Commission on March 8, 2019\n10.49 Employee Bonus Plan, Amended and Restated for Fiscal Year 2019-2020\nExhibit 10.51 to the registrant's Form 10-K filed with the Commission on November 22, 2019\n10.50 Amended and Restated Employment Agreement dated January 1, 2020\nExhibit 10.1 to the registrant's Form 8-K filed with the Commission on January 23, 2020\n10.51 Fifteenth Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha\nExhibit 991. to the registrant's Form 8-K filed with the Commission on March 30, 2020\n10.52 Second Amendment to Carbon Dioxide Purchase and Sale Agreement between Cardinal Ethanol, LLC and Air Products and Chemicals, Inc.\nExhibit 10.52 to the registrant's Form 10-K filed with the Commission on November 18, 2020\n10.53 Employee Bonus Plan, Amended and Restated for Fiscal Year 2020-2021\nExhibit 10.53 to the registrant's Form 10-K filed with the Commission on November 18, 2020\n10.54 Sixteenth Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha.\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on February 4, 2021\n10.55 Seventeenth Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha.\nExhibit 10.1 to the registrant's Form 10-Q filed with the Commission on May 5, 2021\n10.56 Third Amendment to Carbon Dioxide Purchase and Sale Agreement with Air Products and Chemicals, Inc.\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on June 16, 2021\n10.57 Employee Bonus Plan, Amended and Restated for Fiscal Year 2021-2022\nExhibit 10.57 to the registrant's Form 10-K filed with the Commission on November 17, 2021\n10.58 Equipment Purchase and Installation Agreement dated January 20, 2022*\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on January 25, 2022\n10.59 Eighteenth Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on March 31, 2022\n10.60 Security Agreement with First National Bank of Omaha\nExhibit 99.2 to the registrant's Form 8-K filed with the Commission on March 31, 2022\n10.61 Fourth Amended and Restated Declining Revolving Credit Note\nExhibit 99.3 to the registrant's Form 8-K filed with the Commission on March 31, 2022\n10.62 Guaranty - First National Bank of Omaha\nExhibit 99.4 to the registrant's Form 8-K filed with the Commission on March 31, 2022\n10.63 Fourth Amendment of First Amended and Restated Construction Loan Mortgage, Security Agreement, Assignment of Leases and Rents and Fixture Financing Statement\nExhibit 99.5 to the registrant's Form 8-K filed with the Commission on March 31, 2022\n10.64 Fourth Amendment to Ethanol Purchase and Sale Agreement between Cardinal Ethanol and Murex, N.A., dated September 9, 2022*\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on September 16, 2022\n10.65 Employee Bonus Plan, Amended and Restated for Fiscal Year 2022-2023\nExhibit 10.65 to the registrant's Form 10-K filed with the Commission on December 1, 2022\n10.66 Limited Partnership Agreement of One Carbon Partnership Holdings LP dated January 16, 2023*\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on January 23, 2023.\n10.67 Amended and Restated Limited Liability Company Agreement of One Carbon Partnership GP LLC dated January 16, 2023*\nExhibit 99.2 to the registrant's Form 8-K filed with the Commission on January 23, 2023.\n10.68 Nineteenth Amendment of First Amended and Restated Construction Loan Agreement with First National Bank of Omaha dated February 21, 2023.\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on February 23, 2023.\n10.69 Fifth Amended and Restated Declining Revolving Credit Note dated February 21, 2023.\nExhibit 99.2 to the registrant's Form 8-K filed with the Commission on February 23, 2023.\n10.70 Fifth Amendment of First Amended and Restated Construction Loan Mortgage, Security Agreement, Assignment of Leases and Rents and Fixture Financing Statement dated February 21, 2023.\nExhibit 99.3 to the registrant's Form 8-K filed with the Commission on February 23, 2023.\n10.71 Asset Purchase Agreement between Cardinal Colwich, LLC and Element, LLC dated October 23, 2023.\nExhibit 99.1 to the registrant's Form 8-K filed with the Commission on October 24, 2023.\n10.72 Employee Bonus Plan Amended and Restated for Fiscal Year 2023-2024\nX\n14.1 Code of Ethics of Cardinal Ethanol, LLC.\nExhibit 14.1 to the registrant's Form 10-K filed with the Commission on December 13, 2012\n31.1 Certificate Pursuant to 17 CFR 240.13a-14(a)\nX\n31.2 Certificate Pursuant to 17 CFR 240.13a-14(a)\nX\n32.1 Certificate Pursuant to 18 U.S.C. Section 1350\nX\n32.2 Certificate Pursuant to 18 U.S.C. Section 1350\nX\n101 The following financial information from Cardinal Ethanol, LLC and Subsidiaries' Annual Report for the Fiscal Year Ended September 30, 2023, formatted in XBRL (eXtensible Business Reporting Language): (i) Consolidated Balance Sheets as of September 30, 2023 and September 30, 2022, (ii) Condensed Consolidated Statements of Operations for fiscal years ended September 30, 2023, 2022 and 2021, (iii) Consolidated Statements of Cash Flows for the fiscal years ended September 30, 2023, 2022, and 2021, (iv) Consolidated Statements of Changes in Members' Equity, and (iv) the Notes to Financial Statements.**\n101.INS Inline XBRL Instance Document - the instance document does not appear on the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH Inline XBRL Taxonomy Extension Schema Document.\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB Inline XBRL Taxonomy Extension Labels Linkbase Document.\n101.PRE Inline XBRL Presentation Linkbase Document.\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in the Interactive Data Files submitted as Exhibit 101).\n(+) Confidential Treatment Requested\n(X) Filed herewith\n(*) Confidential Information Redacted\n(**) Furnished herewith\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCARDINAL ETHANOL, LLC AND SUBSIDIARIES\nDate: November 30, 2023 /s/ Jeffrey L. Painter\nJeffrey L. Painter\nChief Executive Officer and President\n(Principal Executive Officer)\nDate: November 30, 2023 /s/ William Dartt\nWilliam Dartt\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the foregoing persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: November 30, 2023 /s/ Robert J. Davis\nRobert J. Davis, Chairman and Director\nDate: November 30, 2023 /s/ Dale Schwieterman\nDale Schwieterman, Director\nDate: November 30, 2023 /s/ Tom Chalfant\nTom Chalfant, Vice Chairman and Director\nDate: November 30, 2023\nJ. Phillip Zicht, Director\nDate: November 30, 2023 /s/ Danny Huston\nDanny Huston, Director\nDate: November 30, 2023 /s/ Thomas C. Chronister\nThomas C. Chronister, Secretary and Director\nDate: November 30, 2023\nDavid M. Dersch, Jr., Director\nDate: November 30, 2023 /s/ Steven J. Snider\nSteven J. Snider, Director\nDate: November 30, 2023 /s/ Daniel Sailer\nDaniel Sailer, Director\nDate:\nNovember 30, 2023\nAdam Kline, Director\nDate:\nNovember 30, 2023\nChad Smith, Director\nDate: November 30, 2023 /s/ Gerald Forsythe\nGerald Forsythe, Director\nDate: November 30, 2023 /s/ Robert Baker\nRobert Baker, Director\nDate: November 30, 2023 /s/ Lewis M. Roch III\nLewis M. Roch III, Director"
}