{
    "cik": "1357971",
    "company": "Energy Services of America CORP",
    "filing_type": "10-K",
    "filing_date": "2022-12-22",
    "period_of_report": "2022-09-30",
    "sic": "1623",
    "state_of_inc": "DE",
    "state_location": "WV",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1357971/0001410578-22-003581-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1357971/000141057822003581/esoa-20220930x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1357971/0001410578-22-003581.txt",
    "filename": "1357971_10K_2022_0001410578-22-003581.htm",
    "content": "ITEM 1.Business\nOverview\nEnergy Services of America Corporation (Energy Services or the Company), formed in 2006, is a contractor and service company that operates primarily in the mid-Atlantic and central regions of the United States and provides services to customers in the natural gas, petroleum, water distribution, automotive, chemical, and power industries. For the gas industry, the Company is primarily engaged in the construction, replacement and repair of natural gas pipelines and storage facilities for utility companies and private natural gas companies. Energy Services is involved in the construction of both interstate and intrastate pipelines, with an emphasis on the latter. For the oil industry, the Company provides a variety of services relating to pipeline, storage facilities and plant work. For the power, chemical, and automotive industries, the Company provides a full range of electrical and mechanical installations and repairs including substation and switchyard services, site preparation, equipment setting, pipe fabrication and installation, packaged buildings, transformers, and other ancillary work with regards thereto. Energy Services other services include liquid pipeline construction, pump station construction, production facility construction, water and sewer pipeline installations, various maintenance and repair services and other services related to pipeline construction. The Company has also added the ability to install residential, commercial, and industrial solar systems and perform civil and general contracting services.\nThe Company had consolidated operating revenues of $197.6 million for the fiscal year ended September 30, 2022, of which 43.5% was attributable to electrical, mechanical, and general contract services, 29.5% to gas and petroleum transmission projects, and 27.0% to gas & water distributions services. The Company had consolidated operating revenues of $122.5 million for the fiscal year ended September 30, 2021, of which 48.9% was attributable to electrical, mechanical, and general contract services, 33.0% to gas & water distributions services, and 18.1% to gas and petroleum transmission projects.\nEnergy Services customers include many of the leading companies in the industries it serves, including:\nTransCanada Corporation\nNiSource, Inc.\nMarathon Petroleum\nMountaineer Gas\nAmerican Electric Power\nToyota Motor Manufacturing\nBayer Chemical\nDow Chemical\nKentucky American Water\nWV American Water\nVarious state, county and municipal public service districts.\nThe majority of the Companys customers are in West Virginia, Virginia, Ohio, Pennsylvania, and Kentucky. However, the Company also performs work in other states including Alabama, Michigan, Illinois, Tennessee, and Indiana.\nEnergy Services sales force consists of industry professionals with significant relevant sales experience, who utilize industry contacts and available public data to determine how to market the Companys line of products most appropriately. The Company relies on direct contact between its sales force and customers engineering and contracting departments to obtain new business.\nA substantial portion of the Companys workforce are union members of various construction related trade unions and are subject to separately negotiated collective bargaining agreements that expire at varying time intervals. The Company believes its relationship with its unionized workforce is good.\nC.J. Hughes Construction Company, Inc. (C.J. Hughes), a wholly owned subsidiary of the Company, is a general contractor primarily engaged in pipeline construction for utility companies. Contractors Rental Corporation (Contractors Rental), a wholly owned subsidiary of C.J. Hughes, provides union building trade employees for projects managed by C.J. Hughes.\nNitro Construction Services, Inc. (Nitro), a wholly owned subsidiary of C.J. Hughes, provides electrical, mechanical, HVAC/R, solar installation, and fire protection services to customers primarily in the automotive, chemical, and power industries. Pinnacle Technical Solutions, Inc. (Pinnacle), a wholly owned subsidiary of Nitro, operates as a data storage facility within Nitros office building. Pinnacle is supported by Nitro and has no employees of its own.\nAll C.J. Hughes, Nitro, and Contractors Rental construction personnel are union members of various related construction trade unions and are subject to collective bargaining agreements that expire at varying time intervals.\nWest Virginia Pipeline, Inc. (West Virginia Pipeline or WVP), a wholly owned subsidiary of Energy Services, operates as a gas and water distribution contractor primarily in southern West Virginia. The employees of West Virginia Pipeline are non-union and are managed independently from the Companys union subsidiaries.\nSQP Construction Group, Inc. (SQP), a wholly owned subsidiary of Energy Services, operates as a general contractor primarily in West Virginia. SQP engages in the construction and renovation of buildings and other civil construction projects for state and local government agencies and commercial customers. As a general contractor, SQP manages the overall construction project and subcontracts most of the work. The employees of SQP are non-union and are managed independently from the Companys union subsidiaries.\nTri-State Paving & Sealcoating, Inc. (TSP or Tri-State Paving), a wholly owned subsidiary of Energy Services, completed the acquisition of substantially all of the assets of Tri-State Paving & Sealcoating, LLC (Tri-State Paving, LLC) on April 29, 2022. Tri-State Paving provides utility paving services to water distribution customers in the Charleston, West Virginia, Lexington, Kentucky, and Chattanooga, Tennessee markets. The employees of TSP are non-union and are managed independently from the Companys union subsidiaries.\nRyan Construction Services Inc. (Ryan Construction or RCS), a wholly owned subsidiary of Energy Services, formed in August 2022 in connection with the acquisition of substantially all of the assets of Ryan Environmental, LLC and Ryan Environmental Transport, LLC, provides directional drilling services for broadband service providers along with offering natural gas distribution services, cathodic protection and corrosion prevention services, and civil construction services. Ryan Construction operates primarily in West Virginia and Pennsylvania. The employees of RCS are non-union and are managed independently from the Companys union subsidiaries.\nThe Companys website address is www.energyservicesofamerica.com.\nRecent Events\nOn October 6, 2021, the Companys transfer agent completed the full redemption of all the Companys 6.0% Convertible Cumulative Perpetual Preferred Stock, Series A (Series A Preferred Stock), which resulted in the issuance of 2,626,492 new shares of the Companys common stock, the issuance of 317,500 common shares that were included in Series A Preferred Stock units, and cash redemption payments of $1.3 million. The Companys total outstanding common shares after redemption was 16,247,898 as of October 6, 2021.\nOn February 16, 2022, the stockholders of Energy Services approved the Companys 2022 Equity Incentive Plan (the Plan), which provides for the grant of stock-based awards to officers and employees of the Company and its subsidiaries. The maximum number of shares of stock, in the aggregate, that may be granted under the Plan as stock options, restricted stock or restricted stock units is 1,500,000 shares. A description of the material terms of the Plan is contained in the Companys definitive proxy statement for the Annual Meeting of Stockholders filed with the Securities and Exchange Commission on January 11, 2022. No grants of stock-based awards were made during the fiscal year ended September 30, 2022.\nOn March 23, 2022, the Companys common stock began trading on the Nasdaq Capital Market operated by The Nasdaq Stock Market, LLC under the symbol ESOA.\nPursuant to the Asset Purchase Agreement signed on April 6, 2022, and amended on April 29, 2022, the Company acquired substantially all the assets (including but not limited to customer contracts, employees, and equipment) of Tri-State Paving, LLC for $7.5 million in cash, a $1.0 million promissory note, and $1.0 million in Energy Services common stock. The $7.5 million in cash was funded through a loan with United Bank, Inc., Huntington, West Virginia (United Bank). The transaction resulted in the issuance of 419,287 common shares, bringing the total outstanding common shares to 16,667,185 as of April 29, 2022. David E. Corns continued his role as President of the Companys new subsidiary, Tri-State Paving, which earned revenues of $4.9 million for the fiscal year ended September 30, 2022.\nOn July 6, 2022, the Companys Board of Directors authorized a new share repurchase program (the Program), pursuant to which the Company may, from time to time, purchase shares of its common stock for an aggregate repurchase amount not to exceed 1,000,000 shares, which was approximately 6.0% of its outstanding common stock as of the date of the announcement. The Program does not obligate the Company to purchase any number of shares, and there is no guarantee as to the exact number of shares to be repurchased by the Company. No repurchases were made in connection with the Program during the fiscal year ended September 30, 2022.\nOn August 11, 2022, Ryan Construction Services Inc., a newly formed wholly owned subsidiary of Energy Services, completed the acquisition of Ryan Environmental, LLC (Ryan Environmental), located in Bridgeport, WV, pursuant to an order issued by the United States Bankruptcy Court for the Northern District of West Virginia (the Court) on August 9, 2022 and Ryan Environmental Transport, LLC (Ryan Transport), located in Bridgeport, West Virginia, under the terms of an Asset Purchase Agreement. As part of the business combination, the Company acquired certain assets, including equipment, vehicles, and small tools, of Ryan Environmental for $3.0 million in cash and certain assets, including equipment and small tools, of Ryan Transport for $1.0 million in cash.\nCOVID-19 Response\nFor the fiscal year ended September 30, 2022, the Company did not have significant issues with COVID-19 exposure among its employees and most of the Companys existing customers had resumed projects that were affected by COVID-19 shutdowns in fiscal 2021.\nSeasonality: Fluctuation of Results\nOur revenues and results of operations can and usually are subject to seasonal variations. These variations are the result of weather, customer spending patterns, bidding seasons and holidays. The first quarter of the calendar year is typically the slowest in terms of revenues because inclement weather conditions cause delays in production and customers usually do not plan large projects during that time. While usually better than the first quarter, the second calendar year quarter often has some inclement weather which can cause delays in production, reducing the revenues the Company receives and/or increasing the production costs. The third and fourth calendar year quarters usually are less impacted by weather and usually have the largest number of projects underway. Many projects are completed in the fourth calendar year quarter and revenues are often impacted by customers seeking to either spend their capital budget for the year or scale back projects due to capital budget overruns.\nIn addition to the fluctuations discussed above, the pipeline industry can be highly cyclical, reflecting variances in capital expenditures in proportion to energy price fluctuations. As a result, our volume of business may be adversely affected by where our customers are in the cycle and thereby their financial condition as to their capital needs and access to capital to finance those needs.\nAccordingly, our operating results in any quarter or year may not be indicative of the results that can be expected for any other quarter or any other year. You should read Managements Discussion and Analysis of Financial Condition and Results of Operations-Understanding Gross Margins below for discussions of trends and challenges that may affect our financial condition and results of operations.\nPaycheck Protection Program Loans\nDue to the economic uncertainties created by COVID-19 and limited operating funds available, the Company applied for loans under the Paycheck Protection Program (PPP). On April 15, 2020, Energy Services and subsidiaries, C.J. Hughes, Contractors Rental and Nitro entered into separate PPP notes effective April 7, 2020, with United Bank as the lender (Lender) in an aggregate principal amount of $13.1 million pursuant to the PPP (collectively, the PPP Loan). In a special meeting held on April 27, 2020, the Board of Directors of the Company unanimously voted to return $3.3 million of the PPP Loan funds after discussing the financing needs of the Company and subsidiaries. That left the Company and subsidiaries with $9.8 million in PPP Loans to fund operations.\nThe Small Business Administration (SBA) has announced, in consultation with the Department of the Treasury, that it will review all loans in excess of $2 million, following the lenders submission of the borrowers loan forgiveness application. The SBA will be reviewing a borrowers required certification that current economic uncertainty at the time of the loan made the PPP Loan request necessary to support the ongoing operations of the applicant. Borrowers must make this certification in good faith, taking into account their current business activity and their ability to access other sources of liquidity sufficient to support their ongoing operations in a manner that is not significantly detrimental to the business. The SBA has noted it is unlikely that a public company with substantial market value and access to capital markets will be able to make the required certification in good faith, and such a company should be prepared to demonstrate to the SBA, upon request, the basis for its certification.\nDuring fiscal year 2021, the Company received notice that the SBA had granted forgiveness of the $9.8 million of PPP borrowings and the SBA repaid the lending institution in full. The forgiveness was recorded as other income for the fiscal year ended September 30, 2021.\nBorrowers must retain PPP documentation for at least six years after the date the loan is forgiven or paid in full, and the SBA and SBA Inspector General must be granted these files upon request. The SBA could still revisit its forgiveness decision and determine that the Company does not qualify in whole or in part for loan forgiveness and demand repayment of the loans. In addition, it is unknown what type of penalties could be assessed against the Company if the SBA disagrees with the Companys certification. Any penalties in addition to the potential repayment of the PPP Loan could negatively impact the Companys business, financial condition and results of operations and prospects.\nThe Company has not received any notifications related to an audit; however, the Company has provided additional payroll costs information for two companies as requested by the SBA through the Companys lender. The Company has received no other requests or questions.\nBacklog/New Business\nThe Companys backlog represents contracts for services that have been entered into, but which have not yet been completed. At September 30, 2022, Energy Services had a backlog of $142.3 million of work to be completed on existing contracts. At September 30, 2021, the Company had a backlog of $72.2 million.\nDue to the timing of Energy Services construction contracts and the long-term nature of some of our projects, portions of our backlog work may not be completed in the current fiscal year. Most of the Companys projects can be completed in a short period of time, typically two to five months. Larger projects usually take seven to eighteen months to be completed. As a rule, work starts shortly after the signing of the contract.\nTypes of Contracts\nEnergy Services contracts are usually awarded on a competitive and negotiated basis. While some contracts may be lump sum or time and material projects, most of the work is bid based upon unit prices for various portions of the work with a total agreed-upon price based on estimated units. The actual revenues produced from the project will be dependent upon how accurate the customer estimates are as to the units of the various items.\nRaw Materials and Suppliers\nThe principal raw materials that the Company and its subsidiaries use are metal plate, structural steel, pipe, wire, fittings, and selected engineering equipment such as pumps, valves and compressors. For the most part, the largest portion of these materials are supplied by the customer. Purchases made by the Company are predominately those of a consumable nature, such as small tools, welding rod and environmental supplies. The COVID-19 pandemic has not had a significant impact on the Companys ability to obtain materials and consumables for projects awarded. We anticipate being able to obtain materials for current work, as well as any raw materials not supplied by our customers, for the foreseeable future. However, the inability of our customers to obtain raw materials may delay projects from being bid, awarded, started, or completed. Although not a significant impact, the Company has experienced minor delays resulting from the availability of construction equipment and vehicles.\nIndustry Factors\nEnergy Services revenues, cash flows and earnings are substantially dependent upon, and affected by, the level of natural gas exploration development activity and the levels of work on existing pipelines as well as the level of demand for our electrical and mechanical services. Such activity and the resulting level of demand for pipeline construction and related services and electrical and mechanical services are directly influenced by many factors over which the Company has no control. Such factors include the market prices of natural gas and electricity, market expectations about future prices, the volatility of such prices, the cost of producing and delivering natural gas and electricity, government regulations and trade restrictions, local and international political and economic conditions, the development of alternate energy sources, changes in the tax code that affect the energy industry, and the long-term effects of worldwide energy conservation measures. Energy Services cannot predict the future level of demand for its construction services, future conditions in the pipeline or electrical construction industry or future pipeline and electrical construction rates.\nCompetition\nThe pipeline, electrical, and mechanical construction industries are highly competitive and characterized by high capital and maintenance costs. Contracts are usually awarded through a competitive bid process. The Company believes that operators consider factors such as quality of service, type and location of equipment, or the ability to provide ancillary services. However, price and the ability to complete the project in a timely manner are the primary factors in determining which contractor is awarded a job. There are many regional and national competitors that offer services similar to Energy Services. Certain of the Companys competitors have greater financial and human resources than Energy Services, which may enable them to compete more efficiently because of price and technology. The Companys largest competitors are Otis Eastern, Miller Pipeline, Brown Electric, Summit Electric and Apex Pipeline.\nOperating Hazards and Insurance\nEnergy Services operations are subject to many hazards inherent in the pipeline, electrical, and mechanical construction businesses, including, for example, operating equipment in mountainous terrain, people working in deep trenches, people working near large construction equipment, and people working near manufacturing equipment and power sources. These hazards could cause personal injury or death, serious damage to or destruction of property and equipment, and substantial damage to the environment, including damage to producing formations and surrounding areas. Energy Services seeks protection against certain of these risks through insurance, including property casualty insurance on its equipment, commercial general liability and commercial contract indemnity, commercial umbrella and workers compensation insurance.\nThe Companys insurance coverage for property damage to its equipment is based on estimates of the cost of comparable used equipment to replace the insured property. There is a deductible per occurrence on equipment of $2,500 and $500 for damage to miscellaneous tools. The Company also maintains third party liability insurance, pollution and professional liability insurance, and a commercial umbrella policy. Energy Services believes that it is adequately insured for public liability and property damage to others with respect to its operations. However, such insurance may not be enough to protect Energy Services against liability for all consequences related to its operations.\nGovernment Regulation and Environmental Matters\nGeneral. Energy Services operations are affected from time to time in varying degrees by political developments and federal, state and local laws and regulations. In particular, natural gas production, operations and the profitability of the gas industry are or have been affected by price controls, taxes and other laws relating to the natural gas industry, by changes in such laws and by changes in administrative regulations. Although significant capital expenditures may be required to comply with such laws and regulations, to date, such compliance costs have not had a material adverse effect on the earnings or competitive position of Energy Services. In addition, Energy Services operations are vulnerable to risks arising from the numerous laws and regulations governing the discharge of materials into the environment or otherwise relating to environmental protection. Energy Services may also be affected by regulations designed to provide benefits to companies engaged in the production of alternative sources of energy, such as solar, wind, and related industries.\nEnvironmental Regulation. Energy Services activities are subject to existing federal, state and local laws and regulations governing environmental quality, pollution control and the preservation of natural resources. Such laws and regulations concern, among other things, the containment, disposal and recycling of waste materials, and reporting of the storage, use or release of certain chemicals or hazardous substances. Numerous federal and state environmental laws regulate drilling activities and impose liability for discharges of waste or spills, including those in coastal areas. The Company has conducted pipeline construction in or near ecologically sensitive areas, such as wetlands and coastal environments, which are subject to additional regulatory requirements. State and federal legislation also provide special protections to animal and marine life that could be affected by the Companys activities. In general, under various applicable environmental programs, the Company may potentially be subject to regulatory enforcement action in the form of injunctions, cease and desist orders and administrative, civil and criminal penalties for violations of environmental laws. Energy Services may also be subject to liability for natural resource damages and other civil claims arising out of a pollution event. The Company would be responsible for any pollution event that was determined to be caused by its actions. It has insurance that it believes is adequate to cover any such occurrences.\nEnvironmental regulations that affect Energy Services customers also have an indirect impact on Energy Services. Increasingly stringent environmental regulation of the natural gas industry has led to higher drilling costs and a more difficult and lengthier well permitting process.\nThe primary environmental statutory and regulatory programs that affect Energy Services operations include the following: Department of Transportation regulations, regulations set forth by agencies such as the Federal Energy Regulatory Commission and various environmental agencies including the Environmental Protection Agency, and state and local government agencies.\nHealth and Safety Matters. Energy Services facilities and operations are also governed by various other laws and regulations, including the federal Occupational Safety and Health Act, relating to worker health and workplace safety. The Occupational Safety and Health Administration has issued the Hazard Communication Standard. This standard applies to all private-sector employers, including the natural gas exploration and producing industry. The Hazard Communication Standard requires that employers assess their chemical hazards, obtain and maintain certain written descriptions of these hazards, develop a hazard communication program and train employees to work safely with the chemicals on site. Failure to comply with the requirements of the standard may result in administrative, civil and criminal penalties. Energy Services believes that appropriate precautions are taken to protect employees and others from harmful exposure to materials handled and managed at its facilities and that it operates in substantial compliance with all Occupational Safety and Health Act regulations. It is not anticipated that Energy Services will be required to make material expenditures by reason of such health and safety laws and regulations.\nResearch and Development/Intellectual Property\nEnergy Services has not made any material expenditure for research and development. Energy Services does not own any patents, trademarks or licenses.\nEmployees and Human Capital Resources\nEnergy Services of America believes the Companys greatest asset is its employees. The Companys emphasis on the health and safety of its employees is an important factor in maintaining its experienced workforce and attracting new talent. As of September 30, 2022, the Company had 1,055 employees including 353 full-time non-union employees.\nThe Companys non-union construction, management, and administrative employees are all eligible to participate in the Company paid health, vision, dental, life, prescription, and long-term disability insurance plans. The Company also provides employee paid supplemental life and accident insurance plans. To encourage employees to keep up with routine medical care and participate in its wellness program, the Company funds a Health Reimbursement Account for participating employees. To help employees cover medical expenses pre-tax, the Company offers employees a Flexible Spending Account. The Company also offers employees a 401(k)-retirement plan with a Company match.\nThe Companys union construction workers are represented by various collective bargaining units that provide health and welfare and retirement plans to their members. The Companys top priority is the safety of our construction employees. The Companys experienced safety department ensures that employees have the Company and customer required safety training before starting a project. Daily and weekly safety meetings at project sites help employees remain aware of potential hazards. Periodic internal and third-party safety audits are performed to help ensure that the Companys and customers safety procedures are followed.\nEarly in the COVID-19 pandemic, the Company had customers that delayed or cancelled projects due to the uncertainty in the economy and health concerns. During this time, the Company attempted to keep as many of its employees working as possible by moving crews to different projects or shifting work responsibilities. The Company also worked closely to accommodate employees request to use the Families First Coronavirus Relief Act and the Family Medical Leave Act. ITEM 1A.Risk Factors\nOur business is subject to a variety of risks and uncertainties, including, but not limited to, the risk and uncertainties described below. The risks and uncertainties described below are not the only ones we may face. Additional risks and uncertainties not known to us or not described below also may impair our business operations. If any of the following risks actually occur, our business financial condition and results of operations could be impacted, and we may not be able to achieve our expectations, projections, intentions or beliefs about future events that are intended as forward-looking statements under Private Securities Litigation Reform Act of 1995 and should be read in conjunction with the section entitled Forward looking statements.\nRisk Related to our Operations\nOur operating results may vary significantly from quarter to quarter.\nWe typically experience lower volumes and lower margins during the winter months due to lower demand for our pipeline services and more difficult operating conditions. Also, other items that can materially affect our quarterly results include:\n● Adverse weather;\n● Variations in the mix of our work in any quarter;\n● Shortage of qualified labor;\n● Unfavorable regional, national or global economic and market conditions;\n● A reduction in the demand for our services;\n● Changes in customer spending patterns and need for the services we provide;\n● Unanticipated increases in construction and design costs;\n● Timing and volume of work we perform;\n● Termination of existing agreements;\n● Losses experienced not covered by insurance;\n● Payment risks associated with customer financial condition;\n● Changes in bonding requirements of agreements;\n● Supply chain constraints;\n● Interest rate variations; and\n● Changes in accounting and financial reporting standards.\nFuture acquisitions could disrupt the Companys business and adversely affect our results of operations, financial condition and cash flows.\nIn fiscal 2022, the Company completed the acquisitions of Tri-State Paving and Ryan Construction. The Company may choose to expand by making additional acquisitions that could be material to its business, results of operations, financial condition and cash flows. Acquisitions involve many risks, including the following:\n● an acquisition may negatively affect the Companys results of operations, financial condition or cash flows because it may require us to incur charges or assume substantial debt or other liabilities, may cause adverse tax consequences or unfavorable accounting treatment, may expose us to claims and disputes by third parties, or may not generate sufficient financial return to offset additional costs and expenses related to the acquisition;\n● the Company may encounter difficulties or unforeseen expenditures in integrating the operations of any company that it acquires, particularly if key personnel of the acquired company decide not to work for us;\n● an acquisition may disrupt our ongoing business, divert resources, increase our expenses and distract our management;\n● an acquisition may involve the entry into geographic or business markets in which the Company has little or no prior experience or where competitors have stronger market positions;\n● if the Company incurs debt to fund such acquisition, such debt may subject us to material restrictions on our ability to conduct our business as well as financial maintenance covenants; and\n● to the extent that the Company issues a significant amount of equity securities in connection with future acquisitions, existing stockholders may be diluted and earnings per share may decrease.\nThe occurrence of any of these risks could have a material adverse effect on the Companys business, results of operations, financial condition and cash flows.\nRisk Related to our Business\nThe type of contracts we obtain could adversely affect our profitability.\nWe enter into various types of contracts, including fixed price and variable pricing contracts. On fixed price contracts our profits could be curtailed or eliminated by unanticipated pricing increases associated with the contract.\nA portion of our business depends on our ability to provide surety bonds. We may be unable to compete on certain projects if we are not able to obtain the necessary surety bonds.\nCurrent or future market conditions, including losses in the construction industry or as a result of large corporate bankruptcies, as well as changes in our surety providers assessment of our operating and financial risk, could cause our surety providers to decline to issue or renew, or substantially reduce the amount of bonds for our work or could increase our bonding costs. These actions could be taken on short notice. Since a growing number of our customers require such bonding, should our surety providers limit or eliminate our access to bonding, our performance could be negatively impacted if we are unable to replace the bonded business with work that does not require bonding or if we are unable to provide other means of securing the jobs performance such as with letters of credit or cash.\nMany of our contracts can be cancelled or delayed or may not be renewed upon completion.\nIf our customers should cancel or delay many projects, our revenues could be reduced if we are unable to replace these contracts with others. Also, we have contracts that expire and are renewed periodically. If we are unsuccessful in renewing those contracts, that could reduce our revenue as well.\nOur business requires a skilled labor force and if we are unable to attract and retain qualified employees, our ability to maintain our productivity could be impaired.\nOur productivity depends upon our ability to employ and maintain skilled personnel to meet our requirements. Should some of our key managers leave the Company, it could limit our productivity. Also, many of our labor personnel are trade union members. Should we encounter labor problems associated with our union employees or if we are unable to employ enough available operators, welders, or other skilled labor, our production could be significantly curtailed.\nOur backlog may not be realized.\nOur backlog could be reduced due to cancellation of projects by customers and/or reductions in scope of the projects. Should this occur, our anticipated revenues would be reduced unless we are able to replace those contracts.\nWe extend credit to customers for purchases of our services and therefore have risk that they may not be able to repay us.\nWhile we have not had any significant problems with collections of accounts receivables historically, should there be an economic downturn our customers ability to repay us could be compromised, and this may curtail our operations and ability to operate profitably.\nOur dependence on suppliers, subcontractors and equipment manufacturers could expose us to risk of loss in our operations.\nOn certain projects, we rely on suppliers to obtain the necessary materials and subcontractors to perform portions of our services. We also rely on equipment manufacturers to provide us with the equipment needed to conduct our operations. Any limitation on the availability of materials or equipment or failure to complete work on a timely basis by subcontractors in a quality fashion could lead to added costs and therefore lower profitability for the Company.\nWe face cybersecurity risk including the breach of confidential personal information, Company or customer intellectual properties, and delays related to data loss.\nInformation technology systems are critical to our business. We use various technology systems to manage our customer relationships, general ledger and other systems. Our computer systems, data management and internal processes, as well as those of third parties, are integral to our performance. Our operational risks include the risk of malfeasance by employees or persons outside our company, errors relating to transaction processing and technology, systems failures or interruptions, breaches of our internal control systems, and business continuation and disaster recovery. There have been increasing efforts by third parties to breach data security. Such attacks include computer viruses, malicious or destructive code, phishing attacks, denial of service or information or other security breaches that could result in the unauthorized release, gathering, monitoring, misuse, loss or destruction of confidential, proprietary and other information, damages to systems, or other material disruptions to network access or business operations. The Company uses industry-leading firewall hardware and runs anti-malware, antivirus, and anti-exploit solutions on all computers as a first line of defense to prevent security breaches. The Companys email software utilizes spam blocking, phishing filtering, and external sender warnings. The Company uses compartmentalized network drive access to mitigate ransomware damage and performs daily encrypted backups to secure offsite locations including a disaster recovery site.\nAlthough we take protective measures and believe that we have not experienced any of the data breaches described above, the security of our computer systems, software, and networks may be vulnerable to breaches, unauthorized access, misuse, computer viruses, or other malicious code and cyber-attacks that could have an impact on information security. Because the techniques used to cause security breaches change frequently, we may be unable to proactively address these techniques or to implement adequate preventative measures.\nInflation can have an adverse impact on our business and on our customers.\nInflation risk is the risk that the value of assets or income will be worth less in the future as inflation decreases the value of money. Recently, there have been market indicators of a pronounced rise in inflation and the Federal Reserve has raised certain benchmark interest rates in an effort to combat inflation. Inflation generally increases the cost of goods and services we will use in our business operations, such as electricity and other utilities, which increases our expenses. In addition, we may have to increase both wages to retain our employees and the cost of our services by a greater amount than we have budgeted. Furthermore, our customers will also be affected by inflation and the rising costs of goods and services used in their businesses, which could have a negative impact on their ability to use our services and afford to pay our fees.\nSocietal responses to climate change could adversely affect our business and performance, including indirectly through impacts on our customers.\nConcerns over the long-term impacts of climate change have led and will continue to lead to governmental efforts around the world to mitigate those impacts. Consumers and businesses also may change their behavior on their own as a result of these concerns. We and our customers will need to respond to new laws and regulations as well as consumer and business preferences resulting from climate change concerns. We and our customers may face cost increases, asset value reductions and operating process changes. The impact on our customers will likely vary depending on their specific attributes, including reliance on or role in carbon intensive activities. Among the impacts to us could be a drop in demand for our products and services, particularly in certain sectors. Our efforts to take these risks into account may not be effective in protecting us from the negative impact of new laws and regulations or changes in consumer or business behavior.\nRisk Related to the COVID-19 Pandemic\nWe have operations in multiple states and face risks related to the Coronavirus/COVID 19 global pandemic that could impact our results of operations.\nOur business could be adversely affected by the effects of the widespread outbreak of Coronavirus and related variants (COVID-19). The outbreak of COVID-19 and other adverse public health developments may have a material and adverse effect on our business operations. These could include disruptions or restrictions on our ability to travel or to complete our projects, as well as temporary closures of our facilities or the facilities of our suppliers or customers. Any disruption of our suppliers or customers would likely impact our operating results. In addition, the continued outbreak of COVID-19 could continue to adversely affect the economies of the states that we operate in resulting in a long-term economic downturn that could impact our operating results.\nThe SBA may review the Companys PPP Loan forgiveness application and if the SBA disagrees with the Companys certification the Company could be subject to penalties and the repayment of the PPP Loans, which could negatively impact the Companys business, financial condition and results of operations and prospects.\nIn fiscal year 2021, the Company received notification of forgiveness on the $9.8 million in PPP loans received in calendar year 2020. The Company must retain PPP loan documentation in its files for six years after the date of forgiveness. The Company believes it meets the SBAs certification requirement based on its limited access to capital, weakened business operations during the pandemic and small market value. The Companys shares of common stock did not trade on a national exchange at the time we applied for PPP loans and at the time such loans were forgiven by the SBA.\nThe Company has not received any notifications related to an audit; however, the Company has provided additional payroll costs information for two companies as requested by the SBA through the Companys lender. The Company has received no other requests or questions. However, no assurance can be given as to the outcome if the SBA re-evaluates the Companys loan certification. The SBA could determine that the Company does not qualify in whole or in part for loan forgiveness. In addition, it is unknown what type of penalties could be assessed against the Company if the SBA disagrees with the Companys certification. The Company could be required to repay its PPP Loans. Any penalties in addition to the potential repayment of the PPP Loans could negatively impact the Companys business, financial condition and results of operations and prospects.\nRisk Related to our Industry\nAn economic downturn in the industries we serve could lead to less demand for our services.\nIn addition to the effects of an economic recession, there could be reductions in the industries that the Company serves. If the demand for natural gas should drop dramatically, or the demand for electrical and mechanical services drops dramatically, these would in turn result in less demand for the Companys services.\nProject delays or cancellations may result in additional costs to us, reductions in revenues or the payment of liquidated damages.\nIn certain circumstances, we guarantee project completion by a scheduled acceptance date or are paid only upon achievement of certain acceptance and performance testing levels. Failure to meet any of these requirements could result in additional costs or penalties which could exceed the expected project profits.\nOur industry is highly competitive.\nOur industry has been and remains competitive with competitors ranging from small owner operated companies to large public companies. Within that group there may be companies with lower overhead costs that may be able to price their services at lower levels than we can. Accordingly, if that occurs, our business opportunities could be severely limited. In addition, our industry competes for energy demand with suppliers of alternative energy sources such as solar and wind.\nWe may be unsuccessful at generating internal growth.\nOur ability to generate internal growth will be affected by our ability to:\n● Attract new customers;\n● Expand our relationships with existing customers;\n● Hire and maintain qualified employees;\n● Expand geographically; and\n● Adjust quickly to changes in our industry.\nRisk Related to Financing\nCredit facilities to fund our operations and growth might not be available.\nOur business relies heavily on having lines of credit in place to fund the various projects we are working on. Should funding not be available, or on favorable terms, it could severely curtail our operations and the ability to generate profits. Energy Services maintains a banking relationship with two regional banks and has lines of credit and borrowing facilities with these institutions. On July 13, 2022, the Company renewed its $15.0 million operating line of credit with United Bank. Based on the borrowing base calculation, the Company could borrow up to $12.5 million as of September 30, 2022. The Company had borrowed $12.5 million on the line of credit as of September 30, 2022, leaving no borrowings available on the line of credit as of that date. The Company believes this line of credit will provide enough operating capital for future projects, but the Company and its lenders are working on a financing package that could expand the current operating line. The Company cannot guarantee it will always have access to this line of credit in the future depending on the Companys financial performance.\nRisk Related to our Financial Performance\nRevenue and cost estimates on projects may differ from actual results.\nThe preparation of these consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of revenues and expenses during the reporting period. We evaluate our estimates on an ongoing basis, based on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. While the Company believes estimates on project performance are materially correct at September 30, 2022, there can be no assurance that actual results will not differ from those estimates.\nRisk Related to Law and Regulatory Compliance\nDuring the ordinary course of business, we may become subject to lawsuits or indemnity claims, which could materially and adversely affect our business and results of operations.\nFrom time to time, we may in the ordinary course of business be named as a defendant in lawsuits, claims and other legal proceedings. These actions may seek, among other things, compensation for alleged personal injury, workers compensation, employment discrimination, breach of contract, property damages, civil penalties and other losses of injunctive or declaratory relief. Also, we often indemnify our customers for claims related to the services we provide and actions we take under our contracts with them. Because our services in certain instances may be integral to the operation and performance of our customers infrastructure, we may become subject to lawsuits or claims for any failure of the systems we work on. While we carry insurance to protect the Company against such claims, the outcomes of any of the lawsuits, claims or legal proceedings could result in significant costs and diversion of managements attention from the business. Payments of significant amounts, even if reserved, could adversely affect our reputation, liquidity and results of operations.\nWe may incur liabilities or suffer negative financial or reputational harm relating to occupational health and safety matters.\nOur operations are subject to extensive laws and regulations relating to the maintenance of safe conditions in the workplace. While we are constantly monitoring our health and safety programs, our industry involves a high degree of operating risk and there can be no assurance given that we will avoid significant liability exposure and/or be precluded from working for various customers due to high incident rates.\nChanges by the government in laws regulating the industries we serve could reduce our sales volumes.\nIf the government enacts legislation that has a serious impact on the industries we serve, it could lead to the curtailment of capital projects in those industries and therefore lead to lower sales volumes for our Company.\nOur failure to comply with environmental laws could result in significant liabilities.\nOur operations are subject to various environmental laws and regulations, including those dealing with the handling and disposal of waste products, polychlorinated biphenyls (PCBs) and other hazardous materials, as well as fuel storage. We also work around and under bodies of water. We invest significantly in compliance with the appropriate laws and regulations. However, if we should inadvertently cause contamination of waters or soils, liabilities for our Company relating to cleanup and remediation could be substantial and could exceed any insurance coverage we might have and result in a negative impact to the Companys ability to operate.\nRisks Relating to Ownership of Our Common Stock\nOur common stock is not heavily traded, and the stock price may fluctuate significantly.\nOur common stock is traded on the NASDAQ Capital Market under the symbol ESOA. Certain brokers currently make a market in the common stock, but such transactions are infrequent, and the volume of shares traded is relatively small. Management cannot predict whether these or other brokers will continue to make a market in our common stock. Prices on stock that is not heavily traded, such as our common stock, can be more volatile than heavily traded stock. Factors such as our financial results, the introduction of new products and services by us or our competitors, publicity regarding our industry, and various other factors may have a significant impact on the market price of the shares of the common stock. Management also cannot predict the extent to which an active public market for our common stock will develop or be sustained in the future. Accordingly, stockholders may not be able to sell their shares of our common stock at the volumes, prices, or times that they desire.\nOur directors beneficially own a significant portion of our common stock and have substantial influence over us.\nOur directors, as a group, beneficially owned approximately 36.1% of our outstanding shares of common stock as of September 30, 2022. As a result of this level of ownership, our directors have the ability, by taking coordinated action, to exercise significant influence over our affairs and policies. The interests of our directors may not be consistent with your interests as a stockholder. This influence may also have the effect of delaying or preventing changes of control or changes in management, or limiting the ability of our other stockholders to approve transactions that they may deem to be in the best interests of our Company. ITEM 1B.Unresolved Staff Comments\nNone. ITEM 2.Properties\nThe Company and its subsidiaries own the property where its subsidiaries, C.J. Hughes, Nitro, West Virginia Pipeline, SQP, Tri-State Paving and Ryan Construction and the Companys headquarters are located. We maintain our executive offices at 75 West 3rd Ave., Huntington, West Virginia 25701, which is also the offices of C.J. Hughes and Contractors Rental. Nitros office is located at 4300 1st Ave., Nitro, WV 25143. West Virginia Pipelines office is located at 300 Pipeline Road, Princeton, WV 24739. SQP leases its office space and is located at 281 Smiley Drive, St Albans, WV 25177. TSP leases its office space and is located at 3384 Teays Valley Rd, Hurricane, WV 25526. Ryan Construction leases its office space and is located at 5793 W. Veterans Memorial Highway, Bridgeport, WV 26330. The Companys management believes that its properties are adequate for the business it conducts. Please see Liquidity and Capital Resources for a description of the mortgages and leases on these properties. ITEM 3.Legal Proceedings\nIn February 2018, the Company filed a lawsuit against a former customer (Defendant) in the United States District Court for the Western District of Pennsylvania. The lawsuit is related to a dispute over work performed on a pipeline construction project. On November 21, 2022, a Judgment Order was issued, and the Company was awarded $13.1 million, of which $5.8 million was the jury award, $1.6 million was for attorneys fees, and $5.7 million was for penalties and interest. The amounts awarded by the Judgment Order have not been recognized in the Companys consolidated financial statements as of September 30, 2022. The Companys attorneys fees have been expensed as incurred. On December 16, 2022, the Defendant filed a notice of appeal with the court.\nOn November 12, 2021, the Company received a withdrawal liability claim from a pension plan to which the Company made pension contributions for union construction employees performing covered work in a particular jurisdiction. The Company has not performed covered work in their jurisdiction since 2011; however, the Company disagrees with the withdrawal claim and believes it is covered by an exemption under federal law. The demand called for thirty-four quarterly installment payments of $41,000 starting December 15, 2021. The Company must comply with the demand under federal pension law; however, the Company firmly believes no withdrawal liability exists. The Company is in negotiations with the pension fund to resolve the matter and all future payments have been suspended as part of the negotiation. The Company has expensed all $164,000 in payments made through September 30, 2022 and does not expect any future liabilities related to this claim.\nOther than described above, at September 30, 2022, the Company was not involved in any legal proceedings other than in the ordinary course of business. The Company is a party from time to time to various lawsuits, claims and other legal proceedings that arise in the ordinary course of business. These actions typically seek, among other things, compensation for alleged personal injury, breach of contract and/or property damages, punitive damages, civil penalties or other losses, or injunctive or declaratory relief. With respect to all such lawsuits, claims, and proceedings, we record reserves when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. At September 30, 2022, the Company does not believe that any of these proceedings, separately or in aggregate, would be expected to have a material adverse effect on our financial position, results of operations or cash flows. ITEM 4.Mine Safety Disclosures\nNone.\nPART II ITEM 5.\nMarket for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOn March 23, 2022, the Companys common stock began trading on the Nasdaq Capital Market operated by The Nasdaq Stock Market, LLC under the symbol ESOA. The Companys common stock had previously been traded under the symbol ESOA on the OTCQB Marketplace.\nThe following table sets forth the range of high and low sales prices for common stock during each of the last two fiscal years. The high and low bid price, as required to be disclosed by Regulation S-K, was not available for certain periods because either these were not two-sided quotes by market makers or there was only one market maker with a two-sided quote. Over the counter market quotations reflect inter-dealer prices, without retail mark-up, markdown or commission and may not necessarily represent actual transactions.\nCommon Stock\nFiscal 2021\nHigh\nLow\nDividends\nQuarter ended December 31, 2020\n$\n1.30\n$\n0.81\n$\n-\nQuarter ended March 31, 2021\n2.45\n1.02\n-\nQuarter ended June 30, 2021\n2.40\n1.96\n-\nQuarter ended September 30, 2021\n2.40\n1.62\n-\nFiscal 2022\nHigh\nLow\nDividends\nQuarter ended December 31, 2021\n$\n3.65\n$\n1.32\n$\n-\nQuarter ended March 31, 2022\n4.68\n2.30\n-\nQuarter ended June 30, 2022\n3.25\n1.90\n-\nQuarter ended September 30, 2022\n3.49\n1.77\n-\nAs of December 21, 2022, there were 31 holders of record of our common stock. Certain shares of the Companys common stock are held in nominee or street name and accordingly the number of beneficial owners of common stock is not included in the number of record holders.\nThe Company did not repurchase any stock during the twelve months ended September 30, 2022 and 2021.\nOn February 16, 2022, the stockholders of Energy Services approved the Companys 2022 Equity Incentive Plan (the Plan), which provides for the grant of stock-based awards to officers and employees of the Company and its subsidiaries. The maximum number of shares of stock, in the aggregate, that may be granted under the Plan as stock options, restricted stock or restricted stock units is 1,500,000 shares. A description of the material terms of the Plan is contained in the Companys definitive proxy statement for the Annual Meeting of Stockholders filed with the Securities and Exchange Commission on January 11, 2022. No grants of stock-based awards were made during the fiscal year ended September 30, 2022.\nOn July 6, 2022, the Companys Board of Directors authorized a new share repurchase program (the Program), pursuant to which the Company may, from time to time, purchase shares of its common stock for an aggregate repurchase amount not to exceed 1,000,000 shares, which was approximately 6.0% of its outstanding common stock as of the date of the announcement. The Program does not obligate the Company to purchase any number of shares, and there is no guarantee as to the exact number of shares to be repurchased by the Company. No repurchases were made in connection with the Program during the fiscal year ended September 30, 2022. ITEM 6. Reserved ITEM 7.Managements Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion of the financial condition and results of operations of Energy Services in conjunction with the historical financial statements and related notes contained elsewhere herein. Among other things, those historical consolidated financial statements include more detailed information regarding the basis of presentation for the following information.\nUnderstanding Gross Margins\nOur gross margin is gross profit expressed as a percentage of revenues. Cost of revenues consists primarily of salaries, wages and some benefits to employees, depreciation, fuel and other equipment costs, equipment rentals, subcontracted services, portions of insurance, facilities expense, materials and parts and supplies. Factors affecting gross margin include:\nSeasonal. As discussed above, seasonal patterns can have a significant impact on gross margins. Usually, business is slower in the winter months versus the warmer months.\nWeather. Adverse or favorable weather conditions can impact gross margin in each period. Periods of wet weather, snow or rainfall, as well as severe temperature extremes can severely impact production and therefore negatively impact revenues and margins. Conversely, periods of dry weather with moderate temperatures can positively impact revenues and margins due to the opportunity for increased production and efficiencies.\nRevenue Mix. The mix of revenues between customer types and types of work for various customers will impact gross margins. Some projects will have greater margins while others that are extremely competitive in bidding may have narrower margins.\nService and Maintenance versus Installation. In general, installation work has a higher gross margin than maintenance work. This is because installation work usually is of a fixed price nature and therefore has higher risks involved. Accordingly, a higher portion of the revenue mix from installation work typically will result in higher margins.\nSubcontract Work. Work that is subcontracted to other service providers generally has lower gross margins. Increases in subcontract work as a percentage of total revenues in each period may contribute to a decrease in gross margin.\nMaterials versus Labor. Typically, materials supplied on projects have lower margins than labor. Accordingly, projects with a higher material cost in relation to the entire job will have a lower overall margin.\nDepreciation. Depreciation is included in our cost of revenue. This is a common practice in our industry but can make comparability to other companies difficult.\nMargin Risk. Failure to properly execute a job including failure to properly manage and supervise a job could decrease the profit margin.\nSelling and Administrative Expenses\nSelling and administrative expenses consist primarily of compensation and related benefits to management, administrative salaries and benefits, marketing, communications, office and utility costs, professional fees, bad debt expense, letter of credit fees, general liability insurance and miscellaneous other expenses.\nResults of Operations for the Fiscal Year Ended September 30, 2022, Compared to the Fiscal Year Ended September 30, 2021.\nRevenue. A table comparing the components of the Companys revenues for the fiscal years ended September 30, 2022, and 2021 is below:\nFiscal Year Ended\nSeptember 30, 2022\n% of total\nSeptember 30, 2021\n% of total\nChange\n% Change\nGas & Water Distribution\n$\n53,311,569\n27.0\n%\n$\n40,440,195\n33.02\n%\n$\n12,871,374\n31.8\n%\nGas & Petroleum Transmission\n58,268,501\n29.5\n%\n22,133,483\n18.07\n%\n36,135,018\n163.3\n%\nElectrical, Mechanical, and General\n86,009,930\n43.5\n%\n59,892,148\n48.91\n%\n26,117,782\n43.6\n%\nTotal\n$\n197,590,000\n100.0\n%\n$\n122,465,826\n100.0\n%\n$\n75,124,174\n61.3\n%\nRevenue increased by $75.1 million, or 61.3%, to $197.6 million for the fiscal year ended September 30, 2022, from $122.5 million for the fiscal year ended September 30, 2021.\nGas & Water Distribution revenues totaled $53.3 million for the fiscal year ended September 30, 2022, a $12.9 million increase from $40.4 million for the fiscal year ended September 30, 2021. The revenue increase was primarily related to the Companys overall commitment to growing this line of business through adding new distribution crews and the acquisition of Tri-State Paving, which primarily provides services for water utility companies. Tri-State Paving, acquired on April 29, 2022, contributed revenues of $4.9 million for the fiscal year ended September 30, 2022. A full year of West Virginia Pipeline revenue, acquired on December 31, 2020, resulted in $3.1 million in additional revenue during fiscal year 2022 as compared to 2021.\nGas & Petroleum Transmission revenues totaled $58.3 million for the fiscal year ended September 30, 2022, a $36.1 million increase from $22.1 million for the fiscal year ended September 30, 2021. The revenue increase was primarily related to an increase in the amount of bidding opportunities with both existing, long-term customers and newer customers.\nElectrical, Mechanical, & General services and construction revenues totaled $86.0 million for the fiscal year ended September 30, 2022, a $26.1 million increase from $59.9 million for the fiscal year ended September 30, 2021. The revenue increase was primarily due to growth in general and civil construction opportunities for SQP, which began operations in March 2021 and increased revenues by $19.3 million in fiscal year 2022 as compared to 2021.\nCost of Revenues. A table comparing the components of the Companys costs of revenues for fiscal years ended September 30, 2022 and 2021, is below:\nFiscal Year Ended\nSeptember 30, 2022\n% of total\nSeptember 30, 2021\n% of total\nChange\n% Change\nGas & Water Distribution\n$\n41,726,934\n23.8\n%\n$\n32,467,794\n29.6\n%\n$\n9,259,140\n28.5\n%\nGas & Petroleum Transmission\n54,856,321\n31.3\n%\n17,237,245\n15.7\n%\n37,619,076\n218.2\n%\nElectrical, Mechanical, and General\n79,141,713\n45.2\n%\n55,574,528\n50.7\n%\n23,567,185\n42.4\n%\nUnallocated Shop (Profit) Expense\n(505,716)\n(0.3)\n%\n4,265,237\n3.9\n%\n(4,770,953)\n(111.9)\n%\nTotal\n$\n175,219,252\n100.0\n%\n$\n109,544,804\n100.0\n%\n$\n65,674,448\n60.0\n%\nTotal cost of revenues increased by $65.7 million or 60.0% to $175.2 million for the fiscal year ended September 30, 2022, from $109.5 million for the fiscal year ended September 30, 2021.\nGas & Water Distribution cost of revenues totaled $41.7 million for the fiscal year ended September 30, 2022, a $9.2 million increase from $32.5 million for the fiscal year ended September 30, 2021. The cost of revenues increase was primarily related to the Companys overall commitment to growing this line of business through adding new distribution crews and the acquisition of Tri-State Paving, which primarily provides services for water utility companies. Tri-State Paving, acquired on April 29, 2022, had cost of revenues of $3.1 million for the fiscal year ended September 30, 2022. A full year of West Virginia Pipeline cost of revenues, acquired on December 31, 2020, resulted in $1.8 million in additional cost of revenues during fiscal year 2022 as compared to 2021.\nGas & Petroleum Transmission cost of revenues totaled $54.9 million for the fiscal year ended September 30, 2022, a $37.7 million increase from $17.2 million for the fiscal year ended September 30, 2021. The cost of revenues increase was primarily related to an increase in the amount of bidding opportunities with both existing, long-term customers and newer customers. The Company has one gas transmission project that is projected to lose $2.1 million.\nElectrical, Mechanical, & General services and construction cost of revenues totaled $79.1 million for the fiscal year ended September 30, 2022, a $23.5 million increase from $55.6 million for the fiscal year ended September 30, 2021. The cost of revenues increase was primarily due to growth in general and civil construction opportunities for SQP, which began operations in March 2021 and increased costs of revenues by $16.4 million in fiscal year 2022 as compared to 2021.\nGross Profit. A table comparing the components of the Companys gross profit for fiscal years ended September 30, 2022, and 2021, is below:\nFiscal Year Ended\nSeptember 30, 2022\n% of revenue\nSeptember 30, 2021\n% of revenue\nChange\n% Change\nGas & Water Distribution\n$\n11,584,635\n51.8\n%\n$\n7,972,401\n61.7\n%\n$\n3,612,234\n45.3\n%\nGas & Petroleum Transmission\n3,412,180\n15.3\n%\n4,896,238\n37.9\n%\n(1,484,058)\n(30.3)\n%\nElectrical, Mechanical, and General\n6,868,217\n30.7\n%\n4,317,620\n33.4\n%\n2,550,597\n59.1\n%\nUnallocated Shop Profit (Expense)\n505,716\n2.3\n%\n(4,265,237)\n(33.0)\n%\n4,770,953\n(111.9)\n%\nTotal\n$\n22,370,748\n100.0\n%\n$\n12,921,022\n100.0\n%\n$\n9,449,726\n73.1\n%\nGross profit percentage\n11.3\n%\n10.6\n%\nTotal gross profit increased by $9.5 million or 73.1% to $22.4 million for the fiscal year ended September 30, 2022, from $12.9 million for the fiscal year ended September 30, 2021.\nGas & Water Distribution gross profit totaled $11.6 million for the fiscal year ended September 30, 2022, a $3.6 million increase from $8.0 million for the fiscal year ended September 30, 2021. The gross profit increase was primarily related to the Companys overall commitment to growing this line of business through adding new distribution crews and the acquisition of Tri-State Paving, which primarily provides services for water utility companies. Tri-State Paving, acquired on April 29, 2022, contributed gross profit of $1.8 million for the fiscal year ended September 30, 2022. A full year of West Virginia Pipeline gross profit, acquired on December 31, 2020, resulted in $1.3 million in additional gross profit during the fiscal year 2022 as compared to 2021.\nGas & Petroleum Transmission gross profit totaled $3.4 million for the fiscal year ended September 30, 2022, a $1.5 million decrease from $4.9 million for the fiscal year ended September 30, 2021. The gross profit decrease was primarily related to one gas transmission project that is projected to lose $2.1 million.\nElectrical, Mechanical, & General services and construction gross profit totaled $6.9 million for the fiscal year ended September 30, 2022, a $2.6 million increase from $4.3 million for the fiscal year ended September 30, 2021. The gross profit increase was primarily due to growth in general and civil construction opportunities for SQP, which began operations in March 2021 and increased gross profit by $3.0 million in the fiscal year 2022 as compared to 2021.\nGross profit attributed to unallocated shop operations totaled $506,000 for the fiscal year ended September 30, 2022, a $4.8 million increase from $4.3 million in unallocated shop expenses for the fiscal year ended September 30, 2021. The gross profit increase was primarily due to increased internal equipment charges to projects and better project costs tracking for the fiscal year ended September 30, 2022, as compared to 2021.\nSelling and administrative expenses. Total selling and administrative expenses increased by $1.9 million to $15.9 million for the fiscal year ended September 30, 2022, from $14.0 million for the fiscal year ended September 30, 2021. Approximately $700,000 of the selling and administrative expense increase for the fiscal year ended September 30, 2022 as compared to the prior fiscal year, was from the operations of the new subsidiaries, Tri-State Paving and Ryan Construction. In addition, the Company incurred approximately $1.6 in million additional selling and administrative expenses related to a full twelve months of activity for West Virginia Pipeline and SQP in the fiscal year 2022 as compared to 2021.\nIncome from operations. Income from operations was $6.5 million for the fiscal year ended September 30, 2022, a $7.6 million increase from a $1.1 million loss from operations for the fiscal year ended September 30, 2021. The increase was due to the items described above.\nInterest Expense. Interest expense increased by $331,000 or 59.3% to $888,000 for the fiscal year ended September 30, 2022, from $557,000 for the fiscal year ended September 30, 2021. This increase was primarily due to increased line of credit borrowings and financing the financing of acquisitions.\nOther Income. Other income totaled $507,000 for the fiscal year ended September 30, 2022, as compared to other income of $10.7 million for the fiscal year ended September 30, 2021. The decrease in other income was primarily related to $9.8 million of PPP loan debt forgiveness recognized during the fiscal year ended September 30, 2021. Please see the Paycheck Protection Program Loans disclosure on page 9.\nNet Income. Income before income taxes was $6.1 million for the fiscal year ended September 30, 2022, compared to $9.1 million for the fiscal year ended September 30, 2021. The $3.0 million decrease was primarily due to a one-time $9.8 million PPP loan debt forgiveness in the fiscal year 2021, partially offset by a $7.6 million increase in income from operations.\nThe income tax expense for fiscal year ended September 30, 2022 was $2.3 million compared to an income tax benefit of ($29,000) for the fiscal year ended September 30, 2021. The increase was due to an increase in taxable income. According to the Coronavirus Aid, Relief, and Economic Security Act (CARES Act) passed by Congress in March 2020, PPP loan forgiveness is not taxable. In accordance with the Consolidated Appropriations Act, 2021, the Companys PPP related expenditures in the fiscal year 2020 were considered deductible expenses for federal income tax purposes.\nThe effective income tax rate for the fiscal year ended September 30, 2022 was 37.0%. The effective income tax rate for the fiscal year ended September 30, 2021, was (0.32%). The PPP forgiveness had a significant impact on the effective income tax rate for the fiscal year ended September 30, 2021, as taxable income was decreased by $9.8 million. Effective income tax rates are estimates and may vary from period to period due to changes in the amount of taxable income or loss, non-taxable items and nondeductible expenses.\nDividends on preferred stock for the fiscal years ended September 30, 2022, and 2021 were $0 and $284,000, respectively. There will be no further dividends paid on preferred stock after the October 6, 2021 redemption of all the Companys preferred stock.\nNet income available to common stockholders for the fiscal year ended September 30, 2022 was $3.9 million compared to $8.8 million for the fiscal year ended September 30, 2021. The decrease was due to the items mentioned above.\nComparison of Financial Condition at September 30, 2022 Compared to September 30, 2021.\nThe Company had total assets of $112.6 million at September 30, 2022, an increase of $42.4 million from the prior the fiscal year-end balance of $70.2 million.\nThe aggregate balance of accounts receivable, retainages receivable, allowance for doubtful accounts and other receivables totaled $42.9 million at September 30, 2022, an increase of $20.4 million from the combined prior the fiscal year-end balance of $22.5 million. The increase was primarily due to increased work in the fiscal year 2022 as compared to 2021. Specifically, $69.4 million in revenue was generated in the fourth quarter of fiscal year 2022 as compared to $39.6 million for the same period in 2021.\nNet property, plant and equipment totaled $32.7 million at September 30, 2022, an increase of $9.7 million from the prior the fiscal year-end balance of $23.0 million. Property, plant and equipment acquisitions totaled $15.6 million for the fiscal year 2022 while depreciation expense was $5.6 million, and the net impact of disposals was $316,000. Assets received as part of the Tri-State Paving and Ryan Construction acquisitions accounted for $8.9 million of the $15.6 million in total acquisitions.\nContract assets totaled $16.1 million at September 30, 2022, an increase of $7.4 million from the prior the fiscal year-end balance of $8.7 million. This increase was primarily due to increased work and the timing of project billings and related increase in costs and estimated earnings in excess of billings at September 30, 2022 as compared to at September 30, 2021.\nGoodwill and acquired intangible assets totaled $8.0 million at September 30, 2022, a $3.7 million increase from the prior fiscal year end balance of $4.2 million. The increase to goodwill and acquired intangible assets was primarily the result of the Tri-State Paving acquisition which goodwill and acquired intangible assets totaled $4.2 million at September 30, 2022, and was partially offset by $445,000 in amortization expense for fiscal year 2022.\nRight-of-use assets acquired from operating leases totaled $1.6 million net of amortization expense, as compared to no right-to-use assets at the prior the fiscal year end. The operating leases were primarily related to the business combinations completed in the fiscal year ended September 30, 2022.\nPrepaid expenses and other totaled $3.9 million at September 30, 2022, an increase of $401,000 from the prior the fiscal year-end balance of $3.5 million. The increase was primarily due to the increase of various prepaid insurance accounts based on labor cost expensed or standard monthly charges.\nCash and cash equivalents totaled $7.4 million at September 30, 2022, a decrease of $799,000 from the prior the fiscal year-end balance of $8.2 million. The decrease was primarily related to a net $8.3 million investment in property and equipment, $4.3 million in long-term debt repayments, and $1.2 million in preferred stock conversion payments, partially offset by a net $4.7 million increase in line of credit and short-term borrowings and $8.3 million in net cash provided by operating activities.\nLiabilities totaled $74.3 million at September 30, 2022, an increase of $38.8 million from the prior the fiscal year-end balance of $35.5 million.\nAccounts payable totaled $20.3 million as of September 30, 2022, an increase of $13.0 million from the prior the fiscal year-end balance of $7.3 million. The increase was due to more work in progress at the end of the fiscal year 2022, as compared to the same period in fiscal 2021.\nLines of credit and short-term borrowings totaled $13.1 million at September 30, 2022, an increase of $8.1 million from the prior the fiscal year-end balance of $5.0 million. This increase was primarily due to increased borrowings against the Companys operating line of credit because or more work in progress at the end of the fiscal year 2022, as compared to the same period in fiscal 2021.\nAccrued expenses and other current liabilities totaled $11.3 million at September 30, 2022, an increase of $5.7 million from the prior the fiscal year-end balance of $5.6 million. The increase was primarily due to increased labor and burden expenses incurred towards the end of the fiscal year 2022, as compared to the same period in fiscal 2021.\nThe aggregate balance of current maturities of long-term debt and long-term debt totaled $17.6 million at September 30, 2022, an increase of $5.2 million from the prior the fiscal year-end balance of $12.4 million. The increase was primarily due to a $8.4 million increase related to financing the Tri-State Paving acquisition and $940,000 in equipment financing, partially offset by $4.3 million in payments on long-term debt.\nContract liabilities totaled $6.0 million at September 30, 2022, an increase of $2.8 million from the prior the fiscal year-end balance of $3.2 million. This increase was due to increased billings in excess of costs and earnings when computing earned revenue on construction projects at September 30, 2022, as compared to at September 30, 2021.\nOperating lease liabilities totaled $1.6 million at September 30, 2022, an increase of $1.6 million from the prior fiscal year end balance. See Leases on page 29 for a discussion of operating leases added in the fiscal year 2022.\nNet deferred income tax payable totaled 4.5 million at September 30, 2022, an increase of $2.5 million from the prior the fiscal year-end balance of $2.0 million. The increase was primarily related to a net operating loss (NOL) carryforward resulting from bonus depreciation on acquired assets.\nStockholders equity totaled $38.3 million at September 30, 2022, an increase of $3.7 million from the prior the fiscal year-end balance of $34.6 million. This increase was primarily due to $3.9 million in net income and a $1.0 million increase in additional paid in capital related to stock issued as part of the Tri-State Paving acquisition, partially offset by $1.2 million in preferred stock redemption payments.\nLiquidity and Capital Resources\nOperating Line of Credit and Short-Term Borrowings\nOn July 13, 2022, the Company received a one-year extension on its operating line of credit effective June 28, 2022. The $15.0 million revolving line of credit has a $12.5 million component and a $2.5 million component. The Company can borrow from the $12.5 million component first and then from the additional $2.5 million component if additional requirements are met. The covenant requirements for both components are below. Based on the borrowing base calculation, the Company borrowed all $12.5 million available on the line of credit as of September 30, 2022. The Company did not meet the requirements to borrow any from the $2.5 million component. The Company expects to receive an amendment to increase its line of credit by December 31, 2022.\nThe interest rate on the line of credit is the Wall Street Journal Prime Rate (the index) with a floor of 4.99%. The interest rate at September 30, 2022, was 5.5%. Based on the borrowing base calculation, the Company was able to borrow up to $12.2 million as of September 30, 2021. The Company had $4.5 million in borrowings on the line of credit, leaving $7.7 million available on the line of credit as of September 30, 2021. The interest rate at September 30, 2021, was 4.99%.\nMajor items excluded from the borrowing base calculation are receivables from bonded jobs and retainage as well as all items greater than ninety (90) days old. Line of credit borrowings are collateralized by the Companys accounts receivable. Cash available under the line is calculated based on 70.0% of the Companys eligible accounts receivable.\nUnder the terms of the agreement, the Company must meet the following loan covenants to access the first $12.5 million:\n1. Minimum tangible net worth of $21.5 million to be measured quarterly,\n2. Minimum traditional debt service coverage of 1.25x to be measured quarterly on a rolling twelve- month basis,\n3. Minimum current ratio of 1.50x to be measured quarterly,\n4. Maximum debt to tangible net worth ratio (TNW) of 1.5x to be measured semi-annually,\n5. Full review of accounts receivable aging report and work in progress. The results of the review shall be satisfactory to the lender in its sole and unfettered discretion.\nUnder the terms of the agreement, the Company must meet the following additional requirements for draw requests causing the borrowings to exceed $12.5 million:\n1. Minimum traditional debt service coverage of 2.0x to be measured quarterly on a rolling twelve-month basis,\n2. Minimum tangible net worth of $24.0 million to be measured quarterly.\nThe Company was not in compliance with all covenants but received a waiver on the $12.5 million component of the line of credit at September 30, 2022. The Company projects to be in compliance with all covenants associated with the $12.5 million component for the next twelve months.\nThe Company also finances insurance policy premiums on a short-term basis through a financing company. These insurance policies include workers compensation, general liability, automobile, umbrella, and equipment policies. The Company makes a down payment in January and finances the remaining premium amount over ten monthly payments. In January 2022 and 2021, respectively, the Company financed $3.4 million and $3.2 million in insurance premiums. At September 30, 2022 and 2021, respectively, the remaining balance of the insurance premiums was $580,000 and $540,000.\nLong-Term Debt\nOn December 16, 2014, the Companys Nitro subsidiary entered into a 20-year $1.2 million loan agreement with a bank to purchase the office building and property it had previously been leasing for $6,300 monthly. The interest rate on this loan agreement is 4.82% with monthly payments of $7,800. The interest rate on this note is subject to change from time to time based on changes in the U.S. Treasury yield, adjusted to a constant maturity of three years as published by the Federal Reserve weekly. As of September 30, 2022, the Company had made principal payments of $333,000. The loan is collateralized by the building purchased under this agreement. The note is currently held by Peoples Bank, Inc., formerly First Bank of Charleston, Inc. (West Virginia).\nOn November 13, 2015, the Company entered into a 10-year $1.1 million loan agreement with United Bank to purchase the fabrication shop and property Nitro had previously been leasing for $12,900 each month. The variable interest rate on the loan agreement is 7.25% at September 30, 2022 with monthly payments of $12,193. As of September 30, 2022, the Company had made principal payments of $687,000. The loan is collateralized by the building and property purchased under this agreement.\nOn June 28, 2017, the Company entered into a $5.0 million Non-Revolving Note agreement with United Bank. This five-year agreement gave the Company access to a $5.0 million line of credit (Equipment Line of Credit 2017), specifically for the purchase of equipment, for a period of three months with an interest rate of 4.99%. After three months, all borrowings against the Equipment Line of Credit 2017 were converted to a five-year term note agreement with an interest rate of 4.99% with monthly payments of $98,865. As of September 30, 2022, the Company had repaid this note in full.\nOn December 31, 2020, West Virginia Pipeline Acquisition Company, later renamed West Virginia Pipeline, Inc., entered into a $3.0 million sellers note agreement with David and Daniel Bolton for the remaining purchase price of West Virginia Pipeline, Inc. For the purchase price allocation, the $3.0 million note had a fair value of $2.85 million. As part of the $6.35 million acquisition price, the Company paid $3.5 million in cash in addition to the note. The unsecured five-year term note requires annual payments of at least $500,000 with a fixed interest rate of 3.25% on the $3.0 million sellers note, which equates to 5.35% on the carrying value of the note. As of September 30, 2022, the Company had made annual installment payments of $500,000, interest payments of $152,000 and expensed $53,000 in accreted interest.\nOn January 4, 2021, the Company entered into a $3.0 million Non-Revolving Note agreement with United Bank. This five-year agreement gave the Company access to a $3.0 million line of credit (Equipment Line of Credit 2021), specifically for the purchase of equipment, for a period of twelve months with a variable interest rate initially established at 4.25% as based on the Prime Rate as published by The Wall Street Journal. After twelve months, all borrowings against the Equipment Line of Credit 2021 were converted to a four-year term note agreement with a variable interest rate initially established at 4.25%. The loan is collateralized by the equipment purchased under this agreement. As of September 30, 2022, the Company borrowed $3.0 million against this line of credit with monthly payments of $68,150 that started in February 2022. The interest rate at September 30, 2022 was 7.25%. The Company has made principal payments of $451,000 on this note as of September 30, 2022.\nOn April 2, 2021, the Company entered into a $3.5 million Non-Revolving Note agreement with United Bank. This five-year agreement repaid the outstanding $3.5 million line of credit that was used for the down payment on the West Virginia Pipeline acquisition. This loan has monthly installment payments of $64,853 and has a fixed interest rate of 4.25%. The loan is collateralized by the Companys equipment and receivables. As of September 30, 2022, the Company had made principal payments of $971,000.\nOn April 29, 2022, the Company entered into a $7.5 million Non-Revolving Note agreement with United Bank. This five-year agreement was used to finance the purchase of Tri-State Paving and has monthly payments of $129,910 with a fixed interest rate of 4.25%. The Company has made principal payments of $518,000 on this note as of September 30, 2022.\nOn April 29, 2022, the Company entered into a $1.0 million promissory note agreement with Corns Enterprises, a related party, as partial consideration for the purchase of Tri-State Paving. This four-year agreement requires $250,000 principal installment payments on or before the end of each twelve (12) full calendar month period beginning April 29, 2022. Interest payments due shall be calculated on the principal balance remaining and shall be at the stated rate of 3.5% per year. The Company recorded $7,800 in accreted interest and has not made any principal payments on this note as of September 30, 2022.\nThe maturities of long-term and short-term debt, which includes line of credit borrowings, term notes payable to banks, and notes payable on various equipment purchases, were as follows:\n$\n17,140,336\n4,061,665\n4,170,114\n3,569,091\n1,069,272\nThereafter\n623,942\n$\n30,634,420\nAs of September 30, 2022, the Company had $7.4 million in cash and $15.1 million in working capital (defined as current assets less current liabilities).\nLeases\nThe Company leases office space for SQP for $1,500 per month. The lease, signed on March 25, 2021, is for a period of two years with five one-year renewals available immediately following the end of the base term. Rental terms for the option periods shall be negotiated and agreed mutually between the parties and shall not exceed five percent increases to rent, if any. The lease is expensed monthly and not treated as a right-to-use asset as it does not have a material impact on the Companys consolidated financial statements.\nDuring fiscal year ended September 30, 2022, the Company entered into two lease agreements for construction equipment for a combined $160,000. The leases have a term of twenty-two months with a stated interest rate of 0%, combined monthly installment payments of $6,645 and are cancellable at any time without penalty. The Company has the right to purchase the equipment at the expiration of the leases by applying the two-month deposit paid. The right-of-use assets and finance lease obligations associated with these lease agreements are included in the consolidated balance sheets within property, plant and equipment and long-term debt, respectively, and do not have a material impact on the Companys consolidated financial statements.\nThe Company has two right-of-use operating leases acquired on April 29, 2022, as part of the Tri-State Paving transaction. The first operating lease, for the Hurricane, WV facility, had a net present value of $236,000 at April 29, 2022, and a carrying value of $205,000 at September 30, 2022. The second operating lease, for the Chattanooga, Tennessee facility, had a net present value of $144,000 at April 29, 2022, and a carrying value of $119,000 at September 30, 2022. The 4.5% interest rate on the operating leases is based on the Companys incremental borrowing rate at inception.\nThe Company has a right-of-use operating lease with Enterprise Fleet Management, Inc. acquired on August 11, 2022, as part of the Ryan Environmental acquisition. This lease agreement was initially for 31 vehicles to be used for Ryan Construction; however, the Company plans to add vehicles as it finds necessary. This lease had a net present value of $1.2 million at inception, which approximates the carrying value at September 30, 2022. The 4.5% interest rate on the operating lease is based on the Companys incremental borrowing rate at inception.\nThe Company has a right-of-use operating lease with RICA Developers, LLC acquired on August 12, 2022, as part of the Ryan Environmental acquisition. This lease, for the Bridgeport, WV facility, had a net present value of $140,000 at inception and a carrying value of $113,000 at September 30, 2022. The 4.5% interest rate on the operating lease is based on the Companys incremental borrowing rate at inception.\nThe maturities of the Companys operating lease liabilities were as follows:\n$\n588,653\n465,428\n373,397\n296,606\n1,724,084\nLess amounts representing interest\n(119,807)\nPresent value of operating lease liabilities\n$\n1,604,277\nOff-Balance Sheet Transactions\nDue to the nature of our industry, we often enter into certain off-balance sheet arrangements in the ordinary course of business that result in risks not directly reflected on our balance sheets. Though for the most part not material in nature, some of these are:\nRental Agreements\nThe Company rents equipment for use on construction projects with rental agreements being week to week or month to month. Rental expense can vary by the fiscal year due to equipment requirements on construction projects and the availability of Company owned equipment. Rental expense, which is included in cost of goods sold on the consolidated statements of income, was $9.8 million and $3.6 million for the twelve months ended September 30, 2022, and 2021, respectively.\nLetters of Credit\nCertain of our customers or vendors may require letters of credit to secure payments that the vendors are making on our behalf or to secure payments to subcontractors, vendors, etc. on various customer projects. At September 30, 2022, the Company did not have any outstanding letters of credit.\nPerformance Bonds\nSome customers, particularly new ones or governmental agencies require the Company to post bid bonds, performance bonds and payment bonds (collectively, performance bonds). These performance bonds are obtained through insurance carriers and guarantee to the customer that we will perform under the terms of a contract and that we will pay subcontractors and vendors. If the Company fails to perform under a contract or to pay subcontractors and vendors, the customer may demand that the insurer make payments or provide services under the bond. The Company must reimburse the insurer for any expenses or outlays it is required to make.\nCurrently, the Company has an agreement with a surety company to provide bonding which will suit the Companys immediate needs. The ability to obtain bonding for future contracts is an important factor in the contracting industry with respect to the type and value of contracts that can be bid. Depending upon the size and conditions of a particular contract, the Company may be required to post letters of credit or other collateral in favor of the insurer. Posting of these letters or other collateral will reduce our borrowing capabilities. The Company does not anticipate any claims in the foreseeable future. At September 30, 2022, the Company had $82.8 million in performance bonds outstanding.\nConcentration of Credit Risk\nIn the ordinary course of business, the Company grants credit under normal payment terms, generally without collateral, to our customers, which include natural gas and oil companies, general contractors, and various commercial and industrial customers located within the United States. Consequently, the Company is subject to potential credit risk related to business and economic factors that would affect these companies. However, the Company generally has certain statutory lien rights with respect to services provided. Under certain circumstances such as foreclosure, the Company may take title to the underlying assets in lieu of cash in settlement of receivables.\nPlease see the tables below for customers that represent 10.0% or more of the Companys revenue or accounts receivable, net of retention for the fiscal years ended September 30, 2022, and 2021:\nRevenue\nFY 2022\nFY 2021\nTransCanada Corporation\n16.6\n%\n11.0\n%\nAll other\n83.4\n%\n89.0\n%\nTotal\n100.0\n%\n100.0\n%\n* Less than 10.0% and included in All other if applicable\nAccounts receivable, net of retention\nFY 2022\nFY 2021\nTransCanada Corporation\n11.6\n%\n13.2\n%\nKentucky American Water\n*\n16.3\n%\nAll other\n88.4\n%\n70.5\n%\nTotal\n100.0\n%\n100.0\n%\n* Less than 10.0% and included in All other if applicable\nVirtually all work performed for major customers was awarded under competitive bid fixed price or unit price arrangements. The loss of a major customer could have a severe impact on the profitability of operations of the Company. However, due to the nature of the Companys operations, the major customers and sources of revenues may change from year to year.\nLitigation\nIn February 2018, the Company filed a lawsuit against a former customer (Defendant) in the United States District Court for the Western District of Pennsylvania. The lawsuit is related to a dispute over work performed on a pipeline construction project. On November 21, 2022, a Judgment Order was issued, and the Company was awarded $13.1 million, of which $5.8 million was the jury award, $1.6 million was for attorneys fees, and $5.7 million was for penalties and interest. The amounts awarded by the Judgment Order have not been recognized in the Companys consolidated financial statements as of September 30, 2022. The Companys attorneys fees have been expensed as incurred. On December 16, 2022, the Defendant filed a notice of appeal with the court.\nOn November 12, 2021, the Company received a withdrawal liability claim from a pension plan to which the Company made pension contributions for union construction employees performing covered work in a particular jurisdiction. The Company has not performed covered work in their jurisdiction since 2011; however, the Company disagrees with the withdrawal claim and believes it is covered by an exemption under federal law. The demand called for thirty-four quarterly installment payments of $41,000 starting December 15, 2021. The Company must comply with the demand under federal pension law; however, the Company firmly believes no withdrawal liability exists. The Company is in negotiations with the pension fund to resolve the matter and all future payments have been suspended as part of the negotiation. The Company has expensed all $164,000 in payments made through September 30, 2022 and does not expect any future liabilities related to this claim.\nOther than described above, at September 30, 2022, the Company was not involved in any legal proceedings other than in the ordinary course of business. The Company is a party from time to time to various lawsuits, claims and other legal proceedings that arise in the ordinary course of business. These actions typically seek, among other things, compensation for alleged personal injury, breach of contract and/or property damages, punitive damages, civil penalties or other losses, or injunctive or declaratory relief. With respect to all such lawsuits, claims, and proceedings, we record reserves when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. At September 30, 2022, the Company does not believe that any of these proceedings, separately or in aggregate, would be expected to have a material adverse effect on our financial position, results of operations or cash flows.\nRelated Party Transactions\nWe intend that all transactions between us and our executive officers, directors, holders of 10% or more of the shares of any class of our common stock and affiliates thereof, will be on terms no less favorable than those terms given to unaffiliated third parties and will be approved by a majority of our independent outside directors not having any interest in the transaction.\nOn December 16, 2014, the Companys Nitro subsidiary entered into a 20-year $1.2 million loan agreement with First Bank of Charleston, Inc. (West Virginia) to purchase the office building and property it had previously been leasing for $6,300 each month. The interest rate on the loan agreement is 4.82% with monthly payments of $7,800. As of September 30, 2022, the Company had paid approximately $333,000 in principal and approximately $370,000 in interest since the beginning of the loan. Mr. Douglas Reynolds, President of Energy Services, was a director and secretary of First Bank of Charleston. Mr. Samuel Kapourales, a director of Energy Services, was also a director of First Bank of Charleston. On October 15, 2018, First Bank of Charleston was merged into Premier Bank, Inc., a wholly owned subsidiary of Premier Financial Bancorp, Inc. Mr. Marshall Reynolds, Chairman of the Board of Energy Services, held the same position with Premier Financial Bancorp, Inc. Mr. Douglas Reynolds is the president and a director of Energy Services and was a director of Premier Financial Bancorp, Inc. On September 17, 2021, Peoples Bancorp, Inc., parent company of Peoples Bank, completed an acquisition of Premier Financial Bancorp, Inc. and its wholly owned subsidiaries, Premier Bank and Citizens Deposit Bank & Trust. On October 26, 2021, Mr. Douglas Reynolds was elected a director of Peoples Bancorp, Inc., and its subsidiary Peoples Bank.\nOn April 29, 2022, the Company entered into a $1.0 million promissory note agreement with Corns Enterprises as partial consideration for the purchase of Tri-State Paving. This four-year agreement requires $250,000 principal installment payments on or before the end of each twelve (12) full calendar month period beginning April 29, 2022. Interest payments due shall be calculated on the principal balance remaining and shall be at the stated rate of 3.5% per year. The Company recorded $7,800 in accreted interest and has not made any principal payments on this note as of September 30, 2022.\nSubsequent to the April 29, 2022 acquisition of Tri-State Paving, the Company entered into an operating lease for facilities in Hurricane, West Virginia with Corns Enterprises. This thirty-six-month lease is treated as a right to use asset and has payments of $7,000 per month. The total net present value at inception was $236,000 with a carrying value of $205,000 at September 30, 2022.\nSQP made an equity investment of $156,000 in 1030 Quarrier Development, LLC (Development) in August 2022. Development is a variable interest entity (VIE) that is 75% owned by 1030 Quarrier Ventures, LLC (Ventures) and 25% owned by SQP. SQP is not the primary beneficiary of the VIE and therefore, will not consolidate Development into its consolidated financial statements. Instead, SQP will apply the equity method of accounting for its investment in Development. Development, a 1% owner, and United Bank, a 99% owner, formed 1030 Quarrier Landlord, LLC (Landlord). Landlord decided to pursue the following development project (the Project): a historical building at 1030 Quarrier Street, Charleston, West Virginia as well as associated land (the Property) was purchased to be developed/rehabilitated into a commercial project including apartments and commercial space. Upon the completion of development, the Property will be used to generate rental income. SQP has been awarded the construction contract for the Project. United Bank provided $5.0 million in loans to fund the Project. SQP and Ventures has jointly provided an unconditional guarantee for the $5.0 million of obligations associated with the Project.\nOther than mentioned above, there were no new material related party transactions entered into during the fiscal year ended September 30, 2022.\nCertain Energy Services subsidiaries routinely engage in transactions in the normal course of business with each other, including sharing employee benefit plan coverage, payment for insurance and other expenses on behalf of other affiliates, and other services incidental to business of each of the affiliates. All revenue and related expense transactions, as well as the related accounts payable and accounts receivable have been eliminated in consolidation.\nInflation\nMost significant project materials, such as pipe or electrical wire, are provided by the Companys customers. The Company did experience costs increases on materials for fire protection projects, which had been bid several months prior, during the twelve months ended September 30, 2022. While significant to those smaller projects, the costs increases were immaterial to the overall operations of the Company. When possible, the Company attempts to lock in pricing with vendors and include qualifications regarding material costs increases in bids. Where allowed by contract, the Company will address fuel cost increases with customers. Significant inflation or supply chain issues could cause customers to delay or cancel planned projects; however, inflation did not have a significant effect on our results for the twelve months ended September 30, 2022, and 2021.\nCritical Accounting Estimates\nThe discussion and analysis of the Companys financial condition and results of operations are based on our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities known to exist at the date of the consolidated financial statements and reported amounts of revenues and expenses during the reporting period. We evaluate our estimates on an ongoing basis, based on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. There can be no assurance that actual results will not differ from those estimates. Management believes the following accounting policies affect our more significant judgments and estimates used in the preparation of our consolidated financial statements.\nRevenues\nThe Company recognizes revenue as performance obligations are satisfied and control of the promised good and service is transferred to the customer. For Lump Sum and Unit Price contracts, revenue is ordinarily recognized over time as control is transferred to the customers by measuring the progress toward complete satisfaction of the performance obligation(s) using an input (i.e., cost to cost) method. For Cost Plus and Time and Material (T&M) contracts, revenue is ordinarily recognized over time as control is transferred to the customers by measuring the progress toward satisfaction of the performance obligation(s) using an output method. The Company also does certain T&M service work that is generally completed in a short duration and is recognized at a point in time.\nThe accuracy of our revenue and profit recognition in a given period depends on the accuracy of our estimates of the cost to complete each project. We believe our experience allows us to create materially reliable estimates. There are a number of factors that can contribute to changes in estimates of contract cost and profitability. The most significant of these include:\n● the completeness and accuracy of the original bid;\n● costs associated with scope changes;\n● changes in costs of labor and/or materials;\n● extended overhead and other costs due to owner, weather and other delays;\n● subcontractor performance issues;\n● changes in productivity expectations;\n● site conditions that differ from those assumed in the original bid;\n● changes from original design on design-build projects;\n● the availability and skill level of workers in the geographic location of the project;\n● a change in the availability and proximity of equipment and materials;\n● our ability to fully and promptly recover on affirmative claims and back charges for additional contract costs; and\n● the customers ability to properly administer the contract.\nThe foregoing factors, as well as the stage of completion of contracts in process and the mix of contracts at different margins may cause fluctuations in gross profit from period to period. Significant changes in cost estimates, particularly in our larger, more complex projects could have, a significant effect on our profitability.\nOur contract assets include cost and estimated earnings in excess of billings that represent amounts earned and reimbursable under contracts, including claim recovery estimates, but have a conditional right for billing and payment such as achievement of milestones or completion of the project. With the exception of customer affirmative claims, generally, such unbilled amounts will become billable according to the contract terms and generally will be billed and collected over the next three months. Settlement with the customer of outstanding affirmative claims is dependent on the claims resolution process and could extend beyond one year. Based on our historical experience, we generally consider the collection risk related to billable amounts to be low. When events or conditions indicate that it is probable that the amounts outstanding become unbillable, the transaction price and associated contract asset is reduced.\nOur contract liabilities consist of provisions for losses and billings in excess of costs and estimated earnings. Provisions for losses are recognized in the consolidated statements of income at the uncompleted performance obligation level for the amount of total estimated losses in the period that evidence indicates that the estimated total cost of a performance obligation exceeds its estimated total revenue. Billings in excess of costs and estimated earnings are billings to customers on contracts in advance of work performed, including advance payments negotiated as a contract condition. Generally, unearned project-related costs will be earned over the next twelve months.\nThe following table presents our costs and estimated earnings in excess of billings and billings in excess of costs and estimated earnings at September 30, 2022 and 2021:\nSeptember 30, 2022\nSeptember 30, 2021\nCosts incurred on contracts in progress\n$\n192,957,145\n$\n64,903,618\nEstimated earnings, net of estimated losses\n28,150,060\n13,280,334\n221,107,205\n78,183,952\nLess billings to date\n211,025,190\n72,606,840\n$\n10,082,015\n$\n5,577,112\nCosts and estimated earnings in excess of billed on\nuncompleted contracts\n$\n16,109,593\n$\n8,730,402\nLess billings in excess of costs and estimated earnings on\nuncompleted contracts\n6,027,578\n3,153,290\n$\n10,082,015\n$\n5,577,112\nAllowance for doubtful accounts\nThe Company provides an allowance for doubtful accounts when collection of an account is considered doubtful. Inherent in the assessment of the allowance for doubtful accounts are certain judgments and estimates relating to, among others, our customers access to capital, our customers willingness or ability to pay, general economic conditions and the ongoing relationship with the customers. While most of our customers are large well capitalized companies, should they experience material changes in their revenues and cash flows or incur other difficulties and not be able to pay the amounts owed, this could cause reduced cash flows and losses in excess of our current reserves.\nMaterially incorrect estimates of bad debt reserves could result in an unexpected loss in profitability for the Company. Additionally, frequently changing reserves could be an indication of risky or unreliable customers. At September 30, 2022, the management review deemed that the allowance for doubtful accounts was adequate.\nPlease see the allowance for doubtful accounts table below:\nYear Ended September 30,\nBalance at beginning of year\n$\n70,310\n$\n70,310\nCharged to expense\n-\n-\nDeductions for uncollectible receivables written off, net of recoveries\n-\n-\nBalance at end of year\n$\n70,310\n$\n70,310\nImpairment of goodwill and intangible assets\nThe Company follows the guidance of Accounting Standards Codification (ASC) 350-20-35-3 Intangibles-Goodwill and Other (Topic 350) which requires a company to record an impairment charge based on the excess of a reporting units carrying amount of goodwill over its fair value. Under the current guidance, companies can first choose to assess any impairment based on qualitative factors (Step 0). If a company fails this test or decides to bypass this step, it must proceed with a quantitative assessment of goodwill impairment. The Company did not have a goodwill impairment at September 30, 2022.\nMaterially incorrect estimates could cause an impairment to goodwill or intangible assets and result in a loss in profitability for the Company.\nA table of the Companys intangible assets subject to amortization is below:\nAccumulated\nAccumulated\nAmortization and\nAmortization and\nAmortization and\nImpairment\nRemaining Life at\nImpairment at\nImpairment at\nTwelve Months Ended\nSeptember 30,\nOriginal\nSeptember 30,\nSeptember 30,\nSeptember 30,\nNet Book\nIntangible assets:\nCost\nValue\nWest Virginia Pipeline:\nCustomer Relationships\n99 months\n$\n2,209,724\n$\n386,693\n$\n165,725\n$\n220,968\n$\n1,823,031\nTradename\n99 months\n263,584\n46,136\n19,772\n26,364\n217,448\nNon-competes\n3 months\n83,203\n72,806\n31,202\n41,604\n10,397\nRevolt Energy:\nEmployment agreement/non-compete\n19 months\n100,000\n77,779\n13,889\n63,890\n22,221\nTri-State Paving:\nCustomer Relationships\n115 months\n1,649,159\n66,781\n-\n66,781\n1,582,378\nTradename\n115 months\n203,213\n8,368\n-\n8,368\n194,845\nNon-competes\n7 months\n39,960\n16,590\n-\n16,590\n23,370\nTotal intangible assets\n$\n4,548,843\n$\n675,153\n$\n230,588\n$\n444,565\n$\n3,873,690\nDepreciation and Amortization\nThe purpose of depreciation and amortization is to represent an accurate value of assets on the books. Every year, as assets are used, their values are reduced on the balance sheet and expensed on the income statement. As depreciation and amortization are a noncash expense, the amount must be estimated. Each year a certain amount of depreciation and amortization is written off and the book value of the asset is reduced.\nProperty and equipment are recorded at cost. Costs which extend the useful lives or increase the productivity of the assets are capitalized, while normal repairs and maintenance that do not extend the useful life or increase productivity of the asset are expensed as incurred. Property and equipment are depreciated principally on the straight-line method over the estimated useful lives of the assets: buildings 39 years; operating equipment and vehicles 5-7 years; and office equipment, furniture and fixtures 5-7 years.\nAcquired intangible assets subject to amortization are amortized on a straight-line basis, which approximates the pattern in which the economic benefit of the respective intangible assets is realized, over their respective estimated useful lives. The definite-lived identifiable intangible assets recognized as part of the Companys business combinations are recorded at their estimated fair value.\nThe Companys depreciation expense for the twelve months ended September 30, 2022, and 2021 was $5.6 million and $4.7 million, respectively. In general, depreciation is included in cost of revenues on the Companys consolidated statements of income.\nThe Companys amortization expense for the twelve months ended September 30, 2022, and 2021 was $445,000 and $231,000, respectively. In general, amortization is included in cost of revenues on the Companys consolidated statements of income.\nMaterially incorrect estimates of depreciation and amortization and/or the useful lives of assets could significantly impact the value of long-lived assets on the Companys consolidated financial statements. A material over valuation could result in impairment charges and reduced profitability for the Company.\nIncome Taxes\nThe Companys income tax expense and deferred tax assets and liabilities reflect managements best estimate of current and future taxes to be paid. Significant judgments and estimates are required in the determination of the consolidated income tax expense. The Companys provision for income taxes is computed by applying a federal rate of 21.0% and a state rate of 6.0% to taxable income or loss after consideration of non-taxable and non-deductible items.\nPermanent income tax differences result in an increase or decrease to taxable income and impact the Companys effective tax rates, which were 37.0% and (0.3%) for the twelve months ended September 30, 2022 and 2021, respectively. Our tax rate is affected by recurring items, such as non-deductible expenses, which we expect to be fairly consistent in the near term.\nOn June 16, 2021, the Company received notice that the SBA had granted forgiveness and repaid $9.8 million of Paycheck Protection Program (PPP) borrowings to its lender. The forgiveness was recorded as other nonoperating income for the twelve months ended September 30, 2021. According to the CARES Act passed by Congress in March 2020, PPP loan forgiveness is not taxable. In accordance with the Consolidated Appropriations Act, 2021, the Companys PPP related expenditures in the fiscal year 2020 were considered deductible expenses for federal income tax purposes. The PPP forgiveness had a significant impact on the effective income tax rate for the twelve months ended September 30, 2021, as taxable income was decreased by $9.8 million.\nDeferred income taxes arise from temporary differences between the tax basis of assets and liabilities and their reported amounts in the consolidated financial statements, which will result in taxable or deductible amounts in the future. At September 30, 2022, the Company had a net deferred income tax liability of $4.5 million as compared to $2.0 million at September 30, 2021. The Companys deferred income tax liabilities at September 30, 2022 totaled $7.7 million and primarily related to depreciation on property and equipment. The Companys deferred income tax assets at September 30, 2022, totaled $3.2 million and primarily related to a NOL carryforward. The Company believes that it is more likely than not that all NOL carryforwards will be realized.\nNew Accounting Pronouncements\nOn October 28, 2021, the Financial Accounting Standards Board (FASB) released Accounting Standards Update (ASU) 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers. The amendments of this ASU require entities to apply Topic 606 to recognize and measure contract assets and contract liabilities in a business combination. The amendments improve comparability after the business combination by providing consistent recognition and measurement guidance for revenue contracts with customers acquired in a business combination and revenue contracts with customers not acquired in a business combination. The amendments are effective for public business entities for the fiscal years, including interim periods within those the fiscal years, beginning after December 15, 2022. For all other entities they are effective for the fiscal years, including interim periods within those the fiscal years, beginning after December 15, 2023. Entities should apply the amendments prospectively to business combinations that occur after the effective date. Early adoption is permitted, including in any interim period, for public business entities for periods for which financial statements have not yet been issued, and for all other entities for periods for which financial statements have not yet been made available for issuance. The Company is currently assessing the effect that ASU 2021-08 will have on their results of operations, financial position and cash flows; however, the Company does not expect a significant impact.\nThe FASB recently issued ASU 2021-10, Government Assistance (Topic 832): Disclosures by Business Entities about Government Assistance, which aims to provide increased transparency by requiring business entities to disclose information about certain types of government assistance they receive in the notes to the financial statements. Entities are required to provide the new disclosures prospectively for all transactions with a government entity that are accounted for under either a grant or a contribution accounting model and are reflected in the financial statements at the date of initially applying the new amendments, and to new transactions entered into after that date. Retrospective application of the guidance is permitted. The guidance in ASU 2021-10 is effective for financial statements of all entities for annual periods beginning after December 15, 2021, with early application permitted. ASU 2021-10 has not become effective for the Company; however, a significant impact is not expected.\nSubsequent Events\nOn October 10, 2022, the Company entered into a $3.1 million promissory note agreement with United Bank to finance the Ryan Environmental acquisition. This is a five-year agreement with a fixed interest rate of 6.0% and monthly payments of $59,932 beginning on November 10, 2022.\nIn February 2018, the Company filed a lawsuit against a former customer in the United States District Court for the Western District of Pennsylvania. The lawsuit is related to a dispute over work performed on a pipeline construction project. On November 16, 2022, a Judgement Order was issued, and the Company was awarded $13.1 million, of which $5.8 million was the jury award, $1.6 million was for attorneys fees, and $5.7 million was for penalties and interest. None of the award had been recognized in the Companys consolidated financial statements as of September 30, 2022. The Companys attorneys fees have been expensed as incurred. On December 16, 2022, the Defendant filed a notice of appeal with the court.\nManagement has evaluated all subsequent events for accounting and disclosure. There have been no other material events during the period, other than noted above, that would either impact the results reflected in the report or the Companys results going forward. ITEM 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot required for smaller reporting companies. ITEM 8.Financial Statements and Supplementary Data\nFinancial Statements are included at page of this Annual Report on Form 10-K. ITEM 9.Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. ITEM 9A.Controls and Procedures\n(a) Evaluation of Disclosure Controls and Procedures\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, the Company evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Securities Exchange Act of 1934) as of the end of the period covered by this report. Based upon that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were effective to ensure that information required to be disclosed in the reports that Energy Services files or submits under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms.\n(b) Managements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. Internal control over financial reporting refers to the process designed by, or under the supervision of, our Chief Executive Officer and Chief Financial Officer, and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles, and includes those policies and procedures that:\n(1) Pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n(2) Provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n(3) Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the Companys financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement has used the framework set forth in the report entitled Internal Control-Integrated Framework 2013 published by the Committee of Sponsoring Organizations of the Treadway Commission to evaluate the effectiveness of the Companys internal control over financial reporting. Management has not identified any material weakness in the Companys internal control over financial reporting. Management has concluded that the Companys internal control over financial reporting was effective as of the end of the most recent the fiscal year.\nThis Annual Report does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys independent registered public accounting firm pursuant to rules of the SEC that permit the Company to provide only Managements report in this Annual Report.\n(c) Changes in Internal Controls Over Financial Reporting\nThere has been no change in Energy Services of America Corporations internal control over financial reporting during Energy Services of America Corporations fourth quarter of the fiscal year 2022, that has materially affected, or is reasonably likely to materially affect, Energy Services of America Corporations internal control over financial reporting. ITEM 9B.Other Information\nNone.\nITEM 9C.Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot Applicable.\nPART III ITEM 10.Directors, Executive Officers and Corporate Governance\nThe Company has adopted a Code of Ethics that applies to our principal executive officer, principal financial officer, principal accounting officer or controller or persons performing similar functions. The Code of Ethics was previously filed as an exhibit to our Registration Statement on Form S-1. A copy of the Code will be furnished without charge upon written request to the Corporate Secretary, Energy Services of America Corporation, 75 West 3rd Ave., Huntington, West Virginia 25701.\nThe information contained under the sections captioned Proposal I - Election of Directors in the Companys definitive Proxy Statement for the 2023 Annual Meeting of Stockholders to be filed with the SEC within 120 days of September 30, 2022 (the Proxy Statement) is incorporated herein by reference. ITEM 11.Executive Compensation\nThe information contained under the section captioned Proposal I - Election of Directors - Executive and Director Compensation in the definitive Proxy Statement is incorporated herein by reference. ITEM 12.Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n(a)Securities Authorized for issuance under Stock-Based Compensation Plans\nThe following table presents certain information regarding our Equity Compensation Plan in effect as of September 30, 2022:\nNumber of securities to be\nNumber of securities\nissued upon exercise of\nWeighted average\nremaining available for\nPlan\noutstanding options and rights\nexercise price\nissuance under plan\nEquity compensation plans approved by stockholders\n-\n-\n1,500,000\nEquity compensations plans not approved by stockholders\n-\n-\n-\nTotal\n-\n-\n1,500,000\n(b)Security Ownership of Certain Beneficial Owners\nThe information required by this item is incorporated herein by reference to the section captioned Security Ownership of Certain Beneficial Owners in the Proxy Statement.\n(c)Security Ownership of Management\nThe information required by this item is incorporated herein by reference to the section captioned Proposal I - Election of Directors in the Proxy Statement.\n(d)Changes in Control\nManagement of the Company knows of no arrangements, including any pledge by any person of securities of the Company, the operation of which may at a subsequent date result in a change in control of the registrant. ITEM 13.Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated herein by reference to the sections captioned Proposal I - Election of Directors - Certain Relationships and Related Transactions and - Board Independence of the Proxy Statement. ITEM 14.Principal Accountant Fees and Services\nThe information required by this item is incorporated herein by reference to the section captioned Proposal II - Ratification of Independent Registered Public Accounting Firm of the Proxy Statement.\nPART IV ITEM 15.Exhibits and Financial Statement Schedules\nThe exhibits and financial statement schedules filed as a part of this Form 10-K are as follows:\n(a)(1)\nConsolidated Financial Statements\nEnergy Services of America Corporation\nReport of Independent Registered Public Accounting Firm (PCAOB ID 23)\nConsolidated Balance Sheets, September 30, 2022 and September 30, 2021.\nConsolidated Statements of Income, Years Ended September 30, 2022 and September 30, 2021.\nConsolidated Statements of Cash Flows, Years Ended September 30, 2022 and September 30, 2021.\nConsolidated Statements of Changes in Shareholders Equity, Years Ended September 30, 2022 and September 30, 2021.\nNotes to Consolidated Financial Statements.\n(a)(2)\nConsolidated Financial Statement Schedules\nNo financial statement schedules are filed because the required information is not applicable or is included in the consolidated financial statements or related notes.\n(a)(3)\nExhibits\nExhibit No.\nDescription\n3.1\nAmended and Restated Certificate of Incorporation (1)\n3.2\nBylaws (1)\n3.3\nCertificate of Amendment to the Registrants Certificate of Incorporation (1)\n3.4\nCertificate of Designations Series A Preferred Stock (4)\n4.1\nForm of Certificate of Common Stock (1)\n4.2\nDescription of Common Stock (5)\n10.1\nForm of Investment Management Trust Agreement between Continental Stock Transfer & Trust Company and the Registrant (1)\n10.2\nForm of Stock Escrow Agreement between the Registrant, Continental Stock Transfer & Trust Company and the Initial Stockholders (1)\n10.3\nForm of Letter Agreement between Chapman Printing Co. and the Registrant regarding administrative support (1)\n10.4\nForm of Amended Registration Rights Agreement among the Registrant and the Initial Stockholders (1)\n10.5\nEnergy Services of America Corporation Employee Stock Purchase Plan (2)\n10.6\nSeverance Agreement, Waiver and Release of all Claims with Robert N. Riddle, Jr. (7)\n10.7\nEnergy Services of America Corporation 2022 Equity Incentive Plan (8)\nCode of Ethics (1)\n16.1\nLetter disclosing combination dated November 1, 2021, from Baker Tilly US, LLP (6)\n16.2\nLetter of Agreement dated November 1, 2021, form Baker Tilly US, LLP (6)\nList of subsidiaries\nConsent of Baker Tilly US, LLP\n31.1\nCertification of Chief Executive Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Chief Financial Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\n(1)\nIncorporated by reference to the Registration Statement on Form S-1 of Energy Services of America Corp. (file no. 333-133111), originally filed with the Securities and Exchange Commission on April 7, 2006, as amended.\n(2)Filed as Appendix A to the Schedule 14-A filed with the Securities and Exchange Commission on October 16, 2008.\n(3)\nFiled as Appendix A to the Schedule 14-A filed with the Securities and Exchange Commission on July 2, 2010.\n(4)\nIncorporated by reference to the Registrants Current Report on Form 8-K filed with the Securities and Exchange Commission on August 8, 2013.\n(5)\nIncorporated by reference to the Registrants Annual Report on Form 10-K filed with the Securities and Exchange Commission on December 20, 2019.\n(6)\nIncorporated by reference to the Registrants Current Report on Form 8-K filed with the Securities and Exchange Commission on November 5, 2021.\n(7)\nIncorporated by reference to the Registrants Current Report on Form 8-K filed with the Securities and Exchange Commission on May 19, 2022.\n(8)\nIncorporated by reference to the Registrants Current Report on Form 8-K filed with the Securities and Exchange Commission on February 18, 2022.\n(b) The exhibits listed under (a)(3) above are filed herewith.\n(c) Not applicable.\nITEM 16.Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 of the Securities Exchange Act of 1934, the Company has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nENERGY SERVICES OF AMERICA CORPORATION\nDate: December 22, 2022\nBy:\n/s/ Douglas V. Reynolds\nDouglas V. Reynolds\nPresident and Chief Executive Officer\n(Duly Authorized Representative)\nPursuant to the requirements of the Securities Exchange of 1934, this report has been signed by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nName\nPosition\nDate\nBy\n/s/ Marshall T. Reynolds\nChairman of the Board\nDecember 22, 2022\nMarshall T. Reynolds\nBy\n/s/ Jack Reynolds\nDirector\nDecember 22, 2022\nJack R. Reynolds\nBy\n/s/ Charles P. Crimmel\nChief Financial Officer\nDecember 22, 2022\nCharles P. Crimmel\n(Principal Financial and Accounting Officer)\nBy\n/s/ Amy E. Abraham\nDirector\nAmy E. Abraham\nDecember 22, 2022\nBy\n/s/ Joseph L. Williams\nDirector\nDecember 22, 2022\nJoseph L. Williams\nBy\n/s/ Mark S. Prince\nDirector\nDecember 22, 2022\nMark S. Prince\nBy\n/s/ Frank S. Lucente\nDirector\nDecember 22, 2022\nFrank S. Lucente\nBy\n/s/ Patrick J. Farrell\nDirector\nDecember 22, 2022\nPatrick J. Farrell\nBy\n/s/ Samuel G. Kapourales\nDirector\nDecember 22, 2022\nSamuel G. Kapourales\nBy\n/s/ Charles Abraham\nDirector\nDecember 22, 2022\nCharles Abraham\nBy\n/s/ Douglas V. Reynolds\nPresident and Chief\nDecember 22, 2022\nDouglas V. Reynolds\nExecutive Officer, and Director\n(Principal Executive Officer)\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nEnergy Services of America Corporation\nHuntington, West Virginia\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Energy Services of America Corporation and subsidiaries (the Company) as of September 30, 2022 and 2021, the related consolidated statements of income, changes in shareholders equity and cash flows, for each of the two years in the period ended September 30, 2022, and the related notes (collectively referred to as, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of their operations and their cash flows for each of the two years in the period ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of their internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nOver-Time Revenue Recognition\nCritical Audit Matter Description\nAs described in Notes 2 and 3 to the consolidated financial statements, the Company recognizes revenue from contracts with customers over time as performance obligations are satisfied and control of the promised good and service is transferred to the customer. The Company recognizes revenue on lump sum and unit price contracts by measuring the progress toward complete satisfaction of contractual performance obligations using an input method. For cost plus and time and material contracts, the Company recognizes revenue from contracts with customers over time as control is transferred to the customer by measuring progress toward complete satisfaction of the performance obligations using an output method.\nWe identified the evaluation of the Companys estimates on significant construction contracts with customers and their effect on revenue recognition as a critical audit matter. The Companys significant estimates include the determination of the performance obligations and allocation of transaction price and estimated costs to complete. Recognition of revenue and profit over time as performance obligations are satisfied for long-term lump sum and unit price contracts is highly judgmental as it requires the Company to prepare estimates of total contract revenue and total contract costs, including costs to complete in-process contracts. Auditing the Companys estimates of total contract revenue and costs used to recognize revenue on construction contracts involved significant auditor judgement, as it required the evaluation of subjective factors such as assumptions related to project schedule and completion, forecasted labor, material and subcontract costs and variable consideration estimates related to incentive fees, unpriced change orders and contractual disputes and claims. These estimates are dependent upon significant management judgement, which affects the measurement of revenue recognized by the Company.\nHow We Addressed the Matter in Our Audit\nThe primary procedures we performed to address this critical audit matter included:\n● Evaluated the Companys estimated revenue and costs to complete by obtaining and analyzing supporting documentation of managements estimates of variable consideration and contract costs.\n● Compared contract profitability estimates in the current year to historical estimates and actual performance.\n● Tested samples of completed and in-process contracts and contract transactions by inspecting the underlying customer contracts, contract billing data, and contract cost source documentation, and evaluated the Companys recognition of contract assets, liabilities, revenue, and costs of revenue in accordance with the Companys revenue recognition policy.\nValuation of Goodwill and Intangible Assets Associated with Business Combinations\nCritical Audit Matter Description\nAs described in Note 24 to the consolidated financial statements, the Company completed an asset purchase of Tri-State Paving & Sealcoating, LLC, for total consideration of $9.9 million during the year ended September 30, 2022. The acquisition was accounted for using the acquisition method of accounting, which requires, among other things, the assets acquired and the liabilities assumed to be recognized at their fair values as of the acquisition date. Auditing the accounting for these acquisitions was complex due to the significant estimation uncertainty in determining the fair values of assets acquired and liabilities assumed.\nWe identified the valuation of intangible assets recorded in connection with the acquisition as a critical audit matter. The fair value estimates were based on underlying assumptions about future performance of the acquired business which involves significant estimation uncertainty. The significant assumptions used to form the basis of the forecasted results included revenue growth rates, earnings metrics, and discount rates. These significant assumptions were forward-looking and could be affected by future economic and market conditions.\nHow We Addressed the Matter in Our Audit\nThe primary procedures we performed to address this critical audit matter included:\n● Reviewed the valuation report prepared by the valuation specialist engaged by management to assist in the purchase price allocation, including the determination of fair values assigned to acquired intangible assets, and assessed the qualifications and objectivity of managements specialist.\n● Engaged an internal valuation specialist to assist the engagement team in evaluating the appropriateness of the Companys selection of the valuation model, including the evaluation of significant assumptions, including growth rates, discount rate and economic lives.\n● Evaluated the reasonableness of assumptions used by management in the cash flow model, which included comparing the significant assumptions to current industry, market and economic trends, historical results of the Companys business, other companies within the same industry, and evidence obtained in other areas of the audit.\n● Tested the completeness and accuracy of the underlying data supporting the significant assumptions and estimates used in the valuation reports, including historical and projected financial information.\n/s/ Baker Tilly US, LLP\nWe have served as the Companys auditor since 2008.\nPittsburgh, Pennsylvania\nDecember 22, 2022\nENERGY SERVICES OF AMERICA CORPORATION\nCONSOLIDATED BALANCE SHEETS\nAs of September 30, 2022 and 2021\nAssets\nCurrent assets\nCash and cash equivalents\n$\n7,427,474\n$\n8,226,739\nAccounts receivable-trade\n38,525,223\n21,092,517\nAllowance for doubtful accounts\n(70,310)\n(70,310)\nRetainages receivable\n4,443,679\n917,526\nOther receivables\n10,866\n543,328\nContract assets\n16,109,593\n8,730,402\nPrepaid expenses and other\n3,945,968\n3,541,000\nTotal current assets\n70,392,493\n42,981,202\nProperty, plant and equipment, at cost\n73,736,433\n61,145,705\nless accumulated depreciation\n(41,074,646)\n(38,195,686)\nTotal fixed assets\n32,661,787\n22,950,019\nRight-of-use assets-operating lease\n1,611,321\n-\nIntangible assets, net\n3,873,690\n2,425,923\nGoodwill\n4,087,554\n1,814,317\nTotal assets\n$\n112,626,845\n$\n70,171,461\nLiabilities and shareholders' equity\nCurrent liabilities\nCurrent maturities of long-term debt\n$\n4,060,016\n$\n3,401,574\nLines of credit and short term borrowings\n13,080,320\n5,040,250\nCurrent maturities of operating lease liabilities\n588,653\n-\nAccounts payable\n20,314,408\n7,285,392\nAccrued expenses and other current liabilities\n11,266,008\n5,599,702\nContract liabilities\n6,027,578\n3,153,290\nTotal current liabilities\n55,336,983\n24,480,208\nLong-term debt, less current maturities\n13,494,084\n9,020,774\nLong-term operating lease liabilities\n1,015,624\n-\nDeferred tax liability\n4,455,079\n2,033,433\nTotal liabilities\n74,301,770\n35,534,415\nShareholders' equity\nPreferred stock, $.0001 par value Authorized 1,000,000 shares, 0 issued and outstanding at September 30, 2022 and 206 issued and outstanding at September 30, 2021\n-\n-\nCommon stock, $.0001 par value Authorized 50,000,000 shares, 17,885,615 issued and 16,667,185 outstanding at September 30, 2022 and 14,839,836 issued and 13,621,406 outstanding at September 30, 2021\n1,789\n1,484\nTreasury stock, 1,218,430 shares at September 30, 2022 and 2021\n(122)\n(122)\nAdditional paid in capital\n60,508,350\n60,670,699\nRetained deficit\n(22,184,942)\n(26,035,015)\nTotal shareholders' equity\n38,325,075\n34,637,046\nTotal liabilities and shareholders' equity\n$\n112,626,845\n$\n70,171,461\nThe Accompanying Notes are an Integral Part of These Consolidated Financial Statements\nENERGY SERVICES OF AMERICA CORPORATION\nCONSOLIDATED STATEMENTS OF INCOME\nFor the years ended September 30, 2022 and 2021\nRevenue\n$\n197,590,000\n$\n122,465,826\nCost of revenues\n175,219,252\n109,544,804\nGross profit\n22,370,748\n12,921,022\nSelling and administrative expenses\n15,878,138\n14,044,232\nIncome (loss) from operations\n6,492,610\n(1,123,210)\nOther income (expense)\nInterest income\n286,645\nPaycheck Protection Program loan forgiveness\n-\n9,839,100\nOther nonoperating expense\n(248,006)\n(58,742)\nInterest expense\n(887,931)\n(557,320)\nGain on sale of equipment\n755,470\n681,653\n(379,891)\n10,191,336\nIncome before income taxes\n6,112,719\n9,068,126\nIncome tax expense (benefit)\n2,262,646\n(29,129)\nNet income\n3,850,073\n9,097,255\nDividends on preferred stock\n-\n284,238\nNet income available to common shareholders\n$\n3,850,073\n$\n8,813,017\nWeighted average shares outstanding-basic\n16,323,790\n13,621,406\nWeighted average shares-diluted\n16,323,790\n16,988,424\nEarnings per share\navailable to common shareholders\n$\n0.24\n$\n0.65\nEarnings per share-diluted\navailable to common shareholders\n$\n0.24\n$\n0.52\nThe Accompanying Notes are an Integral Part of These Consolidated Financial Statements\nENERGY SERVICES OF AMERICA CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the years ended September 30, 2022 and 2021\nCash flows from operating activities:\nNet income\n$\n3,850,073\n$\n9,097,255\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation expense\n5,568,929\n4,661,789\nPaycheck Protection Program loan forgiveness\n-\n(9,839,100)\nGain on sale of equipment\n(755,470)\n(681,653)\nProvision for deferred taxes\n2,421,646\n211,677\nProvision for loss on contract\n248,770\n-\nAmortization of intangible assets\n444,565\n230,588\nAmortization of operating lease right-of-use assets\n98,711\n-\nAccreted interest on operating lease right-of-use assets\n11,802\n-\nAccreted interest on notes payable\n49,638\n-\nOperating lease payments\n(117,558)\n-\nIncrease in contracts receivable\n(17,432,706)\n(2,845,528)\n(Increase) decrease in retainage receivable\n(3,526,153)\n1,566,283\nDecrease (increase) in other receivables\n532,462\n(533,870)\nIncrease in contract assets\n(7,379,191)\n(2,184,539)\nDecrease (increase) in prepaid expenses and other\n2,948,003\n(202,057)\nIncrease in accounts payable\n13,029,016\n2,063,170\nIncrease in accrued expenses and other current liabilities\n5,417,842\n953,534\nIncrease (decrease) increase in contract liabilities\n2,874,288\n(1,698,610)\nNet cash provided by operating activities\n8,284,667\n798,939\nCash flows from investing activities:\nAcquisition of Revolt Energy\n-\n(150,000)\nAcquisition of West Virginia Pipeline, net of cash received of $250,000\n-\n(3,250,000)\nInvestment in property and equipment\n(5,308,189)\n(6,047,693)\nAcquisition of Ryan Environmental and Ryan Transport\n(4,042,057)\n-\nProceeds from sales of property and equipment\n1,071,723\n758,391\nNet cash used in investing activities\n(8,278,523)\n(8,689,302)\nCash flows from financing activities:\nPreferred stock redemption\n(1,210,525)\n-\nPreferred dividends paid\n-\n(309,000)\nBorrowings on lines of credit and short-term debt, net of repayments\n4,687,099\n8,030,407\nPrincipal payments on long-term debt\n(4,281,983)\n(2,821,125)\nNet cash (used in) provided by financing activities\n(805,409)\n4,900,282\nDecrease in cash and cash equivalents\n(799,265)\n(2,990,081)\nCash and cash equivalents beginning of period\n8,226,739\n11,216,820\nCash and cash equivalents end of period\n$\n7,427,474\n$\n8,226,739\nSupplemental schedule of noncash investing and financing activities:\nPurchases of property & equipment under financing agreements\n$\n549,455\n$\n3,349,139\nPrepaid insurance premiums financed\n$\n3,352,971\n$\n3,213,402\nNote payable to finance West Virginia Pipeline acquisition\n$\n-\n$\n3,000,000\nNote payable to refinance short-term borrowing\n$\n-\n$\n2,850,000\nAccrued dividends on preferred stock\n$\n-\n$\n52,488\nDebt assumed in acquisitions for equipment\n$\n390,445\n$\n205,829\nSellers' note Tri-State Paving acquisition\n$\n936,000\n$\n-\nNote payable to finance Tri-State Paving acquisition\n$\n7,500,000\n$\n-\nCommon stock issued to finance Tri-State Paving acquisition\n$\n1,048,218\n$\n-\nPar value of common stock issued from preferred stock coversion\n$\n$\n-\nOperating lease right-of-use assets\n$\n1,710,032\n$\n-\nSupplemental disclosures of cash flows information:\nCash paid during the year for:\nInterest\n$\n846,129\n$\n557,320\nIncome taxes\n$\n50,231\n$\n251,996\nThe Accompanying Notes are an Integral Part of These Consolidated Financial Statements\nENERGY SERVICES OF AMERICA CORPORATION\nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS EQUITY\nFor the years ended September 30, 2022 and 2021\nTotal\nCommon Stock\nAdditional Paid\nRetained\nTreasury\nShareholders'\nShares\nAmount\nin Capital\nDeficit\nStock\nEquity\nBalance at September 30, 2021\n13,621,406\n$\n1,484\n$\n60,670,699\n$\n(26,035,015)\n$\n(122)\n$\n34,637,046\nNet income\n-\n-\n-\n3,850,073\n-\n3,850,073\nPreferred share redemption, net of accrued dividends\n-\n-\n(1,210,525)\n-\n-\n(1,210,525)\nPreferred share conversion\n2,626,492\n-\n-\n-\nShares issued for Tri-State Paving acquisition\n419,287\n1,048,176\n-\n-\n1,048,218\nBalance at September 30, 2022\n16,667,185\n$\n1,789\n$\n60,508,350\n$\n(22,184,942)\n$\n(122)\n$\n38,325,075\nBalance at September 30, 2020\n13,621,406\n$\n1,484\n$\n60,670,699\n$\n(34,848,032)\n$\n(122)\n$\n25,824,029\nNet income\n-\n-\n-\n9,097,255\n-\n9,097,255\nAccrued preferred dividends\n-\n-\n-\n(284,238)\n-\n(284,238)\nBalance at September 30, 2021\n13,621,406\n$\n1,484\n$\n60,670,699\n$\n(26,035,015)\n$\n(122)\n$\n34,637,046\nThe Accompanying Notes are an Integral Part of These Consolidated Financial Statements\nENERGY SERVICES OF AMERICA CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.\nBUSINESS AND ORGANIZATION:\nEnergy Services of America Corporation (Energy Services or the Company), formed in 2006, is a contractor and service company that operates primarily in the mid-Atlantic and central regions of the United States and provides services to customers in the natural gas, petroleum, water distribution, automotive, chemical, and power industries. For the gas industry, the Company is primarily engaged in the construction, replacement and repair of natural gas pipelines and storage facilities for utility companies and private natural gas companies. Energy Services is involved in the construction of both interstate and intrastate pipelines, with an emphasis on the latter. For the oil industry, the Company provides a variety of services relating to pipeline, storage facilities and plant work. For the power, chemical, and automotive industries, the Company provides a full range of electrical and mechanical installations and repairs including substation and switchyard services, site preparation, equipment setting, pipe fabrication and installation, packaged buildings, transformers, and other ancillary work with regards thereto. Energy Services other services include liquid pipeline construction, pump station construction, production facility construction, water and sewer pipeline installations, various maintenance and repair services and other services related to pipeline construction. The Company has also added the ability to install residential, commercial, and industrial solar systems and perform civil and general contracting services.\nOn October 6, 2021, the Companys transfer agent completed the full redemption of all the Companys 6.0% Convertible Cumulative Perpetual Preferred Stock, Series A (Series A Preferred Stock), which resulted in the issuance of 2,626,492 new shares of the Companys common stock, the issuance of 317,500 common shares that were included in Series A Preferred Stock units, and cash redemption payments of $1.3 million. The Companys total outstanding common shares after redemption was 16,247,898 as of October 6, 2021.\nOn March 23, 2022, the Companys common stock began trading on the Nasdaq Capital Market operated by The Nasdaq Stock Market, LLC under the symbol ESOA.\nPursuant to the Asset Purchase Agreement signed on April 6, 2022, and amended on April 29, 2022, the Company acquired substantially all the assets (including but not limited to customer contracts, employees, and equipment) of Tri-State Paving, LLC for $7.5 million in cash, a $1.0 million promissory note, and $1.0 million in Energy Services common stock. The $7.5 million in cash was funded through a loan with United Bank, Inc., Huntington, West Virginia (United Bank). The transaction resulted in the issuance of 419,287 common shares.\nOn August 11, 2022, Ryan Construction, a newly formed wholly owned subsidiary of Energy Services, completed the acquisition of Ryan Environmental, LLC (Ryan Environmental), located in Bridgeport, WV, pursuant to an order issued by the United States Bankruptcy Court for the Northern District of West Virginia (the Court) on August 9, 2022 and Ryan Environmental Transport, LLC (Ryan Transport), located in Bridgeport, West Virginia, under the terms of an Asset Purchase Agreement. As part of the business combination, the Company acquired certain assets, including equipment, vehicles, and small tools, of Ryan Environmental for $3.0 million in cash and certain assets, including equipment and small tools, of Ryan Transport for $1.0 million in cash.\n2.\nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES:\nRevenue Recognition\nThe Company recognizes revenue as performance obligations are satisfied and control of the promised good and service is transferred to the customer. For Lump Sum and Unit Price contracts, revenue is ordinarily recognized over time as control is transferred to the customers by measuring the progress toward complete satisfaction of the performance obligation(s) using an input (i.e., cost to cost) method. For Cost Plus and Time and Material (T&M) contracts, revenue is ordinarily recognized over time as control is transferred to the customers by measuring the progress toward satisfaction of the performance obligation(s) using an output method.\nThe Company does have certain service and maintenance contracts in which each customer purchase order is considered its own performance obligation recognized over time and would be recognized depending on the type of contract mentioned above. The Company also does certain T&M service work that is generally completed in a short duration and is recognized at a point in time.\nAll contract costs, including those associated with affirmative claims, change orders and back charges, are recorded as incurred and revisions to estimated total costs are reflected as soon as the obligation to perform is determined. Contract costs consist of direct costs on contracts, including labor and materials, amounts payable to subcontractors and outside equipment providers, direct overhead costs and internal equipment expense (primarily depreciation, fuel, maintenance and repairs).\nThe Company recognizes revenue, but not profit, on certain uninstalled materials. Revenue on these uninstalled materials is recognized when the cost is incurred (when control is transferred), but the associated profit is not recognized until the materials are installed. The costs of uninstalled materials are tracked separately within the Companys accounting software.\nPre-contract and bond costs, if required, and mobilization costs on projects are generally immaterial to the total value of the Companys contracts and are expensed when incurred. As a practical expedient, the Company recognizes these incremental costs as an expense when incurred if the amortization period of the asset that the entity otherwise would have recognized is one year or less. For projects expected to last greater than one year, mobilization costs are capitalized as incurred and amortized over the expected duration of the project. For these projects, mobilization costs will be tracked separately in the Companys accounting software. This includes costs associated with setting up a project lot or lay-down yard, equipment, tool and supply transportation, temporary facilities and utilities and worker qualification and safety training.\nContracts may require the Company to warranty that work is performed in accordance with the contract; however, the warranty is not priced separately, and the Company does not offer customers an option to purchase a warranty.\nPrinciples of Consolidation\nThe consolidated financial statements of Energy Services include the accounts of Energy Services, its wholly owned subsidiaries West Virginia Pipeline, SQP, Ryan Construction, Tri-State Paving and C.J. Hughes and its subsidiaries, Contractors Rental, Nitro, and Pinnacle. All significant intercompany accounts and transactions have been eliminated in the consolidation. Unless the context requires otherwise, references to Energy Services include Energy Services, West Virginia Pipeline, SQP, Ryan Construction, Tri-State Paving and C.J. Hughes and its subsidiaries.\nUse of Estimates and Assumptions\nThe preparation of financial statements, in conformity with accounting principles generally accepted in the United States of America (U.S.GAAP), requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of income and loss during the reporting period. Actual results could differ materially from those estimates.\nCash and Cash Equivalents\nEnergy Services considers all highly liquid investments purchased with an original maturity of three months or less to be cash equivalents.\nFair Value Measurements\nThe Fair Value Measurement Topic of the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) defines fair value, establishes a framework for measuring fair value in accordance with U.S. GAAP and specifies disclosures about fair value measurements.\nUnder the FASBs authoritative guidance on fair value measurements, fair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The Fair Value Measurement Topic establishes a three-level hierarchy for fair value measurements based upon the transparency of inputs to the valuation of an asset or liability as of the measurement date.\nThe valuation hierarchy is based upon the transparency of inputs to the valuation of an asset or liability as of the measurement date. The three levels are defined as follows:\nLevel 1 - Quoted prices for identical assets and liabilities traded in active exchange markets, such as the New York Stock Exchange.\nLevel 2 - Observable inputs other than Level 1 including quoted prices for similar assets or liabilities, quoted prices in less active markets, or other observable inputs that can be corroborated by observable market data. Level 2 also includes derivative contracts whose value is determined using a pricing model with observable market inputs or can be derived principally from or corroborated by observable market data.\nLevel 3 - Unobservable inputs supported by little or no market activity for financial instruments whose value is determined using pricing models, discounted cash flow methodologies, or similar techniques, as well as instruments for which the determination of fair value requires significant management judgment or estimation; also includes observable inputs for nonbinding single dealer quotes not corroborated by observable market data.\nA financial instruments categorization within the valuation hierarchy is based upon the lowest level of input that is significant to the fair value measurement.\nThe carrying amount for borrowings under the Companys revolving credit facility approximates fair value because of the variable market interest rate charged to the Company for these borrowings. The fair value of the Companys long term fixed-rate debt was estimated using a discounted cash flow analysis and a yield rate that was estimated based on the borrowing rates currently available to the Company for bank loans with similar terms and maturities. The fair value of the aggregate principal amount of the Companys fixed-rate debt of $15.0 million at September 30, 2022 was $14.5 million. The fair value of the aggregate principal amount of the Companys fixed-rate debt of $10.0 million at September 30, 2021 was $9.9 million.\nAll other current assets and liabilities are carried at net realizable value which approximates fair value because of their short duration to maturity.\nAccounts Receivable and Allowance for Doubtful Accounts\nThe Companys accounts receivable consists of amounts that have been billed to customers. Collateral is generally not required. A majority of the Companys contracts have monthly billing terms and payment terms within 30 to 45 days after invoices have been issued. The Company attempts to negotiate two-week billing terms and 15-day payment terms on larger projects. The timing of billings to customers may generate contract assets or contract liabilities. Certain construction contracts include retention provisions to provide assurance to our customers that we will perform in accordance with the contract terms and are therefore not considered a financing benefit. The balances billed but not paid by customers pursuant to these provisions generally become due upon completion and acceptance of the project work or products by the customer. We have determined there are no significant financing components in our contracts as of and for the years ended September 30, 2022 and 2021.\nRetainage billed but not paid pursuant to contract provisions will be due upon completion of the contracts. Based on the Companys experience, management considers all amounts classified as retainage receivable to be collectible. All retainage receivable amounts are expected to be collected within the next fiscal year.\nThe Company provides an allowance for doubtful accounts when collection of an account or note receivable is considered doubtful, and receivables are written off against the allowance when deemed uncollectible. Inherent in the assessment of the allowance for doubtful accounts are certain judgments and estimates including, among others, the customers access to capital, the customers willingness or ability to pay, general economic conditions and the ongoing relationship with the customer.\nProperty and Equipment\nProperty and equipment are recorded at cost. Costs which extend the useful lives or increase the productivity of the assets are capitalized, while normal repairs and maintenance that do not extend the useful life or increase productivity of the asset are expensed as incurred. Property and equipment are depreciated principally on the straight-line method over the estimated useful lives of the assets: buildings 39 years; operating equipment and vehicles 5-7 years; and office equipment, furniture and fixtures 5-7 years.\nIntangible Assets\nAcquired intangible assets subject to amortization are amortized on a straight-line basis, which approximates the pattern in which the economic benefit of the respective intangible assets are realized, over their respective estimated useful lives. The definite-lived identifiable intangible assets recognized as part of the Company's business combinations are recorded at their estimated fair value.\nImpairment of Long-Lived Assets\nA long-lived asset shall be tested for recoverability whenever events or changes in circumstances indicate that its carrying amount may not be recoverable. If an evaluation is required, the estimated future undiscounted cash flows associated with the asset would be compared to the assets carrying amount to determine if a write-down to market value is required.\nClaims\nClaims are amounts in excess of the agreed contract price that a contractor seeks to collect from customers or others for customer-caused delays, errors in specifications and designs, contract terminations, change orders in dispute or unapproved as to both scope and price, or other causes of unanticipated additional costs. The Company records revenue on claims that management believes are probable. Revenue from a claim is recorded only to the extent that contract costs relating to the claim have been incurred.\nSelf -Insurance\nThe Company has its workers compensation, general liability and auto insurance through a captive insurance company. While the Company believes that this arrangement has been very beneficial in reducing and stabilizing insurance costs, the Company has to maintain a surety deposit to guarantee payments of premiums. The surety deposit had a balance of $1.8 million and $2.1 million as of September 30, 2022 and 2021, respectively, which is in Prepaid expenses and other on the Companys Consolidated Balance Sheets. Should the captive experience severe losses over an extended period, it could increase the Companys insurance expense or surety deposit required.\nAdvertising\nAll advertising costs are expensed as incurred. Total advertising expense was $17,000 and $55,000 for the years ended September 30, 2022 and 2021, respectively.\nStock Compensation Plans\nThe Company accounts for its equity-based compensation as prescribed by U.S. GAAP for share-based payments. The Company has adopted a fair value-based method of accounting for employee equity-based plans, whereby compensation cost is measured at the grant date based on the fair value of the award and is recognized over the service period, which is usually the vesting period. As a result, compensation expense relating to stock compensation plans will be reflected in net income as part of Selling and administrative expenses on the Consolidated Statements of Income.\nIncome Taxes\nThe Company and all subsidiaries file a consolidated federal and various state income tax returns on a fiscal year basis. With few exceptions, the Company is no longer subject to U.S. federal, state, or local income tax examinations for years ending prior to September 30, 2019. The Company follows the liability method of accounting for income taxes in accordance with U.S. GAAP. Under this method, deferred tax assets and liabilities are recorded for future tax consequences of temporary differences between financial reporting and tax bases of assets and liabilities, and are measured using the enacted tax rates and laws that are expected to be in effect when the underlying assets or liabilities are recovered or settled. A valuation allowance is established to reduce deferred tax assets if it is more likely than not that a deferred tax asset will not be realized.\nU.S. GAAP also prescribes a comprehensive model for how companies should recognize, measure, present and disclose in their financial statements uncertain tax positions taken or to be taken on a tax return. This evaluation is a two-step process. First, the recognition process determines if it is more likely than not that a tax position will be sustained based on the merits of the tax position upon examination by the appropriate taxing authority. Second, a measurement process is calculated to determine the amount of benefit/expense to recognize in the financial statements if a tax position meets the more likely than not recognition threshold. The tax position is measured at the greatest amount of benefit/expense that is more likely than not of being realized upon ultimate settlement. Any interest and penalty related to the unrecognized tax benefits, as the result of recognition of tax obligations resulting from uncertain tax positions, are included in the provision for income taxes. The Company had not recognized any uncertain tax positions at September 30, 2022 or 2021.\nEarnings Per Common Share\nBasic earnings per share is computed using the weighted average number of common shares outstanding during the year, and diluted earnings per share is computed using the weighted average number of common shares outstanding during the year adjusted for all potentially dilutive common stock equivalents, except in cases where the effect of the common stock equivalent would be anti-dilutive.\nCollective Bargaining Agreements\nCertain Energy Services subsidiaries are party to collective bargaining agreements with unions representing members that are employed by the Company. The agreements require such subsidiaries to pay specified wages and provide certain benefits to the union employees. These agreements expire at various times and have typically been renegotiated and renewed on terms that are similar to the ones contained in the expiring agreements.\nUnder certain collective bargaining agreements, the applicable Energy Services subsidiary is required to make contributions to multi-employer pension plans. If the subsidiary were to cease participation in one or more of these plans, a liability could potentially be assessed related to any underfunding of these plans. The amount of such assessment, were one to be made, cannot be reasonably estimated.\nLitigation Costs\nThe Company recognizes reserves when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. Litigation costs are expensed as incurred.\nNew Accounting Pronouncements\nOn October 28, 2021, the FASB released Accounting Standards Update (ASU) 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers. The amendments of this ASU require entities to apply Topic 606 to recognize and measure contract assets and contract liabilities in a business combination. The amendments improve comparability after the business combination by providing consistent recognition and measurement guidance for revenue contracts with customers acquired in a business combination and revenue contracts with customers not acquired in a business combination. The amendments are effective for public business entities for fiscal years, including interim periods within those fiscal years, beginning after December 15, 2022. For all other entities they are effective for fiscal years, including interim periods within those fiscal years, beginning after December 15, 2023. Entities should apply the amendments prospectively to business combinations that occur after the effective date. Early adoption is permitted, including in any interim period, for public business entities for periods for which financial statements have not yet been issued, and for all other entities for periods for which financial statements have not yet been made available for issuance. The Company is currently assessing the effect that ASU 2021-08 will have on their results of operations, financial position and cash flows; however, the Company does not expect a significant impact.\nThe FASB recently issued ASU 2021-10, Government Assistance (Topic 832): Disclosures by Business Entities about Government Assistance, which aims to provide increased transparency by requiring business entities to disclose information about certain types of government assistance they receive in the notes to the financial statements. Entities are required to provide the new disclosures prospectively for all transactions with a government entity that are accounted for under either a grant or a contribution accounting model and are reflected in the financial statements at the date of initially applying the new amendments, and to new transactions entered into after that date. Retrospective application of the guidance is permitted. The guidance in ASU 2021-10 is effective for financial statements of all entities for annual periods beginning after December 15, 2021, with early application permitted. ASU 2021-10 has not become effective for the Company; however, a significant impact is not expected.\nSubsequent Events\nOn October 10, 2022, the Company entered into a $3.1 million promissory note agreement with United Bank to finance the Ryan Environmental acquisition. This is a five-year agreement with a fixed interest rate of 6.0% and monthly payments of $59,932 beginning on November 10, 2022.\nIn February 2018, the Company filed a lawsuit against a former customer in the United States District Court for the Western District of Pennsylvania. The lawsuit is related to a dispute over work performed on a pipeline construction project. On November 16, 2022, a Judgement Order was issued, and the Company was awarded $13.1 million, of which $5.8 million was the jury award, $1.6 million was for attorneys fees, and $5.7 million was for penalties and interest. None of the award had been recognized in the Companys consolidated financial statements as of September 30, 2022. The Companys attorneys fees have been expensed as incurred. On December 16, 2022, the Defendant filed a notice of appeal with the court.\nManagement has evaluated all subsequent events for accounting and disclosure. There have been no other material events during the period, other than noted above, that would either impact the results reflected in the report or the Companys results going forward.\n3.\nREVENUE RECOGNITION\nOur revenue is primarily derived from construction contracts that can span several quarters. We recognize revenue in accordance with ASC Topic 606, Revenue from Contracts with Customers (ASC 606 or Topic 606) which provides for a five-step model for recognizing revenue from contracts with customers as follows:\n1. Identify the contract\n2. Identify performance obligations\n3. Determine the transaction price\n4. Allocate the transaction price\n5. Recognize revenue\nThe accuracy of our revenue and profit recognition in a given period depends on the accuracy of our estimates of the cost to complete each project. We believe our experience allows us to create materially reliable estimates. There are a number of factors that can contribute to changes in estimates of contract cost and profitability. The most significant of these include:\n● the completeness and accuracy of the original bid;\n● costs associated with scope changes;\n● changes in costs of labor and/or materials;\n● extended overhead and other costs due to owner, weather and other delays;\n● subcontractor performance issues;\n● changes in productivity expectations;\n● site conditions that differ from those assumed in the original bid;\n● changes from original design on design-build projects;\n● the availability and skill level of workers in the geographic location of the project;\n● a change in the availability and proximity of equipment and materials;\n● our ability to fully and promptly recover on affirmative claims and back charges for additional contract costs; and\n● the customers ability to properly administer the contract.\nThe foregoing factors, as well as the stage of completion of contracts in process and the mix of contracts at different margins may cause fluctuations in gross profit from period to period. Significant changes in cost estimates, particularly in our larger, more complex projects, could have a significant effect on our profitability.\nOur contract assets include cost and estimated earnings in excess of billings that represent amounts earned and reimbursable under contracts, including claim recovery estimates, but have a conditional right for billing and payment such as achievement of milestones or completion of the project. With the exception of customer affirmative claims, generally, such unbilled amounts will become billable according to the contract terms and generally will be billed and collected over the next three months. Settlement with the customer of outstanding affirmative claims is dependent on the claims resolution process and could extend beyond one year. Based on our historical experience, we generally consider the collection risk related to billable amounts to be low. When events or conditions indicate that it is probable that the amounts outstanding become unbillable, the transaction price and associated contract asset is reduced.\nOur contract liabilities consist of provisions for losses and billings in excess of costs and estimated earnings. Provisions for losses, if incurred, are recognized in the consolidated statements of income at the uncompleted performance obligation level for the amount of total estimated losses in the period that evidence indicates that the estimated total cost of a performance obligation exceeds its estimated total revenue. Billings in excess of costs and estimated earnings are billings to customers on contracts in advance of work performed, including advance payments negotiated as a contract condition. Generally, unearned project-related costs will be earned over the next twelve months.\n4.\nDISAGGREGATION OF REVENUE\nThe Company disaggregates revenue based on the following lines of service: (1) Gas & Water Distribution, (2) Gas & Petroleum Transmission, and (3) Electrical, Mechanical, & General services and construction. Certain reclassifications have been made to the year ended September 30, 2021, to reflect the current presentation. Our contract types are: Lump Sum, Unit Price, Cost Plus and T&M. The following tables present our disaggregated revenue for the fiscal years ended September 30, 2022 and 2021:\nYear Ended September 30, 2022\nElectrical,\nGas & Water\nGas & Petroleum\nMechanical,\nTotal revenue\nDistribution\nTransmission\nand General\nfrom contracts\nLump sum contracts\n$\n-\n$\n-\n$\n49,451,175\n$\n49,451,175\nUnit price contracts\n53,311,569\n55,637,622\n525,092\n109,474,283\nCost plus and T&M contracts\n-\n2,630,879\n36,033,663\n38,664,542\nTotal revenue from contracts\n$\n53,311,569\n$\n58,268,501\n$\n86,009,930\n$\n197,590,000\nEarned over time\n$\n34,493,112\n$\n54,551,248\n$\n83,557,477\n$\n172,601,837\nEarned at point in time\n18,818,457\n3,717,253\n2,452,453\n24,988,163\nTotal revenue from contracts\n$\n53,311,569\n$\n58,268,501\n$\n86,009,930\n$\n197,590,000\nYear Ended September 30, 2021\nElectrical,\nGas & Water\nGas & Petroleum\nMechanical,\nTotal revenue\nDistribution\nTransmission\nand General\nfrom contracts\nLump sum contracts\n$\n-\n$\n-\n$\n37,691,770\n$\n37,691,770\nUnit price contracts\n40,440,195\n20,928,518\n-\n61,368,713\nCost plus and T&M contracts\n-\n1,204,965\n22,200,378\n23,405,343\nTotal revenue from contracts\n$\n40,440,195\n$\n22,133,483\n$\n59,892,148\n$\n122,465,826\nEarned over time\n$\n26,244,396\n$\n20,928,518\n$\n58,796,767\n$\n105,969,681\nEarned at point in time\n14,195,799\n1,204,965\n1,095,381\n16,496,145\nTotal revenue from contracts\n$\n40,440,195\n$\n22,133,483\n$\n59,892,148\n$\n122,465,826\n5. CONTRACT BALANCES\nThe Companys accounts receivable consists of amounts that have been billed to customers and collateral is generally not required. Most of the Companys contracts have monthly billing terms; however, billing terms for some are based on project completion. Payment terms are generally within 30 to 45 days after invoices have been issued. The Company attempts to negotiate two-week billing terms and 15-day payment terms on larger projects. The timing of billings to customers may generate contract assets or contract liabilities.\nDuring the twelve months ended September 30, 2022, we recognized revenue of $3.0 million that was included in the contract liability balance at September 30, 2021.\nAccounts receivable-trade, net of allowance for doubtful accounts, contract assets and contract liabilities consisted of the following:\nSeptember 30, 2021\nSeptember 30, 2022\nChange\nAccounts receivable-trade, net of allowance for doubtful accounts\n$\n21,022,207\n$\n38,454,913\n$\n17,432,706\nContract assets\nCost and estimated earnings in excess of billings\n$\n8,730,402\n$\n16,109,593\n$\n7,379,191\nContract liabilities\nBillings in excess of cost and estimated earnings\n$\n3,153,290\n$\n6,027,578\n$\n2,874,288\n6. PERFORMANCE OBLIGATIONS\nFor the year ended September 30, 2022, there was no revenue recognized as a result of changes in contract transaction price related to performance obligations that were satisfied prior to September 30, 2021. The changes in contract transaction price were from items such as executed or estimated change orders, and unresolved contract modifications and claims.\nFor the year ended September 30, 2021, we recognized revenue of $430,000 as a result of changes in contract transaction price related to performance obligations that were satisfied prior to September 30, 2020. The changes in contract transaction price may be for items such as executed or estimated change orders, and unresolved contract modifications and claims.\nAt September 30, 2022, the Company had $69.5 million in remaining unsatisfied performance obligations, in which revenue is expected to be recognized in less than twelve months.\n7.\nALLOWANCE FOR DOUBTFUL ACCOUNTS\nActivity in the Companys allowance for doubtful accounts consists of the following:\nYear Ended September 30,\nBalance at beginning of year\n$\n70,310\n$\n70,310\nCharged to expense\n-\n-\nDeductions for uncollectible receivables written off, net of recoveries\n-\n-\nBalance at end of year\n$\n70,310\n$\n70,310\n8.\nUNCOMPLETED CONTRACTS\nCosts and estimated earnings in excess of billings on uncompleted contracts are included in contract assets on the Consolidated Balance Sheets. Billings in excess of costs and estimated earnings on uncompleted contracts are included in contract liabilities on the Consolidated Balance Sheets.\nCosts, estimated earnings, and billings on uncompleted contracts are summarized as follows:\nSeptember 30,\nSeptember 30,\nCosts incurred on contracts in progress\n$\n192,957,145\n$\n64,903,618\nEstimated earnings, net of estimated losses\n28,150,060\n13,280,334\n221,107,205\n78,183,952\nLess billings to date\n211,025,190\n72,606,840\n$\n10,082,015\n$\n5,577,112\nCosts and estimated earnings in excess of billed on uncompleted contracts\n$\n16,109,593\n$\n8,730,402\nLess billings in excess of costs and estimated earnings on uncompleted contracts\n6,027,578\n3,153,290\n$\n10,082,015\n$\n5,577,112\nThe Companys unaudited backlog at September 30, 2022, and September 30, 2021, was $142.3 million and $72.2 million, respectively.\n9.\nCLAIMS\nThe Company does not have any claims receivable as of September 30, 2022 and 2021. Claims receivable is a component of contract assets.\n10.\nPROVISION FOR LOSS\nThe Company has one project with a $248,000 provision for loss at September 30, 2022. The provision is recorded as cost of revenues on the Companys 2022 consolidated statements of income and accrued expenses and other current liabilities on the Companys consolidated balance sheet at September 30, 2022.\n11.\nPROPERTY, PLANT AND EQUIPMENT\nProperty, plant and equipment consist of the following:\nYear Ended September 30,\nLand\n$\n2,942,190\n$\n2,748,532\nBuildings and leasehold improvements\n9,291,898\n8,194,827\nOperating equipment and vehicles\n60,245,329\n48,941,730\nOffice equipment, furniture and fixtures\n1,046,172\n948,297\nAssets not yet in service\n210,844\n312,319\n73,736,433\n61,145,705\nLess accumulated depreciation\n41,074,646\n38,195,686\nProperty, plant and equipment, net\n$\n32,661,787\n$\n22,950,019\n12.\nSHORT-TERM DEBT\nShort-term debt consists of the following:\nOn July 13, 2022, the Company received a one-year extension on its operating line of credit effective June 28, 2022. The $15.0 million revolving line of credit has a $12.5 million component and a $2.5 million component. The Company can borrow from the $12.5 million component first and then from the additional $2.5 million component if additional requirements are met. The covenant requirement for both components are below. Based on the borrowing base calculation, the Company borrowed all $12.5 million available on the line of credit as of September 30, 2022. The Company did not meet the requirements to borrow any from the $2.5 million component.\nThe interest rate on the line of credit is the Wall Street Journal Prime Rate (the index) with a floor of 4.99%. The interest rate at September 30, 2022, was 5.5%. Based on the borrowing base calculation, the Company was able to borrow up to $12.2 million as of September 30, 2021. The Company had $4.5 million in borrowings on the line of credit, leaving $7.7 million available on the line of credit as of September 30, 2021. The interest rate at September 30, 2021, was 4.99%.\nUnder the terms of the agreement, the Company must meet the following loan covenants to access the first $12.5 million:\n1. Minimum tangible net worth of $21.5 million to be measured quarterly,\n2. Minimum traditional debt service coverage of 1.25x to be measured quarterly on a rolling twelve- month basis,\n3. Minimum current ratio of 1.50x to be measured quarterly,\n4. Maximum debt to tangible net worth ratio (TNW) of 1.5x to be measured semi-annually,\n5. Full review of accounts receivable aging report and work in progress. The results of the review shall be satisfactory to the lender in its sole and unfettered discretion.\nUnder the terms of the agreement, the Company must meet the following additional requirements for draw requests causing the borrowings to exceed $12.5 million:\n1. Minimum traditional debt service coverage of 2.0x to be measured quarterly on a rolling twelve-month basis,\n2. Minimum tangible net worth of $24.0 million to be measured quarterly.\nThe Company was not in compliance with all covenants but received a waiver on the $12.5 million component of the line of credit at September 30, 2022. The Company projects to be in compliance with all covenants associated with the $12.5 million component for the next twelve months.\nThe Company also finances insurance policy premiums on a short-term basis through a financing company. These insurance policies include workers compensation, general liability, automobile, umbrella, and equipment policies. The Company makes a down payment in January and finances the remaining premium amount over ten monthly payments. In January 2022 and 2021, respectively, the Company financed $3.4 million and $3.2 million in insurance premiums. At September 30, 2022 and 2021, respectively, the remaining balance of the insurance premiums was $580,000 and $540,000.\n13.\nSHORT-TERM AND LONG-TERM DEBT\nA summary of short-term and long-term debt as of September 30, 2022 and 2021 is as follows:\nLine of credit payable to bank, variable interest rate of 5.50% at September 30, 2022, final payment due by June 28, 2023, guaranteed by certain directors of the Company. See also Note 5.\n$\n12,500,000\n$\n4,500,000\nTerm note payable to United Bank, WV Pipeline acquisition, due in monthly installments of $64,853, fixed interest at 4.25%, final payment due by March 25, 2026, secured by receivables and equipment, guaranteed by certain directors of the Company.\n2,529,421\n3,183,549\nNotes payable to finance companies, due in monthly installments totaling $59,500 at September 30, 2022 and $70,062 at September 30, 2021, including interest ranging from 0.00% to 5.50%, final payments due October 2022 through August 2026, secured by equipment.\n889,165\n1,066,580\nNote payable to finance company for insurance premiums financed, due in monthly installments totaling $282,297 in FY 2022 and $272,000 in FY 2021, including interest rate at 3.27%, final payment December 2022.\n580,320\n540,250\nNotes payable to bank, due in monthly installments totaling $7,848, including interest at 4.82%, final payment due November 2034 secured by building and property.\n867,383\n919,017\nNotes payable to bank, due in monthly installments totaling $12,193, variable interest of 7.25% at September 30, 2022, final payment due November 2025 secured by building and property, guaranteed by certain directors of the Company.\n412,917\n530,750\nNotes payable to bank, due in monthly installments totaling $98,865, including interest at 4.99%, final payment due June 2022 secured by equipment, guaranteed by certain directors of the Company.\n-\n872,452\nNotes payable to David Bolton and Daniel Bolton, due in annual installments totaling $500,000, including interest at 3.25%, final payment due December 31, 2026, unsecured\n2,380,000\n2,850,000\nNotes payable to bank, fixed interest at 4.25% of outstanding balance due in monthly installments between January 2021 and January 2022. Note payments due in monthly installments totaling $68,150, including variable interest rate of 7.25% at September 30, 2022, with final payment due September 2026, secured by equipment, guaranteed by certain directors of the Company.\n2,549,281\n3,000,000\nTerm note payable to United Bank, Tri-State Paving acquisition, due in monthly installments of $129,910, fixed interest at 4.25%, final payment due by June 1, 2027, secured by receivables and equipment, guaranteed by certain directors of the Company.\n6,982,097\n-\nNotes payable to Corns Enterprises, due in annual installments totaling $250,000, including interest at 3.50%, final payment due April 29, 2026, unsecured\n943,836\n-\nTotal debt\n$\n30,634,420\n$\n17,462,598\nLess current maturities\n17,140,336\n8,441,824\nTotal long term debt\n$\n13,494,084\n$\n9,020,774\nAt September 30, 2022, future expected payments due on short-term and long-term debt are as follows:\n$\n17,140,336\n4,061,665\n4,170,114\n3,569,091\n1,069,272\nThereafter\n623,942\n$\n30,634,420\n14.\nINCOME TAXES\nThe components of income taxes are as follows:\nYear Ended September 30,\nFederal\nCurrent\n$\n78,000\n$\n(187,829)\nDeferred\n1,686,864\n165,108\nTotal\n1,764,864\n(22,721)\nState\nCurrent\n22,000\n(52,977)\nDeferred\n475,782\n46,569\nTotal\n497,782\n(6,408)\nTotal income tax expense (benefit)\n$\n2,262,646\n$\n(29,129)\nThe Companys income tax expense and deferred tax assets and liabilities reflect managements best estimate of current and future taxes to be paid. Significant judgments and estimates are required in the determination of the consolidated income tax expense. The Companys provision for income taxes is computed by applying a federal rate of 21.0% and a state rate of 6.0% to taxable income or loss after consideration of non-taxable and non-deductible items.\nThe income tax expense for fiscal year ended September 30, 2022 was $2.3 million and was due to an increase in taxable income. The income tax benefit for fiscal year ended September 30, 2021, was ($29,000). According to the Coronavirus Aid, Relief, and Economic Security Act (CARES Act) passed by Congress in March 2020, PPP loan forgiveness is not taxable. In accordance with the Consolidated Appropriations Act, 2021, the Companys PPP related expenditures in fiscal year 2020 were considered deductible expenses for federal income tax purposes.\nThe effective income tax rate for fiscal year ended September 30, 2022 was 37.0%. The effective income tax rate for fiscal year ended September 30, 2021, was (0.32%). The PPP forgiveness had a significant impact on the effective income tax rate for fiscal year ended September 30, 2021, as taxable income was decreased by $9.8 million. Effective income tax rates are estimates and may vary from period to period due to changes in the amount of taxable income or loss, non-taxable and non-deductible expenses.\nYear Ended September 30,\nStatutory rate\n21.0\n%\n21.0\n%\nState income taxes\n6.0\n%\n6.0\n%\nNon-deductible meals and other\n10.0\n%\n5.7\n%\nCredit from solar installation project\n-\n%\n(2.8)\n%\nPPP loan forgiveness\n-\n%\n(30.2)\n%\nEffective tax rate\n37.0\n%\n(0.3)\n%\nDeferred income taxes arise from temporary differences between the tax basis of assets and liabilities and their reported amounts in the consolidated financial statements, which will result in taxable or deductible amounts in the future. A valuation allowance is established when necessary to reduce deferred tax assets to the amount expected to be realized. At September 30, 2022, the Company expects all net operating loss carryforwards to be realized in the near future.\nThe income tax effects of temporary differences giving rise to the deferred tax assets and liabilities are as follows:\nYear Ended September 30,\nDeferred tax liabilities\nProperty and equipment\n$\n7,686,064\n$\n4,883,398\nOther\n7,632\n37,582\nTotal deferred tax liabilities\n$\n7,693,696\n$\n4,920,980\nDeferred income tax assets\nOther\n$\n404,093\n$\n358,400\nNet operating loss carryforward\n2,834,524\n2,529,147\nTotal deferred tax assets\n$\n3,238,617\n$\n2,887,547\nTotal net deferred tax liabilities\n$\n4,455,079\n$\n2,033,433\nThe Company does not believe that it has any unrecognized tax benefits included in its consolidated financial statements that require recognition. The Company has not had any settlements in the current period with taxing authorities, nor has it recognized tax benefits as a result of a lapse of the applicable statute of limitations. The Company recognizes interest and penalties accrued related to unrecognized tax benefits, if applicable, in general and administrative expenses.\n15.\nEARNINGS PER SHARE\nEarnings per share for the years ended September 30, 2022, and 2021 are as follow:\nTwelve Months Ended\nTwelve Months Ended\nSeptember 30,\nSeptember 30,\nNet income\n$\n3,850,073\n$\n9,097,255\nDividends on preferred stock\n-\n284,238\nIncome available to common shareholders\n$\n3,850,073\n$\n8,813,017\nWeighted average shares outstanding-basic\n16,323,790\n13,621,406\nWeighted average shares outstanding-diluted\n16,323,790\n16,988,424\nEarnings per share available to common shareholders\n$\n0.24\n$\n0.65\nEarnings per share available to common shareholders-diluted\n$\n0.24\n$\n0.52\n16.\nSTOCK PURCHASE PLAN\nAt the annual meeting of the shareholders on November 19, 2008, the shareholders approved the establishment of an employee stock purchase plan. The stock purchase plan authorizes the issuance of up to 1,200,000 shares of common stock for purchase by eligible employees. A participants stock purchased during a calendar year may not exceed the lesser of (a) a percentage of the participants compensation or a total amount as specified by the compensation committee of the Board, or (b) $25,000. The stock will be offered at a purchase price of at least 85% of its fair market value on the date of purchase. The major plan provisions cover the purposes of the plan, effective date and duration, administration, eligibility, stock type, stock purchase limitations, price of stock, participation election, payroll deductions, payment for stock, date of purchase, termination of agreement, termination of employment, recapitalization, change of control, assignability, Stockholder rights, compliance with Internal Revenue Code Section 423, amendment and termination, application of funds, tax withholdings, governing laws, employment at will and arbitration. There have been no agreements with any employees made under this plan as of the year ended September 30, 2022.\nOn July 6, 2022, the Companys Board of Directors authorized a share repurchase program (the Program), pursuant to which the Company may, from time to time, purchase shares of its common stock for an aggregate repurchase not to exceed 1,000,000 shares, which is approximately 6.0% of its outstanding common stock. The Program does not obligate the Company to purchase any number of shares, and there is no guarantee as to the exact number of shares to be repurchased by the Company. To date, no repurchases have been made in connection with the Program.\n17.\nLONG TERM INCENTIVE PLAN\nOn February 16, 2022, the stockholders of Energy Services approved the Companys 2022 Equity Incentive Plan (the Plan), which provides for the grant of stock-based awards to officers and employees of the Company and its subsidiaries. The maximum number of shares of stock, in the aggregate, that may be granted under the Plan as stock options, restricted stock or restricted stock units is 1,500,000 shares. A description of the material terms of the Plan is contained in the Companys definitive proxy statement for the Annual Meeting of Stockholders filed with the Securities and Exchange Commission on January 11, 2022. To date, no grants of stock-based awards have been made.\n18.\nRELATED PARTY TRANSACTIONS\nThe Company intends that all transactions between it and our executive officers, directors, holders of 10% or more of the shares of any class of our common stock and affiliates thereof, will be on terms no less favorable than those terms given to unaffiliated third parties and will be approved by a majority of our independent outside directors not having any interest in the transaction.\nOn December 16, 2014, the Companys Nitro subsidiary entered into a 20-year $1.2 million loan agreement with First Bank of Charleston, Inc. (West Virginia) to purchase the office building and property it had previously been leasing for $6,300 each month. The interest rate on the loan agreement is 4.82% with monthly payments of $7,800. As of September 30, 2022, the Company had paid approximately $333,000 in principal and approximately $370,000 in interest since the beginning of the loan. Mr. Douglas Reynolds, President of Energy Services, was a director and secretary of First Bank of Charleston. Mr. Samuel Kapourales, a director of Energy Services, was also a director of First Bank of Charleston. On October 15, 2018, First Bank of Charleston was merged into Premier Bank, Inc., a wholly owned subsidiary of Premier Financial Bancorp, Inc. Mr. Marshall Reynolds, Chairman of the Board of Energy Services, held the same position with Premier Financial Bancorp, Inc. Mr. Douglas Reynolds is the president and a director of Energy Services and was a director of Premier Financial Bancorp, Inc. On September 17, 2021, Peoples Bancorp, Inc., parent company of Peoples Bank, completed an acquisition of Premier Financial Bancorp, Inc. and its wholly owned subsidiaries, Premier Bank and Citizens Deposit Bank & Trust. On October 26, 2021, Mr. Douglas Reynolds was elected a director of Peoples Bancorp, Inc., and its subsidiary Peoples Bank.\nOn April 29, 2022, the Company entered into a $1.0 million promissory note agreement with Corns Enterprises as partial consideration for the purchase of Tri-State Paving. This four-year agreement requires $250,000 principal installment payments on or before the end of each twelve (12) full calendar month period beginning April 29, 2022. Interest payments due shall be calculated on the principal balance remaining and shall be at the stated rate of 3.5% per year. The Company recorded $7,800 in accreted interest and has not made any principal payments on this note as of September 30, 2022.\nSubsequent to the April 29, 2022, acquisition of Tri-State Paving, the Company entered into a operating lease for facilities in Hurricane, West Virginia with Corns Enterprises. This thirty-six-month lease is treated as a right to use asset and has payments of $7,000 per month. The total net present value at inception was $236,000 with a carrying value of $205,000 at September 30, 2022.\nSQP made an equity investment of $156,000 in 1030 Quarrier Development, LLC (Development) in August 2022. Development is a variable interest entity (VIE) that is 75% owned by 1030 Quarrier Ventures, LLC (Ventures) and 25% owned by SQP. SQP is not the primary beneficiary of the VIE and therefore, will not consolidate Development into its consolidated financial statements. Instead, SQP will apply the equity method of accounting for its investment in Development. Development, a 1% owner, and United Bank, a 99% owner, formed 1030 Quarrier Landlord, LLC (Landlord). Landlord decided to pursue the following development project (the Project): An old building at 1030 Quarrier Street, Charleston, West Virginia as well as associated land (the Property) was purchased to be developed/rehabilitated into a commercial project including apartments and commercial space.\nUpon the completion of development, the Property will be used to generate rental income. SQP has been awarded the construction contract for the Project. United Bank provided $5.0 million in loans to fund the Project. SQP and Ventures has jointly provided an unconditional guarantee for the $5.0 million of obligations associated with the Project.\nOther than mentioned above, there were no new material related party transactions entered into during the fiscal year ended September 30, 2022.\nCertain Energy Services subsidiaries routinely engage in transactions in the normal course of business with each other, including sharing employee benefit plan coverage, payment for insurance and other expenses on behalf of other affiliates, and other services incidental to business of each of the affiliates. All revenue and related expense transactions, as well as the related accounts payable and accounts receivable have been eliminated in consolidation.\n19.\nLEASE OBLIGATIONS\nThe Company leases office space for SQP for $1,500 per month. The lease, signed on March 25, 2021, is for a period of two years with five one-year renewals available immediately following the end of the base term. Rental terms for the option periods shall be negotiated and agreed mutually between the parties and shall not exceed five percent increases to rent, if any. The lease is expensed monthly and not treated as a right-to-use asset as it does not have a material impact on the Companys consolidated financial statements.\nDuring the twelve months ended September 30, 2022, the Company entered into two lease agreements of construction equipment for a combined $160,000. The leases have a term of twenty-two months with a stated interest rate of 0%, combined monthly installment payments of $6,645 and are cancellable at any time without penalty. The Company has the right to purchase the equipment at the expiration of the leases by applying the two-month deposit paid. The right-of-use assets and finance lease obligations associated with these lease agreements are included in the consolidated balance sheets within property, plant and equipment and long-term debt, respectively, and do not have a material impact on the Companys consolidated financial statements.\nThe Company has two right-of-use operating leases acquired on April 29, 2022, as part of the Tri-State Paving, LLC transaction. The first operating lease, for the Hurricane, WV facility, had a net present value of $236,000 at April 29, 2022, and a carrying value of $205,000 at September 30, 2022. The second operating lease, for the Chattanooga, Tennessee facility, had a net present value of $144,000 at April 29, 2022, and a carrying value of $119,000 at September 30, 2022. The 4.5% interest rate on the operating leases is based on the Companys incremental borrowing rate at inception.\nThe Company has a right-of-use operating lease with Enterprise Fleet Management, Inc. acquired on August 11, 2022, as part of the Ryan Environmental acquisition. This lease agreement was initially for 31 vehicles to be used for Ryan Construction; however, the Company plans to add vehicles as it finds necessary. This lease had a net present value of $1.2 million at inception, which approximates the carrying value at September 30, 2022. The 4.5% interest rate on the operating lease is based on the Companys incremental borrowing rate at inception.\nThe Company has a right-of-use operating lease with RICA Developers, LLC acquired on August 12, 2022, as part of the Ryan Environmental acquisition. This lease, for the Bridgeport, WV facility, had a net present value of $140,000 at inception and a carrying value of $113,000 at September 30, 2022. The 4.5% interest rate on the operating lease is based on the Companys incremental borrowing rate at inception.\nSchedules related to the Companys operating leases at fiscal year ended September 30, 2022 can be found below:\nOperating Lease-Weighted Average Remaining Term\nYears left\nRemaining liability\nLease end\nFiscal year end\nOperating lease 1\n2.6\n$\n205,267\n4/30/2025\nOperating lease 2\n1.8\n119,032\n5/31/2024\nOperating lease 3\n3.9\n1,166,498\n8/10/2026\nOperating lease 4\n1.0\n113,480\n8/11/2023\n$\n1,604,277\nWeighted average remaining term\n3.4\nyears\nOperating Lease Maturity Schedule\n$\n588,653\n465,428\n373,397\n296,606\n1,724,084\nLess amounts representing interest\n(119,807)\nPresent value of operating lease liabilities\n$\n1,604,277\nYear ended\nSeptember 30,\nOperating Lease Expense\nAmortization\nOperating lease 1\n$\n30,933\nOperating lease 2\n25,554\nOperating lease 3\n22,672\nOperating lease 4\n19,552\nTotal amortization\n98,711\nInterest\nOperating lease 1\n4,067\nOperating lease 2\n2,411\nOperating lease 3\n4,360\nOperating lease 4\nTotal interest\n11,802\nTotal amortization and interest\n$\n110,513\nYear ended\nSeptember 30,\nCash Paid for Operating Leases\nOperating lease 1\n$\n35,000\nOperating lease 2\n27,965\nOperating lease 3\n27,032\nOperating lease 4\n27,561\n$\n117,558\nThe Company rents equipment for use on construction projects with rental agreements being week to week or month to month. Rental expense can vary by fiscal year due to equipment requirements on construction projects and the availability of Company owned equipment. Rental expense, which is included in cost of goods sold on the consolidated statements of income, was $9.8 million and $3.6 million for the years ended September 30, 2022, and 2021, respectively.\n20.\nMAJOR CUSTOMERS\nThe tables below present customers that represent 10.0% or more of the Companys revenue or accounts receivable, net of retention as of or for the fiscal years ended September 30, 2022, and 2021:\nRevenue\nFY 2022\nFY 2021\nTransCanada Corporation\n16.6\n%\n11.0\n%\nAll other\n83.4\n%\n89.0\n%\nTotal\n100.0\n%\n100.0\n%\n* Less than 10.0% and included in All other if applicable\nAccounts receivable, net of retention\nFY 2022\nFY 2021\nTransCanada Corporation\n11.6\n%\n13.2\n%\nKentucky American Water\n*\n16.3\n%\nAll other\n88.4\n%\n70.5\n%\nTotal\n100.0\n%\n100.0\n%\n* Less than 10.0% and included in All other if applicable\nVirtually all work performed for major customers was awarded under competitive bid fixed price or unit price arrangements. The loss of a major customer could have a severe impact on the profitability of operations of the Company. However, due to the nature of the Companys operations, the major customers and sources of revenues may change from year to year.\n21.\nRETIREMENT AND EMPLOYEE BENEFIT PLANS\nIn 2022 and 2021, C. J. Hughes maintained a tax-qualified 401(k) retirement plan for union employees. Employees can contribute up to 15% of eligible wages, provided the compensation deferred for a plan year does not exceed the indexed dollar amount set by the Internal Revenue Service which was $20,500 for 2022 and 2021. C. J. Hughes matches $0.25 on each dollar contributed up to 6% of eligible wages.\nC. J. Hughes contributed $22,000 and $26,000 to the union plan for fiscal years September 30, 2022 and 2021, respectively. Additionally, each plan year, C. J. Hughes may make a discretionary profit-sharing contribution for participants who are actively employed on the last day of the plan year. No discretionary profit-sharing contribution was made for the 2022 or 2021 plan year.\nEffective January 1, 2010, Energy Services became the successor plan sponsor of the C. J. Hughes Construction Company, Inc. 401(k) Plan for non-union employees (the Plan). The Plan was renamed the Energy Services of America Staff 401(k) Retirement Savings Plan. Employees are eligible to participate in the Plan upon completion of six months of service but must wait until a quarterly entry to join the Plan. In addition, participants who are age 50 or older by the end of the Plan year may elect to defer up to an additional $6,500 into the 401(k) Plan for 2022.\nEnergy Services may make annual discretionary matching contributions and/or profit-sharing contributions to the Plan. The matching contribution formula for the Plan was 100% of each dollar contributed for the first 3% of eligible wages and 50% of each dollar contributed for the next 3% of eligible wages. The Companys matching contribution is used by the Plans third-party administrator to purchase Energy Services of America common stock from the open market. No restrictions on the match exist after it has been contributed. No profit-sharing contribution was made for the 2022 or 2021 plan year.\nEnergy Services and its wholly owned subsidiaries contributed $402,000 and $365,000, respectively, for the fiscal years ended September 30, 2022, and 2021 to the Plan. In addition, during fiscal year 2021, a one-time $651,000 Qualified Non-Elective Contribution (QNEC) was made to the Plan attributable to the 2021 Plan year to adjust Plan participants balances due to a third-party administrators actions.\nThe Company contributes to a number of multi-employers defined benefit pension plans under the terms of collective-bargaining agreements that cover its union-represented employees. The risks of participating in these multi-employer plans are different from single-employer plans in the following aspects:\n● Assets contributed to the multi-employer plan by one employer may be used to provide benefits to employees of other participating employers. If participating employers stop contributing to the plan, the unfunded obligations of the plan may be borne by the remaining participating employers.\n● If the Company chooses to stop participating in some of its multi-employer plans, the Company may be required to pay those plans an amount based on the underfunded status of the plan, referred to as a withdrawal liability.\nThe following table presents our participation in these plans:\nContributions of\nPension Protection Act (\"PPA\")\nEnergy Services\nCertified Zone Status (1)\nFIP/RP Status\nCompanies\nExpiration Date of\nEIN/Pension\nPending/\nSurcharge\nCollective Bargaining\nPension Fund\nPlan Number\nImplemented (2)\nImposed\nAgreement\nCentral States, Southeast and Southwest Areas Pension Fund\n36-6044243/001\nRed\nRed\nImplemented\n$\n123,142\n$\n-\nno\nVarious\nEmployer-Teamsters Local Nos. 175 and 505\n55-6021850/001\nRed\nRed\nImplemented\n-\n-\nno\nVarious\nLaborers National Pension Fund\n75-1280827/001\nRed\nRed\nImplemented\n384,908\n394,563\nno\nVarious\nLaborers' District Council of Western Pennsylvania Pension Plan\n25-6135576/001\nYellow\nYellow\nImplemented\n269,915\n-\nno\nVarious\nOperating Engineers Local 324 Pension Fund\n38-1900637/001\nRed\nRed\nImplemented\n66,757\n-\nno\nVarious\nNational Automatic Sprinkler Industry Pension Fund\n52-6054620/001\nRed\nRed\nImplemented\n199,984\n121,133\nno\nVarious\nIron Workers District Council of Southern Ohio &Vicinity Pension Trust\n31-6038516/001\nYellow\nYellow\nImplemented\n208,588\n160,367\nno\nVarious\nCarpenters Pension Fund of WV\n55-6027998/001\nRed\nRed\nImplemented\n719,665\n281,568\nno\nVarious\nPlumbers & Pipefitters National Pension Fund\n52-6152779/001\nYellow\nYellow\nImplemented\n660,324\n616,568\nno\nVarious\nSheet Metal Workers' National Pension Fund\n52-6112463/001\nYellow\nYellow\nImplemented\n175,643\n538,286\nno\nVarious\nSheet Metal Workers Local Pension Fund\n34-6666753/001\nRed\nRed\nImplemented\n-\n-\nno\nVarious\nPlumbers and Pipefitters Local 152 Pension Fund\n55-6029095/001\nRed\nRed\nImplemented\n-\n2,492\nno\nVarious\nAll Other\nGreen\nGreen\n3,611,624\n2,783,713\nno\nVarious\n$\n6,420,550\n$\n4,898,691\n(1) The most recent PPA zone status available in 2022 and 2021 is the plans year-end during 2021 and 2020, respectively. The zone status is based on information that we received from the plan and is certified by the plans actuary. Among other factors, plans in the red zone are generally less than 65 percent funded, plans in the orange zone are less than 80 percent funded and have an Accumulated Funding Deficiency in the current year or projected into the next six years, plans in the yellow zone are less than 80 percent funded, and plans in the green zone are at least 80 percent funded.\n(2) Indicates whether the plan has a financial improvement plan (FIP) or a rehabilitation plan (RP) which is either pending or has been implemented.\nThe Company currently does not have intentions of withdrawing from any of the multi-employer pension plans in which it participates.\nOn November 12, 2021, the Company received a withdrawal liability claim from a pension plan to which the Company made pension contributions for union construction employees performing covered work in a particular jurisdiction. The Company has not performed covered work in their jurisdiction since 2011; however, the Company disagrees with the withdrawal claim and believes it is covered by an exemption under federal law. The demand called for thirty-four quarterly installment payments of $41,000 starting December 15, 2021. The Company must comply with the demand under federal pension law; however, the Company firmly believes no withdrawal liability exists. The Company is in negotiations with the pension fund to resolve the matter and all future payments have been suspended as part of the negotiation. The Company has expensed all $164,000 in payments made through September 30, 2022, and does not expect any future liabilities related to this claim.\n22.\nCREDIT RISK\nFinancial instruments which potentially subject the Company to credit risk consist primarily of cash, cash equivalents and contract receivables. The Company places its cash with high quality financial institutions. At times, the balances in such institutions may exceed the FDIC insurance limit of $250,000 per depositor, per insured bank, for each account ownership category. FDIC insurance covers all deposit accounts, including checking accounts, savings accounts, money market deposit accounts, and certificates of deposit. As of September 30, 2022, the Company had $4.9 million of uninsured deposits.\nThe Company performs periodic credit evaluations of its customers financial condition and generally does not require collateral. Consequently, the Company is subject to potential credit risk related to business and economic factors that would affect these companies. However, the Company generally has certain statutory lien rights with respect to services provided. Credit losses consistently have been within managements expectations.\n23.\nCOMMITMENTS AND CONTINGENCIES\nDuring the normal course of operations, the Company is subject to certain subcontractor claims, mechanics liens, and other litigation. Management is of the opinion that no material obligations will arise from any pending legal proceedings. Accordingly, no provision has been made in the financial statements for such litigation.\nSome customers, particularly new ones or governmental agencies require the Company to post bid bonds, performance bonds and payment bonds (collectively, performance bonds). These performance bonds are obtained through insurance carriers and guarantee to the customer that we will perform under the terms of a contract and that we will pay subcontractors and vendors. If the Company fails to perform under a contract or to pay subcontractors and vendors, the customer may demand that the insurer make payments or provide services under the bond. The Company must reimburse the insurer for any expenses or outlays it is required to make.\nIn February 2014, the Company entered into an agreement with a surety company to provide bonding which will suit the Companys immediate needs. The ability to obtain bonding for future contracts is an important factor in the contracting industry with respect to the type and value of contracts that can be bid.\nDepending upon the size and conditions of a particular contract, the Company may be required to post letters of credit or other collateral in favor of the insurer. Posting of these letters or other collateral will reduce our borrowing capabilities. The Company does not anticipate any claims in the foreseeable future. At September 30, 2022, the Company had $82.8 million in performance bonds outstanding.\nIn fiscal year 2021, the Company received notification of forgiveness on the $9.8 million in PPP loans received in calendar year 2020. The Company must retain PPP loan documentation in its files for six years after the date of forgiveness. The Company believes it meets the SBAs certification requirement based on its limited access to capital, weakened business operations during the pandemic and small market value. The Companys shares of common stock did not trade on a national exchange at that time. However, no assurance can be given as to the outcome if the SBA re-evaluates the Companys loan certification. The SBA could determine that the Company does not qualify in whole or in part for loan forgiveness. In addition, it is unknown what type of penalties could be assessed against the Company if the SBA disagrees with the Companys certification. The Company could be required to repay its PPP Loans. Any penalties in addition to the potential repayment of the PPP Loans could negatively impact the Companys business, financial condition and results of operations and prospects.\n24. ACQUISITIONS\nEnergy Services accounts for business combinations under the acquisition method in accordance with ASC Topic 805 Business Combinations. Accordingly, for the transaction, the purchase price is allocated to the fair value of the assets acquired and liabilities assumed as of the date of the acquisition. In conjunction with ASC 805, upon receipt of final fair value estimates during the measurement period, which must be within one year of the acquisition date, Energy Services records any adjustments to the preliminary fair value estimates in the reporting period in which the adjustments are determined.\nOn April 29, 2022, the Company completed the acquisition of Tri-State Paving LLC, located in Hurricane, West Virginia. Pursuant to the Asset Purchase Agreement (Agreement) signed on April 6, 2022, and amended on April 29, 2022, the Company acquired substantially all the assets (including but not limited to customer contracts, employees, and equipment) of Tri-State Paving, LLC for $7.5 million in cash, a $1.0 million promissory note, and $1.0 million in Energy Services common stock. The $7.5 million in cash was funded through a loan with United Bank and the transaction resulted in the issuance of 419,287 common shares.\nAs part of the Agreement, the Company entered into a four-year, $1.0 million note that requires $250,000 principal installment payments on or before the end of each twelve (12) full calendar month period beginning on the date of the Note, April 29, 2022. Interest payments due shall be calculated on the principal balance remaining and shall be at the stated rate of 3.5% per year.\nThe non-cash purchase price, including $390,000 of debt assumed, for the Tri-State Paving acquisition is allocated in the table below:\nProperty and equipment\n$\n5,709,094\nGoodwill\n2,273,237\nCustomer relationships\n1,649,159\nNon-compete\n39,960\nTradename\n203,213\nTotal\n$\n9,874,663\nOn August 11, 2022, Ryan Construction, a newly formed wholly owned subsidiary of Energy Services, completed the acquisition of Ryan Environmental, located in Bridgeport, WV, pursuant to an order issued by the United States Bankruptcy Court for the Northern District of West Virginia (the Court) on August 9, 2022 and Ryan Transport, located in Bridgeport, West Virginia, under the terms of an Asset Purchase Agreement. As part of the business combination, the Company acquired certain assets, including equipment, vehicles, and small tools, of Ryan Environmental for $3.0 million in cash and certain assets, including equipment and small tools, of Ryan Transport for $1.0 million in cash.\nThe purchase price for the Ryan Environmental and Ryan Transport acquisitions is allocated in the table below:\nProperty and equipment\n$\n3,237,559\nAccounts receivable, net of $250,000 allowance\n677,254\nUnbilled receivable\n127,244\nTotal\n$\n4,042,057\nASC 805-10-50-2 requires public companies that present comparative financial statements to present pro forma financial statements as though the business combination that occurred during the current fiscal year had occurred as of the beginning of the comparable prior annual reporting period. As allowed under ASC 805-10-50-2, the Company finds this information impracticable to provide for the periods presented due to the lack of availability of meaningful financial statements of the acquired companies that comply with U.S. GAAP.\n25. GOODWILL AND INTANGIBLE ASSETS\nThe Company follows the guidance of ASC 350-20-35-3 Intangibles-Goodwill and Other (Topic 350) which requires a company to record an impairment charge based on the excess of a reporting units carrying amount of goodwill over its fair value. Under the current guidance, companies can first choose to assess any impairment based on qualitative factors (Step 0). If a company fails this test or decides to bypass this step, it must proceed with a quantitative assessment of goodwill impairment. The Company did not have a goodwill impairment at September 30, 2022 or 2021.\nA table of the Companys goodwill is below:\nSeptember 30,\nSeptember 30,\nBeginning balance\n$\n1,814,317\n$\n-\nAcquired\n2,273,237\n1,814,317\nEnding balance\n$\n4,087,554\n$\n1,814,317\nA table of the Companys intangible assets subject to amortization at September 30, 2022, is below:\nAccumulated\nAccumulated\nAmortization and\nAmortization and\nAmortization and\nImpairment\nRemaining Life at\nImpairment at\nImpairment at\nTwelve Months Ended\nSeptember 30,\nOriginal\nSeptember 30,\nSeptember 30,\nSeptember 30,\nNet Book\nIntangible assets:\nCost\nValue\nWest Virginia Pipeline:\nCustomer Relationships\n99 months\n$\n2,209,724\n$\n386,693\n$\n165,725\n$\n220,968\n$\n1,823,031\nTradename\n99 months\n263,584\n46,136\n19,772\n26,364\n217,448\nNon-competes\n3 months\n83,203\n72,806\n31,202\n41,604\n10,397\nRevolt Energy:\nEmployment agreement/non-compete\n19 months\n100,000\n77,779\n13,889\n63,890\n22,221\nTri-State Paving:\nCustomer Relationships\n115 months\n1,649,159\n66,781\n-\n66,781\n1,582,378\nTradename\n115 months\n203,213\n8,368\n-\n8,368\n194,845\nNon-competes\n7 months\n39,960\n16,590\n-\n16,590\n23,370\nTotal intangible assets\n$\n4,548,843\n$\n675,153\n$\n230,588\n$\n444,565\n$\n3,873,690\nThe amortization on identifiable intangible assets for fiscal years ended September 30, 2022 and 2021 was $445,000 and $231,000, respectively.\nAmortization expense associated with the identifiable intangible assets is expected to be as follows:\nAmortization Expense\n$\n483,004\n438,122\n432,569\n432,569\n432,569\nAfter\n1,654,856\nTotal\n$\n3,873,690\n26. SUBSEQUENT EVENTS\nOn October 10, 2022, the Company entered into a $3.1 million promissory note agreement with United Bank to finance the Ryan Environmental acquisition. This is a five-year agreement with a fixed interest rate of 6.0% and monthly payments of $59,932 beginning on November 10, 2022.\nIn February 2018, the Company filed a lawsuit against a former customer in the United States District Court for the Western District of Pennsylvania. The lawsuit is related to a dispute over work performed on a pipeline construction project. On November 16, 2022, a Judgement Order was issued, and the Company was awarded $13.1 million, of which $5.8 million was the jury award, $1.6 million was for attorneys fees, and $5.7 million was for penalties and interest. None of the award had been recognized in the Companys consolidated financial statements as of September 30, 2022. The Companys attorneys fees have been expensed as incurred. On December 16, 2022, the Defendant filed a notice of appeal with the court.\nManagement has evaluated all subsequent events for accounting and disclosure. There have been no other material events during the period, other than noted above, that would either impact the results reflected in the report or the Companys results going forward."
}