{
    "cik": "1359687",
    "company": "RED TRAIL ENERGY, LLC",
    "filing_type": "10-K",
    "filing_date": "2022-12-29",
    "period_of_report": "2022-09-30",
    "sic": "2860",
    "state_of_inc": "ND",
    "state_location": "ND",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1359687/0001359687-22-000020-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1359687/000135968722000020/rte-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1359687/0001359687-22-000020.txt",
    "filename": "1359687_10K_2022_0001359687-22-000020.htm",
    "content": "Item 1. Business\nItem IA. Risk Factors\nItem 2. Properties\nItem 3. Legal Proceedings\nItem 4. Mine Safety Disclosures\nPART II\nItem 5. Market for Registrant's Common Equity, Related Member Matters and Issuer Purchases of Equity Securities\nItem 6. Reserved.\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\nItem 8. Financial Statements and Supplementary Data\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nItem 9A. Controls and Procedures\nItem 9B. Other Information\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nItem 11. Executive Compensation\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Member Matters\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nItem 14. Principal Accountant Fees and Services\nPART IV\nItem 15. Exhibits and Financial Statement Schedules\nItem 16. Form 10-K Summary\nSIGNATURES\nCAUTIONARY STATEMENTS REGARDING FORWARD-LOOKING STATEMENTS\nThis annual report contains historical information, as well as forward-looking statements that involve known and unknown risks and relate to future events, our future financial performance, or our expected future operations and actions. In some cases, you can identify forward-looking statements by terminology such as \"may,\" \"will,\" \"should,\" \"expect,\" \"plan,\" \"anticipate,\" \"believe,\" \"estimate,\" \"future,\" \"intend,\" \"could,\" \"hope,\" \"predict,\" \"target,\" \"potential,\" or \"continue\" or the negative of these terms or other similar expressions. These forward-looking statements are only our predictions based on current information and involve numerous assumptions, risks, and uncertainties. Our actual results or actions may differ materially from these forward-looking statements for many reasons, including the reasons described in this report. While it is impossible to identify all such factors, factors that could cause actual results to differ materially from those estimated by us include:\nA slowdown in global and regional economic activity, decreased demand for our products, and the potential for labor shortages and shipping disruptions resulting from pandemics including COVID-19;\nThe reduction or elimination of the renewable fuels use requirement in the Federal Renewable Fuels Standard (RFS);\nDecreases in export demand due to the imposition of tariffs by foreign governments on ethanol, distillers grains, and soybeans produced in the United States including:\n◦The Chinese distillers grains tariffs and their impact on world distillers grains markets; and\n◦The Chinese and Brazilian ethanol import duties and their impact on world ethanol demand and prices.\nAny delays in shipping our products by rail and corresponding decreases in our sales as a result of these shipping delays;\nAn unfavorable spread between the market price of our products and our feedstock costs;\nFluctuations in the price and market for ethanol, distillers grains, and corn oil;\nAvailability and costs of our raw materials, particularly corn and natural gas;\nChanges in or lack of availability of credit;\nChanges in the environmental regulations that apply to our plant operations and our ability to comply with such regulations;\nEthanol supply exceeding demand and corresponding ethanol price reductions impacting our ability to operate profitably and maintain a positive spread between the selling price of our products and our raw material costs;\nOur ability to generate and maintain sufficient liquidity to fund our operations, meet debt service requirements and necessary capital expenditures;\nOur ability to continue to meet our loan covenants;\nOur ability to retain key employees and maintain labor relations;\nLimitations and restrictions contained in the instruments and agreements governing our indebtedness;\nResults of our hedging transactions and other risk management strategies;\nChanges in or elimination of governmental laws, tariffs, trade, or other controls or enforcement practices that currently benefit the ethanol industry including:\n◦national, state, or local energy policy - examples include legislation already passed such as the California low-carbon fuel standard as well as potential legislation in the form of carbon cap and trade;\n◦legislation mandating the use of ethanol or other oxygenate additives; or\n◦environmental laws and regulations that apply to our plant operations and their enforcement.\nChanges and advances in ethanol production technology;\nCompetition from alternative fuels and alternative fuel additives;\nCompetition from the increased use of electric vehicles;\nUse by the EPA of small refinery exemptions; and\nGlobal economic uncertainty, inflation, market disruptions, and increased volatility in commodity prices caused in part by the Russian invasion of Ukraine and resulting sanctions by the United States and other countries.\nOur actual results or actions could and likely will differ materially from those anticipated in the forward-looking statements for many reasons, including the reasons described in this report. We are not under any duty to update the forward-looking statements contained in this report. We cannot guarantee future results, levels of activity, performance, or achievements. We caution you not to put undue reliance on any forward-looking statements, which speak only as of the date of this report. You should read this report and the documents that we reference in this report and have filed as exhibits completely and with the understanding that our actual future results may be materially different from what we currently expect. We qualify all of our forward-looking statements by these cautionary statements.\nAVAILABLE INFORMATION\nInformation about us is also available at our website at www.redtrailenergyllc.com, under \"SEC Compliance,\" which includes links to reports we have filed with the Securities and Exchange Commission. The contents of our website are not incorporated by reference in this Annual Report on Form 10-K.\nPART I\nITEM 1. BUSINESS\nBusiness Development\nRed Trail Energy, LLC was formed as a North Dakota limited liability company in July of 2003, for the purpose of constructing, owning, and operating a fuel-grade ethanol plant near Richardton, North Dakota in western North Dakota. References to \"we,\" \"us,\" \"our\" and the \"Company\" refer to Red Trail Energy, LLC. We began production in January 2007.\nOn February 3, 2022 we renewed our $10 million Revolving Loan with Cornerstone Bank (\"Cornerstone\"). On February 3, 2022, the maturity date was extended to March 31, 2022. On April 8, 2022, the Revolving Loan was renewed. The new maturity date is April 7, 2023.\nIn addition, on February 1, 2021 we entered into a $28 million construction loan with Cornerstone Bank for a carbon capture and storage project (the \"CCS Construction Loan\"). The maturity date of the loan was January 31, 2022. On February 17, 2022, the maturity date was extended to March 15, 2022. On April 8, 2022, we renewed the CCS Construction Loan. The new maturity date was October 8, 2022, but has since been replaced with a different loan (see below).\nOn January 22, 2020 we entered into a $7 million construction loan (the \"First Construction Loan\") with Cornerstone. The original maturity date of the Construction Loan was June 1, 2021. On June 3, 2021, we extended the maturity date to February 1, 2022. On April 8, 2022, the Construction Loan was renewed. The new maturity date was October 8, 2022.\nOn October 28, 2022 the Company entered into a $25 million loan with Cornerstone to replace the CCS Construction Loan and First Construction Loans. The maturity date of the replacement Loan is January 31, 2032.\nPrincipal Products\nThe principal products that we produce are ethanol, distillers grains, and corn oil. The table below shows the approximate percentage of our total revenue which is attributed to each of our primary products for each of our last three fiscal years.\nProduct Fiscal Year 2022 Fiscal Year 2021 Fiscal Year 2020\nEthanol 77.2 % 76.9 % 76.1 %\nDistillers Grains 16.5 % 17.8 % 19.4 %\nCorn Oil 5.7 % 4.4 % 4.0 %\nEthanol\nOur primary product is ethanol which we manufacture from corn. Ethanol is ethyl alcohol, a fuel component made primarily from corn and various other grains, which can be used as: (i) an octane enhancer in fuels; (ii) an oxygenated fuel additive for the purpose of reducing ozone and carbon monoxide vehicle emissions; and (iii) a non-petroleum-based gasoline substitute. Although the ethanol industry continues to explore production technologies employing various feedstocks, such as biomass, corn-based production technologies remain the most practical and provide the lowest operating risks. Corn produces large quantities of carbohydrates, which convert into glucose more easily than most other kinds of biomass.\nEthanol produced in the United States is primarily used for blending with unleaded gasoline and other fuel products. Ethanol blended fuel is typically designated in the marketplace according to the percentage of the fuel that is ethanol, with the most common fuel blend being E10, which contains 10% ethanol. The United States Environmental Protection Agency (the \"EPA\") has approved the use of gasoline blends that contain 15% ethanol, or E15, for use in all vehicles manufactured in model year 2001 and later. In 2019, the EPA changed regulations which now allow E15 to be sold year-round in all markets in the United States, however, this rule was reversed by the federal courts. The EPA issued a temporary emergency waiver in the\nsummer of 2022 which permitted the sale of E15 year-round. The EPA is expected to issue a new rule in 2023 that would approve the use of E15 year-round on a permanent basis. In addition, flexible fuel vehicles can use gasoline blends that contain up to 85% ethanol called E85.\nAs a result of an emergency domestic need resulting from the COVID-19 pandemic, some ethanol plants provided ethanol to be used for the production of hand sanitizer and related products. Some ethanol plants have subsequently announced plans to install equipment to allow USP-grade ethanol production which can also be used for disinfectants, pharmaceuticals, fragrances, cosmetics and other industrial applications. We engaged in some limited ethanol sales for sanitizer use during our 2020 fiscal year. Approximately 3.9% of our revenues were from industrial ethanol sales during our 2020 fiscal year. We did not have any industrial ethanol sales during our 2022 and 2021 fiscal years.\nDistillers Grains\nThe principal co-product of the ethanol production process is distillers grains, a high protein, high energy animal feed supplement primarily marketed to the dairy, beef, poultry, and swine industries. We produce two forms of distillers grains: distillers dried grains and modified distillers grains. Modified distillers grains is processed corn mash that has been dried to approximately 50% moisture which has a shelf life of approximately seven days and is often sold to nearby markets. Distillers dried grains is processed corn mash that has been dried to approximately 10% moisture. It has an almost indefinite shelf life and may be sold and shipped to any market regardless of its vicinity to our ethanol plant.\nCorn Oil\nIn March 2012, we commenced operating our corn oil extraction equipment to separate corn oil contained in our distillers grains for sale. The corn oil that we are capable of producing is not food grade corn-oil and it cannot be used for human consumption. The primary uses of the corn oil that we produce are for animal feed, industrial uses, and biodiesel production.\nPrincipal Product Markets\nWe market nearly all of our products through a professional third party marketer, RPMG, Inc. (\"RPMG\"). The only products we sell which are not marketed by RPMG are E85 and E30 and certain modified distillers grains which we market internally to local customers. RPMG is a subsidiary of Renewable Products Marketing Group, LLC (\"RPMG, LLC\"). We are a part owner of RPMG, LLC which allows us to realize favorable marketing fees for our products and allows us to share in the profits generated by RPMG, LLC. Our ownership interest in RPMG, LLC also entitles us to a seat on its board of directors which is filled by Gerald Bachmeier, our Chief Executive Officer. Except for the modified distillers grains and E85/E30 we market locally, RPMG decides where our products are marketed and sold.\nOur products are primarily sold in the domestic market; however, as domestic production of ethanol, distillers grains, and corn oil continue to expand, we anticipate increased international sales of our products. Exports of ethanol were lower for 2021 but have increased significantly in 2022. However, tariffs implemented by Brazil and China on ethanol imported from the United States have reduced export demand from those countries. Tariffs imposed by China remained unchanged during the past year. In March 2022, Brazil suspended its tariff through the end of the year on ethanol imported from the United States following a 10% reduction on the tariff in November 2021. However, despite this suspension, Brazil has not become a leading player in the export market in recent months. Trade barriers with key markets may continue to take a toll on ethanol export demand which could negatively affect domestic ethanol prices.\nExports of distillers grains increased in 2021 with the United States exporting about a third of distillers grain produced. The export market has remained strong in 2022 with Mexico, South Korea, and Vietnam continuing as top destinations for distillers grains exports. Historically, the United States ethanol industry exported a significant amount of distillers grains to China. The imposition of anti-dumping and anti-subsidy duties by China over the past five years effectively closed the Chinese market.\nWe expect our product marketer to explore all markets for our products, including export markets. However, due to high transportation costs, and the fact that we are not located near a major international shipping port, we expect a majority of our products to continue to be marketed and sold domestically.\nDistribution Methods\nOur ethanol plant is located near Richardton, North Dakota in Stark County, in the western half of North Dakota. We selected the Richardton site because of its proximity to existing coal supplies, the initial fuel source for our ethanol plant, and accessibility to road and rail transportation. Our plant is served by the Burlington Northern and Santa Fe Railway Company.\nWe sell and market the ethanol, distillers grains, and corn oil produced at the plant through normal and established markets, including local, regional, and national markets. Our products are primarily shipped by rail and by truck in our local market. We have separate marketing agreements with RPMG for our ethanol, industrial ethanol, distillers grains, and corn oil. Whether or not our products are sold in local markets will depend on decisions made by RPMG, except for the E85/E30 and the modified distillers grains which we internally market locally. Local markets are evaluated on a case-by-case basis.\nEthanol\nWe have an exclusive marketing agreement with RPMG for the purposes of marketing and distributing all of the ethanol we produce at the ethanol plant. Because we are an owner of RPMG, LLC, our marketing fees are based on RPMG's actual cost to market our ethanol. Our ethanol marketing agreement provides that we can sell our ethanol either through an index arrangement or at a fixed price agreed to between us and RPMG. The term of our ethanol marketing agreement is perpetual, until it is terminated according to the terms of the agreement. The primary reasons the ethanol marketing agreement would terminate are if we cease to be an owner of RPMG, LLC, if there is a breach of the agreement which is not cured, or if we give advance notice to RPMG that we would like to terminate the agreement. Notwithstanding our right to terminate the ethanol marketing agreement, we may be obligated to continue to market our ethanol through RPMG for a period of time after the termination. Further, if the agreement is terminated, following the termination, we have agreed to accept an assignment of certain railcar leases which RPMG has secured to service us. If the ethanol marketing agreement is terminated, it would automatically trigger a redemption of our ownership interest in RPMG, LLC.\nDistillers Grains\nOn August 29, 2013, we executed a distillers grain marketing agreement with RPMG effective starting on October 1, 2013. Pursuant to the marketing agreement, RPMG markets all of the dried distillers grains we produce and we will continue to internally market our modified distillers grains. Due to the fact that we are a part owner of RPMG, LLC, RPMG will only charge us its actual cost of marketing our distillers grains to its customers. The initial term of the marketing agreement was one year and thereafter the agreement renews for additional one year periods unless we elect not to renew the agreement. The agreement may be terminated by either party based on certain events described in the agreement or based on the bankruptcy or insolvency of either party.\nWe market and sell our modified distillers grains internally. Substantially all of our sales of modified distillers grains are to local farmers and feed lots.\nCorn Oil\nIn March 2012, we executed a corn oil marketing agreement with RPMG to sell all of the corn oil that we produce. We pay RPMG a commission based on each pound of corn oil that RPMG sells on our behalf. The initial term of the corn oil marketing agreement was one year and the agreement automatically renews for additional one year terms unless either party gives notice that it will not extend the agreement past the current term.\nNew Products and Services\nWe started capturing carbon dioxide during our 2022 fiscal year which we will monetize through tax credits which we anticipate will be issued during our 2023 fiscal year.\nSources and Availability of Raw Materials\nCorn\nOur ethanol plant used approximately 22.3 million bushels of corn during our 2022 fiscal year, as the feedstock for its dry milling process. Our commodity manager is responsible for purchasing corn for our operations, scheduling corn deliveries, and establishing hedging positions to protect the price we pay for corn.\nDuring our 2022 fiscal year, we were able to secure sufficient corn to operate the plant at capacity. We do not anticipate any problems securing enough corn during our 2023 fiscal year. Almost all of our corn is supplied from farmers and\nlocal grain elevators in North Dakota and South Dakota. During our 2022 fiscal year, corn prices have been higher than prior years, mainly due to increased demand which has been higher than the worldwide corn supply. On November 1, 2022, the USDA released a report estimating the 2022 corn crop in the United States at approximately 13.9 billion bushels, down 8% from last year's production, with yields averaging 172 bushels per acre. The USDA forecasted area harvested for corn at 80.8 million acres, down 5% from 2021. We have not had difficulty securing the corn we require for our operations and we anticipate that we will be able to secure the corn we need to operate the ethanol plant during our 2023 fiscal year, although potentially at a higher price. While we do not anticipate encountering problems sourcing corn, a shortage of corn could develop, particularly if we experience an extended drought or other production problems during our 2023 fiscal year. Poor weather can be a major factor in increasing corn prices, including the drought experienced during our 2022 fiscal year. If the United States were to endure an entire growing season with poor weather conditions, it could result in a prolonged period of higher than normal corn prices.\nCorn prices are also impacted by world supply and demand, the price of other commodities, current and anticipated stocks, domestic and export prices and supports, and the government's current and anticipated agricultural policy. Corn prices have been volatile in the past and volatility could return to the market in the future.\nNatural Gas\nWe use natural gas as the fuel source to power our ethanol plant. We are using natural gas to produce process steam and to dry our distillers grains products. Due to our close proximity to the Bakken oil field which produces a significant amount of natural gas, we anticipate that natural gas prices in our area will remain lower and the cost to transport the natural gas to our ethanol plant will be low compared to our competitors. We entered into a natural gas supply agreement with Rainbow Gas Company which provides a supply of natural gas to the ethanol plant. We do not anticipate any difficulty securing the natural gas we require to operate the ethanol plant.\nElectricity\nThe production of ethanol uses significant amounts of electricity. We entered into a contract with Roughrider Electric Cooperative to provide our needed electrical energy. This contract was renewed in August 2019. This contract automatically renews unless either party gives notice of its intent not to renew the agreement.\nWater\nTo meet the plant's water requirements, we entered into a ten-year contract with Southwest Water Authority to purchase raw water. Our contract requires us to purchase a minimum of 160 million gallons of water per year. We anticipate receiving adequate water supplies during our 2023 fiscal year.\nPatents, Trademarks, Licenses, Franchises and Concessions\nWe do not currently hold any patents, trademarks, franchises, or concessions. We were granted a perpetual and royalty free license by ICM, Inc. (\"ICM\") to use certain ethanol production technology necessary to operate our ethanol plant. The cost of the license granted by ICM was included in the amount we paid to Fagen, Inc. to design and build the plant.\nSeasonality of Sales\nWe experience some seasonality of demand for our ethanol, distillers grains, and corn oil. Since ethanol is predominantly blended with gasoline for use in automobiles, ethanol demand tends to shift in relation to gasoline demand. As a result, we experience some seasonality of demand for ethanol in the summer months related to increased driving and, as a result, increased gasoline demand. In addition, we experience some increased ethanol demand during holiday seasons related to increased gasoline demand. We also experience decreased distillers grains demand during the summer months due to natural depletion in the number of animals at feed lots and during times when cattle are turned out to pasture. Finally, corn oil is used for biodiesel production which typically decreases in the winter months due to decreased biodiesel demand.\nWorking Capital\nWe primarily use our working capital for purchases of raw materials necessary to operate our ethanol plant and for capital expenditures to maintain and upgrade the plant. During our 2022 fiscal year, our primary sources of working capital were cash from our operations as well as our revolving loan with Cornerstone.\nDependence on a Few Major Customers\nAs discussed above, we rely on RPMG for the sale and distribution of all of our ethanol, dried distillers grains and corn oil. Accordingly, we are highly dependent on RPMG for the successful marketing of most of our products. We anticipate that we would be able to secure alternate marketers should RPMG fail, however, a loss of our relationship with RPMG could significantly harm our financial performance.\nCompetition\nWe are in direct competition with numerous ethanol producers, many of which have greater resources than we have. Larger ethanol producers may be able to take advantage of economies of scale due to their larger size and increased bargaining power with both customers and raw material suppliers. As of December 5, 2022, the Renewable Fuels Association (\"RFA\") estimates that there are 204 ethanol production facilities in the United States with capacity to produce approximately 17.5 billion gallons of ethanol annually. In the past, the ethanol industry experienced consolidation where a few larger ethanol producers emerged who control a large portion of United States ethanol production. The largest ethanol producers include Archer Daniels Midland, Green Plains Renewable Energy, POET, and Valero Renewable Fuels, each of which is capable of producing significantly more ethanol than we produce. Collectively this group controls approximately 40.7% of the ethanol production capacity in the United States.\nThe following table identifies the largest ethanol producers in the United States along with their production capacities.\nU.S. FUEL ETHANOL PRODUCTION CAPACITY BY TOP PRODUCERS\nProducers of Approximately 900 million gallons per year or more\nCompany Current Capacity\n(MMgy) Percent of Total Industry Capacity\nPOET Biorefining 2,811 16.1 %\nValero Renewable Fuels 1,747 10.0 %\nArcher Daniels Midland 1,613 9 %\nGreen Plains Renewable Energy 958 5.5 %\nTOTAL 7,129 40.7 %\nUpdated: December 5, 2022\nEthanol Competition\nEthanol is a commodity product where competition in the industry is predominantly based on price and consistent fuel quality. Larger ethanol producers may be able to realize economies of scale in their operations that we are unable to realize. Further, some oil companies have purchased ethanol production facilities, including Valero Renewable Fuels, which is a subsidiary of a larger energy company. Oil companies are required to blend a certain amount of ethanol each year. Therefore, the oil companies may be able to operate their ethanol production facilities at times when it is unprofitable for us to operate our ethanol plant. Further, some ethanol producers own multiple ethanol plants which may allow them to compete more effectively by providing them flexibility to run certain production facilities while they have other facilities shut down. This added flexibility may allow these ethanol producers to compete more effectively, especially during periods when operating margins are unfavorable in the ethanol industry. Finally some ethanol producers who own ethanol plants in geographically diverse areas of the United States may spread the risk they encounter related to feedstock prices due to localized decreased corn production and supplies.\nWe anticipate competition from renewable fuels that do not use corn as the feedstock. Many of the current ethanol production incentives are designed to encourage the production of renewable fuels using raw materials other than corn. One type of ethanol production feedstock that is being explored is cellulose. Cellulose is the main component of plant cell walls and is the most common organic compound on earth. Cellulose is found in wood chips, corn stalks, and rice straw, amongst other common plants. Cellulosic ethanol is ethanol produced from cellulose. Cellulosic ethanol may also capture more government subsidies and assistance than corn-based ethanol. This could decrease demand for our product or result in competitive disadvantages for our ethanol production process.\nA number of automotive, industrial, and power generation manufacturers are developing alternative clean power systems using fuel cells, plug-in hybrids, electric cars, or clean burning gaseous fuels. Electric car technology has grown in\npopularity, especially in urban areas. While in the past there were a limited number of vehicle recharging stations, making electric cars not feasible for all consumers, there has been increased focus on developing these recharging stations which have made electric car technology more widely available. Additional competition from these other sources of alternative energy, particularly in the automobile market, could reduce the demand for ethanol, which would negatively impact our profitability.\nIn addition to domestic producers of ethanol, we face competition from ethanol produced in foreign countries, particularly Brazil. Ethanol imports have been lower in recent years and ethanol exports have been higher which was one of the reasons for improved operating margins in the ethanol industry. As of May 1, 2013, Brazil increased its domestic ethanol use requirement from 20% to 25% which decreased the amount of ethanol available in Brazil for export. In addition, Brazil instituted a tariff on ethanol produced in the United States which has resulted in less ethanol exports to Brazil. In the future, we may experience increased ethanol imports from Brazil which could put negative pressure on domestic ethanol prices and result in excess ethanol supply in the United States. We continue to look for opportunities to export ethanol to other countries and open new markets for ethanol produced in the United States.\nCompetition among ethanol producers may continue to increase as gasoline demand decreases due to more fuel efficient vehicles being produced. If the concentration of ethanol used in most gasoline does not increase and gasoline demand is lower due to increased fuel efficiency by the vehicles operated in the United States, competition may increase among ethanol producers to supply the ethanol market.\nFinally, many ethanol producers increased their production capacities through expansion projects which started becoming operational during our 2018 fiscal year. These expansion projects have increased the supply of ethanol in the market and negatively impacted market ethanol prices and may result in excess ethanol supply in the future. During our 2019 fiscal year, many ethanol producers reduced production or ceased production altogether due to unfavorable operating margins which somewhat offset the additional ethanol production from these expansion projects. During 2020, the ethanol industry was impacted by decreased gasoline and ethanol demand because of social distancing restrictions implemented because of the COVID-19 pandemic. During our 2021 fiscal year, ethanol demand increased and we experienced much more favorable financial margins. During our 2022 fiscal year, ethanol prices increased, particularly during our first fiscal quarter of 2022, and we experienced favorable financial margins.\nDistillers Grains Competition\nOur ethanol plant competes with other ethanol producers in the production and sales of distillers grains. Distillers grains are primarily used as an animal feed which replaces corn and soybean meal. As a result, we believe that distillers grains prices are positively impacted by increases in corn and soybean prices. In addition, in recent years the United States ethanol industry has increased exports of distillers grains which management believes has positively impacted demand and prices for distillers grains in the United States. In the event these distillers grains exports decrease, it could lead to an oversupply of distillers grains in the United States which could result in increased competition among ethanol producers for sales of distillers grains and could negatively impact distillers grains prices in the United States.\nIn recent years, an increasing amount of distillers grains have been used in the swine and poultry markets. Numerous feeding trials show advantages in milk production, growth, rumen health, and palatability over other dairy cattle feeds. With the advancement of research into the feeding rations of poultry and swine, we expect these markets to expand and create additional demand for distillers grains; however, no assurance can be given that these markets will in fact expand, or if they do, that we will benefit from it. The market for distillers grains is generally confined to locations where freight costs allow it to be competitively priced against other feed ingredients. Distillers grains compete with three other feed formulations: soybean meal, corn gluten feed, dry brewers grain and mill feeds. The primary value of these products as animal feed is their protein content. Soybean meal, dry brewers grain and distillers grains have about the same protein content, and corn gluten feed and mill feeds have slightly lower protein contents. Recently, additional soybean crushing facilities are being constructed which may increase the supply of soybean meal in the market. This increase in soybean meal could negatively impact the market price of distillers grains.\nCorn Oil Competition\nWe compete with many ethanol producers for the sale of corn oil. Many ethanol producers have installed the equipment necessary to separate corn oil from the distillers grains they produce which has increased competition for corn oil sales and at times has resulted in lower market corn oil prices. Recently, corn oil prices and demand have been higher due to commodity prices generally and increased demand for corn oil from the biodiesel and renewable diesel industries.\nGovernmental Regulation and Federal Ethanol Supports\nFederal Ethanol Supports\nThe ethanol industry is dependent on several economic incentives to produce ethanol. One significant federal ethanol support is the ethanol use requirement in the Federal Renewable Fuels Standard (the \"RFS\"). The RFS requires that in each year, a certain amount of renewable fuels must be used in the United States. The RFS is a national program that does not require that any renewable fuels be used in any particular area or state, allowing refiners to use renewable fuel blends in those areas where it is most cost-effective. The RFS statutory volume requirement increases incrementally each year until the United States is required to use 36 billion gallons of renewable fuels in 2022. Starting in 2009, the RFS required that a portion of the RFS must be met by certain \"advanced\" renewable fuels. These advanced renewable fuels include ethanol that is not made from corn, such as cellulosic ethanol and biomass based biodiesel. The use of these advanced renewable fuels increases each year as a percentage of the total renewable fuels required to be used in the United States.\nThe EPA has the authority to waive the RFS statutory volume requirement, in whole or in part, provided one of the following two conditions have been met: (1) there is inadequate domestic renewable fuel supply; or (2) implementation of the requirement would severely harm the economy or environment of a state, region or the United States. Annually, the EPA is required to pass a rule that establishes the number of gallons of different types of renewable fuels that must be used in the United States which is called the renewable volume obligations (\"RVO\").\nThe statutory RVO for all renewable fuels for 2018 was 19.29 billion gallons, of which corn-based ethanol could meet 15 billion gallons of the RVO. On November 30, 2018, the final RVO for 2019 was set at 19.92 billion gallons and the corn-based ethanol RVO was set at 15 billion gallons. On December 7, 2021, the EPA issued a proposed RVO rule which set the 2022 RVO at 15 billion gallons for corn-based ethanol, set the 2021 RVO for corn-based ethanol at 13.3 billion gallons, less than the statutory requirement in the RFS of 15 billion gallons. The December 7, 2021 proposed rule also proposed to reopen the 2020 RVO which was previously set at 15 billion gallons for corn-based ethanol and retroactively reduce that amount to 12.5 billion gallons. On December 1, 2022, the EPA issued a proposed RVO rule, which for 2023 is set at 20.88 billion gallons, for 2024 is set at 21.87 billion gallons, and for 2025 is set at 22.68 billion gallons. In 2023, the corn-based ethanol RVO will be set at 15 billion gallons. However, for years 2024 and 2025, the EPA has proposed raising this limit to 15.25 billion gallons and eliminating the supplemental standard.\nDuring 2019 it came to light that the EPA was issuing waivers of the RVO obligations for certain small refineries. These small refinery waivers resulted in significant decreases in ethanol demand during 2018 and 2019 which are below the RVO requirements. Many in the ethanol industry believe these waivers did not meet the standards set out in the RFS. The ethanol industry has been pushing the EPA to reverse the effects of these small refinery waivers which we believe contributed to poor operating margins starting in 2018 and continuing through our 2020 fiscal year. In January 2020, the Tenth Circuit Court of Appeals ruled that small refinery exemptions may only be granted to refineries that had secured them continuously each year since 2010. Consistent with this ruling, in September 2020, the EPA denied certain small refinery exemption petitions filed by oil refineries in 2020 seeking retroactive relief from their ethanol use requirements for prior years. In June 2021, the U.S. Supreme Court reversed the decision finding that a small refinery may obtain a hardship exemption even if its earlier exemption had lapsed in one or more previous years. In June 2022, the EPA announced the denial of 69 small refinery exemption petitions for one or more compliance years between 2016 and 2021 on the grounds that the petitioners had failed to show that the EPA had a basis to approve them.\nIn June 2012, the EPA gave final approval for the sale of E15, gasoline which is blended at a rate of 15% ethanol and 85% gasoline, for use in vehicles manufactured in the model year 2001 and later. Although there have been significant steps towards introduction of E15 in the marketplace, there are still obstacles to meaningful market penetration by E15. Many states still have regulatory issues that hamper or prevent the sale of E15. In addition, sales of E15 may be limited because E15 is not approved for use in all vehicles, the EPA requires a label that may discourage consumers from using E15, and retailers may choose not to sell E15 due to concerns regarding liability. Previously, different gasoline blendstocks were required at certain times of the year due to federal regulations related to fuel evaporative emissions which prevented E15 from being used during certain times of the year in various states. In May 2019, the EPA issued a final rule allowing the year-round sale of E15. However in June 2021, the U.S. Court of Appeals for the District of Columbia struck down this rule finding that the EPA exceeded its authority. In May 2022, the EPA issued an emergency waiver to allow sales of E15 during the summer months. The reason given for the temporary suspension of the prohibition on year-round sales was that it was an effort to counteract rising gasoline prices. It appears that the EPA is considering enacting a rule to allow year-round sales before next summer. However, it is unclear whether that will occur.\nA blender pump is a gasoline pump that can dispense a variety of different ethanol/gasoline blends. Blender pumps typically can dispense E10, E20, E30, E40, E50 and E85. These blender pumps accomplish these different ethanol/gasoline blends by internally mixing ethanol and gasoline which are held in separate tanks at the retail gas stations. Many in the ethanol industry believe that increased use of blender pumps will increase demand for ethanol by allowing gasoline retailers to provide various mid-level ethanol blends in a cost effective manner and allowing consumers with flex-fuel vehicles to purchase more ethanol through these mid-level blends. However, the expense of blender pumps has delayed their availability in the retail gasoline market.\nIn May 2020, the United States Department of Agriculture (\"USDA\") announced the Higher Blends Infrastructure Incentive Program which consists of up to $100 million in funding for grants to be used to increase the availability of higher blends of ethanol and biodiesel fuels. Funds may be awarded to retailers such as fueling stations and convenience stores to assist in the cost of installation or upgrading of fuel pumps and other infrastructure. To date, the USDA has awarded approximately $74 million to eligible projects.\nOn August 16, 2022, the Inflation Reduction Act of 2022, which has several provisions that may benefit the ethanol industry, was signed into law. There is, however, considerable uncertainty as to how the newly required provisions will be implemented in future regulatory guidance. The Inflation Reduction Act maintains the 12-year credit period for the existing Section 45Q tax credit for carbon capture and storage (\"CCS\"). However, the Act extends eligibility for the credit to facilities that have commenced construction by December 31, 2032, and substantially lowers the minimum annual capture requirements to 12,500 tons for qualifying facilities. In addition, the potential credit rate is increased five times for industrial facilities and power plants that capture their carbon emissions to $85 per metric ton of carbon oxide stored in secure geologic formations, $60 per ton for the beneficial utilization of captured carbon emissions, and $60 per ton for carbon oxide stored in oil and gas fields. Prevailing wage and apprenticeship requirements must be met by the facility to claim the full amount of the higher credit. In addition, projects will now be eligible to be directly paid for the credit by the Internal Revenue Service for the first five years with no direct pay for many projects for the final seven years of the credit, and, as an alternative to direct pay, projects will now be allowed to sell their credits to unrelated third parties for cash without adverse tax consequences. The Act also creates a Clean Fuel Production Tax Credit for the production of low-emissions transportation fuel produced and sold in 2025, 2026, and 2027, subject to certain requirements as to prevailing wage and apprenticeship. However, the Act provides that the Clean Fuel Production Tax Credit is not available for a facility that qualifies for the Section 45Q tax credit. Additional incentives for production of sustainable aviation fuel and $500 million in funding for biofuels infrastructure funding are also included in the Act.\nEffect of Governmental Regulation\nThe government's regulation of the environment changes constantly. We are subject to extensive air, water, and other environmental regulations, and we have been required to obtain a number of environmental permits to construct and operate the ethanol plant. It is possible that more stringent federal or state environmental rules or regulations could be adopted, which could increase our operating costs and expenses. It also is possible that federal or state environmental rules or regulations could be adopted that could have an adverse effect on the use of ethanol. Plant operations are governed by the Occupational Safety and Health Administration (\"OSHA\"). OSHA regulations may change such that the costs of operating the ethanol plant may increase. Any of these regulatory factors may result in higher costs or other adverse conditions effecting our operations, cash flows, and financial performance.\nWe have obtained all of the necessary permits to operate the ethanol plant. During our 2022 fiscal year, we incurred costs and expenses of approximately $152,000 complying with environmental laws, including the cost of obtaining permits. Although we have been successful in obtaining all of the permits currently required, any retroactive change in environmental regulations, either at the federal or state level, could require us to obtain additional or new permits or spend considerable resources in complying with such regulations. Management believes converting the plant to use natural gas as the fuel source instead of coal has reduced our environmental compliance costs.\nIn late 2009, California passed a Low Carbon Fuels Standard (\"LCFS\"). The California LCFS requires that renewable fuels used in California must accomplish certain reductions in greenhouse gases which is measured using a lifecycle analysis, similar to the RFS. The LCFS could have a negative impact on demand for corn-based ethanol and result in decreased ethanol prices affecting our ability to operate profitably.\nIn August 2017, Brazil instituted an import quota for ethanol produced in the United States and exported to Brazil, along with a 20% tariff on ethanol imports in excess of the quota. In September 2019, the Brazilians increased the tariff free\nimport quota from 600 million liters to 750 million liters. In December 2020, the tariff free quota was revoked. In March 2022, this tariff was suspended through December 2022. This tariff and quota have reduced exports of ethanol to Brazil and may continue to negatively impact ethanol exports from the United States. Any reduction in ethanol exports could negatively impact market ethanol prices in the United States. In addition, the Chinese government increased the tariff on United States ethanol imports into China from 30% to 45% and subsequently to 70%. In 2020, this tariff was again reduced to 45%. Due to other recent tariff activity between the United States and China, management does not expect these Chinese tariffs to be removed in the near term, despite recent positive discussions. Both China and Brazil have been major sources of import demand for United States ethanol and distillers grains. These trade actions may result in negative operating margins for United States ethanol producers.\nEmployees\nAs of December 29, 2022, we had 49 full-time employees. We anticipate that we will have approximately 49 full-time employees during the next 12 months. Item 1A. Risk Factors\nYou should carefully read and consider the risks and uncertainties below and the other information contained in this report. The risks and uncertainties described below are not the only ones we may face. The following risks, together with additional risks and uncertainties not currently known to us or that we currently deem immaterial could impair our financial condition and results of operation.\nRisks Relating to Our Business\nWe are subject to global and regional economic downturns and related risks and the effects of COVID-19 or another pandemic may materially and adversely affect demand and the market price for our products. The level of demand for our products is affected by global and regional demographic and macroeconomic conditions. A significant downturn in global economic growth, or recessionary conditions in major geographic regions for prolonged periods, may lead to reduced demand for our products, which could have a negative effect on the market price of our products. In December 2019, a novel coronavirus surfaced in Wuhan, China (COVID-19). The spread of COVID-19 worldwide has resulted in businesses suspending or substantially curtailing global operations and travel, quarantines, and an overall substantial slowdown of economic activity. Transportation fuels in particular, including ethanol, experienced significant price declines and reduced demand. The effects of COVID-19 have and may continue to materially and adversely affect the market price for our products, our business, results of operations, and liquidity.\nCOVID-19 or another pandemic may negatively impact our ability to operate our business which could decrease or eliminate the value of our units. COVID-19 has resulted in significant uncertainty in many areas of our business. We do not know how long these conditions will last. This uncertainty is expected to negatively impact our operations. We may experience labor shortages if our employees are unable or unwilling to come to work. If our suppliers cannot deliver the supplies we need to operate our business or if we are unable to ship our products due to trucking or rail shipping disruptions, we may be forced to suspend operations or reduce production. If we are unable to operate the ethanol plant at capacity, it may result in unfavorable operating results. Any shut down of operations or reduction in production, especially for an extended period of time, could reduce or eliminate the value of our units.\nThe EPA has issued small refinery waivers to the RFS requirement which has resulted in demand destruction and negatively impacted profitability in the ethanol industry. During 2019, the ethanol industry learned that the EPA has been issuing small refinery waivers to the ethanol use requirements in the RFS. In previous years, when the EPA issued small refinery waivers, it reallocated the waived requirements to other refiners. The EPA under the Trump Administration was granting significantly more waivers than in the past and was not reallocating the waived amounts to other refiners. These actions resulted in demand destruction starting in 2018 which has continued to result in reduced demand for ethanol. This reduction in ethanol demand negatively impacted profitability in the ethanol industry. These small refinery waivers could be issued in future years which could impact ethanol demand.\nA decrease in the spread between the price we receive for our products and our raw material costs will negatively impact our profitability. Practically all of our revenue is derived from the sale of our ethanol, distillers grains, and corn oil. Our primary raw material costs are corn costs and energy costs. Our profitability depends on a positive spread between the market price of the ethanol, distillers grains and corn oil we produce and the raw material costs related to these products. While ethanol, distillers grains and corn oil prices typically change in relation to corn prices, this correlation may not always exist. In the event the prices for our products decrease at a time when our raw material costs are increasing, we may not be able to\nprofitably operate the plant. In the event the spread between the price we receive for our products and the raw material costs associated with producing those products is negative for an extended period of time, we may not be able to maintain liquidity which could negatively impact the value of our units.\nDeclines in the price of ethanol, distillers grain or corn oil would significantly reduce our revenues. The sales prices of ethanol, distillers grains, and corn oil can be volatile as a result of a number of factors such as overall supply and demand, the price of gasoline and corn, levels of government support, tariffs and import quotas, and the availability and price of competing products. We are dependent on a favorable spread between the price we receive for our ethanol, distillers grains, and corn oil and the price we pay for corn and natural gas. Any lowering of ethanol, distillers grains, or corn oil prices, especially if it is associated with increases in corn and natural gas prices, may affect our ability to operate profitably. We anticipate the price of ethanol and distillers grains to continue to be volatile in our 2023 fiscal year as a result of the net effect of changes in the price of gasoline and corn and increased ethanol supply offset by increased export demand. In addition, growing conditions in a particular seasons harvest may cause the corn crop to be of poor quality resulting in corn shortages and a decrease in distillers grains prices. Declines in the prices we receive for our ethanol and distillers grains will lead to decreased revenues and may result in our inability to operate the ethanol plant profitably for an extended period of time which could decrease the value of our units.\nDecreasing gasoline prices could negatively impact our ability to operate profitably. Discretionary blending is an important secondary market which is often determined by the price of ethanol versus the price of gasoline. In periods when discretionary blending is financially unattractive, demand for ethanol may be reduced. Historically, the price of ethanol has been less than the price of gasoline which increased demand for ethanol from fuel blenders. In recent years, low oil prices reduced the price of gasoline which reduced the spread between the price of gasoline and the price of ethanol which discouraged discretionary blending, and resulted in a downward market adjustment in the price of ethanol. If oil and gasoline prices remain lower for a significant period of time, it could hurt our ability to profitably operate the ethanol plant which could decrease the value of our units.\nIncreases in the price of corn or natural gas would reduce our profitability. Our primary source of revenue is from the sale of ethanol, distillers grains and corn oil. Our results of operations and financial condition are significantly affected by the cost and supply of corn and natural gas. Changes in the price and supply of corn and natural gas are subject to and determined by market forces over which we have no control including weather and general economic factors.\nEthanol production requires substantial amounts of corn. Generally, higher corn prices will produce lower profit margins and, therefore, negatively affect our financial performance. If a period of high corn prices were to be sustained for some time, such pricing may reduce our ability to operate profitably because of the higher cost of operating our plant. We may not be able to offset any increase in the price of corn by increasing the price of our products. If we cannot offset increases in the price of corn, our financial performance may be negatively affected.\nThe prices for and availability of natural gas are subject to volatile market conditions. These market conditions often are affected by factors beyond our control such as higher prices as a result of colder than average weather conditions or natural disasters, overall economic conditions and foreign and domestic governmental regulations and relations. Significant disruptions in the supply of natural gas could impair our ability to manufacture ethanol and more significantly, distillers grains for our customers. Furthermore, increases in natural gas prices or changes in our natural gas costs relative to natural gas costs paid by competitors may adversely affect our results of operations and financial condition.\nOur business is not diversified which could negatively impact our ability to operate profitably. Our success depends largely on our ability to profitably operate our ethanol plant. We do not have any other lines of business or other sources of revenue if we are unable to operate our ethanol plant and manufacture ethanol, distillers grains, and corn oil. If economic or political factors adversely affect the market for ethanol, distillers grains, or corn oil, we have no other line of business to fall back on. Our business would also be significantly harmed if the ethanol plant could not operate at full capacity for any extended period of time.\nOur inability to maintain or secure credit facilities we may require in the future may negatively impact our liquidity. While we do not currently require more financing than we have, in the future we may need additional financing. If we require financing in the future and we are unable to secure such financing, or we are unable to secure the financing we require on reasonable terms, it may have a negative impact on our liquidity. This could negatively impact the value of our units.\nWe engage in hedging transactions which involve risks that could harm our business. We are exposed to market risk from changes in commodity prices, including the prices we pay for our raw materials and the prices we receive for our finished products. We seek to minimize our exposure to fluctuations in the prices of corn, ethanol and distillers grains through\nthe use of hedging instruments. However, our hedging activities may not successfully reduce the risk caused by price fluctuations which may leave us vulnerable to volatility in corn, ethanol and distillers grains prices. Alternatively, we may choose not to engage in hedging transactions in the future and our operations and financial conditions may be adversely affected during periods in which the prices for these commodities fluctuate. Further, using cash for margin calls to support our hedge positions can have an impact on the cash we have available for our operations which could negatively impact our liquidity. The effects of our hedging activities may negatively impact our ability to profitably operate which could reduce the value of our units.\nWe may violate the terms of our credit agreements and financial covenants which could result in our lender demanding immediate repayment of our loans. Management anticipates that we will be in compliance with our loan covenants in our Cornerstone loans. However, if we violate the terms of our credit agreement, Cornerstone could deem us in default of our loans and require us to immediately repay any outstanding balance of our loans. If we do not have sufficient cash to repay these loans or if we are unable to secure other sources of financing, it could negatively impact the value of our units.\nChanges and advances in ethanol production technology could require us to incur costs to update the ethanol plant or could otherwise hinder our ability to compete in the ethanol industry or operate profitably. Advances and changes in the technology of ethanol production are expected to occur. Such advances and changes may make the ethanol production technology installed in our ethanol plant less desirable or obsolete. These advances could allow our competitors to produce ethanol at a lower cost than us. If we are unable to adopt or incorporate technological advances, our ethanol production methods and processes could be less efficient than our competitors, which could cause the ethanol plant to become uncompetitive or completely obsolete. If our competitors develop, obtain, or license technology that is superior to ours or that makes our technology obsolete, we may be required to incur significant costs to enhance or acquire new technology so that our ethanol production remains competitive. Alternatively, we may be required to seek third-party licenses, which could also result in significant expenditures. These third-party licenses may not be available or, once obtained, they may not continue to be available on commercially reasonable terms. These costs could negatively impact our financial performance by increasing our operating costs and reducing our net income which could decrease the value of our units.\nWe depend on our management and key employees, and the loss of these relationships could negatively impact our ability to operate profitably. We are highly dependent on our management team to operate our ethanol plant. We may not be able to replace these individuals should they decide to cease their employment with us, or if they become unavailable for any other reason. While we seek to compensate our management and key employees in a manner that will encourage them to continue their employment with us, they may choose to seek other employment. Any loss of these officers and key employees may prevent us from operating the ethanol plant profitably and could decrease the value of our units.\nFailures of our information technology infrastructure could have a material adverse effect on operations. We utilize various software applications and other information technology that are critically important to our business operations. We rely on information technology networks and systems, including the Internet, to process, transmit, and store electronic and financial information, to manage a variety of business processes and activities, including production, manufacturing, financial, logistics, sales, marketing, and administrative functions. We depend on our information technology infrastructure to communicate internally and externally with employees, customers, suppliers, and others. We also use information technology networks and systems to comply with regulatory, legal, and tax requirements. These information technology systems, some of which are managed by third parties, may be susceptible to damage, disruptions, or shutdowns due to failures during the process of upgrading or replacing software, databases or components thereof, power outages, hardware failures, computer viruses, attacks by computer hackers or other cybersecurity risks, telecommunication failures, user errors, natural disasters, terrorist attacks, or other catastrophic events. If any of our significant information technology systems suffer severe damage, disruption or shutdown, and our disaster recovery and business continuity plans do not effectively resolve the issues in a timely manner, our product sales, financial condition and results of operations may be materially and adversely affected.\nA cyber attack or other information security breach could have a material adverse effect on our operations and result in financial losses. We are regularly the target of attempted cyber and other security threats and must continuously monitor and develop our information technology networks and infrastructure to prevent, detect, address and mitigate the risk of unauthorized access, misuse, computer viruses and other events that could have a security impact. If we are unable to prevent cyber attacks and other information security breaches, we may encounter significant disruptions in our operations which could adversely impact our business, financial condition and results of operations or result in the unauthorized disclosure of confidential information. Such breaches may also harm our reputation, result in financial losses or subject us to litigation or other costs or penalties.\nAdverse weather conditions, including as a result of climate change, may adversely affect the availability, quality, and price of agricultural commodities and agricultural commodity products, as well as our operations and operating results.\nAdverse weather conditions have historically caused volatility in the agricultural commodity industry and consequently in our operating results by causing crop failures or significantly reduced harvests, which may affect the supply and pricing of the agricultural commodities that we sell and use in our business, reduce demand for our fertilizer products and negatively affect the creditworthiness of agricultural producers who do business with us. Higher basis levels or adverse crop conditions in our corn purchase area can increase the input costs or lower the market value of our products relative to other market participants that do not have the same geographic concentration. Additionally, the potential physical impacts of climate change are uncertain and may vary by region. These potential effects could include changes in rainfall patterns, water shortages, changing sea levels, changing storm patterns and intensities, and changing temperature levels that could adversely impact our costs and business operations, the location, costs, and competitiveness of agricultural commodity production and related storage and processing facilities and the supply and demand for agricultural commodities. These effects could be material to our results of operations, liquidity, or capital resources and could reduce the value of our units.\nInvestor sentiment towards climate change, fossil fuels, and other ESG matters could adversely affect our business, cost of capital, and the price of our stock and other securities. There have been efforts in recent years, which have intensified during the COVID-19 pandemic, aimed at the investment community, to promote the divestment of securities of energy companies, as well as to pressure lenders and other financial services companies to limit or curtail activities with energy companies. As a result, some financial intermediaries, investors, and other capital markets participants have reduced or ceased lending to, or investing in, companies that operate in industries with higher perceived environmental exposure, such as the energy industry. If this or similar divestment efforts are continued, the value of our units may be negatively impacted.\nMembers of the investment community are also increasing their focus on ESG practices and disclosures, including practices and disclosures related to GHGs and climate change in the energy industry in particular, and diversity and inclusion initiatives and governance standards among companies more generally. As a result, we may face increasing pressure regarding our ESG practices and disclosures. Additionally, members of the investment community may screen companies such as ours for ESG performance. If we are unable to meet the ESG standards or investment or lending criteria set by these investors and funds, we may lose investors, investors may allocate a portion of their capital away from us, our cost of capital may increase, the price of our units may be negatively impacted, and our reputation may also be negatively affected.\nThe invasion of Ukraine by Russia and resulting sanctions by the United States, European Union and other countries have contributed to inflation, market disruptions and increased volatility in commodity prices in the United States and a slowdown in global economic growth. On February 24, 2022, a full-scale military invasion of Ukraine by Russian troops was reported. In response to the attacks on Ukraine, sanctions and other penalties have been levied by the United States, European Union, and other countries and additional sanctions and penalties have been proposed. The invasion by Russia and resulting sanctions have had a broad range of adverse impacts on global business and financial markets some of which have had and may continue to have adverse impacts on our business. These include increased inflation, significant market disruptions and increased volatility in commodity prices such as corn, oil and natural gas. Although the duration and extent of the ongoing military conflict is highly unpredictable and the magnitude of the potential economic impact is currently unknown, Russian military actions and resulting sanctions could have a negative effect on our financial condition and operating results.\nRisks Related to the Ethanol Industry\nThe ethanol industry is an industry that is changing rapidly which can result in unexpected developments that could negatively impact our operations and the value of our units. The ethanol industry has grown significantly in the last decade. This rapid growth has resulted in significant shifts in supply and demand of ethanol over a very short period of time. As a result, past performance by the ethanol plant or the ethanol industry generally might not be indicative of future performance. We may experience a rapid shift in the economic conditions in the ethanol industry which may make it difficult to operate the ethanol plant profitably. If changes occur in the ethanol industry that make it difficult for us to operate the ethanol plant profitably, it could result in a reduction in the value of our units.\nIncreased competition from electric vehicles could reduce demand for liquid fuels which could negatively impact demand for ethanol which could negatively impact our profitability. Electric car technology has improved significantly in recent years and many automakers are focusing on electric car technology for automobiles they are releasing or plan to release in the future. Increased reliance on electric vehicle technology is expected to result in decreased gasoline demand. Recently, governments and private entities have focused on improving and expanding vehicle recharging stations which may make electric automobiles more attractive in the market. As gasoline powered vehicles become a smaller part of the worldwide vehicle fleet, it is expected to have a negative impact on gasoline demand which will also impact ethanol demand. This shift in demand could negatively impact our financial performance and could reduce or eliminate the value of our units.\nExcess ethanol supply in the market could put negative pressure on the price of ethanol which could lead to tight operating margins and may impact our ability to operate profitably. In the past the ethanol industry has confronted market conditions where ethanol supply exceeded demand which led to unfavorable operating conditions. A disconnect between ethanol supply and demand can result in lower ethanol prices which can result in unfavorable operating conditions. The United States has recently benefited from additional exports of ethanol which may not continue to occur during our 2023 fiscal year. We may experience periods of ethanol supply and demand imbalance during our 2023 fiscal year, particularly if the EPA issues additional small refinery waivers from the RFS. If we experience excess ethanol supply, either due to increased ethanol production, lower ethanol demand or lower overall gasoline demand, it could negatively impact the price of ethanol which could hurt our ability to profitably operate the ethanol plant.\nDistillers grains demand and prices have been negatively impacted by the Chinese anti-dumping duty. China was previously the world's largest importer of distillers grains produced in the United States. On January 12, 2016, the Chinese government announced that it would commence an anti-dumping and countervailing duty investigation related to distillers grains imported from the United States. On January 10, 2017, China announced a final ruling related to its anti-dumping and countervailing duty investigation imposing anti-dumping duties from a range of 42.2% to 53.7% and anti-subsidy duties from 11.2% to 12.0%. The imposition of these duties has resulted in a significant decline in demand from this top importer and negatively impacted prices for distillers grains produced in the United States. Due to trade disputes between the United States and China these tariffs continued into our 2022 fiscal year. The Chinese government is conducting a review of the tariffs and is expected to complete the review in January 2023. This reduction in demand has negatively impacted our profitability, and continued tariffs may further impact our profitability.\nDemand for ethanol may not continue to grow unless ethanol can be blended into gasoline in higher percentage blends for standard vehicles. Currently, ethanol is primarily blended with gasoline for use in standard (non-flex fuel) vehicles to create a blend which is 10% ethanol and 90% gasoline. Estimates indicate that approximately 143 billion gallons of gasoline are sold in the United States each year. Assuming that all gasoline in the United States is blended at a rate of 10% ethanol and 90% gasoline, the maximum domestic demand for ethanol is 14.3 billion gallons. This is commonly referred to as the \"blend wall,\" which represents a theoretical limit where more ethanol cannot be blended into the national gasoline pool. Many in the ethanol industry believe that the ethanol industry has reached and surpassed this blend wall. In order to expand demand for ethanol, higher percentage blends of ethanol must be utilized in standard vehicles. Such higher percentage blends of ethanol are a contentious issue. Automobile manufacturers and environmental groups have fought against higher percentage ethanol blends. The EPA approved the use of E15 for standard vehicles produced in the model year 2001 and later. The fact that E15 has not been approved for use in all vehicles and the labeling requirements associated with E15 may lead to gasoline retailers refusing to carry E15. Without an increase in the allowable percentage blends of ethanol that can be used in all vehicles, demand for ethanol may not continue to increase which could decrease the selling price of ethanol and could result in our inability to operate the ethanol plant profitably which could reduce or eliminate the value of our units.\nA reduction in ethanol exports to Brazil due to the imposition by the Brazilian government of a tariff on U.S. ethanol has and could continue to have a negative impact on ethanol prices. Brazil has historically been a top destination for ethanol produced in the United States. However, in 2017, Brazil imposed a tariff on ethanol which is produced in the United States and exported to Brazil. This tariff has resulted in a decline in demand for ethanol from Brazil in the past and could negatively impact the market price of ethanol in the United States and could negatively impact our ability to profitably operate the ethanol plant.\nChinese ethanol tariffs have and could continue to have a negative impact on ethanol prices. As a result of trade disputes between the United States and China, China imposed a 45% tariff on ethanol produced in the United States. This tariff has effectively closed the Chinese market for United States ethanol exports. China represents a significant potential source of demand for ethanol. Without access to the Chinese market, we may experience excess ethanol supply which could negatively impact ethanol prices in the United States. Lower ethanol prices could negatively impact our ability to profitably operate the ethanol plant.\nWe operate in an intensely competitive industry and compete with larger, better financed entities which could impact our ability to operate profitably. There is significant competition among ethanol producers. There are numerous producer-owned and privately-owned ethanol plants operating throughout the Midwest and elsewhere in the United States. We also face competition from outside of the United States. The largest ethanol producers include Archer Daniels Midland, Green Plains Renewable Energy, POET, and Valero Renewable Fuels, each of which is capable of producing significantly more ethanol than we produce. Further, many believe that there will be further consolidation occurring in the ethanol industry in the future which could lead to a few companies which control a significant portion of the United States ethanol production market. We may not be able to compete with these larger entities. These larger ethanol producers may be able to affect the ethanol market in ways that are not beneficial to us which could negatively impact our financial performance.\nTechnology advances in the commercialization of cellulosic ethanol may decrease demand for corn-based ethanol which may negatively affect our profitability. The current trend in ethanol production research is to develop an efficient method of producing ethanol from cellulose-based biomass, such as agricultural waste, forest residue, municipal solid waste, and energy crops. This trend is driven by the fact that cellulose-based biomass is generally cheaper than corn, and producing ethanol from cellulose-based biomass would create opportunities to produce ethanol in areas of the country which are unable to grow corn. The Energy Independence and Security Act of 2007 and the 2008 Farm Bill offer strong incentives to develop commercial scale cellulosic ethanol. Additionally, state and federal grants have been awarded to several companies which are seeking to develop commercial-scale cellulosic ethanol plants. This has encouraged innovation and has led to several companies which are either in the process or have completed construction of commercial scale cellulosic ethanol plants. If an efficient method of producing ethanol from cellulose-based biomass is developed, we may not be able to compete effectively. If we are unable to produce ethanol as cost-effectively as cellulose-based producers, our ability to generate revenue and our financial condition will be negatively impacted.\nRisks Related to Regulation and Governmental Action\nGovernment incentives for ethanol production may be eliminated in the future, which could hinder our ability to operate at a profit. The ethanol industry is assisted by various federal ethanol production and tax incentives, including the RFS set forth in the Energy Policy Act of 2005. The RFS helps support a market for ethanol that might disappear without this incentive. The United States Environmental Protection Agency (\"EPA\") has the authority to waive the RFS statutory volume requirement, in whole or in part, provided certain conditions have been met. Annually, the EPA passes a rule that establishes the number of gallons of different types of renewable fuels that must be used in the United States which is called the renewable volume obligations. In the past, the EPA has set the renewable volume obligations below the statutory volume requirements. In addition, the EPA has recently expanded its use of waivers to small refineries. The effect of these waivers is that the refinery is no longer required to earn or purchase blending credits, known as RINs, negatively affecting ethanol demand and resulting in lower ethanol prices. If the EPA were to significantly reduce the volume requirements under the RFS or if the RFS were to be otherwise reduced or eliminated by the exercise of the EPA waiver authority or by Congress, the market price and demand for ethanol could decrease which will negatively impact our financial performance.\nChanges in environmental regulations or violations of these regulations could be expensive and reduce our profitability. We are subject to extensive air, water and other environmental laws and regulations. In addition, some of these laws require our plant to operate under a number of environmental permits. These laws, regulations and permits can often require expensive pollution control equipment or operational changes to limit actual or potential impacts to the environment. A violation of these laws and regulations or permit conditions can result in substantial fines, damages, criminal sanctions, permit revocations and/or plant shutdowns. In the future, we may be subject to legal actions brought by environmental advocacy groups and other parties for actual or alleged violations of environmental laws or our permits. Additionally, any changes in environmental laws and regulations, both at the federal and state level, could require us to spend considerable resources in order to comply with future environmental regulations. The expense of compliance could be significant enough to reduce our profitability and negatively affect our financial condition.\nThe California Low Carbon Fuel Standard may decrease demand for corn based ethanol which could negatively impact our profitability. California passed a Low Carbon Fuels Standard (\"LCFS\") which requires that renewable fuels used in California must accomplish certain reductions in greenhouse gases which reductions are measured using a lifecycle analysis. Management believes that these regulations could preclude corn-based ethanol produced in the Midwest from being used in California. California represents a significant ethanol demand market. If the ethanol industry is unable to supply corn-based ethanol to California, it could significantly reduce demand for the ethanol we produce which could result in a reduction of our revenues and negatively impact our ability to profitably operate the ethanol plant.\nGovernment policies and regulations, particularly those affecting the agricultural sector and related industries, could adversely affect our operations and profitability. Agricultural commodity production and trade flows are significantly affected by government policies and regulations. Governmental policies affecting the agricultural industry, such as taxes, trade tariffs, duties, subsidies, import and export restrictions on commodities and commodity products, can influence industry profitability, the planting of certain crops, the location and size of crop production, whether unprocessed or processed commodity products are traded, and the volume and types of imports and exports. In addition, international trade disputes can adversely affect trade flows by limiting or disrupting trade between countries or regions. Future governmental policies, regulations, or actions affecting our industry may adversely affect the supply of, demand for and prices of our products, restrict our ability to do business and cause our financial results to suffer.\nReductions in distillers grains exports to China have a negative effect on the price of distillers grains in the U.S. and could negatively affect our profitability. China was the world's largest buyer of distillers grains produced in the United States. On January 12, 2016, the Chinese government began an anti-dumping and countervailing duty investigation related to distillers grains imported from the United States which contributed to a decline in distillers grains shipped to China. China began imposing anti-dumping and anti-subsidy duties during 2016 as a result of a preliminary ruling on its investigation. On January 10, 2017, China announced a final ruling related to its anti-dumping and countervailing duty investigation imposing anti-dumping duties from a range of 42.2% to 53.7% and anti-subsidy duties from 11.2% to 12.0%. The imposition of these duties has resulted in a significant decline in demand from this top importer and negatively impacted prices for distillers grains produced in the United States. This reduction in demand could negatively impact our ability to profitably operate the ethanol plant.\nNew, stricter environmental laws and other industry-related regulations or environmental litigation could significantly impact our operations and/or increase our costs, which could adversely affect our results of operations and financial condition. Our operations are subject to federal, state, and municipal laws and regulations regulating environmental matters. The trend in environmental regulation has been towards more restrictions and limitations on activities that may affect the environment over time. For example, President Biden signed an executive order calling for new or more stringent emissions standards. Our businesses may be adversely affected by increased costs and liabilities resulting from such stricter laws and regulations. We try to anticipate future regulatory requirements that might be imposed and plan accordingly to remain in compliance with changing environmental laws and regulations and to minimize the costs of such compliance. Risks related to our environmental permits, including the risk of noncompliance, permit interpretation, permit modification, renewal of permits on less favorable terms, judicial or administrative challenges to permits by citizens groups or federal, state, or municipal entities or permit revocation are inherent in the operation of our businesses as it is with other companies engaged in similar businesses. We may not be able to renew the permits necessary for our operations, or we may be forced to accept terms in future permits that limit our operations or result in additional compliance costs. There can be no assurances as to the timing and type of such changes in existing laws or the promulgation of new laws or the amount of any required expenditures associated therewith. Climate change continues to attract considerable public and scientific attention. In recent years environmental interest groups have filed suit against companies in the energy industry related to climate change. Should such suits succeed, we could face additional compliance costs or litigation risks.  ITEM 2. PROPERTIES\nOur ethanol plant is located just east of the city limits of Richardton, North Dakota, and just north and east of the entrance/exit ramps to Interstate I-94. The plant complex is situated inside a footprint of approximately 25 acres of land which is part of an approximately 135 acre parcel. We acquired ownership of the land in 2004 and 2005. Included in the immediate campus area of the plant are perimeter roads, buildings, tanks, and equipment. An administrative building and parking area are located approximately 400 feet from the plant complex. During 2008, we purchased an additional 10 acre parcel of land that is adjacent to our current property. Our rail unloading facility and storage site was built on this property. During our 2012 fiscal year, we purchased an additional approximately 110 acres of land that is adjacent to our current property. During our 2017 fiscal year, we purchased approximately 338 acres of land which we use as part of our rail yard allowing us to ship larger trains.\nThe site also contains improvements such as rail tracks and a rail spur, landscaping, drainage systems and paved access roads. The ethanol plant was placed in service in January 2007 and is in excellent condition and is capable of functioning in excess of its 50 million gallon name-plate production capacity.\nDuring our 2022 fiscal year, all of our tangible and intangible property, real and personal, served as the collateral for our senior credit facility with Cornerstone Bank. Our senior credit facility is discussed in more detail under \"ITEM 7. Management's Discussion and Analysis - Capital Resources.\" ITEM 3. LEGAL PROCEEDINGS\nFrom time to time in the ordinary course of business, we may be named as a defendant in legal proceedings related to various issues, including without limitation, workers' compensation claims, tort claims, or contractual disputes. We are not currently involved in any material legal proceedings. ITEM 4. MINE SAFETY DISCLOSURES\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED MEMBER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nThere is no established trading market for our membership units. We have engaged FNC Ag Stock, LLC to create a Qualified Matching Service (\"QMS\") in order to facilitate trading of our units. The QMS consists of an electronic bulletin board that provides information to prospective sellers and buyers of our units. Please see the table below for information on the prices of units transferred in transactions completed via the QMS. We do not become involved in any purchase or sale negotiations arising from the QMS and we take no position as to whether the average price or the price of any particular sale is an accurate measure of the value of our units. As a limited liability company, we are required to restrict the transfers of our membership units in order to preserve our partnership tax status. Our membership units may not be traded on any established securities market or readily traded on a secondary market (or the substantial equivalent thereof). All transfers are subject to a determination that the transfer will not cause the Company to be deemed a publicly traded partnership.\nWe have no role in effecting the transactions beyond approval, as required under our Operating Agreement and the issuance of new certificates. So long as we remain a publicly reporting company, information about us will be publicly available through the SEC's EDGAR filing system. However, if at any time we cease to be a publicly reporting company, we may continue to make information about us publicly available on our website.\nAs of December 29, 2022, there were 937 holders of record of our Class A membership units.\nThe following table contains historical information by quarter for the past two years regarding the actual unit transactions that were completed by our unit-holders during the periods specified. The information was compiled by reviewing the completed unit transfers that occurred on the QMS bulletin board or through private transfers during the quarters indicated.\nQuarter Low Price High Price Average Price # of\nUnits Traded\n2021 1st\n$ 0.95 $ 0.99 $ 0.97 45,000\n2021 2nd\n$ 0.93 $ 0.93 $ 0.93 10,000\n2021 3rd\n$ 0.93 $ 1.00 $ 0.95 366,000\n2021 4th\n$ 1.03 $ 1.34 $ 1.20 50,000\n2022 1st\n$ 1.45 $ 1.92 $ 1.76 70,000\n2022 2nd\n$ 2.00 $ 2.50 $ 2.13 57,457\n2022 3rd\n$ 2.00 $ 2.25 $ 2.21 217,875\n2022 4th\n$ 2.10 $ 2.25 $ 2.21 126,052\nDistributions\nOur board of governors has complete discretion over the timing and amount of distributions to our members. Our expectations with respect to our ability to make future distributions are discussed in greater detail in \"Item 7 - Management Discussion and Analysis of Financial Condition and Results of Operations.\"\nRecent Sales of Unregistered Securities\nNone.\nIssuer Purchases of Equity Securities\nNone.\nPERFORMANCE GRAPH\nThe graph below matches the cumulative 5-Year total return of holders of Red Trail Energy, LLC's common membership units with the cumulative total returns of the NASDAQ Composite index and a customized peer group of eighteen companies that includes: Aemetis Inc., Amyris Inc., Benchmark Energy Corp, Celanese Corp, Cleantech Biofuels Inc., Data443 Risk Mitigation Inc., Glyeco Inc., Green Plains Inc., Greenbelt Resources Corp, Methes Energies International Ltd, New America Energy Corp, Newmarket Corp, Pacific Ethanol Inc., Rayonier Advanced Materials Inc., Renewable Energy Group\nInc., Rex American Resources Corp, Sino United Worldwide Consolidated Ltd and Westlake Chemical Partners LP. The graph assumes that the value of the investment in our common membership units, in each index, and in the peer group (including reinvestment of dividends) was $100 on September 30, 2017 and tracks it through September 30, 2022.\nPursuant to the rules and regulations of the Securities and Exchange Commission, the performance graph and the information set forth therein shall not be deemed to be filed for purposes of Section 18 of the Securities Exchange Act of 1934, and shall not be deemed to be incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing. ITEM 6. SELECTED FINANCIAL DATA\nReserved. ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nResults of Operations for the Years Ended September 30, 2022 and 2021\nThe following table shows the results of our operations and the percentages of revenues, cost of goods sold, general and administrative expenses and other items to total revenues in our statements of operations for the years ended September 30, 2022 and 2021:\nYear Ended\nSeptember 30, 2022 Year Ended\nSeptember 30, 2021\nStatement of Operations Data Amount % Amount %\nRevenues $ 217,135,121 100.00 $ 119,084,611 100.00\nCost of Goods Sold 190,828,171 87.88 104,115,501 87.43\nGross Profit 26,306,950 12.12 14,969,110 12.57\nGeneral and Administrative Expenses 3,801,583 1.75 3,239,245 2.72\nOperating Income 22,505,367 10.36 11,729,865 9.85\nOther Income 6,991,313 3.22 895,814 0.75\nNet Income $ 29,496,680 13.58 $ 12,625,679 10.60\nThe following table shows additional data regarding production and price levels for our primary inputs and products for the years ended September 30, 2022 and 2021:\nYear Ended\nSeptember 30, 2022 Year Ended\nSeptember 30, 2021\nProduction:\nEthanol sold (gallons) 66,268,466 51,893,094\nDried distillers grains sold (tons) 94,077 62,904\nModified distillers grains sold (tons) 121,043 127,718\nCorn oil sold (pounds) 18,466,990 12,472,550\nRevenues:\nEthanol average price per gallon (net of hedging) $ 2.52 $ 1.74\nDried distillers grains average price per ton 231.16 178.06\nModified distillers grains average price per ton 114.76 78.46\nCorn oil average price per pound 0.66 0.41\nPrimary Inputs:\nCorn ground (bushels) 22,338,824 17,717,130\nNatural gas (MMBtu)\n1,571,101 1,261,294\nCosts of Primary Inputs:\nCorn average price per bushel (net of hedging) $ 6.77 $ 4.46\nNatural gas average price per MMBtu (net of hedging) 6.13 2.77\nOther Costs (per gallon of ethanol sold):\nChemical and additive costs $ 0.085 $ 0.083\nDenaturant cost 0.051 0.035\nElectricity cost 0.052 0.045\nDirect labor cost 0.072 0.080\nRevenue\nFor our 2022 fiscal year, ethanol sales comprised approximately 77.2% of our revenues; distillers grains sales comprised approximately 16.5% of our revenues; and corn oil sales comprised approximately 5.7% of our revenues. For our 2021 fiscal year, ethanol sales comprised approximately 76.6% of our revenues; distillers grains sales comprised approximately 18.0% of our revenues; and corn oil sales comprised approximately 4.3% of our revenues.\nEthanol\nThe average price we received per gallon of ethanol sold was approximately 44.8% higher during our 2022 fiscal year compared to our 2021 fiscal year. Commodity prices were higher in 2022, especially energy prices which positively impacted the market price of ethanol. During 2022, we experienced significantly higher gasoline prices which had a positive impact on ethanol demand and prices. Uncertainty related to the war in Ukraine had an impact on energy prices which resulted in increased market ethanol prices. In addition, higher corn prices typically have an impact on ethanol prices. During our 2022 fiscal year, corn prices were significantly higher which correlated with higher ethanol prices.\nWe sold approximately 27.7% more gallons of ethanol during our 2022 fiscal year compared to our 2021 fiscal year as we had fewer plant shutdowns during our 2022 fiscal year compared to our 2021 fiscal year. We experienced improved profitability during our 2022 fiscal year which provided us an incentive to maximize production. Our efficiency in converting corn to ethanol increased during our 2022 fiscal year which also positively impacted our profitability. This improved efficiency was important during our 2022 fiscal year due to the fact that our average cost per bushel of corn ground was higher during our 2022 fiscal year compared to our 2021 fiscal year.\nWe experienced a gain of approximately $454,000 related to our ethanol derivative instruments during our 2022 fiscal year which increased our revenue. We experienced a gain of approximately $1,488,000 related to our ethanol derivative instruments during our 2021 fiscal year which increased our revenue.\nDistillers Grains\nThe average price we received for our dried distillers grains during our 2022 fiscal year was approximately 29.8% greater than the average price we received during our 2021 fiscal year primarily due to higher average corn prices during our 2022 fiscal year which typically impacts distillers grains prices. The average price we received from our modified distillers grains during our 2022 fiscal year was approximately 46.3% higher compared to our 2021 fiscal year due to stronger local demand for distillers grains along with higher corn prices. Our modified distillers grains are primarily sold in our local market. Management anticipates higher distillers grains prices during our 2023 fiscal year due to continued higher corn prices. Further, the United States experienced strong distillers grains export demand during 2022 which increased domestic distillers grains prices. If export demand for distillers grains increases during our 2023 fiscal year, it could result in significantly higher distillers grains prices.\nWe produced approximately 49.6% more tons of dried distillers grains and approximately 5.2% fewer tons of modified distillers grains during our 2022 fiscal year compared to our 2021 fiscal year. Our overall increased production had a corresponding impact on distillers grains production. We produced fewer modified distillers grains due to supply and demand factors in our local market. We decide whether to produce dried distillers grains versus modified/wet distillers grains based on market conditions and the relative cost of producing each form of distillers grains. Management anticipates that distillers grains production will remain at its current mix during our 2023 fiscal year unless distillers grains exports increase significantly which could favor producing more dried distillers grains.\nCorn Oil\nThe average price we received for our corn oil was approximately 61.0% higher during our 2022 fiscal year compared to our 2021 fiscal year primarily due to additional corn oil demand from the biodiesel and renewable diesel industries along with higher corn and soybean oil prices which both positively impact market corn oil prices. On December 17, 2019, Congress renewed the biodiesel blenders' credit retroactively for 2019 and for a total of five years. This certainty for the biodiesel blenders' credit has positively impacted demand for corn oil during that time period which has supported market corn oil prices. If the biodiesel blenders' credit expires in the future, we anticipate that corn oil demand will be lower.\nOur corn oil sales increased by approximately 48.1% during our 2022 fiscal year compared to our 2021 fiscal year due to increased overall production at the ethanol plant along with higher corn oil extraction efficiency during our 2022 fiscal year\ndue to increased market corn oil prices. Management anticipates that corn oil production will continue to be higher during our 2023 fiscal year.\nCost of Goods Sold\nOur cost of goods sold is primarily made up of corn and energy expenses. Our total cost of goods sold was higher for our 2022 fiscal year compared to our 2021 fiscal year due primarily to higher corn and natural gas costs during our 2022 fiscal year, along with a larger lower of cost or market adjustment and loss on firm purchase commitments during our 2022 fiscal year.\nCorn Costs\nOur cost of goods sold related to corn was approximately 91.2% higher during our 2022 fiscal year compared to our 2021 fiscal year due to higher average corn costs per bushel along with more bushels of corn used during our 2022 fiscal year. Our average cost per bushel of corn used, without including our derivative instrument gains and losses, was approximately 51.8% higher during our 2022 fiscal year compared to our 2021 fiscal year. Management attributes this increase in corn costs to higher corn demand from the ethanol industry during our 2022 fiscal year along with a smaller corn crop which was harvested in the fall of 2021 which reduced corn availability. The corn crop harvested in the fall of 2022 was larger than in 2021 which may have a positive impact on corn prices during our 2023 fiscal year. Management believes that there will be sufficient corn in our local market to continue to operate the ethanol plant at capacity during our 2023 fiscal year, but we may experience higher prices in order to purchase the corn we need. Our corn use increased by approximately 26.1% during our 2022 fiscal year compared to our 2021 fiscal year due to increased overall production at the ethanol plant. Management anticipates that we will use a comparable amount of corn in the future provided operating margins remain favorable.\nFrom time to time we enter into forward purchase contracts for our commodity purchases and sales. On September 30, 2022, we had forward corn purchase contracts for various delivery periods through February 2023 for a total commitment of approximately 2.2 million bushels of corn. We had a gain of approximately $1,616,000 related to our corn derivative instruments which decreased our cost of goods sold during our 2022 fiscal year. We had a gain of approximately $1,367,000 related to our corn derivative instruments during our 2021 fiscal year which decreased our cost of goods sold. We recognize the gains or losses that result from the changes in the value of our derivative instruments from corn in cost of goods sold as the changes occur. As corn prices fluctuate, the value of our derivative instruments is impacted, which affects our financial performance.\nNatural Gas Costs\nOur total natural gas costs to operate the ethanol plant were higher for our 2022 fiscal year compared to our 2021 fiscal year due to increased natural gas costs per MMBtu and increased natural gas consumption during the 2022 period. Our average cost per MMBtu of natural gas was approximately 121.3% higher during our 2022 fiscal year compared to our 2021 fiscal year. Management believes this increase in natural gas costs during our 2022 fiscal year was due to higher energy prices generally during our 2022 fiscal year. Natural gas exports to Europe due in part to the war in Ukraine has impacted domestic natural gas prices. We used approximately 24.6% more MMBtu of natural gas during our 2022 fiscal year compared to our 2021 fiscal year due to increased overall production at the ethanol plant along with the fact that we produced more dried distillers grains which uses more natural gas. Management expects that natural gas prices will remain higher during our 2023 fiscal year due to strong energy markets and the amount of natural gas available in the market, particularly during the winter months when natural gas demand for heating needs is higher.\nGeneral and Administrative Expenses\nOur general and administrative expense was higher during our 2022 fiscal year and our 2021 fiscal year due to an increase in professional fees and permitting expenses related to our CCS and USP projects during the 2022 period.\nOther Income/Expense\nWe had less interest income during our 2022 fiscal year compared to our 2021 fiscal year due to having less cash on hand during the 2022 period. Our other income was higher during our 2022 fiscal year compared to our 2021 fiscal year due to the partial forgiveness of our Ethanol Recovery Loan and the receipt of a USDA Biofuels Producers Relief Payment. We had less interest expense during our 2022 fiscal year compared to our 2021 fiscal year due to debt repayments we have made which reduced the amount of our outstanding loans.\nResults of Operations for the Years Ended September 30, 2021 and 2020\nThe following table shows the results of our operations and the percentages of revenues, cost of goods sold, general and administrative expenses, and other items to total revenues in our statements of operations for the years ended September 30, 2021 and 2020\nYear Ended\nSeptember 30, 2021 Year Ended\nSeptember 30, 2020\nStatement of Operations Data Amount % Amount %\nRevenues $ 119,084,611 100.00 $ 94,175,793 100.00\nCost of Goods Sold 104,115,501 87.43 90,134,689 95.71\nGross Profit (Loss) 14,969,110 12.57 4,041,104 4.29\nGeneral and Administrative Expenses 3,239,245 2.72 4,329,824 4.60\nOperating Loss 11,729,865 9.85 (288,720) (0.31)\nOther Income (Expense) 895,814 0.75 295,308 0.31\nNet Profit (Loss) $ 12,625,679 10.60 $ 6,588 0.01\nThe following table shows additional data regarding production and price levels for our primary inputs and products for the years ended September 30, 2021 and 2020:\nYear Ended\nSeptember 30, 2021 Year Ended\nSeptember 30, 2020\nProduction:\nEthanol sold (gallons) 51,893,094 56,510,517\nIndustrial ethanol sold (gallons) - 1,130,347\nDried distillers grains sold (tons) 62,904 91,073\nModified distillers grains sold (tons) 127,718 109,691\nCorn oil sold (pounds) 12,472,550 15,385,430\nRevenues:\nEthanol average price per gallon (net of hedging) $ 1.74 $ 1.20\nIndustrial ethanol average price per gallon - 3.27\nDried distillers grains average price per ton 178.06 128.63\nModified distillers grains average price per ton 78.46 59.20\nCorn oil average price per pound 0.41 0.24\nPrimary Inputs:\nCorn ground (bushels) 17,717,130 21,346,380\nNatural gas (MMBtu)\n1,261,294 1,425,450\nCosts of Primary Inputs:\nCorn average price per bushel (net of hedging) $ 4.46 $ 2.98\nNatural gas average price per MMBtu (net of hedging) 2.77 2.06\nOther Costs (per gallon of ethanol sold):\nChemical and additive costs $ 0.083 $ 0.077\nDenaturant cost 0.035 0.030\nElectricity cost 0.045 0.042\nDirect labor cost 0.080 0.067\nRevenue\nFor our 2021 fiscal year, ethanol sales comprised approximately 76.9% of our revenues, distillers grains sales comprised approximately 17.8% of our revenues and corn oil sales comprised approximately 4.4% of our revenues. For our 2020 fiscal year, ethanol sales comprised approximately 76.1% of our revenues, distillers grains sales comprised approximately 19.4% of our revenues and corn oil sales comprised approximately 4.0% of our revenues.\nOur total revenue for our 2021 fiscal year was approximately 24.4% more compared to our 2020 fiscal year, which resulted in higher net income during the 2021 period compared to the 2020 period.\nEthanol\nThe average price we received per gallon of ethanol sold was approximately 42.5% higher during our 2021 fiscal year compared to our 2020 fiscal year. Following reduced gasoline demand in 2020 due to the effects of the COVID-19 pandemic, travel restrictions were lifted and gasoline demand rebounded. During 2021, ethanol stocks remained lower which resulted in increased ethanol demand and prices. In addition to the lower ethanol stocks, gasoline prices were higher during our 2021 fiscal year which positively impacted ethanol demand and prices. Our ethanol revenue during our 2020 fiscal year was supported by industrial ethanol sales. We did not have any industrial ethanol sales during our 2021 fiscal year.\nWe sold approximately 7.3% fewer gallons of ethanol during our 2021 fiscal year compared our 2020 fiscal year as we worked to maximize the amount of ethanol we produced per bushel of corn we ground along with longer plant shutdowns which impacted production. Our efficiency in converting corn to ethanol increased significantly during our 2021 fiscal year which positively impacted our profitability. This improved efficiency was important during our 2021 fiscal year due to the fact that our average cost per bushel of corn ground was higher during our 2021 fiscal year compared to our 2020 fiscal year.\nWe experienced a gain of approximately $1,488,000 related to our ethanol derivative instruments during our 2021 fiscal year which increased our revenue. We experienced a gain of approximately $383,000 related to our ethanol derivative instruments during our 2020 fiscal year which increased our revenue.\nDistillers Grains\nThe average price we received for our dried distillers grains during our 2021 fiscal year was approximately 38.4% greater than the average price we received during our 2020 fiscal year primarily due to higher average corn prices during our 2021 fiscal year which typically impacts distillers grains prices. The average price we received from our modified distillers grains during our 2021 fiscal year was approximately 32.5% higher compared to our 2020 fiscal year due to stronger local demand for distillers grains along with higher corn prices. Our modified distillers grains are primarily sold in our local market.\nWe produced approximately 28.5% fewer tons of dried distillers grains and approximately 14.2% more tons of modified distillers grains during our 2021 fiscal year compared to our 2020 fiscal year. Our overall decreased production had a corresponding impact on distillers grains production. We produced more modified distillers grains due to strong local demand for distillers grains which favors the modified distillers grains product. In addition, we produced less corn oil per bushel of corn used during the 2021 period which resulted in more total distillers grains we produced during the 2021 fiscal year. When we produce more corn oil, it results in fewer tons of distillers grains produced.\nCorn Oil\nThe average price we received for our corn oil was approximately 73.9% higher during our 2021 fiscal year compared to our 2020 fiscal year primarily due to additional corn oil demand from the biodiesel industry along with higher corn and soybean oil prices which positively impact market corn oil prices.\nOur corn oil sales decreased by approximately 27.2% during our 2021 fiscal year compared to our 2020 fiscal year due to reduced overall production at the ethanol plant along with lower corn oil extraction efficiency during our 2021 fiscal year.\nCarbon Capture and Sequestration\nDuring our 2022 fiscal year, the Company completed construction and startup of carbon dioxide capture and sequestration equipment. This equipment allows us to capture and sequester up to 165,000 tons of carbon dioxide per year. This equipment allows our ethanol to reduce its carbon intensity score which could open additional higher value ethanol markets. In addition, we anticipate receiving tax credits associated with the carbon dioxide we are capturing and sequestering.\nWe expect these tax credits to be issued starting in our 2023 fiscal year. Currently, we plan to distribute these tax credits to our members.\nCost of Goods Sold\nOur cost of goods sold is primarily made up of corn and energy expenses. Our total cost of goods sold was approximately 10.7% higher for our 2021 fiscal year compared to our 2020 fiscal year due primarily to higher corn and natural gas costs during our 2021 fiscal year, partially offset by lower corn and natural gas consumption.\nCorn Costs\nOur cost of goods sold related to corn was approximately 18.8% higher during our 2021 fiscal year compared to our 2020 fiscal year due to higher average corn costs per bushel partially offset by fewer bushels of corn used during our 2021 fiscal year. Our average cost per bushel of corn used, without including our derivative instrument gains and losses, was approximately 49.7% higher during our 2021 fiscal year compared to our 2020 fiscal year. Management attributes this increase in corn costs to higher corn demand from the ethanol industry during our 2021 fiscal year along with a smaller corn crop which was harvested in the fall of 2020 which reduced corn availability. Our corn use decreased by approximately 17.0% during our 2021 fiscal year compared to our 2020 fiscal year due to decreased overall production at the ethanol plant.\nFrom time to time we enter into forward purchase contracts for our commodity purchases and sales. On September 30, 2021, we had forward corn purchase contracts for various delivery periods through March 2022 for a total commitment of approximately $34.5 million for a total of approximately 5.7 million bushels of corn. We had a gain of approximately $1,367,000 related to our corn derivative instruments which decreased our cost of goods sold during our 2021 fiscal year. We had a loss of approximately $455,000 related to our corn derivative instruments during our 2020 fiscal year which increased our cost of goods sold. We recognize the gains or losses that result from the changes in the value of our derivative instruments from corn in cost of goods sold as the changes occur. As corn prices fluctuate, the value of our derivative instruments is impacted, which affects our financial performance.\nOur total natural gas costs to operate the ethanol plant were higher for our 2021 fiscal year compared to our 2020 fiscal year due primarily to increased natural gas costs per MMBtu during the 2021 period partially offset by decreased natural gas consumption. Our average cost per MMBtu of natural gas was approximately 34.5% higher during our 2021 fiscal year compared to our 2020 fiscal year. Management believes this increase in natural gas costs during our 2021 fiscal year was due to higher energy prices generally during our 2021 fiscal year. We used approximately 11.5% fewer MMBtu of natural gas during our 2021 fiscal year compared to our 2020 fiscal year due to reduced overall production at the ethanol plant.\nGeneral and Administrative Expenses\nOur general and administrative expense was lower during our 2021 fiscal year and our 2020 fiscal year due to less labor and consulting costs during the 2021 period. During our 2020 fiscal year we had increased labor and consulting costs associated with our carbon capture and storage project which is designed to decrease the carbon intensity of our ethanol, making it more valuable in the California fuel market.\nOther Income/Expense\nWe had less interest income during our 2021 fiscal year compared to our 2020 fiscal year due to having less cash on hand during the 2021 period. Our other income was higher during our 2021 fiscal year compared to our 2020 fiscal year due to a gain on the sale of used equipment no longer needed for operations and the PPP loan forgiveness.\nChanges in Financial Condition for the Year Ended September 30, 2022 and 2021\nCurrent Assets. We had more cash and equivalents on our balance sheet on September 30, 2022 compared to September 30, 2021 due increased revenue and improved profitability on September 30, 2022 compared to September 30, 2021. We had more restricted cash on September 30, 2022 compared to September 30, 2021 as a result of having more cash deposited in our margin account with our commodities broker related to our risk management positions. We had more accounts receivable on September 30, 2022 compared to September 30, 2021 due primarily to the timing of payments from our product marketers at the end of our 2022 fiscal year compared to the end of our 2021 fiscal year. We had more inventory on hand on September 30, 2022 compared to September 30, 2021 due to more raw material inventory on September 30, 2022 due in part to higher market corn prices which are used to value our inventory.\nProperty, Plant and Equipment. The gross value of our property, plant and equipment was higher on September 30, 2022 compared to September 30, 2021 due primarily to placing into service our carbon capture and storage project during our 2022 fiscal year. The gross value of our property, plant and equipment is offset by our accumulated depreciation.\nOther Assets. Our other assets were higher on September 30, 2022 than at September 30, 2021 due primarily to an increase in our patronage equity with Roughrider Electric Cooperative. The net right of use asset related to our operating leases was lower on September 30, 2022 than at September 30, 2021 due to amortization of our operating leases during our 2022 fiscal year.\nCurrent Liabilities. We had no disbursements in excess of our bank balances on September 30, 2022 and approximately $1.3 million on September 30, 2021. When checks are presented for payment which exceed our cash balances, we use our revolving loan to pay the amounts owed. Our accounts payable was less on September 30, 2022 compared to September 30, 2021 due to fewer deferred corn payments and fewer construction payables related to the CCS project. Our accrued expenses were higher on September 30, 2022 compared to September 30, 2021 due to having more accrued compensation and benefits for our employees on September 30, 2022 compared to September 30, 2021. The current maturities of our long-term debt was higher on September 30, 2022 compared to September 30, 2021 because we had more debt which matures within 12 months of the end of our 2022 fiscal year. The current portion of our operating lease liability was less on September 30, 2022 compared to September 30, 2021 due to amortization of our leases during the 2022 fiscal year.\nLong-term Liabilities. We had less long-term liabilities on September 30, 2022 compared to September 30, 2021 due to debt payments we made during our 2022 fiscal year along with the Ethanol Recovery Program forgiveness received. We had a smaller long-term liability related to operating leases on September 30, 2022 compared to September 30, 2021 due to regular amortization of our operating leases.\nCritical Accounting Policies\nManagement uses estimates and assumptions in preparing our financial statements in accordance with generally accepted accounting principles. These estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities, and the reported revenues and expenses. Of the significant accounting policies described in the notes to our financial statements, we believe that the following are the most critical.\nInventory\nCorn is the primary raw material and, along with other raw materials and supplies, is stated at the lower of cost or net realizable value on a first-in, first-out (FIFO) basis. Work in process and finished goods, which consists of ethanol, distillers grains, and corn oil produced, is stated at the lower of average cost or net realizable value. Spare parts inventory is valued at lower of cost or net realizable value on a FIFO basis.\nAllowance for Doubtful Accounts\nManagement's estimate of the Allowance for Doubtful Accounts is based on management's estimate of the collectability of identified receivables, as well as the aging of customer accounts. A 10% change in management's estimate regarding the Allowance for Doubtful Accounts as of September 30, 2022 could impact net income by approximately $8,000 for our 2023 fiscal year.\nRevenue Recognition\nThe Company sells ethanol and related products pursuant to marketing agreements. The Company recognizes revenue from sales of ethanol and co-products at the point in time when the performance obligations in the contract are met, which is when the customer obtains control of such products and typically occurs upon shipment depending on the terms of the underlying contracts. Revenue is measured as the amount of consideration expected to be received in exchange for transferring goods or providing services. In some instances, the Company enters into contracts with customers that contain multiple performance obligations to deliver volumes of co-products over a contractual period of less than 12 months. The Company allocates the transaction price to each performance obligation identified in the contract based on relative standalone selling prices and recognizes the related revenue as control of each individual product is transferred to the customer in satisfaction of the corresponding performance obligation. Revenues are shown net of any fees incurred under the terms of the Company's agreements for the marketing and sale of ethanol and related products.\nLong Lived Assets\nProperty, plant, and equipment are stated at cost. Depreciation is provided over estimated useful lives by use of the straight line method. Maintenance and repairs are expensed as incurred. Major improvements and betterments are capitalized. The present values of finance lease obligations are classified as long-term debt and the related assets are included in property, plant and equipment. Amortization of equipment under finance leases is included in depreciation expense. Management does not believe it is reasonably likely that the valuation of its property, plant and equipment will change in any material manner in future estimates.\nLiquidity and Capital Resources\nBased on financial forecasts performed by our management, we anticipate that we will have sufficient cash from our expected credit facilities and cash from our operations to continue to operate the ethanol plant for the next 12 months. Should we experience unfavorable operating conditions in the future, we may have to secure additional debt or equity sources for working capital or other purposes. We do not have any planned capital projects for which we anticipate requiring additional borrowing.\nThe following table shows cash flows for the years ended September 30, 2022 and 2021:\n2022 2021\nNet cash provided by operating activities $ 24,059,078 $ 19,721,836\nNet cash (used in) investing activities (20,328,018) (23,053,910)\nNet cash provided by (used in) financing activities 2,205,711 (2,565,171)\nNet increase (decrease) in cash $ 5,936,771 $ (5,897,245)\nCash and equivalents, end of period $ 11,152,015 $ 5,215,244\nCash Flow from Operations\nOur operations provided more cash during our 2022 fiscal year compared to our 2021 fiscal year due primarily to a larger net income we generated during the 2022 period compared. We had a significant change in accounts payable and accrued expenses which used more cash during our 2022 fiscal year.\nCash Flow from Investing Activities\nWe used less cash for capital expenditures during our 2022 fiscal year compared to our 2021 fiscal year. During our 2022 fiscal year, we completed our carbon sequestration project which we started during our 2021 fiscal year.\nCash Flow from Financing Activities\nOur financing activities provided cash during our 2022 fiscal year due primarily to loan proceeds we received partially offset by a larger dividend we paid during our 2022 fiscal year.\nOur liquidity, results of operations and financial performance will be impacted by many variables, including the market price for commodities such as, but not limited to, corn, ethanol and other energy commodities, as well as the market price for any co-products generated by the facility and the cost of labor and other operating costs. Assuming future relative price levels for corn, ethanol and distillers grains remain consistent, we expect operations to generate adequate cash flows to maintain operations.\nThe following table shows cash flows for the years ended September 30, 2021 and 2020:\n2021 2020\nNet cash provided by operating activities $ 19,721,836 $ 3,292,949\nNet cash (used in) investing activities (23,053,910) (8,871,441)\nNet cash (used in) financing activities (2,565,171) 6,168,912\nNet increase (decrease) in cash $ (5,897,245) $ 590,420\nCash and equivalents, end of period $ 5,215,244 $ 11,112,489\nCash Flow from Operations\nOur operations provided more cash during our 2021 fiscal year compared to our 2020 fiscal year due primarily to a larger net income we generated during the 2021 period compared. We had a significant increase in accounts payable and accrued expenses related to deferred corn payments which provided more cash during our 2021 fiscal year.\nCash Flow from Investing Activities\nWe used more cash for capital expenditures during our 2021 fiscal year compared to our 2020 fiscal year. During our 2021 fiscal year, we had capital expenditures primarily related to our carbon sequestration project. During our 2020 fiscal year, we also had capital expenditures related to our carbon sequestration project and our industrial alcohol project.\nCash Flow from Financing Activities\nOur financing activities used cash during our 2021 fiscal year due primarily to a dividend we paid during our 2021 fiscal year. We also used more cash for debt and lease repayments during our 2021 fiscal year compared to our 2020 fiscal year.\nCapital Expenditures\nWe had approximately $1.2 million in construction in progress as of September 30, 2022 related to construction to repair the roof on one corn silo and DCS computer system upgrades needed for the CCS equipment. During our fiscal year ended September 30, 2022, we placed in service approximately $48.3 million in capital projects, primarily related to our carbon capture and sequestration project.\nCapital Resources\nOn January 22, 2020, we entered into a series of loans with Cornerstone Bank (\"Cornerstone\"), described below. On February 1, 2021 we renewed our $10 million Revolving Loan with Cornerstone Bank. In addition, on February 1, 2021 we entered into a $28 million construction loan with Cornerstone Bank for the carbon capture and storage project described below.\nRevolving Loan\nOn January 22, 2020, we entered into a $10 million revolving loan (the \"Revolving Loan\") with Cornerstone Bank (\"Cornerstone\"). Interest accrues on any outstanding balance on the Revolving Loan at a rate of 1.2% less than the prime rate as published by the Wall Street Journal, adjusted monthly. The Revolving Loan has a minimum interest rate of 3.0%. The maturity date of the Revolving Loan was January 31, 2022. On February 3, 2022, the Revolving Loan was renewed, and the new maturity date was March 31, 2022. On April 8, 2022, the Revolving Loan maturity date was extended to April 7, 2023. The Revolving Loan is secured by a lien on substantially all of our assets. At September 30, 2022, we had $10 million available on the Revolving Loan. The variable interest rate on September 30, 2022 was 4.75%.\nConstruction Loan\nOn January 22, 2020, we entered into a new $7 million construction loan (the \"First Construction Loan\") with Cornerstone to finance our carbon capture and storage project. Interest accrues on any outstanding balance on the First Construction Loan at a rate of 1.2% less than the prime rate as published by the Wall Street Journal, adjusted monthly. The original maturity date of the First Construction Loan was June 1, 2021. On June 3, 2021 the maturity date was extended to February 1, 2022. On April 8, 2022, the First Construction Loan was extended to October 8, 2022. At September 30, 2022, we had $7 million available under the First Construction Loan. The variable interest rate on September 30, 2022 was 4.30%.\nOn February 1, 2021, we entered into a $28 million construction loan (the \"CCS Construction Loan\") with Cornerstone to finance our carbon capture and storage project. Interest accrues on any outstanding balance on the CCS Construction Loan at a rate of 1.2% less than the prime rate as published by the Wall Street Journal, adjusted monthly. The CCS Construction Loan has a minimum interest rate of 3.0%. The maturity date of the CCS Construction Loan was January 31, 2022. On February 17, 2022, the CCS Construction Loan was extended to March 15, 2022. On April 8, 2022, the CCS Construction Loan was again extended to October 8, 2022. The CCS Construction Loan is secured by a lien on substantially all of our assets. At September 30, 2022, we had drawn $10 million on the loan and had $18 million available under the CCS Construction Loan. The variable interest rate on September 30, 2022 was 4.30%.\nOn October 28, 2022, we entered into a $25 million loan to replace the First Construction Loan and CCS Construction Loan. Interest accrues on any outstanding balance on the Loan at a fixed rate of 4.65%. The maturity date of the Loan is January 31, 2032. The Loan is secured by a lien on substantially all of our assets.\nPaycheck Protection Program Loan\nOn April 16, 2020, we entered into a new $873,400 Paycheck Protection Program Loan (the \"PPP Loan) with Cornerstone. Interest accrued on any outstanding balance on the PPP Loan at a rate of 1.0%. The maturity date of the PPP Loan was April 16, 2022. Under the terms of the loan, the Company applied for forgiveness of the entire amount of the PPP Loan on October 31, 2020, in accordance with PPP regulations, which provided for the possibility of loan forgiveness because the Company used all the proceeds of the PPP Loan for qualifying expenses in accordance with PPP requirements. The entire amount of the PPP Loan was forgiven on January 20, 2021. The forgiven amount was recorded as other income.\nEthanol Recovery Program\nOn July 13, 2020, we entered into a loan with the Bank of North Dakota Ethanol Recovery Program and Cornerstone for $5.41 million. The Ethanol Recovery Program was developed by the North Dakota Ethanol Producers Association and the Bank of North Dakota to use the existing Biofuels Pace program and value-added loan guarantee program to help ethanol production facilities weather the pandemic economic challenges. Ethanol producers could qualify for up to $15 million dollars of a low interest loan of 1% based on the amount of annual corn grind. The maturity date of the loan is July 13, 2025. The fixed interest rate as of September 30, 2022 was 3.75% with an interest rate buy down through the Bank of North Dakota to 1%. We make monthly payments of approximately $74,000 per month with the balance outstanding on September 30, 2022 of approximately $1.16 million.\nContractual Obligations and Commercial Commitments\nWe have the following contractual obligations as of September 30, 2022:\nContractual Obligations: Total Less than 1 Yr 1-3 Years 3-5 Years\nLong-term debt obligations * $ 19,160,917 $ 18,747,058 $ 413,859 $ -\nCorn purchases * 14,195,255 14,195,255 - -\nWater purchases 1,484,000 424,000 1,060,000 -\nOperating lease obligations 405,631 271,968 130,546 3,117\nFinance leases 9,867 4,576 5,291 -\nTotal $ 35,255,670 $ 33,642,857 $ 1,609,696 $ 3,117\n* - Amounts determined assuming prices, including freight costs, at which corn had been contracted for cash corn contracts and current market prices as of September 30, 2022 for basis contracts that had not yet been fixed. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to the impact of market fluctuations associated with commodity prices as discussed below. We have no exposure to foreign currency risk as all of our business is conducted in U.S. Dollars and we have immaterial exposure to interest rate risk as we had $10 million outstanding on variable interest debt indexed to prime interest rates. We use derivative financial instruments as part of an overall strategy to manage market risk. We use cash, futures and option contracts to hedge changes to the commodity prices of corn and ethanol. We do not enter into these derivative financial instruments for trading or speculative purposes, nor do we designate these contracts as hedges for accounting purposes pursuant to the requirements of Generally Accepted Accounting Principles (\"GAAP\").\nCommodity Price Risk\nWe expect to be exposed to market risk from changes in commodity prices. Exposure to commodity price risk results from our dependence on corn in the ethanol production process and the sale of ethanol.\nWe enter into fixed price contracts for corn purchases on a regular basis. It is our intent that, as we enter into these contracts, we will use various hedging instruments (puts, calls, and futures) to maintain a near even market position. For example, if we have 1 million bushels of corn under fixed price contracts we would generally expect to enter into a short hedge\nposition to offset our price risk relative to those bushels we have under fixed price contracts. Because our ethanol marketing company (RPMG) is selling substantially all of the gallons it markets on a spot basis we also include the corn bushel equivalent of the ethanol we have produced that is inventory but not yet priced as bushels that need to be hedged.\nAlthough we believe our hedge positions will accomplish an economic hedge against our future purchases, they are not designated as hedges for accounting purposes, which would match the gain or loss on our hedge positions to the specific commodity purchase being hedged. We use fair value accounting for our hedge positions, which means as the current market price of our hedge positions changes, the gains and losses are immediately recognized in our cost of sales. The immediate recognition of hedging gains and losses under fair value accounting can cause net income to be volatile from quarter to quarter and year to year due to the timing of the change in value of derivative instruments relative to the cost of the commodity being hedged. However, it is likely that commodity cash prices will have the greatest impact on the derivatives instruments with delivery dates nearest the current cash price.\nAs of September 30, 2022, we had approximately 2.2 million bushels of corn under fixed price contracts.\nIt is the current position of our ethanol marketing company, RPMG, that under current market conditions selling ethanol in the spot market will yield the best price for our ethanol. RPMG will, from time to time, contract a portion of the gallons they market with fixed price contracts.\nWe estimate that our expected corn usage will be between 21 million and 23 million bushels per calendar year for the production of approximately 59 million to 64 million gallons of ethanol. As corn prices move in reaction to market trends and information, our income statements will be affected depending on the impact such market movements have on the value of our derivative instruments.\nA sensitivity analysis has been prepared to estimate our exposure to corn, natural gas, and ethanol price risk. Market risk related to our corn, natural gas and ethanol prices is estimated as the potential change in income resulting from a hypothetical 10% adverse change in the average cost of our corn and natural gas, and our average ethanol sales price as of September 30, 2022, net of the forward and future contracts used to hedge our market risk for corn, natural gas and ethanol. The volumes are based on our expected use and sale of these commodities for a one year period from September 30, 2022. The results of this analysis, which may differ from actual results, are as follows:\nEstimated Volume Requirements for the next 12 months (net of forward and futures contracts) Unit of Measure Hypothetical Adverse Change in Price Approximate Adverse Change to Income\nEthanol 63,900,000 Gallons 10 % $ (14,697,000)\nCorn 20,600,000 Bushels 10 % $ (14,008,000)\nNatural gas 1,664,000 MMBtu 10 % $ (1,464,000)\nFor comparison purposes, below is our analysis for our fiscal year ended September 30, 2021.\nEstimated Volume Requirements for the next 12 months (net of forward and futures contracts) Unit of Measure Hypothetical Adverse Change in Price Approximate Adverse Change to Income\nEthanol 63,900,000 Gallons 10 % $ (13,419,000)\nCorn 17,135,000 Bushels 10 % $ (11,138,000)\nNatural gas 1,664,000 MMBtu 10 % $ (649,000) ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Independent Registered Public Accounting Firm\nTo the Board of Governors\nRed Trail Energy, LLC\nRichardton, North Dakota\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Red Trail Energy, LLC (the Company) as of September 30, 2022 and 2021, and the related statements of operations, changes in members equity, and cash flows, for the years ended September 30, 2022, 2021, and 2020, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for the years ended September 30, 2022, 2021, and 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Red Trail Energy, LLC in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risk of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nInventory Valuation\nAs discussed in Note 1 of the financial statements, the Companys balance of inventory was $12,544,033 as of September 30, 2022. The valuation of inventories, including corn raw materials, work in process, and ethanol finished goods, requires management to make significant assumptions and complex judgments about the inventory cost and net realizable value. These assumptions include the assessment of net realizable value by inventory category, considering market inputs and demand for their products.\nWe identified inventory valuation as a critical audit matter. Auditing these complex judgments and assumptions involves especially challenging auditor judgment due to the nature and extent of audit evidence and effort required to address these matters, including the extent of specialized skill or knowledge needed.\nThe primary procedures we performed to address this critical audit matter included:\na.Gaining an understanding of managements processes, controls and methodology to develop the estimates.\nb.Evaluating the reasonableness of the significant assumptions used by management including those related to market inputs, industry standards, and conversion factors.\nc.Testing the completeness, accuracy and relevance of the underlying data used in managements estimate, which included comparing the price used for corn valuation to readily available market information, verifying inputs for ethanol tank capacity, and evaluating other costs necessary to produce ethanol.\n/s/ Eide Bailly LLP (PCAOB ID: 286)\nWe have served as the Companys auditor since 2012.\nDenver, Colorado\nDecember 29, 2022\nRED TRAIL ENERGY, LLC\nBalance Sheets\nASSETS September 30, 2022 September 30, 2021\nCurrent Assets\nCash and equivalents $ 6,366,990 $ 508,521\nRestricted cash 4,785,025 4,706,723\nAccounts receivable, net, primarily related party 4,879,011 1,468,521\nCommodities derivative instruments, at fair value - -\nInventory 12,544,033 11,546,842\nPrepaid expenses 512,770 466,036\nTotal current assets 29,087,829 18,696,643\nProperty, Plant and Equipment\nLand 1,333,681 1,333,681\nLand improvements 17,662,538 4,465,311\nBuildings 14,930,003 9,581,778\nPlant and equipment and railroad 121,465,514 91,666,322\nConstruction in progress 1,191,290 29,154,711\n156,583,026 136,201,803\nLess accumulated depreciation 77,104,977 72,777,271\nNet property, plant and equipment 79,478,049 63,424,532\nOther Assets\nRight of use operating lease assets, net 405,631 762,847\nInvestment in RPMG 605,000 605,000\nPatronage equity 5,399,515 4,924,123\nDeposits 40,000 40,000\nTotal other assets 6,450,146 6,331,970\nTotal Assets $ 115,016,024 $ 88,453,145\nNotes to Financial Statements are an integral part of this Statement.\nRED TRAIL ENERGY, LLC\nBalance Sheets\nLIABILITIES AND MEMBERS' EQUITY September 30, 2022 September 30, 2021\nCurrent Liabilities\nDisbursements in excess of bank balances $ - $ 1,343,608\nAccounts payable 6,885,442 10,099,876\nAccrued expenses 1,531,123 1,435,117\nCommodities derivative instruments, at fair value 1,162,273 -\nAccrued loss on firm purchase commitments (see note 5) 9,000 184,000\nCustomer deposits 10,636 11,008\nCurrent maturities of notes payable 18,751,634 723,775\nCurrent portion of operating lease liabilities 271,968 372,986\nTotal current liabilities 28,622,076 14,170,370\nLong-Term Liabilities\nNotes payable, less current maturities 419,150 3,898,239\nLong-term operating lease liabilities 133,663 389,861\nTotal long-term liabilities 552,813 4,288,100\nCommitments and Contingencies (Notes 5, 6, 8, 10 and 14)\nMembers Equity (40,148,160 Class A Membership Units issued and outstanding on September 30, 2022 and 2021, respectively)\n85,841,135 69,994,675\nTotal Liabilities and Members Equity $ 115,016,024 $ 88,453,145\nNotes to Financial Statements are an integral part of this Statement.\nRED TRAIL ENERGY, LLC\nStatements of Operations\nYear Ended Year Ended Year Ended\nSeptember 30, 2022 September 30, 2021 September 30, 2020\nRevenues, primarily related party $ 217,135,121 $ 119,084,611 $ 94,175,793\nCost of Goods Sold\nCost of goods sold 189,606,091 103,667,724 89,676,395\nLower of cost or net realizable value adjustment 337,080 263,777 241,294\nLoss on firm purchase commitments 885,000 184,000 217,000\nTotal Cost of Goods Sold 190,828,171 104,115,501 90,134,689\nGross Profit 26,306,950 14,969,110 4,041,104\nGeneral and Administrative Expenses 3,801,583 3,239,245 4,329,824\nOperating Income (Loss) 22,505,367 11,729,865 (288,720)\nOther Income (Expense)\nInterest income 31,524 55,691 117,143\nOther income 6,983,063 890,818 187,626\nInterest expense (23,274) (50,695) (9,461)\nTotal other income (expense), net 6,991,313 895,814 295,308\nNet Income $ 29,496,680 $ 12,625,679 $ 6,588\nWeighted Average Units Outstanding\nBasic 40,148,160 40,148,160 40,148,160\nDiluted 40,148,160 40,148,160 40,148,160\nNet Income (Loss) Per Unit\nBasic $ 0.73 $ 0.31 $ -\nDiluted $ 0.73 $ 0.31 $ -\nNotes to Financial Statements are an integral part of this Statement.\nRED TRAIL ENERGY, LLC\nStatements of Changes in Members' Equity\nYears Ended September 30, 2022, 2021 and 2020\nClass A Member Units Treasury Units\nUnits (a) Amount Additional Paid in Capital Accumulated Retained Earnings Units Amount Total Member Equity\nBalances - September 30, 2019 40,148,160 $ 39,044,595 $ 75,541 $ 21,613,668 140,000 $ (159,540) $ 60,574,264\nUnits Issued - - - - - - -\nUnits repurchased and retired - - - - - - -\nDistribution - - - - - - -\nNet Income - - - 6,588 - - 6,588\nBalances - September 30, 2020 40,148,160 $ 39,044,595 $ 75,541 $ 21,620,256 140,000 $ (159,540) $ 60,580,852\nUnits Issued - - - - - - -\nUnits repurchased and retired - - - - - - -\nDistribution - - - (3,211,856) - - (3,211,856)\nNet Income - - - 12,625,679 - - 12,625,679\nBalances - September 30, 2021 40,148,160 $ 39,044,595 $ 75,541 $ 31,034,079 140,000 $ (159,540) $ 69,994,675\nUnits Issued - - - - - - -\nUnits repurchased and retired - - - - - - -\nDistribution - - - (13,650,220) - - (13,650,220)\nNet Income - - - 29,496,680 - - 29,496,680\nBalances - September 30, 2022 40,148,160 $ 39,044,595 $ 75,541 $ 46,880,539 140,000 $ (159,540) $ 85,841,135\n(a) - Amounts shown represent member units outstanding.\nNotes to Financial Statements are an integral part of this Statement.\nRED TRAIL ENERGY, LLC\nStatements of Cash Flows\nYear Ended Year Ended Year Ended\nSeptember 30, 2022 September 30, 2021 September 30, 2020\nCash Flows from Operating Activities\nNet income $ 29,496,680 $ 12,625,679 $ 6,588\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 4,327,706 4,921,531 4,799,667\n(Gain) loss on disposal of fixed assets - - (26,213)\nChange in fair value of derivative instruments 1,162,273 42,005 (50,880)\nAccrued purchase commitment losses (gains) (175,000) 54,000 62,000\nLower of cost or net realizable value adjustment 337,080 263,777 241,294\nLoss on firm purchase commitments 885,000 184,000 217,000\nNoncash patronage equity (475,392) (383,160) (421,812)\nLoan forgiveness (2,650,773) (873,400) -\nChange in operating assets and liabilities:\nAccounts receivable, net, primarily related party (3,410,490) 494,716 1,947,148\nInventory (2,219,271) (1,856,747) (3,633,340)\nPrepaid expenses (46,734) (94,753) (261,783)\nCustomer deposits (372) 11,008 -\nAccounts payable and accrued expenses (3,171,629) 4,333,180 413,280\nNet cash provided by operating activities 24,059,078 19,721,836 3,292,949\nCash Flows from Investing Activities\nProceeds from disposal of fixed assets - - 75,827\nCapital expenditures (20,328,018) (23,053,910) (8,947,268)\nNet cash (used in) investing activities (20,328,018) (23,053,910) (8,871,441)\nCash Flows from Financing Activities\nDisbursements in excess of bank balances (1,343,608) 1,343,608 -\nDividends paid (13,650,220) (3,211,856) -\nProceeds from notes payable 18,000,000 - 6,285,638\nDebt and finance lease repayments (800,461) (696,923) (116,726)\nNet cash provided by (used in) financing activities 2,205,711 (2,565,171) 6,168,912\nNet Increase (Decrease) in Cash, Cash Equivalents and Restricted Cash 5,936,771 (5,897,245) 590,420\nCash, Cash Equivalents and Restricted Cash - Beginning of Period 5,215,244 11,112,489 10,522,069\nCash, Cash Equivalents and Restricted Cash - End of Period $ 11,152,015 $ 5,215,244 $ 11,112,489\nReconciliation of Cash, Cash Equivalents and Restricted Cash\nCash and cash equivalents $ 6,366,990 $ 508,521 $ 9,304,638\nRestricted Cash 4,785,025 4,706,723 1,807,851\nTotal Cash, Cash Equivalents and Restricted Cash $ 11,152,015 $ 5,215,244 $ 11,112,489\nSupplemental Disclosure of Cash Flow Information\nInterest paid $ 79,149 $ 50,695 $ 9,461\nNoncash Investing and Financing Activities\nFinance lease asset acquired $ - $ - $ 23,173\nOperating lease asset acquired $ - $ 81,729 $ 168,300\nCapital expenditures in accounts payable $ 53,201 $ 964,494 $ 894,307\nCapitalized Interest $ 411,875 $ - $ -\nNotes to Financial Statements are an integral part of this Statement.\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\n1. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nNature of Business\nRed Trail Energy, LLC, a North Dakota limited liability company (the Company), owns and operates a 50 million gallon annual name-plate production ethanol plant near Richardton, North Dakota (the Plant). The Plant commenced production on January 1, 2007. Fuel grade ethanol, distillers grains and corn oil are the Company's primary products. All products are marketed and sold primarily within the continental United States.\nAccounting Estimates\nManagement uses estimates and assumptions in preparing these financial statements in accordance with generally accepted accounting principles. Those estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities and the reported revenues and expenses. Significant items subject to such estimates and assumptions include the useful lives of property, plant and equipment, inventory and allowance for doubtful accounts. Actual results could differ from those estimates.\nCash and Equivalents\nThe Company considers all highly liquid debt instruments purchased with an initial maturity of three months or less to be cash equivalents. The carrying value of cash and equivalents approximates fair value. Balances in excess of federally insured limits are not covered by FDIC insurance. Restricted cash is cash deposited in our margin account with our commodities broker related to our risk management positions.\nInvestment in RPMG\nRPMG is a subsidiary of Renewable Products Marketing Group, LLC (\"RPMG, LLC\"). We own approximately 5.6% of RPMG, LLC which allows us to realize favorable marketing fees for our products and allows us to share in the profits generated by RPMG, LLC. Our ownership interest in RPMG, LLC also entitles us to a seat on its board of directors which is filled by Gerald Bachmeier, our Chief Executive Officer. The Company accounts for the investment in RPMG at cost minus impairment.\nAccounts Receivable and Concentration of Credit Risk\nThe Company generates accounts receivable from sales of ethanol, distillers grains and corn oil. The Company has entered into agreements with RPMG, Inc. (RPMG) for the marketing and distribution of the Company's ethanol, corn oil and dried distiller's grains. Under the terms of the marketing agreement, RPMG bears the risk of loss of nonpayment by their customers. The Company markets its modified distiller's grains internally.\nFor sales of modified distiller's grains and industrial ethanol, credit is extended based on evaluation of a customer's financial condition and collateral is not required. Accounts receivable are due 30 days from the invoice date. Accounts outstanding longer than the contractual payment terms are considered past due. Internal follow up procedures are followed accordingly. Interest is charged on past due accounts.\nAll receivables are stated at amounts due from customers net of any allowance for doubtful accounts. The Company determines its allowance by considering a number of factors, including the length of time trade accounts receivable are past due, the Company's previous loss history, the customer's perceived current ability to pay its obligation to the Company, and the condition of the general economy and the industry as a whole. The Company writes off accounts receivable when they become uncollectible, and payments subsequently received on such receivables are credited to the allowance for doubtful accounts. The Company has an allowance for doubtful accounts of $78,503 and $386,850 at September 30, 2022 and 2021, respectively.\nInventory\nCorn is the primary raw material and, along with other raw materials and supplies, is stated at the lower of cost or net realizable value on a first-in, first-out (FIFO) basis. Work in process and finished goods, which consists of ethanol, distillers grains and corn oil produced, is stated at the lower of average cost or net realizable value. Spare parts inventory is valued at lower of cost or net realizable value on a FIFO basis.\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nPatronage Equity\nThe Company receives, from certain vendors organized as cooperatives, patronage dividends, which are based on several criteria, including the vendor's overall profitability and the Company's purchases from the vendor. Patronage equity typically represents the Company's share of the vendor's undistributed current earnings which will be paid in either cash or equity interests to the Company at a future date. Investments in cooperatives are stated at cost, plus unredeemed patronage refunds received in the form of capital stock and are included in Other Assets on the Company's balance sheet.\nDerivative Instruments\nThe Company enters into derivative transactions to hedge its exposure to commodity and interest rate price fluctuations. The Company is required to record these derivatives in the balance sheet at fair value.\nIn order for a derivative to qualify as a hedge, specific criteria must be met and appropriate documentation maintained. Gains and losses from derivatives that do not qualify as hedges, or are undesignated, must be recognized immediately in earnings. If the derivative does qualify as a hedge, depending on the nature of the hedge, changes in the fair value of the derivative will be either offset against the change in fair value of the hedged assets, liabilities, or firm commitments through earnings or recognized in other comprehensive income until the hedged item is recognized in earnings. Changes in the fair value of undesignated derivatives related to corn are recorded in costs of goods sold within the statements of operations. Changes in the fair value of undesignated derivatives related to ethanol are recorded in revenue within the statements of operations.\nAdditionally the Company is required to evaluate its contracts to determine whether the contracts are derivatives. Certain contracts that literally meet the definition of a derivative may be exempted as normal purchases or normal sales. Normal purchases and normal sales are contracts that provide for the purchase or sale of something other than a financial instrument or derivative instrument that will be delivered in quantities expected to be used or sold over a reasonable period in the normal course of business. Certain corn, ethanol, and distillers grain contracts that meet the requirement of normal purchases or sales are documented as normal and exempted from the accounting and reporting requirements, and therefore, are not marked to market in our financial statements.\nFirm Purchase Commitments\nThe Company typically enters into fixed price contracts to purchase corn to ensure an adequate supply of corn to operate its plant. The Company will generally seek to use exchange traded futures, options or swaps as an offsetting economic hedge position. The Company closely monitors the number of bushels hedged using this strategy to avoid an unacceptable level of margin exposure. Contract prices are analyzed by management at each period end and, if necessary, valued at the lower of cost or net realizable value in the balance sheets.\nRevenue Recognition\nThe Company generally sells ethanol and related products pursuant to marketing agreements. The Company recognizes revenue from sales of ethanol and co-products at the point in time when the performance obligations in the contract are met, which is when the customer obtains control of such products and typically occurs upon shipment depending on the terms of the underlying contracts. Revenue is measured as the amount of consideration expected to be received in exchange for transferring goods or providing services. In some instances, the Company enters into contracts with customers that contain multiple performance obligations to deliver volumes of co-products over a contractual period of less than 12 months. The Company allocates the transaction price to each performance obligation identified in the contract based on relative standalone selling prices and recognizes the related revenue as control of each individual product is transferred to the customer in satisfaction of the corresponding performance obligation. Revenues are shown net of any fees incurred under the terms of the Company's agreements for the marketing and sale of ethanol and related products. Revenues are also shown net of any discounts given for sales of modified distillers grains.\nLong-lived Assets\nProperty, plant, and equipment are stated at cost. Depreciation is provided over estimated useful lives by use of the straight line method. Maintenance and repairs are expensed as incurred. Major improvements and betterments are capitalized. For the year\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nended September 30, 2022 the Company capitalized $38.5 million in assets related to the CCS Project and $9.8 million in assets related to the Industrial Alcohol Project. The present values of finance lease obligations are classified as a liability and the related assets are included in property, plant and equipment. Amortization of equipment under finance leases is included in depreciation expense.\nDepreciation is computed using the straight-line method over the following estimated useful lives:\nMinimum Years Maximum Years\nLand improvements 15 30\nBuildings 10 40\nPlant and equipment 7 20\nRailroad 10 30\nDepreciation expense included in cost of goods sold is $4,027,744 for the year ended September 30, 2022, $4,832,462 for the year ended September 30, 2021 and $4,722,077 for the year ended September 30, 2020. Depreciation expense included in general and administrative expenses is $299,962 for the year ended September 30, 2022, $89,069 for the year ended September 30, 2021, and $77,590 for the year ended September 30, 2020.\nLong-lived assets, such as property, plant, and equipment, and purchased intangible assets subject to amortization, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. If circumstances require a long-lived asset be tested for possible impairment, the Company first compares undiscounted cash flows expected to be generated by an asset to the carrying value of the asset. If the carrying value of the long-lived asset is not recoverable on an undiscounted cash flow basis, impairment is recognized to the extent that the carrying value exceeds its fair value. Fair value is determined through various valuation techniques including, but not limited to, discounted cash flow models, quoted market values and third-party independent appraisals.\nFair Value Measurements\nThe Company has adopted guidance for accounting for fair value measurements of financial assets and financial liabilities and for fair value measurements of nonfinancial items that are recognized or disclosed at fair value in the financial statements on a recurring basis. The Company has adopted guidance for fair value measurement related to nonfinancial items that are recognized and disclosed at fair value in the financial statements on a nonrecurring basis. The guidance establishes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to measurements involving significant unobservable inputs (Level 3 measurements).\nThe three levels of the fair value hierarchy are as follows:\n· Level 1 inputs are quoted prices (unadjusted) in active markets for identical assets or liabilities that the Company has the ability to access at the measurement date.\n· Level 2 inputs are inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the asset or liability.\n· Level 3 inputs are unobservable inputs for the asset or liability.\nThe level in the fair value hierarchy within which a fair measurement in its entirety falls is based on the lowest level input that is significant to the fair value measurement in its entirety.\nExcept for those assets and liabilities which are required by authoritative accounting guidance to be recorded at fair value in our balance sheets, the Company has elected not to record any other assets or liabilities at fair value. No events occurred during the fiscal years ended September 30, 2022 and 2021 that required adjustment to the recognized balances of assets or liabilities, which are recorded at fair value on a nonrecurring basis.\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nFair Value of Financial Instruments\nThe carrying amounts of cash and cash equivalents, accounts receivable, and accounts payable approximate their fair values because of their short-term nature. The fair values of notes payable approximates the carrying value based on estimated discounted future cash flows using the current rates at which similar loans would be made.\nIncome Taxes\nThe Company is treated as a partnership for federal and state income tax purposes and generally does not incur income taxes. Instead, its earnings and losses are included in the income tax returns of the members. Therefore, no provision or liability for federal or state income taxes has been included in these financial statements.\nDifferences between financial statement basis of assets and tax basis of assets is primarily related to depreciation, derivatives, inventory, compensation and capitalization and amortization of organization and start-up costs for tax purposes, whereas these costs are expensed for financial statement purposes.\nThe Company has evaluated whether it has any significant tax uncertainties that would require recognition or disclosure. Primarily due to its partnership tax status, the Company does not have any significant tax uncertainties that would require recognition or disclosure. The Company's policy is to recognize interest expense and penalties related to uncertain tax positions as incurred.\nNet Income Per Unit\nNet income (loss) per unit is calculated on a basic and fully diluted basis using the weighted average units outstanding during the period.\nRecently Adopted Accounting Pronouncements\nMeasurement of Credit Losses on Financial Instruments\nIn June 2016, the FASB issued ASU 2016-13, Measurement of Credit Losses on Financial Instruments. ASU 2016-13 adds a current expected credit loss (CECL) impairment model to U.S. GAAP that is based on expected losses rather than incurred losses. Modified retrospective adoption is required with any cumulative-effect adjustment recorded to retained earnings as of the beginning of the period of adoption. ASU 2016-13 is effective for fiscal years beginning after December 15, 2019, including interim periods within the year of adoption. Early adoption is permitted for fiscal years beginning after December 15, 2018, including interim periods within those fiscal years. Effective October 1, 2020, the Company adopted ASU 2016-13 using the modified retrospective approach, which had no impact on adoption.\nEnvironmental Liabilities\nThe Company's operations are subject to environmental laws and regulations adopted by various governmental entities in the jurisdiction in which it operates. These laws require the Company to investigate and remediate the effects of the release or disposal of materials at its location. Accordingly, the Company has adopted policies, practices and procedures in the areas of pollution control, occupational health and the production, handling, storage and use of hazardous materials to prevent material, environmental or other damage, and to limit the financial liability which could result from such events. Environmental liabilities, if any, are recorded when the liability is probable and the costs can reasonably be estimated. The Company is not aware of any environmental liabilities identified as of September 30, 2022.\n2. CONCENTRATIONS\nCoal and Natural Gas\nIn previous years coal was an important input to our manufacturing process. During the second quarter of our 2015 fiscal year we converted the energy source for our ethanol plant to natural gas. As a result, we do not anticipate using coal to fire the ethanol plant in the future and changes in the price or availability of coal will not impact our operations. However, we maintain the equipment necessary to operate the ethanol plant using coal as the fuel source which management believes could benefit us\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nin the future, especially if natural gas prices increase or natural gas is not available at the ethanol plant. The Company signed a sales agreement with Rainbow Gas Company to supply natural gas to the plant through October 2023. The Company's intentions are to run the plant on natural gas and renew the supply agreement with its current natural gas supplier.\nSales\nWe are substantially dependent upon RPMG for the purchase, marketing, and distribution of our ethanol, DDGS, and corn oil. RPMG purchases 100% of the ethanol, DDGS, and corn oil produced at our plant, all of which is marketed and distributed to its customers. Therefore, we are highly dependent on RPMG for the successful marketing of our ethanol, DDGS, and corn oil. In the event that our relationship with RPMG is interrupted or terminated for any reason, we believe that we could locate another entity to market the ethanol, DDGS, and corn oil. However, any interruption or termination of this relationship could temporarily disrupt the sale and production of ethanol, DDGS, and corn oil and adversely affect our business and operations and potentially result in a higher cost to the Company. Amounts due from RPMG represent approximately 53% and 85% of the Company's outstanding trade receivables balance at September 30, 2022 and 2021, respectively. Approximately 90%, 93%, and 93% of revenues are comprised of sales to RPMG for the years ended September 30, 2022, September 30, 2021 and September 30, 2020, respectively.\n3. REVENUE\nRevenue Recognition\nThe Company recognizes revenue from sales of ethanol and co-products at the point in time when the performance obligations in the contract are met, which is when the customer obtains control of such products and typically occurs upon shipment (depending on the terms of the underlying contracts.) Revenue is measured as the amount of consideration expected to be received in exchange for transferring goods or providing services. In some instances, the Company enters into contracts with customers that contain multiple performance obligations to deliver specified volumes of co-products over a contractual period of less than 12 months. In such instances, the Company allocates the transaction price to each performance obligation identified in the contract based on relative standalone selling prices and recognizes the related revenue when control of each individual product is transferred to the customer in satisfaction of the corresponding performance obligation.\nRevenue by Source\nThe following table disaggregates revenue by major source for the twelve months ended September 30, 2022, 2021, and 2020.\nRevenues For the twelve months ended September 30, 2022 (audited) For the twelve months ended September 30, 2021 (audited) For the twelve months ended September 30, 2020 (audited)\nEthanol, E85 and Industrial Ethanol $ 167,657,194 $ 91,624,027 $ 71,785,439\nDistillers Grains 35,713,434 21,221,826 18,209,005\nSyrup 1,477,622 1,009,857 353,583\nCorn Oil 12,114,628 5,070,067 3,631,755\nOther 172,243 158,834 196,011\nTotal revenue from contracts with customers $ 217,135,121 $ 119,084,611 $ 94,175,793\nShipping and Handling Costs\nWe account for shipping and handling activities related to contracts with customers as costs to fulfill our promises to transfer the associated products. Accordingly, we record customer payments associated with shipping and handling costs as a component of revenue and classify such costs as a component of cost of goods sold.\nCustomer Deposits\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nCustomer deposits are contract liabilities for payments in excess of revenue recognized. Customer deposits are recognized when modified distillers grains customers make prepayments on their contracts. The beginning and ending balances for accounts receivable and customer deposits were as follows for the twelve months ended September 30, 2022, 2021, and 2020.\nFor the twelve months ended September 30, 2022 (audited) For the twelve months ended September 30, 2021 (audited) For the twelve months ended September 30, 2020 (audited)\nAccounts receivable $ 4,879,011 $ 1,468,521 $ 1,963,236\nCustomer deposits $ 10,636 $ 11,008 $ -\n4. DERIVATIVE INSTRUMENTS\nCommodity Contracts\nAs part of its hedging strategy, the Company may enter into ethanol, soybean, soybean oil, natural gas, and corn commodity-based derivatives in order to protect cash flows from fluctuations caused by volatility in commodity prices in order to protect gross profit margins from potentially adverse effects of market and price volatility on ethanol sales, corn oil sales, and corn purchase commitments where the prices are set at a future date. These derivatives are not designated as effective hedges for accounting purposes. For derivative instruments that are not accounted for as hedges, or for the ineffective portions of qualifying hedges, the change in fair value is recorded through earnings in the period of change. Ethanol derivative and soybean oil derivative fair market value gains or losses are included in the results of operations and are classified as revenue and corn derivative and natural gas derivative changes in fair market value are included in cost of goods sold.\nAs of: September 30, 2022 September 30, 2021\nContract Type # of Contracts Notional Amount (Qty) Fair Value # of Contracts Notional Amount (Qty) Fair Value\nCorn options 1,080 5,400,000 bushels $ (1,144,000) - - bushels $ -\nSoybean oil options 48 28,800 gal (18,273) - - gal -\nTotal fair value $ (1,162,273) $ -\nAmounts are recorded separately on the balance sheet - negative numbers represent liabilities\nThe following tables provide details regarding the Company's derivative financial instruments at September 30, 2022 and September 30, 2021:\nDerivatives not designated as hedging instruments:\nBalance Sheet - as of September 30, 2022 Asset Liability\nCommodity derivative instruments, at fair value $ - $ 1,162,273\nTotal derivatives not designated as hedging instruments for accounting purposes $ - $ 1,162,273\nBalance Sheet - as of September 30, 2021 Asset Liability\nCommodity derivative instruments, at fair value $ - $ -\nTotal derivatives not designated as hedging instruments for accounting purposes $ - $ -\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nStatement of Operations Income/(expense) Location of gain (loss) in fair value recognized in income Amount of gain (loss) recognized in income during the year ended September 30, 2022 Amount of gain (loss) recognized in income during the year ended September 30, 2021 Amount of gain (loss) recognized in income during the year ended September 30, 2020\nCorn derivative instruments Cost of Goods Sold $ 1,615,619 $ 1,367,491 $ (455,197)\nEthanol derivative instruments Revenue 454,365 1,487,966 382,757\nNatural gas derivative instruments Cost of Goods Sold (107,450) 1,410 (31,860)\nTotal $ 1,962,534 $ 2,856,867 $ (104,300)\n5. INVENTORY\nInventory is valued at lower of cost or net realizable value. Inventory values as of September 30, 2022 and September 30, 2021 were as follows:\nAs of September 30, 2022 September 30, 2021\nRaw materials, including corn, chemicals and supplies $ 6,887,201 $ 3,978,299\nWork in process 1,340,059 1,321,862\nFinished goods, including ethanol and distillers grains 2,702,129 4,622,007\nSpare parts 1,614,644 1,624,674\nTotal inventory $ 12,544,033 $ 11,546,842\nLower of cost or net realizable value adjustments for the years ended September 30, 2022, and 2021 and 2019 were as follows:\nFor the year ended September 30, 2022 For the year ended September 30, 2021 For the year ended September 30, 2020\nLoss on firm purchase commitments $ 885,000 $ 184,000 $ 217,000\nLoss on lower of cost or net realizable value adjustment for inventory on hand 337,080 263,777 241,294\nTotal loss on lower of cost or market adjustments $ 1,222,080 $ 447,777 $ 458,294\nThe Company has entered into forward corn purchase contracts under which it is required to take delivery at the contract price. At the time the contracts were created, the price of the contract approximated market price. Subsequent changes in market conditions could cause the contract prices to become higher or lower than market prices. As of September 30, 2022 and 2021, the average price of corn purchased under certain fixed price contracts, that had not yet been delivered, was greater than approximated market price. Based on this information, the Company has an estimated loss on firm purchase commitments of $885,000 and $184,000 for the fiscal years ended September 30, 2022 and 2021, respectively. The loss is recorded in Loss on firm purchase commitments on the statements of operations. The amount of the loss was determined by applying a methodology similar to that used in the impairment valuation with respect to inventory. Given the uncertainty of future ethanol prices, this loss may or may not be recovered, and further losses on the outstanding purchase commitments could be recorded in future periods.\nThe Company recorded inventory valuation impairments of $337,080 and $263,777 for the fiscal years ended September 30, 2022 and 2021, respectively. The impairments, as applicable, were attributable primarily to decreases in market prices of corn and ethanol. The inventory valuation impairment was recorded in Lower of cost or net realizable value adjustment on the statements of operations.\n6. BANK FINANCING\nRevolving Loan\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nOn February 3, 2022, the Company renewed our $10 million revolving loan (the \"Revolving Loan\") with Cornerstone Bank (\"Cornerstone\"). The maturity date of the Revolving Loan was extended to March 31, 2022. On April 8, 2022 the Revolving Loan was renewed and the new maturity date is April 7, 2023. At September 30, 2022, the Company had $10 million available on the Revolving Loan. Interest accrues on any outstanding balance on the Revolving Loan at a rate of 1.2% less than the prime rate as published by the Wall Street Journal, adjusted monthly. The Revolving Loan has a minimum interest rate of 3.0%. The variable interest rate on September 30, 2022 was 4.75%.\nConstruction Loans\nOn January 22, 2020, the Company entered into a $7 million construction loan (the \"First Construction Loan\") with Cornerstone. The original maturity date of the Construction Loan was June 1, 2021. On June 3, 2021 we extended the maturity date to February 1, 2022. On April 8, 2022 the Construction Loan was renewed with a new maturity date of October 8, 2022. At September 30, 2022, the Company had $7 million available on the Construction Loan. Interest accrues on any outstanding balance on the First Construction Loan at a rate of 1.2% less than the prime rate as published by the Wall Street Journal, adjusted monthly. The variable interest rate on September 30, 2022 was 4.30%.\nOn February 1, 2021, the Company entered into a $28 million construction loan (the \"CCS Construction Loan\") with Cornerstone for the carbon capture and storage project. The maturity date of the CCS Construction Loan was January 31, 2022. On February 17, 2022 the maturity date was extended to March 15, 2022. On April 8, 2022 we renewed the CCS Construction Loan with a new maturity date of October 8, 2022. At September 30, 2022, the Company had $10 million available on the CCS Construction Loan. Interest accrues on any outstanding balance on the CCS Construction Loan at a rate of 1.2% less than the prime rate as published by the Wall Street Journal, adjusted monthly. The variable interest rate on September 30, 2022 was 4.30%.\nOn October 28, 2022, we entered into a $25 million loan to replace the First Construction Loan and CCS Construction Loan. The maturity date of the Loan is January 31, 2032. The fixed interest rate is 4.65%.\nPaycheck Protection\nOn April 16, 2020, the Company received a Paycheck Protection Program Loan (the \"PPP Loan\") for $873,400 with Cornerstone. The maturity date of the PPP Loan is April 16, 2022. The fixed interest rate on September 30, 2022 was 1%. Under the terms of the loan, the Company applied for forgiveness of the entire amount of the PPP Loan on October 31, 2020, in accordance with PPP regulations, which provided for the possibility of loan forgiveness because the Company used all the proceeds of the PPP Loan for qualifying expenses in accordance with PPP requirements. The entire amount of the PPP Loan was forgiven on January 20, 2021. The forgiven amount was recorded as other income.\nEthanol Recovery Program\nOn July 13, 2020 the Company received a loan through the Bank of North Dakota Ethanol Recovery Program and Cornerstone Bank for $5.41 million. The Ethanol Recovery Program was developed by the North Dakota Ethanol Producers Association and the Bank of North Dakota to use the existing Biofuels Partnership in Assisting Community Expansion (\"PACE\") program and Value-added Guarantee Loan program to help ethanol production facilities weather the economic challenges caused by the COVID-19 pandemic. Ethanol producers could qualify for up to $15 million dollars of a low interest loan of 1% based on the amount of such producers' annual corn grind. On December 31, 2021 we received forgiveness of $2.65 million of the loan. The maturity date of the loan is July 13, 2025. At September 30, 2022 the outstanding balance was approximately $1.16 million. The fixed interest rate on September 30, 2022 was 3.75% with an interest rate buy down through the Bank of North Dakota to 1%.\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nThe Company's loans are secured by a lien on substantially all of the assets of the Company.\nSchedule of debt maturities for the twelve months ended September 30 Totals\n2023 $ 18,747,058\n2024 413,859\n2025 -\n2026 -\n2027 -\nTotal $ 19,160,917\n7. FAIR VALUE MEASUREMENTS\nThe following table provides information on those assets and liabilities that are measured at fair value on a recurring basis as of September 30, 2022 and September 30, 2021, respectively.\nFair Value Measurement Using\nCarrying Amount as of September 30, 2022 Fair Value as of September 30, 2022 Level 1 Level 2 Level 3\nLiabilities\nCommodities derivative instruments $ 1,162,273 $ 1,162,273 $ 1,162,273 $ - $ -\nFair Value Measurement Using\nCarrying Amount as of September 30, 2021 Fair Value as of September 30, 2021 Level 1 Level 2 Level 3\nLiabilities\nCommodities derivative instruments $ - $ - $ - $ - $ -\nThe fair value of the corn, ethanol and soybean oil derivative instruments is based on quoted market prices in an active market.\n8. LEASES\nThe Company leases railcar and plant equipment. Operating lease right of use assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. The Company uses its estimated incremental borrowing rate, unless an implicit rate is readily determinable, as the discount rate for each lease in determining the present value of lease payments. For the twelve months ended September 30, 2022, the Company's estimated discount rate was 4.75%. Operating lease expense is recognized on a straight-line basis over the lease term.\nThe Company determines if an arrangement is a lease or contains a lease at inception. The Company's leases have remaining lease terms of approximately 1 year to 4 years, which may include options to extend the lease when it is reasonably certain the Company will exercise those options. At September 30, 2022, the weighted average remaining lease term is 2 years. The Company does not have lease arrangements with residual value guarantees, sale leaseback terms, or material restrictive covenants. The Company does not have any sublease agreements.\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nThe Company is generally responsible for maintenance, taxes, and utilities for leased equipment. Rent expense for operating leases was approximately $948,000 for the year ended September 30, 2022, $750,000 for the year ended September 30, 2021,and $701,000 for the year ended September 30, 2020.\nEquipment under financing leases consists of office equipment and plant equipment. Equipment under financing leases is as follows at:\nAs of September 30, 2022 September 30, 2021\nEquipment $ 493,414 $ 493,414\nLess accumulated amortization (219,833) (196,389)\nNet equipment under finance lease $ 273,581 $ 297,025\nAt September 30, 2022, the Company had the following minimum commitments, which at inception had non-cancelable terms of more than one year. Amounts shown below are for the years ending September 30:\nOperating Leases Financing Leases\n2023 $ 271,968 $ 4,576\n2024 58,021 4,611\n2025 35,719 680\n2026 36,806 -\n2027 3,117 -\nTotal minimum lease commitments $ 405,631 $ 9,867\nLess amount representing interest -\nPresent value of minimum lease commitments included in notes payable on the balance sheet $ 9,867\n9. MEMBERS' EQUITY\nThe Company has one class of membership units outstanding (Class A) with each unit representing a pro rata ownership interest in the Company's capital, profits, losses, and distributions. As of September 30, 2022, 2021, and 2020 there were 40,148,160 units issued and outstanding, respectively. The Company held a total of 140,000 treasury units as of September 30, 2022, 2021, and 2020, respectively.\nTotal units authorized are 40,288,160 as of September 30, 2022, 2021, and 2020.\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\n10. COMMITMENTS AND CONTINGENCIES\nFirm Purchase Commitments\nCorn\nTo ensure an adequate supply of corn to operate the Plant, the Company enters into contracts to purchase corn from local farmers and elevators. At September 30, 2022, the Company had various fixed price contracts for the purchase of approximately 2.2 million bushels of corn. Using the stated contract price for the fixed price contracts, the Company had commitments of approximately $14.2 million related to the 2.2 million bushels under contract.\nWater\nTo meet the plant's water requirements, we entered into a ten-year contract with Southwest Water Authority to purchase raw water. Our contract requires us to purchase a minimum of 160 million gallons of water per year. The minimum estimated liability for this contract is $424,000 per year.\nProfit and Cost Sharing Agreement\nThe Company entered into a Profit and Cost Sharing Agreement with Bismarck Land Company, LLC, which became effective on November 1, 2016. The Profit and Cost Sharing Agreement provides that the Company will share 70% of the net revenue generated by the Company from business activities which are brought to the Company by Bismarck Land Company, LLC and conducted on the real estate purchased from the Bismarck Land Company, LLC. The real estate was initially purchased in exchange for 2 million membership units of the Company at $1.66 per unit. This obligation will terminate ten years after the real estate closing date of October 11, 2016 or after Bismarck Land Company, LLC receives $10 million in proceeds from the agreement. In addition, the Profit and Cost Sharing Agreement provides that the Company will pay Bismarck Land Company, LLC 70% of any net proceeds received by the Company from the sale of the subject real estate if a sale were to occur prior to termination of this obligation in accordance with to the $10 million cap and the 10 year termination of this obligation. The Company paid Bismarck Land Company, LLC $679,428 during our 2022 fiscal year and has paid a total of $1,247,581 as of September 30, 2022.\nCarbon Capture and Storage Project\nOn May 6, 2021, the Company entered into an agreement with Direct Automation for the DCS Computer System for the carbon capture and storage project. The price of the system including all equipment and installation is $800,992. The Company has paid $779,895 as of September 30, 2021 which is recorded as construction in progress.\n11. DEFINED CONTRIBUTION RETIREMENT PLAN\nThe Company established a 401k retirement plan for its employees effective January 1, 2011. The Company matches employee contributions to the plan up to 4% of employee's gross income. The Company contributed approximately $155,000, $130,000, and $134,000 to the 401k plan for the years ended September 30, 2022 and 2021, and 2020, respectively.\n12. RELATED-PARTY TRANSACTIONS\nThe Company has balances and transactions in the normal course of business with various related parties for the purchase of corn, sale of distillers grains, and sale of ethanol. The related parties include unit holders, members of the board of governors of the Company, and our third party marketer, RPMG, Inc. (RPMG) whom we have an ownership interest in. Significant related party activity affecting the financial statements is as follows:\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\nSeptember 30, 2022 September 30, 2021\nBalance Sheet\nAccounts receivable $ 4,086,689 $ 1,309,673\nAccounts Payable 60,412 788,050\nAccrued Expenses 7,645 832,904\nFor the year ended September 30, 2022 For the year ended September 30, 2021 For the year ended September 30, 2020\nStatement of Operations\nRevenues $ 202,902,678 $ 107,501,604 $ 83,637,691\nCost of goods sold 3,249,001 1,851,143 2,013,630\nGeneral and administrative - 169,910 166,991\nOther income /expense - - 119,825\nInventory Purchases $ 40,383,126 $ 14,080,623 $ 21,095,195\n13. SUBSEQUENT EVENTS\nOn October 28, 2022 the Company entered into a $25 million loan with Cornerstone to replace the First Construction and CCS Construction Loans. The maturity date of the Loan is January 31, 2032. The fixed interest rate is 4.65%. See Note 6.\n14. UNCERTAINTIES IMPACTING THE ETHANOL INDUSTRY AND OUR FUTURE OPERATIONS\nThe Company has certain risks and uncertainties that it experiences during volatile market conditions, which can have a severe impact on operations. The Company's revenues are derived from the sale and distribution of ethanol and distillers grains to customers primarily located in the United States. Corn for the production process is supplied to the plant primarily from local agricultural producers and from purchases on the open market. The Company's operating and financial performance is largely driven by prices at which the Company sells ethanol and distillers grains and by the cost at which it is able to purchase corn for operations. The price of ethanol is influenced by factors such as prices, supply and demand, weather, government policies and programs, and unleaded gasoline and the petroleum markets, although since 2005 the prices of ethanol and gasoline began a divergence with ethanol selling for less than gasoline at the wholesale level. Excess ethanol supply in the market, in particular, puts downward pressure on the price of ethanol. The Company's largest cost of production is corn. The cost of corn is generally impacted by factors such as supply and demand, weather, government policies and programs. The Company's risk management program is used to protect against the price volatility of these commodities.\nThe Company's financial performance is highly dependent on the Federal Renewable Fuels Standard (\"RFS\") which requires that a certain amount of renewable fuels must be used each year in the United States. Corn based ethanol, such as the ethanol the Company produces, can be used to meet a portion of the RFS requirement. In November 2013, the EPA issued a proposed rule which would reduce the RFS for 2014, including the RFS requirement related to corn based ethanol. The EPA proposed rule was subject to a comment period which expired in January 2014. On November 30, 2015, the EPA released its final ethanol use requirements for 2014, 2015, and 2016 which are lower than the statutory requirements in the RFS. In addition, on May 31, 2016, the EPA issued a proposed renewable volume obligation for 2017 of 14.8 billion gallons of conventional biofuels, still lower than the statutory requirement in the RFS. However, the final RFS for 2017 equaled the statutory requirement which was also the case for the 2018, 2019 and 2020 RFS final rules. On December 7, 2021, the EPA released a proposed rule regarding renewable volume obligations which was lower than the statutory amount for 2021 and proposes to reopen and reduce the renewable volume obligation for 2020.\nThe Company anticipates that the results of operations during fiscal 2022 will be affected by volatility in the commodity markets. The volatility is due to various factors, including uncertainty with respect to the availability and supply of corn due to increased demand for grain from global and national markets, the minimal carryover from the 2021 crop year drought, and the\nRED TRAIL ENERGY, LLC\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022, 2021 and 2020\n2022 drought that ranged from Western Nebraska through South Dakota and into Western North Dakota, speculation in the commodity markets, and demand for corn from the ethanol industry.\n15. QUARTERLY FINANCIAL DATA (UNAUDITED)\nSummary quarter results are as follows:\nYear Ended September 30, 2022 First Quarter Second Quarter Third Quarter Fourth Quarter\nRevenues $ 60,827,197 $ 51,677,779 $ 55,720,460 $ 48,909,685\nGross profit (loss) 17,809,414 5,079,156 6,437,590 (3,019,210)\nOperating income (loss) 16,712,235 4,419,297 5,638,600 (4,264,765)\nNet income (loss) 19,371,546 4,439,004 9,921,072 (4,234,942)\nNet income (loss) per unit-basic and diluted 0.48 0.11 0.25 (0.11)\nYear Ended September 30, 2021 First Quarter Second Quarter Third Quarter Fourth Quarter\nRevenues $ 27,557,555 $ 34,264,089 $ 42,741,846 $ 14,521,121\nGross profit (loss) 3,653,352 6,125,603 10,370,203 (5,180,048)\nOperating income (loss) 2,243,816 5,215,440 9,516,024 (5,245,415)\nNet income (loss) 2,265,694 6,093,896 9,505,434 (5,239,345)\nNet income (loss) per unit-basic and diluted 0.06 0.15 0.24 (0.13)\nYear Ended September 30, 2020 First Quarter Second Quarter Third Quarter Fourth Quarter\nRevenues $ 26,340,913 $ 23,638,144 $ 22,670,742 $ 21,525,994\nGross profit (loss) (498,570) (2,369,704) 3,449,833 3,459,545\nOperating income (loss) (1,298,075) (3,394,168) 2,177,135 2,226,388\nNet income (loss) (1,251,913) (3,235,994) 2,204,564 2,289,931\nNet income (loss) per unit-basic and diluted (0.03) (0.08) 0.05 0.06\nThe above quarterly financial data is unaudited, but in the opinion of management, all material adjustments necessary for a fair presentation of the selected data for these periods presented have been included. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nThe Company has established disclosure controls and procedures that are designed to ensure that information required to be disclosed in reports filed or submitted under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), is recorded, processed, summarized, and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission and, as such, is accumulated and communicated to the Companys management, including our Chief Executive Officer (\"CEO\"), Gerald Bachmeier, and Chief Financial Officer (\"CFO\"), Jodi Johnson, as appropriate, to allow timely decisions regarding required disclosure. Management, together with our CEO and CFO, evaluated the effectiveness of the Companys disclosure controls and procedures, as defined in Rule 13a-15(e) of the Exchange Act, as of September 30, 2022. Based on their evaluation, the CEO and CFO concluded that our disclosure controls and procedures were effective as of September 30, 2022.\nManagement's Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934, as amended). Management conducted an evaluation of the effectiveness of our internal control over financial reporting based on the criteria set forth in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\").\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of our management, including the CEO and CFO, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 30, 2022 based upon Internal Control-Integrated Framework (2013) issued by COSO. Based on this evaluation, management has concluded that our internal control over financial reporting was effective as of September 30, 2022.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. As we are a non-accelerated filer, management's report is not subject to attestation by our registered public accounting firm pursuant to Section 404(c) of the Sarbanes-Oxley Act of 2002 that permits us to provide only management's report in this annual report.\nChanges in Internal Control over Financial Reporting\nThere were no changes in the Companys internal control over financial reporting during the fourth quarter of our fiscal year ended September 30, 2022, that have materially affected, or are reasonably likely to materially affect, the Company's internal control over financial reporting.\nInherent Limitations on Effectiveness of Controls\nThe Company's management, including the Companys CEO and CFO, does not expect that the Company's disclosure controls and procedures or the Company's internal control over financial reporting will prevent or detect all error and all fraud. A control system, regardless of how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system will be met. These inherent limitations include the following:\nJudgments in decision-making can be faulty, and control and process breakdowns can occur because of simple errors or mistakes.\nControls can be circumvented by individuals, acting alone or in collusion with each other, or by management override.\nThe design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nOver time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures.\nBecause of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. GOVERNOR, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item is incorporated by reference in the definitive proxy statement from our 2023 Annual Meeting of Members to be filed with the Securities and Exchange Commission within 120 days of our 2022 fiscal year end. This proxy statement is referred to in this report as the \"2023 Proxy Statement.\" ITEM 11. EXECUTIVE COMPENSATION.\nThe information required by this Item is incorporated by reference to the 2023 Proxy Statement. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED MEMBER MATTERS.\nThe information required by this Item is incorporated by reference to the 2023 Proxy Statement. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND GOVERNOR INDEPENDENCE\nThe information required by this Item is incorporated by reference to the 2023 Proxy Statement. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nThe information required by this Item is incorporated by reference to the 2023 Proxy Statement.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nExhibits Filed as Part of this Report and Exhibits Incorporated by Reference.\nThe following exhibits and financial statements are filed as part of, or are incorporated by reference into, this report:\n(1)Financial Statements\nThe financial statements appear beginning at page 33 of this report.\n(2)Financial Statement Schedules\nAll supplemental schedules are omitted as the required information is inapplicable or the information is presented in the financial statements or related notes.\n(3)Exhibits\nExhibit No. Exhibit Filed Herewith Incorporated by Reference\n3.1 Articles of Organization, as filed with the North Dakota Secretary of State on July 16, 2003.\nFiled as Exhibit 3.1 to the registrant's registration statement on Form 10-12G (000-52033) and incorporated by reference herein.\n3.2 Amended and Restated Operating Agreement of Red Trail Energy, LLC.\nFiled as exhibit 3.1 to our Current Report on Form 8-K on August 6, 2008. (000-52033) and incorporated by reference herein.\n4.1 Membership Unit Certificate Specimen.\nFiled as Exhibit 4.1 to the registrant's registration statement on Form 10-12G (000-52033) and incorporated by reference herein.\n4.2 Member Control Agreement of Red Trail Energy, LLC.\nFiled as Exhibit 4.2 to our Annual Report on Form 10-K for the year ended December 31, 2006. (000-52033) and incorporated by reference herein.\n4.3 Description of Class A Membership Units of Red Trail Energy, LLC\nFiled as Exhibit 4.3 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2021 (000-52033) and incorporated by reference herein.\n10.1 The Burlington Northern and Santa Fe Railway Company Lease of Land for Construction/ Rehabilitation of Track made as of May 12, 2003 by and between The Burlington Northern and Santa Fe Railway Company and Red Trail Energy, LLC.\nFiled as Exhibit 10.1 to the registrant's registration statement on Form 10-12G (000-52033) and incorporated by reference herein.\n10.2 Agreement for Electric Service made the dated August 18, 2005, by and between West Plains Electric Cooperative, Inc. and Red Trail Energy, LLC.\nFiled as Exhibit 10.10 to the registrant's registration statement on Form 10-12G (000-52033) and incorporated by reference herein.\n10.3 Lump Sum Design-Build Agreement between Red Trail Energy, LLC, and Fagen, Inc. dated August 29, 2005.\nFiled as Exhibit 10.12 to the registrant's registration statement on Form 10-12G/A-3 (000-52033) and incorporated by reference herein.\n10.4 License Agreement between Red Trail Energy, LLC and ICM, Inc. dated September 9, 2005.\nFiled as Exhibit 10.12 at Exhibit D to the registrant's registration statement on Form 10-12G/A-3 (000-52033) and incorporated by reference herein.\n10.5 Security Agreement and Deposit Account Control Agreement made December 16, 2005, by and among First National Bank of Omaha, Red Trail Energy, LLC, and Bank of North Dakota.\nFiled as Exhibit 10.19 to the registrant's registration statement on Form 10-12G (000-52033) and incorporated by reference herein.\n10.6 Security Agreement given as of December 16, 2005, by Red Trail Energy, LLC, to First National Bank of Omaha.\nFiled as Exhibit 10.20 to the registrant's registration statement on Form 10-12G (000-52033) and incorporated by reference herein.\n10.7 Control Agreement Regarding Security Interest in Investment Property, made as of December 16, 2005, by and between First National Bank of Omaha, Red Trail Energy, LLC, and First National Capital Markets, Inc.\nFiled as Exhibit 10.21 to the registrant's registration statement on Form 10-12G (000-52033) and incorporated by reference herein.\n10.8 Southwest Pipeline Project Raw Water Service Contract, executed by Red Trail Energy, LLC, on March 8, 2006, by the Secretary of the North Dakota State Water Commission on March 31, 2006, and by the Chairman of the Southwest Water Authority on April 2, 2006.\nFiled as Exhibit 10.28 to the registrant's registration statement on Form 10-12G (000-52033) and incorporated by reference herein.\n10.9 Contract dated April 26, 2006, by and between the North Dakota Industrial Commission and Red Trail Energy, LLC.\nFiled as Exhibit 10.29 to the registrant's second amended registration statement on Form 10-12G/A (000-52033) and incorporated by reference herein.\n10.10 Subordination Agreement, dated May 16, 2006, among the State of North Dakota, by and through its Industrial Commission, First National Bank and Red Trail Energy, LLC.\nFiled as Exhibit 10.30 to the registrant's second amended registration statement on Form 10-12G/A (000-52033) and incorporated by reference herein.\n10.11 Firm Gas Service Extension Agreement, dated June 7, 2006, by and between Montana-Dakota Utilities Co. and Red Trail Energy, LLC.\nFiled as Exhibit 10.31 to the registrant's second amended registration statement on Form 10-12G/A (000-52033) and incorporated by reference herein.\n10.12 Security Agreement and Deposit Account Control Agreement effective August 16, 2006 by and among First National Bank of Omaha and Red Trail Energy, LLC.\nFiled as Exhibit 10.34 to our Annual Report on Form 10-K for the year ended December 31, 2006. (000-52033) and incorporated by reference herein.\n10.13 Option to Purchase 200,000 Class A Membership Units of Red Trail Energy, LLC by Red Trail Energy, LLC from North Dakota Development Fund and Stark County dated December 11, 2006.\nFiled as Exhibit 10.36 to our Annual Report on Form 10-K for the year ended December 31, 2006. (000-52033) and incorporated by reference herein.\n10.14 Audit Committee Charter adopted April 9, 2007.\nFiled as Exhibit 10.37 to our Annual Report on Form 10-K for the year ended December 31, 2006. (000-52033) and incorporated by reference herein.\n10.15 Senior Financial Officer Code of Conduct adopted March 28, 2007.\nFiled as Exhibit 10.38 to our Annual Report on Form 10-K for the year ended December 31, 2006. (000-52033) and incorporated by reference herein.\n10.16 Member Ethanol Fuel Marketing agreement by and between Red Trail Energy, LLC and RPMG, Inc dated January 1, 2008.\nFiled as Exhibit 10.41 to our Annual Report on Form 10-K for the year ended December 31, 2007 (000-52033) and incorporated by reference herein.\n10.17 Contribution Agreement by and between Red Trail Energy, LLC and Renewable Products Marketing Group, LLC dated January 1, 2008.\nFiled as Exhibit 10.42 to our Annual Report on Form 10-K for the year ended December 31, 2007 (000-52033) and incorporated by reference herein.\n10.18 Distillers Grain Marketing Agreement by and between Red Trail Energy, LLC and CHS, Inc dated March 10, 2008.\nFiled as Exhibit 10.44 to our Annual Report on Form 10-K for the year ended December 31, 2007 (000-52033) and incorporated by reference herein.\n10.19 Assignment and Assumption Agreement dated April 1, 2008, by and between Commodity Specialist Company and Red Trail Energy, LLC.\nFiled as Exhibit 10.1 to our Quarterly Report on Form 10-Q for the quarter ended March 31, 2008 (000-52033) and incorporated by reference herein.\n10.20 Employment Agreement dated August 8, 2008 by and between Red Trail Energy, LLC and Mark Klimpel.\nFiled as exhibit 99.1 to our Current Report on Form 8-K filed with the SEC on August 13, 2008 (000-52033) and incorporated by reference herein.\n10.21 Amended and Restated Member Control Agreement of Red Trail Energy, LLC.\nFiled as exhibit 4.2 to our Current Report on Form 8-K filed with the SEC on June 1, 2009 (000-52033) and incorporated by reference herein.\n10.22 Amended and Restated Management Agreement made and entered into as of September 10, 2009 by and between Red Trail Energy, LLC, and Greenway Consulting, LLC.\nFiled as Exhibit 10.2 to our Quarterly Report on Form 10-Q for the quarter ended September 30, 2009 (000-52033) and incorporated by reference herein.\n10.23 Employment Agreement between Red Trail Energy, LLC and Gerald Bachmeier dated July 8, 2010.\nFiled as Exhibit 10.1 to our Quarterly Report on Form 10-Q for the quarter ended June 30, 2010 (000-52033) and incorporated by reference herein.\n10.24 Mediated Settlement Agreement between Red Trail Energy, LLC, Fagen, Inc. and Fagen Engineering, LLC, and ICM, Inc. dated November 8, 2010. +\nFiled as Exhibit 99.1 to our Current Report on Form 8-K filed with the SEC on December 20, 2010 (000-52033) and incorporated by reference herein.\n10.25 Letter Agreement between Greenway Consulting, LLC and Red Trail Energy, LLC dated January 13, 2011.\nFiled as Exhibit 10.56 to our Current Report on Form 10-K for the fiscal year ended December 31, 2010 (000-52033) and incorporated by reference herein.\n10.26 First Amended and Restated Revolving Promissory Note dated June 1, 2011 by and between Red Trail Energy, LLC and First National Bank of Omaha.\nFiled as Exhibit 99.2 to our Current Report on Form 8-K dated June 1, 2011 (000-52033) and incorporated by reference herein.\n10.27 Equity Grant Agreement between Kent Anderson and Red Trail Energy, LLC dated July 1, 2011.\nFiled as Exhibit 10.1 to our Current Report on Form 10-Q for the quarter ended June 30, 2011 (000-52033) and incorporated by reference herein.\n10.28 Corn Oil Separation System Agreement between Solution Recovery Services, LLC and Red Trail Energy, LLC dated October 6, 2011. +\nFiled as Exhibit 10.60 to our Current Report on Form 10-K for the transition period ended September 30, 2011 (000-52033) and incorporated by reference herein.\n10.29 First Amended and Restated Construction Loan Agreement between First National Bank of Omaha and Red Trail Energy, LLC dated April 16, 2012.\nFiled as Exhibit 10.1 to our Current Report on Form 10-Q for the quarter ended March 31, 2012 (000-52033) and incorporated by reference herein.\n10.30 Amended and Restated Ethanol Marketing Agreement between RPMG, Inc. and Red Trail Energy, LLC dated August 27, 2012. +\nFiled as Exhibit 10.62 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2012 (000-52033) and incorporated by reference herein.\n10.31 Member Corn Oil Marketing Agreement between RPMG, Inc. and Red Trail Energy, LLC dated March 21, 2012. +\nFiled as Exhibit 10.63 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2012 (000-52033) and incorporated by reference herein.\n10.32 First Amendment of First Amended and Restated Construction Loan Agreement between First National Bank of Omaha and Red Trail Energy, LLC dated October 31, 2012.\nFiled as Exhibit 10.64 to our Annual Report on Form 10-K for the fiscal year ended September 30, 2012 (000-52033) and incorporated by reference herein.\n10.33 Distillers' Grain Marketing Agreement between RPMG, Inc and Red Trail Energy, LLC dated October 1, 2013.+\nFiled as Exhibit 10.31 to our Annual report on Form 10-K for the fiscal year ended September 30, 2013 (000-52033) and incorporated by reference herein.\n10.34 Rainbow Gas Asset Management Agreement, Dated September 3, 2014\nFiled as Exhibit 10.32 to our Annual report on Form 10-K for the fiscal year ended September 30, 2014 (000-52033) and incorporated by reference herein.\n10.35 Fourth Amendment of First Amended and Restated Construction Loan Agreement between First National Bank of Omaha and Red Trail Energy, LLC dated March 7, 2015\nFiled as Exhibit 10.1 to our Quarterly report on Form 10-Q for the quarter ended March 31, 2015 (000-52033) and incorporated by reference herein.\n10.36 First Amended and Restated Term Note between First National Bank of Omaha and Red Trail Energy, LLC dated March 20, 2015\nFiled as Exhibit 10.2 to our Quarterly report on Form 10-Q for the quarter ended March 31, 2015 (000-52033) and incorporated by reference herein.\n10.37 Second Amendment of First Amended and Restated Mortgage, Security Agreement, Assignment of Leases and Rents and Fixture Financing Statement between First National Bank of Omaha and Red Trail Energy, LLC dated March 20, 2015\nFiled as Exhibit 10.3 to our Quarterly report on Form 10-Q for the quarter ended March 31, 2015 (000-52033) and incorporated by reference herein.\n10.38 Third Amended and Restated Revolving Credit Note between First National Bank of Omaha and Red Trail Energy, LLC dated March 20, 2015\nFiled as Exhibit 10.4 to our Quarterly report on Form 10-Q for the quarter ended March 31, 2015 (000-52033) and incorporated by reference herein.\n10.39 Fifth Amendment of First Amended and Restated Construction Loan Agreement between First National Bank of Omaha and Red Trail Energy, LLC dated March 20, 2015\nFiled as Exhibit 10.5 to our Quarterly report on Form 10-Q for the quarter ended March 31, 2015 (000-52033) and incorporated by reference herein.\n10.40 CEO Employment Agreement\nFiled as Exhibit 10.1 to our Quarterly report on Form 10-Q for the quarter ended March 31, 2017 and incorporated by reference herein.\n10.41 Promissory Note - 10 Million between Red Trail Energy, LLC and Cornerstone Bank dated January 22, 2020.\nFiled as Exhibit 10.1 to our Quarterly report on Form 10-Q for the quarter ended December 31, 2019 and incorporated by reference herein.\n10.42 Promissory Note - 7 Million between Red Trail Energy, LLC and Cornerstone Bank dated January 22, 2020.\nFiled as Exhibit 10.2 to our Quarterly report on Form 10-Q for the quarter ended December 31, 2019 and incorporated by reference herein.\n10.43 Commercial Security Agreement between Red Trail Energy, LLC and Cornerstone Bank dated January 22, 2020.\nFiled as Exhibit 10.3 to our Quarterly report on Form 10-Q for the quarter ended December 31, 2019 and incorporated by reference herein.\n10.44 Business Loan Agreement between Red Trail Energy, LLC and Cornerstone Bank dated January 22, 2020.\nFiled as Exhibit 10.4 to our Quarterly report on Form 10-Q for the quarter ended December 31, 2019 and incorporated by reference herein.\n10.45 Promissory Note - $28 million between Red Trail Energy, LLC and Cornerstone Bank dated February 1, 2021\nFiled as Exhibit 10.1 to our Quarterly Report on Form 10-Q for the quarter ended December 31, 2020 (000-52033) and incorporated by reference herein.\n10.46 Promissory Note - $10 million between Red Trail Energy, LLC and Cornerstone Bank dated February 1, 2021\nFiled as Exhibit 10.2 to our Quarterly Report on Form 10-Q for the quarter ended December 31, 2020 (000-52033) and incorporated by reference herein\n31.1 Certificate Pursuant to 17 CFR 240.15(d)-14(a)\nX\n31.2 Certificate Pursuant to 17 CFR 240.15(d)-14(a)\nX\n32.1 Certificate Pursuant to 18 U.S.C. Section 1350\nX\n32.2 Certificate Pursuant to 18 U.S.C. Section 1350\nX\n101.INS Inline XBRL Instance Document X\n101.SCH Inline XBRL Schema Document X\n101.CAL Inline XBRL Calculation Document X\n101.LAB Inline XBRL Labels Linkbase Document X\n101.PRE Inline XBRL Presentation Linkbase Document X\n101.DEF Inline XBRL Definition Linkbase Document X\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in the Interactive Data Files submitted as Exhibit 101)\n(+) Confidential Treatment Requested.\n(X) Filed herewith.\n(**) Furnished herewith\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nRED TRAIL ENERGY, LLC\nDate: December 29, 2022 /s/ Gerald Bachmeier\nGerald Bachmeier\nPresident and Chief Executive Officer\n(Principal Executive Officer)\nDate: December 29, 2022 /s/ Jodi Johnson\nJodi Johnson\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: December 29, 2022 /s/ Gerald Bachmeier\nGerald Bachmeier, Chief Executive Officer and President\n(Principal Executive Officer)\nDate: December 29, 2022 /s/ Jodi Johnson\nJodi Johnson, Chief Financial Officer and Treasurer\n(Principal Financial Officer)\nDate: December 29, 2022 /s/ Sid Mauch\nSid Mauch, Chairman and Governor\nDate: December 29, 2022 /s/ Syd Lawler\nSyd Lawler, Governor\nDate: December 29, 2022 /s/ Ambrose Hoff\nAmbrose Hoff, Secretary and Governor\nDate: December 29, 2022 /s/ Ron Aberle\nRon Aberle, Governor\nDate: December 29, 2022 /s/ Mike Appert\nMike Appert, Governor\nDate: December 29, 2022 /s/ Frank Kirschenheiter\nFrank Kirschenheiter, Governor\nDate: December 29, 2022 /s/ William A. Price\nWilliam A. Price, Governor"
}