{
    "cik": "1362516",
    "company": "Cleartronic, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-29",
    "period_of_report": "2022-09-30",
    "sic": "4812",
    "state_of_inc": "FL",
    "state_location": "FL",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1362516/0001091818-22-000187-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1362516/000109181822000187/clri-20220930.htm.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1362516/0001091818-22-000187.txt",
    "filename": "1362516_10K_2022_0001091818-22-000187.htm",
    "content": "Item 1. Business.\nThe Company\nThe Company was initially incorporated on November 15, 1999, as Menu Sites, Inc., a Florida corporation. On March 9, 2001, the Company's name was changed to CNE Communications, Inc. On October 1, 2004, the name was changed to CNE Industries, Inc. and on March 29, 2005, the name was changed to GlobalTel IP, Inc. On May 9, 2008, the Company's name was changed to Cleartronic, Inc.\nAll current operations are conducted through the Company's wholly owned subsidiary, ReadyOp Communications, Inc. (\"ReadyOp\"), a Florida corporation incorporated on September 15, 2014. ReadyOp facilitates the marketing and sales of subscriptions to the ReadyOp™ and ReadyMed ™ platform and the AudioMate IP gateways discussed below.\nIn March 2018, the Company approved the spin-off VoiceInterop into a separate company under a Form S-1 registration to be filed with the United States Securities and Exchange Commission. On May 13, 2019, VoiceInterop filed an S-1 registration with the United States Securities and Exchange Commission. All VoiceInterop transactions have been recorded as discontinued operations. On February 14, 2020, the distribution of shares was approved by FINRA and VoiceInterop was deconsolidated from Cleartronic, Inc. (See Note 6).\nIn October 2019, the Company acquired the ReadyMed software platform from Collabria LLC. ReadyMed is a web-based secure communications platform initially designed for the healthcare industry. This includes hospitals, clinics, doctor's offices, health insurance companies, workers compensation insurance companies and many other segments of the healthcare industry. The Company offers both the ReadyOp and ReadyMed capabilities to clients and usually refers to the platform as ReadyOp to avoid confusion in the marketplace of two platforms.\nReadyOp™ Software\nReadyOp is a proprietary, innovative web-based planning and communications platform for efficiently and effectively planning, managing, communicating, and directing operations and emergency response. ReadyOp is used by local, state and federal government agencies, corporations, school districts, utilities, hospitals and others to manage and report daily operations as well as the ability to handle incidents and emergency situations. ReadyOp is offered as a software as a service (SAAS) program on an annual contract basis although an increasing number of clients have requested multi-year agreements.\nReadyOp requires no new or on-site hardware or programming by clients and provides multiple options for communications including radio interoperability using the Company's AudioMate gateways. Plans and operations can be built and stored securely in ReadyOp on a by-location, region and systemwide basis. Assets can be listed along with their location, person to contact and other information that may be needed. Diagrams, charts, maps, pictures, report forms and other documentation can be securely stored yet immediately available securely from any location. ReadyOp also provides efficient planning and response for responding to disasters and for continuity of operations (COOP) and recovery. ReadyOp is the COOP platform for multiple organizations including many federal agencies.\nReadyMed™ Software\nIn October 2019, the Company acquired the ReadyMed software platform from Collabria LLC. In exchange for this asset, the Company issued 12,000,000 shares of Common stock of the Company. ReadyMed is a web-based secure communications platform initially designed for the healthcare industry. This includes hospitals, clinics, doctor's offices, health insurance companies, workers compensation insurance companies and many other segments of the healthcare industry. The platform provides caregivers with patient tracking capability and allows physicians and other healthcare entities to track patient progress after medical treatment and/or release from hospital care. The software also enables monitoring and reporting of patients in medium- and long-term care. Additionally, the platform provides secure communications capabilities and recordkeeping to track the healing process of patients, record their recovery and monitor their medications. During the COVID-19 pandemic this software proved beneficial to multiple federal and state agencies and clients in the healthcare industry. The Company offers both the ReadyOp and ReadyMed capabilities to clients and usually refers to the platform as ReadyOp to avoid confusion in the marketplace of two products.\nAudioMate IP Gateways\nThe Company offers a proprietary line of Internet Protocol Gateways branded as AudioMate 360 IP Gateway. The AudioMate 360 IP Gateway was designed to provide an Internet Protocol Gateway to users of unified group communications. The AudioMate units are currently being sold directly to end-users by the Company's sales teams and by Value Added Resellers (\"VARs\"). More than 1,000 end-users in the United States and 18 foreign countries have purchased the Company's AudioMate gateways. Although other devices are available that perform the same or similar functions, we believe that our price for the AudioMate 360 IP Gateway is competitive with prices other companies are charging for similar devices.\nPatents and Intellectual Property\nOur business will be dependent in part on our intellectual property. For projects that are in development, we intend to rely on intellectual property rights afforded by trademark and trade secret laws, as well as confidentiality procedures, licensing arrangements and potential patent filings. These measures are to establish and protect our rights to the technology and other intellectual property. We cannot foretell if these procedures and arrangements will be adequate in protecting our intellectual property.\nOn March 13, 2012, the United States Patent Office notified the Company that U.S. Patent Number 8,135,001 B1 had been granted for the 34 claims of our patent application for Multi Ad Hoc Interoperable Communicating Networks. We may file similar patent applications in additional countries. The claims in the patent application relate to various aspects of the AudioMate 360 IP Gateway. It may be that one or more of the claims are not meaningful. Furthermore, the validity of issued patents is frequently challenged by others. One or more patent applications may have been filed by others previous to our filing, which encompass the same or similar claims. A patent application does not in and of itself grant exclusive rights. A patent application must be reviewed by the Patent Office of each relevant country prior to issuing as a patent and granting exclusive rights. The laws of many foreign countries do not protect intellectual property rights to the same extent as do the laws of the United States, if at all.\nBecause of limited resources, the Company may be unable to protect a patent, either owned or licensed, or to challenge others who may infringe upon a patent. Because many holders of patents have substantially greater resources and patent litigation is very expensive, we may not have the resources necessary to successfully challenge the validity of patents held by others or withstand claims of infringement or challenges to any patent the Company may possess or obtain. Even if we prevail, the cost and management distraction of litigation could have a material adverse effect on the Company.\nInternet Protocol Gateways and their related manufacturing processes are covered by a large number of patents and patent applications. Infringement actions may be instituted against the Company if we use or are suspected of using technology, processes or other subject matter that is claimed under patents of others. An adverse outcome in any future patent dispute could subject us to significant liabilities to third parties, require disputed rights to be licensed or require us to cease using the infringed technology.\nIf trade secrets and other means of protection upon which the Company relies may not adequately protect us, the Companys intellectual property could become available to others. Although we may rely on trade secrets, copyright law, employee and third-party nondisclosure agreements and other protective measures to protect some of our intellectual property, these measures may not provide meaningful protection to the Company.\nExclusive Licensing Agreement\nOn May 5, 2017, the Company entered into an Exclusive Licensing Agreement with Sublicensing Terms (the \"Agreement\") with the University of South Florida Research Foundation, Inc. (\"USFRF\") relating to an exclusive license of certain patent rights in connection with one of USFRF's U.S. Patent Applications. Both parties recognize that the research and development work provided by the Company was sufficient for USFRF to enter into the Agreement with the Company.\nThe Agreement is effective April 25, 2017 and continues until the later of the date that no Licensed Patent remains a pending application or an enforceable patent or the date on which the Licensee's obligation to pay royalties expires.\nThe Company paid USFRF a License Issue Fee of $8,000 and $953 as reimbursement of expenses associated with the filing of the Licensed Patent for the year ended September 30, 2022. The company agreed to pay USFRF a royalty of 3% for sales of all Licensed Products and Licensed Processes and agreed to pay USFRF minimum royalty payments as follows:\nPayment\nYear\n$1,000\n$4,000\n$8,000\n-and every year thereafter on the same date, for the life of the agreement.\nIn the event the Company proposes to sell any Equity Securities, then USFRF will have the right to purchase 5% of the securities issued in such offering on the same terms and conditions as are offered to other purchasers in such financing.\nRapid Technological Change Could Render the Company's Products Obsolete\nThe Company's markets are characterized by rapid technological changes, frequent new product introductions and enhancements, uncertain product life cycles, changes in customer requirements, and evolving industry standards. The introduction of new products embodying new technologies and the emergence of new industry standards could render our existing products obsolete. The Company's future success will depend upon our ability to continue to develop and introduce new products and services to address the increasingly sophisticated needs of customers. The Company may experience delays in releasing new products, product enhancements and services in the future which may cause customers and prospective to forego purchase and use of our products and purchase those of competitors.\nSeasonality of Our Business\nWe do not anticipate that our business will be affected by seasonal factors.\nImpact of Inflation\nWe are affected by inflation along with the rest of the economy. Specifically, our costs to complete our products could rise if specific components needed incur an increase in cost.\nManufacturing and Suppliers\nWe have outsourced the manufacturing of our AudioMate 360 IP Gateway. This outsourcing has allowed us to:\n●\nAvoid costly capital expenditures for the establishment of manufacturing operations;\n●\nFocus on the design, development, sales and support of our products and services; and\n●\nLeverage the scale, expertise and purchasing power of specialized contract manufacturers.\nCurrently, Company has arrangements for the production of the AudioMate gateways with two contract manufacturers. The reliance on contract manufacturing involves a number of potential risks, including the absence of adequate capacity, ownership of certain elements of electronic designs, and reduced control over delivery schedules. The Company's contract manufacturers can provide a range of operational and manufacturing services, including component procurement and performing final testing and assembly of our products. The Company intends to continue use of contract manufacturers to procure components and to maintain adequate manufacturing capacity.\nCompetition\nWe are not aware of any direct competitors for ReadyOp and ReadyMed that offer the same combinations of capabilities and function. However, there are similar programs being marketed that appear similar and are sometimes confused with ReadyOp such as WebEOC and Everbridge. ReadyOp provides different capabilities and is priced lower than both of these and in fact, has several clients that use one or even both of these programs in addition to ReadyOp. We may have increased competition in the future. We continue to develop and enhance the ReadyOp/ReadyMed platform to improve the value and increase the potential market size and growth of our client clientele.\nThe unified communications industry where the Company's gateways are offered is competitive. The Company will continue to offer the AudioMate gateways, but primarily in conjunction with the ReadyOp platform to provide radio interoperability. Competition for an integrated radio and operations platform is limited and the Company will continue to market the ReadyOp platform, both with the gateways and without.\nSales and Marketing\nThe ReadyOp/ReadyMed platform is currently marketed through a combination of inside salespersons and outside sales groups. We intend to expand the use of commissioned sales groups and individual sales representatives to market and sell our programs and gateways.\nKey Personnel of Cleartronic\nOur future financial success depends to a large degree upon the personal efforts of our key personnel, Michael M. Moore, our Chief Executive Officer (CEO) and Director, and Larry M. Reid, our Chief Financial Officer (CFO), Secretary and Director. They and their designees play the major role in securing persons capable of developing and executing the Company's business strategy. While the Company intends to employ additional executive, development and technical personnel in order to minimize dependency upon any one person, we may not be successful in attracting and retaining the persons needed.\nAt present, Cleartronic has two executive officers, Michael M. Moore and Larry M. Reid. A copy of the employment agreement with Mr. Moore has been previously filed on January 13, 2016 as an exhibit to a Form 10-K. Mr. Moore is paid a base salary of $16,667 per month. Effective April 20, 2022, the annual compensation increased to $220,000. See Item 13. \"Certain Relationships and Related Transactions and Director Independence.\"\nIn March 2015, the Company entered into a new employment agreement with the Company's CFO, Larry M. Reid (the \"Agreement\"). Under the Agreement, Mr. Reid agreed to remit 2.0 billion shares of common stock back to the Company in exchange for 200,000 shares of Series C Convertible Preferred stock with a fair value of $252,000. Mr. Reid is paid a base salary of $8,000 per month. A copy of the employment agreement with Mr. Reid has been previously filed on March 18, 2015 with the SEC as an exhibit to a Form 8-K. Effective October 1, 2021, the annual compensation increased to $104,000.\nUnless the Company shall have given Mr. Moore or Mr. Reid written notice at least 30 days prior to the Termination Date, the employment agreements automatically renew and continue in effect for additional one-year periods. The Company has the election at any time after the expiration of the initial term of the Mr. Reid's Agreement to give Mr. Reid notice of Termination.\nThe Financial Results for Cleartronic May Be Affected by Factors Outside of Our Control\nOur future operating results may vary from quarter to quarter due to a variety of factors, many of which are outside our control. Our anticipated expense levels are based, in part, on our estimates of future revenues and may vary from projections. We may be unable to adjust spending rapidly enough to compensate for any unexpected revenue shortfall. Accordingly, any significant shortfall in revenue in relation to our planned expenditures could materially and adversely affect our business, operating results, and financial condition. Further, we believe that period-to-period comparisons of our operating results are not necessarily a meaningful indication of future performance.\nTransfer Agent\nOur transfer agent is ClearTrust, LLC, whose address is 16540 Pointe Village Drive, Suite 206, Lutz, Florida 33558, and telephone number is (813) 235-4490.\nCompany Contact Information\nOur principal executive offices are located at 8000 North Federal Highway, Suite 100, Boca Raton, Florida 33487, telephone (561) 939-3300. Our email address is info@cleartronic.com. The Cleartronic Internet website is www.cleartronic.comand the ReadyOp website is www.readyop.com. The information contained in our website does not constitute part of this report. Item 1A. Risk Factors.\nNot applicable. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Property.\nDuring the years prior to December 1, 2022, the Company sub-leased approximately 1,700 square feet for our principal offices in Boca Raton, Florida, from VoiceInterop, Inc. The monthly rent is $1,400 and provided for annual increases of base rent of 4% until the expiration date. The lease expired on November 30, 2021. On December 1, 2021, the Company signed a one year lease for approximately 2,000 square feet for our principal offices in Boca Raton, Florida. The monthly rent is $2,200. The lease expires on November 30, 2022.\nOn December 2, 2022, and effective on January 1, 2023, the Company signed a two-year lease of 1,145 square feet for our principal offices in Clearwater, Florida. The monthly rent is $2,134 in year one and increases to $2,198 in year two. The lease expires on December 31, 2024 (See Note 8). Item 3. Legal Proceedings.\nCleartronic is not engaged in any litigation at the present time and management is unaware of any claims or complaints that could result in future litigation. Management will seek to minimize disputes with the Company's customers but recognizes the inevitability of legal action in today's business environment as an unfortunate price of conducting business. Item 4. Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nThe Company's common stock has been traded on the OTCPINK under the symbol \"CLRI.\" The last price of our common stock as reported on the pink tier of OTC Markets on September 30, 2022 was $0.0300 per share.\nAs of September 30, 2022 we were authorized to issue 5,000,000,000 shares of our common stock, of which 228,120,695 shares were outstanding. Our shares of common stock are held by approximately 200 stockholders of record. The number of record holders was determined from the records of our transfer agent and does not include beneficial owners of our common stock whose shares are held in the names of various securities brokers, dealers, and registered clearing agencies. In addition to our authorized common stock, Cleartronic has designated 200,000,000 shares of preferred stock, par value $0.00001 per share, of which 7,525,403 shares are issued or outstanding. There is no trading market for the shares of our preferred stock.\nDividends\nWe do not anticipate paying any cash dividends or other distributions on the Company's common stock in the foreseeable future. Any future dividends will be declared at the discretion of the Company's board of directors and will depend, among other things, on the earnings and financial requirements for future operations and growth, and other facts as the board of directors may then deem appropriate. See \"Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters,\" for a description of the preferred stock and dividend rights pertaining to the preferred stock.\nThe Company is obligated to pay dividends on its Series A Convertible Preferred Stock. Each Series A Preferred Holder is entitled to receive cumulative dividends at the rate of 8% of $1.00 per annum for each outstanding share of Series A Preferred then held by such Series A Preferred Holder, on a pro rata basis. As of September 30, 2022 and 2021, the cumulative arrearage of undeclared dividends totaled $165,144 and $123,998 , respectively.\nRecent Sales of Unregistered Securities\nExcept for those unregistered securities previously disclosed in reports filed with the Securities Exchange Commission during the period covered by this report, we have not sold any securities under the Securities Act of 1933.\nIssuer Purchases of Equity Securities\nNone Item 6. Selected Financial Data.\nNot applicable. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations.\nTHE FOLLOWING DISCUSSION SHOULD BE READ TOGETHER WITH THE INFORMATION CONTAINED IN THE CONSOLIDATED FINANCIAL STATEMENTS AND RELATED NOTES INCLUDED ELSEWHERE IN THIS ANNUAL REPORT ON FORM 10-K.\nImpact of COVID-19 Outbreak\nThe COVID-19 global and national health emergency caused significant disruption in United States economy and financial markets. The spread of COVID-19 caused illness, quarantines, cancellation of events and travel, business and school shutdowns, reduction in business activity and financial transactions, labor shortages, supply chain interruptions and overall economic and financial market instability. The COVID-19 pandemic impacted the Company's sales efforts and supply chain, but the Company was able to continue growing its client base, revenue and profitability during the pandemic period. While travel and other restrictions have been imposed, the Company has mitigated the situation by teleconferencing and web demos.\nA severe, prolonged economic downturn could result in a variety of risks including weakened demand for products and services and a decreased ability to raise additional capital when needed on acceptable terms, if at all. The Company will continue to closely monitor market conditions and respond accordingly. However, there is no assurance that we will not have adverse impacts in the future.\nMANAGEMENT DISCUSSION\nThe following discussion reflects the Company's plan of operation. This discussion should be read in conjunction with the financial statements which are attached to this report. This discussion contains forward-looking statements, including statements regarding our expected financial position, business and financing plans. These statements involve risks and uncertainties. The actual results could differ materially from the results described in or implied by these forward-looking statements as a result of various factors, including those discussed below and elsewhere in this report, particularly under the headings \"Special Note Regarding Forward-Looking Statements.\"\nUnless the context otherwise suggests, \"we,\" \"our,\" \"us,\" and similar terms, as well as references to \"Cleartronic,\" all refer to Cleartronic, Inc. and our subsidiaries as of the date of this report.\nResults of Operations\nYear Ended September 30, 2022 Compared to Year Ended September 30, 2021.\nRevenue\nRevenues from operations were $2,017,563 for the year ended September 30, 2022 as compared to $1,651,297 for the year ended September 30, 2021. Subscriptions of ReadyOp software increased 14.99% from $1,581,413 to $1,818,035 in the year ended September 30, 2021 and 2022, respectively. Sales of ReadyOp ACE IP gateways increased 8.33% from $31,200 to $33,800 in the year ended September 30, 2021 and 2022, respectively. Consulting fees and related income increased from $18,815 in 2021 to $86,000 in 2022 due to more training activity.\nCost of Revenue\nCost of revenues was $334,138 for the year ended September 30, 2022, as compared to $267,298 for the year ended September 30, 2021. This increase was primarily due to higher costs associated with the products. Gross profits were $1,683,425 and $1,383,999 for the years ended September 30, 2022 and 2021, respectively, an increase of 21.63% . Gross profit margin decreased slightly to 83.44% from 83.81% for the years ended September 30, 2022 and 2021, respectively.\nOperating Expenses\nOperating expenses increased 14.80% to approximately $1,329,791 for the year ended September 30, 2022 compared to $1,158,318 for the year ended September 30, 2021. For the year ended September 30, 2022, selling expenses were $659,796 compared to $571,242 for the year ended September 30, 2021. This increase is primarily due to an increase in travel expenses as sales efforts began increasing due to the decreased impact of the COVID-19 pandemic and hiring additional sales staff due an increase in revenues and slightly offset by the decrease in advertising expenses. General and administrative expenses increased by $44,059 or 10.56%. Amortization and depreciation expense increased from $2,129 for the year ended September 30, 2021 to $3,732 for the year ended September 30, 2022. Research and development expenses were $167,661 for the year ended September 30, 2021 as compared to $204,918 for the year ended September 30, 2022. The increase was primarily due to increase in consulting expense and expenses associated with the development of a new technology associated with a patent owned by the University of South Florida Research Foundation. The Company has obtained the exclusive license to develop and market the technology associated with the patent.\nOther Income/(Expenses)\nThe Company's Other Income decreased to $47,261 from $135,417 during the year ended September 30, 2021, as compared to the year ended September 30, 2022. The primary reason for this decrease was gain on forgiveness of PPP loan, the settlement of certain accounts payable and offset slightly by decreased interest expense.\nIncome from Continuing Operations\nThe Company's income from continuing operations increased to $400,895 from $361,098 during the year ended September 30, 2022 as compared to the year ended September 30, 2021. The increase was primarily due to higher margins generated from subscriptions of ReadyOp software. Factoring out the $106,727 gain for the forgiveness of the PPP loan in the year ending September 30, 2021, the Companys income from continuing operations would have been $254,371. The Companys increase in income from continuing operations would then have been $409,562 for the current year versus the $254,371, an annual increase of 57.60%\nNet Income Attributable to Common Stockholders\nNet income attributable to common stockholders was $359,858 and $320,171 for the years ended September 30, 2022 and 2021, respectively. The increase was primarily due to higher profit generated from subscription of ReadyOp software in 2022.\nLIQUIDITY AND CAPITAL RESOURCES\nFor the year ended September 30, 2022, net cash used in operations of $74,649 was the result of a net income of $400,895, depreciation expense of $3,732, provision of bad debt of $14,000, gain on settlement and reversal of accounts payable of $47,792, an increase in accounts receivable of $231,785, and a decrease of accounts payable of $36,943. These were offset by an increase in inventory of $6,444, an increase in prepaid expenses of $6,228, and an increase in deferred revenue of $6,285.\nFor the year ended September 30, 2021, net cash provided by operations of $378,558 was the result of a net income of $361,098, depreciation expense of $2,129, provision of bad debt of $10,000, gain on forgiveness on PPP loan of $106,727, gain on settlement and reversal of accounts payable of $29,965, an increase in accounts receivable of $111,630, an increase in prepaid expenses of $9,541, an increase in due from related parties of $31,381 and a slight increase in inventory of $2,182. These were offset by a decrease of accounts payable of $63,458, a decrease in accrued expenses of $43,457 and an increase in deferred revenue of $403,671.\nNet cash used in investing activities was $7,483 and $5,093 for the years ended September 30, 2022 and 2021, respectively, which was for the purchase of fixed assets.\nNet cash used in financing activities was $48,447 for the year ended September 30, 2021, which was a repayment of a stockholder note payable.\nCritical Accounting Estimates\nWe prepare our consolidated financial statements in accordance with accounting principles generally accepted in the United States of America, and make estimates and assumptions that affect our reported amounts of assets, liabilities, revenue and expenses, and the related disclosures of contingent liabilities. We base our estimates on historical experience and other assumptions that we believe are reasonable in the circumstances. Actual results may differ from these estimates.\nThe following critical accounting policies affect our more significant estimates and assumptions used in preparing our consolidated financial statements.\nACCOUNTS RECEIVABLE\nThe Company provides an allowance for uncollectible accounts based upon a periodic review and analysis of outstanding accounts receivable balances. Uncollectible receivables are charged to the allowance when deemed uncollectible. Recoveries of accounts previously written off are used to credit the allowance account in the periods in which the recoveries are made. When a client is invoiced, the amount is recorded as an asset in Accounts Receivable and as Deferred Revenue in Current Liabilities. When payment is received the amount is moved to Cash on the balance sheet. The amount listed as Deferred Revenue is amortized monthly over the license period.\nINVENTORY\nInventory consists of components held for assembly and finished goods held for resale or to be utilized for installation in projects. Inventory is valued at lower of cost or net realizable value on a first-in, first-out basis. The Company's policy is to record a reserve for technological obsolescence or slow-moving inventory items. The Company only carries finished goods to be shipped along with completed circuit boards and parts necessary for final assembly of finished product. All existing inventory is considered current and usable.\nRecent Accounting Pronouncements\nThe recent accounting standards that have been issued or proposed by Financial Accounting Standard Board (FASB) or other standard setting bodies that do not require adoption until a future date are not expected to have a material impact on the financial statement upon adoption.\nThe recent accounting pronouncements are described in Note 2 to the consolidated financial statement appearing elsewhere in this report.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot applicable. Item 8. Financial Statements and Supplementary Data.\nThe financial statements and related notes are included as part of this report as indexed in the appendix on page, et seq. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone Item 9A. Controls and Procedures.\nEvaluation of Disclosure and Controls and Procedures. We carried out an evaluation, under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, of the effectiveness of our disclosure controls and procedures (as defined) in Exchange Act Rules 13a - 15(c) and 15d - 15(e)). Based upon that evaluation, our chief executive officer and chief financial officer concluded that, as of September 30, 2022, our disclosure controls and procedures were effective (1) to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SEC's rules and forms and (2) to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is accumulated and communicated to us, including our Chief Executive and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nThe term disclosure controls and procedures means controls and other procedures of an issuer that are designed to ensure that information required to be disclosed by the issuer in the reports that it files or submits under the Exchange Act (15 U.S.C. 78a ,et seq. ) is recorded, processed, summarized and reported, within the time periods specified in the Commission's rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuer's management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal controls over financial reporting will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of inherent limitations in all control systems, internal control over financial reporting may not prevent or detect misstatements, and no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the registrant have been detected. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement's Annual Report on Internal Control over Financial Reporting. Our management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Exchange Act. Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States.\nThe term internal control over financial reporting is defined as a process designed by, or under the supervision of, the issuer's principal executive and principal financial officers, or persons performing similar functions, and effected by the issuer's board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n●\nPertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n●\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the issuer are being made only in accordance with authorizations of management and directors of the issuer; and\n●\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the issuer's assets that could have a material effect on the financial statements.\nOur management assessed the effectiveness of our internal control over financial reporting as of September 30, 2022. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO-2013) in Internal Control-Integrated Framework.\nChanges in Internal Control Over Financial Reporting. There have been no changes in the registrant's internal control over financial reporting through the date of this report or during the quarter ended September 30, 2022, that materially affected, or is reasonably likely to materially affect, the registrant's internal control over financial reporting.\nIndependent Registered Accountant's Internal Control Attestation. This report does not include an attestation report of the registrant's registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by the registrant's registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit the registrant to provide only management's report in this report.\nRemediation plans for material weaknesses over internal controls. Our plans to mitigate material weaknesses in disclosure controls and procedures for future filings will be dependent on our ability to obtain adequate financing to fund development of our financial reporting infrastructure. At this time it is not cost beneficial for us to utilize capital to focus on mitigating financial reporting weaknesses; however, we expect to implement a plan for remediation of these deficiencies when sufficient funding to implement such a plan is available. Item 9B. Other Information.\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe following table sets forth information concerning the directors and executive officers of Cleartronic as of the date of this report:\nName\nAge\nPosition\nDirector Since\nRichard J. Martin\nChairman and Director\nMichael M. Moore\nChief Executive Officer and Director\nLarry M. Reid\nPresident, Chief Financial Officer, Secretary and Director\nThe members of our board of directors are subject to change from time to time by the vote of the stockholders at special or annual meetings to elect directors. Our current board of directors consists of three directors who have expertise in the business of Cleartronic. Based on our continuing profitability, we intend to seek directors and officers who would be able to assist in the execution of our business plan.\nThe foregoing notwithstanding, except as otherwise provided in any resolution or resolutions of the board, directors who are elected at an annual meeting of stockholders, and directors elected in the interim to fill vacancies and newly created directorships, will hold office for the term for which elected and until their successors are elected and qualified or until their earlier death, resignation or removal.\nWhenever the holders of any class or classes of stock or any series thereof are entitled to elect one or more directors pursuant to any resolution or resolutions of the board, vacancies and newly created directorships of such class or classes or series thereof may generally be filled by a majority of the directors elected by such class or classes or series then in office, by a sole remaining director so elected or by the unanimous written consent or the affirmative vote of a majority of the outstanding shares of such class or classes or series entitled to elect such director or directors. Officers are elected annually by the directors. There are no family relationships among our directors and officers.\nWe may employ additional management personnel, as our board of directors deems necessary. Cleartronic has not identified or reached an agreement or understanding with any other individuals to serve in management positions, but does not anticipate any problem in employing qualified staff.\nA description of the business experience for the directors and executive officers of Cleartronic is set forth below.\nRichard J. Martin currently serves as Chairman and Director of Cleartronic, Inc. Prior to joining the Cleartronic team, Martin served as CEO of SMARTLogix, Inc., a petroleum logistics technology company which he founded in 2000. Graduating with an Engineering degree from The University of Buffalo's School of Engineering, Martin joined the Exxon Management Development Program. Following his tenure at Exxon, he purchased an Exxon distributorship in the Carolinas. Culp Petroleum was transformed into a large regional distribution company. While at Culp, Martin developed and implemented several technologies that have since become industry standards. Martin sold the petroleum business in 2005 and focused his efforts on his technology ventures including the SMARTank division of SMARTLogix. SMARTank grew substantially and the technology was later sold to a public company in 2011.\nMichael M. Moore is currently Chief Executive Officer and a Director of Cleartronic, Inc. He was founder and CEO of Collabria, LLC, a private software development company. Prior to founding Collabria in 2008, Moore for 13 years was CEO of DTNet Group and for seven years served as CEO of Payroll Transfers, Inc. He also was an assistant vice president with both Kidder Peabody and Merrill Lynch. Mr. Moore is an honors graduate of the United States Air Force Academy and served as an Air Force fighter pilot for eight years, flying and fighter aircraft. He is also one of six entrepreneurs profiled in the book Daring Visionaries, How Entrepreneurs Build Companies, Inspire Allegiance, and Create Wealth.\nLarry Reid is the founder of Cleartronic and a co-founder of VoiceInterop. With over thirty years of executive management experience including sales and marketing, operations management, and financial management, from 2001 to 2005 Mr. Reid served as CFO and director of Connectivity, Inc., a manufacturer and distributor of emergency call boxes. He was instrumental in Connectivity's acquisition by CNE Group, Inc., (an American Stock Exchange listed company) and served as Executive Vice President and Director of CNE from 2003 to 2005. Mr. Reid has broad experience in venture start-ups, raising capital, building organizational synergies, creating and developing joint ventures and strategic partnerships, opening new markets, and driving key business initiatives. Early in his professional career in corporate financial management, Mr. Reid was responsible for raising more than $5 million in start-up capital for Ocurest Laboratories, Inc., a company he co-founded to package and distribute over-the-counter eye drops in a new (patented) eye drop dispenser. He forged Ocurest's successful IPO in 1996 and helped lead the company's achieving an estimated 80% market penetration of optical supply retail outlets in the United States.\nCommittees of the Board\nWe do not currently have an Audit, Executive, Finance, Compensation, or Nominating Committee, or any other committee of the Board of Directors.\nSection 16(a) Beneficial Ownership Reporting Compliance\nUnder Section 16(a) of the Exchange Act, our directors and certain of our officers, and persons holding more than 10 percent of our common stock are required to file forms reporting their beneficial ownership of our common stock and subsequent changes in that ownership with the United States Securities and Exchange Commission. Such persons are also required to furnish Cleartronic with copies of all forms so filed.\nBased solely upon a review of copies of such forms filed on Forms 3, 4, and 5, and amendments thereto furnished to us, we believe that as of the date of this report, our executive officers, directors and greater than 10 percent beneficial owners have not complied on a timely basis with all Section 16(a) filing requirements.\nCommunication with Directors\nStockholders and other interested parties may contact any of our directors by writing to them at Cleartronic, Inc., at 8000 North Federal Highway, Suite 100, Boca Raton, Florida 33487, Attention: Corporate Secretary.\nThe Company's Board has approved a process for handling letters received by us and addressed to any of our directors. Under that process, the Secretary reviews all such correspondence and regularly forwards to the directors a summary of all such correspondence, together with copies of all such correspondence that, in the opinion of the Secretary, deal with functions of the board or committees thereof or that he otherwise determines requires their attention. Directors may at any time review a log of all correspondence received by us that are addressed to members of the board and request copies of such correspondence.\nConflicts of Interest\nWith respect to transactions involving real or apparent conflicts of interest, we have not adopted any written policies and procedures.\nCode of Ethics for Senior Executive Officers and Senior Financial Officers\nWe have not adopted a Code of Ethics for Senior Executive Officers and Senior Financial Officers. Item 11. Executive Compensation.\nSummary of Cash and Certain Other Compensation\nAt present, Cleartronic has two executive officers, Michael M. Moore and Larry M. Reid. Michael M. Moore is the Chief Executive Officer of the Company. The Company executed an Employment Agreement with Mr. Moore on November 28, 2016. Under the Agreement, Mr. Moore agreed that he shall carry out the strategic plans and policies as established by our business plan. Mr. Moore will advise us from time to time on organization, hiring, mergers, and execution of our business plan. Mr. Moore is paid a base salary of $16,667 per month.\nUnless Cleartronic shall have given Mr. Moore written notice at least 30 days prior to the Termination Date, the Agreement shall automatically renew and continue in effect for additional one-year periods (and all provisions of this anniversary from such original Termination Date shall thereafter be designated as the \"Termination Date\" for all purposes under the Agreement, provided, however, that we may, at our election at any time after the expiration of the initial term of the Agreement, give Mr. Moore notice of Termination, in which event he shall continue to receive, as severance pay, six months of his base salary, if any, or the amount due through the next \"Termination Date\", whichever is less. Mr. Moore may terminate the Agreement without severance pay upon 10 days written notice to the Company.\nThe Company executed an Employment Agreement with Mr. Reid on March 13, 2015. The Employment Agreement replaces the previously executed Employment Agreement with Mr. Reid. Pursuant to the Employment Agreement (the \"Agreement\"), Cleartronic and Mr. Reid agreed that for a one year period beginning on March 13, 2015, we employed Mr. Reid to perform services for us both on and offsite. The last day of the one year period shall be the \"Termination Date\" for purposes of the Agreement. Termination of the agreement can be made by either party without penalty upon 10 days written notice. Pursuant to the Agreement, Cleartronic and Mr. Reid agreed that for a one year period beginning on November 28, 2016, Mr. Reid to perform services for us both on and offsite. The last day of the one year period shall be the \"Termination Date\" for purposes of the Agreement.\nUnless Cleartronic shall have given Mr. Reid written notice at least 30 days prior to the Termination Date, the Agreement shall automatically renew and continue in effect for additional one-year periods (and all provisions of this anniversary from such original Termination Date shall thereafter be designated as the \"Termination Date\" for all purposes under the Agreement, provided, however, that we may, at our election at any time after the expiration of the initial term of the Agreement, give Mr. Reid notice of Termination, in which event he shall continue to receive, as severance pay, six months of his base salary, if any, or the amount due through the next \"Termination Date\", whichever is less. Mr. Reid may terminate the Agreement without severance pay upon 10 days written notice to the Company. Under the Agreement, Mr. Reid agreed that he shall carry out the strategic plans and policies as established by our business plan. Mr. Reid will advise us from time to time on organization, hiring, mergers, and execution of our business plan.\nSummary Compensation Table\nThe following table sets forth, for our named executive officers for the two completed fiscal years ended September 30, 2022, and 2021:\nName and\nPrincipal Position\nYear\nSalary ($)\nBonus ($)\nStock Awards ($)\nOption Awards ($)\nNon-Equity Incentive Plan Compensation ($)\nNonqualified\ndeferred\ncompensation\nearnings\n($)\nAll Other Compensation ($)\nTotal ($)\nLarry M. Reid (1)\n96,000\n2,000\n98,000\n104,000\n5,500\n109,500\nMichael Moore (2)\n200,000\n1,000\n201,000\n208,462\n20,812\n229,274\n(1) Mr. Reid is our Chief Financial Officer, Secretary, and a director.\n(2) Mr. Moore is our CEO and a director.\nOutstanding Equity Awards at Fiscal Year-End\nOur Executive Officers have not received any equity awards for the years ended September 30, 2022 and 2021.\nDirector Compensation\nOur Directors have not received compensation for the years September 30, 2022 and 2021. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table presents information regarding the beneficial ownership of all shares of our common stock and preferred stock as of the date of this report by:\n●\nEach person who owns beneficially outstanding shares of our preferred stock;\n●\nEach director;\n●\nEach named executive officer; and\n●\nAll directors and officers as a group.\nShares of Common Stock Beneficially Owned (2)\nShares of Preferred Stock Beneficially Owned (2)\nName of Beneficial Owner (1)\nNumber\nPercent\nNumber\nPercent\nLarry M. Reid (3)\n5,016,325\n2.20%\n511,225\n5.93%\nMichael Moore (4)\n5,702,988\n2.50%\n3,000,000\n34.18%\nRichard J. Martin\n1,868,202\n0.82%\n1,582,966\n18.37%\nAll directors and officers as a group (one person)\n12,587,515\n5.52%\n5,094,199\n59.12%\n(1) Unless otherwise indicated, the address for each of these stockholders is c/o Cleartronic, Inc., at 8000 North Federal Highway, Suite 100, Boca Raton, Florida 33487. Also, unless otherwise indicated, each person named in the table above has the sole voting and investment power with respect to our shares of common stock or preferred stock which he beneficially owns.\n(2) Beneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission. As of the date of this report, we have 5,000,000,000 authorized shares of common stock, par value $0.00001 per share, of which 228,578,995 shares were issued and outstanding. As of the date of this report, we have 71,250,010 authorized and designated shares of preferred stock, par value $0.00001 per share, of which 7,525,403 shares were issued and outstanding. Mr. Reid owns 511,525 shares of Series C Preferred stock. See below for a description of our preferred stock and voting rights. Mr. Martin owns 512,996 shares of our Series A Preferred stock and 1,070,000 shares of our Series C Preferred stock.\n(3) Mr. Reid is our president, chief financial officer, principal accounting officer, secretary, and director.\n(4) Mr. Moore is our Chief Executive Officer and a director. Mr. Moore owns 5,702,988 shares of our common stock and 3,000,000 shares of our Series E Preferred stock.\nOther than as stated herein, there are no arrangements or understandings, known to us, including any pledge by any person of our securities:\n●\nThe operation of which may at a subsequent date result in a change in control of Cleartronic; or\n●\nWith respect to the election of directors or other matters.\nPreferred Stock\nAs of the date of this report, we have 200,000,000 authorized shares of preferred stock, par value $0.00001 per share, of which 7,525,403 shares were issued and outstanding. There are currently 5 series of preferred stock designated as follows:\n●\n1,250,000 shares have been designated as Series A Preferred Stock, 512,996 of which are issued and outstanding;\n●\n10 shares have been designated as Series B Preferred Stock, none of which is issued and outstanding;\n●\n50,000,000 shares have been designated as Series C Preferred Stock, 3,341,503 of which are issued and outstanding; and\n●\n10,000,000 shares have been designated Series D Preferred stock, of which 670,904 are issued and outstanding; and\n●\n10,000,000 shares have been designated Series E Preferred stock, of which 3,000,000 are issued and outstanding.\nPursuant to our Articles of Incorporation establishing our preferred stock:\n●\nA holder of shares of the Series A Preferred Stock is entitled to the number of votes equal to the number of shares of the Series A Preferred Stock held by such holder multiplied by one on all matters submitted to a vote of our stockholders. Each one share of our Series A Preferred Stock shall be convertible into 100 shares of our common stock. Each holder of Series A Preferred Stock is entitled to receive cumulative dividends at the rate of 8% of $1.00 per annum on each outstanding share of Series A Preferred Stock then held by such holder, on a pro rata basis.\n●\nA holder of shares of the Series B Preferred Stock is entitled one vote per share on all matters submitted to a vote of our stockholders. If at least one share of Series B Preferred Stock is issued and outstanding, then the total aggregate issued shares of Series B Preferred Stock at any given time, regardless of their number, shall have voting rights equal to two times the sum of the total number of shares of our common stock which are issued and outstanding at the time of voting, plus the total number of shares of any shares of our preferred stock which are issued and outstanding at the time of voting. A holder of shares of the Series B Preferred Stock shall have no conversion rights or rights to dividends.\n●\nA holder of shares of the Series C Preferred Stock is entitled, to the number of votes equal to the number of shares of the Series C Preferred Stock held by such holder multiplied by 5 on all matters submitted to a vote of our stockholders. In addition, the holders of our Series C Preferred Stock shall be entitled to receive dividends when, as and if declared by the Board of Directors, in its sole discretion. No dividends have been declared. Finally, each one share of our Series C Preferred Stock shall be convertible into five shares of our common stock.\n●\nA holder of shares of the Series D Preferred Stock is entitled, to the number of votes equal to the number of shares of the Series D Preferred Stock held by such holder multiplied by 5 on all matters submitted to a vote of our stockholders. In addition, the holders of our Series D Preferred Stock shall be entitled to receive dividends when, as and if declared by the Board of Directors, in its sole discretion. No dividends have been declared. Finally, each one share of our Series D Preferred Stock shall be convertible into five shares of our common stock.\n●\nA holder of shares of the Series E Preferred Stock is entitled, to the number of votes equal to the number of shares of the Series E Preferred Stock held by such holder multiplied by 100 on all matters submitted to a vote of our stockholders. In addition, the holders of our Series E Preferred Stock shall be entitled to receive dividends when, as and if declared by the Board of Directors, in its sole discretion. No dividends have been declared. Finally, each one share of our Series E Preferred Stock shall be convertible into 100 shares of our common stock. Item 13. Certain Relationships and Related Transactions and Director Independence.\nOn July 15, 2021, a shareholder returned 875,000 shares of Company's common stock to the Company in exchange for the two notes receivable in the total sum of $25,000 and $1,576 in interest receivable. Item 14. Principal Accounting Fees and Services.\nChange in Audit Firms\nOn October 6, 2022, Liggett & Webb P.A. (\"L&W\") resigned as the independent auditors of Cleartronic, Inc., a company incorporated under the laws of the State of Florida (the \"Company\"). The Companys Board of Directors accepted L&W's resignation on October 6, 2022.\nThe reports of L&W on the financial statements of the Company as of and for the fiscal year ended September 30, 2021 did not contain any adverse opinion or disclaimer of opinion and were not qualified or modified as to uncertainty, audit scope or accounting principles.\nDuring the Company's most recent fiscal years and the subsequent interim period through October 6, 2022, there were no disagreements with L&W on any matter of accounting principles or practices, financial statement disclosure, or auditing scope or procedure, which disagreement(s), if not resolved to the satisfaction of L&W, would have caused it to make reference to the subject matter of the disagreement(s) in connection with its report. During the Companys most recent fiscal years and the subsequent period through October 6, 2022, there were no reportable events of the type described in Item 304(a)(1)(v) of Regulation S-K.\nThe Company provided L&W with a copy of the foregoing disclosure and requested L&W to furnish the Company with a letter addressed to the Securities and Exchange Commission stating whether it agrees with the statements made therein. A copy of such letter furnished by L&W is filed as Exhibit 16.1 to the form 8-K filed by the Company.\nOn December 7, 2022, the Board of Directors of the Company approved the engagement of Assurance Dimensions (Assurance) as the Companys independent registered public accounting firm for the audit of the Companys annual report on Form 10-K for the year ended September 30, 2022.\nAudit Fees\nThe aggregate fees billed by Liggett & Webb, P.A. for professional services rendered for the audit and reviews of our financial statements for the fiscal years ended September 30, 2021, was $46,000. The aggregate fees billed by Assurance Dimensions for professional services rendered for the audit and review of our financial statements for the fiscal year ended September 30, 2022, was $30,000.\nAudit Related Fees\nThe aggregate audit-related fees billed by Liggett & Webb, P.A. for professional services rendered for the audit of our annual financial statements for the fiscal year ended September 30, 2021 was $3,000.\nTax Fees\nThe aggregate tax fees billed by Liggett & Webb, P.A. professional services rendered for tax services for the fiscal years ended September 30, 2022 and 2021 was $1,500 and $1,200, respectively.\nAll Other Fees\nThere were no other fees billed by\nAssurance Dimensions (\"Assurance\") for professional services rendered during the fiscal years ended September 30, 2022, other than as stated under the captions Audit Fees, Audit-Related Fees, and Tax Fees.\nThere were no other fees billed by Ligget & Webb, P.A. for professional services rendered during the fiscal years ended September 30, 2022 and 2021, other than as stated under the captions Audit Fees, Audit-Related Fees, and Tax Fees.\nAudit Committee Pre-Approval of Audit and Permissible Non-Audit Services of Independent Auditors\nGiven the small size of our Board, our Board acts as our Audit Committee. Our Board pre-approves all audit and permissible non-audit services. These services may include audit services, audit-related services, tax services, and other services. Our Board approves these services on a case-by-case basis.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\n(a) All financial statements are included in Item 8 of this report.\n(b) All financial statement schedules required to be filed by Item 8 of this report and the exhibits contained in this report are included in Item 8 of this report.\n(c) The following exhibits are attached to this report:\nExhibit No.\nIdentification of Exhibit\n3.1**\nArticles of Incorporation, filed as exhibit 3.01 to the registrant's registration statement on Form SB-2 on July 3, 2006, Commission File Number 333-135585.\n3.2**\nArticles of Amendment to Articles of Incorporation filed March 12, 2001, filed as exhibit 3.02 to the registrant's registration statement on Form SB-2 on July 3, 2006, Commission File Number 333-135585.\n3.3**\nArticles of Amendment to Articles of Incorporation filed October 4, 2004, filed as exhibit 3.03 to the registrant's registration statement on Form SB-2 on July 3, 2006, Commission File Number 333-135585.\n3.4**\nArticles of Amendment to Articles of Incorporation filed March 31, 2005, filed as exhibit 3.04 to the registrant's registration statement on Form SB-2 on July 3, 2006, Commission File Number 333-135585.\n3.5**\nArticles of Amendment to Articles of Incorporation filed May 9, 2008, filed as exhibit 3.02 to the registrant's registration statement on Form S-1 on May 28, 2008, Commission File Number 333-135585.\n3.6**\nArticles of Amendment to Articles of Incorporation filed June 28, 2010, filed as exhibit 3.7 to the registrant's Form 10-Q on February 14, 2011, Commission File Number 333-135585.\n3.7**\nArticles of Amendment to Articles of Incorporation filed May 6, 2011, filed as exhibit 3.1 to the registrant's Form 8-K on May 6, 2011, Commission File Number 333-135585.\n3.8**\nArticles of Amendment to Articles of Incorporation filed April 19, 2012, filed as exhibit 3.09 to the registrant's Form 10-Q on May 14, 2012, Commission File Number 333-135585.\n3.9**\nArticles of Amendment to Articles of Incorporation filed September 7, 2012, filed as exhibit 3.1 to the registrant's Form 8-K on September 7, 2012, Commission File Number 333-135585.\n3.10**\nArticles of Amendment to Articles of Incorporation filed September 19, 2012, filed as exhibit 3.1 to the registrant's Form 8-K on September 19, 2012, Commission File Number 333-135585.\n3.11**\nArticles of Amendment to Articles of Incorporation filed October 5, 2012, filed as exhibit 3.1 to the registrant's Form 8-K on October 5, 2012, Commission File Number 333-135585.\n3.12**\nArticles of Amendment to Articles of Incorporation filed December 28, 2013, filed as exhibit 3.12 to the registrant's Form 8-K on January 14, 2014, Commission File Number 333-135585.\n3.13**\nBylaws, filed as exhibit 3.05 to the registrant's registration statement on Form SB-2 on July 3, 2006, Commission File Number 333-135585.\n3.14**\nAmended and Restated Bylaws, filed as exhibit 3.1 to the registrant's Form 8-K on July 26, 2010, Commission File Number 333-135585.\n10.1**\nEmployment Agreement dated October 5, 2012, between Larry M. Reid and the registrant, filed as exhibit 10.1 to the registrant's Form 8-K on October 12, 2012, Commission File Number 333-135585.\n10.2**\nLease Agreement dated November 30, 2014, between BGNP Associates, LLC and Cleartronic, Inc, filed as Exhibit 10.10 to the registrant's Form 10-K on January 13, 2015, Commission File Number 000-55329\n10.3**\nEmployment Agreement dated March 13, 2015, between Larry M. Reid and the registrant, filed as Exhibit 10.1 to the registrant's Form 8-K on March 18, 2015, Commission File Number 000-55329\n10.4**\nSubscription Agreement between registrant and private accredited investor dated March 31, 2015 for purchase of 278,743 shares of Series D Convertible Preferred stock, filed as exhibit 10.1 to the registrant's Form 8-K on April 10, 2015, Commission File Number 000-55329\n10.5**\nSubscription Agreement between registrant and private accredited investor dated March 31, 2015 for purchase of 270,024 shares of Series D Convertible Preferred stock, filed as exhibit 10.2 to the registrant's Form 8-K on April 10, 2015, Commission File Number 000-55329\n10.6**\nSubscription Agreement between registrant and private accredited investor dated March 31, 2015 for purchase of 278,743 shares of Series D Convertible Preferred stock, filed as exhibit 10.3 to the registrant's Form 8-K on April 10, 2015, Commission File Number 000-55329\n10.7**\nPromissory Note date November 24, 2015 in the original amount of $50,000 issued to Mr. Marc Moore filed as exhibit 10.18 to the registrant's Form 10-K on January 13, 2016, Commission File 000-55329.\n10.8**\nAsset Purchase Agreement dated November 29, 2016 between the registrant and Collabria LLC. Filed as an exhibit to the registrant's Form 8-K on December 5, 2016.\n10.9**\nEmployment Agreement dated November 28, 2016 between the registrant and Mr. Moore.\n10.10**\nPromissory Note dated September 27, 2017 in the amount of $35,000 issued to Richard Martin.\n10.11**\nPromissory Note dated October 12, 2017 in the amount of $15,000 issued to Richard Martin\n10.12**\nInstallment Note dated September 30, 2019 in the amount of $75,279 issued to Richard Martin\n10.13**\nLease Agreement dated December 1, 2018 , between BGNP Associates, LLC and VoiceInterop, Inc.\n10.14**\nPromissory Note dated December 2, 2019 in the amount of $50,000 issued to Mr. John F. Marek.\n31.1*\nCertification of Michael M. Moore, Chief Executive Officer of Cleartronic, Inc., pursuant to 18 U.S.C. §1350, as adopted pursuant to §302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of Larry M. Reid, Chief Financial Officer and Principal Accounting Officer of Cleartronic, Inc., pursuant to 18 U.S.C. §1350, as adopted pursuant to §302 of the Sarbanes-Oxley Act of 2002.\n32.1*\nCertification of Michael M. Moore, Chief Executive Officer of Cleartronic, Inc., pursuant to 18 U.S.C. §1350, as adopted pursuant to §906 of the Sarbanes-Oxley Act of 2002.\n32.1*\nCertification of Larry M. Reid, Chief Financial Officer and Principal Accounting Officer of Cleartronic, Inc., pursuant to 18 U.S.C. §1350, as adopted pursuant to §906 of the Sarbanes-Oxley Act of 2002.\nXBRL Instance Document (XBRL tags are embedded within the Inline iXBRL document)\n____________\n*Filed herewith.\n**Previously filed.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCLEARTRONIC, INC.\nDate: December 29, 2022\nBy /s/ Michael M. Moore\nMichael M. Moore, Chief Executive Officer\nBy /s/ Larry M. Reid\nLarry M. Reid, Chief Financial Officer and\nPrincipal Accounting Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report has been signed by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: December 29, 2022\nBy /s/ Michael M. Moore\nMichael M. Moore, Chief Executive Officer\nBy /s/ Larry M. Reid\nLarry M. Reid, Chief Financial Officer and\nPrincipal Accounting Officer\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM (PCAOB ID 5036)\nTo the Board of Directors and Stockholders of Cleartronic, Inc.:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Cleartronic, Inc. (the Company) as of September 30, 2022, and the related consolidated statements of operations, stockholders deficit, and cash flows for the year then ended, and the related consolidated notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022, and the results of its operations and its cash flows for year ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of accounts receivable\nDescription of the Matter\nAs described in Note 2 to the consolidated financial statements, the Company provides an allowance for uncollectible accounts based upon a periodic review and analysis of outstanding accounts receivable balances. Uncollectible receivables are charged to the allowance when deemed uncollectible. Recoveries of accounts previously written off are used to credit the allowance account in the periods in which the recoveries are made.\nHow We addressed the Matter in our Audit\nThe primary procedures performed included evaluating the methodologies used in the determination of allowance for doubtful account and reviewing historical data, collections and other inputs used by the Company as well as subsequent collections.\nWe have served as the Companys auditor since 2022.\n/s/ Assurance Dimensions\nMargate, Florida\nDecember 29, 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM ( PCAOB ID 287)\nTo the Board of Directors and Stockholders of\nCleartronic, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Cleartronic, Inc. (the Company) as of September 30, 2021 and the related consolidated statements of operations, stockholders deficit, and cash flows for the year ended September 30, 2021 and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2021, and the results of its operations and its cash flows for the year ended September 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of accounts receivable\nAs described in Note 2 to the consolidated financial statements, the Company provides an allowance for uncollectible accounts based upon a periodic review and analysis of outstanding accounts receivable balances. Uncollectible receivables are charged to the allowance when deemed uncollectible. Recoveries of accounts previously written off are used to credit the allowance account in the periods in which the recoveries are made.\nAuditing management's estimate of the allowance for doubtful accounts was highly judgmental as it involved our assessment of the historical data, collections and other inputs used by the Company.\nTo test the allowance for doubtful accounts, we performed audit procedures that included, among others, evaluating the methodologies used in the determination of allowance for doubtful account and the historical data, collections and other inputs used by the Company as well as the subsequent collections.\n/s/ Liggett & Webb, P.A.\nWe have served as the Companys auditor since 2016.\nBoynton Beach, Florida\nDecember 29, 2021\nCLEARTRONIC, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nASSETS\nSeptember 30, 2022\nSeptember 30, 2021\nCurrent assets:\nCash\n$ 468,167\n$ 401,001\nAccounts receivable, net\n538,030\n320,245\nInventory\n21,097\n14,653\nPrepaid expenses and other current assets\n53,611\n47,383\nTotal current assets\n1,080,905\n783,282\nProperty and Equipment, net\n15,142\n11,391\nOther assets:\nDue from related party\n53,302\n44,801\nTotal other assets\n53,302\n44,801\nTotal assets\n$ 1,149,349\n$ 839,474\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent liabilities:\nAccounts payable and accrued expenses\n$ 75,217\n$ 159,952\nDeferred revenue, current portion\n1,012,211\n977,296\nTotal current liabilities\n1,087,428\n1,137,248\nLong Term Liabilities\nDeferred revenue, net of current portion\n113,300\n154,500\nTotal long term liabilities\n113,300\n154,500\nTotal liabilities\n1,200,728\n1,291,748\nCommitments and Contingencies (See Note 7)\nStockholders' deficit:\nSeries A preferred stock - $.00001 par value; 1,250,000 shares authorized,\n512,996 issued and outstanding, respectively.\nSeries B preferred stock - $.00001 par value; 10 shares authorized,\n-\n-\n0 shares issued and outstanding, respectively.\nSeries C preferred stock - $.00001 par value; 50,000,000 shares authorized,\n3,341,503 shares issued and outstanding, respectively.\nSeries D preferred stock - $.00001 par value; 10,000,000 shares authorized,\n670,904 shares issued and outstanding, respectively.\nSeries E preferred stock - $.00001 par value, 10,000,000 shares authorized,\n3,000,000 shares issued and outstanding, respectively.\nCommon stock - $.00001 par value; 5,000,000,000 shares authorized,\n2,281\n2,286\n228,120,695 and 228,578,995, shares issued and outstanding, respectively.\nAdditional paid-in capital\n15,240,112\n15,240,107\nAccumulated Deficit\n(15,293,848)\n(15,694,743)\nTotal stockholders' deficit\n(51,379)\n(452,274)\nTotal liabilities and stockholders' deficit\n$ 1,149,349\n$ 839,474\nThe accompanying notes are an integral part of these consolidated financial statements\nCLEARTRONIC, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Year Ended September 30, 2022\nFor the Year Ended September 30, 2021\nRevenue\n$ 2,017,563\n$ 1,651,297\nCost of Revenue\n334,138\n267,298\nGross Profit\n1,683,425\n1,383,999\nOperating Expenses:\nSelling expenses\n659,796\n571,242\nAdministrative expenses\n461,345\n417,286\nAmortization and depreciation\n3,732\n2,129\nResearch and development\n204,918\n167,661\nTotal Operating Expenses\n1,329,791\n1,158,318\nGain on the settlement of accounts payable\n47,792\n29,965\nGain on forgiveness of PPP loan\n-\n106,727\nInterest expense, net\n(531)\n(1,275)\nTotal Other Income\n47,261\n135,417\nIncome before income taxes\n400,895\n361,098\nProvision for income taxes from continuing operations\n-\n-\nNet Income\n400,895\n361,098\nPreferred stock dividends Series A Preferred\n(41,037)\n(40,927)\nNet income attributable to common stockholders\n$ 359,858\n$ 320,171\nNet income per common share - basic\n$ 0.00\n$ 0.00\nNet income per common share - diluted\n$ 0.00\n$ 0.00\nWeighted Average of number of shares outstanding - basic\n228,239,979\n226,520,440\nWeighted Average of number of shares outstanding - diluted\n599,601,614\n597,882,075\nThe accompanying notes are an integral part of these consolidated financial statements\nCLEARTRONIC, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOW\nFor the Year\nFor the Year\nEnded\nEnded\nSeptember 30, 2022\nSeptember 30, 2021\nNET INCOME\n$ 400,895\n$ 361,098\nCash Flows From Operating Activities\nAdjustments to reconcile net income to net cash provided by\noperating activities:\nDepreciation expense\n3,732\n2,129\nGain on forgiveness of PPP loan\n-\n(106,727)\nGain on the settlement and reversal of accounts payable\n(47,792)\n(29,965)\nProvision for bad debt\n14,000\n10,000\n(Increase) decrease in assets:\nAccounts receivable\n(231,785)\n(111,630)\nInventory\n(6,444)\n(2,182)\nPrepaid expenses and other current assets\n(6,228)\n(9,541)\nDue from related party\n(8,501)\n(31,380)\nIncrease (decrease) in liabilities:\nAccounts payable\n(36,943)\n(63,458)\nAccrued expenses\n-\n(43,457)\nDeferred revenue\n(6,285)\n403,671\nNet Cash (Used In) Provided by Operating Activities\n74,649\n378,558\nCash Flows From Investing Activities\nPurchase of fixed assets\n(7,483)\n(5,093)\nNet Cash Used in Investing Activities\n(7,483)\n(5,093)\nCash Flows From Financing Activities\nRepayment of notes payable stockholders\n-\n(48,447)\nNet Cash Used in Financing Activities\n-\n(48,447)\nNet (decrease) increase in cash\n67,166\n325,018\nCash at beginning of year\n401,001\n75,983\nCash at end of year\n$ 468,167\n$ 401,001\nSUPPLEMENTAL CASH FLOW INFORMATION:\nCash paid for interest\n$ 53\n$ 2,754\nCash paid for taxes\n$ 690\n$ -\nSupplemental disclosure of non-cash investing and financing activities:\nReturn of 875,000 shares of common stock in exchange for notes and interest receivable\n$ -\n$ 26,576\nCancellation of 458,300 shares of common stock\n$ 5\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements\nCLEARTRONIC, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS' DEFICIT\nFOR THE YEARS ENDED SEPTEMBER 30, 2022 AND 2021\nSeries A Preferred Stock\nSeries B Preferred Stock\nSeries C Preferred Stock\nSeries D Preferred Stock\nSeries E Preferred Stock\nCommon Stock\nAdditional\npaid-in\nAccumulated\nStockholders'\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\ncapital\ndeficit\nDeficit\nBalance at September 30, 2020\n512,996\n$ 5\n-\n$ -\n4,433,375\n$ 45\n670,904\n$ 7\n3,000,000\n$ 30\n223,994,635\n$ 2,240\n$ 15,266,718\n$(16,055,841)\n$ (786,796)\nReturned of common stock in exchange for notes receivable and interest\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(875,000)\n(9)\n(26,567)\n-\n(26,576)\nSeries C Convertible Preferred shares exchanged for common stock\n-\n-\n-\n-\n(1,091,872)\n(11)\n-\n-\n-\n-\n5,459,360\n(44)\n-\n-\nNet income for the year ended September 30, 2021\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n361,098\n361,098\nBalance at September 30, 2021\n512,996\n$ 5\n-\n$ -\n3,341,503\n$ 34\n670,904\n$ 7\n3,000,000\n$ 30\n228,578,995\n$ 2,286\n$ 15,240,107\n$(15,694,743)\n$ (452,274)\nShare cancellation\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(458,300)\n(5)\n-\n-\nNet income for the year ended September 30, 2022\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n400,895\n400,895\nBalance at September 30, 2022\n512,996\n$ 5\n-\n$ -\n3,341,503\n$ 34\n670,904\n$ 7\n3,000,000\n$ 30\n228,120,695\n$ 2,281\n$ 15,240,112\n$(15,293,848)\n$ (51,379)\nThe accompanying notes are an integral part of these consolidated financial statements\nCLEARTRONIC, INC. AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\nSeptember 30, 2022 and 2021\nNOTE 1 - ORGANIZATION\nCleartronic, Inc. (the \"Company\") was incorporated in Florida on November 15, 1999. All current operations are conducted through the Company's wholly owned subsidiary, ReadyOp Communications, Inc. (\"ReadyOp\"), a Florida corporation incorporated on September 15, 2014. ReadyOp facilitates the marketing and sales of subscriptions to the ReadyOp™ and ReadyMed ™ platforms and the AudioMate IP gateways discussed below.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPRINCIPLES OF CONSOLIDATION\nThe accompanying consolidated financial statements contain the consolidated accounts of Cleartronic, Inc. and its subsidiary, ReadyOp Communications, Inc. All material intercompany transactions and balances have been eliminated.\nUSE OF ESTIMATES\nIn preparing the financial statements, management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities as of the date of the balance sheet and operations for the reporting period.\nAlthough these estimates are based on management's knowledge of current events and actions it may undertake in the future, they may ultimately differ from actual results.\nSignificant estimates include the assumptions used in valuation of deferred tax assets, estimated useful life of property and equipment, valuation of inventory and allowance for doubtful accounts.\nCASH AND CASH EQUIVALENTS\nFor financial statement purposes, the Company considers all highly liquid investments purchased with original maturities of three months or less to be cash equivalents. The Company did not own any cash equivalents on September 30, 2022 and September 30, 2021.\nACCOUNTS RECEIVABLE\nThe Company provides an allowance for uncollectible accounts based upon a periodic review and analysis of outstanding accounts receivable balances. Uncollectible receivables are charged to the allowance when deemed uncollectible. Recoveries of accounts previously written off are used to credit the allowance account in the periods in which the recoveries are made. When a client is invoiced, the amount is recorded as an asset in Accounts Receivable and as Deferred Revenue in Current Liabilities. When payment is received the amount is moved to Cash on the balance sheet and Accounts Receivables are reduced. The amount listed as Deferred Revenue is amortized monthly over the license period.\nThe Company provided $18,000 and $10,000 allowances for doubtful accounts as of September 30, 2022 and September 30, 2021, respectively.\nPREPAID EXPENSES AND OTHER CURRENT ASSETS\nPrepaid expenses and other current assets consist primarily of deferred subscriber costs and prepaid expenses. Deferred subscriber costs totaling $38,250 and $41,283 at September 30, 2022 and 2021, respectively. Prepaid expenses totaling $15,361 and $6,100 at September 30, 2022 and 2021, respectively are primarily for insurance and other items\nPROPERTY AND EQUIPMENT\nProperty and equipment are recorded at cost and depreciated or amortized using the straight-line method over the estimated useful life of the asset or the underlying lease term for leasehold improvements, whichever is shorter or when the property and equipment is put into service.\nCONCENTRATION OF CREDIT RISK\nThe Company currently maintains cash balances at one FDIC-insured banking institution. Deposits held in non interest-bearing transaction accounts are insured up to a maximum of $250,000 at all FDIC-insured institutions. As of September 30, 2022 and September 30, 2021, the Company had $208,135 and $139,577, respectively, in excess of FDIC insurance limits.\nRESEARCH AND DEVELOPMENT COSTS\nThe Company expenses research and development costs as incurred.\nFor the years ended September 30, 2022 and 2021, the Company had $204,918 and $167,661 respectively, in research and development costs.\nREVENUE RECOGNITION AND DEFERRED REVENUES\nThe Company revenue recognition policy follows guidance from Accounting Standards Codification (ASC) 606, Revenue from contract with customers. Revenue is recognized when the Company has transferred promised goods and services to the customer and in the amount that reflects the consideration to which the company expects to be entitled in exchange for those goods and services. The Company applies the following five-step model in order to determine this amount:\ni. Identification of Contact with a customer;\nii. Identify the performance obligation of the contract\niii. Determine transaction price;\niv. Allocation of the transaction price to the performance obligations; and\nv. Recognition of revenue when (or as) the Company satisfies each performance obligation.\nThe Company generates revenue primarily through the sale of integrated hardware and software licenses. The portion of the contract that is associated with ongoing hosting and related customer service is amortized monthly over the license period. The Company incurs certain incremental contract costs (referred to as deferred subscriber acquisition costs, net) including selling expenses (primarily commissions) related to acquiring customers. Deferred subscriber acquisition costs, net are included in prepaid and expenses and other current assets on the consolidated balance sheet. Commissions paid in connection with acquiring new customers are determined based on the value of the contractual fees. Deferred subscriber acquisition costs will be expensed as incurred on the date the revenue associated with the cost is recognized. As of September 30, 2022 and September 30, 2021, respectively, the Company recorded $38,250 and $41,283, respectively, in deferred subscriber costs, which are included as a component of prepaid expense.\nIn transactions in which hardware is sold to a customer, the Company recognizes the revenue when the hardware has been shipped to the customer. The hardware supplied by the Company does not require a related software license and can be operated and fully functional without the Company's software.\nFrom time to time clients request special training meetings. We send employees to these meeting and charge our clients on a per diem basis. These charges are recorded as consulting fees on our income statement.\nThe Company allocates the transaction price to each performance obligation based on a relative stand alone selling price. Revenue associated with the sale and installation of system licenses is recognized once installation is complete.\nCustomer billings for services not yet rendered are deferred and recognized as revenue as services are provided. These fees are recorded as current deferred revenue on the consolidated balance sheet as the Company expects to satisfy any remaining performance obligations as well as recognize the related revenue within the next twelve months. Accordingly, the Company has applied the practical expedient regarding deferred revenue to exclude the value of remaining performance obligations if (i) the contract has an original expected term of one year or less or (ii) the Company recognizes revenue in proportion to the amount it has the right to invoice for services performed. As of September 30, 2022 and September 30, 2021, respectively, the Company recorded $1,125,511 and $1,131,796, respectively, in deferred revenue.\nDISAGGREGATED REVENUE\nThe following table sets forth the approximate net sales by primary category:\nFor the years ended\nSeptember 30, 2022\nSeptember 30, 2021\nLicensing of ReadyOp Software\n$ 1,818,035\n$ 1,581,080\nHardware Sales and Consulting\n199,528\n70,217\nTotal\n$ 2,017,563\n$ 1,651,297\nDEFERRED REVENUE\nThe following table provides a summary of the changes included in deferred revenue during the years ended September 30, 2022 and 2021:\nFor the year\nFor the year\nyear\nyear\nended\nended\nSeptember 30, 2022\nSeptember 30, 2021\nBeginning balance\n$ 1,131,796\n$ 728,120\nAdditions to contract liabilities (1)\n2,011,278\n2,054,973\nDeductions to contract liabilities (2)\n(2,017,563)\n(1,651,297)\nEnding balance\n$ 1,125,511\n$ 1,131,796\n(1) Customer billings for services not yet rendered\n(2) Revenue recognized in the current year related to the beginning liability\nEARNINGS PER SHARE\nEarnings per share (\"EPS\") are the amount of earnings attributable to each share of common stock. For convenience, the term is used to refer to either earnings or loss per share. EPS is computed pursuant to section 260-10-45 of the FASB Accounting Standards Codification. Pursuant to ASC Paragraphs 260-10-45-10 through 260-10-45-16, basic EPS shall be computed by dividing income available to common stockholders (the numerator) by the weighted-average number of common shares outstanding (the denominator) during the period. Income available to common stockholders shall be computed by adding both the dividends declared in the period on preferred stock (whether or not paid) and the dividends accumulated for the period on cumulative preferred stock (whether or not earned) from income from continuing operations (if that amount appears in the income statement) and also from net income. The computation of diluted EPS is similar to the computation of basic EPS except that the denominator is increased to include the number of additional common shares that would have been outstanding if the dilutive potential common shares had been issued during the period to reflect the potential dilution that could occur from common shares issuable through contingent shares issuance arrangement, stock options or warrants.\nPursuant to ASC Paragraphs 260-10-45-45-21 through 260-10-45-45-23 Diluted EPS shall be based on the most advantageous conversion rate or exercise price from the standpoint of the security holder. The dilutive effect of outstanding call options and warrants (and their equivalents) issued by the reporting entity shall be reflected in diluted EPS by application of the treasury stock method unless the provisions of paragraphs 260-10-45-35 through 45-36 and 260-10-55-8 through 55-11 require that another method be applied. Equivalents of options and warrants include non-vested stock granted to employees, stock purchase contracts, and partially paid stock subscriptions (see paragraph 260-10-55-23). Anti-dilutive contracts, such as purchased put options and purchased call options, shall be excluded from diluted EPS. Under the treasury stock method: a. Exercise of options and warrants shall be assumed at the beginning of the period (or at time of issuance, if later) and common shares shall be assumed to be issued. b. The proceeds from exercise shall be assumed to be used to purchase common stock at the average market price during the period. (See paragraphs 260-10-45-29 and 260-10-55-4 through 55-5.) c. The incremental shares (the difference between the number of shares assumed issued and the number of shares assumed purchased) shall be included in the denominator of the diluted EPS computation.\nAs of September 30, 2022 and 2021, we had no options and warrants outstanding.\nAs of September 30, 2022 and 2021, we had 512,996 shares of Series A Convertible Preferred stock outstanding, which are convertible into 51,299,600 shares of common stock.\nAs of September 30, 2022 and 2021, we had 3,341,503 and 3,911,715 shares of Series C Convertible Preferred stock outstanding, respectively, which are convertible into 16,707,515 and 19,558,575 shares of common stock, respectively.\nAs of September 30, 2022 and 2021, we had 670,904 shares of Series D Preferred stock outstanding which are convertible into 3,354,520 shares of common stock..\nAs of September 30, 2022 and 2021, we had 3,000,000 shares of Series E Convertible Preferred stock outstanding which are convertible into 300,000,000 shares of common stock.\nThe table below details the computation of basic and diluted earnings per share (\"EPS\") for the years ended September 30, 2022 and 2021:\nFor the\nFor the\nyear\nyear\nended\nended\nSeptember 30, 2022\nSeptember 30, 2021\nNet income attributable to common stockholders for the period\n$\n359,858\n$\n320,171\nWeighted average number of shares outstanding\n228,239,979\n226,520,440\nBasic earnings per share\n$\n0.00\n$\n0.00\nThe following table sets for the computation of diluted earnings per share:\nFor the\nFor the\nyear\nyear\nended\nended\nSeptember 30, 2022\nSeptember 30, 2021\nNet income attributable to common stockholders for the period\n$\n359,858\n$\n320,171\nAdd: Preferred stock dividends\n41,073\n40,929\nAdjusted net income\n$\n400,895\n$\n361,098\nWeighted average number of shares outstanding\n228,239,979\n226,520,440\nAdd: Shares issued upon conversion of preferred stock\n371,361,635\n371,361,635\nWeighted average number of common and common equivalent shares\n599,601,614\n597,882,075\nDiluted earnings per share\n$\n0.00\n$\n0.00\nFAIR VALUE OF FINANCIAL INSTRUMENTS\nThe Company measures the fair value of its assets and liabilities under ASC topic 820, \"Fair Value Measurements and Disclosures\". ASC 820 defines \"fair value\" as the price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. There was no impact relating to the adoption of ASC 820 to the Company's consolidated financial statements.\nASC 820 also describes three levels of inputs that may be used to measure fair value:\n- Level 1: Observable inputs that reflect unadjusted quoted prices for identical assets or liabilities traded in active markets.\n- Level 2: Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly.\n- Level 3: Inputs that are generally observable. These inputs may be used with internally developed methodologies that result in management's best estimate of fair value.\nFinancial instruments consist principally of cash, accounts receivable, prepaid expenses and other current assets, accounts payable, accrued expenses and deferred revenue. The carrying amounts of such financial instruments in the accompanying consolidated balance sheet approximate their fair values due to their relatively short-term nature. The carrying amounts approximate fair value. It is management's opinion that the Company is not exposed to any significant currency or credit risks arising from these financial instruments.\nINVENTORY\nInventory consists of components held for assembly and finished goods held for resale or to be utilized for installation in projects. Inventory is valued at lower of cost or net realizable value on a first-in, first-out basis. The Company's policy is to record a reserve for technological obsolescence or slow-moving inventory items. The Company only carries finished goods to be shipped along with completed circuit boards and parts necessary for final assembly of finished product. All existing inventory is considered current and usable. The Company recorded no reserve for obsolete inventory as of September 30, 2022 and September 30, 2021, respectively.\nAt September 30, 2022 inventory was $21,097 of raw materials and $0 of finished goods.\nAt September 30, 2021, inventory was $12,593 of raw materials and $2,060 of finished goods.\nADVERTISING COSTS\nAdvertising costs are expensed as incurred. The Company had advertising costs of $51,318 and $20,280 during the years ended September 30, 2022 and 2021, respectively.\nRECENT ACCOUNTING PRONOUNCEMENTS\nAll newly issued accounting pronouncements but not yet effective have been deemed either immaterial or not applicable.\nNOTE 3 - PROPERTY AND EQUIPMENT\nAt September 30, 2022 and September 30, 2021, property and equipment, net, is as follows:\nSeptember 30, 2022\nSeptember 30, 2021\nOffice Equipment\n$\n21,605\n$\n14,122\nLess: Accumulated Depreciation\n(6,463)\n(2,731)\nTotal Property and Equipment, net\n$\n15,142\n$\n11,391\nDepreciation expense for the years ended September 30, 2022 and 2021, was $3,732 and $2,129, respectively.\nNOTE 4 - EQUITY TRANSACTIONS\nPreferred Stock Dividends\nAs of September 30, 2022 and September 30, 2021, the cumulative arrearage of undeclared dividends for Series A Preferred stock totaled $165,035 and $123,998, respectively.\nAs of the date of this report, we have 200,000,000 authorized shares of preferred stock, par value $0.00001 per share, of which 7,525,403 shares were issued and outstanding. There are currently 5 series of preferred stock designated as follows:\n●\n1,250,000 shares have been designated as Series A Preferred Stock, 512,996 of which are issued and outstanding;\n●\n10 shares have been designated as Series B Preferred Stock, none of which is issued and outstanding;\n●\n50,000,000 shares have been designated as Series C Preferred Stock, 3,341,503 of which are issued and outstanding; and\n●\n10,000,000 shares have been designated Series D Preferred stock, of which 670,904 are issued and outstanding; and\n●\n10,000,000 shares have been designated Series E Preferred stock, of which 3,000,000 are issued and outstanding.\nPursuant to our Articles of Incorporation establishing our preferred stock:\n●\nA holder of shares of the Series A Preferred Stock is entitled to the number of votes equal to the number of shares of the Series A Preferred Stock held by such holder multiplied by one on all matters submitted to a vote of our stockholders. Each one share of our Series A Preferred Stock shall be convertible into 100 shares of our common stock. Each holder of Series A Preferred Stock is entitled to receive cumulative dividends at the rate of 8% of $1.00 per annum on each outstanding share of Series A Preferred Stock then held by such holder, on a pro rata basis.\n●\nA holder of shares of the Series B Preferred Stock is entitled one vote per share on all matters submitted to a vote of our stockholders. If at least one share of Series B Preferred Stock is issued and outstanding, then the total aggregate issued shares of Series B Preferred Stock at any given time, regardless of their number, shall have voting rights equal to two times the sum of the total number of shares of our common stock which are issued and outstanding at the time of voting, plus the total number of shares of any shares of our preferred stock which are issued and outstanding at the time of voting. A holder of shares of the Series B Preferred Stock shall have no conversion rights or rights to dividends.\n●\nA holder of shares of the Series C Preferred Stock is entitled to the number of votes equal to the number of shares of the Series C Preferred Stock held by such holder multiplied by 5 on all matters submitted to a vote of our stockholders. In addition, the holders of our Series C Preferred Stock shall be entitled to receive dividends when, as and if declared by the Board of Directors, in its sole discretion. No dividends have been declared. Finally, each one share of our Series C Preferred Stock shall be convertible into five shares of our common stock.\n●\nA holder of shares of the Series D Preferred Stock is entitled, to the number of votes equal to the number of shares of the Series D Preferred Stock held by such holder multiplied by 5 on all matters submitted to a vote of our stockholders. In addition, the holders of our Series D Preferred Stock shall be entitled to receive dividends when, as and if declared by the Board of Directors, in its sole discretion. No dividends have been declared. Finally, each one share of our Series D Preferred Stock shall be convertible into five shares of our common stock.\n●\nA holder of shares of the Series E Preferred Stock is entitled, to the number of votes equal to the number of shares of the Series E Preferred Stock held by such holder multiplied by 100 on all matters submitted to a vote of our stockholders. In addition, the holders of our Series E Preferred Stock shall be entitled to receive dividends when, as and if declared by the Board of Directors, in its sole discretion. No dividends have been declared. Finally, each one share of our Series E Preferred Stock shall be convertible into 100 shares of our common stock.\nCancellation of Shares\nDuring the year ended September 30, 2022, the Company canceled an aggregate of 458,300 shares of its common stock due to share issuance in error by the Company.\nCommon stock issued for Conversion of C Preferred\nDuring the year ended September 30, 2021, the holders of Series C preferred stock, converted 1,091,872 shares of Series C Preferred Stock into 5,459,360 shares of Common Stock.\nCommon stock issued in Exchange for Notes Receivable\nOn July 15, 2021, a shareholder returned 875,000 shares of Company's common stock to the Company in exchange for the two notes receivable in the total sum of $25,000 and $1,576 in interest receivable;\nInterest income for the years ended September 30, 2021 and 2020 was $1,167 and $409, respectively.\nNOTE 5 - NOTES PAYABLE\nNotes payable to Stockholders\nAs of September 30, 2021 and September 30, 2020, the Company had unsecured notes payable to stockholders totaling $0 and $48,447, respectively. One note with a principal balance of $17,588 was due on December 31, 2019. The maturity of the note payable in the amount of $17,588 was extended to August 31, 2020 and was paid in full including $8,002 in accrued interest on March 19, 2021.\nOn September 30, 2019, the note holder, who is a shareholder and director, converted $65,000 of a note payable and $10,279 of accrued interest into an installment promissory note with a principal balance of $75,279. The note is due on September 30, 2021 and bears an interest rate of 8%. This note requires a monthly payment of $3,405 for the next 24 months. During the years ended September 30,2021 and 2020, the Company made a repayment of $48,447 and $26,832, respectively. As of September 30, 2021 and 2020, the balance due was $0 and $48,447.\nNote Payable - PPP Loan\nOn June 10, 2020, the Company, was granted a loan (the \"Loan\") from Bank of America, N.A., in the aggregate amount of $106,727, pursuant to the Paycheck Protection Program (the \"PPP\") under Division A, Title I of the CARES Act, which was enacted March 27, 2020.\nThe Loan, which was in the form of a Note dated on or about June 10, 2020 issued by the Borrower, matures on or about June 10, 2025 and bears interest at an approximate rate of 1% per annum. The Note may be prepaid by the Borrower at any time prior to maturity with no prepayment penalties. Funds from the Loan may only be used for payroll costs, costs used to continue group health care benefits, mortgage payments, rent, utilities, and interest on other debt obligations incurred before February 15, 2020. The Company intends to use the entire Loan amount for qualifying expenses. Under the terms of the PPP, certain amounts of the Loan may be forgiven if they are used for qualifying expenses as described in the CARES Act. On July 20, 2021, the loan was 100% forgiven by the SBA. As a result, the Company recorded a gain on forgiveness of PPP loan in the amount of $106,727 as of September 30, 2021.\nNOTE 6 - RELATED PARTY TRANSACTIONS\nThrough December 1, 2021, the Company leased its office space from VoiceInterop the Company's former wholly owned subsidiary and now 96% owned by our shareholders for approximately $1,400 per month. On February 14, 2020, VoiceInterop was deconsolidated and is no longer our subsidiary.\nRent expense incurred during the years ended September 30, 2022 and 2021 was $26,973 and $17,901, respectively (See Note 7).\nAs of September 30, 2022, the Company advanced $53,302 to VoiceInterop, the Company's former wholly owned subsidiary and now 96% owned by our shareholders. The amount is included in due from related party on the consolidated balance sheet. The amount is due on September 30, 2024, and bears interest at 5% effective October 1, 2022.\nNOTE 7 - COMMITMENTS AND CONTINGENCIES\nObligation Under Operating Lease\nOn December 1, 2021, the Company signed a one year lease approximately 2,000 square feet for our principal offices in Boca Raton, Florida. The monthly rent is $2,200. The lease expires on November 30, 2022.\nRent expense incurred during the years ended September 30, 2022 and 2021 was $26,973 and $17,901, respectively (See Note 6).\nRevenue and Accounts Receivable Concentration\nNo customer accounted for more than 10% of the Companys revenue for the year ended September 30, 2022.\nNo customer accounted for more than 10% of the Companys revenue for the year ended September 30, 2021.\nAs of September 30, 2022, no customers accounted for more than 10% of the Company's total outstanding accounts receivable.\nAs of September 30, 2021, no customer accounted for more than 10% of the Company's total outstanding accounts receivable.\nMajor Supplier and Sole Manufacturing Source\nThe Company relies on no major supplier for its products. The Company has contracted with local manufacturing facilities to provide completed circuit boards used in the assembly of its IP gateway devices. Interruption of adequate supply of components, primarily computer chips, to the manufacturing source presents additional risk to the Company. The Company believes that additional commercial facilities exist at competitive rates to match the resources and capabilities of its existing manufacturing source, but the current worldwide shortage of computer chips does limit our ability to supply our proprietary radio gateways to clients and other buyers .\nEmployment Agreements\nIn December 2016, the Board of Directors accepted the resignation of Larry M. Reid as Chief Executive Officer of the corporation and appointed Mr. Reid as Chief Financial Officer. The Board also appointed Michael M. Moore as Chief Executive Officer.\nUnder the terms of an employment agreement effective on November 28, 2016, Mr. Moore as CEO receives an annual salary of $200,000. The term of agreement is for a one-year period beginning on the effective date and shall automatically renew and continue in effect for additional one-year periods. Effective April 20, 2022, the annual compensation increased to $220,000.\nUnder the terms of an employment agreement effective on March 13, 2015, Mr. Reid as CFO receives an annual salary of $96,000. The term of agreement is for a one-year period beginning on the effective date and shall automatically renew and continue in effect for additional one-year periods. Effective October 1, 2021, the annual compensation increased to $104,000.\nExclusive Licensing Agreement\nOn May 5, 2017, the Company entered into an Exclusive Licensing Agreement with Sublicensing Terms (the \"Agreement\") with the University of South Florida Research Foundation, Inc. (\"USFRF\") relating to an exclusive license of certain patent rights in connection with one of USFRF's U.S. Patent Applications. Both parties recognize that the research and development work provided by the Company was sufficient for USFRF to enter into the Agreement with the Company.\nThe Agreement is effective April 25, 2017 and continues until the later of the date that no Licensed Patent remains a pending application or an enforceable patent or the date on which the Licensee's obligation to pay royalties expires.\nThe Company agreed to pay USFRF a royalty of 3% for sales of all Licensed Products and Licensed Processes and agreed to pay USFRF minimum royalty payments as follows:\nPayment\nYear\n$1,000\n$4,000\n$8,000\n-and every year thereafter on the same date, for the life of the agreement.\nIn the event the Company proposes to sell any Equity Securities, then USFRF will have the right to purchase 5% of the securities issued in such offering on the same terms and conditions are offered to other purchasers in such financing. As of September 30, 2022 and 2021, the Company has recorded $8,000 and $8,953 for the minimum royalty for the fiscal year ended 2022 and 2021.\nNOTE 8 - DEFERRED INCOME TAXES\nThe Company calculates its deferred tax assets based upon its consolidated net operating loss (NOL) carryovers available to offset future taxable income, net of other tax credit(s) or tax deferred liabilities, if any. No deferred tax assets for the years ended September 30, 2022 and 2021 have been recorded since any available deferred tax assets are fully offset by increases in its valuation allowances. The Company increased its valuation allowance based on its history of consolidated net losses. At September 30, 2022, the Company has an adjusted net operating loss carryforward of approximately $13,782,000 that expire through 2039. Should a cumulative change in the ownership of more than 50% occur within a three-year period, there could be an annual limitation on the use of the net operating loss carryforwards.\nDeferred income taxes reflect the tax effects of temporary differences between the carrying amount of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes plus any available consolidated, net deferred tax credits. Significant components of the Company's net deferred income tax assets at September 30, 2022 and 2021, respectively are as follows:\nDepreciation\n$\n2,842\n$\n2,746\nAllowance for doubtful account\n15,880\n12,332\nNet operating loss carryforward\n3,493,201\n3,601,402\nNet deferred income tax asset\n3511,923\n3,616,480\nLess: valuation allowance\n(3,511,923)\n(3,616,480)\nTotal deferred income tax assets\n$\n-\n$\n-\nA reconciliation of the Federal and respective State income tax rate as a percentage of income before taxes is as follows:\nFederal statutory taxes\n$\n79,558\n$\n71,660\nState income taxes, net of federal benefit\n22,049\n19,860\nChange in tax estimates\n(5,901)\nLess: Valuation allowance, non-deductible items\n2,100\n1,434\nChange in valuation allowance\n(104,557)\n(87,053)\n$\n$\nFederal statutory Income tax rate\n21.00%\n21.00%\nState taxes, net of federal benefit\n4.35%\n4.35%\nEffective rate of deferred tax asset\n25.35%\n25.35%\nLess: Valuation allowance\n(25.35%)\n(25.35%)\nEffective income tax rate\n0.00%\n0.00%\nManagement has determined that it is more likely than not that the Company will not use the NOL carryforward and has a 100% valuation allowance against the deferred asset. The reserve is based on historical experience of the Company's operations as it has not recognized net income in its current incarnation and there is no indication of any events or conditions that would show that trend will not continue due to the Company's current expectation of expense requirements.\nNOTE 9 - SUBSEQUENT EVENT\nOn December 2, 2022, and effective on January 1, 2023, the Company signed a two-year lease of 1,145 square feet for our principal offices in Clearwater, Florida. The monthly rent is $2,134 in year one and increases to $2,198 in year two. The lease expires on December 31, 2024.\nExhibit 31.1\nCERTIFICATION OF CHIEF EXECUTIVE OFFICER\nAS ADOPTED PURSUANT TO SECTION 302 OF THE SARBANES-OXLEY ACT OF 2002\nI, Michael M. Moore, certify that:\n1. I have reviewed this Form 10-K, of Cleartronic, Inc.;\n2. Based on my knowledge, this report does not contain any untrue statement of a material fact or omit to state a material fact necessary to make the statements made, in light of the circumstances under which such statements were made, not misleading with respect to the period covered by this report;\n3. Based on my knowledge, the financial statements, and other financial information included in this report, fairly present in all material respects the financial condition, results of operations and cash flows of the registrant as of, and for, the periods present in this report;\n4. The registrant's other certifying officer(s) and I are responsible for establishing and maintaining disclosure controls and procedures (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)) and internal control over financial reporting (as defined in Exchange Act Rules 13-a-15(f) and 15d-15(f)) for the registrant and have:\n(a) Designed such disclosure controls and procedures, or caused such disclosure controls and procedures to be designed under our supervision, to ensure that material information relating to the registrant, including its consolidated subsidiaries, is made known to us by others within those entities, particularly during the period in which this report is being prepared;\n(b) Designed such internal control over financial reporting, or caused such internal control over financial reporting to be designed under our supervision, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles;\n(c) Evaluated the effectiveness of the registrant's disclosure controls and procedures and presented in this report our conclusions about the effectiveness of the disclosure controls and procedures, as of the end of the period covered by this report based on such evaluation; and\n(d) Disclosed in this report any change in the registrant's internal control over financial reporting that occurred during the registrant's most recent fiscal quarter (the registrant's fourth fiscal quarter in the case of an annual report) that has materially affected, or is reasonably likely to materially affect, the registrant's internal control over financial reporting; and\n5. The registrant's other certifying officer(s) and I have disclosed, based on our most recent evaluation of internal control over financial reporting, to the registrant's auditors and the audit committee of the registrant's board of directors (or persons performing the equivalent functions):\n(a) All significant deficiencies and material weaknesses in the design or operation of internal control over financial reporting which are reasonably likely to adversely affect the registrant's ability to record, process, summarize and Report financial information; and\n(b) Any fraud, whether or not material, that involved management or other employees who have a significant role in the registrant's internal control over financial reporting.\nDate: December 29, 2022\n/s/ Michael M. Moore\nMichael M. Moore, Chief Executive Officer\nExhibit 31.2\nCERTIFICATION OF CHIEF FINANCIAL OFFICER\nAS ADOPTED PURSUANT TO SECTION 302 OF THE SARBANES-OXLEY ACT OF 2002\nI, Larry M. Reid, certify that:\n1.I have reviewed this Form 10-K, of Cleartronic, Inc.;\n2. Based on my knowledge, this report does not contain any untrue statement of a material fact or omit to state a material fact necessary to make the statements made, in light of the circumstances under which such statements were made, not misleading with respect to the period covered by this report;\n3. Based on my knowledge, the financial statements, and other financial information included in this report, fairly present in all material respects the financial condition, results of operations and cash flows of the registrant as of, and for, the periods present in this report;\n4. The registrant's other certifying officer(s) and I are responsible for establishing and maintaining disclosure controls and procedures (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)) and internal control over financial reporting (as defined in Exchange Act Rules 13-a-15(f) and 15d-15(f)) for the registrant and have:\n(a) Designed such disclosure controls and procedures, or caused such disclosure controls and procedures to be designed under our supervision, to ensure that material information relating to the registrant, including its consolidated subsidiaries, is made known to us by others within those entities, particularly during the period in which this report is being prepared;\n(b) Designed such internal control over financial reporting, or caused such internal control over financial reporting to be designed under our supervision, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles;\n(c) Evaluated the effectiveness of the registrant's disclosure controls and procedures and presented in this report our conclusions about the effectiveness of the disclosure controls and procedures, as of the end of the period covered by this report based on such evaluation; and\n(d) Disclosed in this report any change in the registrant's internal control over financial reporting that occurred during the registrant's most recent fiscal quarter (the registrant's fourth fiscal quarter in the case of an annual report) that has materially affected, or is reasonably likely to materially affect, the registrant's internal control over financial reporting; and\n5. The registrant's other certifying officer(s) and I have disclosed, based on our most recent evaluation of internal control over financial reporting, to the registrant's auditors and the audit committee of the registrant's board of directors (or persons performing the equivalent functions):\n(a) All significant deficiencies and material weaknesses in the design or operation of internal control over financial reporting which are reasonably likely to adversely affect the registrant's ability to record, process, summarize and Report financial information; and\n(b) Any fraud, whether or not material, that involved management or other employees who have a significant role in the registrant's internal control over financial reporting.\nDate: December 29, 2022\n/s/Larry M. Reid,\nLarry M. Reid, Chief Financial Officer and Principal Accounting Officer\nExhibit 32.1\nCERTIFICATION OF CHIEF EXECUTIVE OFFICER\nPURSUANT TO 18 U.S.C. SECTION 1350\nAS ADOPTED PURSUANT TO\nSECTION 906 OF THE SARBANES-OXLEY ACT OF 2002\nIn connection with the accompanying Annual Report on Form 10-K, of Cleartronic, Inc. for the fiscal year ending September 30, 2022, I, Michael M. Moore, Chief Executive Officer of Cleartronic, Inc., hereby certify pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, to the best of my knowledge and belief, that:\n1. Such Annual Report on Form 10-K, for the fiscal year ending September 30, 2022, fully complies with the requirements of section 13(a) or 15(d) of the Securities Exchange Act of 1934; and\n2. The information contained in such Annual Report on Form 10-K, for the fiscal year ending September 30, 2022, fairly presents, in all material respects, the financial condition and results of operations of Cleartronic, Inc.\nDate: December 29, 2022\n/s/ Michael Moore\nMichael M. Moore, Chief Executive Officer of Cleartronic, Inc.\nExhibit 32.2\nCERTIFICATION OF CHIEF FINANCIAL OFFICER\nPURSUANT TO 18 U.S.C. SECTION 1350\nAS ADOPTED PURSUANT TO\nSECTION 906 OF THE SARBANES-OXLEY ACT OF 2002\nIn connection with the accompanying Annual Report on Form 10-K, of Cleartronic, Inc. for the fiscal year ending September 30, 2022, I, Larry M. Reid, Chief Financial Officer and Principal Accounting Officer of Cleartronic, Inc., hereby certify pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, to the best of my knowledge and belief, that:\n1. Such Annual Report on Form 10-K, for the fiscal year ending September 30, 2022, fully complies with the requirements of section 13(a) or 15(d) of the Securities Exchange Act of 1934; and\n2. The information contained in such Annual Report on Form 10-K, for the fiscal year ending September 30, 2022, fairly presents, in all material respects, the financial condition and results of operations of Cleartronic, Inc.\nDate: December 29, 2022\n/s/ Larry M. Reid\nLarry M. Reid, Chief Financial Officer and Principal Accounting Officer of Cleartronic, Inc.\nNONE\n512996\n0 3341503 670904 3000000 228578995\nCustomer billings for services not yet rendered Revenue recognized in the current year related to the beginning liability\nfalse FY false\n2021-10-01 2022-09-30\n2022-09-30\n2022-12-29\nclri:AuditorTwoMember\n2021-10-01 2022-09-30\n2021-09-30\nus-gaap:SeriesAPreferredStockMember\n2022-09-30\nus-gaap:SeriesAPreferredStockMember\n2021-09-30\nus-gaap:SeriesBPreferredStockMember\n2022-09-30\nus-gaap:SeriesBPreferredStockMember\n2021-09-30\nus-gaap:SeriesCPreferredStockMember\n2022-09-30\nus-gaap:SeriesCPreferredStockMember\n2021-09-30\nus-gaap:SeriesDPreferredStockMember\n2022-09-30\nus-gaap:SeriesDPreferredStockMember\n2021-09-30\nus-gaap:SeriesEPreferredStockMember\n2022-09-30\nus-gaap:SeriesEPreferredStockMember\n2021-09-30\n2020-10-01 2021-09-30\n2020-09-30\nus-gaap:SeriesAMember us-gaap:PreferredStockMember\n2020-09-30\nus-gaap:SeriesBMember us-gaap:PreferredStockMember\n2020-09-30\nclri:SeriesCMember us-gaap:PreferredStockMember\n2020-09-30\nclri:SeriesDMember us-gaap:PreferredStockMember\n2020-09-30\nclri:SeriesEMember us-gaap:PreferredStockMember\n2020-09-30\nus-gaap:CommonStockMember\n2020-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2020-09-30\nus-gaap:AccumulatedDefinedBenefitPlansAdjustmentMember\n2020-09-30\nus-gaap:SeriesAMember us-gaap:PreferredStockMember\n2020-10-01 2021-09-30\nus-gaap:SeriesBMember us-gaap:PreferredStockMember\n2020-10-01 2021-09-30\nclri:SeriesCMember us-gaap:PreferredStockMember\n2020-10-01 2021-09-30\nclri:SeriesDMember us-gaap:PreferredStockMember\n2020-10-01 2021-09-30\nclri:SeriesEMember us-gaap:PreferredStockMember\n2020-10-01 2021-09-30\nus-gaap:CommonStockMember\n2020-10-01 2021-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2020-10-01 2021-09-30\nus-gaap:AccumulatedDefinedBenefitPlansAdjustmentMember\n2020-10-01 2021-09-30\nus-gaap:SeriesAMember us-gaap:PreferredStockMember\n2021-09-30\nus-gaap:SeriesBMember us-gaap:PreferredStockMember\n2021-09-30\nclri:SeriesCMember us-gaap:PreferredStockMember\n2021-09-30\nclri:SeriesDMember us-gaap:PreferredStockMember\n2021-09-30\nclri:SeriesEMember us-gaap:PreferredStockMember\n2021-09-30\nus-gaap:CommonStockMember\n2021-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-09-30\nus-gaap:AccumulatedDefinedBenefitPlansAdjustmentMember\n2021-09-30\nus-gaap:SeriesAMember us-gaap:PreferredStockMember\n2021-10-01 2022-09-30\nus-gaap:SeriesBMember us-gaap:PreferredStockMember\n2021-10-01 2022-09-30\nclri:SeriesCMember us-gaap:PreferredStockMember\n2021-10-01 2022-09-30\nclri:SeriesDMember us-gaap:PreferredStockMember\n2021-10-01 2022-09-30\nclri:SeriesEMember us-gaap:PreferredStockMember\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2021-10-01 2022-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-10-01 2022-09-30\nus-gaap:AccumulatedDefinedBenefitPlansAdjustmentMember\n2021-10-01 2022-09-30\nus-gaap:SeriesAMember us-gaap:PreferredStockMember\n2022-09-30\nus-gaap:SeriesBMember us-gaap:PreferredStockMember\n2022-09-30\nclri:SeriesCMember us-gaap:PreferredStockMember\n2022-09-30\nclri:SeriesDMember us-gaap:PreferredStockMember\n2022-09-30\nclri:SeriesEMember us-gaap:PreferredStockMember\n2022-09-30\nus-gaap:CommonStockMember\n2022-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-09-30\nus-gaap:AccumulatedDefinedBenefitPlansAdjustmentMember\n2022-09-30\nclri:SeriesAConvertiblePreferredStockMember\n2022-09-30\nclri:SeriesAConvertiblePreferredStockMember\n2021-09-30\nclri:SeriesCConvertiblePreferredStockMember\n2022-09-30\nclri:LicensingOfReadyOpSoftwareMember\n2021-10-01 2022-09-30\nclri:LicensingOfReadyOpSoftwareMember\n2020-10-01 2021-09-30\nclri:HardwareSalesAndConsultingMember\n2021-10-01 2022-09-30\nclri:HardwareSalesAndConsultingMember\n2020-10-01 2021-09-30\nus-gaap:SeriesAPreferredStockMember\n2021-10-01 2022-09-30\nus-gaap:SeriesEPreferredStockMember\n2021-10-01 2022-09-30\nus-gaap:SeriesCPreferredStockMember us-gaap:PreferredStockMember\n2020-10-01 2021-09-30\nclri:ShareholderMember\n2021-07-01 2021-07-15\nclri:ShareholderMember\n2021-07-15\n2019-10-01 2020-09-30\n2019-12-31\nclri:OneNotesPayableMember\n2020-08-31\n2021-03-01 2021-03-19\n2018-10-01 2019-09-30\nus-gaap:NotesPayableOtherPayablesMember\n2018-10-01 2019-09-30\nus-gaap:NotesPayableOtherPayablesMember\n2019-09-30\n2019-09-30\n2020-06-01 2020-06-10\n2021-07-01 2021-07-20\nsrt:SubsidiariesMember clri:VoiceInteropIncMember\n2021-12-31\nsrt:SubsidiariesMember clri:VoiceInteropIncMember\n2022-09-30\n2021-11-26 2021-12-01\nus-gaap:SalesRevenueNetMember\n2021-10-01 2022-09-30\nus-gaap:SalesRevenueNetMember\n2020-10-01 2021-09-30\nsrt:ChiefExecutiveOfficerMember\n2016-11-01 2016-11-28\nsrt:ChiefExecutiveOfficerMember\n2022-04-01 2022-04-20\nsrt:ChiefFinancialOfficerMember\n2015-03-01 2015-03-13\nsrt:ChiefFinancialOfficerMember\n2021-09-26 2021-10-02\nclri:SouthernFloridaResearchFoundationMember\n2021-10-01 2022-09-30\nclri:SouthernFloridaResearchFoundationMember\n2022-09-30\nsrt:ScenarioForecastMember\n2023-01-01\nsrt:ScenarioForecastMember clri:YearOneMember\n2022-12-25 2023-01-01\nsrt:ScenarioForecastMember clri:YearTwoMember\n2022-12-25 2023-01-01\nsrt:ScenarioForecastMember\n2022-12-25 2023-01-01\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure\nutr:sqft\nutr:sqm"
}