{
    "cik": "1368637",
    "company": "Petrolia Energy Corp",
    "filing_type": "10-K",
    "filing_date": "2022-12-09",
    "period_of_report": "2021-12-31",
    "sic": "1311",
    "state_of_inc": "TX",
    "state_location": "TX",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1368637/0001493152-22-035022-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1368637/000149315222035022/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1368637/0001493152-22-035022.txt",
    "filename": "1368637_10K_2021_0001493152-22-035022.htm",
    "content": "ITEM 1. BUSINESS.\nBackground\nWe were incorporated in Colorado on January 16, 2002. In April 2012, we became active in the exploration and development of oil and gas properties.\nEffective September 2, 2016, we formally changed our name to Petrolia Energy Corporation and moved the corporation from Colorado to Texas, pursuant to the filing of a Statement of Conversion with the Secretary of State of Colorado and a Certificate of Conversion with the Secretary of State of Texas, authorized by the Plan of Conversion which was approved by our stockholders at our April 14, 2016, annual meeting of stockholders, each of which are described in greater detail in the Definitive Proxy Statement on Schedule 14A, which was filed with the Securities and Exchange Commission on March 23, 2016. In addition to the Certificate of Conversion filing, we filed a Certificate of Correction filing with the Secretary of State of Texas (correcting certain errors in our originally filed Certificate of Formation) on August 24, 2016.\nPlan of Operation\nSince 2015, we have established a clearly defined strategy to acquire, enhance and redevelop high-quality, resource in place oil and gas assets. The Company has been focusing on producing assets in the United States and Canada while actively pursuing our strategy to offer low-cost operational solutions in established Oil and Gas regions. We believe our mix of oil-in-place conventional plays, low-risk resource plays and the redevelopment of our late-stage plays is a solid foundation for continued growth and future revenue growth.\nSlick Unit Dutcher Sands (SUDS) Field\nThe SUDS oilfield consists of approximately 2,604 acres located in Creek County, Oklahoma and Petrolia owns a 100% Working Interest (WI) with a 76.5% net revenue interest (NRI). Our engineering reports and analysis indicate there is still considerable recoverable reserves remaining.\nThe SUDS field is currently shut-in while awaiting sufficient capital to recomplete the wells and repair the flow lines that were damaged in a grass fire.\nTwin Lakes San Andres Unit (TLSAU) Field\nTLSAU is located 45 miles from Roswell, Chaves County, New Mexico. TLSAU is currently shut-in awaiting confirmation of lease acreage held, then capital allocation to complete some regulatory plugging requirements. The Company plugged two wells at Twin Lakes in June 2022 and is currently working on surface remediation activities.\nThe Company is reviewing strategic options with the TLSAU asset, with a bias toward divesting the asset.\nAskarii Resources, LLC\nEffective February 1, 2016, the Company acquired 100% of the issued and outstanding interests of Askarii Resources LLC (tax), a private Texas based oil & gas service company for the aggregate value of $50,000. The Company currently has no intent of further investing in the Askarii Resources, LLC acquisition.\nLuseland, Hearts Hill and Cuthbert fields\nOn June 29, 2018, the Company acquired a 25% working interest in approximately 41,526 acres in the Luseland, Hearts Hill, and Cuthbert fields, located in Southwest Saskatchewan and Eastern Alberta, Canada. The working interest was acquired from Blue Sky Resources (a related party). Blue Sky Resources had previously acquired an 80% working interest from Georox Resources Inc., who had acquired the Canadian Properties from Cona Resources Ltd.\nOn September 17, 2018, the Company entered into a Memorandum of Understanding (MOU) with Blue Sky Resources to obtain the rights to acquire an additional 3% working interest, increasing our working interest to 28%. Total consideration paid from the Company to Blue Sky Resources for the additional 3% Working Interest was $150,000.\nOn February 16, 2022, Petrolia Canada Corporation (PCC), a wholly owned subsidiary of Petrolia Energy Corporation (PEC), entered into a Purchase and Sale Agreement (PSA) and Debt Settlement Agreement (DSA) with Prospera Energy, Inc. whereby PCC sold its 28% working interest in the Luseland, Hearts Hill and Cuthbert fields. The agreements were effective as of October 1, 2021.\nUtikuma Lake field\nOn May 1, 2020, Petrolia Energy Corporation acquired a 50% working interest in approximately 28,000 acres located in the Utikuma Lake area in Alberta, Canada. The property is an oil-weighted asset currently producing a total of approximately 500 bpd of light oil. The working interest was acquired from Blue Sky Resources in an affiliated party transaction as Zel C. Khan, the Companys former Chief Executive Officer, is related to the ownership of Blue Sky Resources.\nBlue Sky Resources acquired a 100% working interest in the Canadian Property from Vermilion Energy Inc. via Vermilions subsidiary Vermilion Resources. The effective date of the acquisition was May 1, 2020. The total purchase price of the property was $2,000,000 (CAD), with $1,000,000 (CAD) of that total due initially. The additional $1,000,000 (CAD) was contingent on the future price of WTI crude. At the time WTI price exceeded $50/bbl, the Company would pay an additional $750,000 (CAD). In addition, at the time WTI price exceeded $57/bbl the Company would pay an additional $250,000 (CAD) (for a cumulative contingent total of $1,000,000 (CAD)). The price of WTI crude exceeded $50/bbl on January 6, 2021 and exceeded $57/bbl on February 8, 2021. The additional payments due were netted with the accounts receivable balance from previous Joint Interest Billing statements from BSR. The total USD value of the addition was $787,250, using prevailing exchange rates on the respective dates. Included in the terms of the agreement, the Company also funded their portion of the Alberta Energy Regulator (AER) bond fund requirement ($602,423 USD), necessary for the wells to continue in production after the acquisition. Additional funds ($386,989 USD) remain in the other current asset balance for future payments to BSR, related to the acquisition.\nOn June 13, 2022, a Letter Agreement was signed between Blue Sky Resources Ltd. (BSR) and Petrolia Energy Corporation whereby Petrolia Canada Corporation (PCC) will sell to BSR its 50% working interest in the Utikuma Lake oil field. See Form 8-K reference in Exhibits section below.\nThe following table shows our productive wells, developed acreage, and undeveloped acreage as of December 31, 2021, for the Oklahoma, New Mexico and Alberta properties:\nState/Province Productive\nWells\nDeveloped\nAcreage\nUndeveloped\nAcreage (1)\nGross Net Gross Net Gross Net\nOklahoma 2,604 2,604\nNew Mexico 31 (2) 1,080 1,080\nAlberta 28,000 14,000\n(1) Undeveloped acreage includes leasehold interests on which wells have not been drilled or completed to the point that would permit the production of commercial quantities of natural gas and oil regardless of whether the leasehold interest is classified as containing proved undeveloped reserves.\n(2) The field was shut in for repairs and remediation work for all of 2021.\nThe following table shows the status of our gross acreage as of December 31, 2021, for the Oklahoma, New Mexico, and Alberta assets:\nState/Province Held by\nProduction\nNot Held by\nProduction\nOklahoma 2,604 -\nNew Mexico 1,080 -\nAlberta 28,000 -\nLeases on acres that are Held by Production remain in force so long as oil or gas is produced from one or more wells on the particular lease. Leased acres that are not held by Production require annual rental payments to maintain the lease until the first to occur of the following: the expiration of the lease or the time that oil or gas is produced from one or more wells drilled on the leased acreage. At the time oil or gas is produced from wells drilled on the leased acreage, the lease is considered to be Held by Production.\nProved Reserves\nBelow is a table that provides historical average sales price per barrel and average production cost per barrel by geographical location and by year, for the last three (3) fiscal years.\nAverage Sales\nPrice\n(per Bbls)\n($)\nAverage\nProduction Cost\n(per Bbls)\n($)\nOil Production\n(Bbls)\nOklahoma\n(1 ) (1 ) (1 )\n38.18 319.75\n47.31 173.43\nNew Mexico\n(1 ) (1 ) (1 )\n33.31 94.16\n(1 ) (1 ) (1 )\nAlberta/ Saskatchewan\n37.62 30.71 91,917\n30.42 35.92 94,016\n57.72 47.60 97,084\n(1) Note that in 2019, no sales or production occurred for the Oklahoma and New Mexico properties, and in 2021 no sales or production occurred for the New Mexico properties.\nBelow are estimates of our cumulative net proved reserves of all fields, as of December 31, 2021, net to our interest. Our proved reserves are located in Oklahoma, New Mexico and Canada.\nEstimates of volumes of proved reserves at December 31, 2021 are presented in barrels (Bbls) for oil and, for natural gas, in thousands of cubic feet (Mcf) at the official temperature and pressure bases of the areas in which the gas reserves are located.\nOil (Bbls) Gas (Mcf)\nProved:\nDeveloped 1,442,990\n41,180\nUndeveloped -\n-\nTotal 1,442,990\n41,180\n● Bbl refers to one barrel, or 42 U.S. gallons liquid volume, in reference to crude oil or other liquid hydrocarbons.\n● Mcf refers to one thousand cubic feet.\n● A BOE (i.e., barrel of oil equivalent) combines Bbls of oil and Mcf of gas by converting each six Mcf of gas to one Bbl of oil.\nBelow are estimates of our present value of estimated future net revenues from our proved reserves based upon the standardized measure of discounted future net cash flows relating to proved oil and gas reserves in accordance with the provisions of Accounting Standards Codification Topic 932, Extractive Activities-Oil and Gas. The standardized measure of discounted future net cash flows is determined by using estimated quantities of proved reserves and the periods in which they are expected to be developed and produced based on period-end economic conditions. The estimated future production is based upon benchmark prices that reflect the unweighted arithmetic average of the first day-of-the-month price for oil and gas during the twelve-month period ended December 31, 2021. The resulting estimated future cash inflows are then reduced by estimated future costs to develop and produce reserves based on period-end cost levels. No deduction has been made for depletion, depreciation or for indirect costs, such as general corporate overhead. Present values were computed by discounting future net revenues by 10% per year.\nFuture cash inflows $ 93,082,624\nDeductions (including estimated taxes) $ (47,760,263 )\nFuture net cash flow $ 45,322,361\nDiscounted future net cash flow $ 17,392,377\nMKM Engineering prepared the estimates of our proved reserves, future production, and income attributable to our leasehold interests in the United States and Canada as of December 31, 2021. Michele Mudrone was the technical person primarily responsible for overseeing the preparation of the reserve report. Ms. Mudrone has more than 25 years of practical experience in the estimation and evaluation of petroleum reserves. MKM Engineering is an independent petroleum engineering firm that provides petroleum consulting services to the oil and gas industry. The estimates of drilled reserves, future production, and income attributable to certain leasehold and royalty interests are based on technical analysis conducted by engineers employed at MKM Engineering.\nMark Allen, our CEO, oversaw preparation of the reserve estimates by MKM Engineering. We do not have a reserve committee and we do not have any specific internal controls regarding the estimates of our reserves.\nOur proved reserves include only those amounts which we reasonably expect to recover in the future from known oil and gas reservoirs under existing economic and operating conditions, at current prices and costs, under existing regulatory practices and with existing technology. Accordingly, any changes in prices, operating and development costs, regulations, technology, or other factors could significantly increase or decrease estimates of proved reserves.\nProved reserves were estimated by performance methods, the volumetric method, analogy, or a combination of methods utilizing present economic conditions and limited to those proved reserves economically recoverable. The performance methods include decline curve analysis that utilize extrapolations of historical production and pressure data available through December 31, 2021, in those cases where such data was considered to be definitive.\nForecasts for future production rates are based on historical performance from wells currently on production in the region with an economic cut-off for production based upon the projected net revenue being equal to the projected operating expenses. No further reserves or valuation were given to any wells beyond their economic cut-off. Where no production decline trends have been established due to the limited historical production records from wells on the properties, surrounding wells historical production records were used and extrapolated to wells of the property. Where applicable, the actual calculated present decline rate of any well was used to determine future production volumes to be economically recovered. The calculated present rate of decline was then used to determine the present economic life of the production from the reservoir.\nFor wells currently on production, forecasts of future production rates were based on historical performance data. If no production decline trend has been established, future production rates were held constant, or adjusted for the effects of curtailment where appropriate, until a decline in ability to produce was anticipated. An estimated rate of decline was then applied to economic depletion of the reserves. If a decline trend has been established, this trend was used as the basis for estimating future production rates.\nProved developed non-producing and undeveloped reserves were estimated primarily by the performance and historical extrapolation methods. Test data and other related information were used to estimate the anticipated initial production rates from those wells or locations that are not currently producing. For reserves not yet on production, sales were estimated to commence at a date we determined to be reasonable.\nIn general, the volume of production from our oil and gas properties declines as reserves are depleted. Except to the extent, we acquire additional properties containing proved reserves or conduct successful exploration and development activities, or both, our proved reserves will decline as reserves are produced. Accordingly, volumes generated from our future activities are highly dependent upon the level of success in acquiring or finding additional reserves and the costs incurred in doing so.\nGovernment Regulation\nVarious state, province and federal agencies regulate the production and sale of oil and natural gas. All states and provinces in which we plan to operate impose restrictions on the drilling, production, transportation and sale of oil and natural gas.\nOur sale of oil and natural gas liquids will not be regulated and will be at market prices. The price received from the sale of these products will be affected by the cost of transporting the products to market. Much of that transportation is through interstate common carrier pipelines.\nFederal, state, and local agencies have promulgated extensive rules and regulations applicable to our oil and natural gas exploration, production, and related operations. Most states require permits for drilling operations, drilling bonds and the filing of reports concerning operations, and impose other requirements relating to the exploration of oil and natural gas. Many states also have statutes or regulations addressing conservation matters including provisions for the unitization or pooling of oil and natural gas properties, the establishment of maximum rates of production from oil and natural gas wells and the regulation of spacing, plugging and abandonment of such wells. The statutes and regulations of some states limit the rate at which oil and natural gas is produced from our properties. The federal and state regulatory burden on the oil and natural gas industry increases our cost of doing business and affects our profitability. Because these rules and regulations are amended or reinterpreted frequently, we are unable to predict the future cost or impact of complying with those laws.\nCompetition and Marketing\nWe will be faced with strong competition from many other companies and individuals engaged in the oil and gas business, many are very large, well established energy companies with substantial capabilities and established earnings records. We may be at a competitive disadvantage in acquiring oil and gas prospects since we must compete with these individuals and companies, many of which have greater financial resources and larger technical staffs. It is nearly impossible to estimate the number of competitors; however, it is known that there are many companies and individuals in the oil and gas business.\nExploration for and production of oil and gas are affected by the availability of pipe, casing and other tubular goods and certain other oil field equipment including drilling rigs and tools. We will depend upon independent drilling contractors to furnish rigs, equipment, and tools to drill our wells. Higher prices for oil and gas may result in competition among operators for drilling equipment, tubular goods and drilling crews which may affect our ability to expeditiously drill, complete, recomplete and work-over wells.\nThe market for oil and gas is dependent upon several factors beyond our control, which at times cannot be accurately predicted. These factors include the proximity of wells to, and the capacity of, natural gas pipelines, the extent of competitive domestic production and imports of oil and gas, the availability of other sources of energy, fluctuations in seasonal supply and demand, and governmental regulation. In addition, there is always the possibility that new legislation may be enacted that would impose price controls or additional excise taxes upon crude oil or natural gas, or both. Oversupplies of natural gas can be expected to recur from time to time and may result in the gas producing wells being shut in.\nEmployees\nAs of December 31, 2021, the Company has zero full-time employees and zero part-time employees, and two contractors. As of December 9, 2022, the Company has zero full-time employees and zero part-time employees, and two contractors. ITEM 1A. RISK FACTORS\nIn addition to risks and uncertainties in the ordinary course of business that are common to all businesses, important factors that are specific to us and our industry could materially impact our future performance and results of operations. We have provided below a list of known material risk factors that should be reviewed when considering buying or selling our securities. These are not all the risks we face, and other factors currently considered immaterial or unknown to us may impact our future operations.\nCapital Requirements\nWe may need to raise funds from additional financing in the future to complete our business plan and may need to raise additional funding in the future to support our operations. We have no commitments for any financing and any financing commitments may result in dilution to our existing stockholders. We may have difficulty obtaining additional funding, and we may have to accept terms that would adversely affect our stockholders. For example, the terms of any future financings may impose restrictions on our right to declare dividends or on the way we conduct our business. Additionally, we may raise funding by issuing convertible notes, which if converted into shares of our common stock would dilute our then stockholders interests. If we are unable to raise additional funds, we may be forced to curtail or even abandon our business plan.\nCommodity Prices\nThe price we receive for our oil directly affects our revenues, profitability, access to capital and future rate of growth. Oil is a commodity that is subject to wide price fluctuations in response to changes in supply and demand. Lower prices for our oil may not only decrease our revenues but may also reduce the amount of oil that we can produce economically. Historically, the markets for oil have been volatile and will likely continue to be volatile in the future. The prices we receive for our production and the volume of our production depend on numerous factors beyond our control. These factors include the following: changes in global supply and demand for oil, the actions of OPEC, the price and quantity of imports of foreign oil, acts of war, inflation rates, economic growth, terrorism or political instability in oil producing countries and economic conditions.\nAccounting Rules\nAccounting rules applicable to us require that we periodically review the carrying value of our oil properties for possible impairment. Based on specific market factors and circumstances at the time of prospective impairment reviews and the continuing evaluation of development plans, production data, economics, and other factors, we could be required to write down the carrying value of our oil and natural gas properties. Such write-downs constitute a non-cash charge to earnings. Impairment of proved properties under our full cost oil accounting method is largely driven by the present values of future net revenues of proved reserves estimated using SEC mandated 12-month un-weighted first-day-of-the-month commodity prices. No assurance can be given that we will not experience ceiling test impairments in future periods, which could have a material adverse effect on our results of operations in the periods taken. As a result of lower oil prices, we may also reduce our estimates of the reserve volumes that may be economically recovered, which would reduce the total value of our proved reserves.\nReserve Categories\nOur undeveloped proved reserves and developed non-producing proved reserves require additional expenditures and/or activities to convert these into producing reserves. We cannot provide assurance these expenditures will be made and that activities will be entirely successful in converting these reserves. Furthermore, there can be no assurance that all our undeveloped and developed non-producing reserves will ultimately be produced during the time periods we have planned, at the costs we have budgeted, or at all, which could result in the write-off of previously recognized reserves.\nReserve Replacement\nOur future success depends largely upon our ability to find, develop, or acquire additional oil and natural gas reserves that are economically recoverable. Unless we replace the reserves we produce through successful exploration, development or acquisition activities, our proved reserves and production will decline over time. Our exploration, development and acquisition activities require substantial capital expenditures. The capital markets we have historically accessed may be constrained, but we believe we may be able to access other capital markets if the need arises. These limitations in the capital markets may affect our ability to grow and changes in our capitalization structure may significantly affect our financial risk profile. Furthermore, we cannot be certain that financing for future capital expenditures will be available if needed, and to the extent required, on acceptable terms.\nFuture cash flows are subject to several variables, such as the level of production from existing wells, the prices of oil and our success in developing and producing new reserves. Any reductions in our capital expenditures to stay within internally generated cash flow (which could be adversely affected by declining commodity prices) and cash on hand will make replacing produced reserves more difficult. If our cash flow from operations and cash on hand are not sufficient to fund our capital expenditure budget, we may be limited in our ability to access additional debt, equity, or other methods of financing on an economic or timely basis to replace our proved reserves.\nRegulatory Requirements\nThe Environmental Protection Agency (EPA) has adopted new regulations under the Clean Air Act (CAA) that, among other things, require additional emissions controls to produce oil, including New Source Performance Standards to address emissions of sulfur dioxide and Volatile Organic Compounds (VOCs) and a separate set of emission standards to address hazardous air pollutants frequently associated with such production activities. For well completion operations occurring at such well sites before January 1, 2015, the final regulations allow operators to capture and direct flowback emissions to completion combustion devices, such as flares, in lieu of performing green completions. These regulations also establish specific new requirements regarding emissions from dehydrators, storage tanks and other production equipment. Compliance with these requirements could significantly increase our costs of development and production.\nWe are required to record a liability for the present value of our asset retirement obligation (ARO) to plug and abandon inactive non-producing wells, facilities, and equipment, and to restore the land at the end of oil production operations. As a result, we may make significant increases or decreases to our estimated ARO in future periods. Accordingly, our estimate of future ARO could differ dramatically from what we may ultimately incur.\nDrilling and Well Completion Success\nOur development activities may be unsuccessful for many reasons, including adverse weather conditions, cost overruns, equipment shortages, geological issues, and mechanical difficulties. Moreover, the successful drilling of an oil well does not assure us that we will realize a profit on our investment. A variety of factors, both geological and market-related, can cause a well to become uneconomical or only marginally economical. In addition to their costs, unsuccessful wells hinder our efforts to replace reserves.\nOur oil exploration and production activities, including well stimulation and completion activities which include, among other things, hydraulic fracturing, involve a variety of operating risks, including fires, explosions, blow-outs and surface craters, uncontrollable flows of oil and formation water. If we experience any of these problems, well bores, gathering systems and processing facilities could be affected, which could adversely affect our ability to conduct operations. We could also incur substantial losses because of injury or loss of life, damage to and destruction of property, natural resources and equipment, pollution, and other environmental damage.\nAcquisition Success\nOur business strategy includes growing by making acquisitions, which may include acquisitions of exploration and production companies, producing properties and undeveloped leasehold interests. Our acquisition of oil and natural gas properties requires assessments of many factors that are inherently inexact and may be inaccurate, including the acceptable prices for available properties, amounts of recoverable reserves, estimates of future oil prices, estimates of future exploratory, development and operating costs, estimates of the costs and timing of plugging, and abandonment and estimates of potential environmental and other liabilities.\nIf we make acquisitions in the future, funding permitting, which may not be available on favorable terms, we could have difficulty integrating the acquired companys assets, personnel, and operations with our own. In addition, the key personnel of the acquired business may not be willing to work for us. We cannot predict the effect expansion may have on our core business. Regardless of whether we are successful in making an acquisition, the negotiations could disrupt our ongoing business, distract our management, and increase our expenses.\nIn addition to the risks described above, acquisitions are accompanied by a number of inherent risks, including, without limitation, the following: the difficulty of integrating acquired products, services or operations; the potential disruption of the ongoing businesses and distraction of our management and the management of acquired companies; difficulties in maintaining uniform standards, controls, procedures and policies; the potential impairment of relationships with employees and customers as a result of any integration of new management personnel; the potential inability or failure to achieve additional sales; the effect of any government regulations which relate to the business acquired; potential unknown liabilities associated with acquired businesses or product lines, or the need to spend significant amounts to retool, reposition or modify the marketing and sales of acquired products or operations, or the defense of any litigation, whether or not successful, resulting from actions of the acquired company prior to our acquisition; and potential expenses under the labor, environmental and other laws of various jurisdictions.\nCapital Deployment Risk\nExploring for and developing hydrocarbon reserves involves a high degree of operational and financial risk, which precludes us from definitively predicting the costs involved and time required to reach certain objectives. The budgeted costs of planning, drilling, completing, and operating wells are often exceeded, and such costs can increase significantly due to various complications that may arise during the drilling and operating processes. Before a well is spud, we may incur significant geological and geophysical (seismic) costs, which are incurred whether a well eventually produces commercial quantities of hydrocarbons or is drilled at all. Exploration wells bear a much greater risk of loss than development wells. The analogies we draw from available data from other wells, more fully explored locations or producing fields may not be applicable to our drilling locations. If our actual drilling and development costs are significantly more than our estimated costs, we may not be able to continue our operations as proposed and could be forced to modify our drilling plans accordingly.\nIf we decide to drill a certain location, there is a risk that no commercially productive oil or natural gas reservoirs will be found or produced. We may drill or participate in new wells that are not productive. We may drill wells that are productive, but that do not produce sufficient net revenues to return a profit after drilling, operating and other costs. There is no way to predict in advance of drilling and testing whether any location will yield oil or natural gas in sufficient quantities to recover exploration, drilling or completion costs or to be economically viable. Even if sufficient amounts of oil or natural gas exist, we may damage the potentially productive hydrocarbon-bearing formation or experience mechanical difficulties while drilling or completing the well, resulting in a reduction in production and reserves from the well or abandonment of the well.\nWhether a well is ultimately productive and profitable depends on a number of additional factors, including the following: general economic and industry conditions, including the prices received for oil and natural gas; shortages of, or delays in, obtaining equipment, and qualified personnel; potential drainage by operators on adjacent properties; loss of or damage to oilfield development and service tools; problems with title to the underlying properties; increases in severance taxes; adverse weather conditions that delay drilling activities or cause producing wells to be shut down; domestic and foreign governmental regulations; and proximity to and capacity of transportation facilities. If we do not drill productive and profitable wells in the future, our business, financial condition, and results of operations could be materially and adversely affected.\nWe review our long-lived tangible and intangible assets for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. We also test our goodwill and indefinite-lived intangible assets for impairment at least annually on December 31 of each year, or when events or changes in the business environment indicate that the carrying value of a reporting unit may exceed its fair value. If conditions in any of the businesses in which we compete were to deteriorate, we could determine that certain of our assets were impaired and we would then be required to write-off all or a portion of our costs for such assets. Any such significant write-offs would adversely affect our balance sheet and results of operations.\nEconomic Uncertainty\nConcerns over global economic conditions, energy costs, geopolitical issues, war, inflation, the availability and cost of credit, the United States mortgage market and a volatile real estate market in the United States have contributed to increased economic uncertainty and diminished expectations for the global economy. These factors, combined with volatile prices of oil and natural gas, declining business and consumer confidence and changing unemployment and inflation, have precipitated economic uncertainty. Concerns about global economic growth and inflation have had a significant adverse impact on global financial markets and commodity prices.\nOur exploration and development activities are capital intensive. We may make substantial capital expenditures in our business for the development, exploitation, production and acquisition of oil and natural gas reserves. Our cash on hand, our operating cash flows and future potential borrowings may not be adequate to fund our future acquisitions or future capital expenditure requirements. The rate of our future growth may be dependent, at least in part, on our ability to access capital at rates and on terms we determine to be acceptable.\nCash Management\nOur cash flows from operations and access to capital are subject to a number of variables, including: our estimated proved oil and natural gas reserves; the amount of oil and natural gas we produce from existing wells; the prices at which we sell our production; the costs of developing and producing our oil and natural gas reserves; our ability to acquire, locate and produce new reserves; the ability and willingness of banks to lend to us; and our ability to access the equity and debt capital markets. In addition, future events, such as terrorist attacks, wars or combat peace-keeping missions, financial market disruptions, general economic recessions, inflation, oil and natural gas industry recessions, large company bankruptcies, accounting scandals, overstated reserves estimates by major public oil companies and disruptions in the financial and capital markets have caused financial institutions, credit rating agencies and the public to more closely review the financial statements, capital structures and earnings of public companies, including energy companies. Such events have constrained the capital available to the energy industry in the past, and such events or similar events could adversely affect our access to funding for our operations in the future.\nIf our revenues decrease as a result of lower oil and natural gas prices, operating difficulties, declines in reserves or for any other reason, we may have limited ability to obtain the capital necessary to sustain our operations at current levels, further develop and exploit our current properties or invest in additional exploration opportunities.\nAlternatively, a significant improvement in oil and natural gas prices or other factors could result in an increase in our capital expenditures, and we may be required to alter or increase our capitalization substantially through the issuance of debt or equity securities, the sale of production payments, the sale or farm out of interests in our assets, the borrowing of funds or otherwise to meet any increase in capital needs. If we are unable to raise additional capital from available sources at acceptable terms, our business, financial condition, and results of operations could be adversely affected. Further, future debt financings may require that a portion of our cash flows provided by operating activities be used for the payment of principal and interest on our debt, thereby reducing our ability to use cash flows to fund working capital, capital expenditures and acquisitions.\nDebt financing may involve covenants that restrict our business activities. If we succeed in selling additional equity securities to raise funds, at such time the ownership percentage of our existing shareholders would be diluted, and new investors may demand rights, preferences or privileges senior to those of existing shareholders. If we choose to farm-out interests in our prospects, we may lose operating control over such prospects.\nTerrorist Attack\nWe cannot assess the extent of either the threat or the potential impact of future terrorist attacks on the energy industry in general, and on us in particular, either in the short-term or in the long-term. Uncertainty surrounding such hostilities may affect our operations in unpredictable ways, including the possibility that infrastructure facilities, including pipelines, and gathering systems, production facilities, processing plants and refineries, could be targets of, or indirect casualties of, an act of terror, a cyber-attack or electronic security breach, or an act of war.\nProduction Growth\nIn addition, there is an inherent risk of incurring significant environmental costs and liabilities in the performance of our operations, some of which may be material, due to our handling of petroleum hydrocarbons and wastes, our emissions to air and water, the underground injection or other disposal of our wastes, the use of hydraulic fracturing fluids and historical industry operations and waste disposal practices.\nThe rate of production from our oil and natural gas properties will decline as our reserves are depleted. Our future oil and natural gas reserves and production and, therefore, our income and cash flow, are highly dependent on our success in (a) efficiently developing and exploiting our current reserves on properties owned by us or by other persons or entities and (b) economically finding or acquiring additional oil and natural gas producing properties. In the future, we may have difficulty acquiring new properties. During periods of low oil and/or natural gas prices, it will become more difficult to raise the capital necessary to finance expansion activities. If we are unable to replace our production, our reserves will decrease, and our business, financial condition and results of operations would be adversely affected.\nOur ability to acquire additional prospects and to find and develop reserves in the future will depend on our ability to evaluate and select suitable properties and to consummate transactions in a highly competitive environment for acquiring properties, marketing oil and natural gas and securing trained personnel. Also, there is substantial competition for capital available for investment in the oil and natural gas industry. Many of our competitors possess and employ financial, technical and personnel resources substantially greater than ours, and many of our competitors have more established presences in the United States and in foreign locations than we have. Those companies may be able to pay more for productive oil and natural gas properties and exploratory prospects and to evaluate, bid for and purchase a greater number of properties and prospects than our financial or personnel resources permit. In addition, other companies may be able to offer better compensation packages to attract and retain qualified personnel than we are able to offer. The cost to attract and retain qualified personnel has increased in recent years due to competition and may increase substantially in the future. We may not be able to compete successfully in the future in acquiring prospective reserves, developing reserves, marketing hydrocarbons, attracting and retaining quality personnel and raising additional capital, which could have a material adverse effect on our business, financial condition, and results of operations.\nTechnology and Innovation\nOur industry is subject to rapid and significant advancements in technology, including the introduction of new products and services using new technologies and databases. As our competitors use or develop new technologies, we may be placed at a competitive disadvantage, and competitive pressures may force us to implement new technologies at a substantial cost. In addition, many of our competitors will have greater financial, technical and personnel resources that allow them to enjoy technological advantages and may in the future allow them to implement new technologies before we can. We cannot be certain that we will be able to implement technologies on a timely basis or at a cost that is acceptable to us. One or more of the technologies that we will use or that we may implement in the future may become obsolete, and we may be adversely affected.\nConsumer Confidence\nOur results of operations may be materially affected by the conditions of the global economies and the credit, commodities, and stock markets. Among other things, we may be adversely impacted if consumers of oil and gas are not able to access sufficient capital to continue to operate their businesses or to operate them at prior levels. A decline in consumer confidence or changing patterns in the availability and use of disposable income by consumers can negatively affect the demand for oil and gas and as a result our results of operations.\nAlternative Energy\nBecause our operations depend on the demand for oil, any improvement in or new discoveries of alternative energy technologies (such as wind, solar, geothermal, fuel cells and biofuels) that increase the use of alternative forms of energy and reduce the demand for oil, gas and oil and gas related products could have a material adverse impact on our business, financial condition, and results of operations.\nReserve Valuation\nThe process of estimating oil reserves is complex. It requires interpretations of available technical data and many assumptions, including assumptions relating to economic factors. Any significant inaccuracies in these interpretations or assumptions could materially affect the estimated quantities and the calculation of the present value of our reserves. To prepare our year-end reserve estimates, our independent petroleum consultant projected our production rates and timing of development expenditures. Our independent petroleum consultant also analyzed available geological, geophysical, production and engineering data. The extent, quality and reliability of this data can vary and may not be under our control. The process also requires economic assumptions about matters such as oil and natural gas prices, operating expenses, capital expenditures, taxes, and availability of funds. Therefore, estimates of oil and natural gas reserves are inherently imprecise.\nYou should not assume that the present value of future net revenues from our proved oil and natural gas reserves is the current market value of our estimated oil and natural gas reserves. In accordance with SEC requirements, we base the estimated discounted future net cash flows from our proved reserves on the 12-month un-weighted first-day-of-the-month average price for each product and costs in effect on the date of the estimate. Actual future prices and costs may differ materially from those used in the present value estimate.\nFuture Regulations\nOur operations and facilities are subject to extensive federal, state and local laws and regulations relating to the exploration, development, production and transportation of oil and natural gas and operational safety. Future laws or regulations, any adverse change in the interpretation of existing laws and regulations or our failure to comply with such legal requirements may harm our business, results of operations and financial condition.\nEmployee Retention\nTo a large extent, we depend on the services of our senior management. The loss of the services of any of our senior management, could have a negative impact on our operations. We do not maintain or plan to obtain for the benefit of the Company any insurance against the loss of any of these individuals.\nEquity Dilution\nOur board of directors may attempt to use non-cash consideration to satisfy obligations. In many instances, we believe that the non-cash consideration will consist of shares of our common stock, preferred stock or warrants to purchase shares of our common stock. Our board of directors has authority, without action or vote of the shareholders to issue all or part of the authorized but unissued shares of common stock, preferred stock or warrants to purchase such shares of common stock. In addition, we may attempt to raise capital by selling shares of our common stock, possibly at a discount to market in the future. These actions will result in dilution of the ownership interests of existing shareholders and may further dilute common stock book value, and that dilution may be material. Such issuances may also serve to enhance existing managements ability to maintain control, because the shares may be issued to parties or entities committed to supporting existing management.\nIlliquid and Volatile Equity Environment\nOur stock is currently not actively traded because of SEC Rule 15c2-11, and other factors. Variables that could affect our future stock price or result in fluctuations in the market price or trading volume of our common stock include:\n● our actual or anticipated operating and financial performance and drilling locations, including reserves estimates;\n● quarterly variations in the rate of growth of our financial indicators, such as net income per share, net income, and cash flows, or those of companies that are perceived to be similar to us;\n● changes in revenue, cash flows or earnings estimates or publication of reports by equity research analysts;\n● speculation in the press or investment community;\n● public reaction to our press releases, announcements, and filings with the SEC;\n● sales of our common stock by us or other shareholders, or the perception that such sales may occur;\n● the limited amount of our freely tradable common stock available in the public marketplace;\n● general financial market conditions and oil and natural gas industry market conditions, including fluctuations in commodity prices;\n● the realization of any of the risk factors presented in this Annual Report;\n● the recruitment or departure of key personnel;\n● commencement of, or involvement in, litigation;\n● the prices of oil and natural gas;\n● the success of our exploration and development operations, and the marketing of any oil and natural gas we produce;\n● changes in market valuations of companies similar to ours; and\n● domestic and international economic, legal and regulatory factors unrelated to our performance.\nOur future stock price may be impacted by factors that are unrelated or disproportionate to our operating performance. The stock markets in general have experienced volatility that has often been unrelated to the operating performance of particular companies. These broad market fluctuations may adversely affect the future trading price of our common stock. Additionally, general economic, political and market conditions, such as recessions, interest rates or international currency fluctuations may adversely affect the market price of our common stock. Due to the historical limited volume of our shares which trade, we believe that our future stock prices (bid, ask and closing prices) may not be related to our actual value, and not reflect the actual value of our common stock. Shareholders and potential investors in our common stock should exercise extreme caution before making any future investment in us.\nAdditionally, as a result of the historical illiquidity of our common stock, investors may not be interested in owning our common stock because of the inability to acquire or sell a substantial block of our common stock at one time. Such illiquidity could have an adverse effect on the market price of our common stock. In addition, a shareholder may not be able to borrow funds using our common stock as collateral because lenders may be unwilling to accept the pledge of securities having such a limited market. We cannot assure you that a future trading market for our common stock will develop or, if one develops, be sustained. Extreme caution should be taken when considering the future purchase of Petrolias common stock.\nAdministrative Proceedings\nFile No. 3-20724 was filed by the SEC seeking to revoke the registration of each class of securities registered pursuant to Section 12 of the Exchange Act. The Company has filed a response to the SECs motion, but there is no assurance that the Company will be successful, and that the registration of the Companys securities will not be revoked.\nOn September 27, 2022, the Financial Industry Regulatory Authority (FINRA) pulled the Companys stock symbol due to inactivity in the Companys security for a year. The Company is taking steps to become current in its filings with the Securities and Exchange Commission and upon becoming current in its filings with the Securities and Exchange Commission, it plans to engage a market maker to file a Form 15c2-11 with FINRA and obtain a stock symbol. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable to the Company as a smaller reporting/non-accelerated filer. ITEM 2. PROPERTIES.\nOur principal office is located at 710 N. Post Oak Rd., Suite 400, Houston, Texas 77024.\nOn December 31, 2020 we terminated our sublease of office space and entered into an executive office sharing agreement which allows the Company to use approximately 800 square feet of work space, on an as needed basis. The space costs $100 per month and is contracted on a month-to-month basis.\nThe Companys oil and gas properties are described under Item 1. Business, above, and below under Note 4. Evaluated Properties in the consolidated audited financial statements attached hereto. ITEM 3. LEGAL PROCEEDINGS.\nOn December 30, 2021, the Company reached a settlement with Argonaut Insurance Company (Argo), regarding a final judgement of $52,749 that had been issued on March 6, 2018. The company paid Argo a lump sum of $15,000 in full satisfaction of the original judgement.\nOn January 28, 2022, the Securities and Exchange Commission filed an Order Instituting Administrative Proceedings and Notice of Hearing Pursuant to Section 12(j) of the Securities Exchange Act of 1934 to suspend for a period not exceeding twelve months or revoke the registration of each class of securities registered pursuant to Section 12 of the Exchange Act of the Company. The Division of Enforcement at the Securities and Exchange Commission (the Division) filed a Motion for Summary Disposition in this matter and the Company filed a Response to the Motion for Summary Disposition in April 2022. On May 5, 2022, the Division filed its Response in Support of its Motion for Summary Disposition.\nOn March 11, 2022, Petrolia Energy Corporation (Petrolia or the Company) and Petrolia Canada Corporation (Petrolia Canada), an affiliate of Petrolias, filed a lawsuit in District Court, Harris County Texas against Jovian Petroleum Corporation, Zel Khan and Quinten Beasley (herein collectively after referred to as the Defendants). The case is assigned to Judge Jaclanel McFarland, of the 133rd Judicial District Court of Harris County, Texas under Cause No. 2022-15278.\nIn their filed petition against the Defendants, Petrolia and Petrolia Canada claim fraud and breach of contract against all the named Defendants and, in addition to those two (2) claims, they also assert breach of fiduciary duty claims against Defendants Zel Khan and Quinten Beasley. Defendant Zel Khan was a former CEO and Director of Petrolia, and Defendant Quinten Beasley was a former Senior Vice President and Director of Petrolia Canada.\nPetrolia and Petrolia Canada are demanding a jury trial and are seeking monetary relief of more than ONE MILLION US DOLLARS ($1,000,000.00) in their lawsuit filed against the Defendants. In the lawsuit filed by the two (2) companies against the Defendants, referenced above, they seek judgment against the Defendants for (i) actual damages in the amount of lost revenue and economic losses, (ii) punitive damages, (iii) pre-and post-judgment interest, (iv) court costs, (v) attorneys fees, and (vi) any other relief to which Petrolia and Petrolia Canada are entitled.\nIn September 2022, Defendants filed an amended answer and counterclaims. Defendants are seeking indemnification under the Companys governing documents and statutory provisions. Beasley is also seeking repayment of the outstanding balance of $5,000 plus accrued interest in connection with a promissory note entered into with the Company on July 14, 2016. On October 11, 2022, Petrolia and Petrolia Canada filed a general denial of all of the Defendants counterclaims. The outcome of the above litigation is currently unknown; however, the Company disputes the Defendants counterclaims and intends to defend the matter vigorously, while also continuing to seek all damages which it is due.\nOn March 16, 2022, Petrolia Canada Corporation received a Notice of Intention to Retain Collateral Pursuant to Section 62 of the Personal Property Security Act (Alberta) from the counsel of Blue Sky Resources Ltd. related to a Loan Agreement and General Security Agreement between Petrolia Canada Corporation and Emmett Lescroart. Petrolia Canada Corporation was notified that Blue Sky Resources Ltd., as assignee of the Emmet Lescroart loan, intends to retain the Utikuma loan collateral pursuant to the General Security Agreement with Petrolia Canada Corporation. On March 30, 2022, Petrolia Canada Corporations counsel responded to Blue Sky Resources, Ltd. with a Notice of Objection. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nOn September 27, 2022, the Financial Industry Regulatory Authority (FINRA) pulled the Companys stock symbol due to inactivity in the Companys security for a year. The Company is taking steps to become current in its filings with the Securities and Exchange Commission and upon becoming current in its filings with the Securities and Exchange Commission, it plans to engage a market maker to file a Form 15c2-11 with FINRA and obtain a stock symbol.\nWhen allowed to be traded, our common stock has historically been quoted under the symbol BBLS on the OTC Pink Sheet market operated by OTC Markets Group. Our common stock is currently not traded because of SEC Rule 15c2-11 and FINRA pulling the Conpanys stock symbol due to inactivity.\nHistorically, only a limited market exists for our securities. There is no assurance that a regular trading market will develop, or if developed, that it will be sustained. Therefore, a shareholder may be unable to resell his securities in our company. Extreme caution should be taken when evaluating the future purchase of Petrolia Energy common stock.\nThe following tables set forth the historical range of high and low sales prices for our common stock for the periods indicated as reported by the OTC Pink Sheet market operated by the OTC Markets Group. The market quotations reflect inter-dealer prices, without retail mark-up, mark-down or commissions and may not necessarily represent actual transactions.\nQuarter Ended High Low\nMarch 31, 2021 $ 0.0475 $ 0.0200\nJune 30, 2021 $ 0.0570 $ 0.0212\nSeptember 30, 2021 $ 0.0397 $ 0.0003\nDecember 31, 2021 $ 0.0030 $ 0.0030\nQuarter Ended High Low\nMarch 31, 2020 $ 0.090 $ 0.031\nJune 30, 2020 $ 0.079 $ 0.023\nSeptember 30, 2020 $ 0.053 $ 0.011\nDecember 31, 2020 $ 0.040 $ 0.013\nPenny Stock\nOn September 27, 2022, the Financial Industry Regulatory Authority (FINRA) pulled the Companys stock symbol due to inactivity in the Companys security for a year. The Company is taking steps to become current in its filings with the Securities and Exchange Commission and upon becoming current in its filings with the Securities and Exchange Commission, it plans to engage a market maker to file a Form 15c2-11 with FINRA and obtain a stock symbol.\nThe SEC has adopted rules that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a market price of less than $5.00, other than securities registered on certain national securities exchanges or quoted on the NASDAQ system, provided that current price and volume information with respect to transactions in such securities is provided by the exchange or system. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock, to deliver a standardized risk disclosure document prepared by the SEC, that: (a) contains a description of the nature and level of risk in the market for penny stocks in both public offerings and secondary trading; (b) contains a description of the brokers or dealers duties to the customer and of the rights and remedies available to the customer with respect to a violation of such duties or other requirements of the securities laws; (c) contains a brief, clear, narrative description of a dealer market, including bid and ask prices for penny stocks and the significance of the spread between the bid and ask price; (d) contains a toll-free telephone number for inquiries on disciplinary actions; (e) defines significant terms in the disclosure document or in the conduct of trading in penny stocks; and (f) contains such other information and is in such form, including language, type size and format, as the SEC shall require by rule or regulation.\nThe broker-dealer also must provide, prior to effecting any transaction in a penny stock, the customer with (a) bid and offer quotations for the penny stock; (b) the compensation of the broker-dealer and its salesperson in the transaction; (c) the number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the market for such stock; and (d) a monthly account statement showing the market value of each penny stock held in the customers account.\nIn addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from those rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written acknowledgment of the receipt of a risk disclosure statement, a written agreement as to transactions involving penny stocks, and a signed and dated copy of a written suitability statement.\nThese disclosure requirements may have the effect of reducing the trading activity for our common stock. Therefore, stockholders may have difficulty selling our securities.\nPetrolia Energy Corporation is currently not being actively traded because of SEC Rule 15c2-11 and because (FINRA) pulled the Companys stock symbol due to inactivity in the Companys security for a year.\nHolders of Our Common Stock\nAs of December 31, 2021, we had 176,988,322 outstanding shares of common stock and approximately 279 shareholders of record. As of December 9, 2022, we had 176,988,322 outstanding shares of common stock and approximately 279 shareholders of record.\nPreferred Stock\nOur Certificate of Formation authorizes our Board of Directors to issue up to 1,000,000 shares of preferred stock. The provisions in the Certificate of Formation, relating to the preferred stock, allow our directors to issue preferred stock with multiple votes per share and dividend rights which would have priority over any dividends paid with respect to the holders of our common stock. The issuance of preferred stock with these rights may make the removal of management difficult even if the removal would be considered beneficial to shareholders generally and will have the effect of limiting shareholder participation in certain transactions such as mergers or tender offers if these transactions are not favored by our management.\nAs of December 31, 2021, there are 199,100 shares of Series A Preferred outstanding with 21 preferred shareholders of record.\nOn October 25, 2021, the Company issued one share each of its newly designated shares of Series B Preferred Stock to Board of Directors members James Burns, Leo Womack, and Ivar Siem , in consideration for services rendered to the Company as members of the Board of Directors. These shares vote in aggregate sixty percent of the total vote on all shareholder matters. These shares were valued at $50,799 per share by an independent specialist. The purpose of issuing the three Series B Preferred shares is to protect the company while the disputes described in the Form 8-K Current Report, filed on March 18, 2022, are heard and resolved through the U.S. court system. The Series B Preferred shares will be retired once the litigation is resolved. As of December 31, 2021, there are 3 Series B preferred shares outstanding with 3 preferred shareholders of record.\nIn October and November of 2021 and January of 2022, the Company entered into various subscription agreements to sell an aggregate amount of 11,000 shares of its newly designated Series C Convertible Preferred Stock at $10 per share. As of December 31, 2021, there are 8,500 Series C preferred shares outstanding with 3 preferred shareholders of record.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following table sets forth information, as of December 31, 2021, with respect to our compensation plans under which common stock is authorized for issuance.\nEquity Compensation Plan Information\n(A) (B) (C)\nPlan Category Number of securities to issue upon exercise of outstanding options and warrants Weighted-average exercise price of outstanding options and warrants Number of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in Column A)\nEquity compensation plans approved by shareholders (1) - N/A 40,000,000\nEquity compensation plans not approved by shareholders 29,700,000 $0.13 per share -\nTotal 29,700,000 $0.13 per share 40,000,000\n(1) The Companys 2015 Stock Incentive Plan, as amended (the Plan) provides for up to 40,000,000 shares of awards. At present, no shares have been issued from the Plan.\nRecent Sales of Unregistered Securities\nIn October and November of 2021, and January 2022, the Company entered into various subscription agreements with certain accredited investors, pursuant to which the Subscribers agreed, subject to certain conditions in the Subscription Agreements, to purchase an aggregate amount of 11,000 shares of the Companys newly designated shares of Series C Convertible Preferred Stock, par value $0.10 per share at $10.00 per share. 8,500 shares of Series C Convertible Preferred Stock were sold in 2021.\nAll shares granted for goods or services and settlement of liabilities during the year ended December 31, 2021, and through the date of the filing of this Report were valued based on the fair value of the shares issued.\nWe claim an exemption from registration pursuant to Section 4(a)(2) and/or Rule 506(b) of Regulation D of the Securities Act, and the rules and regulations promulgated thereunder in connection with the sales, grants and issuances described above since the foregoing issuances and grants did not involve a public offering, the recipients were (a) accredited investors, and/or (b) had access to similar documentation and information as would be required in a Registration Statement under the Securities Act. With respect to the transactions described above, no general solicitation was made either by us or by any person acting on our behalf. The transactions were privately negotiated and did not involve any kind of public solicitation. No underwriters or agents were involved in the foregoing issuances, and we paid no underwriting discounts or commissions. The securities sold are subject to transfer restrictions, and the certificates evidencing the securities contain an appropriate legend stating that such securities have not been registered under the Securities Act and may not be offered or sold absent registration or pursuant to an exemption therefrom. ITEM 6. (RESERVED) ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with the consolidated financial statements and related notes appearing elsewhere in this Annual Report. The following discussion contains forward-looking statements that reflect our future plans, estimates, beliefs and expected performance. We caution you that assumptions, expectations, projections, intentions or beliefs about future events may, and often do, vary from actual results and the differences can be material. See Risk Factors and Forward Looking Statements.\nResults of Operations\nRevenues\nRevenue for the year ended December 31, 2021 was $5,895,228, an increase of $3,002,987 from the prior year. The increase was primarily due to greater production at our Utikuma field.\nOperating Expenses\nOperating expenses for the year ended December 31, 2021 were $7,307,025, a decrease of $5,275,229 from the prior year. This was primarily due to the forfeiture of TLSAU leases in 2020, which resulted in a $6,225,103 loss and impairments of $396,922 in our U.S. properties. There was an increase of $1,718,746 in lease operating expense, due to the increased production in our Canadian assets, and a $744,136 decrease in depreciation, depletion and amortization due to a smaller depletion base.\nOther Income/Expenses\nOther income/expenses for the year ended December 31, 2021 was other net income of $3,340,701, a change of $3,959,707 from the prior year net expense. The primary cause for the change was the gain on the disposition of the Cona asset, in the amount of $3,919,323. There was also other net expense of $101,297, the major components of this were other income from the forgiveness of the PPP loan and other expense due to adjustments made to our Canadian receivables.\nNet Income\nThe net income for the year ended December 31, 2021 was $1,928,904, compared to net loss of $10,309,019 for the year ended December 31, 2020, a change of $12,237,923 from the prior year for the reasons described above, primarily the disposition of the Cona asset.\nLiquidity and Capital Resources\nAs of December 31, 2021, we had total current assets of $25,641 and total assets of $7,838,486. Our total current liabilities as of December 31, 2021 were $6,620,065 and our total liabilities were $8,899,646. We had negative working capital of $6,594,424 as of December 31, 2021.\nOur material asset balances are made up of oil and gas properties and related equipment. Our most significant liabilities include asset retirement obligations of $2,257,027, accrued liabilities and related party accrued liabilities of $2,011,170, notes payable of $3,438,162 and related party notes payable of $779,373.\nOperating activities used $105,578 in cash for the year ended December 31, 2021. Net cash used by investing activities for the year ended December 31, 2021 was $0.\nCash used by financing activities during the year ended December 31, 2021 was $35,890 and consisted of $85,000 of proceeds from the sale of Series C Preferred Stock, which was offset by $120,890 of repayments of notes payable.\nDuring the year ended December 31, 2021, the Company operated at a negative cash flow from operations of approximately $9,000 per month and our auditors have raised a going concern in their audit report as contained herein. Management also plans to minimize general and administrative expenses and optimize cashflow from the Utikuma asset.\nThe Company has suffered recurring losses from operations. These conditions raise doubt about the Companys ability to continue as a going concern. We plan to generate profits by reducing general and administrative expenses and optimizing Utikuma cashflow. However, we may need to raise additional funds to workover wells through the sale of our securities, through loans from third parties or from third parties willing to pay our share of drilling and completing the wells. We do not have any commitments or arrangements from any person to provide us with any additional capital.\nIf additional financing is not available when needed, we may need to cease operations. There can be no assurance that we will be successful in raising the capital needed to recomplete oil or gas wells nor that any such additional financing will be available to us on acceptable terms or at all.\nManagement believes that actions presently being taken to obtain additional funding provide the opportunity for the Company to continue as a going concern. The accompanying financial statements have been prepared assuming the Company will continue as a going concern; no adjustments to the financial statements have been made to account for this uncertainty.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, and results of operations, liquidity or capital resources.\nTrends Affecting Future Operations\nThe factors that will most significantly affect our results of operations will be (i) the sale prices of crude oil and natural gas, (ii) the amount of production sold from oil or gas wells in which we have an interest, and (iii) lease operating expenses. Our revenues will also be significantly impacted by our ability to maintain or increase oil or gas production through exploration and development activities, and the availability of funding to complete such activities.\nIt is expected that our principal source of cash flow will be from the production and sale of crude oil and natural gas reserves which are depleting assets. Cash flow from the sale of oil and gas production depends upon the quantity of production and the price obtained for the production. An increase in prices will permit us to finance our operations to a greater extent with internally generated funds, may allow us to obtain equity financing more easily or on better terms, and lessens the difficulty of obtaining financing. However, price increases may heighten the competition for oil and gas prospects, and may increase the costs of exploration and development.\nA decline in oil and gas prices (i) will reduce the cash flow internally generated by the Company which in turn will reduce the funds available for exploring for and replacing oil and gas reserves, (ii) will increase the difficulty of obtaining equity and debt financing and worsen the terms on which such financing may be obtained, (iii) will reduce the number of oil and gas prospects which have reasonable economic terms, (iv) may cause us to permit leases to expire based upon the value of potential oil and gas reserves in relation to the costs of exploration, (v) may result in marginally productive oil and gas wells being abandoned as non-commercial, and (vi) may increase the difficulty of obtaining financing. However, price declines reduce the competition for oil and gas properties and correspondingly reduce the prices paid for leases and prospects.\nCritical Accounting Policies\nIn December 2001, the SEC requested that all registrants list their most critical accounting polices in the Management Discussion and Analysis. The SEC indicated that a critical accounting policy is one which is both important to the portrayal of a companys financial condition and results, and requires managements most difficult, subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain.\nGoing concern - The accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. The Company has incurred cumulative net losses of $61,339,161 since its inception and may require capital for its contemplated operational and marketing activities to take place. The Companys ability to raise additional capital through the future sales of common stock is unknown. The obtainment of additional financing, the successful development of the Companys contemplated plan of operations, and its transition, ultimately, to the attainment of profitable operations are necessary for the Company to continue operations. The ability to successfully resolve these factors raise doubt about the Companys ability to continue as a going concern. The consolidated financial statements of the Company do not include any adjustments that may result from the outcome of these aforementioned uncertainties.\nRecently Issued Accounting Pronouncements\nWe do not expect the adoption of recently issued accounting pronouncements to have a significant impact on our results of operations, financial position, or cash flow. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nPursuant to Item 305(e) of Regulation S-K (§ 229.305(e)), the Company is not required to provide the information required by this Item as it is a smaller reporting company, as defined by Rule 229.10(f)(1). ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nThe consolidated audited financial statements and supplementary data required by this Item are presented beginning on page of this Annual Report on Form 10-K, which follows Signatures below. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nThe Company maintains disclosure controls and procedures that are designed to ensure that information required to be disclosed in its Exchange Act reports is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to the Companys management, including the Companys chief executive officer and chief financial officer, as appropriate, to allow timely decisions regarding required disclosure. Management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives and management necessarily applies its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nAn evaluation was carried out under the supervision and with the participation of our management, including our Principal Executive Officer and Principal Financial Officer, of the effectiveness of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, as of the end of the period covered by this annual report on Form 10-K. Based on that evaluation, our management concluded that, as of December 31, 2021, our disclosure controls and procedures were not effective.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act, and for the assessment of the effectiveness of internal control over financial reporting. As defined by the Securities and Exchange Commission, internal control over financial reporting is a process designed by, or under the supervision of our Principal Executive and Financial Officer and implemented by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of our financial statements in accordance with U.S. generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur Principal Executive Officer and Principal Financial Officer evaluated the effectiveness of our internal control over financial reporting as of December 31, 2021, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission, or the COSO Framework of 2013. Managements assessment included an evaluation of the design of our internal control over financial reporting and testing of the operational effectiveness of those controls. Based on this evaluation, management concluded that our internal control over financial reporting was ineffective as of December 31, 2021.\nA material weakness is defined as a deficiency, or a combination of deficiencies in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis.\nThe ineffectiveness of our internal control over financial reporting was due to an insufficient degree of segregation of duties amongst our accounting and financial reporting personnel, the lack of a formalized and complete set of policy and procedure documentation evidencing our system of internal controls over financial reporting, and the possibility that company employees were also contracted to perform the accounting of affiliated parties. These factors led to certain adjustments which have been reflected in our audited financial statements. These weaknesses may not be uncommon in a company of our size due to personnel and financial limitations.\nManagement is committed to remediating the identified material weakness in a timely manner, with appropriate oversight from our Audit Committee. We intend to work to remediate the material weaknesses identified above, which is expected to include (i) the addition of accounting and financial personnel with experience in the implementation of accounting principles generally accepted in the United States of America and SEC reporting requirements, (ii) the engagement of accounting consultants on a limited-time basis to provide expertise on specific areas of the accounting literature, (iii) the modification to our accounting processes and enhancement to our financial controls, (iv) the elimination of employees or contractors also being employed by affiliated parties and/or (v) the hiring of an independent consulting or accounting firm to review and document our internal control system to ensure compliance with COSO. However, our current financial position will make it difficult for us to undertake the planned remediation steps outlined above.\nChanges in Internal Control Over Financial Reporting\nExcept as noted above, there was no change in our internal control over financial reporting that occurred during the period covered by this Report that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION.\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe following information sets forth the names, ages, and positions of our directors and executive officers as of December 31, 2021.\nName\nAge\nPosition\nDirector/Officer Since\nMark Allen\nChief Executive Officer\nSeptember 1, 2020\nHeather Monk\nInterim Chief Financial Officer\nJune 15, 2022\nLeo Womack\nDirector\nAugust\nJames Edward Burns\nChairman\nApril\nIvar Siem\nDirector\nApril\nSet forth below is a brief description of the background and business experience of each of our current executive officers and directors:\nMark Allen is an executive in the oil and gas industry with over 25 years of experience, previously as Vice President, Oil and Gas Consulting for Wipro Limited, a leading global consulting and information technology services firm. Prior to Wipro Limited, Mr. Allen was Vice President, Exploration and Production Services for SAIC, a Fortune 500 company. Mr. Allen has also held leadership roles at Shell Oil Company. For the past 10 years Mr. Allen has been the President of Contango Energy, a family held energy company. Mr. Allen holds a BS in Accounting from Brigham Young University and an MBA from the University of St. Thomas. In September 2021, Mr. Allen was appointed as the Chief Executive Officer of the Company.\nHeather Monk is a Certified Public Accountant with over 20 years of experience. After starting out in public accounting, she spent 13 years at Enterprise Products Company. She then went on to start her own accounting firm, specializing in taxes and business planning for small to mid-sized businesses. Ms. Monk holds a BBA in Accounting and an MBA from The University of Houston. She joined Petrolia in late 2021 and was appointed the Interim Chief Financial Officer in June 2022.\nLeo Womack has over 40 years of experience in advising and serving as Director of small micro-capitalization public and private companies. Mr. Womack has been the President of Gulf Equities Realty Advisors, Inc., a diversified real estate portfolio management company, since 1986. For more than five (5) years, from March 1986 to the present, Mr. Womack has been and continues to be employed as the President of Gulf Equities Realty Advisors Inc. He has been the Chairman of Fairway Medical Technologies, Inc., a medical device company and a portfolio company of the Baylor College of Medicine Venture Fund since 1996. From 1969 to 1978, he was the managing partner of a local and later national CPA firm. He has served on the Board and as Chairman of the Houston Angel Network and on National Committees of the Angel Capital Association. Prior to its acquisition by ITT Corporation in 2010, he served as a board member and the audit committee chair for OI Corporation (NASDAQ:OICO). Mr. Womack continues to serve on the Boards of Directors of five early-stage companies that he or his Family Trust have invested in. Mr. Womack earned a Bachelor of Business Administration in Accounting from Texas A&M University-Kingsville in 1965. Mr. Womack is also a licensed Certified Public Accountant (CPA).\nJames Edward Burns is an executive who brings more than 25 years of experience to Petrolia Energys Board. He currently serves on a number of public and private company boards including Bon Natural Life Ltd, (NASDAQ: BON), TMT Acquisition Corp (NASDAQ: TMTC), Playmaker IQ, Dry States Water Solutions and Hearthstone Capital Inc. He served as President of BLU LNG, a domestic LNG provider until 2016. Prior to his role at BLU LNG, Mr. Burns was President of Fortress Energy Partners a division of Fortress Investment Group and worked in various executive roles globally at Royal Dutch Shell and Texaco. He holds a BS in Business Administration from California State University and an Executive MBA from the University of Houston.\nIvar Siem is the Chairman of American Resources Inc. (American). Mr. Siem previously also served as the Chairman and CEO of American and its predecessor from September 2000 to August 1, 2017. Mr. Siem has broad experience from both the upstream and the service segments of the oil and gas industry. He has been the founder of several companies and involved in multiple roll-ups and restructuring processes throughout his career. These include Fred Olsen, Inc., Dolphin International, Inc., Blue Dolphin Energy, Seateam Technology ASA, DI Industries/Grey Wolf Drilling, American Resources Offshore, Inc., and Equimavenca SA. He has served on a number of public and private company boards including Frupor SA, Avenir ASA, Wellcem AS, and Siem Industries, Inc. Since July 2018, Mr. Siem has served as a member of the Board of Directors of PEDEVCO Corp. (NYSE American:PED), a company with securities registered under the Exchange Act.\nOn September 1, 2020, Mark Allen was appointed President. On September 1, 2021, Mark Allen was promoted to Chief Executive Officer, when Zel Khan resigned from that position.\nOn February 1, 2021, Paul Deputy was appointed interim CFO. On June 15, 2022, Heather Monk was promoted from Corporate Controller to Interim Chief Financial Officer, replacing Paul Deputy.\nTerm of Office\nOur directors are appointed for a one-year term to hold office until the next annual general meeting of our shareholders or until removed from office in accordance with our bylaws. Our officers are appointed by our board of directors and hold office until removed by the board.\nCORPORATE GOVERNANCE\nThe Company promotes accountability for adherence to honest and ethical conduct; endeavors to provide full, fair, accurate, timely and understandable disclosure in reports and documents that the Company files with the SEC and in other public communications made by the Company; and strives to be compliant with applicable governmental laws, rules and regulations.\nBoard Leadership Structure\nThe roles of Chairman and Chief Executive Officer of the Company are currently held separately. Mr. Burns serves as Chairman and Mr. Allen serves as Chief Executive Officer. The Board of Directors does not have a policy as to whether the Chairman should be an independent director, an affiliated director, or a member of management. Our Board believes that the Companys current leadership structure is appropriate because it effectively allocates authority, responsibility, and oversight between management and the members of our Board. It does this by giving primary responsibility for the operational leadership and strategic direction of the Company to its Chief Executive Officer, while enabling our Chairman to facilitate our Boards oversight of management, promote communication between management and our Board, and support our Boards consideration of key governance matters. The Board believes that its programs for overseeing risk, as described below, would be effective under a variety of leadership frameworks and therefore do not materially affect its choice of structure.\nRisk Oversight\nEffective risk oversight is an important priority of the Board of Directors. Because risks are considered in virtually every business decision, the Board of Directors discusses risk throughout the year generally or in connection with specific proposed actions. The Board of Directors approach to risk oversight includes understanding the critical risks in the Companys business and strategy, evaluating the Companys risk management processes, allocating responsibilities for risk oversight, and fostering an appropriate culture of integrity and compliance with legal responsibilities. The directors exercise direct oversight of strategic risks to the Company.\nFamily Relationships\nNone of our directors are related by blood, marriage, or adoption to any other director, executive officer, or other key employees.\nArrangements Between Officers and Directors\nTo our knowledge, there is no arrangement or understanding between any of our officers and any other person, including directors, pursuant to which the officer was selected to serve as an officer.\nOther Directorships\nNo directors of the Company are also directors of issuers with a class of securities registered under Section 12 of the Exchange Act (or which otherwise are required to file periodic reports under the Exchange Act), except as discussed in their bios above.\nDirector Qualifications\nThe Board believes that each of our directors is highly qualified to serve as a member of the Board. Each of the directors has contributed to the mix of skills, core competencies and qualifications of the Board. When evaluating candidates for election to the Board, the Board seeks candidates with certain qualities that it believes are important, including integrity, an objective perspective, good judgment, and leadership skills. Our directors are highly educated and have diverse backgrounds and talents and extensive track records of success in what we believe are highly relevant positions.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our executive officers or directors has been involved in any of the following events during the past ten years:\n(1) any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n(2) any conviction in a criminal proceeding or being a named subject to a pending criminal proceeding (excluding traffic violations and minor offenses);\n(3) being subject to any order, judgment, or decree, not subsequently reversed, suspended, or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities;\n(4) being found by a court of competent jurisdiction (in a civil action), the SEC or the Commodities Futures Trading Commission to have violated a federal or state securities or commodities law;\n(5) being the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of (i) any Federal or State securities or commodities law or regulation; (ii) any law or regulation respecting financial institutions or insurance companies, including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or (iii) any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n(6) being the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act), any registered entity (as defined in Section (1a)(40) of the Commodity Exchange Act), or any equivalent exchange, association, entity, or organization that has disciplinary authority over its members or persons associated with a member.\nBoard of Directors Meetings\nThe Company had four (4) official meetings of the Board of Directors during the fiscal year 2021 and four (4) during the previous fiscal year ending December 31, 2020. All directors attended at least 75% of the meetings of the Board of Directors and meetings of Committees of the Board of Directors, for committees on which they served. The Company has not adopted a policy requiring its directors to attend its annual meeting.\nHedging, Clawbacks and Insider Trading Policies\nThe Company does not currently hedge any oil and gas products.\nInsider trading includes the trading of our stock and options (put and call), based on material, non-public information about the Company. The Company prohibits any insider trading shares based on insider information and could be exposed to potential civil and/or criminal penalties. It also prohibits the sharing of that information with other non-insider individuals. This policy applies to the purchase/sale of common stock and preferred stock. The Company prohibits the trading of options at any time, irrespective of stock trading restrictions. This policy applies to all directors, officers, employees, and consultants of the Company, as well as their family members. This policy imposes special additional temporary trading restrictions applicable to directors and officers of the Company.\nCOMMITTEES OF THE BOARD\nBoard Committee Membership\nIndependent Audit\nCommittee Compensation\nCommittee\nNominating and Corporate Governance Committee\nJames E. Burns (1)\nC\nLeo Womack X C\nM\nIvar Siem X M\nC\n(1) Chairman of Board of Directors.\nC - Chairman of Committee.\nM - Member.\nThe charter for each committee of the Board identified below is available on our website at www.petroliaenergy.com. Copies of the committee charters are also available for free upon written request to our Corporate Secretary. Additionally, the committee charters are filed as exhibits to our Current Report on Form 8-K, filed with the Securities and Exchange Commission on May 24, 2018 (the Form 8-K).\nAudit Committee\nThe Audit Committee, which is comprised exclusively of independent directors, has been established by the Board to oversee our accounting and financial reporting processes and the audits of our financial statements.\nThe Board has selected the members of the Audit Committee based on the Boards determination that the members are financially literate (as required by NASDAQ rules) and qualified to monitor the performance of management and the independent auditors and to monitor our disclosures so that our disclosures fairly present our business, financial condition, and results of operations.\nThe Board has also determined that Mr. Womack, is an audit committee financial expert (as defined in the SEC rules) because he has the following attributes: (i) an understanding of generally accepted accounting principles in the United States of America (GAAP) and financial statements; (ii) the ability to assess the general application of such principles in connection with accounting for estimates, accruals and reserves; (iii) experience analyzing and evaluating financial statements that present a breadth and level of complexity of accounting issues that are generally comparable to the breadth and complexity of issues that can reasonably be expected to be raised by our financial statements; (iv) an understanding of internal control over financial reporting; and (v) an understanding of audit committee functions. Mr. Womack has acquired these attributes by means of having held various positions that provided relevant experience, as described in his biographical above.\nThe Audit Committee has the sole authority, at its discretion and at our expense, to retain, compensate, evaluate and terminate our independent auditors and to review, as it deems appropriate, the scope of our annual audits, our accounting policies and reporting practices, our system of internal controls, our compliance with policies regarding business conduct and other matters. In addition, the Audit Committee has the authority, at its discretion and at our expense, to retain special legal, accounting, or other advisors to advise the Audit Committee.\nThe Audit Committee was formed on May 21, 2018.\nThe Audit Committee Charter is filed as Exhibit 99.3 to the Form 8-K filed on May 24, 2018.\nCompensation Committee\nThe Compensation Committee is responsible for the administration of our stock compensation plans, approval, review and evaluation of the compensation arrangements for our executive officers and directors and oversees and advises the Board on the adoption of policies that govern the Companys compensation and benefit programs. In addition, the Compensation Committee has the authority, at its discretion and at our expense, to retain special legal, accounting or other advisors to advise the Compensation Committee.\nThe Compensation Committee was formed on May 21, 2018.\nThe Compensation Committee Charter is filed as Exhibit 99.4 to the Form 8-K filed on May 24, 2018.\nOn July 13, 2020, when Joel Oppenheim resigned as Chairman of the Compensation Committee, James Burns replaced him as Chairman of the Compensation Committee.\nNominating and Corporate Governance Committee\nThe Nominating and Corporate Governance Committee, which is comprised exclusively of independent directors, is responsible for identifying prospective qualified candidates to fill vacancies on the Board, recommending director nominees (including chairpersons) for each of our committees, developing and recommending appropriate corporate governance guidelines and overseeing the self-evaluation of the Board.\nIn considering individual director nominees and Board committee appointments, our Nominating and Governance Committee seeks to achieve a balance of knowledge, experience and capability on the Board and Board committees and to identify individuals who can effectively assist the Company in achieving our short-term and long-term goals, protecting our stockholders interests and creating and enhancing value for our stockholders. In so doing, the Nominating and Governance Committee considers a persons diversity attributes (e.g., professional experiences, skills, background, race and gender) as a whole and does not necessarily attribute any greater weight to one attribute. Moreover, diversity in professional experience, skills and background, and diversity in race and gender, are just a few of the attributes that the Nominating and Governance Committee takes into account. In evaluating prospective candidates, the Nominating and Governance Committee also considers whether the individual has personal and professional integrity, good business judgment and relevant experience and skills, and whether such individual is willing and able to commit the time necessary for Board and Board committee service.\nWhile there are no specific minimum requirements that the Nominating and Governance Committee believes must be met by a prospective director nominee, the Nominating and Governance Committee does believe that director nominees should possess personal and professional integrity, have good business judgment, have relevant experience and skills, and be willing and able to commit the necessary time for Board and Board committee service. Furthermore, the Nominating and Governance Committee evaluates each individual in the context of the Board as a whole, with the objective of recommending individuals that can best perpetuate the success of our business and represent stockholder interests through the exercise of sound business judgment using their diversity of experience in various areas. We believe our current directors possess diverse professional experiences, skills and backgrounds, in addition to (among other characteristics) high standards of personal and professional ethics, proven records of success in their respective fields and valuable knowledge of our business and our industry.\nThe Nominating and Governance Committee uses a variety of methods for identifying and evaluating director nominees. The Nominating and Governance Committee also regularly assesses the appropriate size of the Board and whether any vacancies on the Board are expected due to retirement or other circumstances. In addition, the Nominating and Governance Committee considers, from time to time, various potential candidates for directorships. Candidates may come to the attention of the Nominating and Governance Committee through current Board members, professional search firms, stockholders or other persons. These candidates may be evaluated at regular or special meetings of the Nominating and Governance Committee and may be considered at any point during the year.\nThe Committee evaluates director nominees at regular or special Committee meetings pursuant to the criteria described above and reviews qualified director nominees with the Board. The Committee selects nominees that best suit the Boards current needs and recommends one or more of such individuals for election to the Board.\nThe Nominating and Governance Committee was formed on May 21, 2018.\nThe Nominating and Governance Committee Charter is filed as Exhibit 99.5 to the Form 8-K filed on May 24, 2018.\nStockholder Communications with the Board\nOur Company has defined policy and procedural requirements for stockholders to submit recommendations or nominations for directors as set forth in the Companys Bylaws and described below. Our Company does not currently have any specific or minimum criteria for the election of nominees to the Board of Directors and we do not have any specific process or procedure for evaluating such nominees. The Nominating and Governance Committee will assess all candidates, whether submitted by management or stockholders, and make recommendations for election or appointment.\nThe Nominating and Governance Committee will consider candidates recommended by stockholders, provided the names of such persons, accompanied by relevant biographical information, are properly submitted in writing to the Secretary of the Company in accordance with the manner described below. The Secretary will send properly submitted stockholder recommendations to the Nominating and Governance Committee. Individuals recommended by stockholders in accordance with these procedures will receive the same consideration received by individuals identified to the Nominating and Governance Committee through other means. The Nominating and Governance Committee also may, in its discretion, consider candidates otherwise recommended by stockholders without accompanying biographical information, if submitted in writing to the Secretary.\nOur stockholders and other interested parties may communicate with members of the Board of Directors by submitting such communications in writing to our Corporate Secretary, 710 N. Post Oak Rd., Suite 400, Houston, Texas 77024, who, upon receipt of any communication other than one that is clearly marked Confidential, will note the date the communication was received, open the communication, make a copy of it for our files and promptly forward the communication to the director(s) to whom it is addressed. Upon receipt of any communication that is clearly marked Confidential, our Corporate Secretary will not open the communication, but will note the date the communication was received and promptly forward the communication to the director(s) to whom it is addressed. If the correspondence is not addressed to any particular Board member or members, the communication will be forwarded to a Board member to bring to the attention of the Board.\nCode of Conduct\nWe have adopted a Code of Ethical Business Conduct (Code of Conduct ) that applies to all of our directors, officers and employees.\nAny stockholder who so requests may obtain a free copy of our Code of Conduct by submitting a written request to our Corporate Secretary. Additionally, the Code of Conduct was filed as an exhibit to the Companys Quarterly Report on Form 10-Q for the quarter ended September 30, 2015, filed with the SEC on November 23, 2015, as Exhibit 14.1.\nWe intend to disclose any amendments to our Code of Conduct and any waivers with respect to our Code of Conduct granted to our principal executive officer, our principal financial officer, or any of our other employees performing similar functions on our website at www.petroliaenergy.com within four business days after the amendment or waiver. In such case, the disclosure regarding the amendment or waiver will remain available on our website for at least 12 months after the initial disclosure. There have been no waivers granted with respect to our Code of Conduct to any such officers or employees.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires our directors and executive officers and persons who beneficially own more than ten percent of a registered class of the Companys equity securities to file with the SEC initial reports of ownership and reports of changes in ownership of common stock and other equity securities of the Company. Officers, directors and greater than ten percent beneficial shareholders are required by SEC regulations to furnish us with copies of all Section 16(a) forms they file.\nPursuant to SEC rules, we are not required to disclose in this filing any failure to timely file a Section 16(a) report that has been disclosed by us in a prior annual report or proxy statement. ITEM 11. EXECUTIVE COMPENSATION\nThe following table sets forth information concerning the compensation of (i) all individuals serving as our principal executive officer (PEO) or acting in a similar capacity during the last completed fiscal year, regardless of compensation level; (ii) our two most highly compensated executive officers other than the PEO who were serving as executive officers at the end of the last completed fiscal year and who were paid more than $100,000 of total compensation; and (iii) up to two additional individuals for whom disclosure would have been provided pursuant to paragraph (ii) but for the fact that the individual was not serving as an executive officer at the end of the last completed fiscal year (collectively, the Named Executive Officers).\nThe following table summarizes all compensation paid or accrued to our former or current executive officers during the years ended December 31, 2021, and December 31, 2020:\nName and Principal Position Fiscal Year Compensation (1) Bonus (2) Stock Awards (3) Option and Warrant Awards (4) All Other Compensation (5) Total\nMark Allen\n(Chief Executive Office (former President) (6) $ 180,000 $ - $ - $ - $ 23,847 $ 203,847\n$ 60,000 $ - $ 70,000 $ - $ - $ 130,000\nZel Khan (Former Chief Executive Officer) (7)\n$ 96,000\n$ - $ -\n$ -\n$ -\n$ 96,000\n$ -\n$ -\n$ - $ 28,354\n$ - $ 28,354\nHeather Monk (Interim Chief Financial Officer) (8)\n$ 15,000\n$ -\n$ -\n$ -\n$ -\n$ 15,000\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nDoes not include perquisites and other personal benefits unless the aggregate amount of such compensation is more than $10,000. None of our executive officers received any change in pension value and nonqualified deferred compensation earnings during the periods presented.\n(1) The dollar value of compensation (cash and non-cash) earned. Executive salaries in 2021 and 2020 were generally accrued but not paid.\n(2) The dollar value of bonus (cash and non-cash) earned.\n(3) The fair value of stock issued for services computed in accordance with ASC 718 on the date of grant.\n(4) The fair value of options and warrants granted computed in accordance with ASC 718 on the date of grant.\n(5) All other compensation received that we could not properly report in any other column of the table.\n(6) On September 1, 2020, the Board of Directors approved a contractual Consulting Agreement between the Company and Mark Allen to appoint him as the new President of the Company. In September of 2021 he was appointed Chief Executive Officer.\n(7) Zel Khan was appointed as President and Chief Executive Officer of the Company on March 1, 2015. Mr. Khan resigned as Chief Executive Officer in September 2021.\n(8) Heather Monk joined the company as a part-time consultant in October of 2021. She became a full-time consultant in April 2022 and was promoted to interim Chief Financial Officer in June 2022.\nWe do not provide our officers or employees with pension, stock appreciation rights, long-term incentive, profit sharing, retirement, or other plans, although we may adopt one or more of such plans in the future.\nWe do not maintain any life or disability insurance on any of our officers.\nEmployment Agreements\nZel C. Khan (Former CEO)\nOn September 23, 2015, Zel C. Khan, entered into an employment agreement with the Company effective October 1, 2015 to serve as our President and Chief Executive Officer for an initial term of twenty-four (24) months (automatically renewable thereafter for additional one-year terms), which agreement automatically extended from October 1, 2017 to September 30, 2018 and from October 1, 2018 to September 30, 2019. The agreement provides that the Company will pay Mr. Khan an annual base salary of $160,000, with a provision for deferral of current payments until such time that the Company is cash flow positive. The Company will issue one warrant to purchase one share of the Companys restricted common stock at an exercise price of $0.20 per share for each dollar of gross salary that is deferred. The Warrants will have a term of 36 months from date of grant, which will vest quarterly.\nIn the event Mr. Khans employment is terminated by the Company without cause, he is required to receive severance pay equal to two months of his base salary. Cause means (i) the commission of a felony or other crime involving moral turpitude or the commission of any other act or omission involving misappropriation, dishonesty, unethical business conduct, disloyalty, fraud or breach of fiduciary duty, (ii) reporting to work under the influence of alcohol, (iii) the use of illegal drugs (whether or not at the workplace) or other conduct, which could reasonably be expected to, or which does, cause the Company or any of its affiliates public disgrace or disrepute or economic harm, (iv) repeated failure to perform duties as reasonably directed by the Board of Directors, (v) gross negligence or willful misconduct with respect to the Company or its affiliates or in the performance of Mr. Khans duties under the agreement, (vi) obtaining any personal profit not thoroughly disclosed to and approved by the board in connection with any transaction entered into by, or on behalf of, the Company or any of its affiliates, or (vii) violating any of the terms of the Companys or its affiliates rules or policies applicable to Mr. Khan which, if curable, is not cured to the boards reasonable satisfaction within fifteen (15) days after written notice thereof to Mr. Khan, or any other material breach of the agreement or any other agreement between Mr. Khan and the Company or any of its affiliates which, if curable, is not cured to the boards reasonable satisfaction within fifteen (15) days after written notice thereof to Mr. Khan.\nThe employment agreement includes a non-solicitation/non-interference clause which applies for two years after the termination date of the employment agreement. The employment agreement also requires Mr. Khan to submit to the board all business, commercial and investment opportunities or offers presented to Mr. Khan or of which Mr. Khan becomes aware which relate to the business of the Company or its affiliates.\nThe Chairman of the Board of Directors accepted the resignation of Chief Executive Officer, Zel C. Khan, effective September 1, 2021.\nMark Allen (CEO)\nOn September 1, 2020, the Board of Directors approved a Consulting Agreement between the Company and Mark Allen to appoint him as the new President of the Company. Mr. Allens contract term is 6 months, with a cash payment of $90,000 in equal monthly installments of $15,000, including an option to extend. In addition, Mr. Allen is due to receive incentive compensation of 2,000,000 shares of common stock (1,000,000 at signing and the remaining at the end of the contract period). He also is to receive 1,000,000 warrants at $0.08 per share that expire in 36 months and vest over a two-year period. The cash portion of Mr. Allens contract was generally accrued but not paid.\nOn September 1, 2021, the Board of Directors approved a Consulting Agreement between the Company and Mark Allen to appoint him as the CEO of the Company.\nDirector Compensation\nThe table below summarizes all compensation of our directors for the year ended December 31, 2021.\nName Fees Earned or Paid in Cash (1) Stock Awards (2)(3) Option and Warrant Awards (4) Non-Equity Incentive Plan Compensation Non-Qualified Deferred Compensation Earnings All Other Compensation Total ($)\nJames E. Burns $ 71,000 $ 50,799 $ 19,625 $ - $ - $ 21,733 (5) $ 163,157\nLeo Womack $ - $ 50,799 $ 19,625 $ - $ - $ - $ 70,424\nIvar Siem $ - $ 50,799 $ 19,625 $ - $ - $ - $ 70,424\nThe notes below summarizes all compensation of our directors for the year ended December 31, 2021.\n(1) Fees earned due to retainers, meetings, committees, and chairman services. These fees were not paid in cash to date but were accrued.\n(2) The fair value of stock issued for services computed in accordance with ASC 718 on the date of grant.\n(3) Each director was awarded one share of Series B Preferred Stock on October 25, 2021. The shares were valued at $50,799 each. See note 10. EQUITY for further information.\n(4) The fair value of warrants granted computed in accordance with ASC 718 on the date of the grant.\n(5) Payment for health insurance benefits was included in James Burns employment agreement.\nThe fair value of stock issued for services computed in accordance with Financial Accounting Standards Board Accounting Standards Codification Topic 718 on the date of grant. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth certain information regarding the beneficial ownership of our common stock and preferred stock by (i) each person who is known by the Company to own beneficially more than five percent (5%) of our outstanding voting stock; (ii) each of our directors and director nominees; (iii) each of our executive officers and significant employees; and (iv) all of our current executive officers, significant employees and directors as a group, as of December 9, 2022 (the Date of Determination).\nBeneficial ownership is determined in accordance with the rules of the SEC and includes voting and/or investing power with respect to securities. These rules generally provide that shares of common stock subject to options, warrants or other convertible securities that are currently exercisable or convertible, or exercisable or convertible within 60 days of the Date of Determination, are deemed to be outstanding and to be beneficially owned by the person or group holding such options, warrants or other convertible securities for the purpose of computing the percentage ownership of such person or group, but are not treated as outstanding for the purpose of computing the percentage ownership of any other person or group.\nWe believe that, except as otherwise noted and subject to applicable community property laws, each person named in the following table has sole investment and voting power with respect to the shares of common stock shown as beneficially owned by such person. Unless otherwise indicated, the address for each of the officers or directors listed in the table below is 710 N. Post Oak Rd., Suite 400, Houston, Texas 77024.\nNumber of Common\nStock Shares (1)\nPercent of\nCommon Stock (2) Number of Series A\nConvertible Preferred\nStock Shares\nPercent of\nSeries A\nConvertible\nPreferred Stock (2)\nNumber of Series C\nConvertible Preferred\nStock Shares\nPercent of\nSeries C\nConvertible\nPreferred Stock (2)\nTotal\nBeneficial Ownership\nPercent of Total Voting Shares (3) (12)\nNamed Executive Officers and Directors\nLeo Womack 5,862,500 (4) 3.3 % 8,400 4.2 % 5,000 45.5 % 6,962,504 3.6 %\nJames E. Burns 7,904,566 (5) 4.5 % 16,400 8.2 %\n8,907,987 4.6 %\nIvar Siem 4,854,167 (6) 2.7 %\n4,854,167 2.5 %\nMark Allen 16,035,778 (7) 9.1 %\n16,035,778 8.3 %\nAll Named Executive Officers and Directors as a Group (4 persons) 34,657,011 19.6 % 24,800 12.4 % 5,000 45.5 % 37,760,436 19.0 %\n5% Stockholders\nCommon Stock\nQuinten Beasley 9,706,172 (8) 5.5 %\n9,706,172 5.0 %\nZel Khan 46,365,575 (9) 26.2 % 24,410 12.3 %\n46,365,575 24.1 %\nJoel Oppenheim 12,271,613 (10) 6.9 % 20,490 10.3 %\n12,271,613 6.4 %\nSeries A Convertible Preferred Stock\nRick Wilber 3,070,000 (11) 1.7 % 55,000 27.6 % 5,000 45.5 % 7,498,595 3.9 %\nUnder Rule 13d-3 of the Exchange Act, a beneficial owner of a security includes any person who, directly or indirectly, through any contract, arrangement, understanding, relationship, or otherwise has or shares: (i) voting power, which includes the power to vote, or to direct the voting of shares, and/or (ii) investment power, which includes the power to dispose or direct the disposition of shares. Also under this rule, certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire shares (for example, upon exercise of an option or warrant) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the number of shares is deemed to include the number of shares beneficially owned by such person by reason of such acquisition rights. As a result, the percentage of outstanding shares of any person as shown in the above table does not necessarily reflect the persons actual voting power at any particular date.\n(1) Not including shares of common stock issuable upon conversion of outstanding shares of Series A Preferred Stock and Series C Preferred Stock held by each holder.\n(2) Except as otherwise indicated, all shares are owned directly, and the percentage shown is based on 176,988,322 shares of common stock and 199,100 shares of Series A Convertible Preferred Stock and 8,500 shares of Series C Convertible Preferred Stock issued and outstanding as of the Date of Determination. The Series A Preferred Stock (and accrued and unpaid dividends thereon) are convertible into shares of common stock of the Company on a 71.429-for-one basis. The Series A and C Preferred Stock includes a blocker prohibiting the conversion of the Series A or C Preferred Stock into common stock of the Company, if upon such conversion/exercise the holder thereof would beneficially own more than 4.999% of the Companys then outstanding common stock, provided such limitation shall not apply in the event of an automatic conversion of the Series A or C Preferred Stock (the Beneficial Ownership Limitation). The Beneficial Ownership Limitation also limits the voting rights of any holders of the Series A or C Preferred Stock, the effects of which have been reflected in the table above. The Beneficial Ownership Limitation may be waived by any holder with 61 days prior written notice to the Company.\n(3) Includes all shares of common stock beneficially owned by each named person, all shares of common stock issuable upon exercise of warrants which have vested, or which will vest within 60 days of the Date of Determination to the named person, and all shares of common stock issuable upon conversion of Series A and C Preferred Stock held by the named person, subject to the Beneficial Ownership Limitation.\n(4) Includes all shares of common stock beneficially owned by Mr. Womack and the Leo B. Womack Family Trust, which Mr. Womack is deemed to beneficially own (the Trust), all shares of common stock issuable upon exercise of warrants which have vested or which will vest within 60 days of the Date of Determination to Mr. Womack and the Trust, and for the Total Beneficial Ownership column, shares of common stock issuable upon conversion of outstanding shares of Series A and C Preferred Stock held by Mr. Womack and the Trust, subject to the Beneficial Ownership Limitation.\n(5) Includes all shares of common stock beneficially owned by Mr. Burns, all shares of common stock issuable upon exercise of warrants which have vested, or which will vest within 60 days of the Date of Determination to Mr. Burns, and for the Total Beneficial Ownership column, shares of common stock issuable upon conversion of outstanding shares of Series A Preferred Stock held by Mr. Burns, subject to the Beneficial Ownership Limitation.\n(6) Includes all shares of common stock beneficially owned by Mr. Siem and American Resources Offshore Inc. (American Resources) and all shares of common stock issuable upon exercise of warrants which have vested, or which will vest within 60 days of the Date of Determination to Mr. Siem and American Resources. Mr. Siem is deemed to beneficially own the securities held by American Resources due to his position as Director and CEO of American Resources.\n(7) Includes all shares of common stock and warrants to purchase shares of common stock held by Mr. Allen, which have vested, or which will vest within 60 days of the Date of Determination.\n(8) Address: 7941 Katy Fwy, Suite 522, Houston, Texas 77024. Includes all shares of common stock beneficially owned by Mr. Beasley, Critical Communication LLC (Critical), all shares of common stock issuable upon exercise of warrants which have vested, or which will vest within 60 days of the Date of Determination to Mr. Beasley, Critical. Mr. Beasley is deemed to beneficially own the securities held by Critical due to his position as Managing Director of Critical.\n(9) Address: 7941 Katy Fwy, Suite 522, Houston, Texas 77024. Includes all shares of common stock beneficially owned by Mr. Khan and Jovian Petroleum Corporation (Jovian), all shares of common stock issuable upon exercise of warrants which have vested or which will vest within 60 days of the Date of Determination to Mr. Khan and Jovian, and for the Total Beneficial Ownership column, shares of common stock issuable upon conversion of outstanding shares of Series A Preferred Stock held by Mr. Khan and Jovian, subject to the Beneficial Ownership Limitation. Mr. Khan is deemed to beneficially own the securities held by Jovian due to his position as President of Jovian.\n(10) Includes all shares of common stock beneficially owned by Mr. Oppenheim, all shares of common stock issuable upon exercise of warrants which have vested, or which will vest within 60 days of the Date of Determination to Mr. Oppenheim, and for the Total Beneficial Ownership column, shares of common stock issuable upon conversion of outstanding shares of Series A Preferred Stock held by Mr. Oppenheim, subject to the Beneficial Ownership Limitation.\n(11) Address: 10360 Kestrel Street, Plantation, Florida, 33324.\n(12) On October 25, 2021, the Board of Directors of the Company approved the filing of a Certificate of Designations of Petrolia Energy Corporation Establishing the Designations, Preferences, Limitations, and Relative Rights of its Series B Preferred Stock with the Secretary of State of Texas, which designation was filed with, and became effective with, the Secretary of State of Texas on October 25, 2021. The Series B Designation designated three shares of Series B Preferred Stock. The Company issued one share of its newly designated shares of Series B Preferred Stock to each of the three members of its then Board of Directors, (1) James E. Burns, (2) Leo Womack and (3) Ivar Siem, in consideration for services rendered to the Company as members of the Board of Directors. Such shares of Series B Preferred Stock vote in aggregate sixty percent (60%) of the total vote on all shareholder matters, voting separately as a class.\nChanges in Control\nThe Company is not aware of any arrangements, which may at a subsequent date result in a change of control of the Company. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nExcept as discussed below or otherwise disclosed above under Item 11. Executive Compensation,, Note 7 - Related Party Notes Payable, Note 10 - Equity and Note 11 - Related Party Transactions, of the consolidated audited financial statements included herein, all of which information is incorporated by reference into this Item 13, there have been no transactions since the beginning of the Companys last fiscal year, and there is not currently any proposed transaction, in which the Company was or is to be a participant, where the amount involved exceeds the lesser of $120,000 or one percent of the average of the Companys total assets at year end, for the last two completed fiscal years, and in which any officer, director, or any stockholder owning greater than five percent (5%) of our outstanding voting shares, nor any member of the above referenced individuals immediate family, had or will have a direct or indirect material interest.\nOn August 1, 2017, Mr. Joel Oppenheim provided a Letter of Credit (LOC), which was posted as collateral in order for the Company to issue operating bonds with the State of New Mexico for the operation of Twin Lakes San Andres Unit wells. In exchange for the LOC, the Company issued Mr. Oppenheim 2,000,000 shares of common stock valued at $246,000 and warrants to purchase 2,000,000 shares of common stock with an exercise price of $0.14 per share.\nOn August 21, 2019, the Company closed private placements with related parties for gross proceeds of $150,000, consisting of 1,875,000 shares of common stock and 3,750,000 warrants to purchase shares of common stock, exercisable at a price of $0.10 per share at any time prior to November 1, 2020. American Resources Offshore Inc. (of which Ivar Siem, our director) subscribed for 312,500 shares of common stock and warrants to purchase 625,000 shares of common stock. Leo Womack, our director, subscribed for 312,500 shares of common stock and warrants to purchase 625,000 shares of common stock. Jovian Petroleum Corporation, a greater than 5% shareholder of the Company, subscribed for 625,000 shares of common stock and warrants to purchase 1,250,000 shares of common stock. Joel Martin Oppenheim subscribed for 625,000 shares of common stock and warrants to purchase 1,250,000 shares of common stock.\nOn October 25, 2021, the Board of Directors of the Company approved the filing of a Certificate of Designations of Petrolia Energy Corporation Establishing the Designations, Preferences, Limitations, and Relative Rights of its Series B Preferred Stock with the Secretary of State of Texas, which designation was filed with, and became effective with, the Secretary of State of Texas on October 25, 2021. The Series B Designation designated three shares of Series B Preferred Stock. The Company issued one share of its newly designated shares of Series B Preferred Stock to each of the three members of its then Board of Directors, (1) James E. Burns, (2) Leo Womack and (3) Ivar Siem, in consideration for services rendered to the Company as members of the Board of Directors. Such shares of Series B Preferred Stock vote in aggregate sixty percent (60%) of the total vote on all shareholder matters, voting separately as a class. The purpose of issuing the three Series B Preferred shares is to protect the company while the disputes described in the Form 8-K Current Report, filed on March 18, 2022, are heard and resolved through the U.S. court system. The Series B Preferred shares will be retired once the litigation is resolved.\nIn October and November of 2021, and January 2022, the Company entered into various subscription agreements with certain accredited investors, pursuant to which the Subscribers agreed, subject to certain conditions in the Subscription Agreements, to purchase an aggregate amount of 11,000 shares of the Companys newly designated shares of Series C Convertible Preferred Stock, par value $0.10 per share at $10.00 per share. Investors in the offering include the Companys director, Leo Womack, who purchased $50,000 in shares of Series C Preferred Stock (5,000 shares).\nReview, Approval and Ratification of Related Party Transactions\nOn August 22, 2018, the Company adopted a formal related party transaction policy (the Policy) for the review, approval, or ratification of transactions, such as those described above, with our directors, nominees for director, executive officers and significant shareholders or certain entities or persons related to them.\nUnder the terms of the Policy, the Audit Committee shall review the material facts of all related party transactions and may approve or disapprove of the entry into the related party transaction. Where advance Audit Committee review of a related party transaction is not feasible or has otherwise not been obtained, then the related party transaction shall be reviewed subsequently by the Audit Committee (and such transaction may be ratified subsequently by the Audit Committee). The Audit Committee may also disapprove of a previously entered into related party transaction and may require that management of the Company take all reasonable efforts to terminate, unwind, cancel or annul the related party transaction. The Audit Committee shall be authorized to review in advance and provide standing pre-approval in advance of certain related party transactions or categories of related party transactions which include employment of executive officers, director compensation and others. The Audit Committee or the Board of Directors may recommend the creation of a special Audit Committee to review any related party transaction.\nEach officer and/or director who is a related party with respect to a particular related party transaction shall disclose all material information to the Audit Committee concerning such related party transaction and his or her interest in such transaction. Any member of the Audit Committee who has a potential interest in any related party transaction shall recuse himself or herself and abstain from voting on the approval or ratification of the related party transaction but may participate in all or a portion of the Audit Committees discussions of the related party transaction, if requested by the Audit Committee.\nIn connection with its review of a related party transaction, the Audit Committee shall take into account, among other factors it deems appropriate, including the following factors, among others, to the extent relevant to the related party transaction:\n● Whether the terms of the related party transaction are fair to the Company and would apply on the same basis if the transaction did not involve a related party, i.e., whether the terms of the transaction would be the same if the transaction was undertaken on an arms-length basis;\n● Whether there are any compelling business reasons for the Company to enter into the related party transaction and the nature of alternative transactions, if any;\n● Whether the related party transaction would impair the independence of an otherwise independent director or nominee for director;\n● Whether the Company was notified about the related party transaction before its commencement and if not, why pre-approval was not sought and whether subsequent ratification would be detrimental to the Company; and\n● Whether the related party transaction would present an improper conflict of interest for any related party, taking into account the size of the transaction, the overall financial position of the related party, the direct or indirect nature of the related partys interest in the transaction and the ongoing nature of any proposed relationship and any other factors the Audit Committee deems relevant.\nIf a related party transaction will be ongoing, the Audit Committee may establish guidelines for the Companys management to follow in its ongoing dealings with the related party. Thereafter, the Audit Committee shall periodically review and assess ongoing relationships with the related party. Any material amendment, renewal or extension of a transaction, arrangement or relationship previously reviewed under the Policy shall also be subject to subsequent review under the Policy.\nIn addition to guidelines for ongoing related party transactions, the Audit Committee may, as it deems appropriate and reasonable, establish from time-to-time guidelines regarding the review of other related party transactions including those that (i) involve de minimus amounts, (ii) do not require public disclosure, or (iii) involve transactions that have primarily a charitable purpose.\nDirector Independence\nOur common stock was quoted for trading on the OTC Pink Sheet market operated by OTC Markets Group and we are not required to have independent members of our Board of Directors pursuant to OTC Pink Sheet market rules. Notwithstanding that we currently consider Leo Womack and Ivar Siem as independent directors. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nOur independent public accounting firm is M&K CPAS, PLLC, Houston, Texas, PCAOB Auditor ID #2738.\nM&K CPAS, PLLC (M&K) served as our independent registered public accounting firm for the years ended December 31, 2021, and December 31, 2020. The following table shows the aggregate fees billed to us for these years by M&K.\nYear Ended\nDecember 31,\nAudit Fees $ 40,000 $ 27,000\nAudit-Related Fees - -\nTax Fees - -\nAll Other Fees - -\nTotal $ 40,000 $ 27,000\nAudit fees represent amounts billed for professional services rendered for the audit of our annual consolidated financial statements and the reviews of the financial statements included in our Form 10-Q reports. Prior to contracting with M&K to render audit or non-audit services, each engagement was approved by our directors.\nIt is the policy of our Board of Directors that all services to be provided by our independent registered public accounting firm, including audit services, and permitted audit-related and non-audit services, must be pre-approved by our Board of Directors. Our Board of Directors pre-approved all services, audit and non-audit related, provided to us by M&K for 2020 and 2021.\nTo assure continuing auditor independence, the Board of Directors periodically considers the independent auditors qualifications, performance and independence and whether there should be a regular rotation of our independent external audit firm.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nAudited Financial Statements for Years Ended December 31, 2021 and 2020\nReport of Independent Registered Public Accounting Firms (PCAOB ID: 2738)\nConsolidated Balance Sheets as of December 31, 2021 and 2020\nConsolidated Statements of Operations and Comprehensive Loss for the Years Ended December 31, 2021 and 2020\nConsolidated Statements of Cash Flows for the Years Ended December 31, 2021 and 2020\nConsolidated Statement of Changes in Stockholders Equity (Deficit) and Comprehensive Loss for the Years Ended December 31, 2021 and 2020\nNotes to Consolidated Financial Statements\n(2) Financial Statement Schedules\nAll financial statement schedules have been omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the consolidated financial statements and notes thereto included in this Form 10-K.\n(3) Exhibits required by Item 601 of Regulation S-K\nIncorporated by Reference\nExhibit\nNumber\nFiled or\nFurnished\nHerewith\nForm\nExhibit Number\nFiling Date/ Period End Date\nFile No.\n04.01\nExhibit 4.1 - Description of Companys Capital Stock\n10-Q\n04.01\n06/30/2019\n10.01\n$500,000 Convertible Promissory Note dated April 1, 2018 entered into with Blue Sky International Holdings Inc.\n10-K\n10.01\n12/30/2017\n000-52690\n10.02\nAmended Revolving Line of Credit Agreement with Jovian Petroleum Corporation dated February 9, 2018 and amended April 12, 2018\n10-K\n10.02\n12/30/2017\n000-52690\n10.03\nSeparation and Release Agreement dated April 19, 2018, by and between James E. Burns and Petrolia Energy Corporation\n8-K\n10.03\n5/1/2018\n000-52690\n10.04\nChairman Offer Letter dated April 20, 2018, by and between James E. Burns and Petrolia Energy Corporation\n8-K\n10.04\n5/1/2018\n000-52690\n10.05\nWarrant to Purchase Common Stock, evidencing warrants to purchase 5,000,000 shares of common stock granted to James E. Burns on April 19, 2018\n8-K\n10.05\n5/1/2018\n000-52690\n10.06\nTariq Chaudhary Offer Letter dated January 12, 2018\n10-Q\n10.06\n3/31/2018\n000-52690\n10.07\nBukit Energy Inc. $500,000 Promissory Note dated August 31, 2017 and amendment\n10-Q\n10.07\n3/31/2018\n000-52690\n10.08\nMemorandum of Understanding between Blue Sky Resources Ltd. and Petrolia Energy Corporation dated June 29, 2018\n8-K\n10.08\n7/6/2018\n000-52690\n10.09\nConveyance between Blue Sky Resources Ltd. and Petrolia Energy Corporation dated June 29, 2018\n8-K\n10.09\n7/6/2018\n000-52690\n10.10\nCAD $406,181 Promissory Note by Petrolia Energy Corporation in favor of Blue Sky Resources Ltd. dated June 8, 2018\n8-K\n10.10\n7/6/2018\n000-52690\n10.11\nEJL Debt Repayment Agreement effective July 31, 2018, by and between Petrolia Energy Corporation and Blue Sky Resources Ltd (incorporated by reference to Schedule 2A of the Share Exchange Agreement incorporated by reference herewith as Exhibit 2.3)\n8-K\n10.11\n9/5/2018\n000-52690\n10.12\nAssignment of 20% BOW EIH effective July 31, 2018, by and between Petrolia Energy Corporation and Bow Energy Ltd. (incorporated by reference to Schedule 3 of the Share Exchange Agreement incorporated by reference herewith as Exhibit 2.3)\n8-K\n10.12\n9/5/2018\n000-52690\n10.13\nAssignment of Petrolia Royalty effective July 31, 2018, by and between Petrolia Energy Corporation and Bow Energy Ltd. (incorporated by reference to Schedule 4 of the Share Exchange Agreement incorporated by reference herewith as Exhibit 2.3)\n8-K\n10.13\n9/5/2018\n000-52690\n10.14\nPetrolia Carry Agreement, by and between Petrolia Energy Corporation and Bow Energy Ltd. (incorporated by reference to Schedule 5 of the Share Exchange Agreement incorporated by reference herewith as Exhibit 2.3)\n8-K\n10.14\n9/5/2018\n000-52690\n10.15\nForm of 12% Bridge Note - 2018\n8-K\n10.15\n9/5/2018\n000-52690\n10.16\nPurchase and Sale Agreement dated and effective November 1, 2018, by and between Petrolia Energy Corporation and Crossroads Petroleum L.L.C.\n10-Q\n10.16\n9/30/2018\n000-52690\n10.17\n$240,000 Promissory Note dated November 2, 2018, by Crossroads Petroleum L.L.C. in favor of Petrolia Energy Corporation\n10-Q\n10.17\n9/30/2018\n000-52690\n10.18\nLoan Agreement dated September 17, 2018 with Emmett Lescroart\n10-Q\n10.18\n9/30/2018\n000-52690\n10.19\nPurchase and Sale Agreement dated and effective August 6, 2019, by and between Petrolia Energy Corporation and FlowTex Energy LLC\n10-Q\n10.19\n06/30/19\n10.20\nJovian Petroleum Corporation Line of Credit Extension, dated December 31, 2019\n10-Q\n10.20\n06/30/2019\n10.21\nEmployment Agreement - Mark Allen dated September 1, 2020\n8-K\n10.21\n09/1/2020\n10.22\nExecutive Salary Payment Agreement - Zel Khan dated January 11, 2021\n10-Q\n10.22\n06/30/2019\n10.23\nUtikuma Letter Agreement between BSR and Petrolia dated June 29, 2020\n10-Q\n10.23\n06/30/2019\n10.24\nExecutive Salary Payable Agreement - Mark Allen dated March 30, 2021\n10-Q\n10.24\n06/30/2019\n10.25\nDebt to Equity Conversion Agreement - Mark Allen dated March 30, 2021\n10-Q\n10.25\n06/30/2019\n10.26\nSettlement and Mutual Release Agreement - Paul Deputy dated January 29, 2021\n10-Q\n10.26\n06/30/2019\n10.27\nSettlement with Argonaut Insurance Company\n8-K\n10.27\n01/14/22\n10.28\nPurchase and Sale Agreement and Debt Settlement with Prospera Energy\n8-K\n10.28\n02/28/22\n10.29\nSeries C Convertible Preferred Stock\n8-K\n10.29\n03/03/22\n10.30\nLawsuit against Jovian Petroleum, Zel Khan and Quinten Beasley\n8-K\n10.30\n03/18/22\n10.31\nNotice of Assignment - Emmett Lescroart loan to Petrolia Canada Corporation\n10-Q\n10.31\n03/31/2021\n10.32\nAmended Loan Agreement - Emmett Lescroart - The Prospera/Cona Assets - dated January 27, 2021\n10-Q\n10.32\n03/31/2021\n10.33\nAmended Loan Agreement - Emmett Lesroart - The Utikuma Asset - dated January 27, 2021\n10-Q\n10.33\n03/31/2021\n10.34\nAmended Loan Agreement - Joel Oppenheim - dated February 12, 2021\n10-Q\n10.34\n03/31/2021\n10.35\nAmended Loan Agreement - Ivar Siem/American Resources/Drillmar - dated January 1, 2021\n10-Q\n10.35\n03/31/2021\n10.36\nAmended Loan Agreement - Mark Allen - dated January 1, 2021\n10-Q\n10.36\n03/31/2021\n14.1\nCode of Ethical Business Conduct\n10-Q\n14.1\n9/30/2015\n000-52690\n14.2\nWhistleblower Protection Policy\n8-K\n14.1\n5/24/2018\n000-52690\n14.3\nInsider Trading Policy\n10-Q\n14.3\n06/30/2019\n14.4\nRelated Party Transaction Policy\n10-Q\n14.4\n06/30/2019\n21.1*\nSubsidiaries\nX\n23.1*\nConsent of MKM Engineering dated September 1, 2022\nX\n31.1*\nCertification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n31.2*\nCertification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n32.1**\nCertification pursuant to Section 906 of the Sarbanes-Oxley Act\nX\n32.2**\nCertification pursuant to Section 906 of the Sarbanes-Oxley Act\nX\n99.1*\nAppraisal of certain Oil and Gas interests owned by Petrolia Energy Corporation located in Alberta Canada as of December 31, 2021, dated August 26, 2022\nX\n99.2*\nAppraisal of certain Oil and Gas interests owned by Petrolia Energy Corporation located in Chaves County, New Mexico as of December 31, 2021, dated August 30, 2022\nX\n99.3\nCharter of the Audit Committee\n8-K\n99.1\n5/24/2018\n000-52690\n99.4\nCharter of the Compensation Committee\n8-K\n99.2\n5/24/2018\n000-52690\n99.5\nCharter of the Nominating and Corporate Governance Committee\n8-K\n99.3\n5/24/2018\n000-52690\n99.6*\nAppraisal of certain Oil and Gas interests owned by Petrolia Energy Corporation located in Creek County, Oklahoma as of December 31, 2021, dated August 31, 2022\nX\n101.INS+\nInline XBRL Instance Document\nX\n101.SCH+\nInline XBRL Taxonomy Extension Schema Document\nX\n101.CAL+\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nX\n101.DEF+\nInline XBRL Taxonomy Extension Definition Linkbase Document\nX\n101.LAB+\nInline XBRL Taxonomy Extension Label Linkbase Document\nX\n101.PRE+\nInline XBRL Taxonomy Presentation Linkbase Document\nX\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nX\nITEM 16. FORM 10-K SUMMARY.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPETROLIA ENERGY CORPORATION\nBy: /s/ Mark Allen\nMark Allen\nChief Executive Officer\n(Principal Executive Officer)\nDate: December 9, 2022\nBy: /s/ Heather Monk\nHeather Monk\nInterim Chief Financial Officer\n(Principal Financial/Accounting Officer)\nDate: December 9, 2022\nPursuant to the requirements of the Securities Exchange Act of l934, this Report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Mark Allen\nChief Executive Officer\nMark Allen\n(Principal Executive Officer)\nDecember 9, 2022\n/s/ Heather Monk\nInterim Chief Financial Officer\nHeather Monk\n(Principal Financial/Accounting Officer)\nDecember 9, 2022\n/s/ Leo Womack\nLeo Womack\nDirector\nDecember 9, 2022\n/s/ James E. Burns\nJames E. Burns\nDirector\nDecember 9, 2022\n/s/ Ivar Siem\nIvar Siem\nDirector\nDecember 9, 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nPetrolia Energy Corporation\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Petrolia Energy Corporation (the Company) as of December 31, 2021 and 2020, and the related consolidated statements of operations and comprehensive loss, changes in stockholders equity/(deficit), and cash flows for each of the years in the two-year period ended December 31, 2021, and the related notes (collectively referred to as the \"consolidated financial statements\"). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2021 and 2020, and the results of its operations and its cash flows for each of the years in the two-year period ended December 31, 2021, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming the company will continue as a going concern. As discussed in Note 3 to the consolidated financial statements, the company has an accumulated deficit at December 31, 2021 and 2020 and has a working capital deficit at December 31, 2021, which raises substantial doubt about its ability to continue as a going concern. Managements plans regarding these matters are also described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB .\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and the significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nCapital Stock and Other Equity Accounts\nAs discussed in Note 10, the Company issues preferred stock, stock options, and warrants as stock-based compensation to employees and non-employees.\nAuditing managements or the specialists calculation of the fair value of the preferred stock, options, and warrants issued can be a significant judgment given the fact that the Company uses management or specialists estimates on various inputs to the calculations.\nTo test the valuation of the preferred stock, options, and warrants, we evaluated managements and the specialists significant judgments and estimates. Significant judgements and estimates related to the valuation of the preferred stock, options, and warrants include fair valuing of warrants and options which involve significant estimates of volatility, grant terms, risk-free rates and the use of historical trading data. We evaluated managements conclusions regarding their fair values and reviewed support for the significant inputs used in the valuation models, as well as assessing the models for reasonableness. In addition, we evaluated the Companys disclosure in relation to this matter included in Note 10 to the consolidated financial statements\ns/ M&K CPAS, PLLC\nM&K CPAS, PLLC\nWe have served as the Companys auditor since\nHouston, TX\nDecember 9, 2022\nPETROLIA ENERGY CORPORATION\nCONSOLIDATED BALANCE SHEETS\nDecember 31, 2021 December 31, 2020\nASSETS\nCurrent assets\nCash $ 14,058 $ 155,045\nAccounts receivable 5,942 5,000\nOther current assets 5,641 39,443\nTotal current assets 25,641 199,488\nProperty & equipment\nOil and gas, on the basis of full cost accounting:\nEvaluated Properties 6,797,025 8,619,427\nFurniture, equipment & software 155,293 201,110\nLess accumulated depreciation & depletion (603,135 ) (2,868,453 )\nNet property and equipment 6,349,183 5,952,084\nOther assets\nOperating Lease Right-of-Use Asset 12,821 23,145\nOther assets 1,450,841 985,187\nTotal Assets $ 7,838,486 $ 7,159,904\nLIABILITIES & STOCKHOLDERS EQUITY\nCurrent liabilities\nAccounts payable $ 320,088 $ 1,067,841\nAccounts payable - related parties 57,363\nOperating Lease Liability 13,909 13,107\nAccrued liabilities 1,149,012 1,572,055\nAccrued liabilities - related parties 862,158 751,949\nNotes payable - short term 3,438,162 3,037,737\nNotes payable - related party 779,373 1,035,329\nTotal current liabilities 6,620,065 7,478,605\nAsset retirement obligations 2,257,027 3,624,133\nOperating Lease Liability - 13,909\nNotes payable -\nDerivative liability 22,554 183,798\nTotal Liabilities 8,899,646\n11,301,018\nStockholders Equity (Deficit)\nPreferred Series A stock, $0.001 par value; 1,000,000 shares authorized; 199,100 and 199,100 shares issued and outstanding\nPreferred Series B stock, no par value; 3 shares authorized; 3 and 0 shares issued and outstanding 152,397\n-\nPreferred Series C stock, $0.10 par value, 11,000 shares authorized, 8,500 and 0 shares issued and outstanding -\nPreferred stock value\nCommon stock, $0.001 par value; 400,000,000 shares authorized; 176,988,322 and 168,696,226 shares issued and outstanding 176,988 168,696\nAdditional paid in capital 60,216,722 59,044,519\nAccumulated other comprehensive income (loss) (269,155 ) (266,432 )\nAccumulated deficit (61,339,161 ) (63,088,096 )\nTotal Stockholders Equity (Deficit) (1,061,160 ) (4,141,114 )\nTotal Liabilities and Stockholders Equity (Deficit) $ 7,838,486 $ 7,159,904\nThe accompanying notes are an integral part of these audited consolidated financial statements.\nPETROLIA ENERGY CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nYear ended Year ended\nDecember 31, 2021 December 31, 2020\nOil and gas sales $ 5,895,228 $ 2,892,241\nTotal revenue 5,895,228\n2,892,241\nOperating expenses\nLease operating expense 5,346,287 3,627,541\nProduction tax 1,203 3,066\nGeneral and administrative expenses 1,107,517 864,583\nDepreciation, depletion and amortization 403,145 1,147,281\nAsset retirement obligation accretion 316,873 287,758\nLoss on forfeiture 132,000 6,255,103\nImpairment of oil and gas properties - 396,922\nTotal operating expenses 7,307,025 12,582,254\nLoss from operations (1,411,797\n) (9,690,013 )\nOther income (expenses)\nInterest expense (638,569 ) (735,622 )\nChange in fair value of derivative liabilities 161,244 (159,289 )\nOther income (expense) (101,297 ) 275,905\nGain on sale of assets 3,919,323 -\nTotal other income (expenses) 3,340,701 (619,006 )\nNet income (loss) before taxes 1,928,904 (10,309,019 )\nIncome tax provision (benefit) - -\nNet income (loss) $ 1,928,904 $ (10,309,019 )\nSeries A preferred dividends (179,190 ) (178,699 )\nSeries C preferred dividends (779 ) -\nNet income (loss) attributable to common stockholders 1,748,935 (10,487,718 )\nOther comprehensive income, net of tax\nForeign currency translation adjustments (2,723 ) (47,867 )\nComprehensive income (loss) $ 1,746,212\n$ (10,535,585 )\nGain (loss) per share\n(Basic and diluted) $ 0.01 $ (0.06 )\nWeighted average number of common shares outstanding, basic and diluted 175,434,139 165,389,389\nThe accompanying notes are an integral part of these audited consolidated financial statements.\nPETROLIA ENERGY CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended\nDecember 31, 2021\nYear Ended\nDecember 31, 2020\nCash Flows from Operating Activities\nNet income (loss) $ 1,928,904 $ (10,309,019 )\nAdjustment to reconcile net loss to net cash used in operating activities:\nDepletion, depreciation and amortization 403,145 1,147,281\nAsset retirement obligation accretion 316,873 287,758\nOperating Lease Accrual (2,783 ) 1,054\nAmortization of debt discount 217,699 209,570\nChange in fair value of derivative liabilities (161,244 ) 159,289\nWarrants as finance fees 18,061 34,867\nStock-based compensation expense 211,481 244,520\nPPP loan forgiven (56,680 ) -\nGain on sale of assets (3,919,323 ) -\nImpairment of oil and gas properties - 396,922\nLoss on forfeiture 132,000 6,255,103\nAccounts receivable (1,097 ) -\nPrepaids and other current assets 33,802 346,114\nAccounts payable 88,190 462,979\nAccounts payable - related parties 56,776 (25,000 )\nAccrued liabilities 178,194 792,578\nAccrued liabilities - related parties 450,424 (281,615 )\nNet cash used in operating activities (105,578 ) (277,599 )\nCash Flows from Investing Activities\n- -\nCash used in investing activities - -\nCash Flows from Financing Activities\nProceeds from issuance of Series C preferred stock 85,000 -\nProceeds from notes payable - 10,000\nProceeds from Paycheck Protection Loan - 56,680\nRepayments of notes payable (120,890 ) (68,367 )\nProceeds from related party notes payable - 657,470\nRepayments of related party notes payable - (334,268 )\nProceeds from exercise of warrants - 119,375\nCash provided by financing activities (35,890 ) 440,890\nForeign currency remeasurement (42,759 )\nNet change in cash (140,987 ) 120,532\nCash at beginning of period 155,045 34,513\nCash at end of period $ 14,058 $ 155,045\nThe accompanying notes are an integral part of these audited consolidated financial statements\nYear Ended\nDecember 31, 2021\nYear Ended\nDecember 31, 2020\nSUPPLEMENTAL DISCLOSURES\nInterest paid $ 239,384 $ 187,662\nIncome taxes paid - -\nNON-CASH INVESTING AND FINANCIAL DISCLOSURES\nSettlement of related party accrued liabilities for common shares 527,520 77,500\nSettlement of notes payable related party for common shares 144,888 -\nModification of related party debt 181,791 -\nDebt discount on warrant issue - 499,170\nShares to be issued - 119,375\nShares issued for related party expense - 20,000\nIssuing of previous shares to be issued - 55,375\nAccrued Series A preferred dividends 179,190 178,699\nAccrued Series C preferred dividends -\nSeries B Preferred Stock issued to directors 152,397\n-\nUtikuma acquisition - purchase price - 678,675\nUtikuma acquisition - initial ARO - 906,146\nUtikuma acquisition - extra cost triggered by WTI 787,250 -\nThird party loan for Utikuma purchase - 1,120,000\nRelated party loan payments on Companys behalf - 170,000\nCapitalized accrued interest 238,768\n-\nPETROLIA ENERGY CORPORATION\nSTATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY (DEFICIT)\nPreferred stock Series A\nPreferred stock Series B\nPreferred stock Series C Common stock Additional\npaid-in\nShares\nto be\nAccumulated Other\nComprehensive\nAccumulated Stockholders\nequity\nShares Amount\nShares\nAmount\nShares Amount Shares Amount capital Issued income deficit (deficit)\nBalance at December 31, 2019 199,100 $ 199\n-\n$ -\n- $ - 164,548,726 $ 164,549 $ 57,985,359 $ 55,375 $ (218,565 ) $ (52,600,378 ) $ 5,386,539\nCommon shares issued for the exercise of warrants - -\n-\n-\n- - 2,650,000 2,650 116,725 - - - 119,375\nStock based compensation - -\n-\n-\n- -\n244,520 - - - 244,520\nStock based compensation, shares\nShares issued for extinguishment of debt - -\n-\n-\n- - 656,250 89,344 - - - 90,000\nWarrants issued as financing fee - -\n-\n-\n- - - - 34,867 - - - 34,867\nCommon shares issued for services - -\n-\n-\n- - 250,000 19,750 - - - 20,000\nSeries A preferred dividends - -\n-\n-\n- - - - - - - (178,699 ) (178,699 )\nShares to be issued - -\n-\n-\n- - 591,250 54,784 (55,375 ) - - -\nWarrants issued for loans - -\n-\n-\n- - - - 499,170 - - - 499,170\nOther comprehensive income (loss) - -\n-\n-\n- - - - - - (47,867 ) - (47,867 )\nNet loss - -\n-\n-\n- - - - - - - (10,309,019 ) (10,309,019 )\nBalance at December 31, 2020 199,100 $ 199\n-\n$ -\n- $ - 168,696,226 $ 168,696 $ 59,044,519 $ - $ (266,432 ) $ (63,088,096 ) $ (4,141,114 )\nStock based compensation - -\n152,397\n- - - - 59,084 - - - 211,481\nSeries A preferred dividends - -\n-\n-\n- - - - - - - (179,190 ) (179,190 )\nSeries C preferred dividends - -\n-\n-\n- - - - - - - (779 ) (779 )\nPreferred Series C issued for cash - -\n-\n-\n8,500 - - 84,150 - - - 85,000\nWarrants issued as financing fee - -\n-\n-\n- - - - 18,061 - - - 18,061\nCommon shares issued for conversion of debt - -\n-\n-\n- - 2,700,000 2,700 96,288 - - - 98,988\nCommon shares issued for settlement of related party fees - -\n-\n-\n- - 5,592,096 5,592 158,895 - - - 164,487\nWarrants issued for conversion of debt - -\n-\n-\n- - - - 200,378 - - - 200,378\nGain on modification of related party debt - -\n-\n-\n- - - - 181,791 - - - 181,791\nGain on issuance of shares for settlement of accrued related party fees - -\n-\n-\n- - - - 373,556 - - - 373,556\nOther comprehensive income (loss) - -\n-\n-\n- - - - -\n(2,723 ) - (2,723 )\nNet income - -\n-\n-\n- - - - - - - 1,928,904 1,928,904\nNet income (loss) - -\n- - - - - - - 1,928,904 1,928,904\nBalance at December 31, 2021 199,100 $ 199\n$ 152,397\n8,500 $ 850 $ 176,988,322 $ 176,988 $ 60,216,722 $ - $ (269,155 ) $ (61,339,161\n) $ (1,061,160 )\nThe accompanying notes are an integral part of these audited consolidated financial statements.\nPETROLIA ENERGY CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2021 AND 2020\nNOTE 1. ORGANIZATION AND BASIS OF PRESENTATION\nPetrolia Energy Corporation (the Company) is in the business of oil and gas exploration, development, and production.\nBasis of presentation\nThe accompanying financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (GAAP) and pursuant to the accounting and disclosure rules and regulations of the United States Securities and Exchange Commission (SEC). A summary of the significant accounting policies applied in the preparation of the accompanying financial statements follows.\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries, Askarii Resources and Petrolia Canada Corporation. All significant intercompany balances and transactions have been eliminated upon consolidation.\nThe Company accounts for its investment in companies in which it has significant influence by the equity method. The Companys proportionate share of earnings is included in earnings and added to or deducted from the cost of the investment.\nForeign currency translation\nThe functional and reporting currency of the Company is the United States dollar. The functional currencies of the Companys wholly owned subsidiaries, Askarii Resources and Petrolia Canada Corporation are the United States dollar and the Canadian dollar, respectively. Transactions involving foreign currencies are converted into the Companys functional currency using the exchange rates in effect at the time of the transactions. At the balance sheet date, monetary assets and liabilities that are denominated in currencies other than the Companys functional currency are translated using exchange rates at that date. Exchange gains and losses are included in net earnings. On consolidation, Petrolia Canada Corporations income statement amounts are translated at average exchange rates for the year, while the assets and liabilities are translated at year-end exchange rates. Translation adjustments are accumulated as a separate component of stockholders equity in other comprehensive income.\nManagement estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. Significant estimates made in preparing these financial statements include depreciation of furniture, equipment and software, asset retirement obligations (AROs) (Note 9), income taxes (Note 13) and the estimate of proved oil and gas reserves and related present value estimates of future net cash flows therefrom (Note 15).\nCash and cash equivalents\nThe Company considers all highly liquid instruments purchased with an original maturity date of three months or less to be cash equivalents. As of December 31, 2021, the Company did not hold any cash equivalents.\nReceivables and allowance for doubtful accounts\nOil revenues receivable do not bear any interest. These receivables are primarily comprised of joint interest billings. Management regularly reviews collectability and establishes or adjusts an allowance for uncollectible amounts as necessary using the specific identification method. Account balances are charged off against the allowance after all means of collection have been exhausted and the potential for recovery is considered remote. Management has determined that a reserve for uncollectible amounts was not required in the periods presented.\nOil and gas properties\nThe Company follows the full cost accounting method to account for oil and natural gas properties, whereby costs incurred in the acquisition, exploration and development of oil and gas reserves are capitalized. Such costs include lease acquisition, geological and geophysical activities, rentals on nonproducing leases, drilling, completing and equipping of oil and gas wells and administrative costs directly attributable to those activities and asset retirement costs. Disposition of oil and gas properties are accounted for as a reduction of capitalized costs, with no gain or loss recognized unless such adjustment would significantly alter the relationship between capital costs and proved reserves of oil and gas, in which case the gain or loss is recognized to operations.\nThe capitalized costs of oil and gas properties, excluding unevaluated and unproved properties, are amortized as depreciation, depletion and amortization expense using the units-of-production method based on estimated proved recoverable oil and gas reserves.\nThe costs associated with unevaluated and unproved properties, initially excluded from the amortization base, relate to unproved leasehold acreage, wells and production facilities in progress and wells pending determination of the existence of proved reserves, together with capitalized interest costs for these projects. Unproved leasehold costs are transferred to the amortization base with the costs of drilling the related well once a determination of the existence of proved reserves has been made or upon impairment of a lease. Costs associated with wells in progress and completed wells that have yet to be evaluated are transferred to the amortization base once a determination is made whether or not proved reserves can be assigned to the property. Costs of dry wells are transferred to the amortization base immediately upon determination that the well is unsuccessful.\nAll items classified as unproved property are assessed on a quarterly basis for possible impairment or reduction in value. Properties are assessed on an individual basis or as a group if properties are individually insignificant. The assessment includes consideration of various factors, including, but not limited to, the following: intent to drill; remaining lease term; geological and geophysical evaluations; drilling results and activity; assignment of proved reserves; and economic viability of development if proved reserves are assigned. During any period in which these factors indicate an impairment, the cumulative drilling costs incurred to date for such property and all or a portion of the associated leasehold costs are transferred to the full cost pool and become subject to amortization.\nUnder full cost accounting rules for each cost center, capitalized costs of evaluated oil and gas properties, including asset retirement costs, less accumulated amortization and related deferred income taxes, may not exceed an amount (the cost ceiling) equal to the sum of (a) the present value of future net cash flows from estimated production of proved oil and gas reserves, based on current prices and operating conditions, discounted at ten percent (10%), plus (b) the cost of properties not being amortized, plus (c) the lower of cost or estimated fair value of any unproved properties included in the costs being amortized, less (d) any income tax effects related to differences between the book and tax basis of the properties involved. If capitalized costs exceed this limit, the excess is charged to operations. For purposes of the ceiling test calculation, current prices are defined as the un-weighted arithmetic average of the first day of the month price for each month within the 12 month period prior to the end of the reporting period. Prices are adjusted for basis or location differentials. Unless sales contracts specify otherwise, prices are held constant for the productive life of each well. Similarly, current costs are assumed to remain constant over the entire calculation period.\nGiven the volatility of oil and gas prices, it is reasonably possible that the estimate of discounted future net cash flows from proved oil and gas reserves could change in the near term. If oil and gas prices decline in the future, even if only for a short period of time, it is possible that impairments of oil and gas properties could occur. In addition, it is reasonably possible that impairments could occur if costs are incurred in excess of any increases in the present value of future net cash flows from proved oil and gas reserves, or if properties are sold for proceeds less than the discounted present value of the related proved oil and gas reserves.\nFurniture, equipment and software\nFurniture, equipment, and software are stated at cost, less accumulated depreciation. Depreciation is computed using the straight-line method over the estimated useful lives of the related asset, generally three to five years. Fully depreciated assets are retained in property and accumulated depreciation accounts until they are removed from service. Management performs ongoing evaluations of the estimated useful lives of the property and equipment for depreciation purposes. Maintenance and repairs are expensed as incurred. Management periodically reviews long-lived assets, other than oil and gas property, for impairment whenever events or changes in circumstances indicate that the carrying amount of the assets may not be fully recoverable. The Company recognizes an impairment loss when the sum of expected undiscounted future cash flows is less than the carrying amount of the asset. The amount of impairment is measured as the difference between the assets estimated fair value and its book value.\nDerivative financial instruments\nThe Companys derivative financial instruments consist of warrants with an exercise price denominated in the Companys functional currency. These derivative financial instruments are measured at their fair value at the end of each reporting period. Changes in fair value are recorded in net income.\nAsset retirement obligations\nThe Company records a liability for Asset Retirement Obligations (AROs) associated with its oil and gas wells when those assets are placed in service. The corresponding cost is capitalized as an asset and included in the carrying amount of oil and gas properties and is depleted over the useful life of the properties. Subsequently, the ARO liability is accreted to its then-present value.\nInherent in the fair value calculation of an ARO are numerous assumptions and judgments including the ultimate settlement amounts, inflation factors, credit adjusted discount rates, timing of settlement, and changes in the legal, regulatory, environmental, and political environments. To the extent future revisions to these assumptions impact the fair value of the existing ARO liability, a corresponding adjustment is made to the oil and gas property balance. Settlements greater than or less than amounts accrued as ARO are recorded as a gain or loss upon settlement.\nDebt issuance costs\nCosts incurred in connection with the issuance of long-term debt are presented as a direct deduction from the carrying value of the related debt and amortized over the term of the related debt.\nRevenue recognition\nIn May 2014, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2014-09, Revenue from Contracts with Customers. This update creates a five-step model that requires entities to exercise judgment when considering the terms of the contract(s) which includes (i) identifying the contract(s) with the customer, (ii) identifying the separate performance obligations in the contract, (iii) determining the transaction price, (iv) allocating the transaction price to the separate performance obligations, and (v) recognizing revenue as each performance obligation is satisfied. The Company adopted this standard on a modified retroactive basis on January 1, 2018. No financial statement impact occurred upon adoption.\nRevenue from contracts with customers\nThe Company recognizes revenue when it satisfies a performance obligation by transferring control over a product to a customer. Revenue is measured based on the consideration the Company expects to receive in exchange for those products.\nPerformance obligations and significant judgments\nThe Company sells oil and natural gas products in the United States through a single reportable segment. The Company enters into contracts that generally include one type of distinct product in variable quantities and priced based on a specific index related to the type of product.\nThe oil and natural gas is typically sold in an unprocessed state to processors and other third parties for processing and sale to customers. The Company recognizes revenue at a point in time when control of the oil or natural gas passes to the customer or processor, as applicable, discussed below. For oil sales, control is typically transferred to the customer upon receipt at the wellhead or a contractually agreed upon delivery point. Under our natural gas contracts with processors, control transfers upon delivery at the wellhead or the inlet of the processing entitys system. For our other natural gas contracts, control transfers upon delivery to the inlet or to a contractually agreed upon delivery point. In the cases where the Company sells to a processor, management has determined that the Company is the principal in the arrangement and the processors are customers. The Company recognizes the revenue in these contracts based on the net proceeds received from the processor.\nTransfer of control drives the presentation of transportation and gathering costs within the accompanying consolidated statements of operations. Transportation and gathering costs incurred prior to control transfer are recorded within the transportation and gathering expense line item on the accompanying consolidated statements of operations, while transportation and gathering costs incurred subsequent to control transfer are recorded as a reduction to the related revenue.\nA portion of our product sales are short-term in nature. For those contracts, the Company uses the practical expedient in Accounting Standards Codification (ASC) 606-10-50-14 exempting us from disclosure of the transaction price allocated to remaining performance obligations if the performance obligation is part of a contract that has an original expected duration of one year or less.\nFor our product sales that have a contract term greater than one year, the Company has utilized the practical expedient in ASC 606-10-50-14(a) which states the Company is not required to disclose the transaction price allocated to remaining performance obligations if the variable consideration is allocated entirely to an unsatisfied performance obligation. Under these sales contracts, each unit of product represents a separate performance obligation; therefore, future volumes are unsatisfied, and disclosure of the transaction price allocated to remaining performance obligations is not required. The Company has no unsatisfied performance obligations at the end of each reporting period.\nManagement does not believe that significant judgments are required with respect to the determination of the transaction price, including any variable consideration identified. There is a low level of uncertainty due to the precision of measurement and use of index-based pricing with predictable differentials. Additionally, any variable consideration identified is not constrained.\nStock-based compensation\nThe Company accounts for stock-based compensation to employees in accordance with FASB ASC 718. Stock-based compensation to employees is measured at the grant date, based on the fair value of the award, and is recognized as expense over the requisite employee service period. The Company accounts for stock-based compensation to other than employees in accordance with FASB ASC 505-50. Equity instruments issued to other than employees are valued at the earlier of a commitment date or upon completion of the services, based on the fair value of the equity instruments, and is recognized as expense over the service period. The Company estimates the fair value of stock-based payments using the Black-Sholes Option Pricing Model for common stock options and warrants and the closing price of the Companys common stock for common share issuances. The Company may grant stock to employees and non-employees in exchange for goods, services or for settlement of liabilities. Shares granted to employees in exchange for goods, services or settlement of liabilities are measured based on the fair value of the shares issued. Shares granted to non-employees in exchange for goods or services are measured based on the fair value of the consideration received or the fair value of the shares issued, whichever is more reliably measurable.\nIncome taxes\nIncome taxes are accounted for pursuant to ASC 740, Income Taxes, which requires recognition of deferred income tax liabilities and assets for the expected future tax consequences of events that have been recognized in the Companys financial statements or tax returns. The Company provides for deferred taxes on temporary differences between the financial statements and tax basis of assets using the enacted tax rates that are expected to apply to taxable income when the temporary differences are expected to reverse. Valuation allowances are established when necessary to reduce deferred income tax assets to the amount expected to be realized.\nUncertain tax positions are recognized in the financial statements only if that position is more likely than not of being sustained upon examination by taxing authorities, based on the technical merits of the position. The Company recognizes interest and penalties related to uncertain tax positions in the income tax provision. There are currently no unrecognized tax benefits that if recognized would affect the tax rate. There was no interest or penalties recognized for the twelve months ended December 31, 2021 and 2020.\nThe Company is required to file federal income tax returns in the United States and Canada, and in various state and local jurisdictions. The Companys tax returns are subject to examination by taxing authorities in the jurisdictions in which it operates in accordance with the normal statutes of limitations in the applicable jurisdiction.\nEarnings (loss) per share\nBasic earnings (loss) per share has been calculated based on the weighted-average number of common shares outstanding. The treasury stock method is used to compute the dilutive effect of the Companys share-based compensation awards. Under this method, the incremental number of shares used in computing diluted earnings per share (EPS) is the difference between the number of shares assumed issued and purchased using assumed proceeds. Diluted EPS amounts would include the effect of outstanding stock options, warrants, and other convertible securities if including such potential shares of common stock is dilutive. Basic and diluted earnings per share are the same in all periods presented as all outstanding instruments are anti-dilutive.\nConcentration of credit risk\nThe Company is subject to credit risk resulting from the concentration of its oil receivables with significant purchasers. Three purchasers accounted for all of the Companys oil sales revenues for 2021 and 2020. The Company does not require collateral. While the Company believes its recorded receivables will be collected, in the event of default the Company would follow normal collection procedures. The Company does not believe the loss of a purchaser would materially impact its operating results as oil is a fungible product with a well-established market and numerous purchasers.\nAt times, the Company maintains deposits in federally insured financial institutions in excess of federally insured limits. Management monitors the credit ratings and concentration of risk with these financial institutions on a continuing basis to safeguard cash deposits.\nFair value measurements\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability (i.e., the exit price) in an orderly transaction between market participants at the measurement date. The hierarchy is broken down into three levels based on the observability of inputs as follows:\n● Level 1 - Valuations based on quoted prices in active markets for identical assets or liabilities that the Company has the ability to access. Valuation adjustments and block discounts are not applied to Level 1 instruments. Since valuations are based on quoted prices that are readily and regularly available in an active market, valuation of these products does not entail a significant degree of judgment;\n● Level 2 - Valuations based on one or more quoted prices in markets that are not active or for which all significant inputs are observable, either directly or indirectly; and\n● Level 3 - Valuations based on inputs that are unobservable and significant to the overall fair value measurement.\nOur derivative liabilities are measured at fair value on a recurring basis and estimated as follows:\nSCHEDULE OF DERIVATIVE LIABILITIES MEASURED AT FAIR VALUE ON RECURRING BASIS\nDecember 31, 2021 Level 1 Level 2 Level 3 Total\nDerivative liabilities - - 22,554 22,554\nARO liabilities - - 2,257,027 2,257,027\nDecember 31, 2020\nDerivative liabilities - - 183,798 183,798\nARO liabilities - - 3,624,133 3,624,133\nThe carrying value of cash, accounts receivable, other current assets, accounts payable, accounts payable - related parties, accrued liabilities and accrued liabilities - related parties, as reflected in the consolidated balance sheets, approximate fair value, due to the short-term maturity of these instruments. The carrying value of notes payable approximates their fair value due to immaterial changes in market interest rates and the Companys credit risk since issuance of the instruments or due to their short-term nature. Derivative liabilities are remeasured at fair value every reporting period. Our derivative liabilities are considered level 3 financial instruments.\nRelated parties\nThe Audit Committee approves all material related party transactions. The Audit Committee is provided with the details of each new, existing or proposed related party transaction, including the terms of the transaction, the business purpose of the transaction, and the benefits to the Company and the relevant related party. In determining whether to approve a related party transaction, the following factors are considered: (1) if the terms are fair to the Company, (2) if there are business reasons to enter into the transaction, (3) if the transaction would impair independence of an outside Director, or (4) if the transaction would present an improper conflict of interest for any Director or executive officer. Any member of the Audit Committee who has an interest in the transaction will abstain from voting on the approval of the related party transaction.\nBusiness combinations\nIn January 2017, the FASB issued ASU 2017-01 Business Combinations (Topic 805): Clarifying the Definition of a Business. The ASU provides an updated model for determining if acquired assets and liabilities constitute a business. In a business combination, the acquired assets and liabilities are recognized at fair value and goodwill could be recognized. In an asset acquisition, the assets are allocated value based on relative fair value and no goodwill is recognized. The ASU narrows the definition of a business. The Company adopted this standard on January 1, 2018. ASU 2017-01 did not have a material impact on our financial statements on adoption.\nReclassifications\nCertain amounts previously presented for prior periods have been reclassified to conform to the current presentation. The reclassifications had no effect on net loss, working capital or equity previously reported.\nRecent accounting pronouncements\nThe Company has evaluated all the recent accounting pronouncements through the filing date and believes that none of them will have a material effect on the Company other than those discussed below.\nLeases\nIn February 2016, the FASB issued ASU 2016-02, Leases, which requires lessees to recognize all rights and obligations created by those leases, including operating leases, with a term greater than 12 months on the balance sheet. The accounting for lessors will remain largely unchanged from the existing accounting standards. The standard is effective for fiscal years beginning after December 15, 2018, including interim periods within those fiscal years.\nUnder ASU 2016-02, each lease agreement will be evaluated to identify the lease components and non-lease components at lease inception. The total consideration in the lease agreement will be allocated to the lease and non-lease components based on their relative standalone selling prices.\nIn July 2018, the FASB issued ASU 2018-11, Leases - Targeted Improvements that allows lessors to elect, as a practical expedient, to not separate lease and non-lease components and allows these components to be accounted for as a single lease component if both (1) the timing and pattern of transfer to the lessee of the lease component and the related non-lease component are the same and (2) the lease component, if accounted for separately, would be classified as an operating lease. In addition, a company is permitted to use its effective date as the date of initial application. Therefore, a company electing this option will not restate comparative period financial information, will not make the new required lease disclosures in comparative periods beginning before the effective date and will recognize its cumulative effect transition adjustment as of the effective date. Under the practical expedient mentioned above, it is expected that revenue will be presented under a single lease component presentation. The Company will elect this expedient upon adoption.\nThe Company adopted ASU 2016-02 on January 1, 2019 using the modified retrospective method, whereby a cumulative effect adjustment will be made as of that day with no retrospective effect. The Company applied the package of practical expedients such that for any expired or existing leases it will not reassess lease classification, initial direct costs or whether any expired or existing contracts are or contain leases. Note that the Company had no outstanding leases as of December 31, 2019. In 2020, we entered a lease with a related party, that is accounted for and disclosed using the framework of ASC 842. See Note 6 for more details.\nNOTE 3. GOING CONCERN\nThe Company has suffered recurring losses from operations and currently has a working capital deficit. These conditions raise doubt about the Companys ability to continue as a going concern. The Company plans to generate profits by reducing overhead costs and reworking its existing oil or gas wells, as needed, funding permitting. The Company may need to raise funds through either the sale of its securities, issuance of corporate bonds, joint venture agreements and/or bank financing to accomplish its goals.\nIf additional financing is not available when needed, we may need to cease operations. The Company may not be successful in raising the capital needed to drill and/or rework existing oil wells. Any additional wells that the Company may drill may be non-productive. Management believes that actions presently being taken to secure additional funding for the reworking of its existing assets will provide the opportunity for the Company to continue as a going concern. Since the Company has an oil producing asset, its goal is to increase the production rate by optimizing its current infrastructure. The accompanying financial statements have been prepared assuming the Company will continue as a going concern; no adjustments to the financial statements have been made to account for this uncertainty.\nNOTE 4. EVALUATED PROPERTIES\nThe acquired properties and current properties can be summarized as follows:\nSCHEDULE OF COMPANYS CURRENT PROPERTIES\nCost Canadian properties US properties Total\nAs of December 31, 2019 2,563,434 $ 10,350,538 $ 12,913,972\nAdditions 678,765 - 678,765\nDispositions - (5,648,994 ) (5,648,994 )\nImpairment of oil and gas properties\n(396,922 ) (396,922 )\nAsset retirement cost additions 906,146 - 906,146\nForeign currency translations 166,460 - 166,460\nAs of December 31, 2020 $ 4,314,805 $ 4,304,622 $ 8,619,427\nAdditions 787,250 - 787,250\nDispositions (2,563,434 ) - (2,563,434 )\nForeign currency translation (46,218 ) - (46,218 )\nAs of December 31, 2021 $ 2,492,403 $ 4,304,622 $ 6,797,025\nAccumulated depletion\nAs of December 31, 2019 1,458,976 61,551 1,520,347\nDepletion 1,115,595 - 1,115,595\nForeign currency translations 57,178 - 57,178\nAs of December 31, 2020 $ 2,631,749 $ 61,551 $ 2,693,300\nDispositions (2,629,672 ) - (2,629,672 )\nDepletion 378,306 - 378,306\nForeign currency translation 7,026 - 7,026\nAs of December 31, 2021 $ 387,409 $ 61,551 $ 448,960\nNet book value as at December 31, 2021 $ 2,104,994 $ 4,243,071 $ 6,348,065\nNet book value as at December 31, 2020 $ 1,683,056 $ 4,243,071 $ 5,926,127\nU.S. Properties - Minerva-Rockdale Field (NOACK) Field\nOn November 1, 2018, the Company sold 83% leasehold net revenue interest and 100% working interest in the NOACK Field Assets, i.e., the Companys leasehold in the Noack Farms, Minera Lease and all related leases and assets located in Milam County, Texas (the NOACK Assets) to Crossroads Petroleum LLC (CP) for $375,000. The terms of this agreement included $260,000 to be paid as a deposit with the balance of $115,000 to be paid by December 31, 2018. On April 15, 2019, the Company foreclosed on the property since CP did not satisfy all of the contractual payment requirements. On April 15, 2019, the remaining unpaid receivable balance was $120,000 which was written off as a loss on sale of property. Note that previous payments of $255,000 were forfeited to the Company and no reimbursement to CP was made.\nOn August 6, 2019, the Company entered into a Purchase and Sale Agreement (PSA) for the sale of the same NOACK property with Flowtex Energy LLC. (FT). The purchaser agreed to pay $400,000 for the NOACK Assets including a $20,000 deposit that was received on August 15, 2019, and the remaining balance of $380,000 to be received by September 30, 2019. By December 31, 2020, FT had made cumulative payments of $375,000, resulting in a $25,000 account receivable to the Company at December 31, 2020 which is included in other current assets. The $400,000 was recorded as a gain on sale of properties. On July 6, 2021, the remaining $25,000 accounts receivable was settled via the following. The purchaser remitted a cash payment of $8,995, as well as paying (on the Companys behalf) $16,005 of outstanding property tax invoices previously incurred by the Company.\nU.S. Properties - Slick Unit Dutcher Sands (SUDS) Field\nThe SUDS Field is a 2604-acre lease located in Creek County, Oklahoma. The field was first discovered in 1918 by SOHIO Oil Company utilizing over 100 wells with the primary objective to produce from the Dutcher Sands at an average well depth of 3,100 ft. The SUDS field is currently shut in due to damage from a grass fire.\nU.S. properties - Twin Lakes San Andres Unit (TLSAU) Field\nTLSAU is located 45 miles from Roswell, Chaves County, New Mexico.\nOn July 27, 2020 the Company entered into a settlement agreement with their Trustee pursuant to which nine leases totaling approximately 3,800 acres of the 4,880 acre Twin Lakes San Andres Unit were forfeited as a part of the settlement agreement. Consequently, the Company no longer has the right to produce oil, gas, or other hydrocarbons and any other minerals from the mineral estate encumbered by the leases and owned by the Trustee. The company accounted for the forfeiture of the TLSAU properties, in accordance with Reg S-W.T.Rule 4-10(c)(6). Accordingly, an analysis of multi-period reserve reports was performed to determine the percentage of the cumulative US full cost pools reserves that were forfeited (56% or 943,820). Then that percentage was multiplied by the period end net property balance of $10,175,456. This resulted in a write down of $5,648,994 ($10,175,456 * 56%) of the US cost pool. Note that both TLSAU and SUDS make up the US full cost pool.\nLuseland, Hearts Hill and Cuthbert fields\nOn June 29, 2018, the Company acquired a 25% working interest in approximately 41,526 acres located in the Luseland, Hearts Hill, and Cuthbert fields, located in Southwest Saskatchewan and Eastern Alberta, Canada. The working interest was acquired from Blue Sky (a related party). Blue Sky had previously acquired an 80% working interest in the Canadian Properties from Georox Resources Inc., who had acquired the Canadian Properties from Cona Resources Ltd. and Cona Resources Partnership prior to the acquisition by the Company.\nThe effective date of the acquisition was June 1, 2018. The acquisition of the Canadian Properties was evidenced and documented by a Memorandum of Understanding between the Company and Blue Sky dated June 29, 2018 and a Conveyance between the parties dated as of the same date, pursuant to which the Company agreed to acquire the Working Interest in consideration for $1,428,581 in Canadian dollars (CAD) (approximately $1,096,216 in U.S. dollars) of which CAD $1,022,400 (approximately $782,441 in U.S. dollars) was paid in cash (the Cash Payment) and CAD $406,181 (approximately $313,775 in U.S. dollars) was evidenced by a promissory note (the Acquisition Note). The Cash Payment was made with funds borrowed by the Company pursuant to the terms of that certain $1,530,000 May 9, 2018, Amended and Restated Loan Agreement entered with Bow and a third party (the Loan Agreement and the Lender). The amount owed under the Loan Agreement accrues interest at the rate of 12% per annum (19% upon the occurrence of an event of default) and is due and payable on May 11, 2021.\nThe Working Interest will be held in the name of the Companys wholly owned Alberta, Canada, subsidiary, Petrolia Canada Corporation. The Acquisition Note which was dated June 8, 2018, bears interest at the rate of 9% per annum, beginning on August 1, 2018 and is due and payable on November 30, 2018, provided that the Company has the right to extend the maturity date for a period six months with 10 days notice to Blue Sky, in the event the Company pays 25% of the principal amount of the Acquisition Note at the time of extension.\nOn September 17, 2018, the Company entered a Memorandum of Understanding (MOU) with Blue Sky. Pursuant to the MOU, the Company obtained the rights to acquire an additional 3% working interest in the Canadian Properties, increasing our Working Interest to 28%. Total consideration paid from the Company to Blue Sky for the additional 3% Working Interest was $150,000.\nOn February 16, 2022, the Company entered into both a Purchase and Sale Agreement and a Debt Settlement Agreement with Prospera Energy. Prospera agreed to purchase the Companys twenty-eight percent (28%) working interest in the Cuthbert, Luseland and Heart Hills assets in Saskatchewan and Alberta. Under these agreements Prospera will forgive $2,061,614 CAD in accounts payable from the Company, arising from joint interest billings. Prospera will also issue a $510,000 CAD convertible debenture to Petrolia Canada, which can be converted to common share units. Lastly, Prospera will pay the Company $75,000 CAD in five equal installments. The original purchase price of the assets was $1,622,756 CAD, with an additional $1,711,142 CAD of Asset Retirement Cost recognized at the time of purchase. On the effective date of the sale, the Asset Retirement Obligation was $2,312,897 CAD and the Accumulated Depletion was $3,333,898 CAD. The transaction resulted in a gain of $4,959,512 CAD ($3,919,323 USD) See Form 8-K reference in Exhibits section below. The agreement was effective on October 1, 2021.\nUtikuma field\nOn May 1, 2020, Petrolia Energy Corporation acquired a 50% working interest in approximately 28,000 acres located in the Utikuma Lake area in Alberta, Canada. The property is an oil-weighted asset currently producing approximately 500 bpd of light oil. The working interest was acquired from Blue Sky Resources Ltd. in an affiliated party transaction as Zel C. Khan, the Companys former Chief Executive Officer, is related to the ownership of Blue Sky. Blue Sky acquired a 100% working interest in the Canadian Property from Vermilion Energy Inc. via Vermilions subsidiary Vermilion Resources. The effective date of the acquisition was May 1, 2020. The total purchase price of the property was $2,000,000 (CAD), with $1,000,000 of that total due initially. The additional $1,000,000 was contingent on the future price of WTI crude. At the time WTI price exceeded $50/bbl, the Company would pay an additional $750,000 CAD. In addition, at the time WTI price exceeded $57/bbl the Company would pay an additional $250,000 CAD (for a cumulative contingent total of $1,000,000 CAD). The price of WTI crude exceeded $50/bbl on January 6, 2021 and exceeded $57/bbl on February 8, 2021. The additional payments due were netted with the accounts receivable balance from previous Joint Interest Billing statements from BSR. The total USD value of the addition was $787,250, using prevailing exchange rates on the respective dates. Included in the terms of the agreement, the Company also funded their portion of the Alberta Energy Regulator (AER) bond fund requirement ($602,423 USD), necessary for the wells to continue in production after the acquisition. Additional funds ($386,989 USD) remain in the other current asset balance for future payments to BSR, related to the acquisition.\nOn December 2, 2020, Petrolia Canada Corporation received $602,404.84 CAD from the proceeds of a secured royalty interest loan between Blue Sky Resources and PrairieSky Royalty related to the Utikuma asset.\nOn August 21, 2021, the Company signed a Letter Agreement to divest the Companys wholly owned Canada subsidiary, Petrolia Canada Corporation (PCC) and its assets in consideration for $6,500,000 in Canadian dollars (approximately $5,150,000 in U.S. dollars) less any contingent liabilities. The buyer is Blue Sky Resources Ltd. (Blue Sky), an affiliated party to Zel C. Khan, the Companys former Chief Executive Officer. Petrolia Canada Corporation assets include a 50% working interest in approximately 28,000 acres located in the Utikuma Lake area in Alberta, Canada, and 28% working interest in the Luseland, Hearts Hill, and Cuthbert fields located in Southwest Saskatchewan and Eastern Alberta. The Company received a non-refundable deposit of $200,000 CAD on August 31, 2021. The remaining payment schedule is as follows: $2,000,000 CAD on the Closing Date (scheduled for September 30, 2021), $1,000,000 CAD on October 31, 2021, less Petrolias contingent liabilities associated with the acquisition of Utikuma, and $3,300,000 CAD on December 31, 2021. See Form 8-K reference in Exhibits section below. This transaction did not close, and the $200,000 CAD has currently been added to other payables to Blue Sky Resources.\nOn June 13, 2022, a new Letter Agreement was signed between Blue Sky Resources Ltd. (BSR) and Petrolia Energy Corporation whereby Petrolia Canada Corporation (PCC) will sell to Blue Sky Resources its 50% working interest in the Utikuma Lake oil field. See Form 8-K reference in Exhibits section below.\nNOTE 5. NOTES PAYABLE\nSCHEDULE OF NOTES PAYABLE\nInterest rate Date of maturity December 31, 2021 December 31, 2020\nTruck loan (ii) 5.49 % January 20, 2022 $ 4,021 $ 9,916\nCredit note I (iii) 12 % May 11, 2021 - 800,000\nCredit note II (iv) 12 % October 17, 2019 - 346,038\nCredit note III (v) 15 % April 25, 2021 - 750,000\nDiscount on credit note III - - - (5,976 )\nCredit note IV (vi) 10 % January 01, 2020 831,387 937,019\nDiscount on credit note IV\n(97,001 ) (285,767 )\nCredit note V(vii) 10 % December 31, 2022 2,085,432 -\nLee Lytton\nOn demand 3,500 3,500\nJoel Oppenheim (viii) 10 % On demand - 161,900\nJoel Oppenheim (viii) 10 % On demand - 15,000\nJoel Oppenheim(viii) 10 % October 17, 2018 - 240,000\nCredit note VI (viii) 10 % December 31, 2021 416,900 -\nOrigin Bank (PPP loan) (ix)\n- 56,680\nQuinten Beasley 10 % October 14, 2016 5,000\n-\nJovian Petroleum Corporation (x) 3.5 % December 31, 2021 178,923 -\nM. Hortwitz 10 % October 14, 2016 10,000 10,000\n$ 3,438,162 (1) $ 3,038,310\n(i) All notes are current (due within one year or less from December 31, 2021.)\n(ii) On January 6, 2017, the Company purchased a truck and entered into an installment note in the amount of $35,677 for a term of five years and interest at 5.49% per annum. Payments of principal and interest in the amount of $683 are due monthly.\n(iii) On May 9, 2018, Bow entered into an Amended and Restated Loan Agreement with a third party. The Loan Agreement increased by $800,000 the amount of a previous loan agreement entered into between Bow and the Lender, to $1,530,000. The amount owed under the Loan Agreement accrues interest at the rate of 12% per annum (19% upon the occurrence of an event of default) and is due and payable on May 11, 2021, provided that the amount owed can be prepaid prior to maturity, beginning 60 days after the date of the Loan Agreement, provided that the Company gives the Lender 10 days notice of our intent to repay and pays the Lender the interest which would have been due through the maturity date at the time of repayment. The Loan Agreement contains standard and customary events of default, including cross defaults under other indebtedness obligations of us and Bow, and the occurrence of any event which would have a material adverse effect on us or Bow. The Company is required to make principal payments of $10,000 per month from January through September 2019 with the remaining balance of $710,000 due at maturity on May 11, 2021. The additional $800,000 borrowed in connection with the entry into the Loan Agreement was used by the Company to acquire a 25% working interest in approximately 41,526 acres located in the Luseland, Hearts Hill, and Cuthbert fields, located in Southwest Saskatchewan and Eastern Alberta, Canada (collectively, the Canadian Properties and the Working Interest). Upon the disposition of Bow, a total of $730,000 of the obligations owed under the Loan Agreement were transferred to Blue Sky Resources Ltd. (Blue Sky).\nIn order to induce the Lender to enter into the Loan Agreement, the Company agreed to issue the Lender 500,000 shares of restricted common stock (the Loan Shares), which were issued on May 18, 2018, and warrants to purchase 2,320,000 shares of common stock (the Loan Warrants), of which warrants to purchase (a) 320,000 shares of common stock have an exercise price of $0.10 per share in Canadian dollars and expire in May 15, 2021, (b) 500,000 shares of common stock have an exercise price of $0.12 per share in U.S. dollars, and expire on May 15, 2021; and (c) 1,500,000 shares of common stock have an exercise price of $0.10 per share in U.S. dollars and expire on May 15, 2020. The fair value of the 500,000 common shares issued were assessed at the market price of the stock on the date of issuance and valued at $47,500. The fair value of the Canadian dollar denominated warrants issued were assessed at $30,012 using the Black Scholes Option Pricing Model. The fair value of the U.S. dollar denominated warrants issued were assessed at $182,650 using the Black Scholes Option Pricing Model. The Company determined the debt modification to be an extinguishment of debt and recorded a total loss on extinguishment of debt of $260,162.\nOn January 1, 2021, the Lender signed an amended loan agreement, combining Credit note I and $200,000 of Credit note II which moved the balance of this note to credit note VI and accrued interest.\nOn December 1, 2021, the Lender signed another amended loan agreement, combining the new note with the combined note of Credit note III and $146,038 of Credit note II and accrued interest on those amounts to Credit note V. More details can be found in footnote (vii)\n(iv) On September 17, 2018, the Company entered into a loan agreement with a third party for $200,000 to acquire an additional 3% working interest in the Canadian Properties. The loan bears interest at 12% per annum and has a maturity date of October 17, 2019. Payments of principal and interest in the amount of $6,000 are due monthly. The loan is secured against the Companys 3% working interest in the Canadian Properties and has no financial covenants. During 2020, the balance increased by $146,000 resulting in a $346,038 ending balance. On January 1, 2021, the Lender signed amended loan agreements, which moved the balance of this note to new credits notes. More details can be found in footnotes (iii) and (v).\n(v) On April 25, 2019, the Company entered into a promissory note (an Acquisition Note) with a third-party in the amount of $750,000 to acquire working interests in the Utikuma oil field in Alberta Canada. The Note bears interest at 9% per annum and is due in full at maturity on April 25, 2021. No payments are required on the note until maturity while interest is accrued. In addition, warrants to purchase 500,000 shares of common stock with an exercise price of $0.12 per share expiring on May 1, 2021, were issued associated with the note. The fair value of issued warrants were recorded as a debt discount of $38,249 and amortization of $8,366. The notes hold a security guarantee of working interest in the Utikuma oil field and a working interest in the TLSAU field. On January 1, 2021, the Lender signed an amended loan agreement consolidating this loan with $146,038 of Credit Note II and accrued interest on those amounts.\nOn December 1, 2021, the Lender signed another amended loan agreement, combining the new note with the combined note of Credit note I and $200,000 of Credit note II and accrued interest on those amounts to Credit note V. More details can be found in footnote (vii)\n(vi) On January 2, 2020, the Company entered into a loan agreement in the amount of $1,000,000 with a third party (including a $120,000 origination fee). The note bore interest at an interest rate of $10% per annum and matures on June 30, 2020, with warrants to purchase 5,000,000 shares of common stock (the Loan Warrants), at an exercise price of $0.10 per share in Canadian dollars and expire on January 2, 2023. The fair value of issued warrants were recorded as a debt discount of $266,674 and monthly amortization of $11,111. These funds were initially placed in escrow, then on May 29, 2020, they were used for the purchase of the Utikuma oil field. Pursuant to a loan extension agreement, on October 30, 2020, the Company issued warrants to purchase 5,000,000 of common stock, at an exercise price of $0.05 per share, expiring on January 6, 2023. The fair value of the issued warrants was recorded as a debt discount of $166,289 and monthly amortization of $4,614.14.\n(vii) On December 1, 2021, the Company signed an amended loan agreement with third party for $2,085,432, which combined credit note I, II and III and accrued interest on those amounts. The loan bears interest at 10% per annum and has maturity date of December 31, 2022. The note holds a security interest against the 25% Working Interest in the Cona assets and a security guarantee of a working interest in the Utikuma oil field and a working interest in the TLSAU field.\n(viii) Various shareholder advances provided by Mr. Oppenheim during 2018 and 2019. There were no formal documents drawn. Interest rates were applied based on other similar loan agreements entered into by the Company during that period. On February 12, 2021, the Company entered into an amended loan agreement in the amount of $416,900 that consolidated these amounts. The loan bears interest at 10% per annum and has a maturity date of December 31, 2021. On August 31, 2021, this loan was in default due to missed interest payments, and a default interest rate was applied to the principal balance.\n(ix) On April 23, 2020, the Company was granted a $56,680 business loan through the Paycheck Protection Program (PPP) administered through the CARES act. The company applied for loan forgiveness, and it was granted on July 26, 2021.\n(x) On February 9, 2018, the Company entered into a Revolving Line of Credit Agreement (LOC) for $200,000 (subsequently increased to $500,000 on April 12, 2018) with Jovian Petroleum Corporation (Jovian). The CEO of Jovian is Quinten Beasley, our former director (resigned October 31, 2018), and 25% of Jovian is owned by Zel C. Khan, our former CEO and director. The initial agreement was for a period of 6 months, and it can be extended for up to 5 additional terms of 6 months each. All amounts advanced pursuant to the LOC will bear interest from the date of advance until paid in full at 3.5% simple interest per annum. Interest will be calculated on a basis of a 360-day year and charged for the actual number of days elapsed. Subsequent to period-end this LOC has been extended until December 31, 2021. As of September 1, 2021, Zel Khan and Quinten Beasley resigned from their positions at Petrolia Energy, so this note has been removed from the related party section. Also, see Note 16. Subsequent Events regarding the dispute of this value.\nThe following is a schedule of future minimum repayments of notes payable as of December 31, 2021:\nSCHEDULE OF FUTURE MINIMUM REPAYMENTS OF NOTES PAYABLE\n$ 3,535,163\nThereafter -\nTotal $ 3,535,163\nNOTE 6. LEASES\nOur adoption of ASU 2016-02, Leases (Topic 842), and subsequent ASUs related to Topic 842, requires us to recognize substantially all leases on the balance sheet as an ROU asset and a corresponding lease liability. The new guidance also requires additional disclosures as detailed below. We adopted this standard on the effective date of January 1, 2019 and used this effective date as the date of initial application. Under this application method, we were not required to restate prior period financial information or provide Topic 842 disclosures for prior periods. We elected the ‘package of practical expedients, which permitted us to not reassess our prior conclusions related to lease identification, lease classification, and initial direct costs, and we did not elect the use of hindsight.\nLease ROU assets and liabilities are recognized at commencement date of the lease, based on the present value of lease payments over the lease term. The lease ROU asset also includes any lease payments made and excludes any lease incentives. When readily determinable, we use the implicit rate in determining the present value of lease payments. When leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at the lease commencement date, including the lease term.\nShort-term leases with an initial term of 12 months or less are not recorded on the balance sheet. Lease expense for short-term leases is recognized on a straight-line basis over the lease term. As of December 31, 2021 and 2020, we did not have any short-term leases.\nThe tables below present financial information associated with our lease.\nSCHEDULE OF FINANCIAL INFORMATION LEASE\nBalance Sheet Classification December 31, 2021 December 31, 2020\nRight-of-use assets Other long-term assets 12,821 23,145\nCurrent lease liabilities Other current liabilities 13,909 13,107\nNon-current lease liabilities Other long-term liabilities - 13,909\nAs of December 31, 2021, our maturities of our lease liability are as follows:\nSCHEDULE OF MATURITIES LEASE LIABILITY\n$ 13,909\nTotal $ 13,909\nLess: Imputed interest (1,088 )\nPresent value of lease liabilities $ 12,821\nNOTE 7. RELATED PARTY NOTES PAYABLE\nThe chart below summarizes the related party Notes Payable as of December 31, 2021 and 2020.\nSCHEDULE OF RELATED PARTY NOTES PAYABLE\nInterest rate Date of maturity December 31, 2021 December 31, 2020\nQuinten Beasley 10 % October 14, 2016 - 5,000\nJovian Petroleum Corporation (i) 3.5 % December 31, 2021 - 188,285\nIvar Siem (ii) 12 % On demand - 200,000\nIvar Siem (ii) No interest On demand - 50,000\nIvar Siem (ii) 9 % December 31, 2021 278,435 -\nMark Allen (iii) 9 % September 2, 2021 55,000 55,000\nMark Allen (iv) 10 % June 30, 2021 - 135,000\nMark Allen (v) 12 % June 30, 2020 200,000 200,000\nMark Allen (vi) 10 % June 30, 2020 - 100,000\nDiscount on note ($100K)\n- (11,536 )\nMark Allen (vi) 10 % June 30, 2020 - 125,000\nDiscount on note ($125K)\n- (11,420 )\nMark Allen (vi) 9 % June 30, 2021 245,938 -\n$ 779,373 $ 1,035,329\n(i) On February 9, 2018, the Company entered into a Revolving Line of Credit Agreement (LOC) for $200,000 (subsequently increased to $500,000 on April 12, 2018) with Jovian Petroleum Corporation (Jovian). The CEO of Jovian is Quinten Beasley, our former director (resigned October 31, 2018), and 25% of Jovian is owned by Zel C. Khan, our former CEO and director. The initial agreement was for a period of 6 months, and it can be extended for up to 5 additional terms of 6 months each. All amounts advanced pursuant to the LOC will bear interest from the date of advance until paid in full at 3.5% simple interest per annum. Interest will be calculated on a basis of a 360-day year and charged for the actual number of days elapsed. Subsequent to period-end this LOC has been extended until December 31, 2021. On September 1, 2021, Zel Khan and Quinten Beasley resigned from their positions at Petrolia Energy, so this note has been removed from the related party section.\n(ii) On August 15, 2019, the Company entered into a loan agreement in the amount of $75,000 with Ivar Siem. The note bears interest at an interest rate of 12% per annum with a four (4) month maturity. On December 4, 2019, the Company entered into a loan agreement in the amount of $100,000 with Ivar Siem. The note bears interest at an interest rate of 12% per annum with a six (6) month maturity. At the maturity date, the note holder has the right to collect the principal plus interest or convert into 1,250,000 shares of common stock at $0.08 per share. In addition, if converted, the note holder will also receive 5,000,000 warrants at an exercise price of $0.10 per share, vesting immediately with a 36-month expiration period. On February 28, 2020, the Company entered into a $50,000 loan agreement with Ivar Siem. The note does not bear any interest (0% interest rate) and is due on demand. The note includes warrants to purchase 200,000 shares of common stock (the Loan Warrants), at an exercise price of $0.10 per share in Canadian dollars and expire on March 1, 2022. The warrants vest and were issued on January 1, 2021. On January 1, 2021, the Company entered into an amended loan agreement in the amount of $278,435, which combined the three previous loans, along with accrued interest. The note bears an interest rate of 9% and matures on December 21, 2021.\n(iii) On April 15, 2020, the Company entered into an agreement, with Mark Allen, that included a funding clause where the Company borrowed $55,000 from Mr. Allen. The note bears interest at an interest rate of 9% per annum and matures on August 15, 2021.\n(iv) On January 6, 2020, the Company entered into a consulting agreement with Mark Allen, that included a funding clause where the Company borrowed $135,000 ($62,000 on January 6, 2020, $45,000 on May 18, 2020, and $28,000 on June 26, 2020). The note bore interest at an interest rate of 10% per annum and matured on June 30, 2020. On March 30, 2021, this note was settled with shares of the company. More details can be found in Note 10. Equity.\n(v) During 2019, the Company entered into a loan agreement in the amount of $200,000 with Mark Allen. The note bears interest at an interest rate of 12% per annum and matures on June 30, 2021. At the maturity date, the note holder has the right to collect the principal plus interest or convert into 2,500,000 shares of common stock at $0.08 per share. In addition, upon conversion, the note holder will also receive 10,000,000 warrants at an exercise price of $0.10 per share, vesting immediately with a 36-month expiration period.\n(vi) On January 3, 2020, the Company entered into a loan agreement in the amount of $100,000 with Mark Allen. The note bears interest at an interest rate of $10% per annum and matures on June 1, 2020, with warrants to purchase 400,000 shares of common stock (the Loan Warrants), at an exercise price of $0.10 per share in Canadian dollars and expire on January 3, 2023. The fair value of issued warrants were recorded as a debt discount of $31,946 and monthly amortization of $1,775. On February 14, 2020, the Company entered into a loan agreement in the amount of $125,000 with Mark Allen. The note bears interest at an interest rate of 10% per annum and matures on June 1, 2020, with warrants to purchase 750,000 shares of common stock (the Loan Warrants), at an exercise price of $0.10 per share in Canadian dollars and expire on February 14, 2022. The fair value of issued warrants were recorded as a debt discount of $38,249 and monthly amortization of $1,903. On January 1, 2021, the Company entered into an amended loan agreement in the amount of $245,938, which combined the two previous loans, along with accrued interest. The note bears an interest rate of 9% and matures on June 30, 2021.\nThe following is a schedule of future minimum repayments of related party notes payable as of December 31, 2021:\nSCHEDULE OF FUTURE MINIMUM REPAYMENTS OF RELATED PARTY NOTES PAYABLE\n$ 779,373\nThereafter -\nTotal $ 779,373\nNOTE 8. DERIVATIVE FINANCIAL INSTRUMENTS\nOn May 18, 2018, as an inducement to enter into an Amended and Restated Loan Agreement, the Company issued, among other instruments, warrants to acquire 320,000 shares of common stock with an exercise price of $0.10 per share in Canadian dollars. The warrants are valued using the Black Scholes Option Pricing Model and the derivative is fair valued at the end of each reporting period. The Company valued the derivative liability at initial recognition as $30,012. These warrants expired on May 11, 2021.\nOn January 06, 2020, as an inducement to enter into a Loan Agreement, the Company issued, among other instruments, warrants to acquire 5,000,000 shares of common stock with an exercise price of $0.10 per share. The warrants are valued using the Black Scholes Option Pricing Model and the derivative is fair valued at the end of each reporting period. The Company valued the derivative liability at initial recognition as $144,259.\nOn October 30, 2020, as an inducement to extend the principal payment deadline from the previously issued Loan Agreement, the Company issued additional warrants to acquire 5,000,000 shares of common stock with an exercise price of $0.10 per share. The warrants are valued using the Black Scholes Option Pricing Model and the derivative is fair valued at the end of each reporting period. The Company valued the derivative liability at initial recognition as $95,352.\nA summary of the activity of the derivative liabilities is shown below:\nSCHEDULE OF DERIVATIVE LIABILITIES\nBalance, December 31, 2020 $ 183,798\nAdditions -\nFair value adjustments (161,244 )\nAs of December 31, 2021 $ 22,554\nDerivative liability classified warrants in the years ended December 31, 2021 were valued using the Black Scholes Option Pricing Model with the range of assumptions outlined below. Expected life was determined based on historical exercise data of the Company.\nSCHEDULE OF DERIVATIVE LIABILITY OF FAIR VALUE ASSUMPTION\nDecember 31, 2021\nRisk-free interest rate 0.39 %\nExpected life 1 year\nExpected dividend rate 0 %\nExpected volatility 365 %\nNOTE 9. ASSET RETIREMENT OBLIGATIONS\nThe Company has a number of oil and gas wells in production and will have AROs once the wells are permanently removed from service. The primary obligations involve the removal and disposal of surface equipment, plugging and abandoning the wells and site restoration.\nPetrolia Energy Corporation (Petrolia or the Company) is the operator of certain wells located in New Mexico, at the Twin Lakes San Andres Unit (TLSAU) Field. TLSAU is located 45 miles from Roswell, Chaves County, New Mexico.\nOn March 4, 2021, the Company received a letter from the Commissioner of Public Lands of the State of New Mexico, which was sent to us and certain other parties notifying such parties of certain non-compliance with the laws and regulations that it administers. The deficiencies are currently in the process of being settled by a third party agreeing to plug six wells, including at least two Company operated wells (TLSAU wells #316 and #037). The scope of the matter above included only 240 acres of the 640 acres of The New Mexico State Land Office (SLO) lease. The Commissioner of Public Lands of the State of New Mexico could still file suit and require the plugging and surface remediation of all wells in section 36.\nOn April 8, 2021, the State of New Mexico Energy, Minerals and Natural Resources Department Oil Conservation Division (OCD) sent the Company a Notice of Violation alleging that the Company was not in compliance with certain New Mexico Oil and Gas Act regulations (the NMAC), associated with required reporting, inactive wells and financial assurance requirements, plugging certain abandoned wells, providing required financial assurance in connection with plugging expenses, and proposing to assess certain civil penalties in the amount of an aggregate of approximately $35,100.\nAs previously reported and in Petrolias Form 8-K dated October 25, 2021 (reference to which is hereby made), on April 8, 2021, the State of New Mexico Energy, Minerals and Natural Resources Department, Oil Conservation Division (the OCD) issued a Notice of Violation (the NOV) to Petrolia alleging that the Company violated four regulations under Title 19, Chapter 15 of the New Mexico Administrative Code (the NMAC) by: (i) failing to file production reports for certain wells, (ii) exceeding the number of inactive wells allowed, (iii) failing to provide financial assurance in the amount required, and (iv) failing to provide additional financial assurance in the amount required.\nThe Company acknowledged the violations alleged in the NOV and requested an informal resolution. On December 30, 2021, to resolve this matter, Petrolia entered into a Stipulated Final Order ( the SFO) in Case No. 21982 with the OCD whereby Petrolia among other things agreed to: (i) submit appropriate forms for wells identified on the SFO Inactive Well List, (ii) plug the specific TLSAU wells listed in section 8 (c) and (d) of the SFO, as well as submit all required information and forms specified in the SFO, (iii) open an escrow account meeting the terms listed in the SFO, (iv) deposit funds into an escrow account within the timeframe described in the SFO, and (v) provide the OCD with a report proposing deadlines for bringing all remaining wells into compliance. The company recognized an additional liability of $792,000 to plug these wells.\nThe Company entered into a settlement agreement on July 27, 2020 with Moon Company, Trustee of the OBrien Mineral Trust pursuant to which nine leases totaling approximately 3,800 acres of the 4,880 acre Twin Lakes San Andres Unit were terminated as a part of the settlement agreement. Pursuant to this settlement agreement, the Company no longer has the right to produce oil, gas, or other hydrocarbons and any other minerals from the mineral estate encumbered by the leases and owned by the trustee of the OBrien Mineral Trust.\nAROs associated with the retirement of tangible long-lived assets are recognized as liabilities with an increase to the carrying amounts of the related long-lived assets in the period incurred. The fair value of AROs is recognized as of the acquisition date of the working interest. The cost of the tangible asset, including the asset retirement cost, is depleted over the life of the asset. AROs are recorded at estimated fair value, measured by reference to the expected future cash outflows required to satisfy the retirement obligations discounted at the Companys credit-adjusted risk-free interest rate. Accretion expense is recognized over time as the discounted liabilities are accreted to their expected settlement value. If estimated future costs of AROs change, an adjustment is recorded to both the ARO and the long-lived asset. Revisions to estimated AROs can result from changes in retirement cost estimates, revisions to estimated discount rates and changes in the estimated timing of abandonment.\nSCHEDULE OF FAIR VALUE OF ASSET RETIREMENT OBLIGATIONS\nDecember 31, 2021\nInflation rate 1.92 - 2.15 %\nEstimated asset life 12 - 22 years\nThe following table shows the change in the Companys ARO liability for the years ended December 31, 2021, and 2020:\nSCHEDULE OF ASSET RETIREMENT OBLIGATIONS\nCanadian properties United States properties Total\nAsset retirement obligations, December 31, 2019 $ 1,445,991 $ 277,373 1,723,364\nAcquisition of Canadian property - Utikuma 906,146 - 906,146\nPlugging liability at Twin Lakes - 606,109 606,109\nAccretion expense 259,016 28,742 287,758\nDisposition - - -\nForeign currency translation 100,756 - 100,756\nAsset retirement obligations, December 31, 2020 $ 2,711,909 $ 912,225 $ 3,624,133\nPlugging liability at Twin Lakes -\n152,000\n132,000\nAccretion expense 290,367 26,506 316,873\nDisposition (1,824,339 ) - (1,824,339 )\nForeign currency translation 8,360 - 8,360\nAsset retirement obligations, December 31, 2021 $ 1,186,297 $ 1,070,730 $ 2,257,027\nNOTE 10. EQUITY\nPreferred stock\nThe holders of Series A Preferred Stock are entitled to receive cumulative dividends at a rate of 9% per annum. The Preferred Stock will automatically convert into common stock when the Companys common stock market price equals or exceeds $0.28 per share for 30 consecutive days. At conversion, the value of each dollar of preferred stock (based on a $10 per share price) will convert into 7.1429 common shares (which results in a $0.14 per common share conversion rate).\nIn accordance with the terms of the Preferred Stock, cumulative dividends of $179,190 and $178,699 were declared for the year ended December 31, 2021, and December 31, 2020, respectively.\nThe holders of Series B Preferred Stock do not accrue dividends and have no conversion rights. For so long as any shares of Series B Preferred Stock remain issued and outstanding, the holders thereof, voting separately as a class, have the right to vote on all shareholder matters (including, but not limited to at every meeting of the stockholders of the Company and upon any action taken by stockholders of the Company with or without a meeting) equal to sixty percent (60%) of the total vote. No shares of Series B Preferred Stock held by any person who is not then a member of Board of Directors of the Company shall have any voting rights. For more information, see Form 8-K reference in the Exhibits section.\nThe holders of Series C Preferred Stock are entitled to receive cumulative dividends at a rate of 8% per annum. If any shares of Series C Preferred Stock remain outstanding as of December 31, 2023, the dividend rate will increase to 11% per annum. The Series B Preferred Stock will automatically convert into common stock upon any registered public offering of the Companys common stock. At conversion, the value of each dollar of Series C Preferred Stock (based on a $10 per share price) will convert into 100 common shares (which results in a $0.01 per common share conversion rate).\nIn accordance with the terms of the Series C Preferred Stock, cumulative dividends of $779 and $0 were declared for the year ended December 31, 2021, and December 31, 2020, respectively.\nCommon stock\nDuring the year ended December 31, 2019, the Company closed private placements for $0.08 per unit for a total of 1,875,000 units and gross proceeds of $150,000 (the 2019 Units). Each 2019 Unit was comprised of one common share and two warrants entitling the holder to exercise such warrant for one common share for a period of two years from the date of issuance. The warrants have exercise price of $0.10 per share. See additional description of the detail transactions concerning those warrants in Note 7: Related Party Transactions, below.\nOn July 23, 2019, director Joel Martin Oppenheim purchased additional 2019 private placements for $0.08 per unit for a total of 156,250 units with gross proceeds of $12,500. Each 2019 Unit was comprised of one common share and two warrants entitling the holder to exercise such warrant for one common share for a period of two years from the date of issuance. The warrants have exercise price of $0.10 per share. Consideration for the purchase was provided through a cash payment of $2,500 as well as the forgiving of an outstanding bridge loan of $10,000. These shares were not issued until January 2020.\nOn August 8, 2019, director Joel Martin Oppenheim exercised warrants to purchase 150,000 shares of common stock for cash proceeds of $15,000 at an exercise price of $0.10 per share. These shares were not issued until January 2020.\nOn August 14, 2019, director Joel Martin Oppenheim exercised warrants to purchase 10,000 shares of common stock for the exercise price of $1,000 or $0.10 per share. These shares were not issued until January 2020.\nDuring 2019, a Mark Allen exercised warrants to purchase 275,000 shares of common stock for cash proceeds of $26,875 at an average exercise price of $0.098 per share. These shares were not issued until January 2020.\nOn January 20, 2020, a related party, purchased 1 unit of the debt private placement with gross proceeds of $12,500. At maturity, the holder has the option to either collect the principal or convert the balance into shares/warrants. The conversion would be for 156,250 shares of common stock and warrants to purchase 312,500 shares of common stock at a price of $0.08 per unit. Jovian converted the debt into shares during 2020.\nOn February 29, 2020, the Company signed a consulting agreement with Mark Allen to provide Management services related to the SUDS field. The compensation related terms included the issuance of 250,000 shares of Common Stock. The shares were not issued and earned until December 15, 2020.\nOn September 1, 2020, the Company entered into an employment agreement with Mark Allen, to serve as President for a period of six months (with monthly extensions). The President was to be paid a salary of $15,000 a month. Also, the President was issued a signing bonus of 2,000,000 shares of common stock. One million (1,000,000) shares were to be issued upon signing and the remaining 1,000,000 shares are to be issued at the completion of a 6-month probationary period. In addition, the President was granted warrants to purchase 1,000,000 shares of common stock exercisable at $0.08 per share equally vesting over 24 months. The warrants expire in 36 months.\nOn December 15, 2020, President Mark Allen exercised warrants to purchase 1,650,000 shares of common stock for cash proceeds of $69,375 at an average exercise price of $0.04 per share.\nOn December 22, 2020, prior CFO Tariq Chaudhary was issued 500,000 shares of common stock. These shares were issued in exchange for Mr. Chaudhary releasing the Company of his remaining deferred outstanding salary balance of $77,500. The shares were issued at an average conversion price of $0.15 per share.\nOn January 25, 2021, the Company signed an Executive Salary Payable Agreement with Zel Khan as the Chief Executive Officer. All of Mr. Khans previous salary obligation was satisfied by the issuance of 1,992,272 shares of the Company on January 25, 2021.\nJoel Oppenheim, former Director, was issued 316,491 shares on January 25, 2021, pursuant to a Directors Fees Payable Agreement. The agreement stated that the shares were issued in full satisfaction of all outstanding director fees payable.\nPaul Deputy was reinstated Interim Chief Financial Officer and signed a Settlement and Mutual Release Agreement. In exchange for releasing the Company for any current, outstanding payroll and/or service-related liability on January 29, 2021, the Company agreed to pay Mr. Deputy $50,000, to be paid in $2,500 monthly increments, starting April 1, 2021. In addition, Mr. Deputy was issued 250,000 shares of Petrolia common stock on January 29, 2021. The shares were issued at the price on that date of $0.033. This created a gain of $134,270 that was recorded as additional paid in capital, due to the related party nature of the transaction.\nOn March 30, 2021, Mark Allen converted $30,000 of unpaid contract wages from early 2020 into 333,333 common shares of common stock. A conversion price of $0.09 per share was used to determine the number of shares.\nOn March 30, 2021, Mark Allen converted a defaulted secured loan of $135,000 and $9,888 of accrued interest as well as $135,000 of guaranteed return that was due on December 15, 2019. The conversion consisted of 5,400,000 shares of common stock and 5,400,000 warrants to purchase common stock. The warrants have a strike price of $0.08 per share and expire in 36 months.\nMore details on the transactions above can be found in Note 11. Related Party Transactions.\nThe common stock is currently not traded.\nWarrants\nContinuity of the Companys common stock purchase warrants issued and outstanding is as follows:\nSCHEDULE OF COMMON STOCK PURCHASE WARRANTS ISSUED AND OUTSTANDING\nWarrants Weighted average exercise price\nOutstanding at year ended December 31, 2019 57,043,836 $ 0.14\nGranted 18,650,000 0.15\nExercised (1,650,000 ) 0.08\nExpired (33,279,170 ) 0.19\nOutstanding at year ended December 31, 2020 40,764,666 $ 0.13\nGranted 9,400,000 0.09\nExpired (20,464,666 ) 0.11\nOutstanding at year ended December 31, 2021 29,700,000 0.13\nAs of December 31, 2021, the weighted-average remaining contractual life of warrants outstanding was 1.71 years (2020 - 1.39 years).\nAs of December 31, 2021, the intrinsic value of warrants outstanding is $0 (2020 - $0).\nThe table below summarizes warrant issuances during the years ended December 31, 2020, and 2020:\nSCHEDULE OF WARRANTS ISSUANCE DURING PERIOD\nYear ended\nDecember 31,\nWarrants granted:\nBoard of directors and advisory board service 3,000,000 5,250,000\nPursuant to employment agreements - 1,000,000\nPursuant to financing arrangements 1,000,000 1,000,000\nPursuant to consulting agreements - 250,000\nPursuant to loan agreements 5,400,000 11,150,000\nTotal 9,400,000 18,650,000\nWarrants granted in the years ended December 31, 2021, and 2020 were valued using the Black Scholes Option Pricing Model with the range of assumptions outlined below. Expected life was determined based on historical exercise data of the Company.\nSCHEDULE OF FAIR VALUE OF ASSUMPTION\nDecember 31, 2021 December 31, 2020\nRisk-free interest rate 0.16% to 0.97 % 1.65% to 2.38 %\nExpected life 2.0 - 3.0 years 1.0 - 3.0 years\nExpected dividend rate 0 % 0 %\nExpected volatility 277% to 356 % 240% - 274 %\nOn October 30, 2020, a third-party debtor was issued warrants to purchase 5,000,000 shares of common stock at an exercise price of $0.05 per share. The warrants have a 3-year expiration date. The warrants were issued in exchange of an agreement to extend a debt principal payment deadline. The fair value of the warrants is calculated using the Black Sholes Option Pricing Model and recorded as a debt discount. See Note 7 for more details.\nOn March 31, 2021, Mark Allen was issued warrants to purchase 5,400,000 shares of common stock at an exercise price of $0.08 per share. The warrants have a 3-year expiration date. The warrants were issued as part of an agreement releasing the company of an outstanding loan of $135,000 and outstanding guaranteed return on that loan. See Note 11 for more details.\nNOTE 11. RELATED PARTY TRANSACTIONS\nOn January 20, 2020, Jovian Petroleum, a related party, purchased 1 unit of the debt private placement with gross proceeds of $12,500. At maturity, the holder has the option to either collect the principal or convert the balance into shares/warrants. The conversion would be for 156,250 shares of common stock and warrants to purchase 312,500 shares of common stock at a price of $0.08 per unit. Jovian Petroleum converted the debt into shares during 2020.\nOn May 29, 2020, Petrolia Energy Corporation acquired a 50% working interest in approximately 28,000 net working interest acres located in the Utikuma Lake area in Alberta, Canada. The property is an oil-weighted asset currently producing approximately 525 bopd of light oil. The working interest was acquired from Blue Sky Resources Ltd. in an affiliated party transaction as Zel C. Khan, the Companys former Chief Executive Officer, is related to the ownership of Blue Sky. Blue Sky acquired a 100% working interest in the Canadian Property from Vermilion Energy Inc. via Vermilions subsidiary Vermilion Resources. The effective date of the acquisition was May 1, 2020. The total purchase price of the property was $2,000,000 (CAD), with $1,000,000 of that total due initially. The additional $1,000,000 was contingent on the future price of WTI crude. At the time WTI price exceeded $50/bbl, the Company would pay an additional $750,000. In addition, at the time WTI price exceeded $57/bbl the Company would pay an additional $250,000 (for a cumulative contingent total of $1,000,000). The price of WTI crude exceeded $50/bbl on January 6, 2021 and exceeded $57/bbl on February 8, 2021. The additional payments due were netted with the accounts receivable balance from previous Joint Interest Billing statements from BSR. The total $USD value of the addition was $787,250, using prevailing exchange rates on the respective dates. Included in the terms of the agreement, the Company also funded their portion of the Alberta Energy Regulator (AER) bond fund requirement ($602,423 USD), necessary for the wells to continue in production after the acquisition. Additional funds ($386,989 USD) remain in the other current asset balance for future payments to BSR, related to the acquisition.\nOn December 15, 2020, President Mark Allen exercised warrants to purchase 1,650,000 shares of common stock for cash proceeds of $69,375 at an average exercise price of $0.04 per share.\nOn August 21, 2019, Leo Womack, a related party, purchased 2 units of the debt private placement with gross proceeds of $25,000. At maturity, the holder has the option to either collect the principal or convert the balance into shares/warrants. The conversion would be for 312,500 shares of common stock and warrants to purchase 625,000 shares of common stock at a price of $0.08 per unit. The warrants fair value was determined to be $31,033 via the Black Sholes Option Pricing Model. Consideration for the purchase was provided though a cash payment and the conversion of the related partys prior notes payable and accrued payables.\nOn September 1, 2020, the Company entered into an employment agreement with Mark Allen, to serve as President for a period of six months (with monthly extensions). The President was to be paid a salary of $15,000 a month. Also, the President was issued a signing bonus of 2,000,000 shares of common stock. One million (1,000,000) shares were to be issued upon signing and the remaining 1,000,000 shares are to be issued at the completion of a 6-month probationary period. In addition, the President was granted warrants to purchase 1,000,000 shares of common stock exercisable at $0.08 per share equally vesting over 24 months. The warrants expire in 36 months.\nOn December 15, 2020, President Mark Allen exercised warrants to purchase 1,650,000 shares of common stock for cash proceeds of $69,375 at an average exercise price of $0.04 per share.\nOn December 15, 2020, in accordance with the Mark Allens Consulting agreement that was signed prior to the Employment agreement, the Company issued Mr. Allen 250,000 shares of common stock as part of the compensation terms of that agreement.\nOn December 22, 2020, prior CFO Tariq Chaudhary was issued 500,000 shares of common stock. These shares were issued in exchange for Mr. Chaudhary releasing the Company of his remaining deferred outstanding salary balance of $77,500. The shares were issued at an average conversion price of $0.15 per share.\nOn January 7, 2021, prior Board Member Joel Oppenheim was issued 316,491 shares of common stock. These shares were in exchange for Mr. Oppenheim releasing the Company of his remaining board compensation balance of $60,000. The shares were issued at the price on that date of $0.02. This created a gain of $53,670 that was recorded as additional paid in capital, due to the related party nature of the transaction.\nOn January 11, 2021, prior CEO Zel Khan was issued 1,992,272 shares of common stock. These shares were in exchange for Mr. Khan releasing the Company of his remaining deferred outstanding salary balance of $325,000. The shares were issued at the price on that date of $0.025. This created a gain of $275,193 that was recorded as additional paid in capital, due to the related party nature of the transaction.\nOn January 29, 2021, prior CFO Paul Deputy was reinstated as Interim Chief Financial Officer and signed an agreement that in exchange for 250,000 shares of common stock and 20 monthly payments of $2,500 starting in April 2021, he would release the Company of his remaining deferred outstanding salary balance of $192,520.04. The shares were issued at the price on that date of $0.033. This created a gain of $134,270 that was recorded as additional paid in capital, due to the related party nature of the transaction.\nOn March 30, 2021, President Mark Allen was issued 333,333 shares of common stock. A conversion price of $0.09 per share was used to determine the number of shares. These shares were in exchange for Mr. Allen releasing the company of an outstanding consulting fee balance of $30,000. The shares were issued at the price on that date of $0.033. This created a gain of $19,001 that was recorded as additional paid in capital, due to the related party nature of the transaction.\nOn March 31, 2021, President Mark Allen was issued 5,400,000 shares of common stock. These shares were in exchange for Mr. Allen releasing the company of an outstanding loan of $135,000 with $9,888 of accrued interest and outstanding guaranteed return on that loan of $135,000. The shares were issued at the price on that date of $0.033. In addition, the president was granted warrants to purchase 5,400,000 shares of common stock at $0.08, vesting immediately. The warrants expire in 36 months. The warrants were valued at $200,378 using the Black Sholes method. This created a loss of $98,690 that was recorded as a reduction to additional paid in capital, due to the related party nature of the transaction.\nOn August 21,2021, the Company signed a Letter Agreement to divest the Companys wholly owned Canada subsidiary, Petrolia Canada Corporation (PCC) and its assets in consideration for $6,500,000 in Canadian dollars (approximately $5,150,000 in U.S. dollars) less any contingent liabilities. The buyer is Blue Sky Resources Ltd. (Blue Sky), an affiliated party to Zel C. Khan, the Companys former Chief Executive Officer. Petrolia Canada Corporation assets include a 50% working interest in approximately 28,000 acres located in the Utikuma Lake area in Alberta, Canada, and 28% working interest in the Luseland, Hearts Hill, and Cuthbert fields located in Southwest Saskatchewan and Eastern Alberta. The Company received a non-refundable deposit of $200,000 CAD on August 31, 2021. The remaining payment schedule is as follows: $2,000,000 CAD on the Closing Date (scheduled for September 30, 2021), $1,000,000 CAD on October 31, 2021, less Petrolias contingent liabilities associated with the acquisition of Utikuma, and $3,300,000 CAD on December 31, 2021. See Form 8-K reference in Exhibits section. This transaction did not close, and the $200,000 CAD was added to other payables due to Blue Sky Petroleum in the fourth quarter of 2021.\nOn October 25, 2021, Petrolia Energy Corporation issued one share of its newly designated shares of Series B Preferred Stock to each of the three members of its then Board of Directors, (1) James E. Burns, (2) Leo Womack and (3) Ivar Siem, in consideration for services rendered to the Company as members of the Board of Directors. Such shares of Series B Preferred Stock vote in aggregate sixty percent (60%) of the total vote on all shareholder matters, voting separately as a class. This stock was valued by and independent party at $50,799 per share. For further information, see Form 8-K reference in Exhibits section.\nIn October and November of 2021, Board Member Leo Womack purchased an aggregate of 2,500 shares of Series C Preferred Stock for cash of $25,000.\nNOTE 12. COMMITMENTS AND CONTINGENCIES\nEnvironmental Matters - The Company, as a lessee of oil and gas properties, is subject to various federal, provincial, state and local laws and regulations relating to discharge of materials into, and protection of, the environment. These laws and regulations may, among other things, impose liability on the lessee under an oil and gas lease for the cost of pollution clean-up resulting from operations and subject the lessee to liability for pollution damages. In some instances, the Company may be directed to suspend or cease operations in the affected area. There can be no assurance, however, that current regulatory requirements will not change, or past noncompliance with environmental laws will not be discovered on the Companys properties.\nOffice Lease - On December 31, 2020, the Company terminated its one annually renewable office lease in Houston with minimum contractual lease payments of $1,500 per month.\nAs mentioned in Note 6, the Company holds a lease for acreage at SUDS Field from Joel Oppenheim. On November 4, 2022, this property was acquired by Flying M. Real Estate, and a new lease was signed by Petrolia Energy.\nNOTE 13. INCOME TAXES\nThere was no provision for income taxes for 2021 and 2020 due to net operating losses and loss carry forwards and doubt as to the entitys ability to continue as a going concern resulting in a 100% valuation allowance. Years from 2016 forward are open to examination by tax authorities in the United States. Years from 2019 forward are open to examination by Canadian tax authorities.\nThe provision for income taxes differs from the amount computed by applying the federal statutory income tax rate of 21% (2019 - 21%) on operations due primarily to permanent differences attributable to organizational expenses.\nSCHEDULE OF INCOME TAX EXPENSES\nFiscal Year Ended\nDecember 31, 2021 Fiscal Year Ended\nDecember 31, 2020\nIncome tax (benefit) expense computed at statutory rates $ 405,000\n$ (2,078,000 )\nNon-deductible items 49,000\n85,000\nChange in statutory, foreign tax, foreign exchange rates and other (559,000\n) (2,427,000 )\nChange in valuation allowance (105,000\n) 4,420,000\nTotal $ - $ -\nThe significant components of the net deferred tax asset were as follows:\nSCHEDULE OF DEFERRED TAX ASSETS\nDecember 31,\nDeferred tax assets\nNet operating loss carryforwards $ 6,038,000\n$ 5,772,000\nAsset retirement obligation 498,000\n679,000\nOil and gas properties (593,000\n) (644,000 )\nProperty and equipment -\n6,000\nOther - -\nTotal deferred tax assets (liabilities) 5,943,000\n5,813,000\nLess: Valuation allowance (5,943,000\n) (5,813,000 )\nNet deferred tax assets (liabilities) $ - $ -\nA valuation allowance has been established to offset deferred tax assets. The Companys accumulated net operating losses in the United States were approximately $2.2 million on December 31, 2021 and begin to expire if not utilized beginning in the year 2033. The Companys accumulated non-capital tax losses in Canada were approximately $27.5 million on December 31, 2021 and will expire in 2039. The Tax Cuts and Jobs Act was signed into law on December 22, 2017 and reduced the corporate income tax rate from 34% to 21%. The Companys deferred tax assets, liabilities, and valuation allowance have been adjusted to reflect the impact of the new tax law.\nNOTE 14. SEGMENT REPORTING\nThe Company has a single reportable operating segment, Oil and Gas Exploration and Production, which includes exploration, development, and production of current and potential oil and gas properties. Results of operations from producing activities were as follows for the years ended December 31, 2021 and 2020:\nSCHEDULE OF LONG-LIVED ASSETS\nCanada United States Total\nYear ended December 31, 2020\nRevenue $ 2,860,324 $ 31,917 $ 2,892,241\nProduction costs (3,377,055 ) (253,552 ) (3,630,607 )\nDepreciation, depletion, amortization and accretion (1,374,611 ) (60,429 ) (1,435,040 )\nResults of operations from producing activities $ (1,891,342 ) $ (282,064 ) $ (2,173,406 )\nTotal long-lived assets $ 1,683,055 $ 4,767,628 $ 5,952,083\nYear ended December 31, 2021\nRevenue $ 5,882,499 $ 12,729 $ 5,895,228\nProduction costs (5,281,740 ) (65,750 ) (5,347,490 )\nDepreciation, depletion, amortization and accretion (668,672 ) (51,346 ) (720,018 )\nResults of operations from producing activities $ (67,913 ) $ (104,367 ) $ (172,280 )\nTotal long-lived assets $ 2,104,993 $ 4,244,189 $ 6,349,182\nThe Companys revenues are derived from the following major customers:\nSCHEDULE OF REVENUES\nDecember 31,\nDecember 31,\nCustomer A $ 796,176 $ 2,860,324\nCustomer B 12,729 31,917\nCustomer C 5,086,323 -\nTotal revenues $ 5,895,228 $ 2,892,241\nNOTE 15. SUPPLEMENTAL INFORMATION RELATING TO OIL AND GAS PRODUCING ACTIVITIES (UNAUDITED)\nCosts Incurred in Oil and Gas Property Acquisition, Exploration and Development\nAmounts reported as costs incurred include both capitalized costs and costs charged to expense during the year for oil and gas property acquisition, exploration and development activities. Costs incurred also include new ARO established in the current year, as well as increases or decreases to the ARO resulting from changes to cost estimates during the year. Exploration costs presented below include the costs of drilling and equipping successful exploration wells, as well as dry hole costs, leasehold impairments, geological and geophysical expenses, and the costs of retaining undeveloped leaseholds. Development costs include the costs of drilling and equipping development wells, and construction of related production facilities.\nIn 2020, the Company purchased 50% working interest in the Utikuma field in Alberta, Canada for an aggregate purchase price of $678,765. In connection with the acquisition, Company recognized an asset retirement obligation of $906,146. An additional $1,000,000 CAD was contingent on the future price of WTI crude. At the time WTI price exceeded $50/bbl, the Company would pay an additional $750,000 CAD. In addition, at the time WTI price exceeded $57/bbl the Company would pay an additional $250,000 CAD (for a cumulative contingent total of $1,000,000 CAD). The price of WTI crude exceeded $50/bbl on January 6, 2021 and exceeded $57/bbl on February 8, 2021. The additional payments due were netted with the accounts receivable balance from previous Joint Interest Billing statements from BSR. The total $USD value of the addition was $787,250, using prevailing exchange rates on the respective dates.\nSCHEDULE OF COSTS INCURRED IN OIL AND GAS PROPERTY ACQUISITION, EXPLORATION AND DEVELOPMENT\nFiscal Year Ended\nDecember 31,\nFiscal Year Ended\nDecember 31,\nProperty acquisitions $ 787,250 $ 678,765\nUnevaluated - -\nEvaluated - -\nExploration - -\nDevelopment - -\nTotal costs incurred $ 787,250 $ 678,765\nCapitalized costs\nCapitalized costs include the cost of properties, equipment and facilities for oil and natural-gas producing activities, excluding any asset retirement obligations. Capitalized costs for proved properties include costs for oil and natural-gas leaseholds where proved reserves have been identified, development wells, and related equipment and facilities, including development wells in progress. Capitalized costs for unproved properties include costs for acquiring oil and gas leaseholds and geological and geophysical expenses where no proved reserves have been identified.\nSCHEDULE OF CAPITALIZED COSTS IN OIL AND GAS PROPERTY ACQUISITION, EXPLORATION AND DEVELOPMENT\nDecember 31,\nDecember 31,\nCapitalized costs:\nUnevaluated properties $ - $ -\nEvaluated properties 5,511,480 6,456,367\nGross capitalized costs 5,511,480 6,456,367\nLess: Accumulated DD&A (448,960 ) (2,693,300 )\nNet capitalized costs $ 5,062,520 $ 3,763,067\nOil and Gas Reserve Information\nMKM Engineering (MKM), an independent engineering firm, prepared the estimates of the proved reserves, future production, and income attributable to the Chaves County, New Mexico and Creek County, Oklahoma and Canadian property leasehold interests as of December 31, 2021 and the estimates of the proved reserves, future production, and income attributable to the Milam County, Texas, Chaves County, New Mexico and Creek County, Oklahoma leasehold interests as of December 31, 2020. The estimated proved net recoverable reserves presented below include only those quantities that were expected to be commercially recoverable at prices and costs in effect at the balance sheet dates under the then existing regulatory practices and with conventional equipment and operating methods. Proved Developed Reserves represent only those reserves estimated to be recovered through existing wells. Proved Undeveloped Reserves include those reserves that may be recovered from new wells on undrilled acreage or from existing wells on which a relatively major expenditure for recompletion or secondary recovery operations is required. All of the Companys Proved Reserves are located onshore in the continental United States of America and Canada.\nDiscounted future cash flow estimates like those shown below are not intended to represent estimates of the fair value of oil and gas properties. Estimates of fair value should also consider unproved reserves, anticipated future oil and gas prices, interest rates, changes in development and production costs and risks associated with future production. Because of these and other considerations, any estimate of fair value is subjective and imprecise.\nThe following table sets forth estimates of the proved oil and gas reserves (net of royalty interests) for the Company and changes therein, for the periods indicated.\nSCHEDULE OF PROVED OIL AND GAS RESERVES\nOil (Bbls)\nDecember 31, 2019 1,800,457\nRevisions of prior estimates (860,450 )\nPurchases of reserves in place 466,800\nDisposition of mineral in place -\nProduction (95,135 )\nDecember 31, 2020 1,311,672\nRevisions of prior estimates 292,335\nPurchases of reserves in place -\nDisposition of mineral in place (57,070 )\nProduction (97,084 )\nDecember 31, 2021 1,449,853\nSCHEDULE OF PROVED DEVELOPMENT AND UNDEVELOPED RESERVES\nDecember 31,\nDecember 31,\nEstimated quantities of proved developed reserves - Oil (Bbls) 1,449,853 1,245,512\nEstimated quantities of proved undeveloped reserves - Oil (Bbls) - 66,160\nProved developed and proved undeveloped reserves increased from December 31, 2020 to December 31, 2021, primarily due the revision of prior estimates, partially offset by the disposition of the CONA asset.\nThe following table sets forth estimates of the proved developed and proved undeveloped oil and gas reserves (net of royalty interests) for the Company and changes therein, for the period indicates.\nProved developed producing and non-producing reserve Oil (bbls)\nDecember 31, 2020 1,245,512\nAcquired reserves -\nDisposition of reserves -\nRevision of prior estimates 301,425\nProduction (97,084 )\nDecember 31, 2021 1,449,853\nProved undeveloped reserves Oil (bbls)\nDecember 31, 2020 66,160\nDisposition of reserves (66,160 )\nRevisions to prior estimates -\nDecember 31, 2021 -\nStandardized Measure of Discounted Future Net Cash Flows\nThe Standardized Measure related to proved oil and gas reserves is summarized below. Future cash inflows were computed by applying a twelve-month average of the first day of the month prices to estimated future production, less estimated future expenditures (based on year end costs) to be incurred in developing and producing the proved reserves, less estimated future income tax expense. Future income tax expenses are calculated by applying appropriate year-end tax rates to future pretax net cash flows, less the tax basis of properties involved. Future net cash flows are discounted at a rate of 10% annually to derive the standardized measure of discounted future net cash flows. This calculation procedure does not necessarily result in an estimate of the fair market value or the present value of the Company.\nStandardized Measure of Oil and Gas\nThe following table sets forth the changes in standardized measure of discounted future net cash flows relating to proved oil and gas reserves for the periods indicated.\nSCHEDULE OF STANDARDIZED MEASURE OF DISCOUNTED FUTURE NET CASH FLOWS\nDecember 31,\nDecember 31,\nFuture cash inflows $ 93,082,624 $ 47,647,500\nFuture production costs (45,892,778 ) (25,203,830 )\nFuture development costs (1,867,485 ) (2,148,510 )\nFuture income taxes - -\nFuture net cash flows 45,322,361 20,295,160\nDiscount of future net cash flows at 10% per annum 27,929,984 ) (12,339,240 )\nStandardized measure of discounted future net cash flows $ 17,392,377 $ 7,956,920\nChanges in standardized measure of discounted future cash flows\nSCHEDULE OF CHANGES IN STANDARDIZED MEASURE OF DISCOUNTED FUTURE CASH FLOWS\nDecember 31,\nDecember 31,\nBeginning of year $ 7,956,920 $ 25,824,730\nSales and transfers of oil & gas produced, net of production costs (539,927\n) (735,300 )\nNet changes in prices and production costs (865,805\n) (249,508\nChanges in estimated future development costs (565,870\n) 96,780\nAcquisitions/dispositions of minerals in place, net of production costs (231,470 ) -\nRevision of previous estimates 1,194,016\n(14,938,598 )\nChange in discount - 436,490\nChange in production rate or other 10,444,513 (2,477,674 )\nEnd of year $ 17,392,377 $ 7,956,920\nNOTE 16. SUBSEQUENT EVENTS\nOn February 16, 2022, the Company entered into both a Purchase and Sale Agreement and a Debt Settlement Agreement with Prospera Energy, effective as of October 1, 2021. Prospera agreed to purchase the Companys twenty-eight percent (28%) working interest in the Cuthbert, Luseland and Heart Hills assets in Saskatchewan and Alberta. Under these agreements Prospera will forgive $1,720,613 CAD in accounts payable from the Company, arising from joint interest billings. Prospera will also issue a $510,000 CAD convertible debenture to Petrolia Canada, which can be converted to common share units. Lastly, Prospera will pay the Company $75,000 CAD in five equal installments. See Form 8-K reference in Exhibits section below.\nOn March 11, 2022, the Company filed a lawsuit in Harris County Texas against Jovian Petroleum Corporation, Zel Khan and Quinten Beasley. The lawsuit claims fraud and breach of contract against all named defendants, as well as breach of fiduciary duty claims against Zel Khan and Quinten Beasley. Petrolia and Petrolia Canada are demanding a jury trial and are seeking monetary relief of more than $1 million against the Defendants. In September 2022, Defendants filed an amended answer and counterclaims. Defendants are seeking indemnification under the Companys governing documents and statutory provisions. Beasley is also seeking repayment of the outstanding balance of $5,000 plus accrued interest in connection with a promissory note entered into with the Company on July 14, 2016. On October 11, 2022, Petrolia and Petrolia Canada filed a general denial of all of the Defendants counterclaims. The outcome of the above litigation is currently unknown; however, the Company disputes the Defendants counterclaims and intends to defend the matter vigorously, while also continuing to seek all damages which it is due. See Form 8-K(s) referenced in Exhibits section below.\nOn March 16, 2022, Petrolia Canada Corporation received a Notice of Intention to Retain Collateral Pursuant to Section 62 of the Personal Property Security Act (Alberta) from the counsel of Blue Sky Resources Ltd. related to a Loan Agreement and General Security Agreement between Petrolia Canada Corporation and Emmett Lescroart. Petrolia Canada Corporation was notified that Blue Sky Resources Ltd., as assignee of the Emmet Lescroart loan, intends to retain the Utikuma loan collateral pursuant to the General Security Agreement with Petrolia Canada Corporation. On March 30, 2022, Petrolia Canada Corporations counsel responded to Blue Sky Resources, Ltd. with a Notice of Objection.\nOn January 28, 2022, the Securities and Exchange Commission filed an Order Instituting Administrative Proceedings and Notice of Hearing Pursuant to Section 12(j) of the Securities Exchange Act of 1934 to suspend for a period not exceeding twelve months or revoke the registration of each class of securities registered pursuant to Section 12 of the Exchange Act of the Company. The Division of Enforcement at the Securities and Exchange Commission (the Division) filed a Motion for Summary Disposition in this matter and the Company filed a Response to the Motion for Summary Disposition in April 2022. On May 5, 2022, the Division filed its Response in Support of its Motion for Summary Disposition.\nOn June 13, 2022, a Letter Agreement was signed between Blue Sky Resources Ltd. (BSR) and Petrolia Energy Corporation whereby Petrolia Canada Corporation (PCC) will sell to Blue Sky Resources its 50% working interest in the Utikuma Lake oil field. See Form 8-K reference in Exhibits section below.\nEffective June 15, 2022, Heather Monk was promoted from Corporate Controller to Interim Chief Financial Officer.\nOn September 27, 2022, the Financial Industry Regulatory Authority (FINRA) pulled the Companys stock symbol due to inactivity in the Companys security for a year. The Company is taking steps to become current in its filings with the Securities and Exchange Commission and upon becoming current in its filings with the Securities and Exchange Commission, it plans to engage a market maker to file a Form 15c2-11 with FINRA and obtain a stock symbol.\nOn November 4, 2022, the acreage at SUDS Field was acquired by Flying M. Real Estate, and Petrolia signed a new lease."
}